{
  "id": "3d5d9e99-24dd-46d1-b1d2-e10d9dba61c8",
  "title": "The Disputed U.S. Presidential Election of 1876",
  "link": "http://www.historyisnowmagazine.com/blog/2024/10/25/the-disputed-us-presidential-election-of-1876",
  "description": "The 1876 U.S. presidential election is one of the most contentious and controversial elections in American history. This election has a fraught legacy: After months of bitter fighting, lawmakers made a fateful compromise to put one man in office by effectively ending Reconstruction, leading to a century of intensified racial segregation in the South. It involved a dispute over electoral votes that was eventually resolved through a political compromise.  It was not our country’s finest moment.Lloyd W. Klein explains. Rutherford B. Hayes. The CandidatesThe candidates were a reform-minded Democrat and a Reconstructionist Republican. Rutherford B. Hayes was the governor of Ohio and was the Republican candidate. His campaign focused on reform and a commitment to civil rights, particularly for African Americans in the South. Before the war he had been a Cincinnati lawyer and abolitionist. He ran against Samuel J. Tilden the governor of New York, the Democratic candidate. He was known for his efforts in fighting corruption, particularly in New York City’s Tammany Hall. Tilden had been a War Democrat who opposed slavery; Tilden opposed Abraham Lincoln in the 1860 presidential election but later supported him and the Union during the Civil War.The Democratic VP candidate was William A Wheeler, a man about whom Hayes had recently said, “I am ashamed to say: who is Wheeler?\" He was a congressman from New York whose opposition was even less prominent. Wheeler was nominated because he was popular among his colleagues and had worked to avoid making enemies in Congress. In addition, he provided geographical balance to the ticket.The Republican VP candidate was Thomas A Hendricks, the Governor of Indiana and a former US Senator and congressman. Hendricks’s record consisted of challenging the military draft and issuing greenbacks; however, he supported the Union and prosecution of the war, consistently voting in favor of wartime appropriations. Hendricks adamantly opposed Radical Reconstruction. After the war he argued that the Southern states had never been out of the Union and were therefore entitled to representation in the U.S. Congress. Hendricks also maintained that Congress had no authority over the affairs of state governments.It was widely expected that Tilden and the Democrats would ride a popular wave into office after 16 years of Republicans and the scandals of President Grant’s administration.Only one of these candidates had had a successful military experience in the war. Hayes, a lawyer, businessman, and abolitionist, was a war hero who went on to serve in Congress and later as Ohio’s governor, where he championed African American suffrage, Hayes was wounded five times, most seriously at the Battle of South Mountain in 1862. He earned a reputation for bravery in combat, rising in the ranks to serve as brevet major general. He was a lawyer from Cincinnati (educated at Kenyon College and Harvard) with no formal military training. After the war had returned to politics. He had displayed great courage in the Kanawha Division, working under George Crook and David Hunter.He was not the only potential candidate with a war background. William T Sherman was the commander of the Army but had no interest whatsoever. Grant had intentionally given Winfield Scott Hancock, a Democrat, obscure assignments away from the South.  He did receive some votes in the convention in 1876 for the nomination but 1880 would be his real attempt for the office. It was widely assumed during 1875 that incumbent President Ulysses S. Grant would run for a third term as president despite the poor economic conditions, the numerous political scandals that had developed since he assumed office in 1869, and a longstanding tradition set by George Washington not to stay in office for more than two terms. Grant's inner circle advised him to run for a third term and he almost did so, but on December 15, 1875, the House, by a sweeping 233–18 vote, passed a resolution declaring that the two-term tradition was to prevent a dictatorship.The initial favorite in 1876 was James G Blaine of Maine. He had the lead in delegates but was 100 votes short of the majority, as the southern states would not support his views. Hayes won the nomination by appealing in a conciliatory manner to the Southern Republicans, which left Frederick Douglass confused about whether the new black southern vote was wanted. The Election CampaignsIn 1876 it was the tradition that the candidates did not campaign, and their surrogates made their cases locally. The Republicans expected to lose. The poor economic conditions made the party in power unpopular. Both candidates concentrated on the swing states of New York and Indiana, as well as the three southern states—Louisiana, South Carolina, and Florida—where Reconstruction Republican governments still barely ruled, amid recurring political violence, including widespread efforts to suppress freedman voting. Democrats, whose voter base resided in the former Confederacy, had been partly shut out of the political sphere; now, with Republican Ulysses S. Grant facing charges of corruption, Tilden’s reform-minded candidacy seemed like a well-timed opportunity for Democrats to regain political power.The Republican outlook was indeed bleak. Hayes was a virtual unknown outside his home state of Ohio. Henry Adams called Hayes \"a third-rate nonentity whose only recommendations are that he is obnoxious to no one\". Hayes’s most important asset was his help to the Republican ticket in carrying Ohio, a crucial swing state. For the Democrats, the newspaperman John D. Defrees described Tilden as \"a very nice, prim, little, withered-up, fidgety old bachelor, about one-hundred and twenty-pounds avoirdupois, who never had a genuine impulse for many nor any affection for woman\".The Democratic strategy for victory in the South relied on paramilitary groups such as the Red Shirts and the White League. These groups saw themselves as the military wing of the Democrats. Using the strategy of the Mississippi Plan, they actively suppressed both black and white Republican voting. They violently disrupted meetings and rallies, attacked party organizers, and threatened potential voters with retaliation for voting Republican.During the election of 1876, Southern Democrats who supported Wade Hampton for governor used mob violence to attack and intimidate African American voters in Charleston. Republican Governor Daniel Henry Chamberlain appealed to President Grant for military assistance. In October 1876, Grant, after issuing a proclamation, instructed Sherman to gather all available Atlantic region troops and dispatch them to South Carolina to stop the mob violence.It’s a cliché to say that in America, race is always on the ballot. But in 1876, it was probably the central issue.  The election process in Southern states was rife with voter fraud—on the part of both parties—and marked by violent voter suppression against black Americans. Under Reconstruction, African Americans had achieved unprecedented political power, and new federal legislation sought to provide a modicum of economic equality for newly enfranchised people. In response, white Southerners rebelled against African Americans’ newfound power and sought to intimate and disenfranchise black voters through violence.Voter suppression was rampant in the post-Confederacy South. Many historians argue that if votes had been counted accurately and fairly in Southern states, Hayes might have won the 1876 election outright. “[I]f you had a fair election in the south, a peaceful election, there’s no question that the Republican Hayes would have won a totally legitimate and indisputable victory,” wrote Eric Foner.  Election NightOn election night, Hayes was losing so badly that he prepared his concession speech before turning in for the night. His party chairman went to bed with a bottle of whiskey. “We soon fell into a refreshing sleep,” Hayes later wrote in his diary about the events of November 7, 1876. “[T]he affair seemed over.”But after four months of fierce debate and negotiations, Hayes would be sworn into office as 19th president of the United States. Historians often describe his narrow, controversial win over Democrat Samuel J. Tilden as one of the most bitterly contested presidential elections in history.Just a few days following the election, Tilden appeared poised to narrowly clinch the election. He had captured 51.5 percent of the popular vote to Hayes’s 48 percent, a margin of about 250,000 votes. But Tilden had amassed only 184 electoral votes—one shy of the number needed to reach the 185 electoral votes necessary for the presidency. Hayes, meanwhile, had 165. Election returns from three Republican-controlled Southern states—Louisiana, Florida and South Carolina—were divided, with both sides declaring victory. Together, the states represented a total of 19 electoral votes, which along with one disputed elector from Oregon would be enough to swing the election Hayes’s way.Hayes’ proponents realized that those contested votes could sway the election. They seized the uncertainty of the moment, encouraging Republican leaders in the three states to stall, and argued that if black voters hadn’t been intimidated away from the polls—and if voter fraud hadn’t been as rampant—Hayes would have won the contested states. With a Republican-controlled Senate, a Democrat-control The Disputed ElectionAt the end of election day, no clear winner emerged because the outcomes in South Carolina, Florida, and Louisiana were unclear. Both parties claimed victory in those states, but Republican-controlled “returning” boards would determine the official electoral votes.  “The elections in three states—Florida, Louisiana, and South Carolina—were alleged to have been conducted illegally,” the senators of those states wrote in a statement.“Republicans and Democrats rushed to those three states to watch and try to influence the counting of the votes. The returning boards determined which votes to count and could throw out votes, if they deemed them fraudulent. The returning boards in all three states argued that fraud, intimidation, and violence in certain districts invalidated votes, and they threw out enough Democratic votes for Hayes to win. All three returning boards awarded their states’ electoral votes to Hayes.Meanwhile in Oregon, a strange development added that state to the uncertain mix. Hayes won the state, but one of the Republican electors, John W. Watts, was also postmaster, and the US Constitution forbids federal officeholders from being electors. Watts planned to resign from his position in order to be a Republican elector, but the governor of Oregon who was a Democrat, disqualified Watts and instead certified a Tilden elector.The U.S. Constitution provided no way of resolving the dispute, and now Congress would have to decide. As Democrats controlled the House of Representatives, and Republicans dominated in the Senate, the two sides compromised by creating a bipartisan electoral commission with five representatives, five senators and five Supreme Court justices.Electors cast their ballots in state capitals on December 6, 1876. Generally, the process went smoothly but in four capitals—Salem, Oregon; Columbia, South Carolina; Tallahassee, Florida; and New Orleans, Louisiana—two sets of conflicting electors met and voted so that the US Congress received two sets of conflicting electoral votes. At this point, Tilden had 184 electoral votes while Hayes had 165 with 20 votes still disputed.When the Electoral College does not give a majority to a candidate, such as ties or when there are uncertain electors involved, they are called contingent elections. An example of a tie was the 1800 election, and it required a compromise for Jefferson to be president over Burr. After that, a legal remedy was agreed on. Another contingent election was in 1824 when John Quincy Adams was ultimately elected over Andrew Jackson, a result that was reversed in 1828.Why wasn’t the election resolved in the states, like they are supposed to be? The Constitution outlines what is supposed to happen in these situations, but it didn’t actually happen in 1876.That year the contingent election system was bypassed when there was a contested outcome. At the height of Reconstruction, the issue was not that no candidate got a majority in the Electoral College, but rather that the three Southern states – Florida, Louisiana and South Carolina – sent multiple slates of electoral votes to Washington, DC, after the state elections were disputed. And in Oregon, there was a dispute over one elector. The question was which were the legitimate sets of electors.The Constitution stipulates that the electoral votes be directed to the President of the Senate, who was Republican Thomas W. Ferry. Although Republicans argued that he had the right to decide which votes to count, Democrats disagreed and argued that the Democratic majority in Congress should decide.  The Compromise of 1877A compromise was reached. In an unprecedented move, Congress decided to create an extralegal “Election Commission.  Congress created a special bipartisan commission, to determine which candidate should get the 20 disputed electoral votes. So on January 29, 1877, the Electoral Commission Act established a commission of five senators (three Republicans, two Democrats), five representatives (three Democrats, two Republicans), and five Supreme Court justices (two Republicans, two Democrats, and one independent) to decide which votes to count and resolve the dispute. However, the independent Supreme Court justice refused to serve on the commission and was replaced by a Republican justice.In the disputed Presidential election of 1876 between the Republican Rutherford Hayes and the Democrat Samuel Tilden, Congress created a special Electoral Commission to decide to whom to award a total of 20 electoral votes which were disputed from the states of Florida, Louisiana, South Carolina and Oregon. The Commission was to be composed of 15 members: five drawn from the U.S. House of Representatives, five from the U.S. Senate, and five from the U.S. Supreme Court. The majority party in each legislative chamber would get three seats on the Commission, and the minority party would get two. Both parties agreed to this arrangement because it was understood that the Commission would have seven Republicans, seven Democrats, and one independent.Obviously that independent would be the one to decide. Both parties wanted the same man: Justice David Davis, a friend and former colleague of Abraham Lincoln. Judge Davis was a brilliant and ethical man, and was reputed as such in his lifetime. This episode proves it beyond any doubt, and exactly why few know about it is astounding. Davis, who was the most trusted independent in the nation. According to one historian, \"No one, perhaps not even Davis himself, knew which presidential candidate he preferred.\" Just as the Electoral Commission Bill was passing Congress, the legislature of Illinois elected Davis to the Senate. Democrats in the Illinois Legislature believed that they had purchased Davis's support by voting for him. However, they had made a miscalculation; instead of staying on the Supreme Court so that he could serve on the Commission, he promptly resigned as a Justice, in order to take his Senate seat. His replacement, a Republican, voted for Hayes.In late January, the commission voted 8-7 along party lines that Hayes had won all the contested states, and therefore the presidency, by just one electoral vote. They ultimately gave the votes to Republican Rutherford B. Hayes even though Democrat Samuel Tilden got more popular votes.  With 185 votes to Tilden's 184, Hayes was declared the winner two days before he was inaugurated.And just exactly how was this decision reached? Tilden and the Democrats gave up the election, which in all fairness, they probably did win because they got something in return. Disputed returns and secret back-room negotiations put Republican Rutherford B. Hayes in the White House. The commission voted 8 to 7 to award the electoral votes from South Carolina, Florida, and Louisiana (and one from Oregon) to Hayes.  But that was not the end of the election. What Happened Behind Closed DoorsDemocratic members of Congress threatened to prevent the count of electoral votes and delay the resolution of the election with frequent adjournments and filibusters. With the threat of delay, Democrats hoped to win some concessions from Republicans. Furious Democrats refused to accept the ruling of the special commission and threatened a filibuster. So, in long meetings behind closed doors, Democrats and Hayes’ Republican allies hashed out what came to be known as the Compromise of 1877: also known as the Wormley Agreement, the Bargain of 1877, or the Corrupt Bargain: an informal but binding agreement.Finally, just after 4 a.m. on March 2, 1877, the Senate president declared Hayes the president-elect of the United States. Hayes—dubbed “His Fraudulency” by a bitter Democratic press—would be publicly inaugurated just two days later.A secret backroom deal decided the election. The negotiations put Republican Rutherford B. Hayes in the White House—and Democrats back in control of the South. Hayes would become president on the condition that he ended Reconstruction in the South. Hayes secured his win by agreeing to end Reconstruction. he filibuster of the certified results and the threat of political violence in exchange for an end to federal Reconstruction. Two issues interested Democrats—restoring their control of governments, and thus white supremacy, in the South (and removing the last of the federal troops) and a federal subsidy for railroads. However, it is doubtful that Hayes, his supporters, and Democrats reached any sort of deal beyond what Hayes promised to do in his letter of acceptance. Samuel J. Randall, the Democratic Speaker of the House, realizing that creating chaos would backfire on the Democrats, finally ruled the filibusterers out of order and forced the completion of the count in the early hours of March 2, 1877.In fact, even as the electoral commission deliberated, national party leaders had been meeting in secret to hash out what would become known as the Compromise of 1877. Hayes agreed to cede control of the South to Democratic governments and back away from attempts at federal intervention in the region, as well as place a Southerner in his cabinet. In return, Democrats would not dispute Hayes’s election, and agreed to respect the civil rights of Black citizens. Just two months after his inauguration, Hayes made good on his compromise and ordered the removal of the last federal troops from Louisiana. These troops had been in place since the end of the Civil War and had helped enforce the civil and legal rights of many formerly enslaved individuals.The disputed 1876 presidential election resulted in a compromise in which Republican Rutherford B. Hayes became president in exchange for the withdrawal of federal troops from the South. This effectively ended Reconstruction. Southern white Democrats, known as \"Redeemers,\" regained control of state governments. They systematically dismantled Reconstruction-era reforms and restored white supremacy through laws, violence, and intimidation. The late 19th and early 20th centuries saw the establishment of Jim Crow laws, which enforced racial segregation and disenfranchised African Americans. These laws undid many of the advances made during Reconstruction. In conclusion, while the Radical Republicans initially succeeded in imposing their Reconstruction policies, their gains were largely undone by the end of the 19th century, leading to nearly a century of segregation and disenfranchisement for African Americans in the South.More stringent enforcement and a more robust federal military presence and oversight in the South could have provided more protection for African Americans and ensured the implementation of Reconstruction policies. This would have helped prevent the rise of white supremacist groups and the rollback of civil rights gains. I don’t think extending the occupation past 1876 would have; however, the damage was done. With this deal, Hayes ended the Reconstruction era and ushered in a period of Southern “home rule.” Soon after his inauguration, Hayes made good on his promise, ordering federal troops to withdraw from Louisiana and South Carolina, where they had been protecting Republican claimants to the governorships in those states. This action marked the effective end of the Reconstruction era, and began a period of solid Democratic control in the South. Soon, a reactionary, unfettered white supremacist rule rose to power in many Southern states. In the absence of federal intervention over the next several decades, hate groups such as the Ku Klux Klan flourished, and states enacted racist Jim Crow laws whose impacts continue to be felt today. For their part, white Southern Democrats did not honor their pledge to uphold the rights of Black citizens, but moved quickly to reverse as many of Reconstruction’s policies as possible. In the decades to come, disenfranchisement of Black voters throughout the South, often through intimidation and violence, helped ensure the racial segregation imposed by the Jim Crow laws—a system that endured for more than a half-century, until the advances of the civil rights movement in the 1960s. In this sense the 1876 presidential election provided the foundation for America’s political landscape, as well as race relations, for the next 100 years.Key decisions by the U.S. Supreme Court struck at the protections afforded by Reconstruction-era constitutional amendments and legislation. The Court’s decision in the Slaughterhouse Cases (1873), established that the 14th Amendment applied only to former enslaved people, and protected only rights granted by the federal government, not by the states.Three years later, in United States v. Cruikshank, the Supreme Court overturned the convictions of three white men convicted in connection with the massacre of more than 100 Black men in Colfax, Louisiana in 1873, as part of a political dispute. The men had been convicted of violating the 1870 Enforcement Act, which banned conspiracies to deny citizens’ constitutional rights and had been intended to combat violence by the Ku Klux Klan against Black people in the South.The Supreme Court’s ruling—that the 14th Amendment’s promise of due process and equal protection covered violations of citizens’ rights by the states, but not by individuals—would make prosecuting anti-Black violence increasingly difficult, even as the Klan and other white supremacist groups were helping to disenfranchise Black voters and reassert white control of the South.Ten years later, the debacle would also result in a long-overdue law: the Electoral Count Act of 1887, which codified Electoral College procedure. This was recently further supplemented after the events of January 6, 2020. The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.  ReferencesFoner, Eric (2002) [1988]. Reconstruction: America's Unfinished Revolution, 1863–1877. New York: Harper Perennial Modern Classics.Grant, Ulysses S. (2003) [1885]. Personal Memoirs. New York: Barnes \u0026 Noble, Inc.McFeely, William S. (1981). Grant: A Biography. New York: Norton.https://www.history.com/news/reconstruction-1876-election-rutherford-hayeshttps://millercenter.org/the-presidency/educational-resources/disputed-election-1876https://www.smithsonianmag.com/smart-news/confusion-voter-suppression-and-constitutional-crisis-five-things-know-about-1876-presidential-election-180976677/https://guides.loc.gov/presidential-election-1876https://www.history.com/topics/us-presidents/compromise-of-1877https://www.nationalgeographic.com/history/article/1876-election-most-divisive-united-states-history-how-congress-responded/",
  "author": "George Levrier-Jones",
  "published": "Fri, 25 Oct 2024 18:21:00 +0000",
  "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
  "categories": [
    "19th century",
    "Blog Post"
  ],
  "byline": "AuthorGeorge Levrier-Jones",
  "length": 24149,
  "excerpt": "The 1876 U.S. presidential election is one of the most contentious and controversial elections in American history. This election has a fraught legacy: After months of bitter fighting, lawmakers made a fateful compromise to put one man in office by effectively ending Reconstruction, leading to a cen",
  "siteName": "History is Now Magazine, Podcasts, Blog and Books | Modern International and American history",
  "favicon": "",
  "text": "The 1876 U.S. presidential election is one of the most contentious and controversial elections in American history. This election has a fraught legacy: After months of bitter fighting, lawmakers made a fateful compromise to put one man in office by effectively ending Reconstruction, leading to a century of intensified racial segregation in the South. It involved a dispute over electoral votes that was eventually resolved through a political compromise.  It was not our country’s finest moment.Lloyd W. Klein explains. The CandidatesThe candidates were a reform-minded Democrat and a Reconstructionist Republican. Rutherford B. Hayes was the governor of Ohio and was the Republican candidate. His campaign focused on reform and a commitment to civil rights, particularly for African Americans in the South. Before the war he had been a Cincinnati lawyer and abolitionist. He ran against Samuel J. Tilden the governor of New York, the Democratic candidate. He was known for his efforts in fighting corruption, particularly in New York City’s Tammany Hall. Tilden had been a War Democrat who opposed slavery; Tilden opposed Abraham Lincoln in the 1860 presidential election but later supported him and the Union during the Civil War.The Democratic VP candidate was William A Wheeler, a man about whom Hayes had recently said, “I am ashamed to say: who is Wheeler?\" He was a congressman from New York whose opposition was even less prominent. Wheeler was nominated because he was popular among his colleagues and had worked to avoid making enemies in Congress. In addition, he provided geographical balance to the ticket.The Republican VP candidate was Thomas A Hendricks, the Governor of Indiana and a former US Senator and congressman. Hendricks’s record consisted of challenging the military draft and issuing greenbacks; however, he supported the Union and prosecution of the war, consistently voting in favor of wartime appropriations. Hendricks adamantly opposed Radical Reconstruction. After the war he argued that the Southern states had never been out of the Union and were therefore entitled to representation in the U.S. Congress. Hendricks also maintained that Congress had no authority over the affairs of state governments.It was widely expected that Tilden and the Democrats would ride a popular wave into office after 16 years of Republicans and the scandals of President Grant’s administration.Only one of these candidates had had a successful military experience in the war. Hayes, a lawyer, businessman, and abolitionist, was a war hero who went on to serve in Congress and later as Ohio’s governor, where he championed African American suffrage, Hayes was wounded five times, most seriously at the Battle of South Mountain in 1862. He earned a reputation for bravery in combat, rising in the ranks to serve as brevet major general. He was a lawyer from Cincinnati (educated at Kenyon College and Harvard) with no formal military training. After the war had returned to politics. He had displayed great courage in the Kanawha Division, working under George Crook and David Hunter.He was not the only potential candidate with a war background. William T Sherman was the commander of the Army but had no interest whatsoever. Grant had intentionally given Winfield Scott Hancock, a Democrat, obscure assignments away from the South.  He did receive some votes in the convention in 1876 for the nomination but 1880 would be his real attempt for the office. It was widely assumed during 1875 that incumbent President Ulysses S. Grant would run for a third term as president despite the poor economic conditions, the numerous political scandals that had developed since he assumed office in 1869, and a longstanding tradition set by George Washington not to stay in office for more than two terms. Grant's inner circle advised him to run for a third term and he almost did so, but on December 15, 1875, the House, by a sweeping 233–18 vote, passed a resolution declaring that the two-term tradition was to prevent a dictatorship.The initial favorite in 1876 was James G Blaine of Maine. He had the lead in delegates but was 100 votes short of the majority, as the southern states would not support his views. Hayes won the nomination by appealing in a conciliatory manner to the Southern Republicans, which left Frederick Douglass confused about whether the new black southern vote was wanted.The Election CampaignsIn 1876 it was the tradition that the candidates did not campaign, and their surrogates made their cases locally. The Republicans expected to lose. The poor economic conditions made the party in power unpopular. Both candidates concentrated on the swing states of New York and Indiana, as well as the three southern states—Louisiana, South Carolina, and Florida—where Reconstruction Republican governments still barely ruled, amid recurring political violence, including widespread efforts to suppress freedman voting. Democrats, whose voter base resided in the former Confederacy, had been partly shut out of the political sphere; now, with Republican Ulysses S. Grant facing charges of corruption, Tilden’s reform-minded candidacy seemed like a well-timed opportunity for Democrats to regain political power.The Republican outlook was indeed bleak. Hayes was a virtual unknown outside his home state of Ohio. Henry Adams called Hayes \"a third-rate nonentity whose only recommendations are that he is obnoxious to no one\". Hayes’s most important asset was his help to the Republican ticket in carrying Ohio, a crucial swing state. For the Democrats, the newspaperman John D. Defrees described Tilden as \"a very nice, prim, little, withered-up, fidgety old bachelor, about one-hundred and twenty-pounds avoirdupois, who never had a genuine impulse for many nor any affection for woman\".The Democratic strategy for victory in the South relied on paramilitary groups such as the Red Shirts and the White League. These groups saw themselves as the military wing of the Democrats. Using the strategy of the Mississippi Plan, they actively suppressed both black and white Republican voting. They violently disrupted meetings and rallies, attacked party organizers, and threatened potential voters with retaliation for voting Republican.During the election of 1876, Southern Democrats who supported Wade Hampton for governor used mob violence to attack and intimidate African American voters in Charleston. Republican Governor Daniel Henry Chamberlain appealed to President Grant for military assistance. In October 1876, Grant, after issuing a proclamation, instructed Sherman to gather all available Atlantic region troops and dispatch them to South Carolina to stop the mob violence.It’s a cliché to say that in America, race is always on the ballot. But in 1876, it was probably the central issue.  The election process in Southern states was rife with voter fraud—on the part of both parties—and marked by violent voter suppression against black Americans. Under Reconstruction, African Americans had achieved unprecedented political power, and new federal legislation sought to provide a modicum of economic equality for newly enfranchised people. In response, white Southerners rebelled against African Americans’ newfound power and sought to intimate and disenfranchise black voters through violence.Voter suppression was rampant in the post-Confederacy South. Many historians argue that if votes had been counted accurately and fairly in Southern states, Hayes might have won the 1876 election outright. “[I]f you had a fair election in the south, a peaceful election, there’s no question that the Republican Hayes would have won a totally legitimate and indisputable victory,” wrote Eric Foner. Election NightOn election night, Hayes was losing so badly that he prepared his concession speech before turning in for the night. His party chairman went to bed with a bottle of whiskey. “We soon fell into a refreshing sleep,” Hayes later wrote in his diary about the events of November 7, 1876. “[T]he affair seemed over.”But after four months of fierce debate and negotiations, Hayes would be sworn into office as 19th president of the United States. Historians often describe his narrow, controversial win over Democrat Samuel J. Tilden as one of the most bitterly contested presidential elections in history.Just a few days following the election, Tilden appeared poised to narrowly clinch the election. He had captured 51.5 percent of the popular vote to Hayes’s 48 percent, a margin of about 250,000 votes. But Tilden had amassed only 184 electoral votes—one shy of the number needed to reach the 185 electoral votes necessary for the presidency. Hayes, meanwhile, had 165. Election returns from three Republican-controlled Southern states—Louisiana, Florida and South Carolina—were divided, with both sides declaring victory. Together, the states represented a total of 19 electoral votes, which along with one disputed elector from Oregon would be enough to swing the election Hayes’s way.Hayes’ proponents realized that those contested votes could sway the election. They seized the uncertainty of the moment, encouraging Republican leaders in the three states to stall, and argued that if black voters hadn’t been intimidated away from the polls—and if voter fraud hadn’t been as rampant—Hayes would have won the contested states. With a Republican-controlled Senate, a Democrat-controlThe Disputed ElectionAt the end of election day, no clear winner emerged because the outcomes in South Carolina, Florida, and Louisiana were unclear. Both parties claimed victory in those states, but Republican-controlled “returning” boards would determine the official electoral votes.  “The elections in three states—Florida, Louisiana, and South Carolina—were alleged to have been conducted illegally,” the senators of those states wrote in a statement.“Republicans and Democrats rushed to those three states to watch and try to influence the counting of the votes. The returning boards determined which votes to count and could throw out votes, if they deemed them fraudulent. The returning boards in all three states argued that fraud, intimidation, and violence in certain districts invalidated votes, and they threw out enough Democratic votes for Hayes to win. All three returning boards awarded their states’ electoral votes to Hayes.Meanwhile in Oregon, a strange development added that state to the uncertain mix. Hayes won the state, but one of the Republican electors, John W. Watts, was also postmaster, and the US Constitution forbids federal officeholders from being electors. Watts planned to resign from his position in order to be a Republican elector, but the governor of Oregon who was a Democrat, disqualified Watts and instead certified a Tilden elector.The U.S. Constitution provided no way of resolving the dispute, and now Congress would have to decide. As Democrats controlled the House of Representatives, and Republicans dominated in the Senate, the two sides compromised by creating a bipartisan electoral commission with five representatives, five senators and five Supreme Court justices.Electors cast their ballots in state capitals on December 6, 1876. Generally, the process went smoothly but in four capitals—Salem, Oregon; Columbia, South Carolina; Tallahassee, Florida; and New Orleans, Louisiana—two sets of conflicting electors met and voted so that the US Congress received two sets of conflicting electoral votes. At this point, Tilden had 184 electoral votes while Hayes had 165 with 20 votes still disputed.When the Electoral College does not give a majority to a candidate, such as ties or when there are uncertain electors involved, they are called contingent elections. An example of a tie was the 1800 election, and it required a compromise for Jefferson to be president over Burr. After that, a legal remedy was agreed on. Another contingent election was in 1824 when John Quincy Adams was ultimately elected over Andrew Jackson, a result that was reversed in 1828.Why wasn’t the election resolved in the states, like they are supposed to be? The Constitution outlines what is supposed to happen in these situations, but it didn’t actually happen in 1876.That year the contingent election system was bypassed when there was a contested outcome. At the height of Reconstruction, the issue was not that no candidate got a majority in the Electoral College, but rather that the three Southern states – Florida, Louisiana and South Carolina – sent multiple slates of electoral votes to Washington, DC, after the state elections were disputed. And in Oregon, there was a dispute over one elector. The question was which were the legitimate sets of electors.The Constitution stipulates that the electoral votes be directed to the President of the Senate, who was Republican Thomas W. Ferry. Although Republicans argued that he had the right to decide which votes to count, Democrats disagreed and argued that the Democratic majority in Congress should decide. The Compromise of 1877A compromise was reached. In an unprecedented move, Congress decided to create an extralegal “Election Commission.  Congress created a special bipartisan commission, to determine which candidate should get the 20 disputed electoral votes. So on January 29, 1877, the Electoral Commission Act established a commission of five senators (three Republicans, two Democrats), five representatives (three Democrats, two Republicans), and five Supreme Court justices (two Republicans, two Democrats, and one independent) to decide which votes to count and resolve the dispute. However, the independent Supreme Court justice refused to serve on the commission and was replaced by a Republican justice.In the disputed Presidential election of 1876 between the Republican Rutherford Hayes and the Democrat Samuel Tilden, Congress created a special Electoral Commission to decide to whom to award a total of 20 electoral votes which were disputed from the states of Florida, Louisiana, South Carolina and Oregon. The Commission was to be composed of 15 members: five drawn from the U.S. House of Representatives, five from the U.S. Senate, and five from the U.S. Supreme Court. The majority party in each legislative chamber would get three seats on the Commission, and the minority party would get two. Both parties agreed to this arrangement because it was understood that the Commission would have seven Republicans, seven Democrats, and one independent.Obviously that independent would be the one to decide. Both parties wanted the same man: Justice David Davis, a friend and former colleague of Abraham Lincoln. Judge Davis was a brilliant and ethical man, and was reputed as such in his lifetime. This episode proves it beyond any doubt, and exactly why few know about it is astounding. Davis, who was the most trusted independent in the nation. According to one historian, \"No one, perhaps not even Davis himself, knew which presidential candidate he preferred.\" Just as the Electoral Commission Bill was passing Congress, the legislature of Illinois elected Davis to the Senate. Democrats in the Illinois Legislature believed that they had purchased Davis's support by voting for him. However, they had made a miscalculation; instead of staying on the Supreme Court so that he could serve on the Commission, he promptly resigned as a Justice, in order to take his Senate seat. His replacement, a Republican, voted for Hayes.In late January, the commission voted 8-7 along party lines that Hayes had won all the contested states, and therefore the presidency, by just one electoral vote. They ultimately gave the votes to Republican Rutherford B. Hayes even though Democrat Samuel Tilden got more popular votes.  With 185 votes to Tilden's 184, Hayes was declared the winner two days before he was inaugurated.And just exactly how was this decision reached? Tilden and the Democrats gave up the election, which in all fairness, they probably did win because they got something in return. Disputed returns and secret back-room negotiations put Republican Rutherford B. Hayes in the White House. The commission voted 8 to 7 to award the electoral votes from South Carolina, Florida, and Louisiana (and one from Oregon) to Hayes.  But that was not the end of the election. What Happened Behind Closed DoorsDemocratic members of Congress threatened to prevent the count of electoral votes and delay the resolution of the election with frequent adjournments and filibusters. With the threat of delay, Democrats hoped to win some concessions from Republicans. Furious Democrats refused to accept the ruling of the special commission and threatened a filibuster. So, in long meetings behind closed doors, Democrats and Hayes’ Republican allies hashed out what came to be known as the Compromise of 1877: also known as the Wormley Agreement, the Bargain of 1877, or the Corrupt Bargain: an informal but binding agreement.Finally, just after 4 a.m. on March 2, 1877, the Senate president declared Hayes the president-elect of the United States. Hayes—dubbed “His Fraudulency” by a bitter Democratic press—would be publicly inaugurated just two days later.A secret backroom deal decided the election. The negotiations put Republican Rutherford B. Hayes in the White House—and Democrats back in control of the South. Hayes would become president on the condition that he ended Reconstruction in the South. Hayes secured his win by agreeing to end Reconstruction. he filibuster of the certified results and the threat of political violence in exchange for an end to federal Reconstruction. Two issues interested Democrats—restoring their control of governments, and thus white supremacy, in the South (and removing the last of the federal troops) and a federal subsidy for railroads. However, it is doubtful that Hayes, his supporters, and Democrats reached any sort of deal beyond what Hayes promised to do in his letter of acceptance. Samuel J. Randall, the Democratic Speaker of the House, realizing that creating chaos would backfire on the Democrats, finally ruled the filibusterers out of order and forced the completion of the count in the early hours of March 2, 1877.In fact, even as the electoral commission deliberated, national party leaders had been meeting in secret to hash out what would become known as the Compromise of 1877. Hayes agreed to cede control of the South to Democratic governments and back away from attempts at federal intervention in the region, as well as place a Southerner in his cabinet. In return, Democrats would not dispute Hayes’s election, and agreed to respect the civil rights of Black citizens. Just two months after his inauguration, Hayes made good on his compromise and ordered the removal of the last federal troops from Louisiana. These troops had been in place since the end of the Civil War and had helped enforce the civil and legal rights of many formerly enslaved individuals.The disputed 1876 presidential election resulted in a compromise in which Republican Rutherford B. Hayes became president in exchange for the withdrawal of federal troops from the South. This effectively ended Reconstruction. Southern white Democrats, known as \"Redeemers,\" regained control of state governments. They systematically dismantled Reconstruction-era reforms and restored white supremacy through laws, violence, and intimidation. The late 19th and early 20th centuries saw the establishment of Jim Crow laws, which enforced racial segregation and disenfranchised African Americans. These laws undid many of the advances made during Reconstruction. In conclusion, while the Radical Republicans initially succeeded in imposing their Reconstruction policies, their gains were largely undone by the end of the 19th century, leading to nearly a century of segregation and disenfranchisement for African Americans in the South.More stringent enforcement and a more robust federal military presence and oversight in the South could have provided more protection for African Americans and ensured the implementation of Reconstruction policies. This would have helped prevent the rise of white supremacist groups and the rollback of civil rights gains. I don’t think extending the occupation past 1876 would have; however, the damage was done. With this deal, Hayes ended the Reconstruction era and ushered in a period of Southern “home rule.” Soon after his inauguration, Hayes made good on his promise, ordering federal troops to withdraw from Louisiana and South Carolina, where they had been protecting Republican claimants to the governorships in those states. This action marked the effective end of the Reconstruction era, and began a period of solid Democratic control in the South. Soon, a reactionary, unfettered white supremacist rule rose to power in many Southern states. In the absence of federal intervention over the next several decades, hate groups such as the Ku Klux Klan flourished, and states enacted racist Jim Crow laws whose impacts continue to be felt today. For their part, white Southern Democrats did not honor their pledge to uphold the rights of Black citizens, but moved quickly to reverse as many of Reconstruction’s policies as possible. In the decades to come, disenfranchisement of Black voters throughout the South, often through intimidation and violence, helped ensure the racial segregation imposed by the Jim Crow laws—a system that endured for more than a half-century, until the advances of the civil rights movement in the 1960s. In this sense the 1876 presidential election provided the foundation for America’s political landscape, as well as race relations, for the next 100 years.Key decisions by the U.S. Supreme Court struck at the protections afforded by Reconstruction-era constitutional amendments and legislation. The Court’s decision in the Slaughterhouse Cases (1873), established that the 14th Amendment applied only to former enslaved people, and protected only rights granted by the federal government, not by the states.Three years later, in United States v. Cruikshank, the Supreme Court overturned the convictions of three white men convicted in connection with the massacre of more than 100 Black men in Colfax, Louisiana in 1873, as part of a political dispute. The men had been convicted of violating the 1870 Enforcement Act, which banned conspiracies to deny citizens’ constitutional rights and had been intended to combat violence by the Ku Klux Klan against Black people in the South.The Supreme Court’s ruling—that the 14th Amendment’s promise of due process and equal protection covered violations of citizens’ rights by the states, but not by individuals—would make prosecuting anti-Black violence increasingly difficult, even as the Klan and other white supremacist groups were helping to disenfranchise Black voters and reassert white control of the South.Ten years later, the debacle would also result in a long-overdue law: the Electoral Count Act of 1887, which codified Electoral College procedure. This was recently further supplemented after the events of January 6, 2020.The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.ReferencesFoner, Eric (2002) [1988]. Reconstruction: America's Unfinished Revolution, 1863–1877. New York: Harper Perennial Modern Classics.Grant, Ulysses S. (2003) [1885]. Personal Memoirs. New York: Barnes \u0026 Noble, Inc.McFeely, William S. (1981). Grant: A Biography. New York: Norton.https://www.history.com/news/reconstruction-1876-election-rutherford-hayeshttps://millercenter.org/the-presidency/educational-resources/disputed-election-1876https://www.smithsonianmag.com/smart-news/confusion-voter-suppression-and-constitutional-crisis-five-things-know-about-1876-presidential-election-180976677/https://guides.loc.gov/presidential-election-1876https://www.history.com/topics/us-presidents/compromise-of-1877https://www.nationalgeographic.com/history/article/1876-election-most-divisive-united-states-history-how-congress-responded/",
  "image": "http://static1.squarespace.com/static/50adfa2ae4b0cc1d786569eb/t/671aacf93de50207648929a1/1729801465527/20241025+1024px-President_Rutherford_Hayes_1870_-_1880_Restored_%28cropped%29.jpg?format=1500w",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-block-type=\"2\" id=\"block-e3e490096514a0ecb601\"\u003e\n  \u003cp\u003e\u003cem\u003eThe 1876 U.S. presidential election is one of the most contentious and controversial elections in American history. This election has a fraught legacy: After months of bitter fighting, lawmakers made a fateful compromise to put one man in office by effectively ending Reconstruction, leading to a century of intensified racial segregation in the South. It involved a dispute over electoral votes that was eventually resolved through a political compromise.  It was not our country’s finest moment.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eLloyd W. Klein explains.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv data-block-type=\"2\" id=\"block-yui_3_17_2_1_1729717134761_27494\"\u003e\n  \u003cp\u003e\u003cstrong\u003eThe Candidates\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe candidates were a reform-minded Democrat and a Reconstructionist Republican. Rutherford B. Hayes was the governor of Ohio and was the Republican candidate. His campaign focused on reform and a commitment to civil rights, particularly for African Americans in the South. Before the war he had been a Cincinnati lawyer and abolitionist. He ran against Samuel J. Tilden the governor of New York, the Democratic candidate. He was known for his efforts in fighting corruption, particularly in New York City’s Tammany Hall. Tilden had been a War Democrat who opposed slavery; Tilden opposed Abraham Lincoln in the 1860 presidential election but later supported him and the Union during the Civil War.\u003c/p\u003e\u003cp\u003eThe Democratic VP candidate was William A Wheeler, a man about whom Hayes had recently said, “I am ashamed to say: who is Wheeler?\u0026#34; He was a congressman from New York whose opposition was even less prominent. Wheeler was nominated because he was popular among his colleagues and had worked to avoid making enemies in Congress. In addition, he provided geographical balance to the ticket.\u003c/p\u003e\u003cp\u003eThe Republican VP candidate was Thomas A Hendricks, the Governor of Indiana and a former US Senator and congressman. Hendricks’s record consisted of challenging the military draft and issuing greenbacks; however, he supported the Union and prosecution of the war, consistently voting in favor of wartime appropriations. Hendricks adamantly opposed Radical Reconstruction. After the war he argued that the Southern states had never been out of the Union and were therefore entitled to representation in the U.S. Congress. Hendricks also maintained that Congress had no authority over the affairs of state governments.\u003c/p\u003e\u003cp\u003eIt was widely expected that Tilden and the Democrats would ride a popular wave into office after 16 years of Republicans and the scandals of President Grant’s administration.\u003c/p\u003e\u003cp\u003eOnly one of these candidates had had a successful military experience in the war. Hayes, a lawyer, businessman, and abolitionist, was a war hero who went on to serve in Congress and later as Ohio’s governor, where he championed African American suffrage, Hayes was wounded five times, most seriously at the \u003ca href=\"https://en.wikipedia.org/wiki/Battle_of_South_Mountain\" title=\"Battle of South Mountain\"\u003e\u003cspan\u003eBattle of South Mountain\u003c/span\u003e\u003c/a\u003e in 1862. He earned a reputation for bravery in combat, rising in the ranks to serve as \u003ca href=\"https://en.wikipedia.org/wiki/Brevet_(military)\" title=\"Brevet (military)\"\u003e\u003cspan\u003ebrevet\u003c/span\u003e\u003c/a\u003e \u003ca href=\"https://en.wikipedia.org/wiki/Major_general\" title=\"Major general\"\u003e\u003cspan\u003emajor general\u003c/span\u003e\u003c/a\u003e. He was a lawyer from Cincinnati (educated at Kenyon College and Harvard) with no formal military training. After the war had returned to politics. He had displayed great courage in the Kanawha Division, working under George Crook and David Hunter.\u003c/p\u003e\u003cp\u003eHe was not the only potential candidate with a war background. William T Sherman was the commander of the Army but had no interest whatsoever. Grant had intentionally given Winfield Scott Hancock, a Democrat, obscure assignments away from the South.  He did receive some votes in the convention in 1876 for the nomination but 1880 would be his real attempt for the office. It was widely assumed during 1875 that incumbent President \u003ca href=\"https://en.wikipedia.org/wiki/Ulysses_S._Grant\" title=\"Ulysses S. Grant\"\u003e\u003cspan\u003eUlysses S. Grant\u003c/span\u003e\u003c/a\u003e would run for a third term as president despite the poor economic conditions, the numerous political scandals that had developed since he assumed office in 1869, and a longstanding tradition set by \u003ca href=\"https://en.wikipedia.org/wiki/George_Washington\" title=\"George Washington\"\u003e\u003cspan\u003eGeorge Washington\u003c/span\u003e\u003c/a\u003e not to stay in office for more than two terms. Grant\u0026#39;s inner circle advised him to run for a third term and he almost did so, but on December 15, 1875, the House, by a sweeping 233–18 vote, passed a resolution declaring that the two-term tradition was to prevent a dictatorship.\u003c/p\u003e\u003cp\u003eThe initial favorite in 1876 was James G Blaine of Maine. He had the lead in delegates but was 100 votes short of the majority, as the southern states would not support his views. Hayes won the nomination by appealing in a conciliatory manner to the Southern Republicans, which left Frederick Douglass confused about whether the new black southern vote was wanted.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Election Campaigns\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIn 1876 it was the tradition that the candidates did not campaign, and their surrogates made their cases locally. The Republicans expected to lose. The poor economic conditions made the party in power unpopular. Both candidates concentrated on the swing states of New York and Indiana, as well as the three southern states—Louisiana, South Carolina, and Florida—where Reconstruction Republican governments still barely ruled, amid recurring political violence, including widespread efforts to suppress freedman voting. Democrats, whose voter base resided in the former Confederacy, had been partly shut out of the political sphere; now, with Republican Ulysses S. Grant facing charges of corruption, Tilden’s reform-minded candidacy seemed like a well-timed opportunity for Democrats to regain political power.\u003c/p\u003e\u003cp\u003eThe Republican outlook was indeed bleak. Hayes was a virtual unknown outside his home state of Ohio. Henry Adams called Hayes \u0026#34;a third-rate nonentity whose only recommendations are that he is obnoxious to no one\u0026#34;. Hayes’s most important asset was his help to the Republican ticket in carrying Ohio, a crucial swing state. For the Democrats, the newspaperman John D. Defrees described Tilden as \u0026#34;a very nice, prim, little, withered-up, fidgety old bachelor, about one-hundred and twenty-pounds avoirdupois, who never had a genuine impulse for many nor any affection for woman\u0026#34;.\u003c/p\u003e\u003cp\u003eThe Democratic strategy for victory in the South relied on paramilitary groups such as the Red Shirts and the White League. These groups saw themselves as the military wing of the Democrats. Using the strategy of the Mississippi Plan, they actively suppressed both black and white Republican voting. They violently disrupted meetings and rallies, attacked party organizers, and threatened potential voters with retaliation for voting Republican.\u003c/p\u003e\u003cp\u003eDuring the election of 1876, Southern Democrats who supported Wade Hampton for governor used mob violence to attack and intimidate African American voters in Charleston. Republican Governor Daniel Henry Chamberlain appealed to President Grant for military assistance. In October 1876, Grant, after issuing a proclamation, instructed Sherman to gather all available Atlantic region troops and dispatch them to South Carolina to stop the mob violence.\u003c/p\u003e\u003cp\u003eIt’s a cliché to say that in America, race is always on the ballot. But in 1876, it was probably the central issue.  The election process in Southern states was rife with voter fraud—on the part of both parties—and marked by violent voter suppression against black Americans. Under Reconstruction, African Americans had achieved \u003ca href=\"https://www.facinghistory.org/reconstruction-era/black-officeholders-south\" target=\"_blank\"\u003e\u003cspan\u003eunprecedented political power\u003c/span\u003e\u003c/a\u003e, and new federal legislation sought to provide a modicum of economic equality for newly enfranchised people. In response, white Southerners rebelled against African Americans’ newfound power and sought to intimate and disenfranchise black voters through violence.\u003c/p\u003e\u003cp\u003eVoter suppression was rampant in the post-Confederacy South. Many historians argue that if votes had been counted accurately and fairly in Southern states, Hayes might have won the 1876 election outright. “[I]f you had a fair election in the south, a peaceful election, there’s no question that the Republican Hayes would have won a totally legitimate and indisputable victory,” wrote Eric Foner. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eElection Night\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOn election night, Hayes was losing so badly that he prepared his concession speech before turning in for the night. His party chairman went to bed with a bottle of whiskey. “We soon fell into a refreshing sleep,” Hayes later wrote in his diary about the events of November 7, 1876. “[T]he affair seemed over.”\u003c/p\u003e\u003cp\u003eBut after four months of fierce debate and negotiations, Hayes would be sworn into office as 19th president of the United States. Historians often describe his narrow, controversial win over Democrat Samuel J. Tilden as one of the most bitterly contested presidential elections in history.\u003c/p\u003e\u003cp\u003eJust a few days following the election, Tilden appeared poised to narrowly clinch the election. He had captured 51.5 percent of the popular vote to Hayes’s 48 percent, a margin of about 250,000 votes. But Tilden had amassed only 184 electoral votes—one shy of the number needed to reach the 185 electoral votes necessary for the presidency. Hayes, meanwhile, had 165. Election returns from three Republican-controlled Southern states—Louisiana, Florida and South Carolina—were divided, with both sides declaring victory. Together, the states represented a total of 19 electoral votes, which along with one disputed elector from Oregon would be enough to swing the election Hayes’s way.\u003c/p\u003e\u003cp\u003eHayes’ proponents realized that those contested votes could sway the election. They seized the uncertainty of the moment, encouraging Republican leaders in the three states to stall, and argued that if black voters hadn’t been intimidated away from the polls—and if voter fraud hadn’t been as rampant—Hayes would have won the contested states. With a Republican-controlled Senate, a Democrat-control\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Disputed Election\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAt the end of election day, no clear winner emerged because the outcomes in South Carolina, Florida, and Louisiana were unclear. Both parties claimed victory in those states, but Republican-controlled “returning” boards would determine the official electoral votes.  “The elections in three states—Florida, Louisiana, and South Carolina—were alleged to have been conducted illegally,” the senators of those states wrote in a \u003ca href=\"https://www.texastribune.org/2021/01/02/ted-cruz-joe-biden/\" target=\"_blank\"\u003e\u003cspan\u003estatement\u003c/span\u003e\u003c/a\u003e.“\u003c/p\u003e\u003cp\u003eRepublicans and Democrats rushed to those three states to watch and try to influence the counting of the votes. The returning boards determined which votes to count and could throw out votes, if they deemed them fraudulent. The returning boards in all three states argued that fraud, intimidation, and violence in certain districts invalidated votes, and they threw out enough Democratic votes for Hayes to win. All three returning boards awarded their states’ electoral votes to Hayes.\u003c/p\u003e\u003cp\u003eMeanwhile in Oregon, a strange development added that state to the uncertain mix. Hayes won the state, but one of the Republican electors, John W. Watts, was also postmaster, and the US Constitution forbids federal officeholders from being electors. Watts planned to resign from his position in order to be a Republican elector, but the governor of Oregon who was a Democrat, disqualified Watts and instead certified a Tilden elector.\u003c/p\u003e\u003cp\u003eThe \u003ca href=\"https://www.history.com/topics/united-states-constitution/constitution\"\u003e\u003cspan\u003eU.S. Constitution\u003c/span\u003e\u003c/a\u003e provided no way of resolving the dispute, and now \u003ca href=\"https://history.house.gov/Historical-Highlights/1851-1900/The-electoral-vote-count-of-the-1876-presidential-election/\"\u003e\u003cspan\u003eCongress would have to decide\u003c/span\u003e\u003c/a\u003e. As Democrats controlled the House of Representatives, and Republicans dominated in the Senate, the two sides compromised by creating a bipartisan electoral commission with five representatives, five senators and five Supreme Court justices.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eElectors cast their ballots in state capitals on December 6, 1876. Generally, the process went smoothly but in four capitals—Salem, Oregon; Columbia, South Carolina; Tallahassee, Florida; and New Orleans, Louisiana—two sets of conflicting electors met and voted so that the US Congress received two sets of conflicting electoral votes. At this point, Tilden had 184 electoral votes while Hayes had 165 with 20 votes still disputed.\u003c/strong\u003e\u003c/h3\u003e\u003ch3\u003e\u003cstrong\u003eWhen the Electoral College does not give a majority to a candidate, such as ties or when there are uncertain electors involved, they are called contingent elections. An example of a tie was the 1800 election, and it required a compromise for Jefferson to be president over Burr. After that, a legal remedy was agreed on. Another contingent election was in 1824 when John Quincy Adams was ultimately elected over Andrew Jackson, a result that was reversed in 1828.\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eWhy wasn’t the election resolved in the states, like they are supposed to be? The Constitution outlines what is supposed to happen in these situations, but it didn’t actually happen in 1876.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eThat year the contingent election system was bypassed when there was a contested outcome. At the height of Reconstruction, the issue was not that no candidate got a majority in the Electoral College, but rather that the three Southern states – Florida, Louisiana and South Carolina – sent multiple slates of electoral votes to Washington, DC, after the state elections were disputed. And in Oregon, there was a dispute over one elector. The question was which were the legitimate sets of electors.\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe Constitution stipulates that the electoral votes be directed to the President of the Senate, who was Republican Thomas W. Ferry. Although Republicans argued that he had the right to decide which votes to count, Democrats disagreed and argued that the Democratic majority in Congress should decide. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Compromise of 1877\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA compromise was reached. In an unprecedented move, Congress decided to create an extralegal “Election Commission.  Congress created a special bipartisan commission, to determine which candidate should get the 20 disputed electoral votes. So on January 29, 1877, the Electoral Commission Act established a commission of five senators (three Republicans, two Democrats), five representatives (three Democrats, two Republicans), and five Supreme Court justices (two Republicans, two Democrats, and one independent) to decide which votes to count and resolve the dispute. However, the independent Supreme Court justice refused to serve on the commission and was replaced by a Republican justice.\u003c/p\u003e\u003cp\u003eIn the disputed \u003ca href=\"https://en.wikipedia.org/wiki/U.S._presidential_election,_1876\" title=\"U.S. presidential election, 1876\"\u003e\u003cspan\u003ePresidential election of 1876\u003c/span\u003e\u003c/a\u003e between the Republican \u003ca href=\"https://en.wikipedia.org/wiki/Rutherford_Hayes\" title=\"Rutherford Hayes\"\u003e\u003cspan\u003eRutherford Hayes\u003c/span\u003e\u003c/a\u003e and the Democrat \u003ca href=\"https://en.wikipedia.org/wiki/Samuel_Tilden\" title=\"Samuel Tilden\"\u003e\u003cspan\u003eSamuel Tilden\u003c/span\u003e\u003c/a\u003e, Congress created a special \u003ca href=\"https://en.wikipedia.org/wiki/Electoral_Commission_(United_States)\" title=\"Electoral Commission (United States)\"\u003e\u003cspan\u003eElectoral Commission\u003c/span\u003e\u003c/a\u003e to decide to whom to award a total of 20 \u003ca href=\"https://en.wikipedia.org/wiki/United_States_Electoral_College\" title=\"United States Electoral College\"\u003e\u003cspan\u003eelectoral votes\u003c/span\u003e\u003c/a\u003e which were disputed from the states of Florida, \u003ca href=\"https://en.wikipedia.org/wiki/Louisiana\" title=\"Louisiana\"\u003e\u003cspan\u003eLouisiana\u003c/span\u003e\u003c/a\u003e, \u003ca href=\"https://en.wikipedia.org/wiki/South_Carolina\" title=\"South Carolina\"\u003e\u003cspan\u003eSouth Carolina\u003c/span\u003e\u003c/a\u003e and \u003ca href=\"https://en.wikipedia.org/wiki/Oregon\" title=\"Oregon\"\u003e\u003cspan\u003eOregon\u003c/span\u003e\u003c/a\u003e. The Commission was to be composed of 15 members: five drawn from the \u003ca href=\"https://en.wikipedia.org/wiki/U.S._House_of_Representatives\" title=\"U.S. House of Representatives\"\u003e\u003cspan\u003eU.S. House of Representatives\u003c/span\u003e\u003c/a\u003e, five from the U.S. Senate, and five from the U.S. Supreme Court. The majority party in each legislative chamber would get three seats on the Commission, and the minority party would get two. Both parties agreed to this arrangement because it was understood that the Commission would have seven Republicans, seven Democrats, and one independent.\u003c/p\u003e\u003cp\u003eObviously that independent would be the one to decide. Both parties wanted the same man: Justice David Davis, a friend and former colleague of Abraham Lincoln. Judge Davis was a brilliant and ethical man, and was reputed as such in his lifetime. This episode proves it beyond any doubt, and exactly why few know about it is astounding. Davis, who was the most trusted independent in the nation. According to one historian, \u0026#34;No one, perhaps not even Davis himself, knew which presidential candidate he preferred.\u0026#34; Just as the Electoral Commission Bill was passing Congress, the \u003ca href=\"https://en.wikipedia.org/wiki/Illinois_General_Assembly\" title=\"Illinois General Assembly\"\u003e\u003cspan\u003elegislature of Illinois\u003c/span\u003e\u003c/a\u003e elected Davis to the Senate. Democrats in the Illinois Legislature believed that they had purchased Davis\u0026#39;s support by voting for him. However, they had made a miscalculation; instead of staying on the Supreme Court so that he could serve on the Commission, he promptly resigned as a Justice, in order to take his Senate seat. His replacement, a Republican, voted for Hayes.\u003c/p\u003e\u003cp\u003eIn late January, the commission voted 8-7 along party lines that Hayes had won all the contested states, and therefore the presidency, by just one electoral vote. They ultimately gave the votes to Republican Rutherford B. Hayes even though Democrat Samuel Tilden got more popular votes.  With 185 votes to Tilden\u0026#39;s 184, Hayes was declared the winner two days before he was inaugurated.\u003c/p\u003e\u003cp\u003eAnd just exactly how was this decision reached? Tilden and the Democrats gave up the election, which in all fairness, they probably did win because they got something in return. Disputed returns and secret back-room negotiations put Republican Rutherford B. Hayes in the White House. The commission voted 8 to 7 to award the electoral votes from South Carolina, Florida, and Louisiana (and one from Oregon) to Hayes.  But that was not the end of the election.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e \u003c/strong\u003e\u003c/h3\u003e\u003ch3\u003e\u003cstrong\u003eWhat Happened Behind Closed Doors\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eDemocratic members of Congress threatened to prevent the count of electoral votes and delay the resolution of the election with frequent adjournments and filibusters. With the threat of delay, Democrats hoped to win some concessions from Republicans. Furious Democrats refused to accept the ruling of the special commission and threatened a filibuster. So, in long meetings behind closed doors, Democrats and Hayes’ Republican allies hashed out what came to be known as the \u003ca href=\"https://www.khanacademy.org/humanities/us-history/civil-war-era/reconstruction/a/compromise-of-1877\" target=\"_blank\"\u003e\u003cspan\u003eCompromise of 1877\u003c/span\u003e\u003c/a\u003e: also known as the Wormley Agreement, the Bargain of 1877, or the Corrupt Bargain: an informal but binding agreement.\u003c/p\u003e\u003cp\u003eFinally, just after 4 a.m. on March 2, 1877, the Senate president declared Hayes the president-elect of the United States. Hayes—dubbed “\u003ca href=\"https://millercenter.org/president/hayes/life-in-brief\" target=\"_blank\"\u003e\u003cspan\u003eHis Fraudulency\u003c/span\u003e\u003c/a\u003e” by a bitter Democratic press—would be publicly inaugurated just two days later.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eA secret backroom deal decided the election. The negotiations put Republican Rutherford B. Hayes in the White House—and Democrats back in control of the South. Hayes would become president on the condition that he ended Reconstruction in the South. Hayes secured his win by agreeing to end Reconstruction. he filibuster of the certified results and the threat of political violence in exchange for an end to federal Reconstruction. Two issues interested Democrats—restoring their control of governments, and thus white supremacy, in the South (and removing the last of the federal troops) and a federal subsidy for railroads. However, it is doubtful that Hayes, his supporters, and Democrats reached any sort of deal beyond what Hayes promised to do in his letter of acceptance. Samuel J. Randall, the Democratic Speaker of the House, realizing that creating chaos would backfire on the Democrats, finally ruled the filibusterers out of order and forced the completion of the count in the early hours of March 2, 1877.\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eIn fact, even as the electoral commission deliberated, national party leaders had been meeting in secret to hash out what would become known as the \u003ca href=\"https://www.history.com/topics/us-presidents/compromise-of-1877\"\u003e\u003cspan\u003eCompromise of 1877\u003c/span\u003e\u003c/a\u003e. Hayes agreed to cede control of the South to Democratic governments and back away from attempts at federal intervention in the region, as well as place a Southerner in his cabinet. In return, Democrats would not dispute Hayes’s election, and agreed to respect the civil rights of Black citizens. Just two months after his inauguration, Hayes made good on his compromise and ordered the \u003ca href=\"https://calendar.eji.org/racial-injustice/apr/24\" target=\"_blank\"\u003e\u003cspan\u003eremoval of the last federal troops from Louisiana\u003c/span\u003e\u003c/a\u003e. These troops had been in place since the end of the Civil War and had helped enforce the civil and legal rights of many formerly enslaved individuals.\u003c/p\u003e\u003cp\u003eThe disputed 1876 presidential election resulted in a compromise in which Republican Rutherford B. Hayes became president in exchange for the withdrawal of federal troops from the South. This effectively ended Reconstruction. Southern white Democrats, known as \u0026#34;Redeemers,\u0026#34; regained control of state governments. They systematically dismantled Reconstruction-era reforms and restored white supremacy through laws, violence, and intimidation. The late 19th and early 20th centuries saw the establishment of Jim Crow laws, which enforced racial segregation and disenfranchised African Americans. These laws undid many of the advances made during Reconstruction. In conclusion, while the Radical Republicans initially succeeded in imposing their Reconstruction policies, their gains were largely undone by the end of the 19th century, leading to nearly a century of segregation and disenfranchisement for African Americans in the South.\u003c/p\u003e\u003cp\u003eMore stringent enforcement and a more robust federal military presence and oversight in the South could have provided more protection for African Americans and ensured the implementation of Reconstruction policies. This would have helped prevent the rise of white supremacist groups and the rollback of civil rights gains. I don’t think extending the occupation past 1876 would have; however, the damage was done. \u003c/p\u003e\u003cp\u003eWith this deal, Hayes ended the Reconstruction era and ushered in a period of Southern “home rule.” Soon after his inauguration, Hayes made good on his promise, ordering federal troops to withdraw from Louisiana and South Carolina, where they had been protecting Republican claimants to the governorships in those states. This action marked the effective end of the Reconstruction era, and began a period of solid Democratic control in the South. Soon, a reactionary, unfettered white supremacist rule rose to power in many Southern states. In the absence of federal intervention over the next several decades, hate groups such as the Ku Klux Klan flourished, and states enacted racist \u003ca href=\"https://www.history.com/topics/early-20th-century-us/jim-crow-laws\" target=\"_blank\"\u003e\u003cspan\u003eJim Crow laws\u003c/span\u003e\u003c/a\u003e whose impacts continue to be felt today. For their part, white Southern Democrats did not honor their pledge to uphold the rights of Black citizens, but moved quickly to reverse as many of Reconstruction’s policies as possible. In the decades to come, disenfranchisement of Black voters throughout the South, often through intimidation and violence, helped ensure the racial segregation imposed by the \u003ca href=\"https://www.history.com/topics/early-20th-century-us/jim-crow-laws\"\u003e\u003cspan\u003eJim Crow laws\u003c/span\u003e\u003c/a\u003e—a system that endured for more than a half-century, until the advances of the \u003ca href=\"https://www.history.com/topics/black-history/civil-rights-movement\"\u003e\u003cspan\u003ecivil rights movement\u003c/span\u003e\u003c/a\u003e in the 1960s. In this sense the 1876 presidential election provided the foundation for America’s political landscape, as well as race relations, for the next 100 years.\u003c/p\u003e\u003cp\u003eKey decisions by the U.S. \u003ca href=\"https://www.history.com/topics/us-government/supreme-court-facts\"\u003e\u003cspan\u003eSupreme Court\u003c/span\u003e\u003c/a\u003e struck at the protections afforded by Reconstruction-era constitutional amendments and legislation. The Court’s decision in the Slaughterhouse Cases (1873), \u003ca href=\"https://constitutioncenter.org/blog/the-slaughterhouse-cases-interpreting-the-reconstruction-amendments\"\u003e\u003cspan\u003eestablished\u003c/span\u003e\u003c/a\u003e that the \u003ca href=\"https://www.history.com/topics/black-history/fourteenth-amendment\"\u003e\u003cspan\u003e14th Amendment \u003c/span\u003e\u003c/a\u003eapplied only to former enslaved people, and protected only rights granted by the federal government, not by the states.\u003c/p\u003e\u003cp\u003eThree years later, in \u003ca href=\"https://www.fjc.gov/history/timeline/us-v-cruikshank\"\u003e\u003cspan\u003eUnited States v. Cruikshank\u003c/span\u003e\u003c/a\u003e, the Supreme Court overturned the convictions of three white men convicted in connection with the massacre of more than 100 Black men in Colfax, Louisiana in 1873, as part of a political dispute. The men had been convicted of violating the 1870 Enforcement Act, which banned conspiracies to deny citizens’ constitutional rights and had been intended to combat violence by the \u003ca href=\"https://www.history.com/topics/reconstruction/ku-klux-klan\"\u003e\u003cspan\u003eKu Klux Klan\u003c/span\u003e\u003c/a\u003e against Black people in the South.\u003c/p\u003e\u003cp\u003eThe Supreme Court’s ruling—that the 14th Amendment’s promise of due process and equal protection covered violations of citizens’ rights by the states, but not by individuals—would make prosecuting anti-Black violence increasingly difficult, even as the Klan and other white supremacist groups were helping to disenfranchise Black voters and reassert white control of the South.\u003c/p\u003e\u003cp\u003eTen years later, the debacle would also result in a long-overdue law: the Electoral Count Act of 1887, which codified Electoral College procedure. This was recently further supplemented after the events of January 6, 2020.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eThe site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider \u003c/em\u003e\u003c/strong\u003e\u003ca href=\"https://www.paypal.com/donate?token=KiKBJFJ04kBEqikHyYc07Msuq-fAlIXwLXWYCgXIZQvTvK4TQ4-8WfUuHelPI0Pbb0nAudKTlfcQr9Mt\u0026amp;locale.x=US\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003edonating here\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003cstrong\u003e\u003cem\u003e.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReferences\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFoner, Eric (2002) [1988]. Reconstruction: America\u0026#39;s Unfinished Revolution, 1863–1877. New York: Harper Perennial Modern Classics.\u003c/p\u003e\u003cp\u003eGrant, Ulysses S. (2003) [1885]. Personal Memoirs. New York: Barnes \u0026amp; Noble, Inc.\u003c/p\u003e\u003cp\u003eMcFeely, William S. (1981). Grant: A Biography. New York: Norton.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.history.com/news/reconstruction-1876-election-rutherford-hayes\"\u003e\u003cspan\u003ehttps://www.history.com/news/reconstruction-1876-election-rutherford-hayes\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://millercenter.org/the-presidency/educational-resources/disputed-election-1876\"\u003e\u003cspan\u003ehttps://millercenter.org/the-presidency/educational-resources/disputed-election-1876\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.smithsonianmag.com/smart-news/confusion-voter-suppression-and-constitutional-crisis-five-things-know-about-1876-presidential-election-180976677/\"\u003e\u003cspan\u003ehttps://www.smithsonianmag.com/smart-news/confusion-voter-suppression-and-constitutional-crisis-five-things-know-about-1876-presidential-election-180976677/\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://guides.loc.gov/presidential-election-1876\"\u003e\u003cspan\u003ehttps://guides.loc.gov/presidential-election-1876\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.history.com/topics/us-presidents/compromise-of-1877\"\u003e\u003cspan\u003ehttps://www.history.com/topics/us-presidents/compromise-of-1877\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.nationalgeographic.com/history/article/1876-election-most-divisive-united-states-history-how-congress-responded/\"\u003e\u003cspan\u003ehttps://www.nationalgeographic.com/history/article/1876-election-most-divisive-united-states-history-how-congress-responded/\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "25 min read",
  "publishedTime": "2024-10-25T19:21:00+01:00",
  "modifiedTime": null
}
