{
  "id": "99ca3ebe-33ed-4bbf-96ea-d9dae575db97",
  "title": "The Salvation Army, Economic Emigration, and The British Empire",
  "link": "http://www.historyisnowmagazine.com/blog/2025/1/3/the-salvation-army-economic-emigration-and-the-british-empire",
  "description": "The Salvation Army (the Army) is predominantly known as an international charitable organization. For over a million people worldwide, it is an Evangelical church with its own distinctive polity and practice, owing its heritage to British Methodism and American Revivalism. Less well-known is that between 1891 and 1932, the Army supported over 100,000 men, women, and children to travel from Britain to her colonies across the sea. This Evangelical movement and engine for social reform became an emigration agency because they believed that moving the ‘surplus population’ out of Britain into unclaimed land in the colonies would reduce poverty, specifically urban deprivation, in the mother country.Christopher Button explains. Salvation Army co-founder William Booth.Introduction The Salvation Army began social service work in 1866, with the first food depots providing meals for dockers who had been laid off during the collapse of the Poplar shipyards. By the 1870s, social service work had transformed into social reform work. Early examples included the establishment of rescue homes for female sex workers who were trained to become domestic servants or given jobs such as bookbinders. They also set up sheltered workshops for unemployed or homeless men to enable them to learn a trade and return to work. According to William Booth, the simple principle was that:Any person who comes to a shelter destitute and starving, will be supplied with sufficient work to enable him to earn the fourpence needed for his bed and board. This is a fundamental feature of the scheme, and which I think will commend it to all those who are anxious to benefit the poor by enabling them to help themselves without the demoralising intervention of charitable relief…There is no compulsion upon anyone to resort to our shelters, but if a penniless man wants food her must, as a rule, do work sufficient to pay for what he has of that and of other accommodation. I say as a rule because, of course, our officers will be allowed to make exceptions in extreme cases.[1] The Victorian demand that people should lift themselves up by their bootstraps was adopted by the Army. The Army expected and demanded from the customers of its social relief efforts that they engage in hard work, commitment to personal transformation, and, where absolutely necessary, the absolute minimum of charity to allow them to do so.  In Darkest England In 1890, the Army released the blueprint for a new, totalizing, and universal scheme of social reform that would provide a system of welfare designed to work towards eradicating poverty and destitution and bring about the salvation of the world. This project was called In Darkest England and the Way Out, written principally by William Booth and published in 1890. It sold over 100,000 editions within the first few months. It was, in its way, quite a simple scheme. There were three parts to this scheme. Each was a form of colony, consciously adopting the structures of empire just as the book’s title borrowed from David Livingstone’s book Darkest Africa. The language is telling and is something we will return to. The first step was the ‘City Colony’ including food depots, shelters, rescue work for women, salvage yards and ‘elevators.’ The ‘Elevator’ was a new concept in social services, combining generous acceptance with patient but unwavering discipline. ‘No one brings a reference here’ explained an officer in charge of one such institution. ‘If a man is willing to work, he stays; if not, he goes.’ No guide line could be simpler for the entrant; none more demanding upon those who were seeking his rehabilitation…The elevator was, in effect, and entry form of ‘sheltered workshop’ – a concept which was little known at the time and consequently less understood.[2] The elevator was a combination of shelter and workshop or factory. Men could find somewhere to live and work in various trades to pay for their bed and board and gain enough stability to seek work in the trade they were learning. Central to every part of the city colony was regular, often daily, worship for all the residents. None were compelled to attend, but for many, it was an easy source of entertainment. Attendance at salvation meetings in the shelters across 1891 was recorded at 136,579, with 708 recorded as being converted. The work of social reform was undertaken hand in hand with the work of personal reformation with the intent of universal conversion. For those city colonists who thrived and demonstrated their proper attitude to work, the second stage of the Darkest England scheme beckoned. This was the ‘Farm Colony.’ The Army intended to take select members of the urban poor who had demonstrated their willingness to work and submit to discipline and transplant them to training farms. Sir John Gorst QC MP wrote:The unemployed is taken away from the town where he competes with a congested mass of workers, too numerous for existing employment opportunities, and brought back to the land, where he produces more than he consumes, where his labour enriches the nation without lessening the earnings of his fellow workmen.[3] The Army in the UK bought a farm in Hadleigh, Essex, and developed it to receive colonists from the city. Similar farms were purchased in Australia, America, and South Africa. Farm colonists would work for the first month purely for bread and board. Then, if they demonstrated their willingness to learn, work, and behave, they would start to be paid. The farm colonists learned to work the land in small holdings or as tenant farmers. Some were returned to the city as unsuitable for the farm. Others were encouraged to purchase a 5-acre smallholding from the Army at favorable interest rates and become independent. But for others, they would be eligible for the third part of the Darkest England scheme — the Colony Across the Seas.  The Colony Across the SeaHere, we come to the point at hand. The Darkest England scheme was dependent upon the British Empire. The Darkest England scheme could not have worked without the shared culture, language, infrastructure and transportation links. The fact that the scheme did not live up to its promise has less to do with the Empire and more to do with the incredible amount of funding necessary to make it practicable. Despite the relative failure of the Darkest England scheme beyond the city colony, the limited successes and the plans for the scheme highlight the inherent links between the Army and the Empire. William Booth said:It Is absurd to speak of the colonies as If they were a foreign land. They are simply pieces of Britain distributed about the world, enabling the Britisher to have access to the richest parts of the earth.[4] In the same way, the Army intended to send Britain’s poorest, properly trained and equipped, out to the parts of the Empire where land was underutilized. The movement from city to farm to overseas farm or factory was meant to become a new system built into the structure of Britain. By reducing the overall population and upskilling the urban poor, not only would Britain benefit, but the colonies would be developed. Ausubel wrote: Indeed, one of the purposes of the In Darkest England scheme itself was to bring about structural change, since Booth was one of those Victorian reformers who believed that as population was the root course of the long depression from the early 1870s to the late 1890s and that mass emigration was part of the answer to this problem.[5] The Army started supporting the emigration of its farm colonists to the colonies over the seas in 1891. Initially, colonists went to New South Wales and Queensland. By November 1891, 95 emigrants had been sent overseas by the Army with letters of recommendation for farms and factories in the receiving territories. The 1907 yearbook reported that since 1905, 15,000 people had emigrated through the Army’s agency. However, problems in the scheme were starting to emerge. A key example comes from New Zealand, where there was…Agitation against the scheme by Trades and Labour Councils…On the grounds that living standards of workers would be depressed by this introduction into the Colonies of what they termed ‘undesirable persons the Pauper and criminal scum of the alleys and byways of Great Britain.’[6] The colonies, especially New Zealand and Australia, did not want to receive people who had been destitute and dwelling in London’s slums until recently. The costs involved in emigration had, until then, helped to ensure that those emigrating from Britain had been able to support themselves on arrival. The Army supported the Salvationist colonists, but they were travelling to improve themselves and did not go with their own resources. Another issue was that William Booth and the Army had somewhat misunderstood the relationship between Britain and her colonies and dominions. By the early 1900s, the Empire was already starting to decentralize, especially in the self-governing states and dominions. Britain could not simply tell the governments of Australia, New Zealand, or South Africa to give spare land to colonists from The Salvation Army. The Army was not empowered to create new colonies, and the Imperial government could not provide the Army with new land. The Army was not given unused land in the existing colonies. The third stage of the Darkest England scheme seemed to be failing, so the Army had to turn to a broader approach to emigration.[7] Family Emigration Colonel David Lamb, the new commander of the emigration department, decided to broaden the project to include families as well as single men. This brought into reality some of William Booth's hopes for Darkest England. In the Salvation Ship we shall export them all – father, mother, and children. The individuals will be grouped in families, and the families will, on the farm colony, have been for some months part more or less near neighbours, meeting each other in the field, in the workshops, and in the religious services. It will resemble nothing so much as the unmouring of a little piece of England, and towing it across the sea to find a safe anchorage in a sunnier clime. The ship which takes out emigrants will have the produce of the farms, and constant travelling to and from will lead more than ever to the feeling that we and our ocean-sundered brothers are members of one family.[8] With Australia, New Zealand, and South Africa actively working against William Booth’s scheme of social imperialism, it was up to Canada to rescue Darkest England. The relationship between the Army emigration service and Canada developed until the Army became one of Canada’s leading immigration agencies, accredited and financially sponsored by the Canadian government and funded by direct donations in the UK. Between 1905 and 1907, the Army chartered fourteen ocean liners with a thousand immigrants on each. By the opening of the First World War, over 50,000 settlers had been supported in moving to Canada. By 1932, when the emigration service ended, more than 112,000 people from Britain had moved to Canada.The system was comprehensive. Corps officers in the UK advertised the scheme and supported families in applying for emigration through the Army’s agency. Social officers helped identify likely candidates from the shelters or Hadleigh Farm and made their applications to the agency. The emigration department also stationed agents in the Army’s labour exchange bureaus, particularly helping domestic servants emigrate. The Army also offered emigration insurance for the settlers. For 10 shillings, the traveler would be insured against loss of belongings and against the risk of not finding employment. Whilst most settlers using the Army’s emigration agency had a position organized on their behalf for when they arrived, some went without work waiting for them in the hope of finding a position. The Army would pay for their return to Britain if they did not find work. The Army chartered liners to carry the new colonists from the UK to Canada on an alcohol-free trip. They were accompanied on the ships by Salvation Army officers who led worship and prayer meetings, offered counsel, and gave lectures on the culture of the colonist's new home. The Salvationist colonists would then be welcomed by officers at receiving stations and transported to their new homes, where the local officer would make introductions and ensure they were connected to the corps. Then, if they did not join the local corps, they would receive a semi-annual visit from an Army officer to assess their progress. From start to finish, the whole scheme was operated as part of the Army’s international mission.  ConclusionThe Army combined the structures and methods of the British Empire with an Evangelical Zeal for conversion and the belief that salvation was as much about this world as it was about the next. William Booth wrote:I saw that when the Bible said, ‘He that believeth shall be saved’ it meant not only saved from the miseries of the future world, but from the miseries of this [world] also. Then it came from the promise of Salvation here and now; from hell and sin and vice and crime and idleness and extravagance, and consequently very largely from poverty and disease, and the majority of kindred woes.[9] The Army's social reform work was grounded In the underlying principle that social transformation would only make a lasting difference to the world if it were combined with individual conversion. Helping the poor through social reformation was at least partially undertaken to remove the obstacles to salvation. A hungry person, a cold person, or a homeless person would not become a Christian. By removing them from their circumstances of poverty, giving them a trade, and moving them to a new land with a place to become independent, the individual would better themselves and society as well.However, far more critical for the Army was the hope that by transporting saved Salvationists around the world, they would create colonies of salvation which would spread the word of Salvationism. The central doctrine of Salvationism was that its members evangelized to the groups they had been part of. The converted drinker went back to preach to the drinkers. The sex workers told her previous colleagues about the possibility of rescue and redemption. Walker wrote:One of the most significant features of The Salvation Army was the relationships of its members to the wider community. As soon as people were saved, they were asked to stand before a crowd and relate their experience of conversion…If the Spirit of God pervaded an individual, he or she was ready to preach and testify regardless of previous sinfulness, lack of education, of inexperience.[10] Without the British Empire, its transportation network, its shared culture and language, and William Booth's implicit assumptions that the Imperial territories were simply an extension of Britain, The Salvation Army would not have been able to grow in the way it did. The British Empire was to be matched by a Salvation Empire, spread around the world, transporting Salvationists in ready-made units to the far reaches of Christendom to go out and grow William Booth’s Christian Imperium and usher in the prophesied Millennium. Christopher Button writes at Theology Corner (link here).   Bibliography All The World – Salvation Army Publication Ausubel, Herman. In Hard Ties: Reformers Among the Late Victorians, (New York: Columbia University Press, 1960)Bradwell, Cyril R. Fight the Good Fight: The Story of The Salvation Army in New Zealand 1883-1983, (Wellington: Reed, 1982)Bradwell, Cyril R. Fight the Good Fight: The Story of The Salvation Army in New Zealand 1883-1983, (Wellington: Reed, 1982)Booth, William, In Darkest England and the Way Out, (London: The Salvation Army, 1890)Coutts, Frederick. Bread for my Neighbour: The Social Influence of William Booth, (London: Hodder \u0026 Stoughton, 1978)Sandall, Robert The History of The Salvation Army Volume III 1883-1953 Social and Welfare Work, (London: Thomas Nelson and Sons Ltd. 1955)Walker, Pamela J. Pulling the Devil’s Kingdon Down: The Salvation Army in Victorian Britain, (London: University of California, 2001)White, Arnold, The Great Idea: Notes by an Eye-Witness on Some of the Social Work of the Salvation Army, (London: The Salvation Army, 1910)[1] William Booth, quoted in Sandall, The History Vol. III, p. 120[2] Coutts, Bread for my Neighbour, pp. 106-107[3] John Gorst quoted in Coutts, Bread for my Neighbour, p. 78[4] William Booth, Darkest England, pp. 143-144[5] Ausubel, In Hard Times, p. 180[6] Bradwell, Fight the Good Fight, pp. 53-54[7] White, The Great Idea, p. 47-49[8] William Booth, In Darkest England, p. 152[9] William Booth, “Salvation to Both Worlds” All The World, January 1889 pp. 1-6[10] Walker, Pulling the Devil’s Kingdom Down, p. 187",
  "author": "George Levrier-Jones",
  "published": "Fri, 03 Jan 2025 14:17:00 +0000",
  "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
  "categories": [
    "19th century",
    "20th century",
    "Blog Post"
  ],
  "byline": "AuthorGeorge Levrier-Jones",
  "length": 16891,
  "excerpt": "The Salvation Army (the Army) is predominantly known as an international charitable organization. For over a million people worldwide, it is an Evangelical church with its own distinctive polity and practice, owing its heritage to British Methodism and American Revivalism. Less well-known is that be",
  "siteName": "History is Now Magazine, Podcasts, Blog and Books | Modern International and American history",
  "favicon": "",
  "text": "The Salvation Army (the Army) is predominantly known as an international charitable organization. For over a million people worldwide, it is an Evangelical church with its own distinctive polity and practice, owing its heritage to British Methodism and American Revivalism. Less well-known is that between 1891 and 1932, the Army supported over 100,000 men, women, and children to travel from Britain to her colonies across the sea. This Evangelical movement and engine for social reform became an emigration agency because they believed that moving the ‘surplus population’ out of Britain into unclaimed land in the colonies would reduce poverty, specifically urban deprivation, in the mother country.Christopher Button explains. Salvation Army co-founder William Booth.Introduction The Salvation Army began social service work in 1866, with the first food depots providing meals for dockers who had been laid off during the collapse of the Poplar shipyards. By the 1870s, social service work had transformed into social reform work. Early examples included the establishment of rescue homes for female sex workers who were trained to become domestic servants or given jobs such as bookbinders. They also set up sheltered workshops for unemployed or homeless men to enable them to learn a trade and return to work. According to William Booth, the simple principle was that:Any person who comes to a shelter destitute and starving, will be supplied with sufficient work to enable him to earn the fourpence needed for his bed and board. This is a fundamental feature of the scheme, and which I think will commend it to all those who are anxious to benefit the poor by enabling them to help themselves without the demoralising intervention of charitable relief…There is no compulsion upon anyone to resort to our shelters, but if a penniless man wants food her must, as a rule, do work sufficient to pay for what he has of that and of other accommodation. I say as a rule because, of course, our officers will be allowed to make exceptions in extreme cases.[1]The Victorian demand that people should lift themselves up by their bootstraps was adopted by the Army. The Army expected and demanded from the customers of its social relief efforts that they engage in hard work, commitment to personal transformation, and, where absolutely necessary, the absolute minimum of charity to allow them to do so. In Darkest England In 1890, the Army released the blueprint for a new, totalizing, and universal scheme of social reform that would provide a system of welfare designed to work towards eradicating poverty and destitution and bring about the salvation of the world. This project was called In Darkest England and the Way Out, written principally by William Booth and published in 1890. It sold over 100,000 editions within the first few months. It was, in its way, quite a simple scheme. There were three parts to this scheme. Each was a form of colony, consciously adopting the structures of empire just as the book’s title borrowed from David Livingstone’s book Darkest Africa. The language is telling and is something we will return to. The first step was the ‘City Colony’ including food depots, shelters, rescue work for women, salvage yards and ‘elevators.’ The ‘Elevator’ was a new concept in social services, combining generous acceptance with patient but unwavering discipline. ‘No one brings a reference here’ explained an officer in charge of one such institution. ‘If a man is willing to work, he stays; if not, he goes.’ No guide line could be simpler for the entrant; none more demanding upon those who were seeking his rehabilitation…The elevator was, in effect, and entry form of ‘sheltered workshop’ – a concept which was little known at the time and consequently less understood.[2]The elevator was a combination of shelter and workshop or factory. Men could find somewhere to live and work in various trades to pay for their bed and board and gain enough stability to seek work in the trade they were learning. Central to every part of the city colony was regular, often daily, worship for all the residents. None were compelled to attend, but for many, it was an easy source of entertainment. Attendance at salvation meetings in the shelters across 1891 was recorded at 136,579, with 708 recorded as being converted. The work of social reform was undertaken hand in hand with the work of personal reformation with the intent of universal conversion. For those city colonists who thrived and demonstrated their proper attitude to work, the second stage of the Darkest England scheme beckoned. This was the ‘Farm Colony.’ The Army intended to take select members of the urban poor who had demonstrated their willingness to work and submit to discipline and transplant them to training farms. Sir John Gorst QC MP wrote:The unemployed is taken away from the town where he competes with a congested mass of workers, too numerous for existing employment opportunities, and brought back to the land, where he produces more than he consumes, where his labour enriches the nation without lessening the earnings of his fellow workmen.[3]The Army in the UK bought a farm in Hadleigh, Essex, and developed it to receive colonists from the city. Similar farms were purchased in Australia, America, and South Africa. Farm colonists would work for the first month purely for bread and board. Then, if they demonstrated their willingness to learn, work, and behave, they would start to be paid. The farm colonists learned to work the land in small holdings or as tenant farmers. Some were returned to the city as unsuitable for the farm. Others were encouraged to purchase a 5-acre smallholding from the Army at favorable interest rates and become independent. But for others, they would be eligible for the third part of the Darkest England scheme — the Colony Across the Seas. The Colony Across the SeaHere, we come to the point at hand. The Darkest England scheme was dependent upon the British Empire. The Darkest England scheme could not have worked without the shared culture, language, infrastructure and transportation links. The fact that the scheme did not live up to its promise has less to do with the Empire and more to do with the incredible amount of funding necessary to make it practicable. Despite the relative failure of the Darkest England scheme beyond the city colony, the limited successes and the plans for the scheme highlight the inherent links between the Army and the Empire. William Booth said:It Is absurd to speak of the colonies as If they were a foreign land. They are simply pieces of Britain distributed about the world, enabling the Britisher to have access to the richest parts of the earth.[4]In the same way, the Army intended to send Britain’s poorest, properly trained and equipped, out to the parts of the Empire where land was underutilized. The movement from city to farm to overseas farm or factory was meant to become a new system built into the structure of Britain. By reducing the overall population and upskilling the urban poor, not only would Britain benefit, but the colonies would be developed. Ausubel wrote: Indeed, one of the purposes of the In Darkest England scheme itself was to bring about structural change, since Booth was one of those Victorian reformers who believed that as population was the root course of the long depression from the early 1870s to the late 1890s and that mass emigration was part of the answer to this problem.[5]The Army started supporting the emigration of its farm colonists to the colonies over the seas in 1891. Initially, colonists went to New South Wales and Queensland. By November 1891, 95 emigrants had been sent overseas by the Army with letters of recommendation for farms and factories in the receiving territories. The 1907 yearbook reported that since 1905, 15,000 people had emigrated through the Army’s agency. However, problems in the scheme were starting to emerge. A key example comes from New Zealand, where there was…Agitation against the scheme by Trades and Labour Councils…On the grounds that living standards of workers would be depressed by this introduction into the Colonies of what they termed ‘undesirable persons the Pauper and criminal scum of the alleys and byways of Great Britain.’[6]The colonies, especially New Zealand and Australia, did not want to receive people who had been destitute and dwelling in London’s slums until recently. The costs involved in emigration had, until then, helped to ensure that those emigrating from Britain had been able to support themselves on arrival. The Army supported the Salvationist colonists, but they were travelling to improve themselves and did not go with their own resources. Another issue was that William Booth and the Army had somewhat misunderstood the relationship between Britain and her colonies and dominions. By the early 1900s, the Empire was already starting to decentralize, especially in the self-governing states and dominions. Britain could not simply tell the governments of Australia, New Zealand, or South Africa to give spare land to colonists from The Salvation Army. The Army was not empowered to create new colonies, and the Imperial government could not provide the Army with new land. The Army was not given unused land in the existing colonies. The third stage of the Darkest England scheme seemed to be failing, so the Army had to turn to a broader approach to emigration.[7]Family Emigration Colonel David Lamb, the new commander of the emigration department, decided to broaden the project to include families as well as single men. This brought into reality some of William Booth's hopes for Darkest England. In the Salvation Ship we shall export them all – father, mother, and children. The individuals will be grouped in families, and the families will, on the farm colony, have been for some months part more or less near neighbours, meeting each other in the field, in the workshops, and in the religious services. It will resemble nothing so much as the unmouring of a little piece of England, and towing it across the sea to find a safe anchorage in a sunnier clime. The ship which takes out emigrants will have the produce of the farms, and constant travelling to and from will lead more than ever to the feeling that we and our ocean-sundered brothers are members of one family.[8]With Australia, New Zealand, and South Africa actively working against William Booth’s scheme of social imperialism, it was up to Canada to rescue Darkest England. The relationship between the Army emigration service and Canada developed until the Army became one of Canada’s leading immigration agencies, accredited and financially sponsored by the Canadian government and funded by direct donations in the UK. Between 1905 and 1907, the Army chartered fourteen ocean liners with a thousand immigrants on each. By the opening of the First World War, over 50,000 settlers had been supported in moving to Canada. By 1932, when the emigration service ended, more than 112,000 people from Britain had moved to Canada.The system was comprehensive. Corps officers in the UK advertised the scheme and supported families in applying for emigration through the Army’s agency. Social officers helped identify likely candidates from the shelters or Hadleigh Farm and made their applications to the agency. The emigration department also stationed agents in the Army’s labour exchange bureaus, particularly helping domestic servants emigrate. The Army also offered emigration insurance for the settlers. For 10 shillings, the traveler would be insured against loss of belongings and against the risk of not finding employment. Whilst most settlers using the Army’s emigration agency had a position organized on their behalf for when they arrived, some went without work waiting for them in the hope of finding a position. The Army would pay for their return to Britain if they did not find work. The Army chartered liners to carry the new colonists from the UK to Canada on an alcohol-free trip. They were accompanied on the ships by Salvation Army officers who led worship and prayer meetings, offered counsel, and gave lectures on the culture of the colonist's new home. The Salvationist colonists would then be welcomed by officers at receiving stations and transported to their new homes, where the local officer would make introductions and ensure they were connected to the corps. Then, if they did not join the local corps, they would receive a semi-annual visit from an Army officer to assess their progress. From start to finish, the whole scheme was operated as part of the Army’s international mission. ConclusionThe Army combined the structures and methods of the British Empire with an Evangelical Zeal for conversion and the belief that salvation was as much about this world as it was about the next. William Booth wrote:I saw that when the Bible said, ‘He that believeth shall be saved’ it meant not only saved from the miseries of the future world, but from the miseries of this [world] also. Then it came from the promise of Salvation here and now; from hell and sin and vice and crime and idleness and extravagance, and consequently very largely from poverty and disease, and the majority of kindred woes.[9]The Army's social reform work was grounded In the underlying principle that social transformation would only make a lasting difference to the world if it were combined with individual conversion. Helping the poor through social reformation was at least partially undertaken to remove the obstacles to salvation. A hungry person, a cold person, or a homeless person would not become a Christian. By removing them from their circumstances of poverty, giving them a trade, and moving them to a new land with a place to become independent, the individual would better themselves and society as well.However, far more critical for the Army was the hope that by transporting saved Salvationists around the world, they would create colonies of salvation which would spread the word of Salvationism. The central doctrine of Salvationism was that its members evangelized to the groups they had been part of. The converted drinker went back to preach to the drinkers. The sex workers told her previous colleagues about the possibility of rescue and redemption. Walker wrote:One of the most significant features of The Salvation Army was the relationships of its members to the wider community. As soon as people were saved, they were asked to stand before a crowd and relate their experience of conversion…If the Spirit of God pervaded an individual, he or she was ready to preach and testify regardless of previous sinfulness, lack of education, of inexperience.[10]Without the British Empire, its transportation network, its shared culture and language, and William Booth's implicit assumptions that the Imperial territories were simply an extension of Britain, The Salvation Army would not have been able to grow in the way it did. The British Empire was to be matched by a Salvation Empire, spread around the world, transporting Salvationists in ready-made units to the far reaches of Christendom to go out and grow William Booth’s Christian Imperium and usher in the prophesied Millennium.Christopher Button writes at Theology Corner (link here).Bibliography All The World – Salvation Army Publication Ausubel, Herman. In Hard Ties: Reformers Among the Late Victorians, (New York: Columbia University Press, 1960)Bradwell, Cyril R. Fight the Good Fight: The Story of The Salvation Army in New Zealand 1883-1983, (Wellington: Reed, 1982)Bradwell, Cyril R. Fight the Good Fight: The Story of The Salvation Army in New Zealand 1883-1983, (Wellington: Reed, 1982)Booth, William, In Darkest England and the Way Out, (London: The Salvation Army, 1890)Coutts, Frederick. Bread for my Neighbour: The Social Influence of William Booth, (London: Hodder \u0026 Stoughton, 1978)Sandall, Robert The History of The Salvation Army Volume III 1883-1953 Social and Welfare Work, (London: Thomas Nelson and Sons Ltd. 1955)Walker, Pamela J. Pulling the Devil’s Kingdon Down: The Salvation Army in Victorian Britain, (London: University of California, 2001)White, Arnold, The Great Idea: Notes by an Eye-Witness on Some of the Social Work of the Salvation Army, (London: The Salvation Army, 1910)[1] William Booth, quoted in Sandall, The History Vol. III, p. 120[2] Coutts, Bread for my Neighbour, pp. 106-107[3] John Gorst quoted in Coutts, Bread for my Neighbour, p. 78[4] William Booth, Darkest England, pp. 143-144[5] Ausubel, In Hard Times, p. 180[6] Bradwell, Fight the Good Fight, pp. 53-54[7] White, The Great Idea, p. 47-49[8] William Booth, In Darkest England, p. 152[9] William Booth, “Salvation to Both Worlds” All The World, January 1889 pp. 1-6[10] Walker, Pulling the Devil’s Kingdom Down, p. 187",
  "image": "http://static1.squarespace.com/static/50adfa2ae4b0cc1d786569eb/t/676de92f8c81ad7468532883/1735256367404/20250103+1024px-William_Booth.jpg?format=1500w",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-block-type=\"2\" id=\"block-44e46ec30e29659d4a79\"\u003e\n  \u003cp\u003e\u003cem\u003eThe Salvation Army (the Army) is predominantly known as an international charitable organization. For over a million people worldwide, it is an Evangelical church with its own distinctive polity and practice, owing its heritage to British Methodism and American Revivalism. Less well-known is that between 1891 and 1932, the Army supported over 100,000 men, women, and children to travel from Britain to her colonies across the sea. This Evangelical movement and engine for social reform became an emigration agency because they believed that moving the ‘surplus population’ out of Britain into unclaimed land in the colonies would reduce poverty, specifically urban deprivation, in the mother country.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://mytheologycorner.wordpress.com/\"\u003e\u003cspan\u003e\u003cem\u003eChristopher Button\u003c/em\u003e\u003c/span\u003e\u003c/a\u003e\u003cem\u003e explains.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv data-block-type=\"2\" id=\"block-yui_3_17_2_1_1735254393316_40169\"\u003e\n  \u003cp\u003e\u003cem\u003eSalvation Army co-founder William Booth.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIntroduction \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe Salvation Army began social service work in 1866, with the first food depots providing meals for dockers who had been laid off during the collapse of the Poplar shipyards. By the 1870s, social service work had transformed into social reform work. Early examples included the establishment of rescue homes for female sex workers who were trained to become domestic servants or given jobs such as bookbinders. They also set up sheltered workshops for unemployed or homeless men to enable them to learn a trade and return to work. According to William Booth, the simple principle was that:\u003c/p\u003e\u003cp\u003e\u003cem\u003eAny person who comes to a shelter destitute and starving, will be supplied with sufficient work to enable him to earn the fourpence needed for his bed and board. This is a fundamental feature of the scheme, and which I think will commend it to all those who are anxious to benefit the poor by enabling them to help themselves without the demoralising intervention of charitable relief…There is no compulsion upon anyone to resort to our shelters, but if a penniless man wants food her must, as a rule, do work sufficient to pay for what he has of that and of other accommodation. I say as a rule because, of course, our officers will be allowed to make exceptions in extreme cases.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn1\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[1]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe Victorian demand that people should lift themselves up by their bootstraps was adopted by the Army. The Army expected and demanded from the customers of its social relief efforts that they engage in hard work, commitment to personal transformation, and, where absolutely necessary, the absolute minimum of charity to allow them to do so. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIn Darkest England \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIn 1890, the Army released the blueprint for a new, totalizing, and universal scheme of social reform that would provide a system of welfare designed to work towards eradicating poverty and destitution and bring about the salvation of the world. This project was called \u003cem\u003eIn Darkest England and the Way Out, \u003c/em\u003ewritten principally by William Booth and published in 1890. It sold over 100,000 editions within the first few months. It was, in its way, quite a simple scheme. There were three parts to this scheme. Each was a form of colony, consciously adopting the structures of empire just as the book’s title borrowed from David Livingstone’s book \u003cem\u003eDarkest Africa\u003c/em\u003e. The language is telling and is something we will return to. \u003c/p\u003e\u003cp\u003eThe first step was the ‘City Colony’ including food depots, shelters, rescue work for women, salvage yards and ‘elevators.’ \u003c/p\u003e\u003cp\u003e\u003cem\u003eThe ‘Elevator’ was a new concept in social services, combining generous acceptance with patient but unwavering discipline. ‘No one brings a reference here’ explained an officer in charge of one such institution. ‘If a man is willing to work, he stays; if not, he goes.’ No guide line could be simpler for the entrant; none more demanding upon those who were seeking his rehabilitation…The elevator was, in effect, and entry form of ‘sheltered workshop’ – a concept which was little known at the time and consequently less understood.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn2\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[2]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe elevator was a combination of shelter and workshop or factory. Men could find somewhere to live and work in various trades to pay for their bed and board and gain enough stability to seek work in the trade they were learning. Central to every part of the city colony was regular, often daily, worship for all the residents. None were compelled to attend, but for many, it was an easy source of entertainment. Attendance at salvation meetings in the shelters across 1891 was recorded at 136,579, with 708 recorded as being converted. The work of social reform was undertaken hand in hand with the work of personal reformation with the intent of universal conversion. \u003c/p\u003e\u003cp\u003eFor those city colonists who thrived and demonstrated their proper attitude to work, the second stage of the Darkest England scheme beckoned. This was the ‘Farm Colony.’ The Army intended to take select members of the urban poor who had demonstrated their willingness to work and submit to discipline and transplant them to training farms. Sir John Gorst QC MP wrote:\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe unemployed is taken away from the town where he competes with a congested mass of workers, too numerous for existing employment opportunities, and brought back to the land, where he produces more than he consumes, where his labour enriches the nation without lessening the earnings of his fellow workmen.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn3\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[3]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe Army in the UK bought a farm in Hadleigh, Essex, and developed it to receive colonists from the city. Similar farms were purchased in Australia, America, and South Africa. Farm colonists would work for the first month purely for bread and board. Then, if they demonstrated their willingness to learn, work, and behave, they would start to be paid. The farm colonists learned to work the land in small holdings or as tenant farmers. Some were returned to the city as unsuitable for the farm. Others were encouraged to purchase a 5-acre smallholding from the Army at favorable interest rates and become independent. But for others, they would be eligible for the third part of the Darkest England scheme — the Colony Across the Seas. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Colony Across the Sea\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eHere, we come to the point at hand. The Darkest England scheme was dependent upon the British Empire. The Darkest England scheme could not have worked without the shared culture, language, infrastructure and transportation links. The fact that the scheme did not live up to its promise has less to do with the Empire and more to do with the incredible amount of funding necessary to make it practicable. Despite the relative failure of the Darkest England scheme beyond the city colony, the limited successes and the plans for the scheme highlight the inherent links between the Army and the Empire. William Booth said:\u003c/p\u003e\u003cp\u003e\u003cem\u003eIt Is absurd to speak of the colonies as If they were a foreign land. They are simply pieces of Britain distributed about the world, enabling the Britisher to have access to the richest parts of the earth.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn4\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[4]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIn the same way, the Army intended to send Britain’s poorest, properly trained and equipped, out to the parts of the Empire where land was underutilized. The movement from city to farm to overseas farm or factory was meant to become a new system built into the structure of Britain. By reducing the overall population and upskilling the urban poor, not only would Britain benefit, but the colonies would be developed. Ausubel wrote: \u003c/p\u003e\u003cp\u003e\u003cem\u003eIndeed, one of the purposes of the In Darkest England scheme itself was to bring about structural change, since Booth was one of those Victorian reformers who believed that as population was the root course of the long depression from the early 1870s to the late 1890s and that mass emigration was part of the answer to this problem.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn5\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[5]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe Army started supporting the emigration of its farm colonists to the colonies over the seas in 1891. Initially, colonists went to New South Wales and Queensland. By November 1891, 95 emigrants had been sent overseas by the Army with letters of recommendation for farms and factories in the receiving territories. The 1907 yearbook reported that since 1905, 15,000 people had emigrated through the Army’s agency. However, problems in the scheme were starting to emerge. \u003c/p\u003e\u003cp\u003eA key example comes from New Zealand, where there was…\u003c/p\u003e\u003cp\u003e\u003cem\u003eAgitation against the scheme by Trades and Labour Councils…On the grounds that living standards of workers would be depressed by this introduction into the Colonies of what they termed ‘undesirable persons the Pauper and criminal scum of the alleys and byways of Great Britain.’\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn6\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[6]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe colonies, especially New Zealand and Australia, did not want to receive people who had been destitute and dwelling in London’s slums until recently. The costs involved in emigration had, until then, helped to ensure that those emigrating from Britain had been able to support themselves on arrival. The Army supported the Salvationist colonists, but they were travelling to improve themselves and did not go with their own resources. \u003c/p\u003e\u003cp\u003eAnother issue was that William Booth and the Army had somewhat misunderstood the relationship between Britain and her colonies and dominions. By the early 1900s, the Empire was already starting to decentralize, especially in the self-governing states and dominions. Britain could not simply tell the governments of Australia, New Zealand, or South Africa to give spare land to colonists from The Salvation Army. The Army was not empowered to create new colonies, and the Imperial government could not provide the Army with new land. The Army was not given unused land in the existing colonies. The third stage of the Darkest England scheme seemed to be failing, so the Army had to turn to a broader approach to emigration.\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn7\" title=\"\"\u003e\u003cspan\u003e[7]\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFamily Emigration \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eColonel David Lamb, the new commander of the emigration department, decided to broaden the project to include families as well as single men. This brought into reality some of William Booth\u0026#39;s hopes for \u003cem\u003eDarkest England. \u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eIn the Salvation Ship we shall export them all – father, mother, and children. The individuals will be grouped in families, and the families will, on the farm colony, have been for some months part more or less near neighbours, meeting each other in the field, in the workshops, and in the religious services. It will resemble nothing so much as the unmouring of a little piece of England, and towing it across the sea to find a safe anchorage in a sunnier clime. The ship which takes out emigrants will have the produce of the farms, and constant travelling to and from will lead more than ever to the feeling that we and our ocean-sundered brothers are members of one family.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn8\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[8]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWith Australia, New Zealand, and South Africa actively working against William Booth’s scheme of social imperialism, it was up to Canada to rescue Darkest England. The relationship between the Army emigration service and Canada developed until the Army became one of Canada’s leading immigration agencies, accredited and financially sponsored by the Canadian government and funded by direct donations in the UK. Between 1905 and 1907, the Army chartered fourteen ocean liners with a thousand immigrants on each. By the opening of the First World War, over 50,000 settlers had been supported in moving to Canada. By 1932, when the emigration service ended, more than 112,000 people from Britain had moved to Canada.\u003c/p\u003e\u003cp\u003eThe system was comprehensive. Corps officers in the UK advertised the scheme and supported families in applying for emigration through the Army’s agency. Social officers helped identify likely candidates from the shelters or Hadleigh Farm and made their applications to the agency. The emigration department also stationed agents in the Army’s labour exchange bureaus, particularly helping domestic servants emigrate. The Army also offered emigration insurance for the settlers. For 10 shillings, the traveler would be insured against loss of belongings and against the risk of not finding employment. Whilst most settlers using the Army’s emigration agency had a position organized on their behalf for when they arrived, some went without work waiting for them in the hope of finding a position. The Army would pay for their return to Britain if they did not find work. \u003c/p\u003e\u003cp\u003eThe Army chartered liners to carry the new colonists from the UK to Canada on an alcohol-free trip. They were accompanied on the ships by Salvation Army officers who led worship and prayer meetings, offered counsel, and gave lectures on the culture of the colonist\u0026#39;s new home. The Salvationist colonists would then be welcomed by officers at receiving stations and transported to their new homes, where the local officer would make introductions and ensure they were connected to the corps. Then, if they did not join the local corps, they would receive a semi-annual visit from an Army officer to assess their progress. From start to finish, the whole scheme was operated as part of the Army’s international mission. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eConclusion\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe Army combined the structures and methods of the British Empire with an Evangelical Zeal for conversion and the belief that salvation was as much about this world as it was about the next. William Booth wrote:\u003c/p\u003e\u003cp\u003e\u003cem\u003eI saw that when the Bible said, ‘He that believeth shall be saved’ it meant not only saved from the miseries of the future world, but from the miseries of this [world] also. Then it came from the promise of Salvation here and now; from hell and sin and vice and crime and idleness and extravagance, and consequently very largely from poverty and disease, and the majority of kindred woes.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn9\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[9]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe Army\u0026#39;s social reform work was grounded In the underlying principle that social transformation would only make a lasting difference to the world if it were combined with individual conversion. Helping the poor through social reformation was at least partially undertaken to remove the obstacles to salvation. A hungry person, a cold person, or a homeless person would not become a Christian. By removing them from their circumstances of poverty, giving them a trade, and moving them to a new land with a place to become independent, the individual would better themselves and society as well.\u003c/p\u003e\u003cp\u003eHowever, far more critical for the Army was the hope that by transporting saved Salvationists around the world, they would create colonies of salvation which would spread the word of Salvationism. The central doctrine of Salvationism was that its members evangelized to the groups they had been part of. The converted drinker went back to preach to the drinkers. The sex workers told her previous colleagues about the possibility of rescue and redemption. Walker wrote:\u003c/p\u003e\u003cp\u003e\u003cem\u003eOne of the most significant features of The Salvation Army was the relationships of its members to the wider community. As soon as people were saved, they were asked to stand before a crowd and relate their experience of conversion…If the Spirit of God pervaded an individual, he or she was ready to preach and testify regardless of previous sinfulness, lack of education, of inexperience.\u003c/em\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftn10\" title=\"\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003e[10]\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWithout the British Empire, its transportation network, its shared culture and language, and William Booth\u0026#39;s implicit assumptions that the Imperial territories were simply an extension of Britain, The Salvation Army would not have been able to grow in the way it did. The British Empire was to be matched by a Salvation Empire, spread around the world, transporting Salvationists in ready-made units to the far reaches of Christendom to go out and grow William Booth’s Christian Imperium and usher in the prophesied Millennium.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eChristopher Button writes at Theology Corner (\u003c/em\u003e\u003c/strong\u003e\u003ca href=\"https://mytheologycorner.wordpress.com/\"\u003e\u003cspan\u003e\u003cstrong\u003e\u003cem\u003elink here\u003c/em\u003e\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003cstrong\u003e\u003cem\u003e).\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBibliography \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAll The World – \u003c/em\u003eSalvation Army Publication \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAusubel, Herman. \u003c/strong\u003e\u003cem\u003eIn Hard Ties: Reformers Among the Late Victorians, \u003c/em\u003e(New York: Columbia University Press, 1960)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBradwell, Cyril R. \u003c/strong\u003e\u003cem\u003eFight the Good Fight: The Story of The Salvation Army in New Zealand 1883-1983, \u003c/em\u003e(Wellington: Reed, 1982)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBradwell, Cyril R. \u003c/strong\u003e\u003cem\u003eFight the Good Fight: The Story of The Salvation Army in New Zealand 1883-1983, \u003c/em\u003e(Wellington: Reed, 1982)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBooth, William, \u003c/strong\u003e\u003cem\u003eIn Darkest England and the Way Out, \u003c/em\u003e(London: The Salvation Army, 1890)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCoutts, Frederick. \u003c/strong\u003e\u003cem\u003eBread for my Neighbour: The Social Influence of William Booth, \u003c/em\u003e(London: Hodder \u0026amp; Stoughton, 1978)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSandall, Robert \u003c/strong\u003e\u003cem\u003eThe History of The Salvation Army Volume III 1883-1953 Social and Welfare Work, \u003c/em\u003e(London: Thomas Nelson and Sons Ltd. 1955)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWalker, Pamela J. \u003c/strong\u003e\u003cem\u003ePulling the Devil’s Kingdon Down: The Salvation Army in Victorian Britain, \u003c/em\u003e(London: University of California, 2001)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWhite, Arnold, \u003c/strong\u003e\u003cem\u003eThe Great Idea: Notes by an Eye-Witness on Some of the Social Work of the Salvation Army, \u003c/em\u003e(London: The Salvation Army, 1910)\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref1\" title=\"\"\u003e\u003cspan\u003e[1]\u003c/span\u003e\u003c/a\u003e William Booth, quoted in Sandall, \u003cem\u003eThe History Vol. III, \u003c/em\u003ep. 120\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref2\" title=\"\"\u003e\u003cspan\u003e[2]\u003c/span\u003e\u003c/a\u003e Coutts, \u003cem\u003eBread for my Neighbour, \u003c/em\u003epp. 106-107\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref3\" title=\"\"\u003e\u003cspan\u003e[3]\u003c/span\u003e\u003c/a\u003e John Gorst quoted in Coutts, \u003cem\u003eBread for my Neighbour, \u003c/em\u003ep. 78\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref4\" title=\"\"\u003e\u003cspan\u003e[4]\u003c/span\u003e\u003c/a\u003e William Booth, \u003cem\u003eDarkest England, \u003c/em\u003epp. 143-144\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref5\" title=\"\"\u003e\u003cspan\u003e[5]\u003c/span\u003e\u003c/a\u003e Ausubel, \u003cem\u003eIn Hard Times, \u003c/em\u003ep. 180\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref6\" title=\"\"\u003e\u003cspan\u003e[6]\u003c/span\u003e\u003c/a\u003e Bradwell, \u003cem\u003eFight the Good Fight, \u003c/em\u003epp. 53-54\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref7\" title=\"\"\u003e\u003cspan\u003e[7]\u003c/span\u003e\u003c/a\u003e White, \u003cem\u003eThe Great Idea, \u003c/em\u003ep. 47-49\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref8\" title=\"\"\u003e\u003cspan\u003e[8]\u003c/span\u003e\u003c/a\u003e William Booth, \u003cem\u003eIn Darkest England, \u003c/em\u003ep. 152\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref9\" title=\"\"\u003e\u003cspan\u003e[9]\u003c/span\u003e\u003c/a\u003e William Booth, “Salvation to Both Worlds” \u003cem\u003eAll The World, \u003c/em\u003eJanuary 1889 pp. 1-6\u003c/p\u003e\u003cp\u003e\u003ca href=\"applewebdata://A49589F0-E9B6-4F47-A996-01AB3648A49D#_ftnref10\" title=\"\"\u003e\u003cspan\u003e[10]\u003c/span\u003e\u003c/a\u003e Walker, \u003cem\u003ePulling the Devil’s Kingdom Down, \u003c/em\u003ep. 187\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2025-01-03T14:17:00Z",
  "modifiedTime": null
}
