{
  "id": "238ca743-3f27-48d9-8b91-5b51fed74465",
  "title": "What Chicago Med Season 10 Episode 3’s Heartbreaking Ending Means For Hannah",
  "link": "https://www.tvfanatic.com/what-chicago-med-season-10-episode-3s-heartbreaking-ending-means-for-hannah/",
  "description": "Chicago Med Season 10 Episode 3’s heartbreaking ending left me in tears. There’ll be more fallout to come for Hannah now, … The post What Chicago Med Season 10 Episode 3’s Heartbreaking Ending Means For Hannah appeared first on TV Fanatic.",
  "author": "Jack Ori",
  "published": "Fri, 11 Oct 2024 20:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Editorials"
  ],
  "byline": "Jack Ori",
  "length": 5147,
  "excerpt": "Chicago Med Season 10 Episode 3's heartbreaking ending could mean a downward spiral for Hannah, and we're here for it.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "Chicago Med Season 10 Episode 3’s heartbreaking ending left me in tears. There’ll be more fallout to come for Hannah now, and I’m here for it even though I hate that for her. Hannah’s mental health issues might come to the surface again now that she’s suffered this devastating loss, among other reasons. (NBC/George Burns, Jr.) Why Hannah Lost A Patient During Chicago Med Season 10 Episode 3’s Heartbreaking Ending Hannah was devastated when her patient, Eloise, died on the operating table of a bleed. Eloise had been rushed back into surgery for bleeding problems hours after a successful C-section. In the last minutes of the hour, Hannah discovered that the bleeding was coming from Eloise’s liver, not her uterus. By then, it was too late to save her, leading to a devastating scene where Hannah tried for forty minutes to resuscitate her and had to be convinced to give up. Chicago Med Season 10 Episode 3’s heartbreaking ending happened for unclear reasons. Eloise might have had a pre-existing condition no one caught or Hannah might have made an error during the C-section that exacerbated her condition. Either way, Hannah could barely deal with the loss, continuing chest compressions long after the patient had passed away and ultimately running out of the OR in tears. (NBC/George Burns, Jr) Why Hannah Was So Devastated By Her Patient’s Death Hannah’s devastation after losing her patient wasn’t just about Eloise, though there were some powerful emotions at play there. After spending part of the hour trying to convince Eloise to trust her, Hannah felt good about being able to help her, but the plot twist of Eloise’s death completely threw her off. She had promised that Eloise would survive the surgery, so the unexpected death felt like a betrayal of that too-fragile trust she had built up. (NBC/George Burns, Jr) Plus, Eloise had almost become a friend. As a professional, Hannah knows not to get too close to her patients, yet they’d had several personal conversations in which Hannah shared some of her own feelings and experiences about family planning. That made Eloise more than a patient; she was someone Hannah enjoyed hanging out with, and now she was gone… and worse, Hannah might blame herself. Eloise showed symptoms of distress earlier that Hannah dismissed as typical post-pregnancy reactions, which was the same thing other doctors did that made Eloise distrust Hannah in the first place. (NBC/George Burns, Jr) Eloise’s seemingly unnecessary death was heartbreaking enough for Hannah, but it was made worse by everything else that was going on. In that same episode, Hannah dealt with Ripley castigating her for “going behind his back” to save him from throwing his career away for Scully. Lenox was also questioning her about whether the ED really needed a full-time OBGYN, implying that Hannah might be the next to be laid off. With all of that other stress, it’s not surprising that Hannah became overwhelmed with grief after Eloise’s death. It wasn’t just that she lost a patient or that the patient’s daughter would now grow up without a mother; it was that, on top of everything else that she had lost in this episode. (NBC/George Burns, Jr.) The pain, guilt, and grief that Hannah felt at the end of the episode is likely to be long-lasting. The idea of a person with an addiction problem relapsing during tough times is somewhat of a tired TV trope, but it would work in this case. Hannah’s powerful emotions over Eloise’s death, especially coupled with the other problems she’s dealing with, could tempt her to use to numb the pain. (NBC/George Burns, Jr) I can’t say I like the idea, per se. Someone close to me died of a drug overdose, and I’ve dedicated a good portion of my life to helping others avoid the same fate, so I don’t enjoy it when characters I love succumb to their addictions. But it would be strong drama that would also send the message that even the strongest people could relapse in times of stress. That’s important, because sometimes people get overconfident and assume that if they haven’t used in years, they’re done with that behavior, so they don’t have a plan to protect themselves from temptation. (NBC/George Burns, Jr) Even if Hannah does go this route, she’s likely to have some serious mental health issues as a result of losing Eloise, and that will probably continue through the rest of the season. If Hannah becomes a liability in the hospital’s eyes, she could lose her job, even if she doesn’t use again. Her relationship with Ripley is also up in the air. He was about to try to reconcile when the emergency happened with Eloise, but now their roles might be reversed, with Hannah being the one to push him away. Over to you, Chicago Med fanatics. What did you think of Chicago Med Season 10 Episode 3’s heartbreaking ending? What do you hope is next for Hannah? Hit the comments and let us know! Chicago Med airs on NBC on Wednesdays at 8/7c and on Peacock on Thursdays.",
  "image": "https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-814938\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\n\n\n\n\u003cp\u003eChicago Med Season 10 Episode 3’s heartbreaking ending left me in tears.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere’ll be more fallout to come for Hannah now, and I’m here for it even though I hate that for her.\u003c/p\u003e\n\n\n\n\u003cp\u003eHannah’s \u003ca href=\"https://www.tvfanatic.com/lists/19-most-moving-mental-health-stories-on-tv/\"\u003emental health\u003c/a\u003e issues might come to the surface again now that she’s suffered this devastating loss, among other reasons.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1000\" height=\"632\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes.jpg\" alt=\"Hannah asking a patient where it hurts on Chicago Med Season 10 Episode 3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes-300x190.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes-768x485.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes-960x607.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_05328_lowRes.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr.)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003ch2 id=\"h-why-hannah-lost-a-patient-during-chicago-med-season-10-episode-3-s-heartbreaking-ending\"\u003eWhy Hannah Lost A Patient During Chicago Med Season 10 Episode 3’s Heartbreaking Ending\u003c/h2\u003e\n\n\n\n\u003cp\u003eHannah was devastated when her patient, Eloise, died on the operating table of a bleed.\u003c/p\u003e\n\n\n\n\u003cp\u003eEloise had been rushed back into surgery for bleeding problems hours after a successful C-section.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eIn the last minutes of the hour, Hannah discovered that the bleeding was coming from Eloise’s liver, not her uterus. By then, it was too late to save her, leading to a devastating scene where Hannah tried for forty minutes to resuscitate her and had to be convinced to give up.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"http://tvfanatic.com/shows/chicago-med\"\u003eChicago Med\u003c/a\u003e Season 10 Episode 3’s heartbreaking ending happened for unclear reasons.\u003c/p\u003e\n\n\n\n\u003cp\u003eEloise might have had a pre-existing condition no one caught or Hannah might have made an error during the C-section that exacerbated her condition.\u003c/p\u003e\n\n\n\n\u003cp\u003eEither way, Hannah could barely deal with the loss, continuing chest compressions long after the patient had passed away and ultimately running out of the OR in tears.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1000\" height=\"593\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02405_lowRes.jpg\" alt=\"Hannah and Maggie working on another patient on Chicago Med S10 E3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02405_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02405_lowRes-300x178.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02405_lowRes-768x455.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02405_lowRes-960x569.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02405_lowRes.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003ch2 id=\"h-why-hannah-was-so-devastated-by-her-patient-s-death\"\u003eWhy Hannah Was So Devastated By Her Patient’s Death\u003c/h2\u003e\n\n\n\n\n\n\n\n\u003cp\u003eHannah’s devastation after losing her patient wasn’t just about Eloise, though there were some powerful emotions at play there.\u003c/p\u003e\n\n\n\n\u003cp\u003eAfter spending part of the hour trying to \u003cspan\u003econvince Eloise to trust her, Hannah felt good about being able to help her, but the \u003ca href=\"https://www.tvfanatic.com/lists/9-plot-twists-that-made-our-head-spin/\" target=\"_blank\" rel=\"noopener\"\u003eplot twist\u003c/a\u003e of Eloise’s death completely threw her off\u003c/span\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe had promised that Eloise would survive the surgery, so the unexpected death felt like a betrayal of that too-fragile trust she had built up.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03921_lowRes.jpg\" alt=\"Hannah sitting on her couch with her feet pulled up, wearing a green top and black pants on Chicago Med Season 10 Episode 3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03921_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03921_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03921_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03921_lowRes-960x640.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03921_lowRes.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003ePlus, Eloise had almost become a friend. \u003c/p\u003e\n\n\n\n\u003cp\u003eAs a professional, Hannah knows not to get too close to her patients, yet they’d had several personal conversations in which Hannah shared some of her own feelings and experiences about family planning.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat made Eloise more than a patient; she was someone Hannah enjoyed \u003ca href=\"https://www.tvfanatic.com/lists/13-characters-we-love-even-if-wed-never-hang-out-with-them/\"\u003ehanging out\u003c/a\u003e with, and now she was gone… and worse, Hannah might blame herself.\u003c/p\u003e\n\n\n\n\u003cp\u003eEloise showed symptoms of distress earlier that Hannah dismissed as typical post-pregnancy reactions, which was the same thing other doctors did that made Eloise distrust Hannah in the first place.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02764_lowRes.jpg\" alt=\"Hannah and Maggie try to save a comatose pregnant woman on Chicago Med Season 10 Episode 3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02764_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02764_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02764_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02764_lowRes-960x640.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_02764_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003eEloise’s seemingly \u003ca href=\"https://www.tvfanatic.com/lists/19-needless-tv-deaths-that-made-us-question-everything/\"\u003eunnecessary death\u003c/a\u003e was heartbreaking enough for Hannah, but it was made worse by everything else that was going on.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\u003cp\u003eIn that same episode, Hannah dealt with Ripley castigating her for “going behind his back” to save him from throwing his career away for Scully.\u003c/p\u003e\n\n\n\n\u003cp\u003eLenox was also questioning her about whether the ED really needed a full-time OBGYN, implying that Hannah might be the next to be laid off.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith all of that other stress, it’s not surprising that Hannah became overwhelmed with grief after Eloise’s death. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt wasn’t just that she lost a patient or that the patient’s daughter would now grow up without a mother; it was that, on top of everything else that she had lost in this episode.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"451\" height=\"555\" src=\"https://cdn.tvfanatic.com/uploads/2024/09/NUP_205246_01590_lowRes.jpg\" alt=\"Ripley coming out of an elevator that Hannah is facing on Chicago Med S10 E1\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/09/NUP_205246_01590_lowRes.jpg 451w, https://cdn.tvfanatic.com/uploads/2024/09/NUP_205246_01590_lowRes-244x300.jpg 244w\" sizes=\"(max-width: 451px) 100vw, 451px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/09/NUP_205246_01590_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr.)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003eThe pain, guilt, and grief that Hannah felt at the end of the episode is likely to be long-lasting.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe idea of a person with an addiction problem relapsing during tough times is somewhat of a \u003ca href=\"https://www.tvfanatic.com/lists/13-tired-tropes-tv-can-turn-on-their-heads/\"\u003etired TV trope\u003c/a\u003e, but it would work in this case.\u003c/p\u003e\n\n\n\n\u003cp\u003eHannah’s powerful emotions over Eloise’s death, especially coupled with the other problems she’s dealing with, could tempt her to use to numb the pain.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"697\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_06254_lowRes.jpg\" alt=\"Archer looking at something in a room while Hannah stares at him through a window on Chicago Med Season 10 Episode 3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_06254_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_06254_lowRes-300x209.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_06254_lowRes-768x535.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_06254_lowRes-960x669.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_06254_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eI can’t say I like the idea, per se. \u003c/p\u003e\n\n\n\n\u003cp\u003eSomeone close to me died of a drug overdose, and I’ve dedicated a good portion of my life to helping others avoid the same fate, so I don’t enjoy it when characters I love succumb to their addictions.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut it would be strong drama that would also send the message that even the strongest people could relapse in times of stress.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s important, because sometimes people get overconfident and assume that if they haven’t used in years, they’re done with that behavior, so they don’t have a plan to protect themselves from temptation.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03601_lowRes.jpg\" alt=\"The hospital board sitting and standing around a table on Chicago Med Season 10 Episode 3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03601_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03601_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03601_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03601_lowRes-960x640.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/NUP_205456_03601_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/George Burns, Jr)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003eEven if Hannah does go this route, she’s likely to have some serious mental health issues as a result of losing Eloise, and that will probably continue through the rest of the season.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf Hannah becomes a liability in the hospital’s eyes, she could lose her job, even if she doesn’t use again.\u003c/p\u003e\n\n\n\n\u003cp\u003eHer relationship with Ripley is also up in the air. He was about to try to reconcile when the emergency happened with Eloise, but now their roles might be reversed, with Hannah being the one to push him away.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003eOver to you, Chicago Med fanatics. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat did you think of Chicago Med Season 10 Episode 3’s heartbreaking ending? What do you hope is next for Hannah?\u003c/p\u003e\n\n\n\n\u003cp\u003eHit the comments and let us know!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eChicago Med airs on NBC on Wednesdays at 8/7c and on Peacock on Thursdays.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-11T20:00:00Z",
  "modifiedTime": "2024-10-11T15:48:48Z"
}
