{
  "id": "24e2a6fa-bba7-46fb-8ab1-45363f0e5157",
  "title": "Carrie Coon’s White Lotus Character Originally Had a Non-Binary Child — But That Was Cut After Trump’s Reelection",
  "link": "https://tvline.com/news/the-white-lotus-carrie-coon-laurie-non-binary-trans-trump-1235423902/",
  "description": "Real-life politics played a role in altering this season of The White Lotus. Carrie Coon, who plays Laurie in the current third season of the HBO dramedy, tells Harper’s Bazaar that Laurie’s child was revealed to be non-binary in a deleted scene: “There was a bit more context to her home life. You originally found […]",
  "author": "Dave Nemetz",
  "published": "Sun, 30 Mar 2025 21:25:09 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "News",
    "Carrie Coon",
    "HBO",
    "The White Lotus"
  ],
  "byline": "Dave Nemetz",
  "length": 1357,
  "excerpt": "'The White Lotus' star Carrie Coon says her character had a non-binary child in the original script — but Donald Trump's reelection changed that.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Real-life politics played a role in altering this season of The White Lotus. Carrie Coon, who plays Laurie in the current third season of the HBO dramedy, tells Harper’s Bazaar that Laurie’s child was revealed to be non-binary in a deleted scene: “There was a bit more context to her home life. You originally found out that her daughter was actually non-binary, maybe trans, and going by they/them.” But series creator Mike White decided to cut the scene in light of President Donald Trump’s reelection, Coon recalls: “The season was written before the election. And considering the way the Trump administration has weaponized the cultural war against transgender people even more since then, when the time came to cut the episode down, Mike felt that the scene was so small and the topic so big that it wasn’t the right way to engage in that conversation.” She does think the scene shed more light on her character, though: “It was only a short scene, but for me, it did make the question of whether Kate voted for Trump so much more provocative and personally offensive to Laurie, considering who her child is in the world.” (In Episode 3, Laurie and Jaclyn are shocked to find out that their friend Kate considers herself a political independent now and may have voted for Trump; see our conversation with Coon and co-star Leslie Bibb above.)",
  "image": "https://tvline.com/wp-content/uploads/2025/03/the-white-lotus-carrie-coon-laurie.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003eReal-life politics played a role in altering this season of \u003cem\u003e\u003ca href=\"https://tvline.com/t/the-white-lotus/\" id=\"auto-tag_the-white-lotus_1\" data-tag=\"the-white-lotus\"\u003eThe White Lotus\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://tvline.com/t/carrie-coon/\" id=\"auto-tag_carrie-coon_1\" data-tag=\"carrie-coon\"\u003eCarrie Coon\u003c/a\u003e, who plays Laurie in the current third season of the \u003ca href=\"https://tvline.com/t/hbo/\" id=\"auto-tag_hbo_1\" data-tag=\"hbo\"\u003eHBO\u003c/a\u003e dramedy, tells \u003cem\u003e\u003ca href=\"https://www.harpersbazaar.com/culture/film-tv/a64258074/carrie-coon-white-lotus-interview/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eHarper’s Bazaar\u003c/a\u003e\u003c/em\u003e that Laurie’s child was revealed to be non-binary in a deleted scene: “There was a bit more context to her home life. You originally found out that her daughter was actually non-binary, maybe trans, and going by they/them.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBut series creator Mike White decided to cut the scene in light of President Donald Trump’s reelection, Coon recalls: “The season was written before the election. And considering the way the Trump administration has weaponized the cultural war against transgender people even more since then, when the time came to cut the episode down, Mike felt that the scene was so small and the topic so big that it wasn’t the right way to engage in that conversation.”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eShe does think the scene shed more light on her character, though: “It was only a short scene, but for me, it did make the question of whether Kate voted for Trump so much more provocative and personally offensive to Laurie, considering who her child is in the world.” (In Episode 3, Laurie and Jaclyn are shocked to find out that their friend Kate considers herself a political independent now and \u003ca href=\"https://tvline.com/interviews/the-white-lotus-season-3-episode-3-carrie-coon-leslie-bibb-interview-trump-1235414788/\"\u003emay have voted for Trump\u003c/a\u003e; see our conversation with Coon and co-star Leslie Bibb above.) \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-30T21:25:09Z",
  "modifiedTime": "2025-03-30T21:28:15Z"
}
