{
  "id": "42f2c89c-9356-411e-901b-4f2f9c1a273e",
  "title": "Suits Star Rick Hoffman Returning as Louis Litt on NBC Spinoff",
  "link": "https://tvline.com/casting-news/suits-la-rick-hoffman-returning-louis-litt-1235416385/",
  "description": "Rick Hoffman is bringing some Louis Litt energy to Suits LA. The actor, who starred in all nine seasons of the original USA Network drama, will reprise his role in an episode of the NBC offshoot, TVLine has confirmed. Hoffman is expected to appear in just one episode, but the door is open for him […]",
  "author": "Vlada Gelman",
  "published": "Thu, 06 Mar 2025 00:31:46 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "Casting News",
    "casting-news",
    "NBC",
    "Rick Hoffman",
    "Suits",
    "Suits LA"
  ],
  "byline": "Vlada Gelman",
  "length": 2174,
  "excerpt": "Original 'Suits' star Rick Hoffman will reprise his role as Louis Litt on the NBC spinoff 'Suits LA' — get more details!",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Rick Hoffman is bringing some Louis Litt energy to Suits LA. The actor, who starred in all nine seasons of the original USA Network drama, will reprise his role in an episode of the NBC offshoot, TVLine has confirmed. Hoffman is expected to appear in just one episode, but the door is open for him to return if the series is renewed for Season 2, according to our sister site Deadline, which first reported the news. He will be the second cast member from the OG Suits to grace the spinoff: As previously announced, Gabriel Macht has booked a three-episode arc as charming prosecutor-turned-corporate lawyer Harvey Specter. Hoffman and Macht’s episodes will not overlap, per Deadline. Suits and Suits LA creator Aaron Korsh recently told TVLine that Macht is just the beginning when it comes familiar faces on the new show. “Harvey is not the only Suits original character that we’re going to see this season. There will be at least one other original Suits character. I’m not going to say at what level,” Korsh revealed. Korsh added that his goal is to have any cast members from the USA Network drama — which also starred Patrick J. Adams, Meghan Markle, Gina Torres and Sarah Rafferty, among others — “pop up, as organically as possible, and not flood the show with a parade of old Suits characters.” “I know that’s what fans want, but I feel like if it’s just a parade of old Suits characters, it would sort of harm the new franchise,” Korsh continued, “and I don’t think it would do a lot of favors to the old franchise either.” As for Harvey’s upcoming appearance, he will be seen in the flashback timeline before he, eventually, pops up in the present and, hopefully, reconnects with Stephen Amell’s character, entertainment lawyer Ted Black. “Ted was a prosecutor in New York at the time that Harvey was working in New York, so they, clearly, would’ve known each other,” Korsh shared. “Now, they didn’t work in the same office. Ted was a U.S. Attorney, but Harvey was in the District Attorney’s office. So what I came up with was they both played in this prosecutors’ league baseball team.” Suits LA airs Sundays at 9/8c on NBC.",
  "image": "https://tvline.com/wp-content/uploads/2025/03/suits-la-rick-hoffman.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003e\u003ca href=\"https://tvline.com/t/rick-hoffman/\" id=\"auto-tag_rick-hoffman\" data-tag=\"rick-hoffman\"\u003eRick Hoffman\u003c/a\u003e is bringing some Louis Litt energy to \u003cem\u003e\u003ca href=\"https://tvline.com/t/suits-la/\"\u003eSuits LA\u003c/a\u003e\u003c/em\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe actor, who starred in all nine seasons of the original USA Network drama, will reprise his role in an episode of the \u003ca href=\"https://tvline.com/t/nbc/\" id=\"auto-tag_nbc\" data-tag=\"nbc\"\u003eNBC\u003c/a\u003e offshoot, TVLine has confirmed.\u003c/p\u003e\n\n\n\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235412944\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"threeByTwo\" data-round=\"false\"\u003e\u003ca href=\"https://tvline.com/casting-news/suits-characters-returning-la-spinoff-series-nbc-1235412944/\" title=\"\" target=\"_self\" data-card-index=\"0\" data-post-id=\"1235412944\"\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://tvline.com/wp-content/uploads/2023/10/suits-cast-usa-network.jpg.webp?w=300\u0026amp;h=200\u0026amp;crop=1\" alt=\"Suits reunion panel ATX TV panel\" height=\"200\" width=\"300\" loading=\"lazy\" data-attachment-id=\"1235059954\" data-wp-size=\"nova_size__threebytwo_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235411677\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"threeByTwo\" data-round=\"false\"\u003e\u003ca href=\"https://tvline.com/interviews/suits-la-series-premiere-recap-ending-explained-harvey-1235411677/\" title=\"\" target=\"_self\" data-card-index=\"1\" data-post-id=\"1235411677\"\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://tvline.com/wp-content/uploads/2025/01/suits-la-trailer.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\" alt=\"Suits LA\" height=\"200\" width=\"300\" loading=\"lazy\" data-attachment-id=\"1235402133\" data-wp-size=\"nova_size__threebytwo_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\u003cp\u003eHoffman is expected to appear in just one episode, but the door is open for him to return if the series is renewed for Season 2, according to our sister site \u003ca href=\"https://deadline.com/2025/03/nbc-suits-la-rick-hoffman-cast-1236312046/\" target=\"_blank\"\u003eDeadline\u003c/a\u003e, which first reported the news. He will be the second cast member from the OG \u003cem\u003e\u003ca href=\"https://tvline.com/t/suits/\" id=\"auto-tag_suits\" data-tag=\"suits\"\u003eSuits\u003c/a\u003e\u003c/em\u003e to grace the spinoff: As previously announced, \u003ca href=\"https://tvline.com/casting-news/suits-la-spinoff-gabriel-macht-returns-harvey-specter-1235379442/\"\u003eGabriel Macht has booked a three-episode arc\u003c/a\u003e as charming prosecutor-turned-corporate lawyer Harvey Specter. Hoffman and Macht’s episodes will not overlap, per Deadline.  \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eSuits\u003c/em\u003e and \u003cem\u003eSuits LA\u003c/em\u003e creator \u003ca href=\"https://tvline.com/casting-news/suits-characters-returning-la-spinoff-series-nbc-1235412944/\"\u003eAaron Korsh recently told TVLine\u003c/a\u003e that Macht is just the beginning when it comes familiar faces on the new show.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Harvey is not the only \u003cem\u003eSuits\u003c/em\u003e original character that we’re going to see this season. There will be at least one other original \u003cem\u003eSuits \u003c/em\u003echaracter. I’m not going to say at what level,” Korsh revealed.\u003c/p\u003e\n\n\n\n\u003cp\u003eKorsh added that his goal is to have any cast members from the USA Network drama — which also starred Patrick J. Adams, Meghan Markle, Gina Torres and Sarah Rafferty, among others — “pop up, as organically as possible, and not flood the show with a parade of old \u003cem\u003eSuits\u003c/em\u003e characters.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“I know that’s what fans want, but I feel like if it’s just a parade of old \u003cem\u003eSuits\u003c/em\u003e characters, it would sort of harm the new franchise,” Korsh continued, “and I don’t think it would do a lot of favors to the old franchise either.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAs for Harvey’s upcoming appearance, he will be seen in the flashback timeline before he, eventually, pops up in the present and, hopefully, reconnects with Stephen Amell’s character, entertainment lawyer Ted Black.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Ted was a prosecutor in New York at the time that Harvey was working in New York, so they, clearly, would’ve known each other,” Korsh shared. “Now, they didn’t work in the same office. Ted was a U.S. Attorney, but Harvey was in the District Attorney’s office. So what I came up with was they both played in this prosecutors’ league baseball team.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eSuits LA \u003c/em\u003eairs Sundays at 9/8c on NBC.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-06T00:31:46Z",
  "modifiedTime": "2025-03-06T00:42:01Z"
}
