{
  "id": "648c08fc-f9a7-4909-a8e9-5ac7e1f9dc70",
  "title": "NCIS: Katrina Law Teases ‘Unique,’ Timey-Wimey Season 22 Premiere That Leads to ‘Big Cliffhanger’",
  "link": "https://tvline.com/interviews/ncis-season-22-jessica-react-team-katrina-law-preview-1235348821/",
  "description": "Alden Parker’s NCIS team just isn’t the same with Jessica Knight not on it. Literally. Season 22, which premieres this Monday at a special time (8/7c on CBS), picks up some six months after Jessica bid D.C. (and beau Jimmy Palmer) adieu, to head up the REACT Team based out of Camp Pendleton. Knight’s exit […]",
  "author": "Matt Webb Mitovich",
  "published": "Sun, 13 Oct 2024 00:00:00 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "Interviews",
    "CBS",
    "Katrina Law",
    "NCIS",
    "previews"
  ],
  "byline": "Matt Webb Mitovich",
  "length": 3449,
  "excerpt": "Katrina Law teases an 'NCIS' Season 22 premiere that plays with time in \"unique\" and \"fun\" ways.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Alden Parker’s NCIS team just isn’t the same with Jessica Knight not on it. Literally. Season 22, which premieres this Monday at a special time (8/7c on CBS), picks up some six months after Jessica bid D.C. (and beau Jimmy Palmer) adieu, to head up the REACT Team based out of Camp Pendleton. Knight’s exit “kicked off a chain of reaction of changes for the rest of the NCIS team,” Katrina Law previews for TVLine. “We find Torres (Wilmer Valderrama) has gone back to his roots and is now on an undercover mission, and McGee (Sean Murray) is interviewing for a new job [as NCIS Deputy Director]. That leaves Parker (Gary Cole) sitting alone at his desk in the bullpen, staring at all of our empty desks.” Ergo the season premiere’s title, “Empty Nest.” Knight meanwhile is “fully immersed” in her REACT job, “at the very beginning stages of a huge personal growth,” Law notes. “For years now she has been happily cruising in the shadow of her very high-powered father, but the freedom and the strength that Knight finds in making career and personal decisions that are 100-percent her own, it’s quite liberating.” On the flip side, “that also means that any mistakes, any regrets that she has, now falls squarely on her shoulders,” Law says. “She’s at a stage right now where you basically see her going, ‘I couldn’t make my dad happy, I couldn’t make Jimmy happy, so you know what? I’m just going to do my own thing, purely based off of my wants and needs, and not include anybody else.” Speaking of Knight’s mistakes…. The season opens in jarring fashion, with her holding a clergyman (!) hostage (!!) in the REACT Training Center, and demanding to get a lawyer, to hash out the sticky situation. But unlike TV’s usual, tried-and-true in media res gimmick (where we’d then get a “24 HOURS EARLIER” chyron), Knight’s dilemma plays out in real time, with occasional flashbacks to how she got in this mess. “All of a sudden we kind of start going back and forth between what happened that led up to the day, and it’s this whole, ‘What’s happening? Who’s telling the truth? Who trusts who?’ thing,” Law teases. “It’s quite exciting and unique, and a lot of fun.” Amidst the hostage drama, might the season opener find time to give viewers a sense of where things stand for Jessica and Jimmy (Brian Dietzen), whose relationship was already getting a bit wobbly ahead of her decision to leave D.C. for San Diego? “You will get a sense,” Law allows, explaining that Jimmy’s daughter “has been making sure that we have been staying in touch.” So, Victoria is on Team #KnightInShiningPalmer…? “Very much so,” Law confirms with a smile. Meanwhile back in the big orange room, Vance (Rocky Carroll) and McGee will find their efforts to help Torres with his undercover op repeatedly stymied by a new character, Inspector General LaRoche (played by Castle vet Seamus Dever and a seemingly endless supply of mints). Will Jessica’s puzzling hostage sitch somehow result in her rejoining Parker’s team, and on a full-time basis? Law is mum, but teases at lease one cliffhanger to come. “We have some questions that are definitively answered” at the end of the season opener, she says, “but then there is one big cliffhanger that is going to take us throughout the season.” Want scoop on NCIS, or for any other TV show? Email InsideLine@tvline.com, and your question may be answered via Matt’s Inside Line!",
  "image": "https://tvline.com/wp-content/uploads/2024/10/ncis-season-22-jessica-return.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003eAlden Parker’s \u003ca href=\"https://tvline.com/t/ncis/\" id=\"auto-tag_ncis\" data-tag=\"ncis\"\u003eNCIS\u003c/a\u003e team just isn’t the same with Jessica Knight not on it.\u003c/p\u003e\n\n\n\u003cdiv data-alias=\"cards__inner\" data-post-id=\"1235346709\" data-component=\"cards-related-content\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"inline\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\" data-collapse-to-xs=\"false\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"threeByTwo\" data-round=\"false\"\u003e\u003ca href=\"https://tvline.com/features/ncis-hawaii-season-3-blooper-reel-dvd-exclusive-1235346709/\" title=\"\" target=\"_self\" data-card-index=\"1\" data-post-id=\"1235346709\"\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://tvline.com/wp-content/uploads/2024/10/ncis-hawaii-season-3-gag-reel-bloopers.png?w=300\u0026amp;h=200\u0026amp;crop=1\" alt=\"NCIS Hawaii Blooper Reel\" height=\"200\" width=\"300\" loading=\"lazy\" data-attachment-id=\"1235346710\" data-wp-size=\"nova_size__threebytwo_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003e\u003cem\u003eLiterally\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eSeason 22, which premieres this Monday at a special time (8/7c on \u003ca href=\"https://tvline.com/t/cbs/\" id=\"auto-tag_cbs\" data-tag=\"cbs\"\u003eCBS\u003c/a\u003e), picks up some six months after Jessica bid D.C. (\u003cem\u003eand\u003c/em\u003e beau Jimmy Palmer) adieu, to head up the REACT Team based out of Camp Pendleton. \u003c/p\u003e\n\n\n\n\u003cp\u003eKnight’s exit “kicked off a chain of reaction of changes for the rest of the NCIS team,” \u003ca href=\"https://tvline.com/t/katrina-law/\" id=\"auto-tag_katrina-law\" data-tag=\"katrina-law\"\u003eKatrina Law\u003c/a\u003e \u003ca href=\"https://tvline.com/t/previews/\" id=\"auto-tag_previews\" data-tag=\"previews\"\u003epreviews\u003c/a\u003e for TVLine. “We find Torres (Wilmer Valderrama) has gone back to his roots and is now on an undercover mission, and McGee (Sean Murray) is interviewing for a new job [as NCIS Deputy Director]. That leaves Parker (Gary Cole) sitting alone at his desk in the bullpen, staring at all of our empty desks.” \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eErgo the season premiere’s title, “Empty Nest.”\u003c/p\u003e\n\n\n\n\u003cp\u003eKnight meanwhile is “fully immersed” in her REACT job, “at the very beginning stages of a huge personal growth,” Law notes. “For years now she has been happily cruising in the shadow of her very high-powered father, but the freedom and the strength that Knight finds in making career and personal decisions that are 100-percent her own, it’s quite liberating.”\u003c/p\u003e\n\n\n\n\u003cp\u003eOn the flip side, “that also means that any mistakes, any regrets that she has, now falls squarely on her shoulders,” Law says. “She’s at a stage right now where you basically see her going, ‘I couldn’t make my dad happy, I couldn’t make Jimmy happy, so you know what? I’m just going to do my own thing, purely based off of my wants and needs, and not include anybody else.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSpeaking of Knight’s mistakes…. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe season opens in jarring fashion, with her holding a clergyman (!) hostage (!!) in the REACT Training Center, and demanding to get a lawyer, to hash out the sticky situation. But unlike TV’s usual, tried-and-true \u003cem\u003ein media res\u003c/em\u003e gimmick (where we’d then get a “24 HOURS EARLIER” chyron), Knight’s dilemma plays out in real time, with occasional flashbacks to how she got in this mess.\u003c/p\u003e\n\n\n\n\u003cp\u003e“All of a sudden we kind of start going back and forth between what happened that led up to the day, and it’s this whole, ‘What’s happening? Who’s telling the truth? Who trusts who?’ thing,” Law teases. “It’s quite exciting and unique, and a lot of fun.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAmidst the hostage drama, might the season opener find time to give viewers a sense of where things stand for Jessica and Jimmy (Brian Dietzen), whose relationship was already getting a bit wobbly ahead of her decision to leave D.C. for San Diego?\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“You will get a \u003cem\u003esense\u003c/em\u003e,” Law allows, explaining that Jimmy’s daughter “has been making sure that we have been staying in touch.”  So, Victoria is on Team #KnightInShiningPalmer…? “Very much so,” Law confirms with a smile.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"630\" height=\"420\" src=\"https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg\" alt=\"\" srcset=\"https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg 630w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=200,133 200w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=300,200 300w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=150,100 150w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=600,400 600w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=281,187 281w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=244,163 244w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=143,95 143w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=60,40 60w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=252,168 252w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=506,337 506w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=225,150 225w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=450,300 450w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=110,73 110w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=285,190 285w, https://tvline.com/wp-content/uploads/2024/10/ncis-laroche-22x01-1.jpg?resize=320,213 320w\" sizes=\"(max-width: 630px) 100vw, 630px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eMeanwhile back in the big orange room, Vance (Rocky Carroll) and McGee will find their efforts to help Torres with his undercover op repeatedly stymied by a new character, Inspector General LaRoche (played by \u003cem\u003eCastle\u003c/em\u003e vet Seamus Dever and a seemingly endless supply of mints).\u003c/p\u003e\n\n\n\n\u003cp\u003eWill Jessica’s puzzling hostage sitch somehow result in her rejoining Parker’s team, and on a full-time basis? Law is mum, but teases at lease one cliffhanger to come.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We have some questions that are definitively answered” at the end of the season opener, she says, “but then there is one big cliffhanger that is going to take us throughout the season.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e\u003cmark\u003eWant scoop on \u003cem\u003eNCIS\u003c/em\u003e, or for any other TV show\u003c/mark\u003e? Email \u003ca href=\"mailto:InsideLine@tvline.com\"\u003eInsideLine@tvline.com\u003c/a\u003e, and your question may be answered via Matt’s Inside Line!\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-13T00:00:00Z",
  "modifiedTime": "2024-10-12T18:35:25Z"
}
