{
  "id": "ab66c6a1-9082-4a21-bf76-287f394142d6",
  "title": "Survivor Turns 25: Season 3 Winner Ethan Zohn Thought His Game Was ‘Ruined’ After Show’s Shocking First Tribe Swap: ‘This Is It, It’s Over’",
  "link": "https://tvline.com/features/survivor-ethan-zohn-first-tribe-swap-season-3-africa-1235451823/",
  "description": "In honor of Survivor’s 25th anniversary on May 31, TVLine is spotlighting the most iconic, unforgettable moments from the series that helped redefine reality television. Today, we’re tackling the show’s very first tribe swap in Season 3, but be sure to revisit the jaw-dropping Borneo finale moment where Sue Hawk had a thing or two to […]",
  "author": "Nick Caruso",
  "published": "Thu, 29 May 2025 01:00:00 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "Features",
    "CBS",
    "Ethan Zohn",
    "Survivor"
  ],
  "byline": "Nick Caruso",
  "length": 12084,
  "excerpt": "To celebrate Survivor's 25th anniversary, TVLine talks to Season 3 winner Ethan Zohn to break down the series' very first tribe swap ever.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "In honor of Survivor’s 25th anniversary on May 31, TVLine is spotlighting the most iconic, unforgettable moments from the series that helped redefine reality television. Today, we’re tackling the show’s very first tribe swap in Season 3, but be sure to revisit the jaw-dropping Borneo finale moment where Sue Hawk had a thing or two to say about snakes and rats. And stay tuned to TVLine later this week for more! On Day 13 of Survivor: Africa, the game marked a milestone. No, Jeff Probst didn’t utter those three magical words that get every Survivor fan salivating — “Drop your buffs” — but the sentiment was the same. A bombshell was dropped that would send a ripple through the game’s third season, disrupting all of the gameplay that had transpired, destroying many of the cast’s plans and rewriting fate for those who might have been in trouble. Probst dropped one of reality TV’s very first twists and it was a biggie: a tribe swap! After the game’s fourth Tribal Council, both tribes received a bit of ominous tree mail: “Pick three from your tribe to go on a quest,” it said. When the six selected contestants — Samburu’s Teresa “T-Bird” Cooper, Silas Gaither and Frank Garrison, plus Boran’s Kelly Goldsmith, Tom Buchanan and Lex van den Berghe — arrived to meet Jeff in the middle of Kenya’s Shaba National Reserve, he dropped that game-changing hammer. The three chosen Samburu tribemates were now members or Boran, and vice versa. Back when the season aired (from October 11, 2001—January 10, 2002), fans could never have dreamt of a shake-up of this magnitude. When The Australian Outback followed Borneo, it certainly didn’t stray from the formula we viewers had foolishly and blindly expected. But that fateful day in Kenya would not only change how things would unravel for the six swapped players, but also for those waiting back at camp, eagerly anticipating what the heck was about to happen. Below, Survivor: Africa winner Ethan Zohn talks to TVLine about the tribe swap he experienced on his first season, from what camp life felt like post-swap to how it complicated his game come merge. He also shares some words about his relationship with his late friend and former alliance member Kim Johnson, who passed away last year. TVLINE | Thinking back to the tribe swap in the Africa season, what was your gut reaction when T-Bird, Frank and Silas showed up to the Boran camp?  ETHAN ZOHN | Going into that moment, I was in a fairly strong alliance with Lex and Tom, and then I had my own side alliance with Kim Johnson. So when they said, “Hey, pick three players to go on a trip,” little did we know that it was the first tribe swap. So when I saw those three folks arrive, we had definitely not spoken to each other yet. I didn’t know them other than competing against them in challenges. I was like, “This is it. My game’s done. I’m ruined,” because Lex, Tom and I were kind of running the show on our tribe and all of a sudden my two closest allies, friends and co-conspirators in Survivor were gone, so it was a perfect opportunity for Kim to jump ship and join with Silas, Frank and T-Bird. So I was like, “Oh my God, this is it. It’s over,” and then on the flip side, I’m like, “Oh, that was pretty clever. That’s sneaky, Survivor! Well played.”   So then, I was actively looking for ways to keep the numbers, so we lost on purpose — not to mention, if you’re looking at character development and archetypes on the show, Silas, I felt, was competition. An athletic young guy. That was kind of our role. I was a soccer player, he was a football guy. So not only is this guy potentially better physically than I am, clearly he was running the show in the other tribe. I’m like, “We’ve got to get him out. This is not good for me.” So we threw the challenge on purpose so we could lose and vote Silas out. And I think that was one of the first times any tribe has lost on purpose for the sake of the greater goal, which was to obviously make it to the end of the game.  TVLINE | It was one of the biggest and earliest twists in the early-aughts boom of reality TV series. What was the shock level of your tribemates and what was the vibe around camp after the new people showed up?  The vibe was OK because what we learned was that on the other tribe, the young and the old had fractured, so it was kind of like the young people versus the old people on that original tribe. Frank and T-Bird were revived. They were excited about this because they were going to be picked off one by one by the young people, Lindsey [Richter], Brandon [Quinton], Silas and Kim [Powers]. So, Frank and T-Bird were psyched. They have a new life here on our tribe and they were quick to align with us to vote out Silas because they didn’t like him as a human and they didn’t like the way he was playing the game, and they were next in line to get voted out. So I think they were psyched and I welcomed that because the numbers for us were great to get off Silas. This is all going on, but in my mind I’m like, “Oh s–t. The same thing could happen with Lex and Tom and Kelly on the other side, and they could easily align with the remaining people over there.” So when we come back for the merge, my alliance could be ruined. I had high hopes that we would stay true to our alliance, but you never know. When we went to play them in the challenges, [we were] trying to get eye contact, head nods, like, “Is everything OK?” because you’re not allowed to talk to each other, but it was really difficult to determine if we were still aligned or if they now merged with this other tribe to go forward. It was anxiety-provoking. I just wanted to get to the merge so I could talk to them and get an understanding of where their head was at. Luckily, it all worked out.  It complicated the merge a little bit, however, it was a rare time. I mean, this is early days, don’t forget, so honor, integrity and alliances were a huge part of the game and you actually see that in the current season of 48 [this interview was conducted before the Season 48 finale], which is shocking to me that there are people trying to play the honor/trust/loyalty game, and it’s working. I don’t think it’s a winning strategy anymore. I do think back in the day that you could be a nice guy and that was a winning strategy. I just don’t think it’s possible today.  TVLINE | Africa seemed like one of the most brutal locations the show has ever visited. How did your experience in Kenya differ from Panama [All-Stars] and Fiji [Winners at War]?  Yeah, I can agree with you on that one. Having played three times, environmentally, Africa was by far the most difficult. Africa, in its own right, I think is one of the only locations that had a real threat of animals. There were lions there and Cape buffalo and elephants and giraffes. They said there were guys with guns out there, but I did not see them. I hope they were! They give you these Hollywood prop spears on Survivor, and I’m like, “What the hell am I going to do with this?” [Laughs] You’ll know which lion killed me because maybe it’ll be loosely hanging out of the side of its skin, but that’s it.   We had to have two fires going once sun went down. Some people don’t realize that we had to take a night shift on Survivor: Africa. So not only were we sleeping on the ground, two people every night had to stay up all night to make sure the fire was going and then you had to do what you did the next day. Africa, as an environment, was tough. We had a water source. We shared that water source with the animals. It was a 45-minute walk to get there, and a 45-minute walk back. Water was a really limiting factor because we only had what we could hold in our canteen. There wasn’t a well. We won a big jug, but until we won that jug, there was no way to hold your water.  TVLINE | You wound up beating Kim by a vote of 5-2. Heading into that final Tribal Council, how confident were you that you’d win?  I was confident, however, going through my mind was the Colby/Tina situation, which I feel, literally, we replicated. Kim was an older woman. She stuck by my side. We were an alliance. I was kind of a younger guy, really good at challenges, blah blah blah. So I’m like, “Oh s–t. Kim could take this thing if people are in the same mindset as they were during Survivor: Australia. Then, I made the tragic error — well, not tragic error. I was pretty confident I wasn’t getting his vote anyway — it was Brandon. His question was, “Who is the person on the jury that you think is least deserving to sit next to you up there?” And I looked at him in the eye and said, “You,” and he’s like, “Oh,” which was an honest answer. However, if I had lied, I probably would have gotten his vote and won 6-to-1 versus 5-to-2, but I think he was just bitter that I said that it was him.  TVLINE | I was sorry to hear about the loss of Kim. Had you kept in touch with her throughout the years?  Kim, rest in peace. She passed away this past year. Yeah, I had. We obviously had a great bond when we were on the show and then stayed in touch for all these years after. A few years, 2010 to 2013-ish, we weren’t in touch so much just because I was going through some s–t, but after that we picked it up. She’s always been supportive of me and my charitable efforts and philanthropy. She’s told me multiple times over the years that she’s happy with her choice. She had a choice to choose Lex or myself to go to the Final 3 and she chose me. She always said that she’s so happy with that choice and that she was happy that I won and used the money for good.  TVLINE | Survivor has been on the air for 25 years now, so clearly the show has gone through multiple evolutions since Season 3. Have you kept up with the New Era? Any thoughts on the shorter 26-day game?  I’m still a huge fan of the show, and it’s not better or worse. It’s just different. I’m an old school guy. I kind of like the old school game a little bit better. I feel that there’s so many alternative ways to make it to the end that are out of your control and there’s a lot of luck involved. There’s a lot of risk versus reward, luck, chance, versus in the old school days, it really was just you. You had to navigate your way through the game with the people and the challengers and the environment around you to be the Sole Survivor. You couldn’t lean on anything else. There weren’t idols, ways to get back in the game, advantages, disadvantages, journeys, Exile Island, Edge of Extinction, fire tokens… there was none of that. It was based on you and you alone. It takes a certain type of person to be able to do that for 39 days, not 26 days. Those extra two weeks are a huge crush to your ego and mental capabilities. Thirty-nine days is next level in my mind. I haven’t played a 26-day game, so having said that, I do think there’s something really interesting and creative and fun about the game today. I could go on forever about the differences, positive and negative, but I think there’s a little bit too much. I think they could peel it back just a touch in terms of all the extra stuff going on because I don’t want to spend 15 minutes watching someone look for something. I just don’t. It’s not fun for me. I’d rather see them compete in a challenge, try to survive, the personal relationships between the other players. I don’t think the character development and the casting has been as strong. It actually seems more difficult to get on the show. You actually have to overcome a transformational experience. “I was homeless. I was in jail. I transitioned to be a man. I’ve never been off the couch. I have anxiety.” All this stuff, it seems like you need to go through the s–t to be able to get on Survivor, and then Jeff can force you to go through more s–t to find yourself by the end. So it’s just as much a game as a therapy session for a lot of the people to be able to find themselves, which is a creative choice, which is fine, but it’s different than the way we played.  Survivor: All 48 Seasons, Ranked!",
  "image": "https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?w=350",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003e\u003cem\u003eIn honor of \u003c/em\u003e\u003ca href=\"https://tvline.com/t/survivor/\"\u003eSurvivor\u003c/a\u003e’\u003cem\u003es 25th anniversary on May 31, TVLine is spotlighting the most iconic, unforgettable moments from the series that helped redefine reality television. Today, we’re tackling the show’s very first tribe swap in Season 3, but be sure to revisit the jaw-dropping \u003ca href=\"https://tvline.com/features/survivor-borneo-finale-season-1-snakes-rats-speech-sue-hawk-1235450975/\" data-type=\"link\" data-id=\"https://tvline.com/features/survivor-borneo-finale-season-1-snakes-rats-speech-sue-hawk-1235450975/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBorneo finale moment\u003c/a\u003e where Sue Hawk had a thing or two to say about snakes and rats. And stay tuned to TVLine later this week for more!\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOn Day 13 of \u003cem\u003eSurvivor: Africa\u003c/em\u003e, the game marked a milestone. No, Jeff Probst didn’t utter those three magical words that get every \u003cem\u003eSurvivor\u003c/em\u003e fan salivating — “Drop your buffs” — but the sentiment was the same. A bombshell was dropped that would send a ripple through the game’s third season, disrupting all of the gameplay that had transpired, destroying many of the cast’s plans and rewriting fate for those who might have been in trouble. Probst dropped one of reality TV’s very first twists and it was a biggie: a tribe swap! \n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235454134\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"threeByTwo\" data-round=\"false\"\u003e\u003ca href=\"https://tvline.com/ratings/american-music-awards-2025-viewers-biggest-audience-2019-1235454134/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235454134\"\u003e\u003cp\u003e\u003cimg src=\"https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\" alt=\"AMAs Ratings Viewers\" height=\"200\" width=\"300\" srcset=\"https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=148%2C100 148w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=900%2C600 900w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=59%2C40 59w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=50%2C34 50w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=41%2C28 41w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=300%2C200 300w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=600%2C400 600w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=1200%2C800 1200w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=37%2C25 37w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=150%2C101 150w, https://tvline.com/wp-content/uploads/2025/05/american-music-awards-2025-viewers.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=110%2C74 110w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235454136\" data-wp-size=\"nova_size__threebytwo_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235450975\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"threeByTwo\" data-round=\"false\"\u003e\u003ca href=\"https://tvline.com/features/survivor-borneo-finale-season-1-snakes-rats-speech-sue-hawk-1235450975/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235450975\"\u003e\u003cp\u003e\u003cimg src=\"https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\" alt=\"Survivor Borneo\" height=\"200\" width=\"300\" srcset=\"https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=148%2C100 148w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=900%2C600 900w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=59%2C40 59w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=50%2C34 50w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=41%2C28 41w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=300%2C200 300w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=600%2C400 600w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=1200%2C800 1200w, https://tvline.com/wp-content/uploads/2025/05/survivor-borneo.jpg?w=300\u0026amp;h=200\u0026amp;crop=1\u0026amp;resize=37%2C25 37w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235451483\" data-wp-size=\"nova_size__threebytwo_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003eAfter the game’s fourth Tribal Council, both tribes received a bit of ominous tree mail: “Pick three from your tribe to go on a quest,” it said. When the six selected contestants — Samburu’s Teresa “T-Bird” Cooper, Silas Gaither and Frank Garrison, plus Boran’s Kelly Goldsmith, Tom Buchanan and Lex van den Berghe — arrived to meet Jeff in the middle of\u003cstrong\u003e \u003c/strong\u003eKenya’s Shaba National Reserve, he dropped that game-changing hammer. The three chosen Samburu tribemates were now members or Boran, and vice versa. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eBack when the season aired (from October 11, 2001—January 10, 2002), fans could never have dreamt of  a shake-up of this magnitude. When \u003cem\u003eThe Australian Outback\u003c/em\u003e followed \u003cem\u003eBorneo\u003c/em\u003e, it certainly didn’t stray from the formula we viewers had foolishly and blindly expected. But that fateful day in Kenya would not only change how things would unravel for the six swapped players, but also for those waiting back at camp, eagerly anticipating what the heck was about to happen. \u003c/p\u003e\n\n\n\n\u003cp\u003eBelow, \u003cem\u003eSurvivor: Africa \u003c/em\u003ewinner \u003ca href=\"https://tvline.com/t/ethan-zohn/\" id=\"auto-tag_ethan-zohn_1\" data-tag=\"ethan-zohn\"\u003eEthan Zohn\u003c/a\u003e talks to TVLine about the\u003cem\u003e \u003c/em\u003etribe swap he experienced on his first season, from what camp life felt like post-swap to how it complicated his game come merge. He also shares some words about his relationship with his late friend and former alliance member Kim Johnson, who \u003ca rel=\"noreferrer noopener\" data-id=\"https://tvline.com/news/kim-johnson-dead-survivor-cause-of-death-obituary-1235306157/\" target=\"_blank\" data-type=\"link\" href=\"https://tvline.com/news/kim-johnson-dead-survivor-cause-of-death-obituary-1235306157/\"\u003epassed away\u003c/a\u003e last year.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1240\" height=\"840\" src=\"https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?w=650\" alt=\"Survivor Africa Ethan Zohn\" srcset=\"https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png 1240w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=200,135 200w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=300,203 300w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=768,520 768w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=1024,694 1024w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=148,100 148w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=600,406 600w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=276,187 276w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=1000,677 1000w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=244,165 244w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=1160,786 1160w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=140,95 140w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=59,40 59w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=50,34 50w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=1200,813 1200w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=41,28 41w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=248,168 248w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=497,337 497w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=996,675 996w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=295,200 295w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=590,400 590w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=1181,800 1181w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=37,25 37w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=221,150 221w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=443,300 443w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=886,600 886w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=150,102 150w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=110,75 110w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=285,193 285w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=320,217 320w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=640,434 640w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan-africa.png?resize=800,542 800w\" sizes=\"auto, (max-width: 1240px) 100vw, 1240px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTVLINE | Thinking back to the tribe swap in the \u003cem\u003eAfrica\u003c/em\u003e season, what was your gut reaction when T-Bird, Frank and Silas showed up to the Boran camp?  \u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eETHAN ZOHN |\u003c/strong\u003e Going into that moment, I was in a fairly strong alliance with Lex and Tom, and then I had my own side alliance with Kim Johnson. So when they said, “Hey, pick three players to go on a trip,” little did we know that it was the first tribe swap. So when I saw those three folks arrive, we had definitely not spoken to each other yet. I didn’t know them other than competing against them in challenges. I was like, “This is it. My game’s done. I’m ruined,” because Lex, Tom and I were kind of running the show on our tribe and all of a sudden my two closest allies, friends and co-conspirators in \u003cem\u003eSurvivor\u003c/em\u003e were gone, so it was a perfect opportunity for Kim to jump ship and join with Silas, Frank and T-Bird. So I was like, “Oh my God, this is it. It’s over,” and then on the flip side, I’m like, “Oh, that was pretty clever. That’s sneaky, \u003cem\u003eSurvivor\u003c/em\u003e! Well played.”  \u003cbr/\u003e \u003cbr/\u003eSo then, I was actively looking for ways to keep the numbers, so we lost on purpose — not to mention, if you’re looking at character development and archetypes on the show, Silas, I felt, was competition. An athletic young guy. That was kind of our role. I was a soccer player, he was a football guy. So not only is this guy potentially better physically than I am, clearly he was running the show in the other tribe. I’m like, “We’ve got to get him out. This is not good for me.” So we threw the challenge on purpose so we could lose and vote Silas out. And I think that was one of the first times any tribe has lost on purpose for the sake of the greater goal, which was to obviously make it to the end of the game. \u003cbr/\u003e \u003cbr/\u003e\u003cstrong\u003eTVLINE | It was one of the biggest and earliest twists in the early-aughts boom of reality TV series. What was the shock level of your tribemates and what was the vibe around camp after the new people showed up?  \u003c/strong\u003e\u003cbr/\u003eThe vibe was OK because what we learned was that on the other tribe, the young and the old had fractured, so it was kind of like the young people versus the old people on that original tribe. Frank and T-Bird were revived. They were excited about this because they were going to be picked off one by one by the young people, Lindsey [Richter], Brandon [Quinton], Silas and Kim [Powers]. So, Frank and T-Bird were psyched. They have a new life here on our tribe and they were quick to align with us to vote out Silas because they didn’t like him as a human and they didn’t like the way he was playing the game, and they were next in line to get voted out. So I think they were psyched and I welcomed that because the numbers for us were great to get off Silas. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is all going on, but in my mind I’m like, “Oh s–t. The same thing could happen with Lex and Tom and Kelly on the other side, and they could easily align with the remaining people over there.” So when we come back for the merge, my alliance could be ruined. I had high hopes that we would stay true to our alliance, but you never know. When we went to play them in the challenges, [we were] trying to get eye contact, head nods, like, “Is everything OK?” because you’re not allowed to talk to each other, but it was really difficult to determine if we were still aligned or if they now merged with this other tribe to go forward. It was anxiety-provoking. I just wanted to get to the merge so I could talk to them and get an understanding of where their head was at. Luckily, it all worked out. \u003cbr/\u003e \u003cbr/\u003eIt complicated the merge a little bit, however, it was a rare time. I mean, this is early days, don’t forget, so honor, integrity and alliances were a huge part of the game and you actually see that in the current season of \u003cem\u003e48\u003c/em\u003e [this interview was conducted before the Season 48 finale], which is shocking to me that there are people trying to play the honor/trust/loyalty game, and it’s working. I don’t think it’s a winning strategy anymore. I do think back in the day that you could be a nice guy and that was a winning strategy. I just don’t think it’s possible today. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1240\" height=\"840\" src=\"https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?w=650\" alt=\"Survivor Africa Ethan\" srcset=\"https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg 1240w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=200,135 200w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=300,203 300w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=768,520 768w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=1024,694 1024w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=148,100 148w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=600,406 600w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=276,187 276w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=1000,677 1000w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=244,165 244w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=1160,786 1160w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=140,95 140w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=59,40 59w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=50,34 50w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=1200,813 1200w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=41,28 41w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=248,168 248w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=497,337 497w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=996,675 996w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=295,200 295w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=590,400 590w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=1181,800 1181w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=37,25 37w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=221,150 221w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=443,300 443w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=886,600 886w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=150,102 150w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=110,75 110w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=285,193 285w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=320,217 320w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=640,434 640w, https://tvline.com/wp-content/uploads/2025/05/survivor-ethan.jpg?resize=800,542 800w\" sizes=\"auto, (max-width: 1240px) 100vw, 1240px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTVLINE | Africa seemed like one of the most brutal locations the show has ever visited. How did your experience in Kenya differ from Panama [\u003cem\u003eAll-Stars\u003c/em\u003e] and Fiji [\u003cem\u003eWinners at War\u003c/em\u003e]?  \u003c/strong\u003e\u003cbr/\u003eYeah, I can agree with you on that one. Having played three times, environmentally, Africa was by far the most difficult. Africa, in its own right, I think is one of the only locations that had a real threat of animals. There were lions there and Cape buffalo and elephants and giraffes. They said there were guys with guns out there, but I did not see them. I hope they were! They give you these Hollywood prop spears on \u003cem\u003eSurvivor\u003c/em\u003e, and I’m like, “What the hell am I going to do with this?” [\u003cem\u003eLaughs\u003c/em\u003e] You’ll know which lion killed me because maybe it’ll be loosely hanging out of the side of its skin, but that’s it.  \u003cbr/\u003e \u003cbr/\u003eWe had to have two fires going once sun went down. Some people don’t realize that we had to take a night shift on \u003cem\u003eSurvivor: Africa\u003c/em\u003e. So not only were we sleeping on the ground, two people every night had to stay up all night to make sure the fire was going and then you had to do what you did the next day. Africa, as an environment, was tough. We had a water source. We shared that water source with the animals. It was a 45-minute walk to get there, and a 45-minute walk back. Water was a really limiting factor because we only had what we could hold in our canteen. There wasn’t a well. We won a big jug, but until we won that jug, there was no way to hold your water. \u003cbr/\u003e \u003cbr/\u003e\u003cstrong\u003eTVLINE | You wound up beating Kim by a vote of 5-2. Heading into that final Tribal Council, how confident were you that you’d win?  \u003c/strong\u003e\u003cbr/\u003eI was confident, however, going through my mind was the Colby/Tina situation, which I feel, literally, we replicated. Kim was an older woman. She stuck by my side. We were an alliance. I was kind of a younger guy, really good at challenges, blah blah blah. So I’m like, “Oh s–t. Kim could take this thing if people are in the same mindset as they were during \u003cem\u003eSurvivor: Australia\u003c/em\u003e. Then, I made the tragic error — well, not tragic error. I was pretty confident I wasn’t getting his vote anyway — it was Brandon. His question was, “Who is the person on the jury that you think is least deserving to sit next to you up there?” And I looked at him in the eye and said, “You,” and he’s like, “Oh,” which was an honest answer. However, if I had lied, I probably would have gotten his vote and won 6-to-1 versus 5-to-2, but I think he was just bitter that I said that it was him. \n\n\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1240\" height=\"840\" src=\"https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?w=650\" alt=\"\" srcset=\"https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png 1240w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=200,135 200w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=300,203 300w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=768,520 768w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=1024,694 1024w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=148,100 148w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=600,406 600w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=276,187 276w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=1000,677 1000w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=244,165 244w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=1160,786 1160w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=140,95 140w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=59,40 59w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=50,34 50w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=1200,813 1200w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=41,28 41w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=248,168 248w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=497,337 497w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=996,675 996w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=295,200 295w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=590,400 590w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=1181,800 1181w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=37,25 37w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=221,150 221w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=443,300 443w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=886,600 886w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=150,102 150w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=110,75 110w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=285,193 285w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=320,217 320w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=640,434 640w, https://tvline.com/wp-content/uploads/2025/05/survivor-kim-johnson.png?resize=800,542 800w\" sizes=\"auto, (max-width: 1240px) 100vw, 1240px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTVLINE | I was sorry to hear about the loss of Kim. Had you kept in touch with her throughout the years? \u003c/strong\u003e \u003cbr/\u003eKim, rest in peace. She passed away this past year. Yeah, I had. We obviously had a great bond when we were on the show and then stayed in touch for all these years after. A few years, 2010 to 2013-ish, we weren’t in touch so much just because I was going through some s–t, but after that we picked it up. She’s always been supportive of me and my charitable efforts and philanthropy. She’s told me multiple times over the years that she’s happy with her choice. She had a choice to choose Lex or myself to go to the Final 3 and she chose me. She always said that she’s so happy with that choice and that she was happy that I won and used the money for good. \u003cbr/\u003e \u003cbr/\u003e\u003cstrong\u003eTVLINE | \u003cem\u003eSurvivor\u003c/em\u003e has been on the air for 25 years now, so clearly the show has gone through multiple evolutions since Season 3. Have you kept up with the New Era? Any thoughts on the shorter 26-day game?  \u003c/strong\u003e\u003cbr/\u003eI’m still a huge fan of the show, and it’s not better or worse. It’s just different. I’m an old school guy. I kind of like the old school game a little bit better. I feel that there’s so many alternative ways to make it to the end that are out of your control and there’s a lot of luck involved. There’s a lot of risk versus reward, luck, chance, versus in the old school days, it really was just you. You had to navigate your way through the game with the people and the challengers and the environment around you to be the Sole Survivor. You couldn’t lean on anything else. There weren’t idols, ways to get back in the game, advantages, disadvantages, journeys, Exile Island, Edge of Extinction, fire tokens… there was none of that. It was based on you and you alone.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eIt takes a certain type of person to be able to do that for 39 days, not 26 days. Those extra two weeks are a huge crush to your ego and mental capabilities. Thirty-nine days is next level in my mind. I haven’t played a 26-day game, so having said that, I do think there’s something really interesting and creative and fun about the game today. I could go on forever about the differences, positive and negative, but I think there’s a little bit too much. I think they could peel it back just a touch in terms of all the extra stuff going on because I don’t want to spend 15 minutes watching someone look for something. I just don’t. It’s not fun for me. I’d rather see them compete in a challenge, try to survive, the personal relationships between the other players. I don’t think the character development and the casting has been as strong. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt actually seems more difficult to get on the show. You actually have to overcome a transformational experience. “I was homeless. I was in jail. I transitioned to be a man. I’ve never been off the couch. I have anxiety.” All this stuff, it seems like you need to go through the s–t to be able to get on \u003cem\u003eSurvivor\u003c/em\u003e, and then Jeff can force you to go through more s–t to find yourself by the end. So it’s just as much a game as a therapy session for a lot of the people to be able to find themselves, which is a creative choice, which is fine, but it’s different than the way we played. \u003c/p\u003e\n\n\n\u003cdiv data-component=\"linked-gallery\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"threeByTwo\" data-round=\"false\"\u003e\u003cp\u003e\u003cimg src=\"https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\" alt=\"Survivor Seasons Ranked\" height=\"400\" width=\"600\" srcset=\"https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=148%2C100 148w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=900%2C600 900w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=59%2C40 59w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=50%2C34 50w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=41%2C28 41w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=300%2C200 300w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=600%2C400 600w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=1200%2C800 1200w, https://tvline.com/wp-content/uploads/2024/12/survivor-seasons-ranked-season-48.jpeg?w=600\u0026amp;h=400\u0026amp;crop=1\u0026amp;resize=37%2C25 37w\" sizes=\"auto, (max-width: 600px) 100vw, 600px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235453410\" data-wp-size=\"nova_size__threebytwo_medium_cropped\"/\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003e\u003ci\u003eSurvivor\u003c/i\u003e: All 48 Seasons, Ranked!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-05-29T01:00:00Z",
  "modifiedTime": "2025-05-29T00:43:48Z"
}
