{
  "id": "ad600bfa-c73d-496b-88c6-ad497433561b",
  "title": "We Don’t Need a Little House on the Prairie Reboot",
  "link": "https://www.tvfanatic.com/we-dont-need-a-little-house-on-the-prairie-reboot/",
  "description": "Netflix ordered a Little House on the Prairie Reboot. Let me count the reasons why it should stay a beloved classic. The post We Don’t Need a Little House on the Prairie Reboot appeared first on TV Fanatic.",
  "author": "Laura Nowak",
  "published": "Fri, 31 Jan 2025 19:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Editorials"
  ],
  "byline": "Laura Nowak",
  "length": 5442,
  "excerpt": "Netflix ordered a Little House on the Prairie Reboot. Let me count the reasons why it should stay a beloved classic.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "Netflix announced this week that it’s traveling back to Walnut Grove by ordering a reboot of my favorite childhood series. I’m dumbfounded. Little House on the Prairie, the beloved 1970s drama starring Michael Landon and Melissa Gilbert, should stay nostalgic and beloved. Not every old television show needs to be modernized, even if it has recently experienced a resurgence in streaming. (NBC/Screenshot) Netflix ordered the series shortly after Nielson reported that viewers watched 13.25 billion minutes of Little House on the Prairie on Peacock over the past year. That is impressive. CBS Studios is producing the new Little House. Rebecca Sonnenshine (The Boys) is the showrunner, and Trip Friendly of Friendly Family Productions is also an executive producer. They’ll do another reimagining of Laura Ingalls Wilder’s book series. The official logline reads as follows: “Part hopeful family drama, part epic survival tale, and part origin story of the American West, this fresh adaptation of Laura Ingalls Wilder’s iconic semi-autobiographical ‘Little House’ books offers a kaleidoscopic view of the struggles and triumphs of those who shaped the frontier.” That’s what worries me. Netflix excels at book-to-screen adaptations, but reimagining a classic in modern times could wreck it. Little House Would Suffer with Modern and Woke Undertones (NBC/Screenshot) Little House would suffer from trying to incorporate modern themes of sexuality and gender norms into the 1870s and 1880s when dating and courting were so different. Netflix already failed at this when they adapted another beloved classic, Anne of Green Gables, into the modernized Anne with an E. Many of us grew up on the novels and the Canadian mini-series starring Megan Follows that followed the books religiously with charm. Anne with An E made a large arc about Diana’s Aunt Josephine being a lesbian, which often felt like it was talking to the audience more than about the characters. I’d hate to see them do the same thing to Little House. I’m not against LGBTQ characters, but it needs to make sense. While Little House on the Prairie was about coming-of-age and finding yourself, it mainly dealt with family and community stories. That was part of its charm, which is why I loved Little House on the Prairie so much. Sometimes, simplicity is best. Keeping Things Historic Needs to Be Balanced with New Book Controversary (NBC/Screenshot) Things have changed so much since the 1970s that even following the source material could be complicated. While many of us loved how Wilder’s boos captured frontier life and the series expanded on that, nowadays, there has been controversy, especially with how Indians were portrayed. We know race is a hot topic, and the Indians were a massive part of the Ingalls experience in Kansas, as depicted in the pilot movie. While Native Americans appeared in other episodes, that was the pivotal episode, and they would need to be cautious about how to portray it. Is it worth all the trouble dealing with new laws and controversies when we can re-watch the original anytime we want? Could Trip Friendly Create a New Beloved Little House? (NBC/Screenshot) The only bright side is that Trip Friendly is one of the executive producers. He’s Ed Friendly’s son, and Ed was the original creator and producer of the beloved 1970s series. Friendly Family Productions bought the television rights to the books in the 1970s, and It still owns the rights to Laura’s life until she is 16. Even in the 1970s, there was drama on television sets as Ed Friendly and leading man Michael Landon disagreed on running the show. Friendly wanted the television series to be based on the book series, while Michael Landon thought that for the series to thrive, the characters and plots needed to be fleshed out more. Ultimately, NBC believed in Landon’s vision, and the TV series became different from the books, except for specific episodes. (NBC/Screenshot)  After Season 4, Little House on the Prairie was almost unrecognizable from the books when the Ingalls started adopting additional children.  It added romantic interests for Mary and Nellie. While Mary went to a college for the blind in the books, she never married, and Nellie wasn’t a large part of the books. Some of these moments were charming scenes, so it’s hard to imagine the TV series without them. Trip Friendly is excited about honoring his father’s legacy. “It has been a long-held dream of mine to carry on my father’s legacy and adapt Wilder’s classic American stories for a 21st-century audience in a way that brings together fans of both the books and the original television series,” said Friendly in a statement. Since he’s so familiar with the material, he might be the ideal candidate to honor Wilder’s work. In fact, he’s already created a documentary about her life, with Dean Butler (former Almonzo Wilder) narrating the piece. (NBC/Screenshot) While I’m not thrilled with it, I’m relieved he’s involved. It would be even better if some of the old cast made cameo appearances. How are you feeling about a new version of Little House on the Prairie? Should this be one that was left alone? Since we’re getting one, who’s part of your dream cast? Let us know your thoughts in the comments below. Watch Little House on the Prairie Online",
  "image": "https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-831907\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003eNetflix announced this week that it’s traveling back to Walnut Grove by ordering a reboot of my favorite childhood series. I’m dumbfounded.\u003c/p\u003e\n\n\n\n\u003cp\u003eLittle House on the Prairie, the beloved 1970s drama starring Michael Landon and Melissa Gilbert, should stay nostalgic and beloved.\u003c/p\u003e\n\n\n\n\u003cp\u003eNot every old television show needs to be modernized, even if it has recently experienced a resurgence in streaming.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"581\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-1024x581.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-1024x581.png 1024w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-300x170.png 300w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-768x436.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-2048x1162.png 2048w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-960x545.png 960w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-1080x613.png 1080w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM-1200x681.png 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.33%E2%80%AFPM.png\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNetflix ordered the series shortly after Nielson reported that viewers watched 13.25 billion minutes of Little House on the Prairie on Peacock over the past year. That is impressive.\u003c/p\u003e\n\n\n\n\u003cp\u003eCBS Studios is producing the new Little House. Rebecca Sonnenshine (The Boys) is the showrunner, and Trip Friendly of Friendly Family Productions is also an executive producer.\u003c/p\u003e\n\n\n\n\u003cp\u003eThey’ll do another reimagining of Laura Ingalls Wilder’s book series. The official logline reads as follows:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e“Part hopeful family drama, part epic survival tale, and part origin story of the American West, this fresh adaptation of Laura Ingalls Wilder’s iconic semi-autobiographical ‘Little House’ books offers a kaleidoscopic view of the struggles and triumphs of those who shaped the frontier.”\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThat’s what worries me. Netflix excels at book-to-screen adaptations, but reimagining a classic in modern times could wreck it.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-little-house-would-suffer-with-modern-and-woke-undertones\"\u003e\u003cstrong\u003eLittle House Would Suffer with Modern and Woke Undertones\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"892\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1-892x1024.png 892w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1-261x300.png 261w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1-768x882.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1-836x960.png 836w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1-941x1080.png 941w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1-1045x1200.png 1045w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1.png 1691w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.20.09%E2%80%AFPM-1.png\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eLittle House would suffer from trying to incorporate modern themes of sexuality and gender norms into the 1870s and 1880s when dating and courting were so different.\u003c/p\u003e\n\n\n\n\u003cp\u003eNetflix already failed at this when they adapted another beloved classic, Anne of Green Gables, into the modernized \u003ca href=\"https://www.tvfanatic.com/anne-with-an-e-is-the-latest-casualty-of-netflixs-three-season-c/\"\u003eAnne with an E\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eMany of us grew up on the novels and the Canadian mini-series starring Megan Follows that followed the books religiously with charm.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eAnne with An E made a large arc about Diana’s Aunt Josephine being a lesbian, which often felt like it was talking to the audience more than about the characters.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’d hate to see them do the same thing to Little House. I’m not against LGBTQ characters, but it needs to make sense. While Little House on the Prairie was about coming-of-age and finding yourself, it mainly dealt with family and community stories.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat was part of its charm, \u003ca href=\"https://www.tvfanatic.com/valuable-lessons-learned-from-little-house-on-the-prairie/\"\u003ewhich is why I loved Little House on the Prairie\u003c/a\u003e so much. Sometimes, simplicity is best.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-keeping-things-historic-needs-to-be-balanced-with-new-book-controversary\"\u003e\u003cstrong\u003eKeeping Things Historic Needs to Be Balanced with New Book Controversary\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"687\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-1024x687.png 1024w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-300x201.png 300w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-768x515.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-2048x1374.png 2048w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-960x644.png 960w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-1080x724.png 1080w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM-1200x805.png 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.23.19%E2%80%AFPM.png\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThings have changed so much since the 1970s that even following the source material could be complicated.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile many of us loved how Wilder’s boos captured frontier life and the series expanded on that, nowadays, there has been controversy, especially with how Indians were portrayed.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe know race is a hot topic, and the Indians were a massive part of the Ingalls experience in Kansas, as depicted in the pilot movie.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile Native Americans appeared in other episodes, that was the pivotal episode, and they would need to be cautious about how to portray it.\u003c/p\u003e\n\n\n\n\u003cp\u003eIs it worth all the trouble dealing with new laws and controversies when we can re-watch the original anytime we want?\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-could-trip-friendly-create-a-new-beloved-little-house\"\u003e\u003cstrong\u003eCould Trip Friendly Create a New Beloved Little House?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"836\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM-836x1024.png 836w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM-245x300.png 245w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM-768x940.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM-784x960.png 784w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM-882x1080.png 882w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM-980x1200.png 980w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM.png 1570w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.01%E2%80%AFPM.png\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe only bright side is that Trip Friendly is one of the executive producers. He’s Ed Friendly’s son, and Ed was the original creator and producer of the beloved 1970s series.\u003c/p\u003e\n\n\n\n\u003cp\u003eFriendly Family Productions bought the television rights to the books in the 1970s, and It still owns the rights to Laura’s life until she is 16.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eEven in the 1970s, there was drama on television sets as Ed Friendly and leading man Michael Landon disagreed on running the show.\u003c/p\u003e\n\n\n\n\u003cp\u003eFriendly wanted the television series to be based on the book series, while Michael Landon thought that for the series to thrive, the characters and plots needed to be fleshed out more.\u003c/p\u003e\n\n\n\n\u003cp\u003eUltimately, NBC believed in Landon’s vision, and the TV series became different from the books, except for specific episodes.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"870\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM-870x1024.png 870w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM-255x300.png 255w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM-768x904.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM-816x960.png 816w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM-918x1080.png 918w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM-1020x1200.png 1020w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM.png 1630w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.21.48%E2%80%AFPM.png\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e After Season 4, \u003ca href=\"https://www.tvfanatic.com/little-house-on-the-prairie-turns-50-episodes-well-never-forget/\"\u003eLittle House on the Prairie\u003c/a\u003e was almost unrecognizable from the books when the Ingalls started adopting additional children.\u003c/p\u003e\n\n\n\n\u003cp\u003e It added romantic interests for Mary and Nellie. While Mary went to a college for the blind in the books, she never married, and Nellie wasn’t a large part of the books.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome of these moments were charming scenes, so it’s hard to imagine the TV series without them. Trip Friendly is excited about honoring his father’s legacy.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It has been a long-held dream of mine to carry on my father’s legacy and adapt Wilder’s classic American stories for a 21st-century audience in a way that brings together fans of both the books and the original television series,” said Friendly in a statement.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince he’s so familiar with the material, he might be the ideal candidate to honor Wilder’s work. In fact, he’s already created a documentary about her life, with Dean Butler (former Almonzo Wilder) narrating the piece.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"823\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM-823x1024.png 823w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM-241x300.png 241w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM-768x956.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM-771x960.png 771w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM-868x1080.png 868w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM-964x1200.png 964w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM.png 1544w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-30-at-3.22.41%E2%80%AFPM.png\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (NBC/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWhile I’m not thrilled with it, I’m relieved he’s involved. It would be even better if some of the old cast made cameo appearances.\u003c/p\u003e\n\n\n\n\u003cp\u003eHow are you feeling about a new version of Little House on the Prairie? Should this be one that was left alone?\u003c/p\u003e\n\n\n\n\u003cp\u003eSince we’re getting one, who’s part of your dream cast?\u003c/p\u003e\n\n\n\n\u003cp\u003eLet us know your thoughts in the comments below.\u003c/p\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch Little House on the Prairie Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-31T19:00:00Z",
  "modifiedTime": "2025-01-30T19:00:15Z"
}
