{
  "id": "d4d3a76a-e7bb-4bba-b4bb-2011ea42d79c",
  "title": "Landman Season 1 Episode 5 Asks Where Home Is — And the Answer Isn’t Easy",
  "link": "https://www.tvfanatic.com/landman-season-1-episode-5-review-asks-where-home-is-and-the-answer-isnt-easy/",
  "description": "In our review of Landman Season 1 Episode 5, we break down the brutal details that make answering the title question very difficult. The post Landman Season 1 Episode 5 Asks Where Home Is — And the Answer Isn’t Easy appeared first on TV Fanatic.",
  "author": "Carissa Pavlica",
  "published": "Sun, 08 Dec 2024 14:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Reviews"
  ],
  "byline": "Carissa Pavlica",
  "length": 8686,
  "excerpt": "In our review of Landman Season 1 Episode 5, we break down the brutal details that make answering the title question very difficult.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "Critic's Rating: 4.55 / 5.04.55 If there’s one thing Landman knows how to do, it’s throwing chaos, drama, and a little bit of heartfelt awkwardness into a blender and serving it up as must-watch TV.  Landman Season 1 Episode 5, “Where Is Home,” doesn’t just ask where you live — it asks where you truly belong.  And for most of these characters, the answer is somewhere between “I have no idea” and “definitely not here.” (Emerson Miller/Paramount+) The title sets the tone for an episode full of quiet moments and explosive ones (sometimes literally) as the characters grapple with their pasts, relationships, and the hard truths of their world.  From Angela’s desperate attempt to create a family dinner to Cooper’s growing tensions with Ariana’s cousins, everyone’s reaching for a sense of home — but nobody seems to know how to hold onto it. (Emerson Miller/Paramount+) Let’s start with Angela. She’s really leaning into her role as the family chaos coordinator, but for all her flash and bravado, we finally see some cracks in her armor.  Her attempt to pull the family together with a dinner is so painfully awkward it’s almost hard to watch. She’s bought new furniture, painted walls, and cooked pasta like she’s staging an HGTV special, but nobody else is buying into her fantasy.  Cooper shows up muddy and quiet, Tommy and Dale exchange weary glances and Ainsley — bless her — can’t even keep her keto rules straight.  Angela’s trying so hard to create something resembling a home, but it’s clear that everyone at the table is just trying to get through the night. And Angela knows it. When Tommy ruins the meal with his blunt (and admittedly hilarious) tirade about burst hemorrhoids and cartel threats, you can see her crumble.  She storms away from the table, throwing the food away in frustration, and finally lets out some of the emotions she’s bottled up.  (Emerson Miller/Paramount+) For all her larger-than-life antics, Angela’s just as desperate for connection as anyone else. The question is, will she keep trying, or will she give up again like she did the first time her marriage to Tommy fell apart? Then there’s the pipe accident, which slams Angela with a dose of reality she clearly wasn’t expecting.  When she leaves the truck — against Tommy’s wishes — and witnesses the chaos, it’s like she’s seeing what Tommy’s world really looks like for the first time.  The accident is brutal, and the man’s final call to his wife is heartbreaking. It’s one of those moments that strips away all the glitz and humor of Angela’s personality, leaving her standing in the wreckage, realizing just how much this life costs.  (Emerson Miller/Paramount+) How will this shape her view of Tommy’s work — and her place in his life? And how will she handle the news about Cooper’s brutal beating when that inevitably comes to light?  Angela might thrive in chaos, but even she has limits. The cracks are already starting to show, and it’s hard not to wonder if she’s on the verge of breaking completely. Meanwhile, Cooper’s story quietly steals the show.  His scenes with Ariana are so full of unspoken tension and small moments of vulnerability that they feel like their own separate movie.  He’s trying so hard to help her, from mowing her lawn to breaking down her bills, but it’s clear he doesn’t fully understand what he’s getting into.  The tension with her cousin Manuel reaches a boiling point in this episode, and when Manuel accuses Cooper of only wanting Ariana, her response — a bold kiss to shut Manuel up — is as messy as it is intriguing.  (Emerson Miller/Paramount+) Does Ariana really feel something for Cooper, or was that just a way to deflect the fight? And what does Cooper want from Ariana? Is he stepping into her life because he cares, or is he trying to find some sense of belonging for himself? The family dinner is another big moment for Cooper, marking the first time he’s been in the same room with Angela in years.  Their dynamic is fascinating — Angela’s over-the-top energy is a sharp contrast to Cooper’s quiet demeanor, and you can almost feel the distance between them.  Does Cooper want to reconnect with his mom, or is he just going through the motions for the sake of keeping the peace?  (Emerson Miller/Paramount+) He doesn’t say much during the meal, but his presence speaks volumes. And when Angela insists they hold hands for a prayer, you can see that while she’s trying to make things work, not everyone’s on board with her vision of “togetherness.” And then there’s Tommy, who’s dealing with cartel threats, Angela’s antics, and the constant demands of his job.  His conversation with Angela about her expectations — where he bluntly tells her nobody can meet the ones she keeps inventing in her head — is a standout moment.  It’s brutally honest and cuts straight to the heart of their relationship. They’re two people who clearly care about each other but don’t know how to make it work. Whether they’ll figure it out this time is anyone’s guess. Monty’s scenes this time out didn’t quite pack the emotional punch of the main storylines, but they added an interesting layer to the larger picture. Watching him circle a skyscraper in a helicopter, surrounded by power players debating alternative energy, reminded me of the disconnect between the boardroom and the oilfield. (Emerson Miller/Paramount+) Monty’s blunt dismissal of any “social responsibility” talk — complete with his signature no-nonsense attitude — shows just how firmly he’s planted in the world of profit margins and practicalities. While it’s easy to see him as cold, his sharp retort about oil prices being the only thing worth discussing hints at his frustration with the performative side of these discussions. It’s not exactly heartwarming, but it’s Monty at his most Monty, and I can’t help but respect the consistency. Rebecca’s scenes, on the other hand, leaned heavily into her snake-like tendencies. Her conversation with Nate about the death settlements was icy, calculated, and just plain uncomfortable to watch, especially after watching Ariana struggle through what Rebecca brushes off so easily. (Emerson Miller/Paramount+) Rebecca clearly operates from a position of power, but her approach — skimming off 401k plans and rushing families to settle — was about as subtle as a sledgehammer. And then there’s her reaction to Ainsley’s playful antics, which left her gobsmacked (and honestly, who could blame her). She couldn’t live farther away from the world she’s now operating in. While Rebecca’s story might not have hit the emotional highs of the other plots, it’s setting up some fascinating tension. How long can someone like Rebecca operate in a world full of people like Angela, Tommy, and Nate before her perfect control starts to crack? But the real gut punch is how the episode ends on a devastating note with Cooper’s beating.  This isn’t the first time he’s been attacked, but it feels more personal now, with Manuel and his crew leaving him bloodied and unconscious in his trailer. It’s a brutal reminder of just how dangerous his world has become.  (Emerson Miller/Paramount+) Will anyone discover the truth about what happened, and if they do, how will that ripple through the crew and his family?  Tommy, in particular, doesn’t strike me as the kind of guy who’d take kindly to finding out his son’s been targeted. His warnings to Cooper about the business didn’t contain the personal elements that caught up with Cooper his first day on the job. And what will this mean for Cooper’s already-strained connection to Ariana? There’s no way this doesn’t get messier. “Where Is Home” doesn’t give us answers to its title question, but it makes one thing clear: these characters are all trying to build something, even if it’s fragile, messy, and doomed to fail.  Whether it’s Angela trying to create a family, Cooper trying to help Ariana, or Tommy trying to hold his world together, everyone’s reaching for some sense of stability.  (Lauren ìLoî Smith/Paramount+) The beauty of Landman is that it doesn’t tie things up in a neat bow. Life is messy. Love is messy. And that’s what keeps us coming back for more. What do you think?  Can Angela handle the weight of this world, or is she bound to crack?  Will Cooper ever find the home he’s looking for, or is he destined to stay on the outside looking in?  Let me know your thoughts — I’ve got theories, but I want to hear yours. Username or Email AddressPassword Watch Landman Online",
  "image": "https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-826899\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\u003cp\u003e\u003cstrong\u003eCritic\u0026#39;s Rating:\u003c/strong\u003e 4.55 / 5.0\u003c/p\u003e\u003cp\u003e4.55\u003c/p\u003e\n\u003cp\u003eIf there’s one thing Landman knows how to do, it’s throwing chaos, drama, and a little bit of heartfelt awkwardness into a blender and serving it up as must-watch TV. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.tvfanatic.com/shows/landman/?season=season-1\"\u003eLandman Season 1\u003c/a\u003e Episode 5, “Where Is Home,” doesn’t just ask where you live — it asks where you truly belong. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd for most of these characters, the answer is somewhere between “I have no idea” and “definitely not here.”\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"579\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-1024x579.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-1024x579.jpg 1024w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-300x170.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-768x434.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-2048x1158.jpg 2048w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-960x543.jpg 960w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-1080x611.jpg 1080w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-1200x679.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04629_RT_f-scaled.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe title sets the tone for an episode full of quiet moments and explosive ones (sometimes literally) as the characters grapple with their pasts, relationships, and the hard truths of their world. \u003c/p\u003e\n\n\n\n\u003cp\u003eFrom Angela’s desperate attempt to create a family dinner to Cooper’s growing tensions with Ariana’s cousins, everyone’s reaching for a sense of home — but nobody seems to know how to hold onto it.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"889\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f-889x1024.jpg 889w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f-260x300.jpg 260w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f-768x885.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f-833x960.jpg 833w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f-937x1080.jpg 937w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f-1042x1200.jpg 1042w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f.jpg 1736w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_BTS_0409_05785_RT_f.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eLet’s start with Angela. She’s really leaning into her role as the family chaos coordinator, but for all her flash and bravado, we finally see some cracks in her armor. \u003c/p\u003e\n\n\n\n\u003cp\u003eHer attempt to pull the family together with a dinner is so painfully awkward it’s almost hard to watch. She’s bought new furniture, painted walls, and cooked pasta like she’s staging an HGTV special, but nobody else is buying into her fantasy. \u003c/p\u003e\n\n\n\n\u003cp\u003eCooper shows up muddy and quiet, Tommy and Dale exchange weary glances and Ainsley — bless her — can’t even keep her keto rules straight. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eAngela’s trying so hard to create something resembling a home, but it’s clear that everyone at the table is just trying to get through the night.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd Angela knows it. When Tommy ruins the meal with his blunt (and admittedly hilarious) tirade about burst hemorrhoids and cartel threats, you can see her crumble. \u003c/p\u003e\n\n\n\n\u003cp\u003eShe storms away from the table, throwing the food away in frustration, and finally lets out some of the emotions she’s bottled up. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"859\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f-859x1024.jpg 859w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f-252x300.jpg 252w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f-768x915.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f-805x960.jpg 805w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f-906x1080.jpg 906w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f-1007x1200.jpg 1007w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f.jpg 1678w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_05700_RT_f.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eFor all her larger-than-life antics, Angela’s just as desperate for connection as anyone else. The question is, will she keep trying, or will she give up again like she did the first time her marriage to Tommy fell apart?\u003c/p\u003e\n\n\n\n\u003cp\u003eThen there’s the pipe accident, which slams Angela with a dose of reality she clearly wasn’t expecting. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen she leaves the truck — against Tommy’s wishes — and witnesses the chaos, it’s like she’s seeing what Tommy’s world really looks like for the first time. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe accident is brutal, and the man’s final call to his wife is heartbreaking. It’s one of those moments that strips away all the glitz and humor of Angela’s personality, leaving her standing in the wreckage, realizing just how much this life costs. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"854\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f-854x1024.jpg 854w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f-250x300.jpg 250w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f-768x921.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f-801x960.jpg 801w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f-901x1080.jpg 901w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f-1001x1200.jpg 1001w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f.jpg 1668w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0409_04690_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHow will this shape her view of Tommy’s work — and her place in his life? And how will she handle the news about Cooper’s brutal beating when that inevitably comes to light? \u003c/p\u003e\n\n\n\n\u003cp\u003eAngela might thrive in chaos, but even she has limits. The cracks are already starting to show, and it’s hard not to wonder if she’s on the verge of breaking completely.\u003c/p\u003e\n\n\n\n\u003cp\u003eMeanwhile, Cooper’s story quietly steals the show. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eHis scenes with Ariana are so full of unspoken tension and small moments of vulnerability that they feel like their own separate movie. \u003c/p\u003e\n\n\n\n\u003cp\u003eHe’s trying so hard to help her, from mowing her lawn to breaking down her bills, but it’s clear he doesn’t fully understand what he’s getting into. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe tension with her cousin Manuel reaches a boiling point in this episode, and when Manuel accuses Cooper of only wanting Ariana, her response — a bold kiss to shut Manuel up — is as messy as it is intriguing. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"704\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-1024x704.jpg 1024w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-300x206.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-768x528.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-2048x1409.jpg 2048w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-960x660.jpg 960w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-1080x743.jpg 1080w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-1200x825.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0304_00811_RT_f-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eDoes Ariana really feel something for Cooper, or was that just a way to deflect the fight? And what does Cooper want from Ariana? Is he stepping into her life because he cares, or is he trying to find some sense of belonging for himself?\u003c/p\u003e\n\n\n\n\u003cp\u003eThe family dinner is another big moment for Cooper, marking the first time he’s been in the same room with Angela in years. \u003c/p\u003e\n\n\n\n\u003cp\u003eTheir dynamic is fascinating — Angela’s over-the-top energy is a sharp contrast to Cooper’s quiet demeanor, and you can almost feel the distance between them. \u003c/p\u003e\n\n\n\n\u003cp\u003eDoes Cooper want to reconnect with his mom, or is he just going through the motions for the sake of keeping the peace? \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"897\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f-897x1024.jpg 897w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f-263x300.jpg 263w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f-768x877.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f-840x960.jpg 840w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f-946x1080.jpg 946w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f-1051x1200.jpg 1051w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f.jpg 1751w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0312_01467_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHe doesn’t say much during the meal, but his presence speaks volumes. And when Angela insists they hold hands for a prayer, you can see that while she’s trying to make things work, not everyone’s on board with her vision of “togetherness.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd then there’s Tommy, who’s dealing with cartel threats, Angela’s antics, and the constant demands of his job. \u003c/p\u003e\n\n\n\n\u003cp\u003eHis conversation with Angela about her expectations — where he bluntly tells her nobody can meet the ones she keeps inventing in her head — is a standout moment. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eIt’s brutally honest and cuts straight to the heart of their relationship. They’re two people who clearly care about each other but don’t know how to make it work. Whether they’ll figure it out this time is anyone’s guess.\u003c/p\u003e\n\n\n\n\u003cp\u003eMonty’s scenes this time out didn’t quite pack the emotional punch of the main storylines, but they added an interesting layer to the larger picture. \u003c/p\u003e\n\n\n\n\u003cp\u003eWatching him circle a skyscraper in a helicopter, surrounded by power players debating alternative energy, reminded me of the disconnect between the boardroom and the oilfield. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"834\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f-834x1024.jpg 834w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f-244x300.jpg 244w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f-768x943.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f-781x960.jpg 781w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f-879x1080.jpg 879w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f-977x1200.jpg 977w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f.jpg 1628w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0328_03906_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMonty’s blunt dismissal of any “social responsibility” talk — complete with his signature no-nonsense attitude — shows just how firmly he’s planted in the world of profit margins and practicalities. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhile it’s easy to see him as cold, his sharp retort about oil prices being the only thing worth discussing hints at his frustration with the performative side of these discussions. It’s not exactly heartwarming, but it’s Monty at his most Monty, and I can’t help but respect the consistency.\u003c/p\u003e\n\n\n\n\u003cp\u003eRebecca’s scenes, on the other hand, leaned heavily into her snake-like tendencies. \u003c/p\u003e\n\n\n\n\u003cp\u003eHer conversation with Nate about the death settlements was icy, calculated, and just plain uncomfortable to watch, especially after watching Ariana struggle through what Rebecca brushes off so easily. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"877\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f-877x1024.jpg 877w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f-257x300.jpg 257w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f-768x897.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f-822x960.jpg 822w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f-925x1080.jpg 925w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f-1028x1200.jpg 1028w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f.jpg 1712w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0327_02644_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eRebecca clearly operates from a position of power, but her approach — skimming off 401k plans and rushing families to settle — was about as subtle as a sledgehammer. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd then there’s her reaction to Ainsley’s playful antics, which left her gobsmacked (and honestly, who could blame her). She couldn’t live farther away from the world she’s now operating in.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile Rebecca’s story might not have hit the emotional highs of the other plots, it’s setting up some fascinating tension. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eHow long can someone like Rebecca operate in a world full of people like Angela, Tommy, and Nate before her perfect control starts to crack?\u003c/p\u003e\n\n\n\n\u003cp\u003eBut the real gut punch is how the episode ends on a devastating note with Cooper’s beating. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis isn’t the first time he’s been attacked, but it feels more personal now, with Manuel and his crew leaving him bloodied and unconscious in his trailer. It’s a brutal reminder of just how dangerous his world has become. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"926\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f-926x1024.jpg 926w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f-271x300.jpg 271w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f-768x849.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f-868x960.jpg 868w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f-977x1080.jpg 977w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f-1085x1200.jpg 1085w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f.jpg 1808w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_EM_0412_06308_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Emerson Miller/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWill anyone discover the truth about what happened, and if they do, how will that ripple through the crew and his family? \u003c/p\u003e\n\n\n\n\u003cp\u003eTommy, in particular, doesn’t strike me as the kind of guy who’d take kindly to finding out his son’s been targeted. His warnings to Cooper about the business didn’t contain the personal elements that caught up with Cooper his first day on the job.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd what will this mean for Cooper’s already-strained connection to Ariana? There’s no way this doesn’t get messier.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Where Is Home” doesn’t give us answers to its title question, but it makes one thing clear: these characters are all trying to build something, even if it’s fragile, messy, and doomed to fail. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhether it’s Angela trying to create a family, Cooper trying to help Ariana, or Tommy trying to hold his world together, everyone’s reaching for some sense of stability. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"858\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f-858x1024.jpg 858w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f-252x300.jpg 252w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f-768x916.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f-805x960.jpg 805w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f-905x1080.jpg 905w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f-1006x1200.jpg 1006w, https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f.jpg 1675w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/LANDMAN_105_LS_0611_0188_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Lauren ìLoî Smith/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe beauty of Landman is that it doesn’t tie things up in a neat bow. Life is messy. Love is messy. And that’s what keeps us coming back for more.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat do you think? \u003c/p\u003e\n\n\n\n\u003cp\u003eCan Angela handle the weight of this world, or is she bound to crack? \u003c/p\u003e\n\n\n\n\u003cp\u003eWill Cooper ever find the home he’s looking for, or is he destined to stay on the outside looking in? \u003c/p\u003e\n\n\n\n\u003cp\u003eLet me know your thoughts — I’ve got theories, but I want to hear yours.\u003c/p\u003e\n\n\n\n\u003cdiv data-id=\"389\" data-temp=\"basic\" data-skin=\"minimal\" data-cscheme=\"black\" data-cap=\"0\" data-access=\"guest,wordpress\" data-tid=\"\" data-uid=\"d287f08fb2d8a47753372bd0684d2ab5\" data-pid=\"826899\" data-resdet=\"percentages\" data-show-results-to=\"guest,registered\" data-show-results-moment=\"after-vote\" data-show-results-only=\"false\" data-show-message=\"true\" data-show-results-as=\"bar\" data-sort-results-by=\"as-defined\" data-sort-results-rule=\"asc\" data-is-ended=\"0\" data-gdpr=\"no\" data-gdpr-sol=\"consent\" data-css=\".basic-yop-poll-container[data-uid] .basic-vote { text-align: center; }\" data-counter=\"0\" data-load-with=\"1\" data-notification-section=\"top\"\u003e\u003cp\u003e\u003clabel\u003eUsername or Email Address\u003c/label\u003e\u003c/p\u003e\u003cp\u003e\u003clabel\u003ePassword\u003c/label\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch Landman Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-08T14:00:00Z",
  "modifiedTime": "2024-12-07T14:42:52Z"
}
