[
  {
    "id": "db58f4c4-1ee7-4fee-9b51-3dff444014ca",
    "title": "Way-too-early Grand Slam predictions for the rest of 2025",
    "link": "https://www.espn.com/tennis/story/_/id/43568647/way-too-early-grand-slam-predictions-rest-2025",
    "description": "Madison Keys won her first Grand Slam and Jannik Sinner defended his Australian Open title. What does this mean for the rest of the year? We take a look.",
    "author": "D'Arcy Maine",
    "published": "Sun, 26 Jan 2025 16:15:19 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "a413acce-8550-4e1a-8b2c-d30d2e5c5ac7",
    "title": "'He's in a different universe right now': Jannik Sinner's dominance on display at Australian Open",
    "link": "https://www.espn.com/tennis/story/_/id/43568988/australian-open-men-final-winner-jannik-sinner-alexander-zverev",
    "description": "Sinner won his second Australian Open title, cementing his place as the best in the world. Will he get only better from here?",
    "author": "Jake Michaels",
    "published": "Sun, 26 Jan 2025 11:08:23 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "70487ef7-f772-4f11-9efe-d974346366a3",
    "title": "Sabalenka and Gauff both knocked out in second round in Qatar",
    "link": "https://www.bbc.com/sport/tennis/articles/cy5kzy61ewlo",
    "description": "Aryna Sabalenka and Coco Gauff are both been knocked out in the second round of the Qatar Open.",
    "author": "",
    "published": "Tue, 11 Feb 2025 19:31:59 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "4ff966e6-610d-4b43-87e1-43c72bc6f775",
    "title": "Rybakina's ex-coach Vukov banned after investigation",
    "link": "https://www.bbc.com/sport/tennis/articles/cx2m9ly1rnvo",
    "description": "Elena Rybakina's former coach Stefano Vukov remains banned by the WTA after an investigation into his behaviour towards the 2022 Wimbledon champion.",
    "author": "",
    "published": "Tue, 11 Feb 2025 20:54:07 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "27f46df0-ff12-4947-afa8-e140d18866ea",
    "title": "Bublik brings Gasquet’s Marseille career to a close, Borges defeats Wawrinka",
    "link": "https://www.atptour.com/en/news/bublik-gasquet-marseille-2025-tuesday",
    "description": "Alexander Bublik summoned a bit of déjà vu to end the Open 13 Provence career of a crowd favourite on Tuesday afternoon in Marseille. The Kazakhstani overcame Richard Gasquet 6-4, 6-4 at the indoor ATP 250 to register his 100th tour-level win on hard courts. Bublik crucially broke Gasquet’s serve in the penultimate game of each set, and on both occasions he served out the next game to love en route to an 82-minute first-round win. After falling behind 0-3 early, Bublik dialled in on serve and produced an all-around aggressive display in which he finished with 37 winners, including 13 aces. The No. 48 in the PIF ATP Rankings completed his win having converted three of five break points he earned, according to Infosys ATP Stats. 🎯 Lucky No. 13 Alexander Bublik seals the win over Richard Gasquet 6-4 6-4 with his 13th ace of the match, powering into the second round in Marseille@Open13 | #O13Provence pic.twitter.com/jgO4ZslRNF — ATP Tour (@atptour) February 11, 2025 A former World No. 7, Gasquet remains the youngest match winner in event history in Marseille, where he defeated Feliciano Lopez as a 16-year-old in 2003. Now 38 years old, the Frenchman was on Tuesday bidding to mark his final appearance at the event by also become the oldest match winner in tournament history, but he was unable to stick with Bublik once the Kazakhstani settled into the match. “He has a spectacular career, 20 years on Tour and 1,012 matches. I don’t think I would ever get to that point,” said Bublik of Gasquet, who will retire after this year’s Roland Garros. “I guess it has to be a great feeling to play your last Marseille after so many years. I wish him a great retirement. He has a couple more events, but this isn’t about me now. He’s a legend of French tennis and I wish him a lot of luck.” The four-time ATP Tour champion Bublik will next take on another French star in second seed and defending champion Ugo Humbert. It will be the second Lexus ATP Head2Head meeting between the pair, after Humbert triumphed in the 2024 Dubai championship match. Portugal's Nuno Borges denied Stan Wawrinka his first win of the season after earning a comeback 6-7(4), 7-6(1), 6-3 victory. It is the first time Borges has won a match at an indoor tour-level event since October 2023 in Antwerp, and the 27-year-old is also the first Portuguese match winner in tournament history. The eighth seed reached the semi-finals in Auckland earlier this year, losing to Zizou Bergs. Borges will have the opportunity to gain revenge against the Belgian when they meet in the second round in Marseille. Bergs defeated Frenchman Clement Chidekh earlier on Day 2 at the ATP 250. Daniel Altmaier, Luca Van Assche and Jan-Lennard Struff were also early winners on Tuesday in Marseille. Germany's Altmaier eased past Luca Nardi 6-2, 6-2 to set a second-round meeting with Otto Virtanen, while Van Assche saved two match points in the deciding-set tie-break to prevail 3-6, 6-3, 7-6(7) in an all French battle against Benjamin Bonzi. With his first tour-level win of 2025, the 20-year-old Van Assche advanced to face seventh seed Lorenzo Sonego. Struff, 34, beat Frenchman Manuel Guinard 7-5, 7-6(4). The German struck 18 aces according to Infosys ATP Stats to advance after one hour and 59 minutes. [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 11 Feb 2025 19:44:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Marseille",
      "Match Report",
      "2025",
      "Alexander Bublik",
      "Richard Gasquet"
    ]
  },
  {
    "id": "d674b7aa-c1e9-4599-a02a-cc450cf3be8d",
    "title": "Qatar ExxonMobil Open 2025: Draws, Dates, History \u0026 All You Need To Know",
    "link": "https://www.atptour.com/en/news/doha-2025-history-draw-schedule",
    "description": "The 2025 season continues at the Qatar ExxonMobil Open, where Jannik Sinner, Carlos Alcaraz and Novak Djokovic lead the field in the first edition of the event under ATP 500 status. Here's what you need to know ahead of the tournament in Doha. When is the Qatar ExxonMobil Open? The 2025 Qatar ExxonMobil Open will be held from 17-22 February. The hard-court ATP 500 tournament, established in 1993, will take place at Khalifa International Tennis \u0026 Squash Complex in Doha, Qatar. The tournament director is Karim Alami. Who is playing at the 2025 Qatar ExxonMobil Open? The ATP 500 event in Doha will feature a stacked field of Top 10 stars including Sinner, Alcaraz, Djokovic and Daniil Medvedev. When is the draw for the Qatar ExxonMobil Open? The Qatar ExxonMobil Open draw will be made Saturday, 15 February at 12pm. What is the schedule for the Qatar ExxonMobil Open? *Qualifying: Saturday 15 February at 11:00 a.m. \u0026 Sunday 16 February at 3:30 p.m. *Main Draw: Monday 17 February - Saturday 17 February. *Monday-Thursday sessions starting at 2:30 p.m. \u0026 5:30 p.m. *Friday at 2:00 p.m. \u0026 6:00 pm. *Doubles Final: Saturday 17 February at 3:00 p.m. *Singles Final: Saturday 17 February at 6:00 p.m. View On Official Website What is the prize money and points for the Qatar ExxonMobil Open? The prize money for the Qatar ExxonMobil Open is $2,760,000 and the total financial commitment is $3,035,960. SINGLES Winner: $516,165/500 points Finalist: $277,715/330 points Semi-finalist: $148,005/200 points Quarter-finalist: $75,615/100 points Second Round: $40,365/50 points First Round: $21,525/0 points DOUBLES (€ per team) Winner: $169,540/500 points Finalist: $90,410/300 points Semi-finalist: $45,750/180 points Quarter-finalist: $22,880/90 points First Round: $11,840/0 points How can I watch theQatar ExxonMobil Open? Watch Live On Tennis TV How can I follow the Qatar ExxonMobil Open? Social Hashtag: #QatarExxonMobilOpen Facebook:@QatarTennis Twitter: @QatarTennis Instagram: @qatartennis [ATP APP] Who won the last edition of the Qatar ExxonMobil Open in 2024? Karen Khachanov won the 2024 title with a 7-6(12), 6-4 victory against Jakub Mensik in the championship match. Jamie Murray and Michael Venus lifted the doubles trophy, defeating Lorenzo Musetti and Lorenzo Songeo 7-6(0), 2-6, 10-8 in the final. Who holds the Qatar ExxonMobil Open record for most titles, oldest champion, youngest champion and more? Honour Roll (Open Era) Most Titles, Singles: Roger Federer (3) Most Titles, Doubles: Marc Lopez (3) Oldest Champion: Roberto Bautista Agut, 33, in 2022 Youngest Champion: Andy Murray, 20, in 2008 Highest-Ranked Champion: No. 1 Roger Federer in 2005-06, No. 1 Rafael Nadal 2014, No. 1 Novak Djokovic 2016. Lowest-Ranked Champion: No. 124 Rainer Schuettler in 1999 Last Home Champion: NA Most Match Wins: Roger Federer (27) View Who Is Playing, Past Champions, Seeds, Points \u0026 Prize Money Breakdown [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 11 Feb 2025 13:18:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Doha",
      "2025"
    ]
  },
  {
    "id": "4c7cb8bf-3e3f-46e2-b9f4-3ad40f9b0748",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "eeb476be-bf1f-454c-b486-b79b7846f6f9",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "874b7d59-0c00-4011-83fc-3e82d058af7a",
    "title": "Sinner Dominates in One Sided Australian Open Final",
    "link": "https://www.perfect-tennis.com/sinner-dominates-in-one-sided-australian-open-final/",
    "description": "Jannik Sinner successfully defended his Australian Open title on Sunday, landing his third Grand Slam commandingly with a 6-3, 7-6(4), 6-3 victory over Alexander Zverev. Sinner was ruthless from the baseline and did not face a single break point throughout the two-hour, 42-minute final. The Italian showed his extra firepower from the outset, which has …",
    "author": "Jonathan",
    "published": "Sun, 26 Jan 2025 15:28:28 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  },
  {
    "id": "9185f768-099e-41b8-8f32-b545b48844d8",
    "title": "Australian Open 2025 Day 13 Semi Final Recap",
    "link": "https://www.perfect-tennis.com/australian-open-2025-day-13-semi-final-recap/",
    "description": "Jannik Sinner and Alexander Zverev will face off in Sunday’s 2025 Australian Open final after winning their semi-finals on Friday. Alexander Zverev was the first to move into Sunday’s showpiece, defeating Novak Djokovic when the Serb retired after losing the first set on a tiebreak. Novak had not hit a tennis ball since his win …",
    "author": "Jonathan",
    "published": "Fri, 24 Jan 2025 13:42:20 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  }
]
