[
  {
    "id": "07729d50-2bdb-4168-9bda-6f235faf227b",
    "title": "'I have some gas left in the tank': At 37, Djokovic still has big tennis goals",
    "link": "https://www.espn.com/tennis/story/_/id/44575404/novak-djokovic-monte-carlo-masters-tennis-goals",
    "description": "Djokovic has had a rough start to 2025, but shown flashes of brilliance too. And he's aiming for that 100th tour win.",
    "author": "Simon Cambers",
    "published": "Mon, 7 Apr 2025 14:52:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "1563e7d5-13ef-481a-bb3e-7efafdb7fd19",
    "title": "Ostapenko upsets No.1 Sabalenka in Stuttgart",
    "link": "https://www.espn.com/tennis/story/_/id/44781435/unseeded-jelena-ostapenko-tops-aryna-sabalenka-stuttgart",
    "description": "Unseeded Jelena Ostapenko upset world No. 1 Aryna Sabalenka 6-4, 6-1 to win the Porsche Tennis Grand Prix in Stuttgart.",
    "author": "",
    "published": "Mon, 21 Apr 2025 09:28:02 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "03db27ed-1569-47b1-ac53-7800609ab9a5",
    "title": "Raducanu happy with 'informal' coaching set-up",
    "link": "https://www.bbc.com/sport/tennis/articles/c70zl6ln6r5o",
    "description": "Emma Raducanu pauses the search for a new full-time coach, saying she is happy to \"keep things informal\" in her partnership with Mark Petchey.",
    "author": "",
    "published": "Mon, 21 Apr 2025 17:35:54 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "bc391836-c75a-4e8c-9bdb-f7a2d572384e",
    "title": "Ostapenko stuns Sabalenka to win Stuttgart Open",
    "link": "https://www.bbc.com/sport/tennis/articles/cvg8p8yw59no",
    "description": "Jelena Ostapenko beats world number one Aryna Sabalenka to win the Stuttgart Open in stunning fashion.",
    "author": "",
    "published": "Mon, 21 Apr 2025 13:24:21 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "ceaab26e-3b15-4c24-9bea-0ba182ac5bae",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "702f0f72-3729-40c0-abfb-59acca0b878b",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "9ddd88f4-2aa9-4a16-b12a-517451b283d9",
    "title": "Madrid Open Draw 2025",
    "link": "https://www.perfect-tennis.com/madrid-open-draw-2025/",
    "description": "After the fun in Monte Carlo, we’re back to two-week Masters 1000 tournaments with 96-player draws, and the 2025 Madrid Open draw took place on Monday, with main draw action commencing on Wednesday, 23rd April. Top seed Alexander Zverev arrives fresh off a Munich title, while second seed Carlos Alcaraz, a two-time champion, brings form …",
    "author": "Jonathan",
    "published": "Mon, 21 Apr 2025 17:18:10 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Mutua Madrid Open",
      "Tennis News"
    ]
  },
  {
    "id": "df35e7e2-f038-45b9-adf8-861ee4c81c39",
    "title": "Alcaraz Wins 2025 Monte Carlo Title",
    "link": "https://www.perfect-tennis.com/alcaraz-wins-2025-monte-carlo-title/",
    "description": "Carlos Alcaraz claimed his sixth Masters 1000 crown and first Monte-Carlo title on Sunday, overpowering a fading Lorenzo Musetti 3-6, 6-1, 6-0. The Spaniard weathered a fiery first set from Musetti, but the Italian’s right leg buckled in the third, requiring treatment at 0-3. Alcaraz, clinical as ever, seized the moment, wrapping it up in …",
    "author": "Jonathan",
    "published": "Sun, 13 Apr 2025 12:52:13 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Monte-Carlo Masters",
      "Tennis News"
    ]
  },
  {
    "id": "3fe28c3e-8466-4f12-9e44-54f207e3a35e",
    "title": "Nadal honoured with Laureus Sporting Icon Award",
    "link": "https://www.atptour.com/en/news/nadal-laureus-2025-sporting-icon",
    "description": "Rafael Nadal was honoured with the Laureus Sporting Icon Award on Monday evening in Madrid. The two-time Laureus World Sportsman of the Year (2011 and 2021) retired last November after competing for his country in Davis Cup action. \"I don't know how to start, honestly. I didn't prepare for this amazing moment, talking in front of all of you,\" Nadal said. \"But a lot of you have been sportspeople that inspired [me] since I was a kid and having the chance to talk in front of you today is something very, very special.\" The Spaniard won 92 titles and earned 1,080 tour-level match wins in his illustrious career, according to the Infosys ATP Win/Loss Index. He spent 209 weeks at No. 1 in the PIF ATP Rankings, the sixth-most weeks in history (since 1973). Edwin Moses introduced Nadal and Simone Biles handed the legendary lefty his trophy. Moses said: \"Away from the tennis court, his work with his foundation continues to change young lives for better, some 15 years after its inception. As I stand here in the Spanish capital, I'm proud to honour a global sport icon and one of his country's grestest-ever sportsmen, a man with an indomitable will to win, but wrapped in compassion, humility and sportsmanship.\" Nadal ended his speech with words of advice: \"Congrats for Simone [Biles] and the rest of you for amazing careers. Wishing you the best of luck in the future. \"The ones that keep competing, enjoy the moment, because the professional careers are short. But just try hard, enjoy and appreciate every single moment that you have the chance to enjoy this beautiful world of sport. Keep going.\" Nadal enjoyed a laugh on the red carpet with countryman Carlos Alcaraz, who was nominated for World Sportsman of the Year, won by Mondo Duplantis. Other tennis players in attendance at the 2025 Laureus World Sports Awards were Novak Djokovic, Stefanos Tsitsipas, Paula Badosa, Garbine Muguruza, Belinda Bencic, Caroline Garcia and Donna Vekic. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 21 Apr 2025 22:15:00 Z",
    "image": "/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=B020DA612BE0D0A67145854EF774A25A",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Player News",
      "Off Court News",
      "2025",
      "Rafael Nadal"
    ]
  },
  {
    "id": "8c52eda4-670d-4882-a148-b1f9d5c745cf",
    "title": "Alcaraz, Nadal, Djokovic \u0026 Tsitsipas attend star-studded Laureus Awards",
    "link": "https://www.atptour.com/en/news/laureus-2025-alcaraz-nadal-djokovic-tsitsipas-badosa",
    "description": "When Carlos Alcaraz, Rafael Nadal, Novak Djokovic and Stefanos Tsitsipas are all in the same room and it is not at the tennis tournament, you know it is a special occasion. The ATP Tour stars attended the 2025 Laureus World Sports Awards on Monday evening in Madrid.  Photo: Getty Images for Laureus Five-time World Sportsman of the Year recipient Djokovic announced this year's winner, pole vaulter Mondo Duplantis. Alcaraz was also nominated for the award alongside swimmer Leon Marchand, cyclist Tadej Pogacar and Formula One driver Max Verstappen. \"When you achieve your childhood dreams, it's an amazing feeling,\" Djokovic said before naming the winner. \"Winning the Laureus Sportsman of the Year is the highest honour you can be blessed with in sport globally, because you're elected and recognised by the greatest athletes in the history of sports, many of whom are present in this room this evening.\" Nadal, who retired last November, and Alcaraz shared a laugh together on the red carpet. Nadal is a two-time Laureus World Sportsman of the Year and in 2023, Alcaraz received World Breakthrough of the Year recognition. The ATP stars are in town for the Mutua Madrid Open. The main draw begins Tuesday for the women and Wednesday for the men. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 21 Apr 2025 19:38:00 Z",
    "image": "/-/media/2024-images/news/2025/04/21/19/20/djokovic-laureus-2025.jpg",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Off Court News",
      "2025",
      "Carlos Alcaraz",
      "Rafael Nadal",
      "Stefanos Tsitsipas"
    ]
  }
]
