[
  {
    "id": "408caeae-bb9e-42d6-aa6e-0c50ec6dc5b1",
    "title": "The top tennis players, and moments, of 2024",
    "link": "https://www.espn.com/tennis/story/_/id/42607435/jannik-sinner-aryna-sabalenka-coco-gauff-djokovic-espn-players-year-nadal",
    "description": "Sinner and Sabalenka each won two Grand Slams and ended up No. 1 -- but 2024 was full of memorable moments.",
    "author": "D'Arcy Maine",
    "published": "Tue, 26 Nov 2024 12:09:56 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "d290c431-377f-47dc-8ac4-6bce3cc35f2b",
    "title": "'I can one day tell my grandkids that I played Rafa': Nadal retires, with an unreachable legacy",
    "link": "https://www.espn.com/tennis/story/_/id/42395852/rafael-nadal-retires-davis-cup-king-clay-greatest-tennis-players",
    "description": "Rafael Nadal retires on Tuesday at the Davis Cup, after more than 20 years in pro tennis -- and with a record on clay that might never be surpassed.",
    "author": "Tom Hamilton",
    "published": "Tue, 19 Nov 2024 19:09:07 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "0d6226c5-b169-4c31-8598-24afe0642625",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "8b6fec03-5d3d-4ce5-b567-8d88a421caf7",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "37ea12d2-8cba-48bc-8b79-b7f69807d02e",
    "title": "Are there 'different approaches' to tennis doping cases?",
    "link": "https://www.bbc.com/sport/tennis/articles/cj4vr7gypqgo",
    "description": "Iga Swiatek, Jannik Sinner, Simona Halep and Tara Moore have had different experiences after testing positive for a banned substance - BBC Sport looks at why.",
    "author": "",
    "published": "Wed, 04 Dec 2024 15:02:10 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "f79ce2d2-5a91-406c-9d4f-5cabb26f96c1",
    "title": "Djokovic to begin bid for 25th Grand Slam in Brisbane",
    "link": "https://www.bbc.com/sport/tennis/articles/c5y83vn4y67o",
    "description": "Novak Djokovic will play at the Brisbane International this month before he starts his bid for a 25th Grand Slam at the Australian Open in Melbourne.",
    "author": "",
    "published": "Wed, 04 Dec 2024 07:18:59 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "3f4be2ea-2d61-43b6-a628-a8e737e09570",
    "title": "Cilic’s emotional note to Del Potro: ‘Your legacy is secure’",
    "link": "https://www.atptour.com/en/news/cilic-del-potro-farewell-message",
    "description": "Marin Cilic sent his heartfelt regards to former rival Juan Martin del Potro on social media Wednesday. The former No. 3 in the PIF ATP Rankings officially bid farewell to the sport last weekend during an exhibition match at Parque Roca in Buenos Aires, where he faced 24-time Grand Slam champion Novak Djokovic. He also played his final ATP Tour match in the Argentine capital at the 2022 IEB+ Argentina Open. [ATP APP] “So many farewells this year, and while they are bittersweet for us tennis enthusiasts, they are also a celebration of all that you guys have achieved,” Cilic shared on X. “Congratulations on all your incredible accomplishments, for realizing your dreams, and for inspiring so many with your journey.” Dear Juan Martin, So many farewells this year, and while they are bittersweet for us tennis enthusiasts, they are also a celebration of all that you guys have achieved. I’m truly happy that you had the farewell you deserve, at home, alongside @DjokerNole, who showed... 1/3 — Marin Cilic (@cilic_marin) December 4, 2024 The two players achieved their career milestones at the US Open, with Del Potro emerging victorious in 2009 and Cilic claiming the trophy in 2014. They played 13 times in their Lexus ATP Head2Head series, with the Argentine winning 11 of those matches. The pair's last meeting came at Roland Garros in 2018, which Del Potro won in four sets. With that in mind, their mutual respect extends far beyond the court. Del Potro, a 22-time tour-level titlist, sealed his career with a 439-174 record, according to the Infosys ATP Win/Loss Index. “While we can’t help but wonder what could have been if luck (and health) had been kinder to you, your legacy is secure as one of the greats,” Cilic said. “Wishing you all the best in everything that follows—you truly deserve it.” [NEWSLETTER FORM]",
    "author": "",
    "published": "Thu, 05 Dec 2024 23:23:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Player Features",
      "Juan Martin del Potro",
      "Marin Cilic",
      "Retirements"
    ]
  },
  {
    "id": "a53165f7-5693-4b14-ac23-ebde69d1acdd",
    "title": "By The Numbers: 2024 ATP Challenger Tour",
    "link": "https://www.atptour.com/en/news/challenger-2024-by-the-numbers",
    "description": "ATPTour.com reviews key facts and figures to remember from the 2024 ATP Challenger Tour season.Ugo Carabelli Claims Most Match Wins For the second consecutive year, an Argentine topped the Challenger match wins leaderboard. The 25-year-old Camilo Ugo Carabelli tallied a 49-16 season record, steering clear of second-placed Tristan Boyer, who went 44-23. Ugo Carabelli claimed three titles, lifting the trophy in Piracicaba, Santa Cruz de la Sierra and Villa Maria. Last year’s match-wins leader was Ugo Carabelli’s countryman Francisco Comesana. [ATP APP] Dzumhur Dominates With Six Titles The 32-year-old Damir Dzumhur enjoyed a resurgent year, collecting a season-leading six Challenger titles and returning to the Top 100 for the first time in four years. Dzumhur was unstoppable in Challenger finals, winning 12 of 13 sets contested across six title matches. The former World No. 23 in the PIF ATP Rankings triumphed in Barletta, Ostrava, Zagreb, Santo Domingo, Istanbul and Maia. Dzumhur is one of seven players to win at least six crowns in a Challenger season, joining Tallon Griekspoor, Benjamin Bonzi, Sebastian Baez, Facundo Bagnis, Juan Ignacio Chela and Younes El Aynaoui. Damir Dzumhur wins in Ostrava. Credit: Lukas Brezin Jacob Fearnley won four Challenger trophies, second most this season. The Briton went 27-3 this season on the Challenger circuit, including a 17-match winning streak from August to October. Fearnley became just the third player to finish a season with a win percentage of 90 per cent or greater (min. 25 matches played). Guillermo Canas and Carlos Berlocq both registered 28-3 (90.3 per cent) records in 2006 and 2011, respectively. Teen Titans At 17 years, 11 months, Brazil’s Joao Fonseca became the youngest Challenger champion of 2024 with his triumph at the Lexington Challenger. Teenagers accounted for 17 titles this year, matching the most in a single season since 2017. Three #NextGenATP teens claimed more than one title: Learner Tien (3), Gabriel Debru (2) and Nishesh Basavareddy (2). Biggest Movers To Top 100 The 23-year-old Fearnley, who graduated from Texas Christian University in May, made the biggest jump to the year-end Top 100 of the PIF ATP Rankings, soaring 539 spots to No. 99. This is the biggest jump to the year-end Top 100 since 2019, when Jannik Sinner rose 685 spots.   Player Ranking Jump Year-End 2023 — 2024 Jacob Fearnley +539 638 – 99 Giovanni Mpetshi Perricard +175 206 – 31 Shang Juncheng +135 185 – 50 Jakub Mensik +118 166 – 48 Title Leaders By Country Players from 44 countries won a title this year. France again led the way with 24 trophies, just three shy of tying its record from last season. Frenchmen Giovanni Mpetshi Perricard and Benjamin Bonzi each claimed a hat-trick of trophies. Country Titles France 24 Argentina 22 United States 18 Italy 12 ATP Tour \u0026 Challenger Tour champions Six players were crowned champion not only on the ATP Challenger Tour, but also the ATP Tour: Luciano Darderi, Alejandro Tabilo, Mpetshi Perricard, Arthur Fils, Nuno Borges and Benjamin Bonzi. Tabilo, Mpetshi Perricard and Fils won two tour-level titles. Mpetshi Perricard, 21, is the first player in a decade to win multiple ATP Tour and ATP Challenger Tour titles in a season. David Goffin and Pablo Cuevas both achieved the feat in 2014. ATP Challenger 175 Events Five different champions were featured at Challenger 175 events, the highest category at that level. Nuno Borges successfully defended his Phoenix title by downing Matteo Berrettini in the final. Alejandro Tabilo won in Aix-en-Provence while Mariano Navone triumphed in Cagliari. Navone ousted Lorenzo Musetti in the championship match, which was the first Challenger final since 2009 to feature a pair of Top 50 players. Arthur Fils, first in the PIF ATP Live Race To Jeddah, won on home soil in Bordeaux, France. Italian Francesco Passaro lifted the trophy in Turin, where he defeated five Top 100 players en route to the title, becoming the first player to achieve that feat since Robin Soderling in 2009 (Sunrise). Fast Facts Joel Schwaerzler became just the fourth player in Challenger history to lift a trophy while holding the ITF Junior No. 1 ranking. He joins Wu Yibing, Taylor Fritz and Nick Kyrgios as the only players to achieve the feat. At 18 years, 5 months, Rei Sakamoto became the third-youngest winner this year, with his title at the season-ending stop in Yokkaichi. He sits behind only Kei Nishikori as the youngest Japanese-born champion in Challenger history. Nishikori was just two months younger when he won in Bermuda in 2008. Vilius Gaubas became the youngest winner from Lithuania in Challenger history with his maiden title in Cordenons. Adolfo Daniel Vallejo became the first teenage winner from Paraguay with his maiden title in Sao Leopoldo.Hady Habib became the first champion from Lebanon in Challenger history with his victory in Temuco.  In 2002, Richard Gasquet became the second-youngest champion in Challenger history, winning in Montauban, France at age 16. This year, Gasquet claimed a slice of history on the other end of the age spectrum. His title in Cassis, at 38 years, two months, made him the third-oldest winner, behind Ivo Karlovic and Fernando Verdasco. Hugo Dellien and Murkel Dellien both won titles this year, becoming the seventh set of brothers to lift singles trophies in the same season. Alejandro Tabilo and Luca Nardi both defeated then-World No. 1 Novak Djokovic, becoming the first players to upset a World No. 1 and claim a Challenger title in the same season since Thanasi Kokkinakis in 2018. Georgia, Rwanda and Congo made their Challenger debuts in 2024, with the cities of Kachreti, Kigali and Brazzaville hosting tournaments for the first time. In total, 94 different countries/territories have welcomed a Challenger tournament in the history of the circuit. A single-season record 27 different players with college tennis experience won titles this year. The record for shortest completed final was set in Fairfield, where Learner Tien dispatched Bernard Tomic in just 39 minutes [NEWSLETTER FORM]",
    "author": "",
    "published": "Thu, 05 Dec 2024 23:22:00 Z",
    "image": "/-/media/images/news/2024/04/29/21/15/dzumhur-ostravach-2024.jpg",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Challenger",
      "Camilo Ugo Carabelli",
      "2024"
    ]
  },
  {
    "id": "075c9134-097a-46c9-8bdf-a6c099b9e17b",
    "title": "Sinner Cruises to ATP Finals Victory",
    "link": "https://www.perfect-tennis.com/sinner-cruises-to-atp-finals-victory/",
    "description": "Jannik Sinner is the 2024 Nitto ATP finals champion after comfortably defeating Taylor Fritz 6-4 6-4 in Sunday’s final, becoming the first player from his country to win the tournament in its 55-year history. The Italian emerges as the undefeated champion (without even dropping a set) and wins $4,881,100 in prize money, making it a …",
    "author": "Jonathan",
    "published": "Sun, 17 Nov 2024 19:44:15 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Finals",
      "Tennis News"
    ]
  },
  {
    "id": "a182c162-1ccf-47bd-9c01-587fefce83fc",
    "title": "ATP Finals 2024 Semi Finals Recap",
    "link": "https://www.perfect-tennis.com/atp-finals-2024-semi-finals-recap/",
    "description": "Jannik Sinner and Taylor Fritz will face off in Sunday’s 2024 ATP finals decider after the pair came through their sem-final matches at the Pala Alpitour in Turin. Fritz was the first man to book his spot. He defeated Alexander Zverev for the fourth time this season, battling to a 6-3 3-6 7-6(3) win. It …",
    "author": "Jonathan",
    "published": "Sat, 16 Nov 2024 21:21:12 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Finals",
      "Tennis News"
    ]
  }
]
