[
  {
    "id": "7d8b094c-9a5f-4111-a630-25da3e786d9d",
    "title": "The Alcaraz-Sinner rivalry is one for the ages",
    "link": "https://www.espn.com/tennis/story/_/id/45732133/wimbledon-2025-title-men-title-carlos-alcaraz-jannik-sinner-rivalry",
    "description": "On Sunday, Sinner defeated Alcaraz for the Wimbledon title -- the latest in a back-and-forth rivalry that will continue to entertain.",
    "author": "Simon Cambers",
    "published": "Sun, 13 Jul 2025 15:30:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "8a8890cc-0193-42c4-b9f8-06fc29c2deab",
    "title": "No. 6 Zheng pulls out of US Open after surgery",
    "link": "https://www.espn.com/tennis/story/_/id/45790172/zheng-qinwen-withdraws-us-open-elbow-surgery",
    "description": "Olympic gold medalist Zheng Qinwen withdrew from the US Open on Monday, two days after announcing she had arthroscopic surgery on her right elbow because of \"persistent pain.\"",
    "author": "",
    "published": "Mon, 21 Jul 2025 18:33:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "610803b2-5d8e-4e8d-9858-335525010162",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "19b3fe8e-f0d1-4603-8767-3e4664399ff5",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "7596878e-8b28-44ed-8090-35a93d2e259d",
    "title": "Venus Williams makes winning doubles return aged 45",
    "link": "https://www.bbc.com/sport/tennis/articles/ckg5j25yz26o",
    "description": "Venus Williams celebrates victory in the women's doubles at the Washington Open after a 16-month absence, while Britain's Dan Evans and Cameron Norris advance to the second round.",
    "author": "",
    "published": "Mon, 21 Jul 2025 22:39:13 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "fcbb4971-206f-4946-83ed-0a115d602a9a",
    "title": "Plans to expand Wimbledon can go ahead, judge rules",
    "link": "https://www.bbc.com/news/articles/cwyr7e394p0o",
    "description": "A High Court judge dismisses a legal challenge against the decision to approve the club's expansion.",
    "author": "",
    "published": "Mon, 21 Jul 2025 15:07:20 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "f684e18d-63cc-4edb-b731-e0c3c1f18ae6",
    "title": "Former champ Evans rallies to Washington win: 'No hiding from the end of my career'",
    "link": "https://www.atptour.com/en/news/washington-2025-monday",
    "description": "Daniel Evans made a winning return to the Mubadala Citi DC Open on Monday, when he secured his first hard-court victory at tour-level since last October. The Briton, who won the Washington title in 2023, claimed a hard-fought win against Zizou Bergs 3-6, 6-4, 6-3. The 35-year-old wild card let out a loud roar and pumped his fists towards his box in a fiery celebration following the two-hour, 29-minute battle. Look at what it means!!! ❤️‍🔥 2023 champion Dan Evans digs deep to overcome Bergs 3-6 6-4 6-3 to progress in Washington. @mubadalacitidc | #MubadalaCitiDCOpen pic.twitter.com/BBnWEPu1dA — ATP Tour (@atptour) July 21, 2025 “I’ve always said even when I was solidified in the Top 30, Top 40, that winning on this Tour is never easy,” said Evans, former No. 21 in the PIF ATP Rankings. “The best part about winning on the Tour is now going to the bike to warm down and be with the people who work with you day in and day out. “Sometimes we take it for granted, but the last year — or two years — has been difficult and I definitely enjoy it and cherish it every moment I get on these courts because it’s coming towards the end of my career, there’s no hiding from that.” The World No. 144 will next face 13th-seeded American Alex Michelsen. In other action at the ATP 500, Reilly Opelka crushed 23 aces, according to Infosys ATP Stats, to overcome Murphy Cassone 7-6(4), 6-7(5), 6-3 and set a second-round showdown against Daniil Medvedev. The eighth seed Medvedev leads their Lexus ATP Head2Head series 4-2, but Opelka won their most recent meeting in 's-Hertogenbosch last month. Opelka was one of four Americans who advanced. #NextGenATP teen Learner Tien raced past Emilio Nava 6-1, 6-4 while wild card Ethan Quinn downed Christopher O’Connell 6-3, 6-2. Another American wild card, Mackenzie McDonald, advanced with a 6-4, 6-1 win against Colton Smith. Japanese lefty Yoshihito Nishioka secured his first tour-level win since February with a gutsy 6-4, 5-7, 6-1 win against Jenson Brooksby. Nishioka was a finalist in Washington in 2022. Former No. 8 Cameron Norrie marched past fellow Brit Billy Harris 6-3, 7-6(4). [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 22 Jul 2025 00:39:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Washington",
      "2025",
      "Daniel Evans",
      "Match Report"
    ]
  },
  {
    "id": "69db77de-d6de-4b05-8ffa-77f96559399a",
    "title": "Wawrinka returns to winning ways in Umag, site of his first ATP title",
    "link": "https://www.atptour.com/en/news/wawrinka-umag-2025-monday",
    "description": "Stan Wawrinka is back at the Plava Laguna Croatia Open Umag, where he captured his maiden tour-level title in 2006. The Swiss won the championship match that year when his opponent Novak Djokovic retired at 6-6(1) due to breathing issues. Fast forward to 2025, the 40-year-old Wawrinka kickstarted his sixth appearance at the ATP 250 on Monday with a 6-4, 6-1 win against Ecuadorian qualifier Alvaro Guillen Meza. It marks Wawrinka's second tour-level match win of the season and first since Bucharest in March. \"I won my first ATP title here, so it's always going to be a special place,\" said Wawrinka, who was a finalist in Umag in 2023. \"I came here early to [adjust] to the conditions. It's never easy, but super happy with the win of course.\" The former No. 3 in the PIF ATP Rankings will next face Damir Dzumhur in what will be their their fifth Lexus ATP Head2Head meeting (2-2).  In other Umag action, fifth seed Mariano Navone raced past Tomas Barrios Vera 6-1, 6-2 while Nikoloz Basilashvili downed sixth seed Roberto Carballes Baena 6-3, 6-4. Chun-Hsin Tseng overcame Giulio Zeppieri 7-5, 6-4 and Terence Atmane defeated 2019 champion Dusan Lajovic 6-3, 6-4. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 21 Jul 2025 23:12:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Umag",
      "Match Report",
      "2025",
      "Stan Wawrinka"
    ]
  },
  {
    "id": "817322d3-f7df-40b7-919b-0f741ba30d31",
    "title": "Sinner Wins Maiden Wimbledon Title",
    "link": "https://www.perfect-tennis.com/sinner-wins-maiden-wimbledon-title/",
    "description": "Jannik Sinner exacted his revenge on Carlos Alcaraz on Sunday, defeating the two-time defending champion 4-6, 6-4, 6-4, 6-4 in the Wimbledon final to capture his fourth major and become the first Italian man to win the singles crown. The world No. 1, who fell to Alcaraz in a five-hour, 29-minute Roland Garros epic last …",
    "author": "Jonathan",
    "published": "Mon, 14 Jul 2025 05:46:01 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Grand Slams",
      "Tennis News",
      "Wimbledon"
    ]
  },
  {
    "id": "b80b5682-7015-4e40-8815-ee92412d79e8",
    "title": "Wimbledon 2025 Day Twelve Recap",
    "link": "https://www.perfect-tennis.com/wimbledon-2025-day-twelve-recap/",
    "description": "Wimbledon’s final weekend is set, and it’s the showdown everyone hoped for. Jannik Sinner and Carlos Alcaraz will meet in the 2025 men’s final after both came through their semi-finals on Day Twelve, though in very different ways. Sinner produced a near-flawless performance to dispatch a hampered Novak Djokovic in straight sets, reaching his first …",
    "author": "Jonathan",
    "published": "Fri, 11 Jul 2025 20:18:21 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Grand Slams",
      "Tennis News",
      "Wimbledon"
    ]
  }
]
