[
  {
    "id": "a062e15a-dae8-4a92-9ed8-e9d9f1e8cc5a",
    "title": "'I have some gas left in the tank': At 37, Djokovic still has big tennis goals",
    "link": "https://www.espn.com/tennis/story/_/id/44575404/novak-djokovic-monte-carlo-masters-tennis-goals",
    "description": "Djokovic has had a rough start to 2025, but shown flashes of brilliance too. And he's aiming for that 100th tour win.",
    "author": "Simon Cambers",
    "published": "Mon, 7 Apr 2025 15:47:42 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "312b8aa4-ebc1-4342-a73e-07f7fd69ae1c",
    "title": "King immortalized in bronze with Hollywood star",
    "link": "https://www.espn.com/tennis/story/_/id/44578113/billie-jean-king-immortalized-bronze-star-hollywood-walk-fame",
    "description": "Billie Jean King became the first woman to receive a star on the Hollywood Walk of Fame in the new sports entertainment category on Monday.",
    "author": "",
    "published": "Mon, 7 Apr 2025 19:23:46 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "992cafce-cda0-47e6-9df5-28217c80025b",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "21b4b262-ca75-49c6-bb8f-dd0e44aba921",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "686ffbff-1171-4528-bd68-610ce21fbd15",
    "title": "Cilic on injury 'lifesaver' \u0026 circling back to Challengers",
    "link": "https://www.atptour.com/en/news/cilic-challenger-2025-feature",
    "description": "Marin Cilic recalls undergoing the first surgery of his life. It was January 2023, and the Tour veteran, still comfortably positioned inside the Top 20 of the PIF ATP Rankings, was poised for another competitive season. Cilic had suffered a torn lateral meniscus just before a quarter-final match at the ATP 250 in Pune. It demanded surgery, marking the beginning of what has been a difficult and \"emotional up and down\" journey for the 36-year-old. As the rehab process unfolded, Cilic gave everything to his recovery, pouring countless hours into rebuilding strength and mobility in his knee. Despite his commitment and tireless effort, Cilic was not able to return to the level at which he hoped. His knee was still bothering him. The Croatian started to do his own research, trying to solve the problem with the same tactical mindset he brings to the court. “I [was] reading through the whole internet and going through research, reading dozens and dozens, if not hundreds of researchers about knee surgeries, recovery, the methods, what to do, what not to do, how to train, what to train afterwards,” Cilic told ATPTour.com. The 21-time tour-level titlist laughs as he reflects on his pursuit of answers. But thankfully, that relentless research led him to Dr. Brian Cole, an orthopedic surgeon and sports medicine expert in Chicago. “He was really straightforward and gave me an absolutely clear explanation of what his idea would be,” Cilic said. “I knew basically everything through the research, I found out what are the best choices, what would be the best methods for an athlete at my age. Then I went with the idea of the doctor, that was a real lifesaver.” In May 2024, then ranked outside the Top 1,000, Cilic had played just seven tour-level matches across the past 15 months. He then opted for a second surgery. “The continued problems with my knee was due to my cartilage on the similar area. Who knows why it happened, maybe due to overuse during the years. But the second part of it was this piece of cartilage that was used so much and decided to deteriorate in that 2022 season a bit more,” Cilic said. “I decided to go for my second surgery and that was really the best choice and the best decision I’ve made these last few years concerning my knee.” [ATP APP] Finally, there was light at the end of the tunnel. Cilic’s past eight months have featured two standout moments. Just days before his 36th birthday in September, Cilic won the ATP 250 in Hangzhou as World No. 777, becoming the lowest-ranked champion in ATP Tour history (since 1990). This season, Cilic began his European clay-court swing earlier than he can remember in his career. Starting on red clay in mid-March, while his ATP Tour peers were competing in Miami, the former No. 3 was battling at ATP Challenger Tour events in Murcia and Girona, claiming the title at the latter. “You have to accept that I’m not Top 100, Top 50 anymore, so you can’t just pick and choose any tournament you want to play. It’s time to put the head down, work, get back to Challengers and grind it out,” said Cilic. “That was for me the first step and then afterwards, it’s putting the mindset in, still having motivation to battle it out with young guns, to compete and play well.” Girona marked Cilic’s first triumph at the Challenger level since 2007, when at age 18 he won on home soil in Rijeka. His nearly 18-year gap between Challenger titles stands as the longest in ATP Challenger Tour history, surpassing Andy Murray’s previous record of 17 years and eight months (2005 Aptos – 2023 Aix-en-Provence).🏆 Rijeka 2007🏆 Girona 2025At 17 years and 10 months, @cilic_marin now holds the record for longest gap between Challenger Tour titles!#ATPChallenger | @atptour pic.twitter.com/UOcnvyGeHZ— ATP Challenger Tour (@ATPChallenger) March 30, 2025 Cilic and Murray, both former US Open champions, have met on some of tennis’ biggest stages — an ATP Masters 1000 final, a major semi-final, a Nitto ATP Finals round-robin clash, and more in their Lexus ATP Head2Head series. Now, they are among a unique place in the Challenger record books, spanning from their teenage years to triumphant comebacks. Cilic remembers following Murray’s memorable run in Aix-en-Provence while the Croatian was still sidelined and recovering from surgery. The Scot went on to claim two additional Challenger titles that year during the grass-court swing. “Obviously Andy, all of us were hoping that he’d come back to the level where he was and to have a farewell that he deserved and wanted,” Cilic said. “That’s great to see and accept the situation as it is, not to feel too proud to not go down to Challengers and work your way back to the level where you want to be.” Now Cilic is channeling those same qualities. At No. 117 in the PIF ATP Rankings and just 10 victories shy of 600 tour-level match wins, Cilic looks forward to what’s to come. “I’m really satisfied with my ranking, really satisfied with which direction I’m going,” Cilic said. “Let’s see what the year is going to bring.” [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 07 Apr 2025 22:00:00 Z",
    "image": "/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=B020DA612BE0D0A67145854EF774A25A",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Challenger",
      "Player Features",
      "2025",
      "Marin Cilic",
      "Girona"
    ]
  },
  {
    "id": "79a56f17-0f38-474f-9bd6-222ef75aaebb",
    "title": "Medvedev pushed hard in opening Monte-Carlo win",
    "link": "https://www.atptour.com/en/news/medvedev-khachanov-monte-carlo-2025-monday",
    "description": "Daniil Medvedev bounced back from his early exit in Miami with a hard-fought win on Monday, when he overcame Karen Khachanov to get his clay season underway at the Rolex Monte-Carlo Masters. The 29-year-old, who dropped out of the Top 10 in the PIF ATP Rankings following his opening-round exit in Miami, recovered from squandering a 5-1 advantage in the first set to lead before he lost a 4-1 advantage in the second set, with Khachanov winning the majority of the lengthy exchanges to force a decider. With little to separate them, Medvedev combined heavy baseline hitting with good use of the drop shot in the decider to record a 7-5, 4-6, 6-4 win after two hours and 51 minutes. Medvedev is chasing his first title since Rome in 2023, when he won on clay at the ATP Masters 1000. With his victory against Khachanov, Medvedev avenged his defeat to the 28-year-old at last year’s event in The Principality. He now leads Khachanov 7-2 in the pair’s Lexus ATP Head2Head series and will next play Alexandre Muller after the Frenchman beat Argentine qualifier Camilo Ugo Carabelli 6-4, 6-4. Matteo Berrettini held a 15-1 record on clay last season, winning titles in Marrakech, Gstaad and Kitzbuhel. Making his first appearance on the surface this year, the Italian moved past Argentine Mariano Navone 6-4, 6-4 to reach the second round in Monte-Carlo. Berrettini was aggressive on return throughout the one-hour, 48-minute clash, winning 61 per cent of points on Navone’s second serve and breaking five times, according to Infosys ATP Stats. The No. 34 in the PIF ATP Rankings, Berrettini arrived in Monte-Carlo off the back of a run to the quarter-finals in Miami, his first at ATP Masters 1000 level since 2021. Berrettini’s reward for his opening win in Monte-Carlo is a second-round blockbuster clash with top seed Alexander Zverev. Zverev leads Berrettini 4-2 in the pair’s Lexus ATP Head2Head series but the Italian won their most recent meeting at Wimbledon in 2023. Former finalist Alejandro Davidovich Fokina moved past Ben Shelton 6-7(2), 6-2, 6-1. The Spaniard, who reached the title match in The Principality in 2022, has reached tour-level finals in Delray Beach and Acapulco this year. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 07 Apr 2025 17:56:00 Z",
    "image": "/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=B020DA612BE0D0A67145854EF774A25A",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Monte-Carlo",
      "Match Report",
      "Matteo Berrettini",
      "2025",
      "Daniil Medvedev"
    ]
  },
  {
    "id": "bb50a82c-fe71-4c9d-9425-dfcb94e43977",
    "title": "Medvedev battles cramp in win over Khachanov in Monte Carlo",
    "link": "https://www.bbc.com/sport/tennis/articles/ce928v2rg90o",
    "description": "Daniil Medvedev battles cramp as he takes just under three hours to beat Karen Khachanov in a gruelling first-round Monte Carlo Masters match.",
    "author": "",
    "published": "Mon, 07 Apr 2025 20:49:15 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "454cf044-a7ca-440e-a866-5296c35c3835",
    "title": "Djokovic rediscovers mojo for Monte Carlo - your Second Serve briefing",
    "link": "https://www.bbc.com/sport/tennis/articles/cvgp6qq6wn6o",
    "description": "Novak Djokovic serving for success and Jessica Pegula wins on clay - the latest edition of our weekly tennis round-up.",
    "author": "",
    "published": "Mon, 07 Apr 2025 10:47:53 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "d38fe6a1-82c2-41f2-9871-4a22d9e70f08",
    "title": "Monte-Carlo Masters 2025 Day 1 \u0026 2 Recap",
    "link": "https://www.perfect-tennis.com/monte-carlo-masters-2025-day-1-2-recap/",
    "description": "Action is underway at the Monte Carlo Country Club. Three singles matches were played on Sunday in and amongst the final qualifying matches before the main draw kicked off fully on Monday. Two seeds suffered losses during a cold start to the week at the Principality. Ben Shelton and Felix Auger-Aliassime fell at the first …",
    "author": "Jonathan",
    "published": "Mon, 07 Apr 2025 18:32:07 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Monte-Carlo Masters",
      "Tennis News"
    ]
  },
  {
    "id": "5424077f-1ebc-4ba3-81ae-a8a2b5741110",
    "title": "Monte Carlo Masters Draw 2025",
    "link": "https://www.perfect-tennis.com/monte-carlo-masters-draw-2025/",
    "description": "The clay season starts now, and the draw for the 2025 Rolex Monte Carlo Masters was unveiled on Friday evening at the Monte Carlo Country Club. Monte Carlo bucks the trend by remaining a one-week Masters 1000 and a 56-player draw. This means it’s action-packed from the start, with competitive matches as early as the …",
    "author": "Jonathan",
    "published": "Sat, 05 Apr 2025 07:27:11 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Monte-Carlo Masters",
      "Tennis News"
    ]
  }
]
