{
  "id": "33f549a1-91f8-429c-b019-d1c647fa771e",
  "title": "A Smoother Ride: Android Emulator Stability and Performance Updates",
  "link": "http://android-developers.googleblog.com/2024/11/android-emulator-stability-performance-updates.html",
  "description": "",
  "author": "Android Developers",
  "published": "2024-11-13T09:00:00.000-08:00",
  "source": "http://feeds.feedburner.com/blogspot/hsDu",
  "categories": [
    "android developers",
    "Android Development",
    "Android Emulator",
    "Android Studio",
    "Android Studio Emulator",
    "androidstudio",
    "Developer Tools",
    "emulator",
    "Problem-Solving",
    "Studio Bot"
  ],
  "byline": "",
  "length": 5004,
  "excerpt": "Project Quartz, an initiative by the Android Studio team, delivers improvements to the stability, reliability, and performance of the Android Emulator",
  "siteName": "Android Developers Blog",
  "favicon": "",
  "text": "Posted by Neville Sicard-Gregory – Senior Product Manager, Android Studio Looking for a more stable, reliable, and performant Emulator? Download the latest version of Android Studio or ensure your Emulator is up to date in the SDK Manager. We know how critical the stability, reliability, and performance of the Android Emulator is to your everyday work as an Android developer. After listening to valuable feedback about stability, reliability, and performance, the Android Studio team took a step back from large feature work on the Android Emulator for six months and started an initiative called Project Quartz. This initiative was made up of several workstreams aimed at reducing crashes, speeding up startup time, closing out bugs, and setting up better ways to detect and prevent issues in the future. Improved stability and reliability A key goal of Project Quartz aimed to reduce Emulator crashes, which can frustrate and block developers, decreasing their productivity. We focused on fixing issues causing backend and UI crashes and freezes, updated the UI framework, updated our hypervisor framework, and our graphics libraries, and eliminated tech debt. This included: Moving to a newer version of Qt, the cross-platform framework for building the graphical user interfaces of the Android Emulator, and making it stable on all platforms (as of version 34.2.13/ This was also a required change to ensure things like Google Maps and the location settings UI continued to work in the Android Emulator. Updating gfxstream, the graphics rendering system used in the Android Emulator, to improve our graphics layer. Adding more than 600 end-to-end tests to the existing pytests test suite. As a result, we have seen 30% fewer crashes in the latest stable version of Android Studio, as reported by developers who have opted-in to sharing crash details with us. Along with additional end-to-end testing, this means a more stable, reliable, and higher quality experience with fewer interruptions while using the Android Emulator to test your apps. This chart illustrates the reduction in reported crashes by stable versions of the Android Emulator (newer versions are at the top and shorter is better). We have also enhanced our opt-in telemetry and logging to better understand and identify the root causes of crashes, and added more testing to our pre-launch release process to improve our ability to detect potential issues prior to release. Improved release quality We also implemented several measures to improve release quality, including increasing the number and frequency of end-to-end, automated, and integration tests on macOS, Microsoft Windows, and Linux. Now, more than 1,100 end-to-end tests are ran in postsubmit, up from 500 tests in the past implementation, on all supported operating system platforms . These tests cover various scenarios, including (among other features) different Android Emulator snapshot configurations, diverse graphics card considerations , networking and Bluetooth functionality, and performance benchmarks between Android Emulator system image versions. This comprehensive testing ensures these critical components function correctly and translates to a more reliable testing environment for developers. As a result, Android app developers can accurately assess their app's behavior in a wider range of scenarios. Reduced open issues and bugs It was also important for us to reduce the number of open issues and bugs logged for the Android Emulator by addressing their root cause and ensuring we cover more of the use cases you run into in production. During Project Quartz, we reduced our open issues by 43.5% from 4,605 to 2,605. 17% of these were actively fixed during Quartz and the remaining were closed as either obsoleted or previously fixed (e.g. in an earlier version of the Android Emulator) or duplicates of other issues. Next Steps While these improvements are exciting, it's not the end. We will continue to build on the quality improvements from Project Quartz to further enhance the Android Emulator experience for Android app developers. As always, your feedback has and continues to be invaluable in helping us make the Android Emulator and Android Studio more robust and effective for your development needs. Sharing your metrics and crashdumps is crucial in helping us understand what specifically causes your crashes so we can prioritize fixes. You can opt-in by going to Settings, then Appearance and Behavior, then System Settings, then Data Sharing, and selecting the checkbox marked ‘Send usage statistics to Google.' Be sure to download the latest version of the Android Emulator alongside Android Studio to experience these improvements. As always, your feedback is important to us – check known issues, report bugs, suggest improvements, and be part of our vibrant community on LinkedIn, Medium, YouTube, or X. Together, we can create incredible Android experiences for users worldwide!",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3EQV5j-ddJhvUjwyJgHmpQkLE-qfgaRaQyBr5f29cOgm8Q6pQ5_yDEVLGTsX-WQaYlBvflq5J4ywoNLLEGtlerHYhyphenhyphenRGjsDH4hq-HTsmWf5Q74iH2qHJ3mkNKqep83s3gg6Tt-koewlbA3bAZY_PvWds1nbEWMjPjyarZlncLH4DlC1PjlMQ0FpdL1UA/w1200-h630-p-k-no-nu/Making-security-easy--How-we-are-helping-developers-fix-vulnerabilities-social.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cmeta content=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3EQV5j-ddJhvUjwyJgHmpQkLE-qfgaRaQyBr5f29cOgm8Q6pQ5_yDEVLGTsX-WQaYlBvflq5J4ywoNLLEGtlerHYhyphenhyphenRGjsDH4hq-HTsmWf5Q74iH2qHJ3mkNKqep83s3gg6Tt-koewlbA3bAZY_PvWds1nbEWMjPjyarZlncLH4DlC1PjlMQ0FpdL1UA/s1600/Making-security-easy--How-we-are-helping-developers-fix-vulnerabilities-social.png\" name=\"twitter:image\"/\u003e\n\u003cp\u003e\u003cem\u003ePosted by Neville Sicard-Gregory – Senior Product Manager, Android Studio\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPf66eBB0y6lfopevRS37fYQbDd5SL7TbEA-V4SY2jd9NMC8VIkZaRZ25-GIJ73Bk8EqwiP6oZ7NewPEaoip5Jw-6WcRm3qeOWEsKpdipRJ-uLIJk42DcE60Vo1n6_3ln7Hs8oELO2wxbmVDfQwCvl8UbTyCcPKZQkeDpUQWj6gyhs8aM9grx4jr1jqEg/s1600/Making-security-easy--How-we-are-helping-developers-fix-vulnerabilities-header.png\"\u003e\u003cimg data-original-height=\"800\" data-original-width=\"100%\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPf66eBB0y6lfopevRS37fYQbDd5SL7TbEA-V4SY2jd9NMC8VIkZaRZ25-GIJ73Bk8EqwiP6oZ7NewPEaoip5Jw-6WcRm3qeOWEsKpdipRJ-uLIJk42DcE60Vo1n6_3ln7Hs8oELO2wxbmVDfQwCvl8UbTyCcPKZQkeDpUQWj6gyhs8aM9grx4jr1jqEg/s1600/Making-security-easy--How-we-are-helping-developers-fix-vulnerabilities-header.png\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eLooking for a more stable, reliable, and performant Emulator? Download the latest version of Android Studio or ensure your Emulator is up to date in the SDK Manager.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"A split screen shows Kotlin code on the left and the corresponding Android app display on the right in Android Studio. The app displays the Google Play Store, Photos, YouTube, Gmail, and Chrome icons.\" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhpdPMYzsht4pIoeqviDpgLRLjAXLfYU2twrwePnR5UFZws1R0UEjrI_3L913K9Y0acJJE4wWAAwlLobWUB0fu3K6xdb_TkiEkR1Ut3wx9VYsda2IXDNvWnrH5dOrE4I5uBA5kYX7zlm-HDB3cFsQsN-4t9rT8ExXiEjRpnhgUPcPaTWnb_dY8OMjB2eXA/s1600/image2.png\" width=\"640\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eWe know how critical the stability, reliability, and performance of the Android Emulator is to your everyday work as an Android developer. After listening to valuable feedback about stability, reliability, and performance, the Android Studio team took a step back from large feature work on the Android Emulator for six months and started an initiative called Project Quartz. This initiative was made up of several workstreams aimed at reducing crashes, speeding up startup time, closing out bugs, and setting up better ways to detect and prevent issues in the future.\u003c/p\u003e\n\n\u003ch3\u003eImproved stability and reliability\u003c/h3\u003e\n\n\u003cp\u003eA key goal of Project Quartz aimed to reduce Emulator crashes, which can frustrate and block developers, decreasing their productivity. We focused on fixing issues causing backend and UI crashes and freezes, updated the UI framework, updated our hypervisor framework, and our graphics libraries, and eliminated tech debt. This included:\u003c/p\u003e\n\u003cul\u003e\u003cul\u003e\n\u003cli\u003eMoving to a newer version of Qt, the cross-platform framework  for building the graphical user interfaces of the Android Emulator, and making it stable on all platforms (as of version 34.2.13/ This was also a required change to ensure things like Google Maps and the location settings UI continued to work in the Android Emulator.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\n  \n  \u003cli\u003eUpdating \u003cspan\u003egfxstream\u003c/span\u003e, the graphics rendering system used in the Android Emulator,  to improve our graphics layer.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\n  \n\u003cli\u003eAdding more than 600 end-to-end tests to the existing \u003cspan\u003epytests\u003c/span\u003e test suite.\u003c/li\u003e\n\u003c/ul\u003e\u003c/ul\u003e\n  \n\u003cp\u003eAs a result, we have seen \u003cb\u003e30% fewer crashes\u003c/b\u003e in the latest stable version of Android Studio, as reported by developers who have opted-in to sharing crash details with us. Along with additional end-to-end testing, this means a more stable, reliable, and higher quality experience with fewer interruptions while using the Android Emulator to test your apps.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"A horizontal bar graph showing performance times of different versions of the Android emulator in milliseconds \" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgW-yvJUVqTo896U1BfH3uxjIIbNI8znvZ_7K2moj-Ccsnh1wDW9ZWa9BtZZ21yR_Cr3boilSqUpRQDlrnhpIkBSjDPLIqb1dByqNV8A1RDi9n3dwTh25-lFSbZI9JXCcuIUOBnzNBF0F0pOvkfH8feGGdlWh50WBfmb6H1ApEuHojb-ahrwd8kPgLrbx4/s1600/image1.png\" width=\"640\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eThis chart illustrates the reduction in reported crashes by stable versions of the Android Emulator (newer versions are at the top and shorter is better).\u003c/p\u003e\n\n\u003cp\u003eWe have also enhanced our opt-in telemetry and logging to better understand and identify the root causes of crashes, and added more testing to our pre-launch release process to improve our ability to detect potential issues prior to release.\u003c/p\u003e\n\n\u003ch3\u003eImproved release quality\u003c/h3\u003e\n\n\u003cp\u003eWe also implemented several measures to improve release quality, including increasing the number and frequency of end-to-end, automated, and integration tests on macOS, Microsoft Windows, and Linux. Now, more than 1,100 end-to-end tests are ran in postsubmit, up from 500 tests in the past implementation, on all supported operating system platforms .  These tests cover various scenarios, including (among other features) different Android Emulator snapshot configurations, diverse graphics card considerations , networking and Bluetooth functionality, and performance benchmarks between Android Emulator system image versions.\u003c/p\u003e\n\n\u003cp\u003eThis comprehensive testing ensures these critical components function correctly and translates to a more reliable testing environment for developers.  As a result, Android app developers can accurately assess their app\u0026#39;s behavior in a wider range of scenarios.\u003c/p\u003e\n\n\u003ch3\u003eReduced open issues and bugs\u003c/h3\u003e\n\n\u003cp\u003eIt was also important for us to reduce the number of open issues and bugs logged for the Android Emulator by addressing their root cause and ensuring we cover more of the use cases you run into in production.  During Project Quartz, we \u003cb\u003ereduced our open issues by 43.5%\u003c/b\u003e from 4,605 to 2,605. 17% of these were actively fixed during Quartz and the remaining were closed as either obsoleted or previously fixed (e.g. in an earlier version of the Android Emulator) or duplicates of other issues.\u003c/p\u003e\n\n\u003ch3\u003eNext Steps\u003c/h3\u003e\n\n\u003cp\u003eWhile these improvements are exciting, it\u0026#39;s not the end. We will continue to build on the quality improvements from Project Quartz to further enhance the Android Emulator experience for Android app developers.\u003c/p\u003e \n\n\u003cp\u003eAs always, your feedback has and continues to be invaluable in helping us make the Android Emulator and Android Studio more robust and effective for your development needs. Sharing your metrics and crashdumps is crucial in helping us understand what specifically causes your crashes so we can prioritize fixes.\u003c/p\u003e\n\n\u003cp\u003eYou can opt-in by going to Settings, then Appearance and Behavior, then System Settings, then Data Sharing, and selecting the checkbox marked ‘Send usage statistics to Google.\u0026#39;\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"The Android Studio settings menu displays the Data Sharing settings page, where \u0026#39;Send usage statistics to Google\u0026#39; option is selected.\" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3pm5UI2AhYd7j8mRXwq8ex7zx76vWnYj6H-693i_3dQWwey1CBMXsyoXIx5EzVhlGBQR0tXt7cRGmKLDSW515UWHIlQz7pJQU8oN6XzlOEXcBUz_fyaW8A-yOX3LssfAggwT1-EFm0MNQgy0rDxfEZsjIFimfFjrg3xshTz_1ziw45SgeXJJd9nw0YKk/s1600/image4.png\" width=\"640\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eBe sure to download the latest version of the Android Emulator alongside \u003ca href=\"https://developer.android.com/studio/preview\" target=\"_blank\"\u003eAndroid Studio\u003c/a\u003e to experience these improvements.\u003c/p\u003e\n\n\u003cp\u003eAs always, your feedback is important to us – check \u003ca href=\"https://developer.android.com/studio/known-issues\" target=\"_blank\"\u003eknown issues\u003c/a\u003e, \u003ca href=\"https://developer.android.com/studio/report-bugs\" target=\"_blank\"\u003ereport bugs\u003c/a\u003e, suggest improvements, and be part of our vibrant community on \u003ca href=\"https://www.linkedin.com/showcase/androiddev/posts/?feedView=all\" target=\"_blank\"\u003eLinkedIn\u003c/a\u003e, \u003ca href=\"https://medium.com/androiddevelopers\" target=\"_blank\"\u003eMedium\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/c/AndroidDevelopers/videos\" target=\"_blank\"\u003eYouTube\u003c/a\u003e, or \u003ca href=\"https://twitter.com/androidstudio\" target=\"_blank\"\u003eX\u003c/a\u003e. Together, we can create incredible Android experiences for users worldwide!\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
