{
  "id": "700dafb6-e722-41cb-8071-2543fa6f5572",
  "title": "Android Weekly Issue #673",
  "link": "https://androidweekly.net/issues/issue-673/rss.xml",
  "description": "Articles \u0026 Tutorials Sponsored Build faster than your coffee cools ☕️🚀 Tired of builds slower than Monday mornings? This Bitrise guide spills the secrets to turbocharging your Android workflow, locking down security, and launching apps smoother than a bug-free pull request. Ready to push code faster and hit green builds? Mastering LinkAnnotation: The Modern Approach to Text Links Nav Singh explains how to replace deprecated ClickableText with LinkAnnotation in Jetpack Compose, enabling more flexible and maintainable in-app link handling. Effective Strategies for Testing Asynchronous Kotlin Code Ignacio Carrión shares patterns for reliably testing Kotlin coroutines and flows, focusing on controlling coroutine execution in unit tests. Sponsored Get modern mobile observability built on OTel Are you tired of using error tracking tools that do not communicate with backend teams or solve complex issues? Check out this quick video to learn how Embrace can help your entire organization keep a finger on the pulse of app performance and user experience. Kotlin runCatching Explained: A Cleaner Alternative to try-catch? Arpit Choudhary explains how Kotlin’s runCatching provides a cleaner, functional alternative to try-catch for handling exceptions. How I Built a Plugin to Solve My Most Annoying KMM Dev Problem Abdelraouf Sabri built the OpenInTools plugin to simplify KMM development by enabling quick access to Xcode and other tools directly from IntelliJ IDEA. Ensure public interface reliability: Tracking API compatibility for Android and Kotlin Jaewoong Eum explains how to ensure Android SDK stability by using tools like Binary Compatibility Validator and Metalava to track and prevent unintended public API changes. Room Database Nathan Kayumba introduces the Room persistence library as a way to give Android apps local memory, enabling structured data storage and retrieval through a simplified abstraction over SQLite. Securing Android: Behind a few seconds of payment transaction Sofien Rahmouni outlines a multi-layered approach to securing Android payment apps, including runtime checks for debugging, root access, and developer options, along with code obfuscation and integrity verification. How to Use Kotlin Notebooks for Productive Development Ilya Muradyan introduces Kotlin Notebooks in IntelliJ IDEA 2025.1, highlighting their use for interactive development, rapid prototyping, and seamless code execution within the IDE. Structuring Ktor Projects Using Domain-Driven Design (DDD) Concepts Anton Arhipov provides a step-by-step guide to structuring Ktor projects using Domain-Driven Design principles, demonstrating the approach by building a minimalistic CRM system. Proto vs JSON: When to Use Which (and Why) Rahul Ray compares JSON and Proto, recommending Proto for performance-critical apps and JSON for human-readable configurations and public APIs. Avoid using Array in the data class constructor in Kotlin Anatolii Frolov warns that using Array in Kotlin data classes can cause equality issues and suggests using List instead for correct comparisons. Place a sponsored post Advertise to more than 80k Android developers! We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product! Libraries \u0026 Code night-clock A simple, elegant, and always-on digital clock News Announcing Android support of digital credentials Google introduces native support for digital credentials in Android via the Credential Manager’s DigitalCredential API, enabling apps to issue and verify verifiable credentials like IDs and memberships using OpenID standards Videos \u0026 Podcasts Android Push Notification Flow using FCM Learn about Android push notification flow using Firebase Cloud Messaging. Sergio Sastre, Screenshot testing and TDD Sergio Sastre discusses screenshot testing and test-driven development (TDD) in Android, sharing insights on how visual regression testing can improve UI reliability and developer confidence. Productive Day In The Life Of a Software Engineer Daniel Atitienei takes you through a productive day in the life of a developer! How Kotlin Developers Use JetBrains AI Assistant in IntelliJ IDEA JetBrains AI Assistant is built into IntelliJ IDEA to help you write Kotlin stay focused and code faster. In this video, we walk you through how it works and what it can do – from smarter code completion to multi-file edits and context-aware chat. Why 99% Are Using Coroutine Dispatchers WRONG! Philipp Lackner looks at two bad examples of using coroutine dispatchers, the differences between coroutines and threads, Dispatchers.IO \u0026 Dispatchers.Default and which one is better for what and why? Testing in Android: What to Test, and How to Test It Jov Mit's coding livestream with integrated vs. integration tests, doing outside-In TDD on Android, testing in a modularized setup, and more. Using JetBrains AI Assistant to code turned out great In this episode, Code with the Italians and walk through what works, what doesn't, and how to adapt machine-generated logic to real-world chaos.",
  "author": "",
  "published": "Sun, 04 May 2025 13:06:10 +0000",
  "source": "https://androidweekly.net/rss.xml",
  "categories": null,
  "byline": "",
  "length": 1612,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "Tired of builds slower than Monday mornings? This Bitrise guide spills the secrets to turbocharging your Android workflow, locking down security, and launching apps smoother than a bug-free pull request. Ready to push code faster and hit green builds? Are you tired of using error tracking tools that do not communicate with backend teams or solve complex issues? Check out this quick video to learn how Embrace can help your entire organization keep a finger on the pulse of app performance and user experience. Nathan Kayumba introduces the Room persistence library as a way to give Android apps local memory, enabling structured data storage and retrieval through a simplified abstraction over SQLite. We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product! A simple, elegant, and always-on digital clock Google introduces native support for digital credentials in Android via the Credential Manager’s DigitalCredential API, enabling apps to issue and verify verifiable credentials like IDs and memberships using OpenID standards Sergio Sastre discusses screenshot testing and test-driven development (TDD) in Android, sharing insights on how visual regression testing can improve UI reliability and developer confidence. Philipp Lackner looks at two bad examples of using coroutine dispatchers, the differences between coroutines and threads, Dispatchers.IO \u0026 Dispatchers.Default and which one is better for what and why? ]]\u003e",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bitrise.io/streamlining-android-app-development-and-mobile-release-best-practices?utm_medium=paid_other\u0026amp;utm_source=android%20weekly\u0026amp;utm_campaign=all_ebook_streamlining-android-app-development-and-mobile-release_all_2025-04-24\u0026amp;utm_content=nl_sponsorship\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/681765/413c93bc75b5015b34/square_1200x1200_Linkedin_B.jpg\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eTired of builds slower than Monday mornings? This Bitrise guide spills the secrets to turbocharging your Android workflow, locking down security, and launching apps smoother than a bug-free pull request. Ready to push code faster and hit green builds? \n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://embrace.io/video/?utm_source=newsletter\u0026amp;utm_medium=paid\u0026amp;utm_campaign=android-weekly-5-4-2025\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/681765/6c3c93bc75b5015b3f/square_EmbraceLogo_Alt_yellow-on-lead_85x85__2_.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eAre you tired of using error tracking tools that do not communicate with backend teams or solve complex issues? Check out this quick video to learn how Embrace can help your entire organization keep a finger on the pulse of app performance and user experience.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\u003cdiv\u003e\u003cp\u003eNathan Kayumba introduces the Room persistence library as a way to give Android apps local memory, enabling structured data storage and retrieval through a simplified abstraction over SQLite.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://androidweekly.net/jobs/new\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/681765/c63c93bc75b5015b56/square_aw.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eWe reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product!\n\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eA simple, elegant, and always-on digital clock \n\u003c/p\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eGoogle introduces native support for digital credentials in Android via the Credential Manager’s DigitalCredential API, enabling apps to issue and verify verifiable credentials like IDs and memberships using OpenID standards\n\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.youtube.com/watch?v=TrufwW4ILHg\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/6816a2/b53c93bc75b5014604/square_Bildschirmfoto_2025-05-04_um_15.05.44.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSergio Sastre discusses screenshot testing and test-driven development (TDD) in Android, sharing insights on how visual regression testing can improve UI reliability and developer confidence.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003cdiv\u003e\u003cp\u003ePhilipp Lackner looks at two bad examples of using coroutine dispatchers, the differences between coroutines and threads, Dispatchers.IO \u0026amp; Dispatchers.Default and which one is better for what and why?\n\u003c/p\u003e\u003c/div\u003e\n\n\n]]\u0026gt;\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
