{
  "id": "768bef03-2c89-4e37-904c-3b41d5446290",
  "title": "New devices at MWC, gaming news, XR \u0026 Gemini in Android Studio: Tune in for our winter episode of #TheAndroidShow on March 13!",
  "link": "http://android-developers.googleblog.com/2025/03/theandroidshow-winter-teaser.html",
  "description": "",
  "author": "Android Developers",
  "published": "2025-03-04T10:00:00.001-08:00",
  "source": "http://feeds.feedburner.com/blogspot/hsDu",
  "categories": [
    "#TheAndroidShow",
    "Android Studio",
    "Android XR",
    "Gemini",
    "Mobile World Congress"
  ],
  "byline": "",
  "length": 2452,
  "excerpt": "Catch the winter episode of #TheAndroidShow on March 13th at 10AM PT, covering new devices from MWC, updates for Gemini in Android Studio, and more.",
  "siteName": "Android Developers Blog",
  "favicon": "",
  "text": "Posted by Anirudh Dewani, Director – Android Developer Relations In just a few days, on Thursday, March 13 at 10AM PT, we’ll be dropping our winter episode of #TheAndroidShow, on YouTube and on developer.android.com! Mobile World Congress - the annual event in Barcelona where Android device makers show off their latest devices, kicked off yesterday. In our winter episode we’ll take a look at these foldables, tablets and wearables and tell you what you need to get building. Plus we’ve got some news to share, like a new update for Gemini in Android Studio and some new goodies for games developers ahead of the Game Developer Conference (GDC) in San Francisco later this month. And of course, with the launch of Android XR in December, we’ll also be taking a look at how to get building there. It’s a packed show, and you don’t want to miss it! Some new Android foldables and tablets, at Mobile World Congress Mobile World Congress is a big moment for Android, with partners from around the world showing off their latest devices. And if you’re already building adaptive apps, we wanted to share some of the cool new foldable and tablets that our partners released in Barcelona: OPPO: OPPO launched their Find N5, their slim 8.93mm foldable with a 8.12” large screen - making it as compact or expansive as needed. Xiaomi: Xiaomi debuted the Xiaomi Pad 7 series. Xiaomi Pad 7 provides a crystal-clear display and, with the productivity accessories, users get a desktop-like experience with the convenience of a tablet. Lenovo: Lenovo showcased their Yoga Tab Plus, the latest powerful tablet from their lineup designed to empower creativity and productivity. These new devices are a great reason to build adaptive apps that scale across screen sizes and device types. Plus, Android 16 removes the ability for apps to restrict orientation and resizability at the platform level, so you’ll want to prepare. To help you get started, the Compose Material 3 adaptive library enables you to quickly and easily create layouts across all screen sizes while reducing the overall development cost. Tune in to #TheAndroidShow: March 13 at 10AM PT These new devices are just one of the many things we’ll cover in our winter episode, you don’t want to miss it! If you watch live on YouTube, we’ll have folks standing by to answer your questions in the comments. See you on March 13 on YouTube or at developer.android.com/events/show!",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQBszMd72OyB1ngV0axrvoLEmlxR4spySpayHu3x3GB9GxJw4Rc9Cpgj1qx9sSjP9K1VZ3a5myVvfd6AL37IbpU-sFDfGYGZjrHksTIpXbJ5dPERDVKbyyVABe0NnKru7T1d_Qeuce2QkvKxEbt2Rd2nzUNQLvDJCfXRrtloXyuFBmU2XzxsPaSklcL9I/w1200-h630-p-k-no-nu/0012-AFD-%23theandroidshow-%20twitter%20linkedin%20headerv2_linkedin%20event.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cmeta name=\"twitter:image\" content=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQBszMd72OyB1ngV0axrvoLEmlxR4spySpayHu3x3GB9GxJw4Rc9Cpgj1qx9sSjP9K1VZ3a5myVvfd6AL37IbpU-sFDfGYGZjrHksTIpXbJ5dPERDVKbyyVABe0NnKru7T1d_Qeuce2QkvKxEbt2Rd2nzUNQLvDJCfXRrtloXyuFBmU2XzxsPaSklcL9I/s1600/0012-AFD-%23theandroidshow-%20twitter%20linkedin%20headerv2_linkedin%20event.png\"/\u003e\n\u003cp\u003e\n\n\u003cem\u003ePosted by Anirudh Dewani, Director – Android Developer Relations \u003c/em\u003e\n\n\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgvB2K3QLe6XaP0hKujnUwfR79jbmW9E06IArhc_CIFY8affS2n3pULA2Hr-a9PpACYkCuYXfw8y6fTyD8E7kUAS3hBjMIG6xjPilHDe2Va8i33RzZhxFsYA-tW_VMRfhI4-CF-9pcTLm63IJqf55zichDWJ7gTk66gV6vkVLHCGRtZbyh1T4I1eI-fG1I/s1600/%23TAS-Fall-Banner%20%282%29.png\" imageanchor=\"1\"\u003e\u003cimg data-original-height=\"800\" data-original-width=\"100%\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgvB2K3QLe6XaP0hKujnUwfR79jbmW9E06IArhc_CIFY8affS2n3pULA2Hr-a9PpACYkCuYXfw8y6fTyD8E7kUAS3hBjMIG6xjPilHDe2Va8i33RzZhxFsYA-tW_VMRfhI4-CF-9pcTLm63IJqf55zichDWJ7gTk66gV6vkVLHCGRtZbyh1T4I1eI-fG1I/s1600/%23TAS-Fall-Banner%20%282%29.png\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIn just a few days, on \u003cb\u003eThursday, March 13 at 10AM PT\u003c/b\u003e, we’ll be dropping our winter episode of \u003cb\u003e#TheAndroidShow\u003c/b\u003e, on \u003ca href=\"https://www.youtube.com/live/gapm5MlH-ZU?si=DjNUN5wQmsVQX24l\" target=\"_blank\"\u003eYouTube\u003c/a\u003e and on \u003ca href=\"http://developer.android.com/events/show\" target=\"_blank\"\u003edeveloper.android.com\u003c/a\u003e! \u003c/p\u003e \n\n\u003cp\u003eMobile World Congress - the annual event in Barcelona where Android device makers show off their latest devices, kicked off yesterday. In our winter episode we’ll take a look at these foldables, tablets and wearables and tell you what you need to get building. \u003c/p\u003e \n\n\u003cp\u003ePlus we’ve got some news to share, like a new update for Gemini in Android Studio and some new goodies for games developers ahead of the Game Developer Conference (GDC) in San Francisco later this month. And of course, with the launch of Android XR in December, we’ll also be taking a look at how to get building there. It’s a packed show, and you don’t want to miss it!\u003c/p\u003e  \n\n\u003ciframe allowfullscreen=\"\" height=\"413\" src=\"https://www.youtube.com/embed/6Nwq0oI41lg\" width=\"100%\" youtube-src-id=\"6Nwq0oI41lg\"\u003e\u003c/iframe\u003e \n\n\u003ch3\u003e\u003cspan\u003eSome new Android foldables and tablets, at Mobile World Congress\u003c/span\u003e\u003c/h3\u003e\n  \n\u003cp\u003eMobile World Congress is a big moment for Android, with partners from around the world showing off their latest devices. And if you’re already building adaptive apps, we wanted to share some of the cool new foldable and tablets that our partners released in Barcelona:\u003c/p\u003e  \n\u003cul\u003e\u003cul\u003e\n\u003cli\u003e\u003cb\u003e\u003ca href=\"https://www.oppo.com/en/smartphones/series-find-n/find-n5/#\" target=\"_blank\"\u003eOPPO\u003c/a\u003e:\u003c/b\u003e OPPO launched their Find N5, their slim 8.93mm foldable with a 8.12” large screen - making it as compact or expansive as needed.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e \n\u003cli\u003e\u003cb\u003eXiaomi:\u003c/b\u003e Xiaomi debuted the Xiaomi Pad 7 series. Xiaomi Pad 7 provides a crystal-clear display and, with the productivity accessories, users get a  desktop-like experience with the convenience of a tablet.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e \n\u003cli\u003e\u003cb\u003e\u003ca href=\"https://news.lenovo.com/pressroom/press-releases/expand-and-empower-creativity-with-ai-enabled-new-lenovo-yoga-and-ideapad-devices/\" target=\"_blank\"\u003eLenovo\u003c/a\u003e:\u003c/b\u003e Lenovo showcased their Yoga Tab Plus, the latest powerful tablet from their lineup designed to empower creativity and productivity.\u003c/li\u003e\n\u003c/ul\u003e\u003c/ul\u003e \n\n\u003cp\u003eThese new devices are a great reason to build adaptive apps that scale across screen sizes and device types. Plus, \u003ca href=\"https://developer.android.com/about/versions/16\" target=\"_blank\"\u003eAndroid 16\u003c/a\u003e \u003ca href=\"https://android-developers.googleblog.com/2025/01/orientation-and-resizability-changes-in-android-16.html\" target=\"_blank\"\u003eremoves the ability for apps to restrict orientation and resizability\u003c/a\u003e at the platform level, so you’ll want to prepare. To help you get started, the \u003ca href=\"http://developer.android.com/adaptive-apps\" target=\"_blank\"\u003eCompose Material 3 adaptive library enables you to quickly and easily create layouts across all screen sizes\u003c/a\u003e while reducing the overall development cost.\u003c/p\u003e \n\n\u003ch3\u003e\u003cspan\u003eTune in to #TheAndroidShow: March 13 at 10AM PT\u003c/span\u003e\u003c/h3\u003e\n\n\u003cp\u003eThese new devices are just one of the many things we’ll cover in our winter episode, you don’t want to miss it! If you watch live on \u003ca href=\"https://www.youtube.com/live/gapm5MlH-ZU?si=DjNUN5wQmsVQX24l\" target=\"_blank\"\u003eYouTube\u003c/a\u003e, we’ll have folks standing by to answer your questions in the comments. See you on March 13 on YouTube or at \u003ca href=\"https://developer.android.com/events/show\" target=\"_blank\"\u003edeveloper.android.com/events/show\u003c/a\u003e!\u003c/p\u003e \n\n\n\u003c/div\u003e\n\u003chr/\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
