[
  {
    "id": "fb685aa6-8e02-491a-89ad-35ba4ce01f5d",
    "title": "1967 Ferrari 330 GT 2+2 Series II",
    "link": "https://bringatrailer.com/listing/1967-ferrari-330gt-22-5/",
    "description": "This 1967 Ferrari 330 GT 2+2 is one of approximately 455 Series II examples produced and was ordered by its first owner via the Estes-Zipper Motor Company of Beverly Hills, California on June 14, 1967. Chassis 10165 stayed with its original owner until 2001, and it was purchased by the current owner in 2011. The car is finished in silver over red leather upholstery, and power comes from a 4.0-liter Colombo V12 that breathes through triple Weber carburetors and is mated to a five-speed manual transmission. Equipment includes a limited-slip differential, a quad-exit exhaust, power-assisted steering and four-wheel disc brakes, 15\" Borrani wire wheels, air conditioning, power windows, and a rear window defroster. This Ferrari 330 is now offered on dealer consignment with factory literature, tools, original sales documentation,  and a clean Illinois title in the owner's name.",
    "author": "bringatrailer",
    "published": "Sun, 20 Oct 2024 21:15:17 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/09/BAT-Ferrari-Silver-11-21143.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "b37f845d-d66a-4538-b106-2e17bb789683",
    "title": "34k-Mile Modified 2004 Porsche 911 GT3",
    "link": "https://bringatrailer.com/listing/2004-porsche-911-gt3-92/",
    "description": "This 2004 Porsche 911 GT3 was initially sold in California and spent time in Colorado before the current owner's acquisition in 2021. Modifications include a rebuilt six-speed transaxle fitted with 997 Cup gearing as well as a lightweight flywheel, a GT3 RS 4.0L clutch, an OS Giken limited-slip differential, 996 Cup shifter cables, a Function-First shift-rite solution, CSF radiators, revised engine and transaxle mounts, Tarett Engineering adjustable rear toe links, Öhlins Road and Track coilovers, RS-style front bumper vents, and a rear decklid scoop. Finished in Arctic Silver Metallic over black leather, the car is powered by a 3.6-liter Metzger flat-six and is equipped with 18\" alloy wheels, a lower aero package, xenon headlights, a fixed rear wing, power-adjustable sport seats, automatic climate control, extended leather and carbon-fiber trim, Guards Red seat belts, and a factory CD stereo. This GT3 has 34k miles and is offered on dealer consignment with a window sticker, service records, a clean Carfax report, and a clean Massachusetts title.",
    "author": "bringatrailer",
    "published": "Sun, 20 Oct 2024 21:05:05 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/06/2004_porsche_911-gt3_photo-sep-28-2024-12-12-36-pm-99372.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "4e94f435-14fe-4831-93c9-7299e2a3b464",
    "title": "Ford dealers have a new way to get rich",
    "link": "https://www.autoblog.com/news/ford-dealers-have-a-new-way-to-get-rich",
    "description": "Ford dealers cashing in on electric F-150s — here's how they're making $20K+.",
    "author": "Steven Paul",
    "published": "Sun, 20 Oct 2024 18:07:05 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTEzNTc4NDI5ODg0MjYw/2022-ford-f-150-lightning.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Ford",
      "EVs",
      "2024",
      "ford",
      "News",
      "F-150 Lightning"
    ]
  },
  {
    "id": "188929b8-ff72-42d0-b99d-31d31785f08f",
    "title": "2025 Acura MDX available from $559 with lease offer — A detailed breakdown",
    "link": "https://www.autoblog.com/news/acrua-mdx-lease",
    "description": "Thinking about leasing a 2025 Acura MDX, find a detailed breakdown of the current national lease offer plus our quick thoughts on the 2025 MDX.",
    "author": "Dave McQuilling",
    "published": "Sun, 20 Oct 2024 15:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwMDQ4OTkyNzc4NzI0ODMw/02_2025-acura-mdx-with-advance-package.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Acura",
      "lease"
    ]
  },
  {
    "id": "13daf5a5-12d3-4e0d-b9c6-7f3c8764a1ee",
    "title": "BSA Gold Star 650 vs Royal Enfield Interceptor 650 comparison review",
    "link": "https://www.autocarindia.com/bike-comparison-reviews/bsa-gold-star-650-vs-royal-enfield-interceptor-650-comparison-review-433196#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Here are two modern retro motorcycles that carry a British badge and a sizeable chunk of motorcycling history behind their names. At first glance, these two bikes seem relatively identical since they have similar designs, performance, engine capacity, weight and price. However, the difference is more apparent when these two are ridden back to back. BSA’s Gold Star is the new kid on the block and has no direct rival apart from Royal Enfield’s Interceptor 650. Both these motorcycles approach the same goal in a different manner, which delivers a very different riding experience overall. We’re here to tell you what those differences are and how these two stack up in the real world. Flamboyance \u0026 Flair Given their retro credentials, both motorcycles take a rather minimalist approach to their throwback aesthetics. There is abundant use of chrome, and while looks are subjective, I found myself gravitating a little more towards the Gold Star. Both motorcycles get a round headlamp, flat seats and a well-shaped fuel tank. They are available in multiple colours, depending on which the price can vary. Classy retro dials fit the aesthetic, but the tiny screens are hard to read. The feature list, too, is relatively minimal, and while the Interceptor 650 now gets an LED headlamp that outperforms the simple halogen setup on the Gold Star, BSA’s approach seems a tad more authentic, given the overall aesthetic. On the flip side, both motorcycles get analogue-styled dials, but I quite like the amber backlight on the Gold Star. However, there is no denying that the Interceptor 650’s dials are more readable and that the LCD screen has better visibility. The Gold Star is equipped with a Type-A and Type-C charging socket, while the Interceptor 650 gets a USB port that’s hidden away. Royal Enfield has also equipped the Interceptor with a set of adjustable levers – a welcome addition. While the 650 has more expensive-feeling switchgear with aluminium housings, the Gold Star’s conventional switches are more straightforward to use. In terms of build quality, both motorcycles lack the premium touch and feel like they’re built on a budget. That said, the Gold Star is by far the best offering to come out of Classic Legends’ stable despite having areas that could use improvement. Early signs of rust and  a loose-fitting side panel did seem concerning, but the brand says it is working on improving its overall quality. The Interceptor 650, too, has some signs of rust, but overall, it feels like the better-built machine in this comparison. Interceptor’s clocks are simpler, but the larger digital display is more legible. It is worth mentioning that the Gold Star does not come with a main stand as standard, and BSA – for now – doesn’t offer one as an accessory either. RE’s footpeg placement is a well-known issue. The Interceptor 650 is not only equipped with a main stand but also has a higher ground clearance. My issue with this RE is with its footpegs, which tend to jut out and come in the way while you ‘walk’ the motorcycle in traffic. While this issue is less bothersome for taller riders, shorter ones will find it more tedious. In the saddle The Gold Star’s riding position feels more natural and less aggressive in comparison. You get a slightly more upright seating posture and a more relaxed footpeg position. Coupled with a soft seat and a 780mm seat height, this is more approachable for shorter riders, but someone over 6 feet may find the leg space to be a bit cramped. Rishaad did wish for a slightly firmer seat, which is an easy fix in comparison to the Interceptor 650’s shortcomings. Gold Star has a wider seat with softer padding. Royal Enfield has built the Interceptor 650 with slightly more sportier ergonomics. It’s noticeable from the moment you swing your leg over its taller and narrower seat, and you’ll notice a more forward lean as you reach for the handlebar. Its footpegs, too, are slightly higher, and the narrow seat does rob it of some comfort as it puts more pressure on your tail bones and causes saddle soreness sooner than you’d expect. Royal Enfield does sell a more comfortable accessory, but it doesn’t exactly solve the problem – only makes it slightly more bearable. Seat is well cushioned but uncomfortably narrow. Take aim, fire! The BSA Gold Star’s single-cylinder engine is one of the largest in its class and traces its roots back to the Rotax engine used in the BMW Funduro F650. This motor packs a healthy low- to mid-range performance, builds power from as low as 2,500rpm, and does so linearly. Despite the single-cylinder unit, BSA has done a commendable job of keeping the vibrations in check. Though it is short on one gear, the Gold Star’s engine and gearbox combination work well in tandem and will rarely ever leave you wanting that extra gear. That said, I have a few gripes with this motor, starting with its low-speed throttle response, which can sometimes feel too snatchy. We faced low-speed stalling issues with both motorcycles, but the Gold Star stalled more frequently. Underdamped rear shocks are the main complaint. The Interceptor 650, on the other hand, felt a lot smoother thanks to its extra cylinder and had a more pleasant sound to its exhaust. RE’s 650cc motor will happily cruise in higher gears at lower speeds, and the tractable motor will even reward you with a soothing note each time you downshift, but it is no match for the BSA’s mid-range punch. It felt like the more engaging motor, regardless of the speed or riding style I took up. Our numbers reveal that the Gold Star is the quicker motorcycle of the two. Not only did the Gold Star have better acceleration figures, but it also showcased quicker in-gear acceleration. It is also worth noting that we tested the BSA in the wet, which means we could expect even better numbers with dry tarmac. Interceptor’s suspension setup does a better job. Fuel economy is where the Interceptor 650 shines with a larger fuel tank, longer range and better city and highway efficiency. Its engine also handles high-speed touring better, with a calmer demeanour at higher RPMs. However, in city traffic, the BSA is more accessible to ride due to its more relaxed riding position and lighter clutch. Neither engine had a heating issue in bumper-to-bumper traffic and kept their cool in tight jams.  It’s about to get bumpy   In terms of weight, both motorcycles have a mere 5kg variance, but the difference feels higher, and the Interceptor comes across as a heavier, more cumbersome machine. The Gold Star is nimble at low speeds and showcases capable handling around flat, well-paved corners. However, its underdamped rear suspension is its biggest flaw and renders the ride and handling a bit too wallowy around most bumpy roads. It can take getting used to, but it does hamper the overall day-to-day experience with this motorcycle. On the flip side, the Gold Star’s Pirelli tyres and Brembo brakes do a fantastic job of providing stopping power, and the lever packs a decent amount of feedback. All in all, the bike rides well, but it deserves better rear suspension.  RE’s brakes and tyres aren’t as good as the BSA’s. While not exceptional, the Interceptor 650’s suspension has been improved over time and feels more balanced than the BSA’s. However, its brakes and tyres could use some improvement. Regarding handling, the Interceptor feels more capable with higher lean angles, but it takes more work to manage at low speeds in heavy traffic. BSA’s fit and finish can be improved. Old but gold Price isn’t likely to be the deciding factor, as both bikes are similarly priced. The actual choice comes down to the experience you’re looking for. The BSA Gold Star offers a more authentic retro experience with a delightful torque-driven engine. It’s more comfortable, easier to manage in the city, and can be fun around well-paved corners. Although it falls short on one cylinder and the lower refinement that comes with it, it makes up for it with its engaging power delivery and solid braking performance. It is our choice when it comes to a modern, classic riding experience. However, Classic Legends must prove its long-term reliability. And while the quality levels on its bikes have improved over time, there is still some way to go. BSA’s brake and tyre combo works surprisingly well. The Royal Enfield has a gem of an engine, and if you want a twin-cylinder experience, it has to be the RE. What also works in its favour is RE’s extensive service network and its vast accessory list. So, while we enjoyed riding the BSA more, the Interceptor 650 might be the safer bet for some people. Also See: BSA Gold Star 650 vs Royal Enfield Interceptor 650 comparison video",
    "author": "Gavin Rodrigues",
    "published": "Mon, 14 Oct 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241011044959_C1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "c2843d2f-19d7-4071-a801-959bd15ff711",
    "title": "RS Taichi WP Backpack review",
    "link": "https://www.autocarindia.com/bike-reviews/rs-taichi-wp-backpack-review-433141#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "It’s been nearly a year since I got my hands on RS Taichi’s waterproof backpack, which is available in five colours and a unique Resident Evil edition. I’ve gone for the plain black shade due to its stealthy look and was quite eager to see just how usable this bag would be during monsoon. The WP backpack’s construction mainly comprises polyester and thermoplastic polyurethane. The bag consists of a primary 25-litre waterproof compartment, a smaller compartment located near the primary compartment’s opening and an external quick-access pocket that isn’t waterproof. Main compartment holds 25L. The bag uses a roll-up top system to seal the main compartment and can be adjusted based on how full it gets. It’s easy to use and even includes a Velcro strap to keep it tightly sealed. Its 25-litre storage is a boon for when I’m travelling, and over time, I’ve fit huge items in this compartment, including Rishaad’s fully packed Kriega R25 backpack! Secondary compartment is handy storage for small items The secondary compartment is only water-resistant, even though it uses the same opening as the main compartment. It can be used for smaller items, such as a pair of gloves, balaclavas and cleaning cloths. The third external pocket is mainly designed for items you’d like to keep handy that aren’t fazed by the rain, like a set of keys. Outer pocket is not waterproof. This bag gets a chest harness and a waist belt; both of these can be further adjusted to your size and do a good job of preventing the straps from slipping off the shoulders and distributing luggage weight evenly, especially when on the bike. Chest harness divides the load and provides a better fit. The overall fit, finish and feel of this bag are premium, and it feels built to last. However, after all this time, I did lose the rubberised end on the zipper pull tab located on the external pocket. Honestly, this is quite a minor issue and can be easily replaced. I’ve had absolutely no complaints with this bag otherwise. It’s been quite handy and dependable through my daily commute during peak Mumbai monsoon. Waist harness helps keep the bag secure while riding. Given that this bag is waterproof, you are prone to wearing it outside your protective rain gear, which can make it susceptible to dirt and grime being flung on it by the rear wheel. In such cases, a quick wipe-down with a wet cloth helps, and fortunately, the bag doesn’t stain permanently. This bag is currently available on special order at 6kiom.com and will cost approximately Rs 15,000. Velcro strap help seat the two main compartments well. I managed to buy it for far less overseas, and you may also have to wait anywhere from one to four months for it to be delivered. Just like most imported products, the RS Taichi WP backpack comes at a price, but it gives you good quality and performance in return. Also see: Ixon Dirt Air gloves review",
    "author": "Gavin Rodrigues",
    "published": "Sun, 13 Oct 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241008052945_2.png",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "ae1f800a-7c0d-4108-90ed-a34bdfa2944a",
    "title": "Mini Countryman Electric review: E-motional buy",
    "link": "https://www.autocarindia.com/car-reviews/mini-countryman-electric-review-practical-e-go-kart-433187#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Contrary to the Mini in its name, the Countryman is a large, four-door, spacious crossover squarely aimed at family buyers. Now in its third generation, it has undergone some revolutionary changes, and for the first time ever, it’ll be sold with an electric heart, along with the ICE versions. For India, though, Mini has only introduced the Countryman EV as an import, which, due to its single-motor, front-wheel drive setup, is priced rather competitively at Rs 55 lakh.  But India’s entry-level luxury EV segment is quite populated, by electric car standards at least. It includes the BYD Seal and Hyundai Ioniq 5 at one end – priced sub-Rs 50 lakh – and the Mercedes-Benz EQA (Rs 66 lakh) and BMW iX1 (Rs 67 lakh) on the other end. So, how does the new Mini Countryman EV stack up? 2024 Mini Countryman: design With dimensions larger than a Jeep Compass, this new Countryman can be termed as anything but small. Think Mini, and you’d visualise a compact hatchback. However, with dimensions larger than a Jeep Compass, this new Countryman can be termed as anything but small. Despite its size, a curvy design language and smooth body lines devoid of cuts or creases make it appear chic and urbane rather than brawny and intimidating. Executed with undeniable panache is the matte champagne-coloured garnishing around its closed-off front grille and on the C-Pillar and the front, side and rear skid plates. Even the Mini logos and the Countryman badge are finished in this shade. Cool-looking 19-inch alloys are a part of the optional Favoured Pack. Our test car was fitted with optional 19-inch alloys sporting the champagne scheme, although 17-inch alloys come as standard. A wraparound glass area and a blackened roof mask the Countryman EV’s height well, lending it a wagon-like silhouette. Adding to its feel-good factor are the (optional) LED DRL eyebrows and matrix LED tail-lamps that have a customisable light show upon locking or unlocking. 2024 Mini Countryman: interior, features Like Minis of yore, its cabin is minimalistic with a circular theme. Like yesteryear Minis, the Countryman EV’s cabin has a minimalistic theme with circular elements. The centre of attraction is a 9.4-inch circular OLED touchscreen, which is exceptional in terms of its usability and responsiveness, and its clarity is second to none. Furthermore, fun themes, funky animations and musical notifications will most certainly make you smile while operating it. This screen also doubles up as the speedometer and driver display, which is inconvenient to read on the move. You could consider opting for the Favoured Pack, which gets you a head-up display (HUD) bundled with several other extras, for an additional Rs 4.60 lakh. And while the HUD does make it convenient to read the speed, the unit is simply too basic, especially when compared to the ones available in hatchbacks at a fraction of this Mini’s cost. Like Minis of yore, its cabin is minimalistic with a circular theme. The dashboard is replete with fabric made out of recycled materials. However, its open-pore texture might not be ideal for our dusty conditions. It is finished in blue and neatly fades into a shade of brown towards the rear half of the car; the seats are also brown. The champagne-coloured theme is carried over on the inside and is the most prominent around the air vents and on the vertical door handles. Optional JCW driver’s seat is too sculpted and firm for comfort. The optional JCW Sport driver’s seat on our test car is too sculpted and firm for comfort; hence, it is an option we recommend you uncheck. It has a seat massaging function, though. Things are a bit better at the rear. Space is adequate, the backrest reclines, and even though the floor height is raised and you’re seated in a knees-up position, it is still quite comfortable. Also, accommodating a third passenger is possible due to a flat floor and a broad seat. Seating position is a bit knees-up at rear, but overall, seat is comfy. Being the more practical Mini, the Countryman has an abundance of storage areas; the central console shelf and door pockets are huge, and even its 460-litre boot is large. Sadly, it isn’t equipped with a spare tyre beneath the floor. Fantastic OLED touchscreen is among the best out there. As far as its equipment goes, the Mini gets the aforementioned OLED touchscreen, LED lights, 17-inch alloys, rear-view camera and panoramic sunroof, among others. Customisable LED lights, electrically operable boot and drive modes are some of the optional extras bundled in the Classic Trim, which costs Rs 2 lakh more. In addition, buyers who want a head-up display, JCW Sport seats, 19-inch alloys and a Harman Kardon sound system will need to opt for the earlier-mentioned Favoured Pack. However, this Mini still misses ventilated seats, a 360-degree camera, side and curtain airbags, and adjustable regen via steering-mounted paddle shifters. 2024 Mini Countryman: powertrain, performance The talking point of this EV is its 66.45kWh (gross capacity) battery, which it shares with its platform-mate, the BMW iX1. But unlike its BMW cousin, which uses a twin-motor setup, the Mini makes do with a single-motor, front-wheel-drive setup. And while its motor makes 204hp, its 250Nm torque output doesn’t impress, especially when compared to turbo-petrol cars available at half its price. There’s no storage area beneath its bonnet. But then factor in the instantaneous responsiveness of its motor, and you never yearn for more pep while ambling around town or when driving in a leisurely manner, which is how most owners would drive their Countryman EV. Demand more out of it, though, and its torque curve flattens quickly. The Countryman’s outright performance is lacklustre, and it doesn’t feel as effortless as its rivals. To put its acceleration into perspective, the Mini will sprint from 0-100kph in 8.6 seconds (claimed), slower than a similarly priced Volvo XC40 Recharge front-wheel drive’s 7.3 seconds or a Hyundai Ioniq 5’s 7.5 seconds. Although adequate, its performance feels muted compared to its rivals. Interestingly, the Mini features ‘Iconic Sounds’, which gives drivers the option to play synthesised motor sounds via the speakers. These sounds are loudest in the Go-Kart mode, wherein it’ll also emit its own version of ‘pops and bangs’ when you lift off the accelerator pedal. These certainly liven up the drive experience and add a degree of fun to the otherwise quiet and drama-free EV experience. 2024 Mini Countryman: ride, handling Its Mini-ness is evident when you find yourself on a winding section of a road. The Mini-ness of the Countryman EV becomes evident when you find yourself on a winding section of a road. Its sharp steering and pointy front end make it feel very agile, and despite its size, it still handles in a ‘go-kart-like’ manner. Ride quality isn’t harsh or jarring per se, but you hear each and every ‘thud’ and ‘thwack’ while driving on our less-than-perfect roads on account of a noisy suspension that’s further exacerbated by its upsized, optional 19-inch wheels. The suspension noise seriously hampers the driving experience, coaxing you to drive with more caution than what the Countryman EV can actually handle. 2024 Mini Countryman: verdict It’s hard not to be enamoured by the charming new Mini Countryman. Besides oozing character, it carries forward the traditional go-kart-like driving mannerisms associated with Minis, all while being spacious and practical. But the Countryman EV’s proposition isn’t complete – rivals are more comfortable, offer better performance and provide more equipment. So, like other Minis, even this ‘practical’ Countryman is purely an emotional purchase, and if you decide to take the plunge, be rest assured that it’s a car that’ll make you smile every time you’re behind the wheel. Also see: 2024 Mini Countryman video review Mini Countryman Electric launched at Rs 54.90 lakh Electric Mini Cooper JCW gets 258hp",
    "author": "Saumil Shah",
    "published": "Sun, 20 Oct 2024 07:30:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241014043349_7 _2_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "470dd833-f1eb-4bc3-9057-5708ab37ef6e",
    "title": "Nissan Magnite facelift review: Small changes, big effect",
    "link": "https://www.autocarindia.com/car-reviews/nissan-magnite-facelift-review-small-changes-big-effect-433259#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "It’s been nearly four years since Nissan brought the Magnite to India, and the compact SUV has shouldered the responsibility of establishing the Japanese brand's presence in the country. The X-Trail is a recent addition, serving more as a brand statement than a bread-and-butter model. Over the past six months, Nissan has despatched more than 12,000 units of the Magnite to its dealers (over 2,000 units every month) and has exported over 30,000 made-in-India models to international markets in the past four years.That the compact SUV will have to soldier on here, combined with the company's aim to export nearly 1 lakh units to 65 left-hand and right-hand-drive markets by 2026, underscores that a lot is riding on this facelift. Nissan Magnite facelift: exterior, design While the changes to the Magnite facelift’s design may seem insignificant when seen individually, together they add a dose of ruggedness to the compact SUV. The addition of a piano black appliqué that connects the grille and headlights makes the former look larger. The front bumper gets contrasting silver bits that protrude slightly, adding to the muscular appearance and also serving as fog light housings. Facelift gets a more muscular-looking facia. The new, smart-looking dual-tone 16-inch alloys add some freshness to the sides of the Magnite. The tail-lights get new 3D LED signatures that are quite attractive. Also, the Sunrise Copper Orange exterior colour is new and suits the Magnite well, especially with the contrasting black roof. Nissan Magnite facelift: interior It’s a similar story on the inside – there are small changes, but the effect is notable. The Magnite facelift’s cabin looks and feels far more premium, thanks to the copper-coloured leatherette finish on the dashboard and door panels, especially compared to the outgoing model’s nearly all-black plastic finish. The steering now gets an all-black finish that contrasts well with the dash, and the seats in the top-spec Tekna+ variant come in dual-tone copper-black leatherette covers that help keep one’s back and bottom cool, especially in conjunction with the strong automatic climate control system. Leatherette on the dash and doors uplifts cabin tremendously compared to outgoing model. However, not everything is perfect. The new ambient lights do add to the ambience, but the execution could have been a bit more seamless. In addition, the steering column is visible in the footwell, and the accelerator and brake pedals are placed a little too close together. In terms of practicality and comfort, the Magnite facelift retains its ability to carry four passengers with ease – though three seated abreast in the back will find shoulder room lacking – and comes with a 336-litre boot, which is good enough for a couple of large suitcases, and expands to 690 litres with the rear seats folded. Multi-colour ambient lighting feels a bit like an afterthought.   Nissan Magnite facelift: features The faceliftcomes with a slightly expanded feature list. The Magnite has always been a well-equipped compact SUV, and it now adds goodies like engine remote start, auto headlights, an auto-dimming IRVM (the frameless unit picks up fingerprints and smudges too easily), a cooled glove box, and a USB C-Type port for rear passengers. The updated 7-inch digital instrument cluster is less gimmicky than that of the outgoing model, yet it displays the same amount of information, making it a welcome upgrade. Updated 7-inch digital instrument cluster is less cartoon-ish, a welcome change. The standard safety kit on every Magnite variant includes six airbags, three-point seat belts for all passengers, ISOFIX anchors, ABS, traction control, a tyre pressure monitor, and a hill-start assist. The higher Techna and Techna+ variants also get a 360-degree camera, which doesn’t have the best resolution but works effectively. Nissan Magnite facelift: performance, ride and handling The Magnite is still offered with either a 72hp, 1.0-litre naturally aspirated petrol engine or a 100hp, 1.0-litre turbo-petrol unit; we’ve driven the latter, and it’s just as enjoyable as before. This three-cylinder unit has a strong mid-range punch and works well with the smooth CVT to mask any lag at lower revs. Speaking of the CVT, at low and medium engine speeds, there’s barely any of that typical ‘rubber band’ effect, but if you drive with a heavy right foot, it will set in. Cabin insulation has improved marginally, but the three-pot engine’s clatter is still audible, and it gets boomier as the revs rise. Punchy turbo-petrol and relatively light weight make the Magnite quicker than you'd expect. At slower speeds, there is an underlying firmness to the Magnite’s suspension setup, but it doesn’t feel uncomfortable at any point. On the highway, the suspension does a much better job of filtering out road undulations, making it an able cruiser. What also helps is the steering that weighs up as the speeds rise, and the 195/60 tyres offer a decent amount of grip, instilling confidence when going through twisty ghat sections. On the other hand, despite doing a good job, the brakes don’t lend as much confidence as they should as the pedal feel is mushy, and there’s some slack before the brakes bite. Nissan Magnite facelift: price, verdict On the face of it, it may seem like not much has changed with the Magnite facelift, but that’s not true. It retains all the qualities of its predecessor –brilliant design, comfort, a sporty feel, and a well-equipped interior, all with an attractive price tag– while showing marked improvements in areas such as interior ambience and feel-good features.   Other than the visible cost-cutting and the lack of a sunroof at this price point (models such as the Venue, Nexon, and XUV 3XO offer one at the Rs 11.50 lakh that this top-spec Tekna + variant retails for), the Magnite is a more than competent package, especially when one considers that you pay just Rs 23,000 more for it compared to the outgoing model’s top-spec trim. The Magnite model should help Nissan maintain a foothold in India, at least for the near future. All prices, ex-showroom, India Also see: Nissan Magnite: new versus old Nissan Magnite facelift price, variants, features explained",
    "author": "Rivan RS",
    "published": "Fri, 18 Oct 2024 13:25:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241018010722_Nissan_Magnite_facelift_front_tracking.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "f00c783b-a1e6-4cae-97d8-e3deafeeb82c",
    "title": "Mirko Bortolotti Wins 2024 DTM Championship as Schubert Motorsport Takes Team Title",
    "link": "https://www.bmwblog.com/2024/10/20/2024-dtm-champion-schubert-motorsport-team-title/",
    "description": "The 2024 DTM season ended with Lamborghini driver Mirko Bortolotti winning the championship after finishing second in the final race at Hockenheim. Bortolotti’s closest rival, Kelvin van der Linde, struggled to finish in 12th place,... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Sun, 20 Oct 2024 18:31:30 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/10/2024-Schubert-Motorsport-dtm-01-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Racing",
      "DTM",
      "Schubert Motorsport"
    ]
  },
  {
    "id": "676e8797-cde1-4975-a7bf-7de5858a2882",
    "title": "2025 BMW M5: Five Things We Learned From The Designer",
    "link": "https://www.bmwblog.com/2024/10/20/2025-bmw-m5-five-things-learned-from-designer/",
    "description": "Keyboard warriors often say that “if a design has to be explained, then it’s not a good design.” However, the thought process behind drawing a car is hugely complex. It has a level of depth... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Sun, 20 Oct 2024 15:12:06 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/10/bmw-m5-touring-frozen-black-56-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M5",
      "Videos",
      "Jose Casas",
      "M5 G90",
      "M5 G99"
    ]
  },
  {
    "id": "69e02d59-4fff-49d6-823a-c49821b22c30",
    "title": "Speed Read: Kott’s Born Free Triumph Daytona bobber and more",
    "link": "https://www.bikeexif.com/custom-motorcycle-news-october-20-2024",
    "description": "Known for his classy café racers, Dustin Kott threw the rule book away to build a Triumph Daytona bobber for Born Free. Other highlights this week include a razor-sharp BMW K1100, a retro-fabulous Suzuki GSX-R1100, and the 2025 Triumph Speed Twin 900. Triumph Daytona 500 by Kott Motorcycles Dustin Kott is no stranger to these pages, with a long list of satisfied clients aboard his custom café racers. But when he received an invite to exhibit a bike at the 15th running of the Born Free show, he decided to build something a little different from his usual fare. After building a Triumph 500 café racer a while back, Dustin had some ideas churning around in his head. Using another air-cooled Triumph Daytona twin from 1969, Dustin settled on a hard-tailed, board-track-inspired bobber to showcase his long list of skills.…",
    "author": "Ben Pilatti",
    "published": "Sun, 20 Oct 2024 17:39:42 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/10/2025-triumph-speed-twin-900-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Latest Motorcycle News",
      "BMW K1100",
      "Bobber motorcycles",
      "Cafe racers",
      "Kott Motorcycles",
      "Triumph motorcycles"
    ]
  },
  {
    "id": "d87cc7c6-e8ba-423f-a327-63e9b3660dd5",
    "title": "Bench Racing: The Six Most Thrilling 2024 Motorcycles By Genre",
    "link": "https://www.bikeexif.com/most-thrilling-2024-motorcycles",
    "description": "Motorcycles have to be just about the most relative machines on wheels, as everything we enjoy about the way they accelerate, corner and handle terrain is relative to what else you’ve ridden and how you ride. We buy based on carefully selected factors, and while Honda might fit best for you, your buddy may insist on Husqvarna. When it comes down to it, though, I’m sure we can all identify bikes that have a certain panache—a little extra spice that makes them the one you’d pick in a crowd—even if it’s just once to see what it’s all about. We distill that whole concept into a segment we call Most Thrilling by Genre, and the following six bikes are our (somewhat) intentionally controversial picks from their respective stables of new machines.…",
    "author": "Dean Larson",
    "published": "Sat, 19 Oct 2024 17:00:06 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/10/ktm-1290-super-adventure-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Bikes",
      "Buell",
      "Ducati",
      "KTM",
      "Triumph Scrambler"
    ]
  },
  {
    "id": "0019d39f-8e22-4b3a-8930-fc1455f847e5",
    "title": "Mercedes-AMG CLE 53 Coupé",
    "link": "https://www.autocar.co.uk/car-review/mercedes-amg/cle-53",
    "description": "Lower-rung AMG gains butch looks and big power. Can it stick it to the BMW M4? It’s been a while since Mercedes-AMG model designations had any bearing on engine capacities, but we thought we’d figured this out, right? 63 is the full-house one, 53 is basically an AMG Line pack on the biggest engine.In comes the Mercedes-AMG CLE 53, looking all butch with its wider wheel arches. The spec sheet mentions a rear-wheel-drive-only drift mode (it’s four-wheel drive as standard). A combined 443bhp and 4.2sec to 62mph sound pretty full-house as well. Sure, it’s slower than a BMW M4, but super-coupé performance has well and truly jumped the shark anyway, so that’s just a question of how unusable you want your performance to be. At £73,075, it’s cheaper too.There is going to be a 63 version, which will reportedly have a V8 but it remains to be seen whether it will be a heavy, complicated plug-in hybrid. At that point, this mild-hybrid, inline-six Mercedes-AMG CLE 53 might seem like the purer, simpler driver’s car, in as much as you can even apply those words to a two-tonne, mild-hybrid car with variable four-wheel drive and four-wheel steering.",
    "author": "",
    "published": "Sun, 20 Oct 2024 23:01:00 +0100",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/01-mercedes-amg-cle-53-cabriolet-2024-review-front-driving-lead.jpg?itok=uE9RX8bd",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "40588d35-17dc-4a1f-9a3d-0b6d751dc06b",
    "title": "Answered: the electric car questions you've been afraid to ask",
    "link": "https://www.autocar.co.uk/car-news/features/answered-electric-car-questions-youve-been-afraid-ask",
    "description": "Tesla has its own 'Supercharger' network – it's a big plus for owning one What's in an EV motor? How does regen work? Who is Chad Emo? We've got the answers you seek Electric cars have been around since the 1830s. Sure, they might have disappeared for a bit, but they came back with avengence in the 2010s. A decade ago they were pretty much the reserve of the well-heeled environmentalist, but the electric car’s viability has skyrocketed because of huge gains in electric range, and serious cuts to pricing. However, car makers’ ability to actually explain how electric cars work has not grown with the increased enthusiasm for them. Think it’s too late to learn? Think again and learn the new lingo, here. Electric motors Literally the driving force of all EVs, electric motors are like jet engines in that they have few moving parts and are incredibly powerful for their size. Mechanically simple, with just a rotor and stator, they generate power and torque using magnetic fields.  The most popular type of motor is the brushless permanently excited synchronous motor (PSM), which has powerful rare-earth magnets embedded in its rotor. Surrounding stator coils (the static part) use an alternating current (AC) to generate a rotating magnetic field, which attracts the rotor’s magnets, making it turn in perfect synchronisation with the frequency of the AC. The rotor and magnetic field are perfectly in sync, hence the motor is synchronous.  Some manufacturers prefer to avoid the use of the rare-earth permanent magnets and opt for either asynchronous induction machines or externally excited synchronous machines (EESM). Both the stator and rotor of an induction motor have windings and an electric current is induced in the rotor by the stator’s magnetic field rotating around it. That in turn generates a magnetic field in the rotor windings. But for it to work, the rotor must lag behind the rotating magnet field slightly, hence the motor is asynchronous.  Externally excited synchronous motors instead use brushes to carry current to the rotor coils, which introduces an element of wear that brushless motors don’t suffer. Regenerative braking One of the great benefits of EVs is that they can recover some of the energy they use to accelerate when they’re slowing down again, because motors can also work as generators. The motor switches to generator mode as the car slows down, topping up the battery, and the effort that takes creates a braking force. Electronics blend the effect with the car’s hydraulic braking system if the driver brakes in the normal way. Strong regen allows one-pedal driving, where the driver can do most urban driving using only the accelerator pedal. Nissan was the first to make this a feature, on the Mk2 Leaf.  Other manufacturers, most notably Kia, have also added paddles to the steering column that allow the driver to increase and reduce the strength of the regen on the fly.  Battery packs Electric cars have two electrical systems: a high-voltage one to power the motor and a conventional 12V one to work ancillaries such as the lights and infotainment system.  The high-voltage system traditionally works at 400V, but in some of the latest EVs it works at 800V. This higher voltage allows a lower amperage and so smaller, lighter electrical cabling, as well as enabling ultra-rapid charging. All production EVs on the UK market use lithium ion battery chemistry, but this in itself varies, with different ingredients used in the battery cells, depending on what the manufacturer chooses.  One of the most popular formulations has been lithium nickel manganese cobalt oxide (NMC), but many manufacturers are trying to lessen their use of nickel and cobalt by reducing the content of the metals or switching to alternatives such as lithium iron phosphate (LFP).  Battery packs are made up of modules, each one of which comprises a number of individual cells. These come in various shapes, such as cylinder, pouch and prism. The first wave of EVs had air-cooled batteries, but the latest models have liquid cooling. Electric car range is affected by ambient temperature, driving style, air- con usage and more, and some EVs estimate their remaining range better than others. Home charging An EV works best in terms of running cost and convenience if you can charge your car at home. Drivers who don’t do many miles can get away with the trickle-charge lead that’s usually supplied with the car and plugs into a domestic three-pin socket. It draws around 3kW (about the same as a kettle or household electric heater) so will top the EV’s battery up with around 3kWh of energy every hour, giving around 10 miles of range, depending on the car. The alternative is a wallbox charger. These are available from a number of manufacturers and must be professionally installed on a dedicated electrical circuit.  They provide charge at around 7kW so boost range by around 23 miles each hour, depending on the EV. Buyers can choose between an untethered cable, which must be plugged into both the car and the charger, and a tethered cable, which is stowed on the wallbox when not in use.  For those who have a solar system at home, there are smart chargers that offer a number of different modes, including the ability to charge only when surplus solar energy is available, which would otherwise be directed to the grid.   Scheduling and phone connectivity You can configure an EV’s climate system and charging start and finish times by creating a schedule via the infotainment system and in most cases via a dedicated smartphone app created by the manufacturer. Climate scheduling is especially useful if, say, you leave for work at regular times and would like the cabin preconditioned to a comfortable temperature.  Smartphone apps allow you to do the same thing on the fly, plus they usually have a number of other functions, like remote locking and unlocking, warnings if the car is left unlocked and status information such as available range.  Charge scheduling is also useful if you have a solar system at home and want your EV to start charging when excess power is available that might otherwise be sent to the grid.  Cheaper home energy tariffs The ability to set schedules for when an EV plugged into a wallbox or trickle charger starts and finishes charging comes into its own when you subscribe to off-peak energy tariffs. Several energy providers offer EV-focused tariffs of as low as 7p per kWh in the early hours, so you can plug your EV in but set the schedule to charge only during the off-peak time, which might be between 12am and 7am, depending on the supplier.  Using a 7kW home charger, that could give close to 195 miles of range at a cost of less than 2p per mile.  Plug types Fifty years ago, an epic struggle broke out between JVC and Sony to dominate the home video tape market with their respective VHS and Betamax formats. VHS eventually won, making Betamax obsolete, and the two names came to symbolise competing standards. EV charging plugs went the same way a few decades later, which is why there are different plug formats out there, causing some confusion.  The first Nissan Leafs came with a Type 1 ‘J-Plug’ for AC charging and a Chademo plug for direct current (DC) rapid charging, which was the standard in Japan. Meanwhile in the EU, the Type 2 Mennekes plug became the standard for AC charging and the Combined Charging System (CCS) plug for DC rapid charging – so called because it combines the Type 2 plug with an additional two pins for carrying DC straight into the EV’s battery. When you arrive at a public charger, Chademo plugs (if present) are easily identifiable as bright blue and CCS plugs as plain white.  CCS has become the VHS of the EV charging story, having become the dominant standard for rapid charging. Even Tesla is moving away from its North American Charging Standard (NACS) connector: the Tesla Model 3 is now equipped with a CCS socket and its public Supercharger network now also supports CCS.  The plugs have so many pins because some are for communication between the car and the charger and others to actually transmit current. When an EV is plugged in, the car and charger talk to one another and only when both ends are happy does the power transmission begin. The connectors aren’t ‘live’ until that point, which is why they’re safe to use in wet weather. Type of charging The thorny question of how fast an EV’s battery can be charged depends to some extent on how much power is available to charge it. There are four main generic categories of charger available: slow, fast, rapid and ultra-rapid.  Slow charging is the type used for home charging, with AC current coming from a trickle charger connected to a normal domestic supply or a 7.4kW wallbox.  Fast charging at 22kW with AC current is the least common and requires an industrial three-phase electrical supply. Ironically, it’s also not that fast, so it isn’t that useful when you’re on the move and need a ‘splash and dash’.  The first public DC chargers were 50kW rapid chargers. The latest is the ultra-rapid DC charger, which works at between 100kW and 350kW, depending on the charger and the EV.  Only EVs with 800V charging systems can take advantage of the highest charging rates. For example, the Hyundai Ioniq 5 N’s battery can be topped up from 10-80% in just 18 minutes. Tesla has its own network of Supercharger sites, some of which have now been opened up to other EV drivers; you can find them via a smartphone app and pay to use them by credit card.  Paying for charging for an electric car on major rapid-charging networks is mostly contactless, but there are still exceptions. However, the Public Charge Point Regulations legislation that came into effect in late 2023 requires that “all new public charge points 8kW and above deployed after 24 November 2024 and all public charge points of 50kW and above must offer contactless payment either per public charge point or per charging site, if more than one public charge point”.",
    "author": "",
    "published": "Sun, 20 Oct 2024 07:01:19 +0100",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/tesla-model-3-front-quarter-tracking_0.jpg?itok=kaxiXKtb",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "03f6af29-6d63-4a0a-89ed-3dfac73c5df4",
    "title": "15-Year-Old In Stolen Corvette Leads Police On 100 MPH Chase, Crashes Hard",
    "link": "https://www.carscoops.com/2024/10/police-chase-stolen-corvette-find-15-year-old-teen-at-the-wheel/",
    "description": "Authorities report that the chase included speeds above 100 mph and that the driver had a 19-year-old passenger",
    "author": "Stephen Rivers",
    "published": "Mon, 21 Oct 2024 01:01:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/10/FOX-11-1024x575.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Chevrolet",
      "Corvette",
      "Offbeat News",
      "Police",
      "Video"
    ]
  },
  {
    "id": "e3e086c0-5f38-47eb-b306-4e2a69a2ff4f",
    "title": "New Honda Prelude Won’t Get A Manual But It Might Fake One",
    "link": "https://www.carscoops.com/2024/10/honda-prelude-could-be-made-more-engaging-with-a-simulated-manual/",
    "description": "Honda engineers are looking for ways to make the two-door coupe more fun to drive than the mechanically-related Civic e:HEV",
    "author": "Thanos Pappas",
    "published": "Sun, 20 Oct 2024 23:10:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/10/SB22326-copyfffff-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Honda",
      "Honda Prelude",
      "Honda Scoops",
      "Hybrids",
      "Reports",
      "Scoops"
    ]
  },
  {
    "id": "c633a974-625d-46ac-9f18-69b8e62d42c1",
    "title": "Australian GP: Marquez wins, Martin extends MotoGP title lead",
    "link": "https://www.autocarindia.com/motor-sports-news/australian-gp-marquez-wins-martin-extends-motogp-title-lead-433269#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Just like he has done at the San Marino and Aragon GPs this year, Marc Marquez dominated the Australian MotoGP race. Sprint winner Jorge Martin finished second after a long drawn-out battle with the Gresini rider in the main race. Francesco Bagnaia wasn’t able to match the pace of Marquez and Martin ahead of him, and had to settle for third place. Gap between Bagnaia and Martin is now 20 points Marquez’s third win this season, is the only GP23 race winner Marquez vs Martin Polesitter Martin was able to get the perfect launch. But Marquez, who began in second place, wasn’t able to do the same. Lining up at the starting grid, Marquez’s visor tear-off got lodged between his rear tyre and the tarmac, leading to a lot of wheelspin at the start. This plummeted the eight-time world champion down 13th place at just the first corner.   However, Marquez quickly regrouped and within a few laps he was back within striking distance of the podium. Martin had established an early advantage with his fortuitous start, having a lead of almost one second over Bagnaia, who was then running second.  Bagnaia kept that gap till Martin went wide at turn 1 on lap 12, which is when he saw the opportunity to overtake. But he couldn’t make that manoeuvre stick and Martin quickly snatched the lead back, while Marquez took second place from the reigning World Champion.  Then the two Spaniards eked out a considerable 4-second advantage over Bagnaia who simply couldn’t match the near lap-record pace of the two Ducatis ahead of him. Martin and Marquez lunged at each other for much of the later stages of the race but ultimately, the GP23 of Marquez took the chequered flag first.   2024 MotoGP championship standings   With just three rounds to go, the gap between the two top racers has now grown to 20 points, with Martin on the top spot. With his stellar performance in both the Sprint and the main race, Marc Marqeuz is now third in the standings, taking that spot from Enea Bastianini. Next up, is the Thailand GP, set to be held at the Chang international circuit, from October 25-27.    2024 Australian GP results Australian MotoGP resultsPositionRiderTeam1Marc MarquezGresini Ducati2Jorge Martin Pramac Ducati3Francesco BagnaiaDucati4Fabio Di GiannantonioVR46 Ducati5Enea BastianiniDucati6Franco MorbidelliPramac Ducati7Brad BinderRedBull KTM8Maverick VinalesAprilia9Fabio QuartararoYamaha10Raul FernandezTrackhouse Aprilia11Jack Miller RedBull KTM12Johann ZarcoLCR Honda13Alex RinsYamaha14Luca MariniRepsol Honda15Alex MarquezGresini Ducati16Aleix EspargaroAprilia17Augusto FernandezGASGAS Tech318Takaaki NakagamiLCR Honda19Marco BezzecchiVR46 DucatiNCJoan MirRepsol HondaNCLorenzo SavadoriTrackhouse Aprilia",
    "author": "Dinshaw Magol",
    "published": "Sun, 20 Oct 2024 11:32:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241020113141_Marquez_Australian_GP.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "f0c0d15f-af18-4fa1-8b75-90ee499cab51",
    "title": "Honda CB300F flex fuel launched at Rs 1.70 lakh",
    "link": "https://www.autocarindia.com/bike-news/honda-cb300f-flex-fuel-launched-at-rs-170-lakh-433268#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "After showcasing it at the Bharat Mobility Expo earlier in the year, Honda has launched the CB300F flex fuel model at Rs 1.70 lakh (ex-showroom, Delhi). This bike is mechanically identical to and costs the same amount of money as the regular CB300F.  Bookings open now, will be available at BigWing showrooms Gets an ethanol indicator on the display Available in two colours - red and grey There’s not much to differentiate the CB300F flex fuel and standard models. Both bikes have the same design, features, mechanicals and even cost the exact same amount. The differences boil down to the colours and a small change on the flex fuel bike’s display. The flex fuel CB300F can run on E85 fuel, which is a petrol-ethanol blend, containing up to 85 percent of the latter.  The standard CB300F can be had in red, grey and blue, whereas the flex fuel CB300F can only be had in red or grey. The flex fuel CB300F also gets an extra indicator on the dash to warn the rider in case the ethanol content in the fuel exceeds 85 percent.  Bookings for the flex fuel CB300F are open today, with the bike being available at BigWing dealers from the last week of this month. To give you a bit of backstory, the CB300F was first launched at a rather steep Rs 2.29 lakh after which poor sales forced Big Red to offer a Rs 50,000 discount, first temporarily and then revising the price of the bike altogether to Rs 1.70 lakh. We have tested the Honda CB300F and to read more about that tap HERE.",
    "author": "Dinshaw Magol",
    "published": "Sun, 20 Oct 2024 10:58:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241020105803_H1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "ee721297-88ea-4bdf-892e-ef8860f3eee4",
    "title": "2025 Mercedes-AMG CLE53 Cabriolet Can Dance With The Pros",
    "link": "https://jalopnik.com/2025-mercedes-amg-cle53-cabriolet-can-dance-with-the-pr-1851677053",
    "description": "There are few things in this world that bring goosebumps to my skin faster than the stirring sound of six inline cylinders screaming as they hit the redline like waves in the Mediterranean Sea splashing against sandy beaches. When said sound of those six cylinders is resonating off of the astounding beauty of the arid…Read more...",
    "author": "Logan Carter",
    "published": "Sun, 20 Oct 2024 22:01:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/8d5ac0e8770aaf5b1f157d79a7e6496e.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "cabriolet",
      "mercedes amg",
      "mercedes amg cle53",
      "mercedes amg cle53 cabriolet",
      "bmw m440i",
      "roadsters",
      "station wagons",
      "costa del sol",
      "c class",
      "sedans",
      "maserati",
      "audi",
      "mercedes benz cle",
      "mercedes benz s class",
      "bmw m4",
      "mercedes benz e class",
      "grand tourers",
      "mercedes benz",
      "coupes",
      "m 16",
      "e class",
      "audi s5",
      "mercedes benz cle450"
    ]
  },
  {
    "id": "d583374e-d7ad-46e9-91e4-b06f1f767250",
    "title": "Terrible And Boring Cars We Would Not Recommend Plus Bad Cars We Loved As Kids In This Week's QOTD Roundup",
    "link": "https://jalopnik.com/terrible-and-boring-cars-we-would-not-recommend-plus-ba-1851676314",
    "description": "Here at Jalopnik, we’re always getting asked for car recommendations, heck we’ve even made a weekly recurring feature about that very thing. Some cars are easy to recommend thanks to their neat styling or great futures, but there are some that we can never suggest when someone asks for advice. - Owen Bellwood Read MoreRead more...",
    "author": "Jalopnik Staff",
    "published": "Sat, 19 Oct 2024 13:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/3b598476f51c725f4c9f09a441cf7314.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "citroen sm",
      "acura integra",
      "coupes",
      "collin woodard",
      "logan carter",
      "lawrence hodge",
      "grand tourers",
      "car",
      "business finance",
      "owen bellwood",
      "andy",
      "kia spectra"
    ]
  },
  {
    "id": "e8dc034d-83d1-4180-9d85-42bace4d1634",
    "title": "Column: A deep dive into how AI is changing the auto industry",
    "link": "https://www.autonews.com/commentary/how-ai-impacting-auto-industry",
    "description": "We've all learned a lot about generative artificial intelligence, its predecessors and machine learning in the last year and a half. It continues to pervade the automotive industry.",
    "author": "Jamie Butters",
    "published": "Sun, 20 Oct 2024 13:00:01 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/AutomakerNews",
    "categories": null
  },
  {
    "id": "8a120088-3491-490c-9213-3b1bb4950d4d",
    "title": "BMW recalls almost 700,000 cars in china on fire safety risk",
    "link": "https://www.autonews.com/china/bmw-recalls-almost-700000-cars-china-fire-risk",
    "description": "BMW AG is recalling nearly 700,000 vehicles in China due to coolant pump defects.",
    "author": "",
    "published": "Fri, 18 Oct 2024 13:04:28 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/AutomakerNews",
    "categories": null
  },
  {
    "id": "e3aecece-4204-42bb-b034-d95a5dc15ee0",
    "title": "2025 Mercedes-AMG CLE53 Cabriolet: Quicker Sunseeker",
    "link": "https://www.caranddriver.com/reviews/a62650740/2025-mercedes-amg-cle53-cabriolet-drive/",
    "description": "The CLE four-seat convertible gets the AMG treatment.",
    "author": "",
    "published": "Sun, 20 Oct 2024 22:01:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "37adff98-cf5a-4af4-b015-0c51b3882cc8",
    "title": "View Exterior Photos of the 2025 Mercedes-AMG CLE53 Cabriolet",
    "link": "https://www.caranddriver.com/photos/g62638189/2025-mercedes-amg-cle53-cabriolet-drive-exterior-gallery/",
    "description": "2025 Mercedes-AMG CLE53 Cabriolet exterior photos.",
    "author": "",
    "published": "Sun, 20 Oct 2024 22:01:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "91dbcc7d-071d-4ca9-beda-cf6bc79e88bf",
    "title": "Used EVs could be answer for consumers seeking affordability",
    "link": "https://www.autonews.com/used-cars/why-used-evs-might-be-car-affordability-solution",
    "description": "The depressed values of used electric vehicles present an attractive solution to cost-conscious consumers seeking transportation, business leaders said at the 2024 Auto Finance Summit.",
    "author": "John Huetter",
    "published": "Sat, 19 Oct 2024 00:00:01 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/EditorsPicks",
    "categories": null
  },
  {
    "id": "579df0fc-21f8-4fc6-986b-90d2fc32b6d0",
    "title": "Stellantis dealers regain optimism after executive shake-up",
    "link": "https://www.autonews.com/dealers/stellantis-dealers-see-hope-amid-management-turmoil",
    "description": "Stellantis' dealer council met with new North America COO Antonio Filosa this week after criticizing the company's leadership over stagnant sales and bloated inventory.",
    "author": "Vince Bond Jr.",
    "published": "Fri, 18 Oct 2024 06:45:22 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/EditorsPicks",
    "categories": null
  },
  {
    "id": "8f19059b-b29d-48b9-bec5-204b717cf9f4",
    "title": "Diversity Drives Enthusiasm: Perth’s 2024 International Festival Of Speed",
    "link": "https://www.speedhunters.com/2024/10/2024-international-festival-of-speed-perth/",
    "description": "In the lead-up to the event, my Facebook buzzed with notifications. Local automotive group chats lit up with messages: “Anyone got this part I can borrow?” “What’s causing this issue?” The Perth car community really came together for the two-day festival earlier this month. Heading to the event on the first day, the hum of […] The post Diversity Drives Enthusiasm: Perth’s 2024 International Festival Of Speed appeared first on Speedhunters.",
    "author": "Jack Major",
    "published": "Sat, 19 Oct 2024 16:00:16 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Event Coverage",
      "Special Feature",
      "Speedhunters Crew",
      "Australia",
      "i am the speedhunter",
      "iamthespeedhunter",
      "iats",
      "iatsh",
      "perth",
      "Perth Festival Of Speed",
      "Perth Festival Of Speed 2024",
      "western australia"
    ]
  },
  {
    "id": "5c17d585-b926-4389-ad00-303d8a410225",
    "title": "Throwback: Vaughn Gittin Jr.’s 2015 Spec 5 Mustang RTR",
    "link": "https://www.speedhunters.com/2024/10/throwback-2015-spec-5-mustang-rtr/",
    "description": "In less than three weeks, we’ll be back in Las Vegas for the 2024 edition of the annual SEMA Show. While SEMA is an automotive aftermarket trade show at its heart, it’s also one of the world’s biggest stages for custom and modified car debuts. From the bizarre to the truly stunning, we’re guaranteed to see it all. Ten years ago in […] The post Throwback: Vaughn Gittin Jr.’s 2015 Spec 5 Mustang RTR appeared first on Speedhunters.",
    "author": "TheSpeedhunters",
    "published": "Fri, 18 Oct 2024 16:00:43 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "Ford",
      "Mustang",
      "Ready To Rock",
      "rtr",
      "RTR Spec 5",
      "Spec 5 Mustang RTR",
      "Throwback",
      "Vaughn Gittin Jr"
    ]
  },
  {
    "id": "eb4dbef9-efea-4340-b687-5d149150e541",
    "title": "Velocity Invitational Showcases Legendary Motorsports Stars And Cars In California",
    "link": "",
    "description": "Velocity Invitational, the three-day motorsports and lifestyle event at Sonoma Raceway, produced a magical weekend for its fifth edition across last weekend. Situated at the famed Californian racetrack in the heart of wine country, this growing gathering is becoming North America’s equivalent to the United Kingdom’s fabled and long-established Goodwood events, which bring some of the most amazing historic and vintage racing cars together for an amazing race meeting that carries fierce action on the circuit but a uniquely laid-back and enjoyable festival-like vibe off the track. Continue...",
    "author": "",
    "published": "Fri, 18 Oct 2024 16:21:53 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/10/18070908/0W0A6915-scaled-e1729261685690.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "102876c5-77af-4b9e-a297-914340b1a738",
    "title": "Prodrive HERO-ERA 1: The Incredible Story Of Rallying A Restmod Mustang From Peking To Paris",
    "link": "",
    "description": "When choosing a car for one of the world’s most arduous automobile events, the Prodrive Peking to Paris Motor Challenge, what would you pick? Especially if you’ve never driven, or navigated, on its epic route that spans over 8,500 miles – which crosses some of the world’s toughest terrain... Katarina Kyvalova is no ordinary racing driver.  It was fitting that someone who made their racing debut in a 24-hour event in a pre-war Bentley should get her first taste of the Prodrive Peking to Paris in a wild, first-of-its-kind restomod from British racing and rallying legends Prodrive, based – of all things – on a 1967 Ford Mustang Fastback donor car. A regular in historic motorsports, usually seen racing a 4.5-liter Bentley, a Cooper Jaguar or a Jaguar E-Type, Katarina took a huge leap out of her comfort zone by signing up for one of the most gruelling and prestigious endurance rallies in the world before the global health pandemic of 2020. She finally got to compete in the 2024 edition of this quite unique event, that was first held way back in 1907. Continue...",
    "author": "",
    "published": "Thu, 17 Oct 2024 14:26:49 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/10/08075359/004034-P2P-2024-cBlue-Passion-Photo-e1728399286467.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "afe4d601-525e-42df-9ca3-7440326a5852",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "c042d7ca-b8fb-421f-952d-81358a3420c1",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "13710ae2-f94a-4505-827b-44ef44a1f9eb",
    "title": "Rare Rides Icons: The Cadillac Eldorado, Distinctly Luxurious (Part XXXVII)",
    "link": "https://www.thetruthaboutcars.com/cars/features/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-xxxvii-44509843?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "In our last Eldorado episode, we reviewed the interior changes made to Cadillac’s flagship convertible as it was refreshed for 1963. In its move upmarket, the Eldorado joined the Fleetwood assembly line with the Sixty Special and Seventy-Five. It received wood trim for the first time in 1963, alongside a modernized and more cockpit-style dashboard. Outside, it adopted the subtle de-chromed look present on other contemporary Fleetwood models. In 1964 for the sixth generation’s second and final year, Eldorado was refreshed yet again.",
    "author": "Corey Lewis",
    "published": "Fri, 18 Oct 2024 21:56:23 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/10/18/15462/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-xxxvii.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Features"
    ]
  },
  {
    "id": "47e4ca15-7beb-4378-a8f6-2544f4ba2a0a",
    "title": "Yay or Nay? Rivian's Car Costume Software Update",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/yay-or-nay-rivian-s-car-costume-software-update-44509840?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Rivian is launching a Halloween-themed update that will help convert its all-electric vehicles into K.I.T.T. from Knight Rider or the DMC DeLorean from Back to the Future. However, for those not interested in media references hand picked to appeal to the brand’s key demographic, there is likewise a generic theme that you can pair with whatever Halloween decorations you happen to have on hand. Starting October 18th, Rivian is introducing “Car Costumes” as part of its annual spooky seasonal update. Owners will be able to customize both the interior and exterior of their vehicles. However, the brunt of these features are for display purposes only — as the vehicles must remain in park if they are to function properly.",
    "author": "Matt Posky",
    "published": "Fri, 18 Oct 2024 21:44:19 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/10/18/14541/yay-or-nay-rivian-s-car-costume-software-update.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  }
]
