[
  {
    "id": "311124ad-9e4b-4acb-92aa-0659bfed734b",
    "title": "LS3-Powered 1965 Chevrolet Corvette Convertible",
    "link": "https://bringatrailer.com/listing/1965-chevrolet-corvette-convertible-193/",
    "description": "This 1965 Chevrolet Corvette convertible was acquired by the seller in 2023 and subsequently modified by Tim Cossette of Plymouth, Minnesota. Work was completed in January 2024 and involved refinishing the body in metallic gray and mounting it to a Coffman chassis with a C7 four-link suspension, adjustable coilovers, and Wilwood disc brakes as well as installing a custom red leather interior, a 6.2-liter LS3 V8 crate engine, and a four-speed 4L60E automatic transmission. The car won first in class at the 2024 Grand National Roadster Show in Pomona, California, and was voted the 2024 Restomod of the Year at Corvette Forum. Additional equipment includes Raceline 19 and 20\" billet aluminum wheels, a dark red Stayfast convertible soft top, a stinger-style hood, a side-exit exhaust system, Classic Instruments gauges, Vintage Air heating and air conditioning, and a period-look AM/FM/Bluetooth stereo. This modified C2 is now offered with service records, build photos, and a clean California title in the seller's name.",
    "author": "bringatrailer",
    "published": "Sat, 12 Oct 2024 20:30:13 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/09/1965_chevrolet_corvette-convertible_k2-80167.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "6138b130-2dfb-44c6-bb32-ffca0d2aafc2",
    "title": "25-Years-Owned 1991 Alfa Romeo Spider Veloce 5-Speed at No Reserve",
    "link": "https://bringatrailer.com/listing/1991-alfa-romeo-spider-veloce-43/",
    "description": "This 1991 Alfa Romeo Spider Veloce was initially delivered to Lochmoor Alfa Romeo in Detroit, Michigan, and it was purchased by the current owner in 1999 and now shows 42k miles. Finished in Onyx Black over beige leather and suede upholstery, the car is powered by a 2.0-liter inline-four paired with a five-speed manual transmission. Equipment includes a limited-slip differential, a black soft top, Koni dampers, 15\" 12-hole alloy wheels, an Alpine head unit, air conditioning, and power windows. Work performed in 2024 has included replacing the water pump, lower radiator hose, and drive belt. This Series 4 Spider is offered by the seller on behalf of the current owner at no reserve with a window sticker, manufacturer's literature, service records, spare parts, and a clean Illinois title in the owner's name.",
    "author": "bringatrailer",
    "published": "Sat, 12 Oct 2024 20:25:06 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/10/1991_alfa-romeo_spider-veloce_img_8503-02235.jpeg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "1600e03a-3828-4e94-b159-e81d1ab97e24",
    "title": "Tesla’s $30K Cybercab: Autonomous Future or Far-Fetched Dream?",
    "link": "https://www.bmwblog.com/2024/10/12/tesla-cybercab-30k-autonomous-taxi-2026/",
    "description": "Another day, another Tesla moonshot. Elon Musk debuted the Tesla Cybercab robotaxi on Thursday night in a perfectly Musk-ian way, complete with robot bartenders and an overambitious price ($30,000) with the promise to have the... First published by https://www.bmwblog.com",
    "author": "Steven Paul",
    "published": "Sat, 12 Oct 2024 13:00:18 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/10/tesla-robotaxi-11-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "News",
      "Autonomous Driving",
      "Level 4",
      "Level 5",
      "Tesla",
      "Tesla Robotaxi"
    ]
  },
  {
    "id": "80304526-8ad4-41ef-afdd-1573104fd733",
    "title": "BMW M5 Touring Gets A Helicopter Ride In Dubai",
    "link": "https://www.bmwblog.com/2024/10/12/bmw-m5-touring-helicopter-ride-dubai/",
    "description": "Cue the jokes about the helicopter struggling to carry the new M5’s weight. With that out of the way, the G99 Touring made a splash at its premiere in Dubai. The local BMW dealer put... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Sat, 12 Oct 2024 08:27:38 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/10/bmw-m5-helicopter-drop-dubai-07-512x830.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M5",
      "2025 BMW M5",
      "G90 M5",
      "G99 M5",
      "M5 Touring"
    ]
  },
  {
    "id": "3942e863-6c28-46b6-908c-e26049e184eb",
    "title": "Are there any '1' names left after the McLaren W1?",
    "link": "https://www.autocar.co.uk/opinion/new-cars/are-there-any-1-names-left-after-mclaren-w1",
    "description": "What's in a name? We reflect on why McLaren dubbed its new car the W1 If you’re sold on using the numeral 1, as McLaren seemingly is for its fastest car series (F1, P1 and now W1), I wonder what your remaining naming options are. Most of the 1 names are already ‘taken’ one way or another: some by trademark, others just by association (so available but better avoided). There are obvious ones, like A1 and S1 from Audi, C1 from Citroën, H1 from Hummer, and M1, X1 and Z1 from BMW. And there are lesser-known ones: the Caparo T1, if you recall, and the BYD D1, the 1920s Alfa Romeo G1 (also a Toyota and a Genesis concept), the Honda N-One, the K-1 Attack kit car and more. R1 is a Yamaha motorcycle but presumably also better avoided. And then you get into the 1s that just sound slow, even if they aren’t taken. E1 sounds electric (and was, as yet another BMW); Y1 is a question, not an answer; J1 sounds like a form you collect at a post office; V1 will be superseded by V1.1 at the next software update; and L1 evokes the ‘losses’ column on a league table. I’d like a car to be called the B1 because we could call it the ‘Bone’ and I like cars with nicknames, such as the Alfa Romeo Toenail, but I can see why a car maker wouldn’t want the association with a bomber aircraft, even if the name can be had. By a process of elimination, I reckon it didn’t take McLaren long to alight on W1. W represents a win as L does a loss, after all, and this is on message with the company’s sports division. Maybe being a letter synonymous with wins is why Mercedes-Benz called its 2010 Formula 1 racer the W01, although it’s a wonder that nobody besides Holden Special Vehicles, which had a run-out 636bhp GTSR W1 (W for Walkinshaw) model in 2016, has called a road car the W1 before. But this might be the 1’s last fast outing. Still the one to beat From one 1 to another One, as one wonders if there was anything non-coincidental about the timing of Mercedes-AMG’s announcement that its One had broken the production car lap record at the Nürburgring. The Formula 1-powered hypercar recorded a new benchmark time at the end of last month of 6min 29.09sec in the hands of Maro Engel, beating the previous production car record by a full five seconds. That was set back in 2022, also by Maro Engel and also in a Mercedes-AMG One. “Two years ago, conditions were not ideal and some sections of the track were still a little damp,” the GT racer said last week, hence they returned this year to get the best out of it. Maybe the timing was entirely coincidental – or maybe, given that the news came three days before McLaren announced the W1 and with a new Ferrari hypercar also apparently imminent, it wasn’t coincidental at all. The top influencer A reader writes after I mentioned the Austin 7 (in my 25 September column), a car you will be able to read about briefly again next week, to suggest that it “may be the most important car in the history of motorsport, or even motoring”. On the motorsport front, I think I agree that no other car has more influenced competition, drivers and engineers. But I do wonder what is the most important car in the world. Ultimately, like that of the best-looking car in the world, it’s a question that can’t be answered without a huge dose of subjectivity, even if you opt for the eminently sensible thing of picking the very first one, the Benz Patent-Motorwagen of 1885. I’d add the Ford Model T, Volkswagen Beetle, Jeep, Mini and Toyota Corolla to my shortlist too. And the Austin 7 would also be on it.",
    "author": "",
    "published": "Sat, 12 Oct 2024 06:01:07 +0100",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/prior-column-0910.jpg?itok=ex8Xm-wi",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Opinion"
    ]
  },
  {
    "id": "441d24c2-2488-45fe-9947-772ac740cb24",
    "title": "Revisiting Britain's best car museums - and the Vauxhall Corsa",
    "link": "https://www.autocar.co.uk/car-news/features/revisiting-britains-best-car-museums-and-vauxhall-corsa",
    "description": "Corsa is a surprisingly capable cruiser – perfect for running to a museum such as the Great British Car Journey... We take the oft-forgotten supermini on a road trip to some overlooked attractions This might seem an odd thing to say about what is year upon year one of Britain’s best-selling cars, but is the Vauxhall Corsa underrated?  I must see Corsas all the time. Several times a day. But honestly, when did I really last think about a Corsa? I couldn’t tell you. When did one occupy my mind in the way I think about, I don’t know, a Tesla, or a BMW 3 Series, or even a Mini? No idea. It’s just there, the Corsa, always ticking along, clearly bought and used by loads of people, but it also feels – and this might be just me – weirdly taken for granted, like using your not-favourite teaspoon. Anyway, having thought about one, I thought I should spend some time with one. And to stay on a similar theme, I thought I should use the Corsa to visit to some underrated places that I also neglect – places that are always there and available but which I also overlook too readily.  I’m embarrassed to say car museums, in general, are a bit like that for me. I often end up at the British Motor Museum because Steve Cropley is there a lot (he’s a trustee) and I frequently record a podcast with him there (we might have mentioned it…). And you would be appalled to note the cars I casually walk past with barely a sideways glance on my way to a meeting room to see him. Oh, that was the one- off Lightning GT and the 1938 Issigonis Special I just ignored, was it? Honestly, it’s almost criminal how neglectful I am. It’s time to put that right. So Vauxhall sent me a Corsa, specifically a Hybrid 100PS (99bhp) GS, which marries a 1.2-litre three-cylinder turbo petrol engine to some light 48V electrification, plus a six-speed dual-clutch gearbox, to make a supermini that returns 62.8mpg and 104g/km of CO2 and goes from 0-62mph in 10.7sec. It costs £25,280, because despite what muscle memory thinks, superminis haven’t been 15 grand for years. My first destination is the Atwell-Wilson Motor Museum in Calne, Wiltshire, on the opposite side of Chippenham to Castle Combe. It has been open since I was six but, appallingly, I haven’t been there before. I’m trying not to feel too bad about that, though, because Cropley only went for the first time this year too.  It’s sort of hiding behind a bungalow but, owing to the signage, you can’t miss it: a series of smart metal sheds on a gentle slope among some paddocks on the edge of the village. It’s quite unassuming but, friend, what treasures await. One of its directors, Michael Bennett, meets me at the door to give me the tour. Bennett is far too modest to mention to me his role in keeping the museum going after the death of its founders, Richard and Hasell Atwell. He has been so pivotal that a new hall was recently named after him. There was, says Bennett, no great plan when the collection began. The car that started it all off was a Buick Albemarle, which Richard Atwell bought for a fiver – and it’s still in the museum now. Then in 1972, Atwell began hiring out some nice cars for weddings – a service the museum still provides – and at the time “would take anything”, says Bennett.  I think they’re a little more discerning with their choices these days. Keke Rosberg’s 1985 Williams Formula 1 car joined the collection in February. But there’s still a vibrant diversity across more than 100 cars and motorcycles. “We get lots of cars donated,” explains Bennett.  Some of them are simply nice examples of cars you or your family might have owned or aspired to own, while others on display are more significant. There’s a Mini Cooper rallied by Paddy Hopkirk and one of three surviving ‘gearless’ Minis, a test bed made as part of Alec Issigonis’s 9X project, the car he hoped would replace the Mini but which was later canned. But giving my boat the most buoyancy is tucked around the back, in a rather smaller, more ramshackle shed built out of a former war department canteen by an Austin 7 enthusiast and special builder called Jack French. He was a founder of the 750 Motor Club some 75 years ago, and he built a special called Simplicity, which is still around today, before spreading the word about how he made it. Lots of people listened, and it gave birth to a motorsport revolution. If you’re looking for the roots of what makes Britain the global home of motorsport and motorsport engineering that it is today, it’s nuggets such as this workshop, rediscovered in 2013 next to French’s former cottage, saved from the bulldozers, dismantled and then reassembled at the Atwell-Wilson Museum. It’s a sensational fragment of history. Bennett tells me they’re better at this sort of thing than they are at marketing the museum itself. But it’s really busy with events and club visits, and it gets more than 5000 visitors a year, so they’re doing something right.  With the sun bright overhead, I say cheerio and head on to somewhere I know doesn’t want for visitors on a day like this: Bourton-on-the-Water, which is only 40 miles from Calne. You can make it a pleasant drive on good roads, so I do. Photographer Jack Harrison needs to take a few pictures anyway.  And I like the car. It has been a while since I drove any Corsa, which is down to circumstance rather than prejudice, but it’s another reminder of how much I enjoy small cars. At 4060mm long and 1765mm wide, the Corsa is firmly in what I consider to be the supermini size bracket, and they’re all five-door models these days. By coincidence, Harrison is driving a manual, unhybridised Corsa, which will later give me a chance to sample the difference between that, at 1175kg, and the hybrid, at 1267kg. Sub-1300kg is still not a great deal, all told, so I’m getting quite into it on B-roads. It has what feels like quite high lateral limits, decent agility and a willing enough powertrain. Before long, though, I’m on a duller, busier road into Bourton. I wonder how heavily Bourton gets marketed overseas, this ‘Venice of the Cotswolds’, because it clearly makes it onto foreign visitors’ tourist trails. Seemingly all of them, all at the same time today, so much so that although the Cotswold Motoring Museum is busy, it still feels like a haven from the wildness of Bourton central, which has people milling around it in a similar population density to that of Waterloo station on a Friday evening, but with more paddling and ice creams. The museum is owned by Boundless (the Civil Service Motoring Association), and there’s a large toy collection, powered and pedal bikes, some caravans, toys and memorabilia.  With period tunes piped into its rooms, it goes big on nostalgia so feels atmospheric and very curated, to the extent that you could remove quite a lot of cars and still sell it as an attraction.  I’ve been before and will surely visit again, more likely in winter, when it’s quiet, because I also like model villages and penguins and cafes that do extravagant hot chocolates, and Bourton has them all (but no longer a model railway). But today we don’t dwell: there are still 135 miles to cover to reach Coningsby and our overnight stop. Modern small cars are quiet, insulated and accommodating. The Corsa says it’s returning more than 50mpg as it settles into a cruise. I think the ride is fine, the stability is good and the interior fit and finish are up to scratch.  The ergonomics are mostly good, but I find it hard to stay comfortable, with either my arms too far from the wheel or my legs too close to the pedals.  I wonder if this is a facet of the Corsa being based on Stellantis’s CMP platform, which also underpins the Peugeot 208. That car’s i-Cockpit layout encourages you to site the steering wheel curiously low so you can see the instruments. The Corsa has conventional dials, and all is fine with them, but I find myself shuffling my seating position around an unusually frequent amount. I mention it to Harrison that evening, because it could be just me, but he says he finds similar. Still, I would make a sizeable bet that the Corsa is several times more comfortable than some of the vehicles that meet us the next morning at The Bubblecar Museum, in Lanrick, near Boston.  We’re met and given an entertaining tour by Paula Cooper, who, with her husband, used to run a Citroën 2CV business in Somerset, including doing some 2CV racing, before relocating to Lincolnshire and deciding that the UK really should have its own microcar museum. And quite right too. There’s period memorabilia and non-motoring displays, but unlike the Cotswolds museum, this isn’t one that would cope if you removed the wheeled exhibits. There are just too many and they’re just too good – as exhibits, if not necessarily all as actual pieces of transport. They have been diligently sourced and are looked after not in concours condition but kept the way you or your relatives will remember them, maintained so that “everything is in running order”, says Cooper.  The museum offers rides – 15 minutes for £15 – or gift vouchers that give you entry, tea, cake and a bubble car ride for £22, which is as good a use of £22 as I can think, given that the outlay also includes the words ‘tea’ and ‘cake’.  On which note, RAF Coningsby is around the corner and we haven’t had breakfast. This is one of the busier RAF bases, so if you want to watch Eurofighter Typhoons landing over a fried egg bap, I can recommend it. I enjoy driving in this part of the world. Even at times of the day that would in leafy Oxfordshire have me stationary in rush-hour traffic for way longer than I would like, in the Fens and the Wolds you still make progress – and often only in a car. I think more politicians who make calls on transport policies and costs should spend time in areas like this. I’m not confident that enough do. I’ve chosen to have a short go in Harrison’s Corsa. He was right last night when he said it rode better. I’m enjoying the hybrid well enough, but there’s an extra light-footedness to the manual, non-hybrid variant, shorn of nearly 10% of the hybrid’s weight. It’s also three grand cheaper, although it only returns 53.3mpg (with 120g/km of CO2) to the hybrid’s 60mpg-plus on the WLTP test cycle in the wild.  Ultimately, I’m happy to be back in a hybrid for a less entertaining slog east to west across the country – not a direction of travel the UK typically does well. It takes nearly two hours by car (or at least double by public transport). We swap Lincolnshire’s near-American wilderness feel for something grittier. Stone masonry becomes greyer, I pass a pub called The Excavator and a town called Sawmills. And in Belper, Derbyshire, we arrive at our final destination: the Great British Car Journey. It’s a newish museum established by a mate of mine and this magazine’s, Richard Usher, who did well out of Auto Windscreens and later bought Blyton Park, later sold to Ginetta. He also owns what most of us would consider a daunting proportion of the 150-plus cars at the GBCJ, which opened in May 2021. Compared with all of our other museums, it’s an organised one. It’s ‘NOT a random selection’, according to the website. Visitors get a tablet guide with audio headset and there are nine ‘chapters’ taking you through the history of the British-made car, much of it glorious, some of it not. “Does any other nation have a history of building such dismal cars?” asks Harrison, perhaps – or perhaps not – unkindly.  It’s a reminder Britain also made, and still does make, some great ones, too (and GBCJ sells some outstanding Autocar cover art featuring them; link over to the right). There are some absolute belters, from Bristols and Jaguars to Lotuses, TVRs and more. Typically we rush it, but you could spend half a day or more. It also includes the chance to ‘Drive Dad’s Car’. More than 50 cars are on the menu to pick and drive on site, with the fee to do so including museum access. Fun in itself but also a good way to decide if you really do want to buy a particular classic. I may well go back and do that. In the meantime, back to the Corsa. Two entertaining days, four entertaining museums and a reminder to myself on the next quiet Saturday: get up, get out and go visit More must-visits Britain isn’t exactly short of motoring museums, from the grand, like the British Motor Museum at Gaydon or National Motor Museum at Beaulieu, through to the tiny and quaint, like the Myreton Motor Museum, half an hour east of Edinburgh, between the small coastal towns of Aberlady and Gullane. It’s a £10 (cash only) museum that still manages to be open on every day of the year except Christmas Day and which I stumbled across by accident when in the area. I found it amazingly compelling. I think the rise of the car ‘destination’ has helped. People don’t go just for a drive; they go to somewhere, stop, chat and drink poncy expensive coffees. Me included. As a result, you end up with new ventures such as County Classics in Taunton, Britain’s newest motor museum, while showrooms like Retro Sect in Tewkesbury can end up being mini-museums of their own.  Those two are on my list of places to go, as is the Museum of Land Speed, alongside the seven miles of Pendine Sands in Carmarthenshire, host of land speed record attempts a century ago.",
    "author": "",
    "published": "Sat, 12 Oct 2024 06:01:07 +0100",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/motor-museums-vauxhall-corsa-roadtrip-jh-205.jpg?itok=G8dLTpg5",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "f9c0a0ba-5722-40e8-b120-7b57c8cced2f",
    "title": "For the Love of Go_: The inaugural Worship Moto Show report",
    "link": "https://www.bikeexif.com/2024-worship-moto-show-report",
    "description": "Motorcyclists form a broad church, made up of countless factions, subsets, and niches within niches. From road to dirt, from cruisers to abusers, via more variations than any of us has the hours to map, we’re an eclectic crew above all else. Few know more about, or have done more to celebrate, the subcultures within motorcycling than Gary Inman. Creator of Sideburn Magazine and the wild Dirt Quake events, Gary has broadened the horizons of every motorcycling publication for which he has written (which is just about all of them). This is the man who road-tested a Benelli 1130 TNT by riding it across the Sahara Desert. So when he issues a rallying cry to a motorcycling denomination, it listens.…",
    "author": "Gareth Charlton",
    "published": "Sat, 12 Oct 2024 20:46:11 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/10/2024-worship-moto-show-report-5.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Motorcycle Show",
      "Honda motorcycles",
      "Kawasaki motorcycles",
      "Suzuki motorcycles",
      "Yamaha motorcycles"
    ]
  },
  {
    "id": "15083b0a-81a2-4216-8738-9be4e3d04bb1",
    "title": "Pre-War Powerhouse: 1939 BMW RS M255 Kompressor",
    "link": "https://www.bikeexif.com/bmw-rs-m255-kompressor",
    "description": "Classic motorcycles attain desirability for any number of reasons, but every once in a while we come across one that checks every conceivable box—in this case—the BMW RS M255 Kompressor. At its core, we’re talking about a Grand Prix-winning motorcycle of staggering mechanical specification—designed with lightweight magnesium hubs and engine cases, and a vane-type supercharger delivering 15 psi. It’s also a witness to one of the most tumultuous periods in history, having been developed and raced in the late 1930s, and surviving the subsequent chaos of the Second World War. Rare from day one, BMW estimates no more than 10 were produced, and just seven are believed to exist today. BMW has always enjoyed a reputation for technological innovation, and considering the firm started experimenting with forced induction on motorcycles as early as the 1920s, it’s safe to say they’ve earned it.…",
    "author": "Dean Larson",
    "published": "Fri, 11 Oct 2024 17:00:41 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/10/193839-bmw-m255-kompressor-3.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Classic Motorcycles",
      "Racing Motorcycles",
      "auction",
      "BMW motorcycles"
    ]
  },
  {
    "id": "7076e300-4750-413a-ad5f-1e3aa4997bce",
    "title": "RS Taichi WP Backpack review",
    "link": "https://www.autocarindia.com/bike-reviews/rs-taichi-wp-backpack-review-433141#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "It’s been nearly a year since I got my hands on RS Taichi’s waterproof backpack, which is available in five colours and a unique Resident Evil edition. I’ve gone for the plain black shade due to its stealthy look and was quite eager to see just how usable this bag would be during monsoon. The WP backpack’s construction mainly comprises polyester and thermoplastic polyurethane. The bag consists of a primary 25-litre waterproof compartment, a smaller compartment located near the primary compartment’s opening and an external quick-access pocket that isn’t waterproof. Main compartment holds 25L. The bag uses a roll-up top system to seal the main compartment and can be adjusted based on how full it gets. It’s easy to use and even includes a Velcro strap to keep it tightly sealed. Its 25-litre storage is a boon for when I’m travelling, and over time, I’ve fit huge items in this compartment, including Rishaad’s fully packed Kriega R25 backpack! Secondary compartment is handy storage for small items The secondary compartment is only water-resistant, even though it uses the same opening as the main compartment. It can be used for smaller items, such as a pair of gloves, balaclavas and cleaning cloths. The third external pocket is mainly designed for items you’d like to keep handy that aren’t fazed by the rain, like a set of keys. Outer pocket is not waterproof. This bag gets a chest harness and a waist belt; both of these can be further adjusted to your size and do a good job of preventing the straps from slipping off the shoulders and distributing luggage weight evenly, especially when on the bike. Chest harness divides the load and provides a better fit. The overall fit, finish and feel of this bag are premium, and it feels built to last. However, after all this time, I did lose the rubberised end on the zipper pull tab located on the external pocket. Honestly, this is quite a minor issue and can be easily replaced. I’ve had absolutely no complaints with this bag otherwise. It’s been quite handy and dependable through my daily commute during peak Mumbai monsoon. Waist harness helps keep the bag secure while riding. Given that this bag is waterproof, you are prone to wearing it outside your protective rain gear, which can make it susceptible to dirt and grime being flung on it by the rear wheel. In such cases, a quick wipe-down with a wet cloth helps, and fortunately, the bag doesn’t stain permanently. This bag is currently available on special order at 6kiom.com and will cost approximately Rs 15,000. Velcro strap help seat the two main compartments well. I managed to buy it for far less overseas, and you may also have to wait anywhere from one to four months for it to be delivered. Just like most imported products, the RS Taichi WP backpack comes at a price, but it gives you good quality and performance in return. Also see: Ixon Dirt Air gloves review",
    "author": "Gavin Rodrigues",
    "published": "Sun, 13 Oct 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241008052945_2.png",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "867df352-260a-4f4a-bae1-9723591b9f19",
    "title": "TVS Apache RTR 310 road test video",
    "link": "https://www.autocarindia.com/bike-video-reviews/tvs-apache-rtr-310-road-test-video-review-433189#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: TVS Apache RTR 310 road test, review",
    "author": "Dinshaw Magol",
    "published": "Fri, 11 Oct 2024 14:15:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241011021515_YT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "5ff7be34-81c1-4555-a627-50b200f2b92a",
    "title": "You Can’t Make This Up: Tesla Owner Blocks Windshield With Sunshade, Lets FSD Drive",
    "link": "https://www.carscoops.com/2024/10/you-cant-make-this-up-tesla-owner-lets-fsd-do-the-driving-has-sunshades-blocking-the-windshield/",
    "description": "Tesla says that the driver must always be aware and ready to intervene when using its semi-autonomous systems, but this person obviously thought otherwise",
    "author": "Brad Anderson",
    "published": "Sun, 13 Oct 2024 01:01:00 +0000",
    "image": "https://packaged-media.redd.it/gnmh6q2dtxtd1/pb/m2-res_640p.mp4?m=DASHPlaylist.mpd\u0026v=1\u0026e=1728774000\u0026s=631dc0108ddfd7449e19a05d45147a0403119a7f",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Autonomous",
      "Electric Vehicles",
      "Offbeat News",
      "Tech",
      "Tesla",
      "Tesla Model 3",
      "Tesla Videos",
      "USA",
      "Video"
    ]
  },
  {
    "id": "e2c87d16-5d4b-4e9f-8a04-d883fd1ef71b",
    "title": "Warranty-Denied Elantra N Owner May Have Admitted Modding His Car Online Too",
    "link": "https://www.carscoops.com/2024/10/warranty-denied-elantra-n-owner-may-have-exposed-his-own-car-abuse-online/",
    "description": "\"I beat it every day no issue,\" the owner allegedly wrote online before his engine blew up",
    "author": "Stephen Rivers",
    "published": "Sat, 12 Oct 2024 23:09:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/10/54tf45tgf-1-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Canada",
      "Hyundai",
      "Hyundai Elantra",
      "Hyundai N",
      "Offbeat News",
      "Reports",
      "Warranty"
    ]
  },
  {
    "id": "aa5b2c3c-0044-42e6-8c8f-d583d533b78b",
    "title": "Tata Nexon CNG video review",
    "link": "https://www.autocarindia.com/car-video-reviews/tata-nexon-cng-video-review-433161#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see: Tata Nexon CNG review: iCNG on the cake",
    "author": "Saumil Shah",
    "published": "Thu, 10 Oct 2024 10:33:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241010103449_Tata_Nexon_CNG_video_review.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "f623e158-5867-45b7-88e8-06cefe8179b5",
    "title": "Tata Nexon CNG review: iCNG on the cake",
    "link": "https://www.autocarindia.com/car-reviews/tata-nexon-cng-review-icng-on-the-cake-433160#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "With the introduction of this CNG version, the Tata Nexon becomes the first car in India to be offered with four fuel options – petrol, diesel, CNG and electric. It’s also the first CNG to use a turbocharged engine and come with a 6-speed manual ’box. Here’s what it’s like to drive. Tata Nexon CNG: exterior and interior Cosmetically, you’ll be hard-pressed to tell the Nexon CNG apart from the rest of the ICE range. The only tell is the ‘i-CNG’ badge on the bootlid and the CNG stickers in the front and rear windshield. Other than that, it retains the standard Nexon’s edgy styling with the same alloy wheel design and LED lighting elements. The Creative Ocean and white dual-tone paint scheme you see here also makes it stand out. Save for the iCNG badge, its exterior is identical to the rest of the ICE Nexon range. Inside, too, the changes are minimal but there are some noticeable ones. For starters, this variant – Persona in Tata speak – gets all-black upholstery with blue stitching on the seats.The trim piece on the dash is also slightly different. There’s a CNG button on the centre console that lets you switch between fuels on the fly, there are CNG-specific graphics in the digital instrument cluster that show you the usage split between petrol and CNG modes, and a CNG-only trip meter. The rotary knob for the drive modes – just behind the gear lever – has also been done away with and it’s replaced by a small cubby that can hold small items like the key fob. Perhaps, Tata could have used this opportunity to give the Nexon at least one proper cup holder; it continues to get them inside the glove box. The front seats are sufficiently large and supportive, and it’s easy to find an ideal driving position. At the back, there’s enough room to sit three passengers in relative comfort and it’s nice to see that the panoramic sunroof hasn’t eaten into the headroom. Boot space is down by 21 litres compared to the petrol Nexon, at 321 litres. The Nexon uses Tata’s innovative twin cylinder tech, which means that you don’t lose out on proper usable boot space or a spare wheel. The two CNG tanks, which have a capacity of 60 litres, are placed below the boot floor while the spare wheel is mounted under the car. Boot space has reduced by 61 litres over the standard Nexon to 321 litres (measured from floor to roof), but you can still fit in a couple of suitcases and soft bags. The space saver spare wheel, meanwhile, can be lowered by loosening a bolt in the boot floor and it's a relatively fuss-free affair. Tata Nexon CNG features and safety Tata was the first manufacturer to offer a CNG even on top-end variants of the Tiago and Tigor, and the Nexon is no different. The Nexon CNG is available in four trim levels, so buyers can opt for the lower running costs of the CNG without having to compromise on features.  The Fearless + PS DT variant you see here is loaded with equipment,with the headlining feature, quite literally, being the panoramic sunroof.This has debuted on the CNG and we expect it to trickle down to the petrol and diesel versions soon. Other features include leatherette upholstery,ventilated front seats (not electrically adjustable), two 10.25-inch screens for the infotainment and instrument cluster, auto climate control, auto headlamps and wipers, a wireless phone charger, and a superb-sounding JBL audio system. But there are some glitches with the screens that need to be ironed out. Rear seat is spacious and it's nice that the panoramic sunroof hasn't compromised headroom. Safety kit like six airbags and ESP are standard on all variants, with the top-spec variant getting a crisp and high-res 360-degree camera, a tyre pressure monitor, front parking sensors and an auto-dimming IRVM. It also received a 5-star safety rating from Global NCAP and Bharat NCAP. There are some CNG-specific safety features that are a part of the package, too: a fire extinguisher, the engine won’t start if the fuel filler flap is open, and it’ll also cut-off CNG supply and release the gas into the atmosphere if it detects a leak in the system. Spare is mounted under the car and can be lowered by loosening a bolt in the boot floor. Tata Nexon CNG engine and gearbox Powering the Nexon CNG is the same 1.2-litre, three-cylinder, turbocharged engine as the petrol Nexon, but it makes 100hp and 170Nm –while the torque is the same, it is 20hp down over the petrol version.However,the torque band is less – it is only available for 1000rpm, unlike the petrol’s 2,500rpm. It comes only with a 6-speed manual gearbox, but Tata could offer an AMT variant later. Thanks to the single ECU that this employs, it can be started up directly in CNG mode, which helps conserve that little extra bit of petrol at startup. There is some noticeable noise and vibration from the engine at idle, but it does smoothen out on the move. Rev it hard though, and the noise does get intrusive inside. Response off the line is good, both in petrol and CNG, and it’s quite eager to respond to part throttle inputs, too. The engine revs freely, but there are some inconsistencies in the power band. Interestingly, it also revs to a more conservative redline of 5,500rpm in CNG, while in petrol it’s 6,000rpm. 1.2-litre, three-cylinder motor puts out 100hp and 170Nm. There is a noticeable difference in the two modes but it’s not as large as you’d expect. The CNG doesn’t make it feel breathless or strained, which means you’ll be happy to let it run in that mode most of the time. the ability to switch between petrol and CNG on the fly makes the entire experience seamless, butthere are no drive modes. The 6-speed manual gearbox has well-defined gates, but the throws are long and the shift action isn’t the most pleasing. What also doesn’t help matters is the snappy nature of the clutch, so you’ll have to get used to its modulation for a smoother drive.  It gets two fuel guages and CNG-specific graphics in the instrument cluster. Tata Nexon CNG performance and fuel efficiency What’s impressive though is the performance, as can be seen in the numbers. In petrol mode, it does the 0-100kph sprint in 13.97s, which is less than a second quicker than the CNG mode. What’s interesting, though, is that it's quicker to 60kph in CNG. There’s a prominent gap in the in-gear acceleration, though, with it being quicker in petrol in both the 20-80kph and 40-100kph runs. Tata Nexon CNG: performancePetrol modeCNG mode0-20kph1.87s1.72s0-40kph3.92s3.37s0-60kph6.55s6.29s0-80kph9.57s10.44s0-100kph13.97s14.69s20-80kph (in 3rd gear)11.21s12.58s40-100kph (in 4th gear)15.53s16.11sBraking (80-0kph)26.25m, 2.66s26.25m, 2.66s Tata claims an ARAI-rated efficiency figure of 24km/kg, but expect real-world figures to be lower. While we didn’t do a full fuel efficiency test, in our preliminary highway test, the Nexon CNG managed to cover 204km at an average speed of 48.19kph and took 7.5kg of gas at the end of our drive. A point to note is that Tata claims the total tank capacity is 9 kilograms; however, unlike petrol or diesel, CNG tanks often take different quantities of gas depending on the time of the day as the change in temperature and pressure can affect its density. Hence, getting an accurate reading is not simple. You’ll also have to contend with the long queues at CNG filling stations. Tata Nexon CNG ride and handling The CNG weighs about 120kg more than the petrol Nexon and Tata has made some changes to the suspension’s spring rate and damping to account for the additional weight. However, there’s not a lot of difference to the way this rides or handles compared to the standard Nexon, and as such, it remains one of this SUV’s strengths. Despite the additional weight, ride and handling remains a strength.  To account for the additional weight of the tanks at the rear, it does feel a bit softer, and though there’s slightly more vertical movement at the rear, it isn’t uncomfortable. Bump absorption remains impressive and the Nexon CNG comes across as a composed SUV. The steering is light at low speeds, enabling you to manoeuvre easily in traffic, and it weighs up nicely as you pick up pace. Tata Nexon CNG price and verdict  Prices for the Nexon CNG range from Rs 8.99 lakh to 14.59 lakh (ex-showroom, India) and buyers will appreciate that it is offered from the base to the top variant. In comparison, its main rival, the Maruti Brezza CNG, is priced from Rs 9.29 lakh to 12.10 lakh (ex-showroom). What’s also nice is the 3 year/ 1,00,000km standard warranty it comes with. Nexon CNG is available in four trims, priced from Rs 8.99 lakh to 14.59 lakh. With the CNG, the Nexon now has the widest powertrain choice in our market, and given the multiple trims and variants on offer, there’s a Nexon for everyone in the range. The top variant is pricey, the refinement isn’t the best and it continues to suffer from ergonomic issues like the standard Nexon. However, with the CNG, you get the benefits of lower running costs.It also delivers in terms of its drivability and performance, so much so that you can use it in CNG mode only. That, coupled with the fact that you don’t miss out on a boot and a spare tyre, sweetens the deal further. Also see: Tata Nexon CNG video review Tata Nexon CNG vs rivals: price, specifications comparison Tata Nexon CNG price, variants, features explained",
    "author": "Soham Thakur",
    "published": "Thu, 10 Oct 2024 10:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241010095451_Tata_Nexon_CNG_rear_tracking.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "82a10f0a-2230-4991-9cd6-50a2dd6d53cb",
    "title": "Average Cars That Rock And Boring Cars That Suck In This Week's QOTD Roundup",
    "link": "https://jalopnik.com/average-cars-that-rock-and-boring-cars-that-suck-in-thi-1851670900",
    "description": "Everyone loves a one off, lap-happy hyperbeast of a vehicle. Their unique styling and wild engineering easily endears themselves in the enthusiast heart. It can be a little harder to love the cars we see around us every day, but we do usually end up adoring at least some of them. So I asked you what your favorite…Read more...",
    "author": "Jalopnik Staff",
    "published": "Sat, 12 Oct 2024 13:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/72d6a3a41e588746dc2666c860f5055e.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "owen bellwood",
      "erin marquis",
      "andy",
      "human interest",
      "daniel golson"
    ]
  },
  {
    "id": "9c0f10f9-1b97-4e18-9a50-2020fce51cf2",
    "title": "Plane Problems And More In This Week's Beyond Cars Roundup",
    "link": "https://jalopnik.com/plane-problems-and-more-in-this-weeks-beyond-cars-round-1851670899",
    "description": "It’s been a little more than two weeks since Hurricane Helene made landfall in Florida, spreading devastation across much of the southeast, causing floods, cutting power and killing more than 200 people. Never ones to let a good emergency go to waste or worry about how many people might be hurt by their actions, right-…Read more...",
    "author": "Jalopnik Staff",
    "published": "Sat, 12 Oct 2024 13:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/ebcc1c5aed9baa1fddd9b846649e4c0a.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "disaster accident",
      "hurricane helene",
      "lunar rovers",
      "fort lauderdalehollywood international airport",
      "spacex",
      "extravehicular activity",
      "malaysia airlines flight 370",
      "turkish airlines",
      "the boeing",
      "ryan erik king",
      "qantas",
      "spacex",
      "boeing 777",
      "owen bellwood",
      "hurricane hunters",
      "graphic nudity and sexting",
      "united states",
      "airbus a350",
      "ryan",
      "collin woodard",
      "in china",
      "malaysia airlines",
      "plane flies",
      "apollo",
      "milton",
      "apollo 17"
    ]
  },
  {
    "id": "dc383783-f00a-4a3e-b535-f92b85f7b9f5",
    "title": "1997 Porsche 911GT1 Is Literally a Race Car for the Road",
    "link": "https://www.caranddriver.com/reviews/a62513944/1997-porsche-911gt1-archive-drive/",
    "description": "If this is a road car, then the F-117 stealth is an executive jet.",
    "author": "",
    "published": "Sat, 12 Oct 2024 15:52:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "037a7feb-e2c4-41d7-a2b7-578b6c1e9b53",
    "title": "View Photos of the 1997 Porsche 911GT1",
    "link": "https://www.caranddriver.com/photos/g62557098/1997-porsche-911-gt1-archive-drive-gallery/",
    "description": "1997 Porsche 911GT1 exterior and interior photos.",
    "author": "",
    "published": "Sat, 12 Oct 2024 15:52:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "84748cfd-dd70-498d-87c6-ccbebd2a52f6",
    "title": "13,300 mile 1989 Mercedes-Benz 190E EVO I",
    "link": "",
    "description": "Photography by: Zach Brehl (@zachbrehl) 1989 Mercedes-Benz 190E EVO I Location: Miami, Florida Original delivery: Japan Chassis/VIN: 598552 Mileage: 21,401 kms (13,298 miles) Price: Call for Price The car As part of its Private Sales initiative, Petrolicious is proud to offer this museum-grade, impeccably preserved, and concours-ready 1989 Mercedes-Benz 190E EVO I. Showing only 21,401 kilometers from new, we believe acquiring this EVO I example is an exceptionally rare opportunity, unlikely to be repeated in today’s market. We also believe this example is among the lowest mileage ones in the world. The Mercedes-Benz 190E EVO I was developed from DTM racing to challenge BMW in the German touring car championship. Built to meet Group A homologation requirements, it featured a Cosworth-tuned engine producing 202 hp, along with aerodynamic upgrades like a rear spoiler and wider fender flares for improved downforce and handling. With a revised suspension for racing demands, the EVO I set the stage for Mercedes’ later dominance in DTM and paved the way for the more aggressive EVO II. Both models reflect the close link between motorsport and street-legal performance cars.   Continue...",
    "author": "",
    "published": "Tue, 08 Oct 2024 20:40:28 +0000",
    "image": "https://petrolicious.com/wp-content/uploads/2024/10/190-Evos-50-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "878d8832-57ea-49f7-a193-5bf006e2f992",
    "title": "176.0 kilometers 1990 Mercedes-Benz 190E EVO II",
    "link": "",
    "description": "Photography by: Zach Brehl (@zachbrehl) 1990 Mercedes-Benz 190E EVO II Location: Miami, Florida Country of original delivery: Netherlands Chassis/VIN: 741313 Mileage: 176.0 kms (109.4 miles) Price: Call for Price The car As part of its Private Sales initiative, Petrolicious is proud to offer this museum-grade, impeccably preserved, and concours-ready 1990 Mercedes-Benz 190E EVO II. Showing only 176.0 kilometers from new, we believe acquiring this EVO II example is an exceptionally rare opportunity, unlikely to be repeated in today’s market. We also believe this example to be the 2nd lowest mileage one in the world, as we are aware of a lower mileage car located inside the borders of Russia. The 1990 Mercedes-Benz 190E EVO II was born out of Mercedes' ambition to dominate the Deutsche Tourenwagen Meisterschaft (DTM), Germany’s premier touring car championship in the late 1980s and early 1990s. As DTM regulations required manufacturers to base their race cars on production models, Mercedes developed the EVO II as a homologation special, producing only 502 units for road use. Furthermore, the EVO II introduced significant upgrades over the EVO I, primarily in aerodynamics, engine performance, and handling. Its bold, wind tunnel-tested body kit featured a larger rear wing and front splitter for improved downforce and high-speed stability. The 2.5-liter engine was also more powerful, delivering 235 horsepower compared to the EVO I’s 204 hp. The EVO II’s adjustable suspension, larger 17-inch wheels, and enhanced chassis provided sharper handling and a more responsive driving experience, making it better suited for both the track and the road. These refinements solidified its dominance in DTM racing. Continue...",
    "author": "",
    "published": "Tue, 08 Oct 2024 19:16:32 +0000",
    "image": "https://petrolicious.com/wp-content/uploads/2024/10/190-Evos-143-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "bfec130d-5b48-4946-9117-109373873653",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "f570f5f4-aef2-4bb6-a8af-c849f4d577ea",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "9a04d56c-96fa-4a1c-be0c-b5b496f83bd2",
    "title": "Guest commentary: For safe jobs, EV battery workers need a union contract",
    "link": "https://www.autonews.com/guest-commentary/safety-ev-battery-workers-need-union-contract",
    "description": "The UAW is aware of the grave dangers of an ill-equipped and unrepresented workforce.",
    "author": "Shawn Fain",
    "published": "Tue, 08 Oct 2024 00:00:01 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/AutomakerNews",
    "categories": null
  },
  {
    "id": "a72d3698-9eae-4a30-8abd-378c03a4f245",
    "title": "BYD will show high-tech Sealion, a Tesla rival, in Paris",
    "link": "https://www.autonews.com/paris-auto-show/2024-paris-motor-show-byd-present-hi-tech-sealion",
    "description": "The Sealion 7 will be the brand's most technologically advanced model in Europe.",
    "author": "Nick Gibbs",
    "published": "Fri, 04 Oct 2024 08:25:00 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/AutomakerNews",
    "categories": null
  },
  {
    "id": "f06da520-6743-4a7b-9c83-566766458acd",
    "title": "Stellantis shuffle puts Jeep chief in crucial N.A. role",
    "link": "https://www.autonews.com/executives/stellantis-dealers-seek-more-factory-support-after-exec-shuffle",
    "description": "Dealers are looking to Antonio Filosa, who replaces Carlos Zarlenga as North America COO, for more help moving inventory that on many lots goes back to the 2023 model year.",
    "author": "Vince Bond Jr.",
    "published": "Fri, 11 Oct 2024 16:43:07 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/EditorsPicks",
    "categories": null
  },
  {
    "id": "32171855-3aea-4be8-85f0-a3922b5fc49d",
    "title": "Elon Musk reveals Hollywood vision for Tesla, but new budget model is a no-show",
    "link": "https://www.autonews.com/mobility-report/tesla-robotaxi-event-disappoints-after-budget-model-no-show",
    "description": "Musk presented an autonomous Cybercab for 2026 then a futuristic Robovan, but investors want to see a budget $25,000 EV that Tesla could start selling next year to boost volume.",
    "author": "Laurence Iliff",
    "published": "Fri, 11 Oct 2024 15:04:47 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/EditorsPicks",
    "categories": null
  },
  {
    "id": "0ac9b15a-aa0e-4238-8dfd-e43a6da9a671",
    "title": "Bill Ford pays tribute to Ratan Tata, clarifies 'Detroit meeting' stories",
    "link": "https://www.autocarindia.com/industry/bill-ford-pays-tribute-to-ratan-tata-clarifies-detroit-meeting-stories-433203#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "When a great figure passes away, it is usual for well-wishers and the media to remember and recount various incidents from the person's life to serve as a motivation for others. The passing away of Padma Vibhushan Ratan Naval Tata, one of India's tallest industrialists and the erstwhile chairman of Tata Group, has been no exception. However, the rising prominence of social media has added a new twist to this phenomenon, with the result that many of these incidents can be of questionable veracity. One such tale that seems to have made the jump from social media to mainstream media recounts how Ratan Tata was supposedly 'humiliated' by William (Bill) Ford Jr., the current chairman of Ford Motor Co., during a crucial business meeting in Detroit in 1999. Ratan Tata, the story goes, went to Detroit to explore the sale of his passenger car division, which -- according to the story -- had not gotten off to a great start. Tata, the story claims, was disappointed at the first-year sales of the Indica and wanted Ford to take the car business off his hands. However, during the meeting, the story continues, Bill Ford made it clear that he would only consider buying the division as a favour to Tata, and even asked why his company got into the passenger car business when \"they knew nothing about it.\" Tata, says the story, felt humiliated by this and resolved in his mind to make a success of the passenger car division, determined to show everyone that Tata Motors could make a world-class car. The story is held up as another example of how the West tends to underestimate Indians, and how Ratan Tata -- nine years later -- had the last laugh by buying Jaguar and Land Rover, iconic British brands, from Ford in 2008. So, how much of this story is true? Hormazd Sorabjee, editor of Autocar India, recalls asking Mr. Tata a few months ago about the veracity of the Ford story, which had been rampant on social media for some time. According to Tata, he had a very pleasant conversation with Ford and even spoke of baseball and basketball. In recent times, a lot of fake stories have been attributed to Ratan Tata, which he was forced to clarify on social media. In a statement following Ratan Tata's death, Bill Ford called Tata a \"leader with a vision and integrity\" who \"proved to be an excellent steward of Jaguar and Land Rover,\" and dismissed the dramatic accounts of his meeting with the Indian businessman. “I only had the opportunity to meet Mr. Tata once in person. It was a warm and cordial meeting where we talked about the challenges and joys of running family businesses and our mutual love of cars,\" he said. \"The accounts of our meeting in some press reports could not be any further from the truth,\" he added. \"Ratan’s legacy will continue to inspire future generations of business leaders and entrepreneurs.\" Other sources close to the group also confirmed that the story -- as circulated in the mainstream and social media -- was more fiction than fact. Autocar India also reached out to Ford's official spokesperson, who said: \"These two distinguished individuals held each other in high regard. We believe that Mr. Ford’s views about Mr. Tata present a more complete picture of their professional relationship and mutual respect.\" He noted that several media outlets have characterized the interaction as condescending towards Tata, a narrative that, he said, lacks “credible evidence.” “Since this narrative has always been based on individual perspectives and personal impressions and considering that Mr. Tata never publicly commented on the matter, Ford also opted not to comment on these unsubstantiated claims in the past,” he explained. Also read: Ratan Tata (1937-2024)",
    "author": "Autocar India News Desk",
    "published": "Sat, 12 Oct 2024 23:30:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241012105512_BILLFORD_RNT_ACI.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "d6a61803-1840-4088-9b9c-9db16be601f0",
    "title": "Constant changes in EV taxation distort the market, says Mercedes India CEO",
    "link": "https://www.autocarindia.com/car-news/constant-changes-in-ev-taxation-distort-the-market-says-mercedes-india-ceo-433202#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "While many feel that demand for electric vehicles (EVs) in India is tapering off, Mercedes India CEO Santosh Iyer believes it is not right to draw conclusions just yet. Speaking to Autocar India on the sidelines of the new E-Class launch, Iyer said, “Everybody looks at sales numbers and says demand has gone. But demand is also going down because prices are going up in some of these states.”  Delhi, Karnataka, Telangana among states to have withdrawn subsidies EVs contribute 6 percent to Mercedes India's sales in Jan-Sept Indeed, EV prices in some states have gone up with the withdrawal of subsidies such as road tax waivers and even the imposition of separate EV taxes. Telangana replaced the road tax waiver that EVs enjoyed with a fee that goes up to 15 percent of the vehicle cost. Karnataka ended an earlier road tax waiver with the special 10 percent lifetime tax on EVs above Rs 25 lakh. Delhi too, withdrew the road tax waiver and EV are now required to pay the 10 percent road tax.   These variations, says Iyer, aren't ideal. “What’s distorting the market is changes in taxation. We have 28 states; some offer zero road tax, some charge you and some others withdraw subsidies after offering them. So, how do you gauge if EVs are doing well?”  Iyer also added Mercedes India’s EV sales have been doing well. Last year, electric models comprised 2.5 percent of its sales; this year, they already constitute 6 percent of sales between January and September.  According to Iyer, unlike in the budget EV segment, in the luxury space, running costs are not as critical as the purchase price is. Iyer feels that with these percentage fluctuations and on a high base, customers shy away or are waiting for EV prices to stabilise and come down before they make a purchase. He cites the EQS’ localisation as an example. “After we localised the EQS and had an attractive price, you saw sales shoot up. So, customers clearly want a good price and will not buy if there is fluctuation in EV prices.”   Thus, Iyer believes that it is too early to draw conclusions about EV sales and also too soon to keep changing taxes levied on EVs. “I think there should be a very clear roadmap for three to four years. Let’s get 25 percent to 30 percent EV penetration, and then, you can flip because you need scale to get EV prices down.” Also see: Mercedes EQS SUV review: High on EQ Mercedes-Benz India records 21 percent sales growth in Q3 2024 New Mercedes E-Class launched at Rs 78.5 lakh",
    "author": "Sergius Barretto",
    "published": "Sat, 12 Oct 2024 12:49:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241012125014_Mercedes_EQS_Santosh_Iyer_Mercedes_India_CEO.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "24836a6b-be99-4031-a894-9344d21f50bc",
    "title": "Throwback: The Sarto Racing x Rocket Bunny CLK",
    "link": "https://www.speedhunters.com/2024/10/throwback-the-sarto-racing-x-rocket-bunny-clk/",
    "description": "In the first few years following the initial Rocket Bunny overfender-equipped car, Kei Miura of TRA Kyoto was kept busy designing wide body kits for variety of chassis. One of the most interesting was the kit created in collaboration with Sarto Racing for the Mercedes-Benz W209 CLK. It’s been 10 years since Dino photographed Sarto Racing’s demo machine outside Fuji Speedway for a feature that […] The post Throwback: The Sarto Racing x Rocket Bunny CLK appeared first on Speedhunters.",
    "author": "TheSpeedhunters",
    "published": "Fri, 11 Oct 2024 16:00:27 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "Benz",
      "clk",
      "CLK 240",
      "japan",
      "Mercedes",
      "Mercedes-Benz",
      "Pandem",
      "Rocket Bunny",
      "Sarto Racing",
      "Throwback"
    ]
  },
  {
    "id": "f8347fb0-b2d3-443e-b48f-de087cf2c041",
    "title": "Bringing A Slice Of Japan To Italy: The 2024 Magione Super Battle",
    "link": "https://www.speedhunters.com/2024/10/bringing-a-slice-of-japan-to-italy-the-2024-magione-super-battle/",
    "description": "I had the honour of being invited by the Magione Super Battle’s organisers, Alessio C. and Alessio P., to witness the two days of festivities, from setup to the final pack-down. To say it was brilliant would be an understatement. As mentioned in previous MSB coverage on Speedhunters, the event was inspired by Attack Tsukuba. […] The post Bringing A Slice Of Japan To Italy: The 2024 Magione Super Battle appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Thu, 10 Oct 2024 16:00:17 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Event Coverage",
      "Autodromo dell'Umbria",
      "Italy",
      "Magione",
      "Magione Racetrack",
      "Magione Super Battle",
      "Magione Super Battle 2024",
      "MSB",
      "MSB 2024",
      "time-attack"
    ]
  },
  {
    "id": "157f3017-9ce0-4e57-9432-1d483659dd0e",
    "title": "QOTD: Will Tesla's Robotaxi Promises Prove True?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-will-tesla-s-robotaxi-promises-prove-true-44509756?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Tesla had its big robotaxi reveal last night .",
    "author": "Tim Healey",
    "published": "Fri, 11 Oct 2024 23:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/10/11/18061/qotd-will-tesla-s-robotaxi-promises-prove-true.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "24e4dcdb-4769-4fe4-ba34-c80cc2609a27",
    "title": "Rare Rides Icons: The Cadillac Eldorado, Distinctly Luxurious (Part XXXVI)",
    "link": "https://www.thetruthaboutcars.com/cars/features/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-xxxvi-44509750?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "In our last Eldorado installment , a reworked and Fleetwood-bodied 1963 Eldorado’s exterior styling was a bit of a surprise. It stepped away from the dowdy and Chevrolet adjacent styling it carried in 1961 and 1962 and became more slab-sided and refined looking. And even though it was not an entirely new car (as claimed by GM), the styling revisions were enough to set the sixth generation car apart from its predecessor. This week we open the long, heavy doors and see what interior updates were made for ‘63.",
    "author": "Corey Lewis",
    "published": "Fri, 11 Oct 2024 22:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/10/11/15451/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-xxxvi.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Features"
    ]
  },
  {
    "id": "1cec9c02-0d5c-4185-9c18-580c3bae0f30",
    "title": "ICE vehicles are dying, and here’s why",
    "link": "https://www.autoblog.com/news/ice-vehicles-are-dying-and-heres-why",
    "description": "Internal combustion engine vehicles are seeing an unrelenting market share decline as consumers turn to hybrids and EVs.",
    "author": "Elijah Nicholson-Messmer",
    "published": "Sun, 13 Oct 2024 02:02:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5OTQwOTA3MjQyMzAwODgx/largest-convenience-store-in-the-world-opens-in-texas.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News"
    ]
  },
  {
    "id": "5781b114-c16a-4314-84e3-2b2f64738dc8",
    "title": "Jaguar is dead as we know it",
    "link": "https://www.autoblog.com/news/jaguar-is-dead-as-we-know-it",
    "description": "The storied British marque that was once a staple of sports cars and performance sedans is now aiming to move upmarket with a full EV lineup to compete with Bentley.",
    "author": "Gabriel Ionica",
    "published": "Sun, 13 Oct 2024 01:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5OTM3NDkyNzQzMzAwNTYx/jaguar-e-type-60th-anniversary-geneva-drive.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Jaguar",
      "Jaguar"
    ]
  }
]
