[
  {
    "id": "b3fd2d36-b01b-461a-be28-6347d62fb726",
    "title": "23k-Mile 1990 BMW M3",
    "link": "https://bringatrailer.com/listing/1990-bmw-m3-102/",
    "description": "This 1990 BMW M3 was purchased new through BMW’s European Delivery Program, an order that was facilitated by the Canadian Forces Europe Automobile and Miscellaneous Sales Transactions Office, with which the original owner was stationed in Lahr, Germany. It was later imported to the US in 1992 and remained under their care in Texas and Florida until the selling dealer’s purchase in February 2021. Showing 23k miles, the car is finished in Diamond Black Metallic over black Bison leather upholstery and is powered by a 2.3-liter S14B23 inline-four mated to a five-speed manual transmission and a limited-slip differential. Equipment includes 16\" Style 5 wheels, a sunroof, a rear spoiler, fog lights, front sport seats, cruise control, air conditioning, and an onboard computer. This E30 M3 is offered by the selling dealer with service records, sales documentation, manufacturer's literature, a clean Carfax report, and a clean Florida title.",
    "author": "bringatrailer",
    "published": "Wed, 01 Jan 2025 00:40:09 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-9541-21354.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "04995e06-c82a-4ac2-a786-f3661a5c8fb0",
    "title": "No Reserve Experience for Charity: Hispano-Suiza Test Drive, Peralada Resort Stay, \u0026 McLaren Spanish GP Tour",
    "link": "https://bringatrailer.com/listing/2024-petersen-experience/",
    "description": "The Petersen Automotive Museum is offering the winning bidder of this auction a two-night retreat for two in Spain, including a personal tour of the Hispano Suiza factory, a driving experience in the Carmen electric hypercar, and accommodations at the Peralada Resort. The trip will include dining in the Castell Peralada restaurant, a visit to the resort's winery, a round of golf at the resort, and access to the Hispano-Suiza exhibit at Museu de Peralada. The winning bidder and one guest will also receive a behind-the-scenes tour of the McLaren paddock at the 2025 Spanish Grand Prix, where they will have the opportunity to watch the race from the McLaren garage. This interactive experience is now offered at no reserve, and proceeds from the auction, including the BaT buyer’s fee, will be donated to the Petersen Automotive Museum Foundation, a 501(c)(3) non-profit organization dedicated to educating the public about the impact of the automobile on American life and culture.",
    "author": "bringatrailer",
    "published": "Wed, 01 Jan 2025 00:25:10 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/10/Hispano-Experience-19846.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "216a4fc5-26d6-4763-a202-b44aaa774316",
    "title": "Mini’s Forgotten Prototype: The Story of the ACV 30",
    "link": "https://www.bmwblog.com/2024/12/31/mini-acv-30-concept-bmw-rally-heritage/",
    "description": "When car companies consider updating their lineup, there’s usually more than one route they can take. For example, BMW probably had dozens of sketches – maybe even models – of the new 4 Series before... First published by https://www.bmwblog.com",
    "author": "Steven Paul",
    "published": "Tue, 31 Dec 2024 17:26:14 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/12/mini-acv-30-00-830x546.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "MINI",
      "Concepts",
      "MINI ACV 30",
      "prototypes"
    ]
  },
  {
    "id": "a4e96cd3-cab6-403f-b3bf-8f39a8e82128",
    "title": "Here’s Why BMW Won’t Bring the New 1 Series to America",
    "link": "https://www.bmwblog.com/2024/12/30/bmw-1-series-hatchback-not-coming-to-america/",
    "description": "A few months ago, BMW unveiled the second generation of its front-wheel-drive 1 Series hatchback, known internally as the F70. Among the lineup is the range-topping M135i, a sporty and engaging model aimed at enthusiasts.... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Mon, 30 Dec 2024 20:27:42 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/06/2025-VW-Golf-R-44-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "1 Series",
      "1 Series Hatchback",
      "F70",
      "M135"
    ]
  },
  {
    "id": "56031616-1bc1-473c-a4ad-3659b1c70ce8",
    "title": "Editor’s Choice: An alternative Top 10 for 2024",
    "link": "https://www.bikeexif.com/editors-choice-custom-motorcycles-2024",
    "description": "Once I’ve completed the arduous task of poring over our statistics to compile our list of the year’s most popular custom motorcycles, I have the even more onerous task of selecting my personal favorites. Given the caliber of the custom builders that grace these pages, it’s a tall order. Each year’s routine is the same, starting with a ‘short’ list of 30-plus bikes. Once that’s trimmed down to a more palatable size, I eliminate any bikes that have already placed in our ranked Top 10, in the interest of fairness. The remaining candidates are sifted to compile my final selection—which is listed alphabetically, by the builder or workshop’s name. All of the bikes on this list share one trait: they’ve been stuck in my head all year, playing on repeat like mechanical earworms.…",
    "author": "Wesley Reyneke",
    "published": "Mon, 30 Dec 2024 20:01:47 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/12/editors-choice-custom-motorcycles-2024.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Ten Best Motorcycles",
      "Bobber motorcycles",
      "Cafe racers",
      "Chopper motorcycle"
    ]
  },
  {
    "id": "e3d926b4-69f0-4781-a221-a389d1d1c992",
    "title": "Tested: 1962 BMW R27",
    "link": "https://www.bikeexif.com/1962-bmw-r27",
    "description": "The R27 showed up in the stable courtesy of our good friend and artist Christopher Myott. It’s a DeLorean, an underpowered time machine that couldn’t hit 88 mph if my life depended on it. And though the records may show a top speed of 81 mph, I managed to hit 70 and it was reaching. Given that it’s 54 years old and 250 cc, expecting it to do much more than maintain 55 mph is asking a lot, and it did that without complaint. Ultimately, my experience of the bike is more reverence than critique. What it lacks in power and all-around performance, it makes up for with character and charm, which shone through in unexpected ways. Over time, I began to actually appreciate its overtaxed 18 hp single.…",
    "author": "Iron and Air",
    "published": "Sun, 29 Dec 2024 17:00:13 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/12/1962-bmw-r27-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Classic Motorcycles",
      "Featured Bikes",
      "BMW motorcycles",
      "classic"
    ]
  },
  {
    "id": "b198ee6f-79c1-42cb-b23a-a35e878e4dd1",
    "title": "Highlights of 2024: The best things we’ve done with cars this year",
    "link": "https://www.autocar.co.uk/car-news/new-cars/highlights-2024-best-things-we%E2%80%99ve-done-cars-year",
    "description": "We pick our top moments of 2024, including a European road trip, sports car racing and meeting industry stars Working for Autocar absolutely beats a proper job: we all love cars, and somehow we actually get paid to spend our days not just driving them, but talking to the people who created them, visiting the factories they're built in and then writing about them.  That's not to say it isn't hard work, honest. It feels there have never been more cars to drive, more firms to learn about and more complex topics to discuss. Which helps us keep incredibly busy - it's incredibly rare to find the entire team in the office, because a handful of us are always out doing something. But what were the best things we did this year? Tough question: among the motor shows, new car launches and interviews with the industry's top bosses, choosing a single highlight can be a difficult task.  We've tasked the Autocar team to do just that, and 2024's highlights of the year range from a European road trip to Spa to camping in the back of a Hyundai on the top of a Welsh mountain.   What's your motoring highlight of the year? Share your stories with a comment below this article.   Given how much Ariel improved the Atom for its latest iteration, and given how much I liked the original Nomad, you can imagine how much I was looking forward to the Nomad Mk2. Would the good people of Ariel have kept it fun like they did the Atom? Reader, they did, as I found on a crummily surfaced strip during an early fact-finding meeting about the new model, where it would slide benignly and provide huge giggles. It’s not a given that a new car will be more fun than its predecessor these days, but the Nomad 2 is one of those cars that you try and then very quickly makes the previous model feel, well, like a previous model. Getting the chance to show BMW M division engineers Dirk Hacker and Bernd Barbisch around familiar roads in Snowdonia back in July, in a BMW M5 prototype, felt like a special day, I must admit. But not quite as special as the one when I met the Mika Meon, a quite brilliant electric beach buggy designed and built very close to where I live in the Midlands – and, while still pretty new, also completely unknown to me. The Meon has a sense of integrity to it that its creator, Robin Hall, says is the antithesis of most Volkswagen-based buggies. It’s an engineer’s natural reaction, you could say – something properly engineered and executed, to right so many wrongs. That integrity really shines through in every part of the driving experience, but it’s strongest through the car’s uncommonly sophisticated ride and steering, both of which make it a joy to drive on a winding lane, where the electric performance level is likewise supremely well judged. Finding this car nestled in a workshop only 10 minutes from my own front door felt like spotting a £50 note under a flowerpot that you walk past 10 times every day. And I’m sure it won’t be the last time I visit it. The only thing better than doing something you love is doing that something with like-minded mates. I love travelling around Europe and I love motor racing, so driving my closest two friends down to southern Belgium for the Spa 6 Hours in my Renault Clio long-termer this May is something I’ll always remember fondly. Spa-Francorchamps is one of the very best racing circuits on Earth and the World Endurance Championship is serving up the most exciting sports car racing anyone has ever seen, between a greater number of manufacturers than ever before – and yet it’s still so affordable to watch that you feel as if the vendor must have made some mistake. WEC fans proved to be a lovely, passionate bunch too. And this isn’t to mention the fun we had exploring the cities of Lille, Aachen and Eindhoven on the way down and the way back – or indeed driving on roads that were actually maintained, fast and free from queues. Lovely weather, superb settings, fabulous cars and even better company.   When Colonel Hannah Stoy, a seriously impressive high-flier in the British Army, finished sharing her experiences and insights with the audience at this year’s Autocar Great Women event, Stellantis board member Alison Jones then came on stage and joked that her role suddenly didn’t seem quite so important. Such is perspective. Still, Jones’s address to the audience alongside her friend and powerhouse Geraldine Ingham, managing director of Range Rover, proved no less inspirational and thought-provoking. And then there was the cool, calm, collected Formula 3 racer Sophia Flörsch, whose eloquence, fierceness and self-belief were an inspiration to all, the German having come back to racing following one of the most breathtaking crashes I’ve ever witnessed. One of the fundamental messages was that women are still under-represented in the automotive industry. That’s slowly, glacially, changing and this initiative and corresponding event celebrating the most remarkable not only helps address that but also showcases the expertise and warmth of speakers and guests alike, and the camaraderie among them, and that is what makes Great Women so special. I’ve got a little group of friends from around the globe whom I met playing Need for Speed online at the age of 14, and this year we finally met in person for the first time. We went go-karting, took on Snake Pass in a few of our cars – Fiat Panda 100hp, Porsche Cayman and Mazda 3 – and shared in the excitement of all the cool metal that my American and Kiwi mates don’t get back home. And that’s the real power of cars; our shared love connecting us for years despite thousands of miles of ocean separating us all. It’s a memory I’ll treasure for the rest of my life. In a year when I got myself to the Le Mans 24 Hours for the first time, my chosen highlight feels fairly inconsequential. Equally, it may resonate. In the spring, I was holed up in an unmemorable hotel on the cusp of an unmemorable industrial estate 10 miles north of Munich. Feeling a bit melancholic, I went for a walk, simply to get me out of the building, and what should I stumble across but an Iso Grifo casually slung across a pavement and in well-used but apparently tidy condition. They only made 300 of these and I’ve always loved them, mostly for the looks, and for their quirky juxtaposition of Giugiaro styling with Chevy V8 grunt; Bizzarrini did the mechanicals. The thing honestly made my day. It’s not the easiest time to be somebody who loves cars, but unlike with many other passions, the subject matter is everywhere and anywhere, and you never know what gem you might discover next. See also: the straight-piped Carrera GT I was following on the M25 last week – and I could still hear away after it disappeared from view. Volkswagen design boss Andreas Mindt has been likened to Scrappy-Doo for his seemingly infinite levels of energy and enthusiasm. He is simply a joy to be around and thankfully there has been plenty of time for that here at Autocar this year as we named him our Design Hero at the 2024 Autocar Awards off the back of his stellar track record at VW, Bentley and Audi. The very first story of mine that appeared in this magazine in 2024 came as a result of meeting him, when he provided a detailed look around the upcoming VW ID 2, and it’s the first VW since the Golf Mk7 – another Mindt design – that I’ve had a warm feeling about. It looks like a VW in a way the bloated ID 3, ID 4 and ID 5 simply don’t. VW talks relentlessly about becoming a ‘loved brand’ again. Mindt being there and designing the cars makes that aim much easier to achieve. Hopefully, our paths will cross plenty of times again in 2025. This probably says less about the new BMW M5 and more about how I’m just not the target customer, but the part of the M5 launch that I was most excited about beforehand was the promise of driving ‘heritage M5 models’. They did not disappoint – not in the slightest. The V10-powered E60 was the current M5 when my love and obsession really crystallised and I’ve read so much about it. It was everything I could have hoped for. That engine is as spine-tingling as everyone says, the automated-manual SMG gearbox isn’t as bad as some say and it just feels like a really nicely rounded sports saloon today. But the original E28 was the one that I really fell in love with. Just opening the door and taking in the 1980s BMW smell that I remember from the family BMWs growing up had me feeling right at home. Then I discovered that it has all the sweet throttle adjustability of a Toyota GR86, but with super-tactile steering and a motorsport-derived straight six that’s just impossibly zingy for a 3.6. And just look at it. Bucket-list stuff. There’s a thrill to watching an expert at work up close, and this was a demonstration of precision that can only be achieved by an absolute grand master of their form. But then, I suspect the long-time operator of the excavator at the BMW Group Recycling and Dismantling Centre (RDC) has high job satisfaction. The RDC dismantles end-of-life BMW Group test cars, while working out how to ensure future models are designed to be as recyclable as possible. Which is where the excavator, a digger featuring a range of custom-made tool attachments, comes in. Before the car is crushed and shredded (the best way to extract materials), certain valuable bits need to be removed. On a visit to the RDC, I had the chance to witness an i7 being recycled. First, the roof was prised open. Then the interior fittings were ripped out before the body was opened. Finally, with a pair of pincers, the excavator delved into the heart of the car, caught the wiring loom and pulled it out, twirling it round the pincers like spaghetti on a fork until the prize broke free. Every stage was done with surgical precision, a demonstration of utterly exceptional dexterity. It was a genuine privilege to witness. Hyundai marked the launch of the fifth-generation Santa Fe with a unique event, by sending me and other journalists up a Welsh mountain to experience ‘chabak’, the car camping craze from Korea. Thankfully, the seven-seat Santa Fe is one of the largest cars in the UK and the new Mk5 had been set up to serve as the perfect sleeping quarters for a tired car journalist. The views? Stunning. Sleep quality? Actually, not bad. And to top off the experience, the Santa Fe itself was deeply enjoyable to drive and great off road. I had only half an hour before I needed to return the keys, but that was enough for the Porsche 930 Turbo to both scare me silly and render me dumbstruck. This whale-tailed slice of 1970s excess has always stood proud in my psyche as an emblem of automotive nirvana, a motoring icon whose legacy towers over most sports cars conceived in the decades since. Plus, as a firm believer that the best engines are rear-mounted and air-cooled, I’ve always been more reverential of Porsche’s seminal supercar than any contemporary Ferrari or Lamborghini. Clichés be damned: if this wasn’t a meet-your-hero moment, what is? Thankfully, my reverence was undented by the collision between fantasy and reality. The ferocity of its power delivery and the tightness of its chassis belies its 1970s origins, though the slight unpredictability of each was enough to instil in me a new appreciation for the growing proliferation of driver assistance systems… I finally went to Villa d’Este this year. I’ve admired this concorso d’eleganza for years, through print, social media and the ramblings of friends and colleagues. Initially, it was a whirlwind. The grounds are even grander and more impossibly Italian than they look in pictures. The cars, too, were insane. Never has a BMW 507 felt so ineffective at wowing. But, truth be told, I felt a bit out of place. I do not smoke Gran Habanos. I am not a Swiss commodities trader. I am from Peterborough. But just down the road, Villa d’Este spread out, took off its silk Hermes tie and wrapped it firmly around its head. The neighbouring Villa Erba is still extremely posh and home to a display of mesmerising moving pieces of art – including Marcello Gandini’s greatest hits – but there were people eating with improper cutlery. While wearing jeans. And vaping.",
    "author": "",
    "published": "Tue, 31 Dec 2024 08:01:28 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/autocar_highlights_of_the_year.jpg?itok=F7gp6gAG",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "569eb46a-c115-46b4-9aea-4ef93ee18dc4",
    "title": "Our favourite cars of 2024: Porsche 911 S/T",
    "link": "https://www.autocar.co.uk/opinion/new-cars/our-favourite-cars-2024-porsche-911-st",
    "description": "This is what happens when you make the utterly dazzling Porsche 911 GT3 a touch more usable on the road Stop press. Road tester likes special-edition Porsche. I hate to be such a cliché, but Porsche does have a habit of nailing this sort of thing. I’m actually not the biggest Porsche fanboy. With its downforce, extra firm suspension and stripped-out interior, the normal 911 GT3 lacks a bit of approachability for me. But the S/T makes just the right tweaks to the familiar formula to really sing. It still has the spectacular 4.0-litre flat six, and you get to engage with it so much more than in most applications because it has a manual gearbox, and one with shorter ratios at that. They could be shorter still, though at least you can redline it in second without getting up to completely irresponsible speeds. With its short-throw gearchange and super-light flywheel, changing gear is a challenge, but a really enjoyable and satisfying one that you can engage in all the time. Slightly more relaxed suspension mean the S/T really works on the road. Unfortunately, I didn’t get to drive it on the track at the Britain's Best Driver's Car contest because some recall sidelined it, but I bet the S/T’s more road-going character makes it no less fun on the track. Despite wide, grippy tyres, it has a delicious sense of fun. When you get on the power in a corner, it doesn’t exactly oversteer – it just gently yaws through the corner, feeling alive and exciting rather than just locked down and grippy.  Unlike BBDC, this isn’t all about the driving experience (which is wonderful, as we’ve established). The classic Porsche 911 shape is fundamentally a good one, and is at its best unspoiled by too many wings and splitters, as with the S/T. The cabin is spectacular too. The car I drove had the Heritage Design pack with brown leather and fabric. So configured, it has all the modern kit you expect, but blends it with the artifice you want from a special car.  That this sort of experience is now reserved for those who can get their hands on a super-expensive, super-exclusive limited-edition car is frustrating, but that doesn’t make the S/T itself any less exciting.",
    "author": "",
    "published": "Tue, 31 Dec 2024 07:01:28 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/opinion_illya_fave_cars_2024.jpg?itok=kiho3dGg",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Opinion"
    ]
  },
  {
    "id": "73910cc4-f868-4dc0-a05c-a78ba446f9f0",
    "title": "Some Kia Sorento PHEVs Could Catch Fire In A Crash Due To Fuel Line Leak",
    "link": "https://www.carscoops.com/2024/12/some-kia-sorento-phevs-could-catch-fire-in-a-crash-due-to-fuel-line-leak/",
    "description": "Kia discovered an issue with a fuel line while performing crash tests for the 2026MY Sorento",
    "author": "Brad Anderson",
    "published": "Wed, 01 Jan 2025 00:42:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/12/2025-Kia-Sorento-Recall-4-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Kia",
      "Kia Sorento",
      "NHTSA",
      "PHEV",
      "Recalls",
      "Safety",
      "SUV"
    ]
  },
  {
    "id": "2a010e29-b2d8-4d91-931f-af1ee5e3d5db",
    "title": "Ford’s Israeli Website Links To Group Calling For Return Of Hostages By “Any Means Necessary”",
    "link": "https://www.carscoops.com/2024/12/fords-israeli-website-links-to-group-calling-for-return-of-hostages-by-any-means-necessary/",
    "description": "Ford's headache doesn't stop with a compromised X account that called Israel a terrorist state",
    "author": "Michael Gauthier",
    "published": "Tue, 31 Dec 2024 23:56:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/12/Ford-Iserali-Hamas-Carscoops-Edit-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Ford",
      "Israel",
      "Middle East",
      "Offbeat News",
      "Reports",
      "Twitter"
    ]
  },
  {
    "id": "7ca3c7b9-a68b-48ef-a09b-1d60c974a88c",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "3e2972a3-69c9-4ba2-bace-e815a64d88fc",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "304e9d41-16c3-41c3-9d8d-03faedeb0f55",
    "title": "Volkswagen, I’m Begging You To Make An ID Buzz Syncro",
    "link": "https://jalopnik.com/volkswagen-i-m-begging-you-to-make-an-id-buzz-syncro-1851727900",
    "description": "The Volkswagen Bus is part of an elite group of vehicles that are instantly recognizable to almost anyone on Earth. Vehicles like the Bus and the Beetle, and non-VWs like the Ford Mustang, transcend the sphere of car enthusiasts and have found homes in the hearts and minds of all different types of people. Volkswagen’sRead more...",
    "author": "Logan Carter",
    "published": "Tue, 31 Dec 2024 19:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/d8b6c082086e193f280638bd548fe920.png",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "volkswagen",
      "syncro",
      "volkswagen bus",
      "volkswagen type 2",
      "beetle",
      "subaru motor",
      "volkswagen group",
      "ford mustang",
      "minivans",
      "bentley continental gt",
      "volkswagen vehicles",
      "westfalia",
      "cars",
      "rear engine four wheel drive layout",
      "westfalia werke"
    ]
  },
  {
    "id": "5d2f48ce-2673-49c9-bca1-1b8a98eed6db",
    "title": "These Are The Cars That Died In 2024",
    "link": "https://jalopnik.com/these-are-the-cars-that-died-in-2024-1851730052",
    "description": "Dearly beloved, we are gathered here today to say goodbye to the many good, bad and amazing cars that died in 2024. Some, like the Nissan GT-R or the Ram Classic, slipped slowly into old age and died surrounded by friends. Others, like the Audi A4 or Infiniti Q50, were unceremoniously slashed from their lineups over…Read more...",
    "author": "Erin Marquis",
    "published": "Tue, 31 Dec 2024 18:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/d62001a924dd774f292871ad93cea138.png",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "volvo s60",
      "porsche cayenne",
      "mini clubman",
      "new york international auto show",
      "audi a4",
      "r8",
      "mitsubishi mirage",
      "volvo",
      "audi r8",
      "cadillac xt4",
      "nissan gt r",
      "bugatti",
      "ford",
      "quattroporte",
      "audi",
      "infiniti",
      "convertibles",
      "infiniti q50",
      "station wagons",
      "ford escape",
      "maserati",
      "compact executive cars",
      "kamala harris",
      "titan",
      "sports sedans",
      "coupes",
      "world car awards",
      "nissan",
      "henrik fisker",
      "vance",
      "stellantis",
      "infiniti q50 infiniti",
      "edge",
      "human interest",
      "ram"
    ]
  },
  {
    "id": "35da8b61-d7f1-4d73-af5c-f201e7a7aadf",
    "title": "All new mass-market EVs launching in 2025",
    "link": "https://www.autocarindia.com/car-news/all-new-mass-market-evs-launching-in-2025-433998#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The year 2025 will see leading car manufacturers enter the EV space, while some are going to expand their lineup. With the Bharat Mobility Global Expo (BMGE) taking place in January, car buyers will get a taste of how the year will pan out for EVs. Below are listed upcoming 12 SUVs and an MPV that should be on your radar. Hyundai Creta EV The Hyundai Creta EV will be based on its ICE sibling and will rival the Maruti e Vitara. Being based on the regular Creta, it will have a familiar silhouette save for the aerodynamic design elements typical in electric cars. Inside, it will borrow a lot of features from the Alcazar facelift. As for range, expect a maximum of 400 kilometres from a 45kWh battery. Notably, the same cell pack will power the Kia Carens EV. Hyundai will launch the Creta EV on January 17, with prices expected to go from Rs 25 to 35 lakh. Maruti Suzuki e Vitara Maruti’s first EV is the production-spec version of the eVX concept. The e Vitara retains most of the concept’s upright yet angular design and is quite similar on the inside as well. Naturally, some design details, outside and in, have been toned down for the production model.  Expected to launch in March 2025, the Maruti e Vitara will come with two battery pack options. The entry-level version will get a 144hp motor on the front axle, while the battery with the larger variant will have a 174hp motor. The AWD version will get a 65hp rear axle-mounted motor as well, bringing the combined output to 184hp and 300Nm. Maruti is targeting an MIDC range of over 500km for the Hyundai Creta EV, Tata Curvv EV and Mahindra BE 6e rival.  Toyota Urban Cruiser EV Toyota’s version of the Suzuki e Vitara has already been showcased in concept form as the Urban SUV. It will be launched in India towards the end of the year. Styling tweaks and interior themes will help differentiate the two models, though under the skin, the Toyota and Suzuki will be identical. Options will include an AWD version, too. Considering the compact e SUV segment into consideration, a Rs 20 to Rs 30 lakh price bracket is radical. Tata Sierra EV Tata will bring back the Sierra nameplate with the new EV, while petrol and diesel versions will follow soon after; the company used the same format for the launch of the Curvv EV and its petrol and diesel counterparts. The Sierra EV will use the same Acti.EV architecture – essentially Tata’s Gen2 EV platform – used by the Punch EV, Curvv EV and Harrier EV, though the battery and motor specifications are yet to be confirmed. The Sierra EV may also get an AWD setup as an option, with a motor on each axle. Styling will be close to the concept and will feature a large rear glass area that is a visual link to the original Sierra of the 1990s. Tata can launch the electric Sierra either in 2025 or 2026. Tata Harrier EV Having been showcased in near-production form last year, the Harrier EV is expected to go on sale around March 2025. Likely to sport a 60kWh battery, the Harrier EV will offer 500km of range on the MIDC cycle. What will make the Harrier EV unique is that it’ll be Tata’s first all-electric model to sport an AWD setup, with an electric motor on each axle. In fact, it’ll be the first Tata – in five years – with power going to all four wheels. Distinguishing the Harrier EV from its ICE counterpart is a closed-off grille, new front and rear bumpers, and new alloy wheels.  The interior has yet to be seen officially, but we expect loads to be shared with the Harrier diesel, and some elements from the Curvv EV. Tata has confirmed that like the other models based on the Acti.EV platform, the Harrier EV will have vehicle-to-load (V2L) and vehicle-to-vehicle (V2V) charging capacities, and we expect it to get a flat floor as well. Mahindra XUV 3XO EV Essentially the XUV400 EV with a 200mm shorter rear overhang, the all-electric version of the XUV 3XO is likely to share the same styling as the compact SUV, besides EV-specific changes. Sources tell us that it’ll come with a smaller 35kWh battery pack than the XUV400 to better position it against the Tata Nexon EV. Mahindra will launch the electric vehicle at a premium over the standard 3XO mostly by July 2025. Mahindra BE 6e (prices of all variants) We have reported extensively on the Mahindra BE 6e SUV launched in November. The car has a concept-inspired design which may look radical. As for output figures, they are 281hp and 380Nm with a 0-100kph time of 6.7 seconds. Two batteries of 59kWh and 79kWh will be on offer and the ARAI range ranges between 556km and 682km. Mahindra has revealed only the range-starting BE 6e’s price - Rs 18.90 lakh - and is set to release the entire price list next month. Deliveries are to commence from February-end. Mahindra XEV 7e The standard SUV version of the XEV 9e, without the raked roofline and with a third row of seats, is expected to arrive later in the year. The 7e will likely share all of its features, safety kit, tech, battery and powertrain options – among other bits – with the 9e. Expect similar range and performance figures, too. The all-electric three-row SUV will rival the Tata Harrier EV. We expect the car to arrive by late 2025. Mahindra XEV 9e (prices of all variants) The larger Mahindra XEV 9e coupé-SUV shares its platform, battery and powertrain options with the BE 6e, and is correspondingly marginally slower and less frugal on a single charge. On the other hand, cabin and luggage space is greater than the smaller BE, and it gets more tech like a passenger-side infotainment screen. Prices start at Rs 21.90 lakh, while the complete rate list will be revealed at the BMGE 2025, and deliveries will begin at the end of February. Considering its price point and size, the BYD Atto 3 is currently the XEV 9e’s closest rival.  Kia Carens EV The all-electric MPV will share its design with the upcoming Carens facelift, albeit with EV-specific changes like aero-optimised wheels and a closed-off grille area. Its powertrain and battery setup are expected to be shared with the Creta EV seeing as they share the same platform, among other mechanical components, as stated before. India debut of the electric Carens may happen towards the end of 2025 Kia Syros EV  Not much is known yet about the all-electric version of the Syros other than the fact that it will only be available in front-wheel drive format. It’s expected to go on sale about six months after the ICE versions that will be showcased at the Bharat Mobility Global Expo in January. As for rates, Kia could price it from 15 lakh onwards. BYD midsize e SUV While not much is known, BYD is planning to launch a new SUV that will rival the Tata Curvv EV, Hyundai Creta EV, Mahindra BE 6e and the Maruti e Vitara. BYD recently filed patents for two SUVs - Bao 3 and Denza N9 - both of which are a segment above and not to be confused with the aforementioned. The Chinese brand may showcase the SUV at the Bharat Mobility Global Expo. Launch may happen in the second half of 2025, around when its specifications will become clear. Citroen Aircross EV The French brand’s next EV is likely to be the electric version of the Aircross. Considering the 5+2 seat SUV shares its platform with the C3 hatchback, which has an all-electric derivative, an electric version of the Aircross is only logical. However, the eC3 uses a 29.2kWh battery and a 57hp electric motor, and Citroën may opt for a bigger battery and motor here. Expected pricing and launch timeline are Rs 18 lakh and H2 2025, respectively. Citroen Basalt EV With the Basalt-based EV, Citroen will enter the soon-to-be crowded all-electric midsize SUV space, taking on the Curvv EV, BE 6e, and the bevy of new models. It’ll likely share its powertrain and battery pack with the Aircross EV, seeing as it is also built on the same platform, which can accommodate both internal combustion and electric powertrains. Additionally, the Basalt EV’s pricing will hover around the Aircross EV’s and the two may launch together. Also, see: New car and SUV launches in January 2025 New Hyundai cars and SUVs launching in 2025",
    "author": "Uday singh",
    "published": "Tue, 31 Dec 2024 17:20:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241231053848_Budget EVs 2025.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "72bd6566-9bf9-4db5-ba68-6ca7c6468c6a",
    "title": "Royal Enfield Himalayan 750 spied testing; launch expected",
    "link": "https://www.autocarindia.com/bike-news/royal-enfield-himalayan-750-spied-testing-launch-expected-433996#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Royal Enfield’s highly anticipated Himalayan 750 has been spotted testing in Southern Europe, giving us a first look at the brand’s upcoming flagship adventure tourer.  The Himalayan 750 test mule appears to be equipped with a new engine  It has a mono-shock at the rear and a dual disc brake setup at the front Royal Enfield Himalayan 750 details The latest spy shots show a test mule fitted with additional sensors, indicating ongoing engineering and durability testing. This Himalayan appears to be equipped with a new engine, and Royal Enfield will likely use the more powerful motor on what will be its biggest and largest motorcycle to date. While the production model’s final specs are yet to be confirmed, the mule appears closer to production-ready, providing a look at the design as well as some features that are likely to make it to the final version.   The Himalayan 750 will likely be built on a brand-new platform that won’t be shared with Royal Enfield’s current 650cc line-up, including the Interceptor 650, Continental GT 650, Super Meteor 650, and Shotgun 650. It will be powered by a brand-new motor that will produce more power and torque than the existing 648cc twin-cylinder engine, which makes 47hp and 52Nm. This motor is likely to debut in the next-gen Interceptor and Continental GT, which have both been spied testing. Notably, the test motorcycle features a fully adjustable inverted fork at the front and a mono-shock at the rear. It has a different semi-fairing, which helps to distinguish the larger Himalayan from its single-cylinder counterpart. The larger Himalayan is also expected to receive an updated TFT, which seems to be a rectangular unit compared to the current circular display. Additionally, it will also get all-LED lighting, with a similar headlight and tail-light unit featured in the outgoing Royal Enfield Himalayan. The spied motorcycle also sports a new braking system with twin front discs and Bybre-branded callipers. The Himalayan 750 appears to be equipped with a 19-inch front wheel and a 17-inch rear wheel, both featuring wire spokes. It remains to be seen if Royal Enfield will equip the bike with tubeless wheels as standard.   The Himalayan 750 launch is still some time away, although we may see the first bikes with this new, larger engine make their debut later in 2025. Currently, Royal Enfield’s adventure line-up comprises only the Himalayan 450, which costs Rs 2.98 lakh (ex-showroom, Chennai). Image source Also see: Royal Enfield Guerrilla 450 review: On the offensive",
    "author": "Autocar India News Desk",
    "published": "Tue, 31 Dec 2024 14:49:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241231024749_RE Himalayan Spy Shots Collage.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "da46c666-54cf-49bd-b475-b107bb3c1f7d",
    "title": "New Cars That Lose in a Head-to-Head Sprint with Their Predecessors",
    "link": "https://www.caranddriver.com/news/a63162517/new-generation-cars-slower-0-60-acceleration-tested/",
    "description": "New generations usually introduce quicker models, but not always. These are the ones we've tested that are now slower to 60 mph than before.",
    "author": "",
    "published": "Tue, 31 Dec 2024 19:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "69492318-1745-4886-bc7f-1e418aeca263",
    "title": "View Photos of the 1976 Chevrolet C-10 Scottsdale Stepside",
    "link": "https://www.caranddriver.com/photos/g63306413/1976-chevrolet-c-10-scottsdale-stepside-archive-drive-gallery/",
    "description": "1976 Chevrolet C-10 Scottsdale Stepside exterior and interior photos.",
    "author": "",
    "published": "Tue, 31 Dec 2024 18:17:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "7fb10889-02a3-4b18-83d6-56787efd9345",
    "title": "Goodwood After Dark, Porsche Perfection, \u0026 The NFS BMW M3 GTR: Mario Christou’s 2024 Highlights",
    "link": "https://www.speedhunters.com/2024/12/mario-christou-2024-highlights/",
    "description": "MC: Phew, we’ve made it to the end. What a year 2024 was, eh? This may have been my favourite year of hunting speed so far, and it’s been a true pleasure to document car culture for you all. From the looks of our social media engagement, I’d say you’ve enjoyed the ride just as […] The post Goodwood After Dark, Porsche Perfection, \u0026 The NFS BMW M3 GTR: Mario Christou’s 2024 Highlights appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Tue, 31 Dec 2024 17:00:21 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "2024",
      "2024 Highlights",
      "Mario Christou",
      "Speedhunters"
    ]
  },
  {
    "id": "66ab39e0-9c60-4611-b94a-fb6509ec837b",
    "title": "Tommykaira, A Porsche 912 Police Car \u0026 A Rare RE Amemiya-Kitted RX-7: Toby Thyer’s 2024 Highlights",
    "link": "https://www.speedhunters.com/2024/12/toby-thyer-2024-highlights/",
    "description": "TT: 2024 has been a great year for Speedhunting, packed with unforgettable cars and moments, making it tough to pick just three to highlight. From Datsun mini trucks to a wide-body E24, a GT-R-bodied kei car, and the wild, animalistic energy of Retro Havoc, it’s been a whirlwind. Porsches, WRC legends, and the Mid Night […] The post Tommykaira, A Porsche 912 Police Car \u0026 A Rare RE Amemiya-Kitted RX-7: Toby Thyer’s 2024 Highlights appeared first on Speedhunters.",
    "author": "Toby Thyer",
    "published": "Mon, 30 Dec 2024 17:00:23 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "2024",
      "2024 Highlight",
      "japan",
      "speedhunting",
      "Toby Thyer"
    ]
  },
  {
    "id": "6b0a8fc2-245c-4c85-9fc1-259c9eb6cbcb",
    "title": "Building legends from legends: The story of Kaffeemaschine Motorcycles",
    "link": "",
    "description": "It’s not often that you get the opportunity to turn a passion project into a full-time business but should that chance arise, grab it by the horns and don’t let go. Such is the story of Axel Budde from Kaffeemaschine Motorcycles. “I started motorcycling on a BMW when I was 18 in 1994. I actually fancied old English motorcycles, but couldn´t afford them,” Axel said. “When I was 20 I was looking for a bigger classic motorcycle, but nothing was really satisfying. The BMW engine just didn´t speak to me, the English bikes were a bit too small, and 4 cylinders did not appeal to me aesthetically.” That’s when a finely aged Italian came into his life, bringing with it the sense of fulfillment he'd been longing for all those years. Continue...",
    "author": "",
    "published": "Sat, 28 Dec 2024 04:00:39 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/12/27082638/image31-e1735319921448.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "db40d17a-c619-4680-aa9f-26eab767ba06",
    "title": "The uncommon art of automotive candles",
    "link": "",
    "description": "Automotive-themed accessories and trinkets come in all forms and sizes. From Miata slippers to Honda tachometer watches to Corvette beds, we've seen it all— that is, except for car-shaped candles. That was until Pandu Rahadya from Parking Lot Hunter enlightened us through an email. Continue...",
    "author": "",
    "published": "Mon, 23 Dec 2024 22:27:50 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/12/23061336/image1-1.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "6ba4e02a-d5d8-4c52-966a-49d12d1e1f36",
    "title": "Housekeeping: Happy New Year 2025!",
    "link": "https://www.thetruthaboutcars.com/cars/housekeeping/housekeeping-happy-new-year-2025-44511091?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "It's New Year's Eve and we're shutting 'er down early.",
    "author": "Tim Healey",
    "published": "Tue, 31 Dec 2024 20:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/31/13351/housekeeping-happy-new-year-2025.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Housekeeping"
    ]
  },
  {
    "id": "1a193ddb-0372-404b-ab08-efd7728d3780",
    "title": "QOTD: What's Your 2025 Automotive Wishlist?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-what-s-your-2025-automotive-wishlist-44511088?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "We're once again rolling into a new year. What is on your automotive wish list for 2025?",
    "author": "Tim Healey",
    "published": "Tue, 31 Dec 2024 19:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/31/13251/qotd-what-s-your-2025-automotive-wishlist.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "8cd32201-ac9c-48a2-9736-f46b472687c8",
    "title": "Ampere Nexus ST road test, review",
    "link": "https://www.autocarindia.com/bike-reviews/ampere-nexus-st-road-test-review-433876#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "The Ampere Nexus is currently the most premium offering by the brand and has been designed and developed in India. It exists in an extremely competitive space, where it is up against not only legacy OEMs but also established electric vehicle startups. The big question is: Does this new kid on the block have the credentials to hold its own against the rivals? Well, here’s what we discovered. The Nexus is a handsome-looking scooter finished in this shade of Zanskar Aqua. Not only is it bright and eye-catching but it also has a beautiful pearlescent finish under direct sunlight. Its design cues are subtle and tastefully done, and its overall build quality is decent. A deep cubby that’s usable, but the plastic surrounding it is quite sharp. There is a deep storage compartment located under the handlebar, but the shape is odd, and the plastics have a sharp edge, which feels built to a cost. The boot can swallow up most half-face helmets but will struggle with a full-face one, especially with its bulky charger inside. A deep cubby that’s usable, but the plastic surrounding it is quite sharp. In terms of features, the Nexus gets an LED headlight that performs very well and a bright and legible 7-inch TFT display. However, the display isn’t very smooth and, at times, had a delayed response to my touch inputs. The UI could be nicer, and it is also a little harder to use with gloves. 7-inch TFT is legible even under direct sunlight but needs a better UI. While the piano black switchgear looks premium, with its tightly packed buttons, it demands Blackberry levels of muscle memory to use.  Its tightly packed buttons demand muscle memory to use. The charging socket is located near the footboard and looks like a bit of an afterthought. Even the charger looks rather simple and not as well-designed as offerings from its rivals. Unplugging the charger involves pressing two release buttons simultaneously, which can get a little tedious. The charging socket doesn’t look as premium as the rest of the scooter. Despite its simplistic design, this charger is capable of juicing up the Nexus in around four hours. However, a bigger issue is the time it takes for the Nexus to boot up right after charging, which can sometimes take as much as five minutes in my experience. That is something that needs to improve. Overall, while this is a premium scooter, it could do with better attention to detail and finish. Ampere’s Nexus delivers a comfortable and nimble riding experience, making it well-suited for urban commuting. Darting through traffic was an easy affair, and the suspension made little work of any unexpected bumps. I’ve also received good feedback from those pillion riders. The suspension irons out most bumps with ease as long as the speeds are low. With a telescopic fork and twin rear shocks, the overall setup is well-controlled and leaves very little to complain about. Handling is good, and it is only on hard impacts at higher speeds where the scooter will generate an occasional hard thud. All in all, this scooter does a commendable job of striking a good balance between ride and handling. The Nexus features three riding modes: Eco, City and Power. The throttle response is smooth across all modes, ensuring a predictable ride without jerky acceleration. However, it is a bit too dull and reserved up to about 25kph even in City and Power modes. In my experience, these two modes struck a good balance, and I’d often oscillate between them on my commutes. On the other hand, Eco mode is very slow and is best reserved for extreme bumper-to-bumper traffic or to get home on a low battery. For reference, in Eco mode, the Nexus takes over 12 seconds to reach 40kph, whereas the TVS iQube takes a mere 4.63 seconds to do the same. In our tests, the Nexus performed adequately, with a 0-60kph time of 12.98 seconds in Power mode, which makes it one of the slower scooters in its segment. It features a 3kWh LFP battery and sports a peak motor output of 4kW. The Nexus has a certified range of 136km, but in our tests, we managed to extract just under 100km, which is around 10 percent lower than similarly priced rivals with similarly sized batteries. Zanskar Aqua is by far my favourite shade on the Nexus. In City and Power modes, you can expect a range of about 50km to 70km, respectively. Once the battery drops to 10 percent, the Nexus goes into limp mode, which severely limits performance. The Nexus’ braking performance is decent, and the combi braking system works well. However, the brakes require a firm pull and could do with better feedback. In our tests, the Nexus managed to come to a halt from 60kph in 22.04m. For reference, the popular TVS iQube managed to do the same in just 19.71m. The Nexus is a comfortable and endearing electric scooter, but it has areas that need improvement. Ampere’s Nexus is clearly the best-made and most premium offering by the brand yet, but it still has some catching up to do compared to its rivals. The Nexus’ LED headlight provides excellent illumination. The Nexus’ excellent ride quality, comfort and practicality work in its favour and give it a slight edge over its competitors. However, it still needs work on its overall finish and the end-user experience to meet what people have come to expect at this price point. If comfort is all you seek, then the Nexus could be the one for you, but buyers looking for a more polished experience will find other alternatives. Also see: Ather Rizta review: Still want that iQube or Activa?",
    "author": "Gavin Rodrigues",
    "published": "Mon, 23 Dec 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241219021439_3.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "7e0b4a0a-d552-416f-a1c4-311a2f8e7b81",
    "title": "Triumph Speed T4 road test, review",
    "link": "https://www.autocarindia.com/bike-reviews/triumph-speed-t4-road-test-review-433878#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Triumph’s Speed T4 stands as the most affordable product from the British manufacturer and undercuts the relatively affordable Speed 400. This iteration arrives just a year after introducing the Bajaj-Triumph 400 platform, owing to its origins as a development-stage variant. It does beg the question if one should consider the Speed T4 over the Speed 400, given that they’re separated by less than Rs 25,000. Surprisingly, I’ve come to prefer the Speed T4 in a lot of ways. While the overall silhouette remains the same, very little of the design has changed, and it would be hard to tell the two apart at a glance. The easiest giveaways are the graphics and front fork, which is now telescopic and not finished in gold.  Unique graphics for the T4, but could use more vibrant colours. Furthermore, the handlebar, headlamp mount, and footpeg holders aren’t made of aluminium; instead, they are made of steel. Triumph has also excluded the Speed’s adjustable levers and engine immobiliser. A legible speedo with an illegible, tedious-to-read rev counter. You do get the same semi-analogue speedo and switchgear, but you miss out on features like ride-by-wire and traction control. While overall quality levels are good, it lacks some of the higher-quality parts found on the Speed 400. Regardless, the Speed T4 is a handsome-looking motorcycle despite appearing slightly less premium in comparison.    The T4 offers an upright and comfortable riding posture, making it well-suited for city commutes. However, a noticeable increase in seat height due to different tyres may make it less accessible for riders under 5’8”. The seat is now narrower but still well-cushioned and supportive. Triumph has addressed this by narrowing the seat near the tank, aiding shorter riders in flat-footing the bike. However, it comes at the cost of comfort to some degree, and one will notice the lower levels of support on longer journeys.   To keep costs in check, Triumph has downgraded the T4’s suspension from a USD fork to a telescopic fork, along with cost-effective MRF bias-ply tyres. Given the more relaxed nature of the bike, neither come across as noticeably poor compromises. The tyres are good enough, and the suspension feels comfortable in most circumstances, although hard hits in bigger potholes do make the suspension feel a bit soft. The T4 is agile, but it’s not a bike you buy for aggressive riding. Heavier-set riders will benefit from adding some preload at the rear. Interestingly, Triumph says it has reworked the steering geometry and tuned the suspension to mimic the Speed 400’s ride dynamics. The T4 retains nimbleness despite a longer wheelbase, making it well-suited for relaxed urban riding. The overall setup is satisfactory for its intended audience. Taller tyres perform quite well but increase the overall seat height. Triumph has moved to an axial caliper and organic brake pads, which are more affordable but, in our test, can perform on par with the Speed 400’s braking performance. My issue is not with the braking performance, but instead with the lack of bite and feedback from these brakes.   At its heart, the Speed T4 retains the 398cc engine from the Speed 400 but with notable changes. Power has dropped from 40hp to 31hp, accompanied by a slight reduction in torque to 36Nm. Punchy motor has a wide torque band and is quite efficient. Key changes include a smaller throttle body, revised camshafts, a redesigned airbox, and a 31 percent increase in crank inertia. While this may sound disappointing on paper, the Speed T4 was less than 2 seconds slower in our tests than the Speed 400. More importantly, the in-gear acceleration figures were only milliseconds apart, owing to the wider spread of torque. The T4’s motor may not be as quick-revving as the Speed 400, but it impresses with its more relaxed, torque-rich riding experience. Bassy exhaust sounds great but could use a better-looking finish. It’s in the concrete jungle where the engine’s mellow nature shines. The wide torque band and smoother throttle allow for effortless manoeuvrability, with the sixth gear comfortably holding as low as 60kph. The overall experience feels smoother, the exhaust sounds bassy, and this comes a lot closer to what you’d come to expect from a modern classic. Fuel efficiency, too, has gone up, and in our test, the T4 managed to get about 38kpl on the highway and 32kpl in the city, which would put it on par with some of its rivals. By the end of my time with the T4, I found myself preferring its motor over the more expensive Speed 400.   The Speed T4 is a lovely machine that perfectly embodies the modern classic experience on a budget. It might lack some of the Speed 400’s premium features and outright performance, but it offers a more subdued, approachable and cost-effective alternative. Good looking headlamp that offers adequate levels of illumination. Its relaxed engine, refined throttle response, and urban-friendly demeanour make it a compelling choice, especially for those prioritising ease-of-use over raw performance. While the Speed 400 presents even better value, the Speed T4 is quite a different proposition, and its relaxed nature makes it quite an appealing alternative as well as a good rival to the likes of  Hero’s Mavrick 440 or even the Royal Enfield Classic 350. Also see: Triumph Speed 400 review: Bharatiya-British brilliance",
    "author": "Gavin Rodrigues",
    "published": "Sat, 21 Dec 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241219014326_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "687c3ec9-ff24-4dd9-a039-832b59a8862b",
    "title": "Meet the T.33S: A purist's supercar with an 11,100 rpm V12",
    "link": "https://www.autoblog.com/news/meet-the-t-33s-a-purists-supercar-with-an-11100-rpm-v12",
    "description": "The upcoming T.33S will take the powertrain of the standard T.33 and make it even rowdier.",
    "author": "Gabriel Ionica",
    "published": "Wed, 01 Jan 2025 00:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjExNzc3MzQ2NDA1OTM0NjI3/gordon-murray-automotive-t33.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "T.33",
      "Gordon Murray Automotive T.33S",
      "Gordon Murray Automotive",
      "Gordon Murray Automotive",
      "Gordon Murray Automotive T.33",
      "News",
      "2025",
      "T.33S"
    ]
  },
  {
    "id": "15f1fcef-e988-466e-b799-18043ae3ab53",
    "title": "Honda CEO struggles to justify a merger with Nissan",
    "link": "https://www.autoblog.com/news/honda-ceo-struggles-to-justify-a-merger-with-nissan",
    "description": "Honda’s CEO struggles to explain why the merger is happening, analysts remain skeptical, and Foxconn waits in the wings.",
    "author": "Elijah Nicholson-Messmer",
    "published": "Tue, 31 Dec 2024 20:58:53 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjExNjA4NTgwNzY2MzEyNDI0/honda-nissan-mitsubishi-execs-at-press-conference---december-2024.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Mitsubishi",
      "Mitsubishi",
      "Nissan",
      "Nissan",
      "honda",
      "Honda",
      "merger",
      "News"
    ]
  },
  {
    "id": "144b50ed-2da1-4891-bbaa-1d697cff0c1d",
    "title": "2024 Audi RS Q8 review: Identity crisis",
    "link": "https://www.autocarindia.com/car-reviews/2024-audi-rs-q8-review-identity-crisis-433976#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Beating a Porsche on the legendary Nürburgring is no mean feat, especially when the Porsche in question is the Cayenne Turbo GT Coupé. But the 2025 Audi RS Q8 Performance did just that. A full-size SUV with 640hp and enough tech for an Engineering Explained video, the RS Q8 Performance might look like a standard Q8 with some blacked-out bits, but that’s the kind of thought that will have you gasping at its performance. We had it for a whole day on a race track and in the Spanish countryside to see what all is new and how much of a difference it has made. 2024 Audi RS Q8 exterior design  On the face of it, the RS Q8 Performance continues with stern expressions and almost no emotion. There is no smiling grille or angry air vents; it’s sleek, sharp and means business. What’s new over the older version are the LED Matrix headlamps with multiple daytime running lights (DRLs) options and a re-profiled grille finished in gloss black with a 3D honeycomb pattern. Wrapped around the grille is a massive carbon-fibre frame, and there’s more carbon fibre on the front lip and air vents. LED Matrix headlamps are standard. The bumpers are sportier and more aggressive than before, and what’s really nice to see is that there isn’t an ounce of chrome to be seen anywhere on the car. Over to the side, the optional 23-inch wheels look stunning (22-inch come as standard), and these help shave 20kg off the total SUV’s weight. Hidden behind these large rims are massive 420mm carbon-ceramic brake discs (standard on the Performance version) with red brake calipers. Carbon fibre on the outside rearview mirrors finishes off the changes at the side. OLED tail-lamps get customisable DRL designs. At the rear, the RS Q8 Performance gets OLED tail-lamps conjoined by an LED light bar, some more honeycomb pattern on the bumper, and a gloss-black diffuser with carbon-fibre surrounds for the oval exhaust tips. Dramatic is not something you’d call the RS Q8 Performance, despite its many oversized bits and plenty of carbon-fibre trimmings (courtesy of the optional Carbon Pack). It’s the perfect look for the introverted car guy, especially in the subtle Satellite Silver paint shade. 2024 Audi RS Q8 interior and features  On the inside, the introversion is even more pronounced as there is little that will ‘wow’ you. As standard, the Performance version gets the Sport Seats Plus; these seats offer lots of bolstering and are also very comfy for long drives. And there is the same honeycomb pattern with Race-Tex and all-black upholstery. But barring all that, it’s all very simple – very high-quality, but nothing that will make it look fast while stationary. Even the steering, which was a chunky flat-bottom one on the previous car, is now a simple round unit. The racy one has been tucked away in the options list. However, you can choose between red, blue or grey for the upholstery contrast stitching. For anything more, like maybe a panoramic sunroof, you’d have to start ticking the options list. Its interior oozes quality but lacks the drama you’d expect from a 640hp super SUV. The centre console features the all-too-familiar dual-screen layout, and apart from the RS modes and drive settings, it’s all very simple and straightforward. At the rear, the RS Q8 Performance has enough space for three adults, and there’s four-zone climate control with electric sun blinds for added comfort. But would you want to be chauffeured in a 640hp super SUV? I think not. 2024 Audi RS Q8 performance  Performance is literally this RS Q8’s name, and it is truly mind-boggling. Sure, it has beaten the Cayenne around the Nürburgring, but what does that mean? Is it fun? Or is it a weapon to be wielded only in the hands of a professional test driver? To find out, we did a few laps around the Parcmotor Castelloli in Spain, and a few laps is all it took to showcase why and how this is the fastest SUV around the Nürburgring. Powering the RS Q8 Performance is a 4.0-litre, twin-turbo V8, as before, but it now makes 40hp more, bringing it to 640, while max torque is 850Nm. The 0-100kph sprint takes an astounding 3.6 seconds, and the SUV can haul all the way to the good side of 305kph. The increase in power is the result of the catalytic converter’s repositioning, which, in turn, has reduced exhaust back pressure. The turbo boost pressures are also higher now, and the end result is an engine with virtually no lag. To add to this instant boost is a 48V mild-hybrid system that lends a hand during acceleration, which means no matter how tight the corner, you can exit it with all the brute force available. The real star is the nimble chassis. The 8-speed Tiptronic gearbox is rapid, too, but select Dynamic Plus or any of the RS modes, and it shifts with lightning-fast speeds. The paddle shifters are also quite responsive, and in manual mode, you can have total control of the shifts. On straightways, the acceleration is a blur, and given the SUV’s driving position, it’s hard to believe that you can be seated this high up and travel this fast. The sense of speed is immense, and the engine sounds terrific at full pitch. Audi has a reputation for making silent cars, but in this, it actually removed some of the sound insulation so you can hear even more of the engine noise on the inside! After all those e-trons, this sure comes as a welcome change. Out on the public roads, however, the engine changes character in a flash. Swap from the Dynamic or RS mode to Comfort mode, and it puts the leash and muzzle on the engine instantly. You can amble through town without being noticed and in comfort. The engine has a soft burble, which only amplifies post 4,000rpm and, of course, through tunnels. The ease of driving it as a daily driver takes you by surprise, especially if you’ve been hooning it around a racetrack an hour ago. 2024 Audi RS Q8 ride and handling  Speaking of hooning around a racetrack, pin-point handling is not something you expect from an SUV the size of the RS Q8 Performance. Yet, thanks to all the wizardry under the skin, it corners like it has an identity crisis. It refuses to acknowledge it is an SUV; instead, it identifies as a hot hatch. Many things are at play here – active roll stabilisation, all-wheel steering, Adaptive Air Suspension Sport and the new Quattro Sport differential – words you’d find in engineering textbooks but with the effect you’d find in comic books. The RS Q8 Performance holds the lap record on the Nürburgring for the fastest production SUV. The RS Q8 Performance corners with absolutely no body roll or understeer, and despite the power and torque available on tap, it always has the grip to save you. A lap record definitely needs precision, which the RS Q8 has, but even for mortals with not even a fraction of the pro talent, it is very hard to look bad on the track. The power split is 40-60 as standard, but in case of slippage, it can send up to 70 percent power up ahead and 85 percent to the rear wheels. Then, there is the electromechanical active stabilisation, which is basically a motor between two halves of the anti-roll bar. On long, straight highways, the two halves are disconnected, which reduces pitching and vertical movements, but as soon as you get to the corners, they link up and twist the bar in the opposite direction to the turn, thereby reducing roll and keeping the car as level as possible. It sounds complicated, but when you notice the steering is on full lock and you haven’t keeled over in your seat, it makes sense. Ride comfort with large 23-inch wheels is surprisingly good. Ride comfort is also surprisingly good, given the weight and, more importantly, the large 23-inch rims with low-profile tyres. The adaptive air suspension is compliant in Comfort mode and tries its best on broken patches, but for Indian conditions, the 22-inch ones will undoubtedly be more comfortable. 2024 Audi RS Q8 verdict and India launch details  Audi has not confirmed the RS Q8 Performance for India as of now, but given the strong response to the older version, it is likely to make it back to home soil in 2025. Prices would be slightly higher than the outgoing version, but you can expect it to be extremely competitive against its arch-rivals, the Lamborghini Urus S and Porsche Cayenne Turbo GT. As a performance SUV, the RS Q8 ticks all the boxes. It is large, mighty fast and loud enough to shake up the mountains, and best of all, incredible to handle, too. It does not have the flash of a supercar or super SUV, but not everyone wants that kind of attention all the time. For those who love the concept of a ‘sleeper’ or discreet performance, this is what you should get your hands on – enough space and comfort to drop the kids off to school or do an airport run and enough power to never be late. Also See: 2025 Audi RS Q8 Performance video review",
    "author": "Jay Patil",
    "published": "Sun, 29 Dec 2024 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241228011241_6 _39_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "a55cef13-7ddc-4974-996e-eeeb9b650814",
    "title": "2024 Hyundai Creta long term review, 8,820km report",
    "link": "https://www.autocarindia.com/car-long-termer/2024-hyundai-creta-long-term-review-8820km-report-433907#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "From “The Perfect SUV” to “Undisputed. Ultimate.” The Creta’s positioning statements might seem pompous, but based on its stellar sales performance, Hyundai has every right to boast. Competitors have come and gone, yet the Creta continues to stand tall with demand growing from strength to strength. A lot has been documented in our reviews and comparisons on the good and not-so-good bits of the Creta 1.5 Petrol IVT. So, in this long-term report, I’ll keep the focus on my Mumbai-Goa-Mumbai drive experience, a round trip of about 1,200km. I started my journey at the break of dawn, and the fastest route suggested by the Creta’s on-board maps was NH66, commonly known as the “old Mumbai-Goa highway”. I had forgotten to carry my phone charger, and because the Creta lacked wireless smartphone integration, I had to rely on its in-built navigation throughout. I must say I was pleasantly surprised with its accuracy and the detailed guidance it provided. I particularly appreciated it when it clearly suggested whether I had to climb onto a flyover or go from below. How did I manage to charge my phone? Well, its wireless charger had me covered.  On-board maps are surprisingly accurate and even get detailed guidance. With light traffic and some newly laid roads, I managed to keep the average speed high. However, the default ‘City’ mode felt a bit inadequate, especially on the winding uphill sections. Sport mode added more pep, with a sharper throttle response and the IVT gearbox keeping the engine spinning in a higher rev band. I must add that the engine doesn’t enjoy being driven hard, as it feels out of its comfort zone and sounds strained, though it does the job asked of it. What I didn’t like was that in Sport, even the steering weight increases, which didn’t add any more feel but only added to the effort required. Also, keeping the transmission in ‘S’ mode wasn’t ideal, as it spun the engine closer to its redline, thus making it sound very boomy. Hence, my ideal setting on a highway drive is to keep the gearbox in ‘D’ and drive mode in ‘Sport’, heavy steering notwithstanding. The SUV’s high-speed stability is good, and handling is predictable, but it rolls a fair bit; hence, sporty it isn’t. And over wavy surfaces, you can experience vertical movements more than in its Volkswagen or Skoda rivals. While the ride quality is generally good at low speeds, it hits sharp potholes in a rather jarring manner. Sharp potholes come through in a rather jarring manner. What’s the fuel efficiency it achieved? With empty roads, Sport mode and an enthusiastic style of driving, the Creta returned a little over 9kpl. On the positive side, I reached Goa in just 9.5 hours, which included an hour’s worth of stops to refuel the car and myself. However, for my return, I left closer to noon – a bad, bad decision. The journey on the NH66 felt starkly different in terms of traffic, and all the diversions I had sailed past on my way to Goa were suddenly clogged and seemed never-ending. As a result, average speeds were much lower. Over the course of this journey, I got a chance to experience some other bits in more detail. For example, the Bose sound system is good, but I think Mahindra’s Sony, MG’s Infinity and Tata’s Harman speakers are noticeably better. Also, its rear speakers are noticeably softer, so the audio experience at the back is quite poor. A sliding armrest is missing in an otherwise well-equipped car. The Creta’s lane assist works in an unobtrusive manner, giving you gentle feedback to stick to the centre of clearly marked lanes. Adaptive cruise control (ACC) works the smoothest when the distance between your vehicle and the one in front is set to maximum. However, once the vehicle ahead slows down and picks up speed, the Creta accelerates automatically to its preset speed very slowly. The auto high beam assist worked like a charm, dipping the high beam upon detecting vehicles ahead. I wish the throw of its LED headlamps (in low beam) was better. Finally, for a car that’s ergonomically spot on, the non-adjustable armrest felt like a glaring oversight on Hyundai’s part. I would have preferred a sliding unit. The journey to Mumbai was nearly 2.5 hours slower, but with a mix of City and Sport drive modes and much lower average speeds (52kph), the Creta’s fuel efficiency was around 12.5kpl.  Powered, ventilated driver’s seat is comfy for long drives. My highway drive reiterates that the Creta petrol IVT isn’t an enthusiast’s choice but is perfect for a majority of buyers who value its refinement, relaxed nature, interior comfort, and the sheer amount of features it packs in. This is reflected in its sales, too. The share of petrol variants in the Creta’s sales is around 60 percent, of which merely 10-15 percentare turbo-petrol (including N Line). And quite honestly, for its sheer well-roundedness, the petrol IVT is the one I’d recommend. Is it “The Perfect SUV”? Well, not quite, but it certainly comes very close. Also see: 2024 Hyundai Creta long term review, 4,850km report 2024 Hyundai Creta long term review, 1,700km report",
    "author": "Saumil Shah",
    "published": "Sat, 28 Dec 2024 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241227074040_5 _26_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  }
]
