[
  {
    "id": "a2043031-2941-450c-9b21-549cf4839488",
    "title": "Jerry Seinfeld’s 2014 Porsche 911 50th Anniversary Edition Turbo S Coupe",
    "link": "https://bringatrailer.com/listing/2014-porsche-911-turbo-s-coupe-49/",
    "description": "This 2014 Porsche 911 is the only 50th Anniversary Edition Turbo S coupe built for the model year and was purchased new by comedian Jerry Seinfeld, who specified it with approximately $58k in options, some of which include a paint-to-sample Graphite Gray exterior finish and heated adaptive Sport Plus front seats that are trimmed in black leather with Houndstooth-style inserts. Having 3,700 miles, it is powered by a twin-turbocharged 3.8L flat-six that drives all four wheels through a seven-speed PDK dual-clutch transaxle. Equipment includes the Sport Chrono Package, a sunroof, 20\" Sport Classic alloy wheels, Porsche Ceramic Composite Brakes, an electronic limited-slip rear differential, LED headlights, ParkAssist, a Burmester sound system, and automatic climate control. This 991.1 is now offered by the seller on behalf of the owner in California with a window sticker, the owner's manual, service records, a clean Carfax report, and a clean New York title in the name of the owner's LLC.",
    "author": "bringatrailer",
    "published": "Fri, 06 Dec 2024 01:00:10 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/11/2014_porsche_911-turbo-s-coupe_2014-porsche-911-50th-anniversary-turbo-s-cabiglio-garage-1-12354.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "22db444a-f39d-4cb3-92a5-b1798551b50a",
    "title": "Twin-Turbocharged 2010 Audi R8 V10 Coupe 6-Speed",
    "link": "https://bringatrailer.com/listing/2010-audi-r8-64/",
    "description": "This 2010 Audi R8 coupe has 23k miles and has been fitted with a Heffner twin-turbocharger kit as well as a custom cat-less exhaust system, aftermarket suspension components, a roll bar, and 20\" Vossen multi-spoke wheels. It is powered by a 5.2-liter FSI V10 that drives all four wheels through a six-speed manual transaxle and it is finished in gray over black leather upholstery. The car was optioned with the Convenience Package, a speed-activated rear spoiler, LED lighting, the Audi Parking System Plus with a rearview camera, an Audi Concert CD stereo, navigation, heated power-adjustable seats, carbon-fiber interior trim, and automatic climate control. This R8 was acquired by the selling dealer in 2024 and is now offered with partial service records, the owner's manual, a clean Carfax report, and a clean New Jersey title.",
    "author": "bringatrailer",
    "published": "Fri, 06 Dec 2024 00:55:30 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/11/2010_audi_r8_2010-audi-r8-twin-turbo-015-96622.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "25dcfa26-cb57-4f6c-907a-2957b20fddde",
    "title": "Audi A5 and S5 review",
    "link": "https://www.autocar.co.uk/car-review/audi/a5",
    "description": "New look, new platform, new powertrain tech, new four-wheel drive system and even new naming for Audi’s compact executive estate This is the new Audi A5 Avant, and that’s neither a typo nor the promise of some sort of coupé-based shooting brake. As you might have noticed, Audi is shaking up its naming structure so that all the odd-numbered cars have combustion engines while all the even-numbered cars have batteries and electric motors.After being known as the 80 for 25 years and the A4 for 20, Audi’s compact executive saloon/estate now prefers to be known as the A5 – and, as per tradition, there’s a faster version, with S for sporty.",
    "author": "",
    "published": "Thu, 5 Dec 2024 18:09:22 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/01-audi-s5-avant-2024-review-front-driving-lead.jpg?itok=LLo4dng2",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "1b922ed5-afde-4399-8c0d-07d76a0acd21",
    "title": "Cupra Terramar",
    "link": "https://www.autocar.co.uk/car-review/cupra/terramar",
    "description": "Cupra completes its model range with a big sibling to the Ateca Cupra describes its new car, the Cupra Terramar, as a sporty SUV with a bold and confident look and a new generation of hybrid engines. See the issue here? That could potentially describe a lot of new cars and, looking at it, it’s not immediately clear where it sits in Cupra’s range.The Cupra Ateca and Seat Ateca are getting pretty old now, and compared with stuff like the Kia Sportage, Peugeot 3008 and Renault Austral, it’s pretty small. So the Terramar has all the latest powertrains and digital tech and is a size bigger to accommodate those growing families. Viewed another, less charitable way, it’s an angry-looking Volkswagen Tiguan. So the question is: is that something the new car market was missing?",
    "author": "",
    "published": "Thu, 5 Dec 2024 16:36:32 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/01-cupra-terramar-phev-2024-review-lead-cornering.jpg?itok=4ErcxweG",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "0afa8d42-229c-45f6-95cb-c89485517eff",
    "title": "New for ’72: An Immaculate Alloy-Head Harley XRTT Selling at Mecum",
    "link": "https://www.bikeexif.com/1972-harley-xrtt-mecum",
    "description": "The early 1970s were trying times at Harley-Davidson. The effects of AMF’s takeover in 1969 were trashing the company’s reputation and finances, and the flood of incoming Japanese standards provided reliable low-cost alternatives. To make matters worse, Harley’s grip on dirt track racing was in jeopardy after Brits had twisted the AMA’s arm for a single allowable displacement, no matter the valve configuration. With the backbone of Harley’s racing department threatened, it was a mad dash to regain AMA supremacy from Triumph and BSA, resulting in the all-conquering XR750 and a lesser-known pavement star called the XRTT. With scant resources to operate on, Harley’s initial effort at an OHV 750 was based on the 900 ci Iron-Head Sportster, with the engine de-stroked dramatically to fall with the allowable displacement.…",
    "author": "Dean Larson",
    "published": "Wed, 04 Dec 2024 17:00:00 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/12/1972-harley-xrtt-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Classic Motorcycles",
      "Racing Motorcycles",
      "classic",
      "Harley-Davidson"
    ]
  },
  {
    "id": "a85610e7-5bf8-4b4f-bfe9-a174af96e59d",
    "title": "Design on Demand: JSK Moto’s slick BMW R nineT café racer kit",
    "link": "https://www.bikeexif.com/bmw-r-ninet-cafe-racer-kit",
    "description": "High-end custom motorcycles are a joy to ogle, but owning them is often beyond the reach of us mere mortals. Not everyone has the skill or time to build pinnacle-level custom, nor the money to commission one. The average rider is more likely to see a custom bike they like, and then look at how they can add a smidgen of that style to their own ride. That’s why several custom workshops offer some of their best parts as bolt-on accessories—and why JSK Moto has now joined their ranks. This BMW R nineT café racer is the third custom R nineT that the California-based outfit has built, but it’s the first one that’s been designed with mass production in mind. Founded by Taiwanese ex-pat Samuel Kao in 2010, JSK Moto’s mission here was to build a slick custom that could be broken down into kit form.…",
    "author": "Wesley Reyneke",
    "published": "Tue, 03 Dec 2024 19:09:55 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/12/bmw-r-ninet-cafe-racer-kit-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "BMW cafe racers",
      "BMW motorcycles",
      "BMW R nineT",
      "Cafe racers",
      "JSK Moto"
    ]
  },
  {
    "id": "4e650398-d4eb-4bce-8b5b-4cf3713c8895",
    "title": "The BMW X5 Plug-In Hybrid Is Now Made In Brazil",
    "link": "https://www.bmwblog.com/2024/12/05/bmw-x5-phev-brazil-production-starts/",
    "description": "BMW has been making cars in Brazil for a decade at its plant in Araquari plant in Santa Clarita. In the 10 years that have passed, it’s put together over 100,000 vehicles. It currently produces... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Thu, 05 Dec 2024 14:32:47 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/12/BMW-X5-xDrive50e-made-in-Brazil-2-830x621.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW X5",
      "X5 xDrive50e"
    ]
  },
  {
    "id": "1d1ec9ec-78de-40a6-aa12-31c4166e1eb1",
    "title": "New BMW M5 Hits The Track In India",
    "link": "https://www.bmwblog.com/2024/12/05/new-bmw-m5-hits-track-india/",
    "description": "The seventh-generation BMW M5 continues its world tour following its premiere in June. While deliveries of the G90 have already started in some markets, the super sedan is only now landing in India. It costs... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Thu, 05 Dec 2024 13:45:11 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/12/BMW-M-Town-Experience-in-India-5-830x528.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M5",
      "///M Town",
      "G90",
      "M5 G90"
    ]
  },
  {
    "id": "c5ae9436-818e-4a10-9ed6-d751b6f571d9",
    "title": "Entry-Level Polestar 3 Combines RWD With $67,500 Price Tag",
    "link": "https://www.carscoops.com/2024/12/entry-level-polestar-3-combines-rwd-with-67500-price-tag/",
    "description": "The Polestar 3 Long Range Single Motor packs 295 hp and 350 miles of range",
    "author": "Michael Gauthier",
    "published": "Fri, 06 Dec 2024 00:46:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/12/Polestar-3-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Polestar",
      "Polestar 3",
      "Prices",
      "Production"
    ]
  },
  {
    "id": "8d71d05d-8921-4462-982a-bb73231765d4",
    "title": "Porsche 718 EV Might Be Delayed By Northvolt Bankruptcy",
    "link": "https://www.carscoops.com/2024/12/porsche-718-ev-might-be-delayed-by-northvolt-bankruptcy/",
    "description": "Northvolt's financial troubles could zap future EV plans for both Porsche and Audi",
    "author": "Michael Gauthier",
    "published": "Fri, 06 Dec 2024 00:03:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/12/2025-Porsche-Boxster-EV-5-CS-copy-1024x576.webp",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Audi",
      "Audi A6",
      "Electric Vehicles",
      "Porsche",
      "Porsche 718",
      "Reports"
    ]
  },
  {
    "id": "c434d33e-97c0-4bf5-a9ce-051966113e9d",
    "title": "NHTSA Investigating Fiery Tesla Cybertruck Crash That Killed Three",
    "link": "https://jalopnik.com/nhtsa-investigating-fiery-tesla-cybertruck-crash-that-k-1851714855",
    "description": "The National Highway Traffic Safety Administration is looking into the deadly Tesla Cybertruck crash that happened in Northern California last week. It left three young college students dead and another in critical condition. Right now, the California Highway Patrol is leading the crash investigation. We’ll see how…Read more...",
    "author": "Andy Kalmowitz",
    "published": "Thu, 05 Dec 2024 20:35:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/bfaaaaad9659881aa23d0a4f24f394c0.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "tesla cybertruck",
      "tesla",
      "disaster accident",
      "tesla inc",
      "national highway traffic safety administration",
      "alisa crovetti",
      "education",
      "automotive safety",
      "jeremy bowers"
    ]
  },
  {
    "id": "7559140b-b3a3-4d7f-8eaf-609075cd02d3",
    "title": "California Man Allegedly Steals Over $40,000 Worth Of Fuel From A Gas Station Over 6 Months",
    "link": "https://jalopnik.com/california-man-allegedly-steals-over-40-000-worth-of-f-1851714616",
    "description": "Police arrested a 19-year-old man in San Diego earlier this week on suspicion stealing thousands of dollars worth of gas from a suburban gas station over the course of half a year. Read more...",
    "author": "Lawrence Hodge",
    "published": "Thu, 05 Dec 2024 20:15:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/6a69c53d4400c3eaa343f6f29e354cc2.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "chevron",
      "corporate crime",
      "san diego",
      "filling station",
      "chevron corporation",
      "andrew gerardo escobedo",
      "law crime",
      "gmc yukon"
    ]
  },
  {
    "id": "b2f41720-f167-4be1-b10f-b3e654d6ec3d",
    "title": "Audi A6 e-tron Sportback video review",
    "link": "https://www.autocarindia.com/car-video-reviews/audi-a6-e-tron-sportback-video-review-433752#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see: Audi A6 e-tron Sportback review: Chill pill",
    "author": "Nikhil Bhatia",
    "published": "Tue, 3 Dec 2024 19:19:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241203072033_Audi_A5_e_tron_sportback_video_review.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "4338e75e-5def-4d33-9c4a-588f772106f6",
    "title": "Audi A6 e-tron Sportback review: Chill pill",
    "link": "https://www.autocarindia.com/car-reviews/audi-a6-e-tron-sportback-review-chill-pill-433747#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "First things first. The Audi A6 e-tron Sportback you see here is not an all-electric replacement for the ICE A6 we’re all familiar with. In fact, the two models have little in common. You see, under Audi’s new naming system, electric vehicles will have even numbers in the name with ‘e-tron’ as a suffix (Q4 e-tron, Q6 e-tron, Q8 e-tron) while ICE models will run odd numbers. The next-gen A6 will become the ‘A7’, the A4 has already given way to a new ‘A5’, and so on. This A6 e-tron is the second Audi model after the Q6 e-tron to be built on the PPE or Premium Platform Electric co-developed with Porsche. Advancements in the motors, battery and architecture promise enhanced efficiency, faster charging and superior performance. The A6 e-tron has been unveiled in Avant or estate form – that’s sadly not headed here – and this Sportback body style coming to India in 2025. Audi A6 e-tron Sportback design The A6 e-tron looks substantial because it is. It’s about the same size as the A6 petrol we are familiar with, but there’s more mass to the design, something most noticeable at the sides. A black applique low down on the doors, there to also indicate the position of the battery, helps break the bulk. The fastback tail gives the A6 e-tron Sportback its eye-catching shape and to me, it looks best from the rear three-quarter angle. There’s a lovely flow from roof to high-deck boot and the full-width lighting is really slick. A glowing rear logo is a first for an Audi and the digital OLED tail-lamps almost have a language of their own – eight selectable patterns and the ability to display warning graphics to communicate hazards to vehicles behind. With split headlamps, a semi-concealed grille, and a black ‘mask’ on the bumper to hide the air dams and ADAS hardware, frontal styling is a dramatic departure from the Audi template. The LED DRLs positioned up top get eight selectable patterns and this is a cool touch. A fact of note is that the A6 e-tron Sportback is the most aerodynamic Audi ever, and this bodes well for range. But, and this is just me, I’m not a fan of this newfangled organic styling. I like my Audis angular. Audi A6 e-tron Sportback interior and features Inside, you’ll see the latest from Audi and that’s a good thing. The basic layout is similar to what we’ve seen on the Q6 e-tron, which means it’s a cutting-edge interior and also a screen-rich one. There’s a curved display that comprises 11.9-inch digital dials and a 14.5-inch centre touchscreen, aside from which is an optional 10.9-inch passenger screen. And that’s not all. Versions with Virtual Mirrors (camera pods that replace the wing mirrors) also add screens near the A-pillars. And lest I forget, there’s also a head-up display with augmented reality! The latest-gen digital dials are a huge upgrade from Audi’s Virtual Cockpit instruments we’ve seen for nearly a decade. It’s got crisp graphics, nice colours, and plenty of info, though what’s missed is the option to go in-depth into EV stats. I did find myself relying more on the head-up display while driving, though. There’s superb detail and the augmented reality indications for ADAS and navigation that overlay warnings and symbols onto the driving environment are fantastic. Interior is premium and trio of screens give it a techy look. The centre touchscreen is, again, slick and responsive but the menus can feel intimidating at first glance. Shortcuts and widgets do help personalise the screen for ease of use, but packing in climate control settings on the screen is not ideal. The passenger screen is a good way to keep your front passenger entertained while you’re doing the hard work of driving a very nice and very soothing electric car. What’s nice is that the screen is not visible from the driver’s point of view on the go. Along with the closely related Q6 e-tron, the A6 e-tron marks a return to form for Audi in terms of quality. Everything you see and touch feels really high-end. The gloss look to the screens looks rich and goes well with the piano black on the centre console. Also really nicely done are the touch-sensitive controls on the steering that are better executed than what we’ve seen on the latest lot of Mercedes cars. There’s a capacitive touch panel on the door, too, for the lights. Augmented reality overlay on HUD is brilliant. Front seat comfort is good, helped in part by the option for ventilation, heating and massage. A leather-free interior is optional and I have to say the fabric upholstery on the seats and dashboard is tastefully done. Of the other elements, there’s ambient lighting that subtly adds some colour to the cabin and flashes warnings such as for safe exits. The A6 is also available with the option of a full-glass roof that can go from transparent to opaque at the touch of a button. There’s also the option of an 830-watt Bang \u0026 Olufsen sound system. Four of the 20 speakers are integrated into the front headrest for a more personalised sound right near your ears. Soft-close doors are part of the package, too. Audi A6 e-tron Sportback rear seat and luggage capacity The rear seat experience isn’t quite as nice as the one up front. Kneeroom is decent but not exceptional for what is a large car with a long wheelbase, and headroom is just adequate for tall passengers. The backrest recline could be more relaxed, too, but the biggest spoiler is the knees-up seating position which is a recurring complaint on electric cars that position their battery pack under the floor. Oddly enough, Audi mitigated the problem on the e-tron GT with clever ‘foot garages’ or cutouts in the battery. The A6 e-tron uses a fully flat battery pack. Kneeroom is good but knees-up seating position is a spoiler. Luggage capacity seems a lot larger than the 502 litres mentioned on the spec page. And should the need arise, you can fold down the rear seats to free up up to 1,330 litres of room. There’s no provision for a spare tyre, at least in this European-spec model. The tailgate is powered, and handily, Audi has added a light guide for the gesture control so you know precisely where to ‘kick’ to activate the opening or closing function. There’s a small 27-litre frunk, and uniquely, it can also be opened with a swipe on the bonnet. Audi A6 e-tron Sportback battery, motor and range On to the heart of the matter. The Audi A6 e-tron Sportback uses a lithium-ion battery pack with a nickel-manganese-cobalt chemistry. Battery options include 83kWh and 100kWh capacities. The larger of the two is available with rear motor as well as dual-motor, all-wheel-drive layouts. The version most likely headed to India is the Audi A6 e-tron Sportback Performance that uses a 100kWh battery that powers a single rear permanent magnet synchronous motor. Power is rated at 367hp with up to 380hp on call with launch control. Peak torque is 565Nm. The headline number for this version, however, is range – 756 kilometres on the WLTP cycle. What’s more, the 800V architecture allows DC charging at up to 270kW, which means a 10-80 percent charge in just 21 minutes. We are still some time away before 270KW chargers become commonplace in India, so the standard 11kW AC charging and optional 22kW AC charging capabilities are of greater relevance. Audi A6 e-tron Sportback performance and handling A drive around the breathtakingly gorgeous island of Tenerife in the Canary Islands gave an indication of what to expect. The Performance version might be the long-range variant of the A6 e-tron, well, range, but it’s no slow coach. 0-100kph takes 5.4 seconds and the top speed is capped at 210kph. Of course, this being an EV, it’s fast, it’s responsive, and overtaking doesn’t require much thinking. But what’s different about the A6 is that it’s not one of those EVs that slams you back onto your seat. Its build of power is nice and gradual and the general feeling is of an easygoing and chilled-out car that wants to do luxury better than all other things. The general feeling is of an easy-going and chilled-out car that wants to do luxury well. You feel as much when toggling between the drive modes, too. There are Comfort, Efficiency, Dynamic and Balanced modes, and each impacts the throttle responses, steering and damping. Even in the sportiest of the driving modes, the A6 still feels very relaxed and gentle around the curves. Sure, there is nicer weight around the steering and the suspension does firm up, but if you want an agile sporty car, you should probably be looking at the RS e-tron GT in Audi’s line-up. Don’t get me wrong, because the A6 drives with confidence and is fun to drive when you’re in the mood. It’s just that it masks its speed eerily well. Refinement is spectacular and there’s only a bit of wind noise from the wing mirrors at speeds upwards of 100kph. Audi A6 e-tron Sportback ride comfort and braking Quick as the A6 is, it’s just as happy to slow down. The A6 e-tron packs in regen braking and you can control the levels of regen using the paddle shifters. There’s also a ‘B’ mode which brings in one-pedal driving. It feels very natural and was my go-to setting for the drive on the hills of Tenerife. The interesting thing is that Audi’s system marries the motor braking with the actual friction brakes, so they work together to give a stronger effect of regen braking. What’s really nice is that you can’t sense that handover from regen braking to friction braking or when they’re working together. The regen braking supplements the slippery shape, energy-dense battery and high-efficiency motor to deliver fantastic range. Refinement is spectacular and allows the A6 e-tron to mask high speeds eerily well. The A6 e-tron Sportback is really good on ride comfort, too. Steel springs are standard but higher-spec versions like our test car get air suspension. Unfortunately (or fortunately) there weren’t any India-spec potholes to test on our drive route in Tenerife. Even so, the 21-inch tyres dismissed any uneven surfaces with the air suspension doing a great job of keeping body movements in check. Ride height lowers by 20mm in efficiency mode for best aero but owners in India will probably use the lift mode more than any other suspension function. Audi A6 e-tron Sportback price and verdict The Audi A6 e-tron will follow the Q6 e-tron electric SUV and will likely launch in India in the second half of 2025. The A6 e-tron Sportback has an eye-catching shape and is high-tech inside, though it’s a vehicle to buy for the front seat experience rather than the one at the back. Refinement and range are highlights and even the middle-rung Performance version gets you all the power that you can really use. We expect prices to be in the region of Rs 1 crore, ex-showroom, which will be competitive for this size and class of electric car. The A6 e-tron Sportback represents the shape of things to come from Audi, and it sure does impress. Also see: Audi Q7 facelift launched at Rs 88.66 lakh New Audi Q5 Sportback revealed with petrol, diesel engine options 2025 Audi RS Q8 Performance video review",
    "author": "Nikhil Bhatia",
    "published": "Tue, 3 Dec 2024 19:14:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241203070919_Audi_A6_e_tron_front_action.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "2aa97449-fbed-4a60-8821-25b8ea85a459",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "6d3843f2-2a55-4078-a49e-9b8cac8a9a69",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "a2adced8-fbc7-485d-a2bc-ca2bb07721ef",
    "title": "Royal Enfield Goan Classic 350 video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/royal-enfield-goan-classic-350-video-review-433615#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also see: RE Goan Classic 350 review: More than just a dressed-up Classic",
    "author": "Dinshaw Magol",
    "published": "Sat, 23 Nov 2024 21:08:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241123090840_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "c703bcb0-0a0d-4d90-ae44-06f7bddd9629",
    "title": "RE Goan Classic 350 review: More than just a dressed-up Classic",
    "link": "https://www.autocarindia.com/bike-reviews/re-goan-classic-350-review-more-than-just-a-dressed-up-classic-433630#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Someone wise recently told me: “A watch tells more than time.” Essentially, this means your watch is an extension of yourself, and different watches fit different people's personas. That saying is actually quite fitting for this bike – the gorgeous Royal Enfield Goan Classic 350. It isn't too different from the Classic 350, but it's targeted at a rather different rider – someone who wants to be unique but doesn't want the compromises that come with this style of bike. RE Goan Classic 350: Design, changes to Classic Design is one of the foremost ways the Goan Classic differs from the standard Classic. Starting at the front, you've got these very retro-looking whitewall tyres, which are found only on a microscopic amount of bikes available on sale today. While the tyres have a retro look, a welcome surprise is that the Goan Classic runs cross-spoke laced wheels, which permit tubeless tyres. The tyres are CEAT’s new Zoom Classic rubber, developed specifically for the Goan Classic. While the front wheel is a 19-incher, like the bike it is based on, the rear wheel is a 16-incher in proper bobber fashion. Then, the Goan Classic trades the Classic's handlebar for tall ape-hanger bars that put your arms almost straight and in line with your shoulders. It also has more forward-set pegs from the Meteor 350, and together, these changes put you in a properly relaxed riding position. The Goan Classic is also the only RE 350 to get the metal switch cubes from the larger 650s. Even the exhaust muffler is new and has a bit of a raspy note to it. You also have a cantilevered rider's seat, which is just 750mm off the ground, making it the second-lowest seat on any Royal Enfield today, after the Super Meteor 650. But my favourite design element is this articulated rear fender that moves with the wheel. The logos and badging on this bike also align with the retro custom aesthetic and add that little bit of extra pizzazz to its design. The Goan Classic’s colour palette is very funky and out there, and those who like to make a statement with their bikes will like the paint options. There are four colours to choose from, but my favourite has to be the Trip Teal (nice naming, RE!). RE Goan Classic 350: Ride and handling, comfort So, how do all these changes affect the riding experience? The short answer is, not much. The Goan Classic feels very similar to the Classic 350, which is a very pleasant feeling, with the only difference being how you're seated. The tall ape hangers work rather well when you're riding, and there's no strain on your arms or shoulders. After a brief accustomization period, I found my rhythm, and I suspect it will be the same for most others. The only small caveat here is that while making a tight U-turn, you need to plan your movements correctly and be a little more mindful of the tall bars. And because of how you're seated on the bike, you'll also bear the brunt of bad roads a little more than the Classic. That said, the Goan Classic is nowhere as uncomfortable as its competitors from Classic Legends. Honestly, aside from the different riding positions, the rest of the riding experience is pretty much identical to the Classic 350. This means it's the same relaxed, comfortable, and smooth yet torquey bike we've come to know and loved over the years. RE Goan Classic: Verdict All in all, the Goan Classic 350 feels like a cut above the rest of the 350s in terms of fit and finish, quality, and uniqueness. This will also be reflected in its price, as it is the most expensive 350cc Royal Enfield. Prices start at Rs 2.35 lakh (ex-showroom, Chennai) and go up to Rs 2.38 lakh (ex-showroom, Chennai), making it Rs 5,000 - Rs 8,000 more expensive than the top Emerald Chrome Classic 350. With the Goan Classic, you're getting a very unique-looking thing with proven fundamentals, a custom bike straight from RE. So, if you're one of the few people who use their watch not just to tell the time but to make a statement, I think the Goan Classic will be right up your alley. Also see: Royal Enfield Goan Classic 350 video review Royal Enfield Goan Classic 350 walkaround video Brixton Cromwell 1200 quick ride: Most affordable 1200cc motorcycle",
    "author": "Dinshaw Magol",
    "published": "Fri, 22 Nov 2024 20:35:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241123022833_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "888f2630-77db-4e22-95a9-d68246e6cfe1",
    "title": "Richard and his Bug - A story of two old souls",
    "link": "",
    "description": "To keep a car running, change its oil every 3000 miles,” says 76-year-old Richard. His advice is nothing new, especially for anybody who owns an old Volkswagen, and he has applied this saying to his 1983 Volkswagen Beetle, which has served him for over 20 years. Some 20 years ago, Richard got a call from a friend saying that there was a Beetle for sale not too far away from him. He decided to take a look, and the moment he saw the Bug, he instantly fell in love with it. Continue...",
    "author": "",
    "published": "Wed, 27 Nov 2024 16:00:23 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/11/21055627/2-1-e1732197456402.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "ad0fb404-cf1f-4c7b-b163-ceb8b3a2067c",
    "title": "Briggs Cunningham \u0026 Denise McLuggage's 1956 Jaguar XK140",
    "link": "",
    "description": "Photography by: Johnathan Rothman (@thejohnrothman) 1956 Jaguar XK140 Convertible Raced in period by Briggs Cunningham and Denise McLuggage Location: California, USA Country of original delivery: USA Chassis/VIN: S818207 Mileage: 76,025 miles Colour: Red Original colour of delivery: Carmine Red Price: Call for Price The car As part of its Private Sales initiative, Petrolicious is proud to offer a unique collector-grade Jaguar. The Jaguar XK140 represented the epitome of front-mounted 6-cylinder Jaguars in the mid-1950s. This particular example is without a doubt the most storied one in the United States of America, as it was raced and campaigned by two of the most prolific personalities in the American racing world. The car was first campaigned by renowned Briss Cunningham, who was indisputably one of the most pivotal figures in postwar sports car racing, making a profound impact as a driver, team owner, and constructor. Briggs then proceeded to donate his XK140 to Denise McLuggage, an American auto racing driver, journalist, author and photographer. She pioneered gender equality in motorsports and journalism in the U.S., and was among the very first women taking part in professional automotive racing. Her racing achievements included winning the grand touring category at Sebring in a Ferrari 250 GT in 1961, and a class win in the Monte Carlo Rally in a Ford Falcon in 1964. She also participated in the Nürburgring 1000 km sports car race. This car's past is in fact so fascinating that it recently enabled it to earn a very coveted spot in the Motorsports Hall of Fame of America (MSHFA), where it resided in 2022 alongside other giants of the racing world. What's perhaps even more remarkable, is that the car presents in unaltered condition. It's been kept 'as-is' by its 4 owners (Briggs Cunningham, Denise McLuggage, and 2 other owners, including the present one), and is showing a splendid amount of patina. Everything about this car is original and has remained untouched over the last 58 years - the chassis, body panels, engine, transmission, suspension, wheels, seats, dashboard materials, and more, are all original. And, magically, 58 years later, it still elegantly runs and drives. Continue...",
    "author": "",
    "published": "Fri, 22 Nov 2024 17:37:00 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/10/10114104/DSCF5856.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "b914f7bb-47e7-4eda-aba3-81583c138b82",
    "title": "New car, SUV prices to go up from January 2025",
    "link": "https://www.autocarindia.com/industry/new-car-suv-prices-to-go-up-from-january-2025-433772#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "As is the case every year end, several carmakers have announced a price hike across their portfolio effective from January 1, 2025. The key reasons citied for the price revisions are rising commodity and operational costs. Hyundai  Hyundai India has announced a price increase of up to Rs 25,000 across its line-up. The Korean brand has multiple cars and SUVs on sale in our markey like the Venue, Creta and the Exter along with high-end models like the Ioniq 5 EV. The brand will take the wraps off the Creta EV next month. Nissan  Nissan will hike prices for the recently facelifted Magnite SUV by two percent. The Magnite is Nissan’s only made-in-India SUV which is sold domestically as well as exported to many countries abroad. The company, however, has not announced a hike for the flagship X-Trail SUV.  Audi India Audi India has announced a 3 percent price hike for its cars and SUVs effective from January 1, 2025. Audi's locally assembled range in India includes the A4 and the A6 sedans, along with the Q3, Q3 Sportback, Q5 and Q7 SUVs. The brand also sells imports like the A5 Sportback, the Q8 SUV and its electric derivatives, and the e-tron GT and the RS e-tron GT in the Indian market. BMW India BMW India has also announced a price hike across its portfolio by up to 3 percent. BMW sells the 2 Series Gran Coupe, the 3 Series Gran Limousine and the M340i, the 5 Series LWB, 7 Series, X1, X3,  X5 and the X7 SUVs as locally assembled models. Meanwhile, BMW’s imported models include the i4, i5 and the i7 electric cars,  iX1 and the iX electric SUVs, Z4, M2 Coupe, M4 Competition and the CS, the M8, XM and the recently launched M5. Mercedes Benz India Mercedes was the first carmaker to announce a price hike this year end. Prices for its models will go up by up to 3 percent. Mercedes has clarified that GLC prices will be up by Rs 2 lakh while the Mercedes-Maybach S680 V12 will cost Rs 9 lakh more. Additionally, models which are manufactured by December 31, 2024 wont see a price increase, including for units that are booked before this date. Also See: Skoda Auto Volkswagen India faces USD 1.4 billion tax evasion notice: Report FordPass app to be discontinued in India from January 1",
    "author": "Akbar Merchant",
    "published": "Thu, 5 Dec 2024 18:23:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241205062334_20240606032223_Creta showroom shot _1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "88d87519-1b78-47c5-829b-cc70b00c2060",
    "title": "Volkswagen Taigun, Virtus get up to Rs 2 lakh year-end discounts",
    "link": "https://www.autocarindia.com/car-news/volkswagen-discounts-offers-benefits-this-month-433420#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Volkswagen India has announced massive year-end benefits on its portfolio, which includes the Taigun mid-size SUV, Virtus mid-size sedan and the larger Tiguan SUV. Depending on the variant, customers can avail cash discounts, an exchange bonus or a scrappage bonus (they can’t be clubbed), and a loyalty bonuses. Here’s how much you could save on your new Taigun, Virtus or Tiguan during this month. Disclaimer: Discounts vary from city to city, and are subject to the availability of stock. Check with your local dealer for the exact figures. Volkswagen Taigun discounts December 2024 Save up to Rs 2 lakh This month, Volkswagen is offering benefits to the tune of Rs 2 lakh on the MY2024 Taigun with the 115hp, 1.0 TSI engine which includes a cash discount of up Rs 1.50 lakh. Meanwhile, select Taigun variants equipped with the 150hp, 1.5 TSI engine get discounts of up to Rs 50,000 inclusive of exchange/scrappage benefits and loyalty bonuses. Further, VW is also offering up to Rs 50,000 off on MY2023 models, and an additional Rs 40,000 for older variants that come with two airbags; the brand had made six airbags standard in June 2024. Volkswagen Virtus discounts December 2024 Save up to Rs 1.50 lakh The discount scheme is pretty similar for the Virtus as well. The 1.0-litre TSI variants of the Virtus get up to Rs 1.50 lakh off which includes up to Rs 1 lakh cash discount, and exchange/scrappage benefits and loyalty bonuses. Exchange/scrappage and loyalty benefits amounting to Rs 50,000 are available on select variants of the Virtus with the 150hp, 1.5-litre engine. Again, like the Taigun, MY2023 models get a Rs 50,000 cash discount, while those with two airbags get an additional Rs 40,000 off. Volkswagen Tiguan discounts December 2024 Save up to Rs 4.90 lakh VW India’s current flagship offering gets cash discounts of up to Rs 2 lakh. MY2023 models additionally get a complementary 4-year service package that is worth over Rs 90,000. Buyers can also avail a loyalty bonus worth Rs 50,000 and an exchange bonus worth Rs 1.50 lakh or scrappage bonuses of up to Rs 20,000. The total maximum discounts and benefits available on the VW Tiguan this month is Rs 4.90 lakh. The Volkswagen Tiguan is a five-seat SUV that is powered by a 190hp, 2.0-litre turbo-petrol engine, mated to a 7-speed dual-clutch gearbox. Also See: Tata Harrier, Safari discounts increase to Rs 3.7 lakh on MY2023 models Maruti Swift discounts increase in December 2024",
    "author": "Rivan RS",
    "published": "Thu, 5 Dec 2024 17:09:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241205050539_20230418062111_20230322015232_20221004024107_VW_Virtus.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "ad87dfca-1920-4db1-9bf8-bccf6d342d47",
    "title": "Everything, Everywhere, All At Once: The 2024 Essen Motor Show Mega Gallery",
    "link": "https://www.speedhunters.com/2024/12/2024-essen-motor-show/",
    "description": "There are three reasons for that. First, despite spending three full days at Messe Essen, it still feels like I missed many of the cars on display. Second, while in Germany, I travelled over 1,300 kilometres, hunting speed across the country. But the third reason is the most personal. The end of EMS marks the […] The post Everything, Everywhere, All At Once: The 2024 Essen Motor Show Mega Gallery appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Thu, 05 Dec 2024 17:00:39 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Event Coverage",
      "2024 Essen Motor Show",
      "Car Show",
      "Essen",
      "Essen Motor Show",
      "Germany",
      "Messe Essen"
    ]
  },
  {
    "id": "8919dce7-601f-4115-9803-f6ef2fb37d27",
    "title": "Trackside At The 2024 Nismo Festival",
    "link": "https://www.speedhunters.com/2024/12/trackside-at-the-2024-nismo-festival/",
    "description": "But, this year, the event seemed to reflect a turning point – one where the industry’s growing focus on EVs and modernity may have marked the beginning of the festival’s decline. For many, the real draw of the annual Nismo Festival isn’t checking out the latest hybrid and EV models already on display at your […] The post Trackside At The 2024 Nismo Festival appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Wed, 04 Dec 2024 17:00:52 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Event Coverage",
      "2024 Nismo Festival",
      "Fuji Speedway",
      "GT-R",
      "japan",
      "JGTC",
      "JTCC",
      "Nismo",
      "Nismo Festival",
      "Nissan",
      "Skyline",
      "super gt"
    ]
  },
  {
    "id": "1ea7b2c7-ac4e-4f1f-842b-80f7156fc88e",
    "title": "1981 Rolls-Royce Dakar Rally Racer Sells at Auction for $630K",
    "link": "https://www.caranddriver.com/news/a63106991/1981-rolls-royce-dakar-rally-racer-sold/",
    "description": "Rolls-Royce and rally racing don't typically go hand in hand, but this modified Corniche that just sold at auction impressed at the challenging Dakar Rally in 1981.",
    "author": "",
    "published": "Thu, 05 Dec 2024 22:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "634a230a-1ab7-46b1-8b5c-9158566124b9",
    "title": "2025 Mercedes-Benz G-Class EV",
    "link": "https://www.caranddriver.com/mercedes-benz/g-class-ev",
    "description": "Review, Pricing, and Specs",
    "author": "",
    "published": "Thu, 05 Dec 2024 20:57:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "47660ff8-f527-4fa8-bad3-b7836b288854",
    "title": "QOTD: Do You Conquest Discounts Work for You?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-do-you-conquest-discounts-work-for-you-44510656?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Ford wants to conquest Jeep owners with incentives.",
    "author": "Tim Healey",
    "published": "Thu, 05 Dec 2024 23:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/05/17411/qotd-do-you-conquest-discounts-work-for-you.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "ecafbf9d-1481-4e1d-b12c-1791e3707b33",
    "title": "Used Car of the Day: 1987 Mercedes-Benz 560 SL",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-1987-mercedes-benz-560-sl-44510653?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today we take you back to the '80s for this drop-top 1987 Mercedes-Benz 560 SL.",
    "author": "Tim Healey",
    "published": "Thu, 05 Dec 2024 22:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/05/17163/used-car-of-the-day-1987-mercedes-benz-560-sl.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  },
  {
    "id": "58a7a8f4-1120-40f3-b320-7015f95a7102",
    "title": "Genesis should build a genuine off-road SUV to create an icon",
    "link": "https://www.autoblog.com/news/genesis-should-build-a-genuine-off-road-suv-to-create-an-icon",
    "description": "Genesis has built a reputation for itself based on exceptional build quality – a key ingredient in any upscale off-roader. Why not take the opportunity to hit rivals like Lexus and Land Rover where it really hurts by challenging their off-road icons?",
    "author": "Cole Attisha",
    "published": "Thu, 05 Dec 2024 22:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMTc3NzkyMzI1Mjk4MTM1/front.png",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Genesis",
      "2025",
      "Genesis"
    ]
  },
  {
    "id": "50970d38-265e-4a67-b343-dc6b9073069e",
    "title": "Subaru is discontinuing the base model WRX",
    "link": "https://www.autoblog.com/news/subaru-is-discontinuing-the-base-model-wrx",
    "description": "The iconic performance car will move forward with a more refined lineup for 2025.",
    "author": "Elijah Nicholson-Messmer",
    "published": "Thu, 05 Dec 2024 21:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMTQwNzE5NTA5Nzc1ODYw/2025-subaru-wrx-ts.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "WRX STI",
      "wrx sti",
      "WRX",
      "Subaru",
      "News",
      "Subaru Wrx",
      "2025",
      "Subaru"
    ]
  }
]
