[
  {
    "id": "2dcba124-7c7e-46ba-9cef-6a214def97a7",
    "title": "1998 Nissan Skyline 25GT Turbo 5-Speed at No Reserve",
    "link": "https://bringatrailer.com/listing/1998-nissan-skyline-gt-r-3/",
    "description": "This 1998 Nissan Skyline 25GT Turbo was sold new in Japan and imported into the US in January 2024. The car is finished in Active Red over gray cloth upholstery, and power comes from a turbocharged 2.5-liter RB25DET inline-six paired with a five-speed manual transmission. Equipment includes a carbon-fiber hood, GT-R–style bodywork, 19\" Kansai wheels, a Blitz turbo timer, an A'PEXi FC Commander, an HKS CAMP 2 display, an aftermarket air intake, a front-mount intercooler, and an SP Sports EXAS Evo Tune exhaust center section and muffler. This R34 Skyline is now offered by the selling dealer in Illinois at no reserve with a clean Georgia title.",
    "author": "bringatrailer",
    "published": "Sat, 15 Feb 2025 23:00:17 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/01/1998_nissan_skyline-gt-r_2dsc_6753-webres-29766.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "8b86f1bf-6f35-4868-b9e3-6eb6002baa98",
    "title": "36k-Mile 2005 Mercedes-Benz CL65 AMG",
    "link": "https://bringatrailer.com/listing/2005-mercedes-benz-cl65-amg-60/",
    "description": "This 2005 Mercedes-Benz CL65 AMG coupe has 36k miles following history in Oregon, Ohio, Indiana, Arizona, and Florida. The car is powered by a twin-turbocharged 6.0-liter V12 paired with a five-speed automatic transmission and is finished in black over black leather. Features include bi-xenon headlights, a sunroof, Parktronic, Distronic adaptive cruise control, 19\" AMG wheels, a power rear-window sunshade, Keyless Go, an electronic trunk closer, heated and ventilated multi-contour front seats, dual-zone automatic climate control, a Bose surround sound system, a trunk-mounted CD changer, and COMAND infotainment with navigation. This C215 CL65 AMG is now offered in Pennsylvania by the selling dealer with the owner's manual, a clean Carfax report, and a clean Pennsylvania title.",
    "author": "bringatrailer",
    "published": "Sat, 15 Feb 2025 22:55:19 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/01/2005_mercedes-benz_cl65-amg_05-cl65-248-72734.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "8d337b6f-1946-4828-8793-ffdddb0368bc",
    "title": "How will ZEV mandate and 2035 ICE ban affect small car makers?",
    "link": "https://www.autocar.co.uk/opinion/new-cars/how-will-zev-mandate-and-2035-ice-ban-affect-small-car-makers",
    "description": "Emissions regs pose a real challenge for car makers like Caterham The latest government consultation on how quickly the UK car market should migrate to fully electric vehicles concerns what will happen between 2030 and 2035. But it has made it 100% clear where the entire industry, even small- and micro-scale manufacturers, will stand after that. All new cars, no matter who makes them, must be fully zero-emissions after 1 January 2035. No engines. No exemptions. Nobody, as was the case previously and which remains the case in the EU, is ‘out of scope’ of the regulations. Are you a car maker that produces five newly registered cars a year by hand? From 2035, you will be in the same boat as Ford. It’s worth reiterating how clear this is. The latest consultation, launched on Christmas Eve and running to 18 February, asks questions and puts forward proposals that include whether small-scale car makers should be included in the 2030 changes. They’re the reason why Lister boss Lawrence Whittaker was on the news last week seeking urgent clarification, having stopped all of the firm’s future development plans. The government has acknowledged that “there is a precedent for treating small manufacturers differently” and stated: “Kit cars represent a very small overall segment of the market. It is proposed that applying the requirements to kit cars would therefore not be proportionate.” Beyond that, though, there’s no doubt, no hidden meaning, no ambiguity, as paragraph 62 of the consultation reads: “It is clear that all manufacturers must decarbonise according to the ambitious timetable for all new cars and vans to be ZEV by 2035, including those made by low-volume manufacturers.” Paragraph 64: “For all manufacturers of all sizes, new cars and vans must be 100% zero-emission by 2035.”The short of it is: if you want a combustion- engined Caterham, you have 10 years left. This is despite the acknowledgement that “smaller-volume manufacturers account for a very small proportion of overall UK vehicle sales and limited amounts of CO2” and that “they play a vital role in supporting jobs, investment, skills and expertise within the UK automotive industry”. It’s hoped that in future they “will play an important role in the transition to ZEVs” (all from paragraph 61), whether they and their customers want to or not. It doesn’t matter that, as it stands, it requires considerably more CO2 emissions to make a zero-emissions car than it does a pure-ICE one, nor that micro-volume cars are typically driven such small distances annually that it could take decades, if ever, for one to reach the point where a BEV would have been better for the planet. This will especially be the case once non-fossil-based, renewable ICE fuels – which will be so essential for construction, aerospace and agriculture – come on-stream. Concessions for these are being considered within the EU.It doesn’t matter that Ariel’s annual output wouldn’t keep Toyota in business for nine minutes. It doesn’t matter that these small companies win awards for exports. It doesn’t matter that most UK race circuits don’t have and may not get the electrical capacity to quickly charge EVs’ batteries. It’s as simple as this: if it has four wheels, to be sold new in 10 years, it must have no tailpipe.Perhaps you think this is fine. These are agile companies employing clever people. Previously Ariel has said an electric future doesn’t faze it, while Caterham has dabbled with a prototype Seven EV – although it couldn’t get it to work or, more pertinently, find many interested customers.  And it may be that promised new battery technology of the sort that is dissuading some current ICE car owners from making the EV switch (the solid-state batteries promised by Nissan in 2028, Stellantis’s lithium-sulphur batteries for 2030) will make an electric niche car better, lighter and more fun than it is today. If that is the case (and this is true to an extent of the wider car industry), the regulations won’t be necessary. We didn’t mandate cassettes, CDs, minidiscs or MP3 players into existence because of a dislike of vinyl; new tech was just preferable, so we chose it and left the hobbyists alone. The same path would easily suit niche car makers: if we want to buy it, they will want to make it, and those who don’t will be so few that it will make no difference to the world. In the meantime, I’m not a natural fan of whataboutery or ‘they hate you’ conspiracies, but I find myself being tested.",
    "author": "",
    "published": "Sat, 15 Feb 2025 08:22:30 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/kit_cars_prior_column.jpg?itok=DdVpAh9k",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Opinion"
    ]
  },
  {
    "id": "7ffe6287-4fa9-43ef-b280-796d6403428b",
    "title": "Used Toyota GR Yaris 2020-2024 review",
    "link": "https://www.autocar.co.uk/car-review/toyota/gr-yaris-2020-2024",
    "description": "Nothing will top this hot hatchback before the ICE age is over, so buy one while you can Of all the exotica launched in 2020, it was Toyota’s GR Yaris that attracted the greatest interest, for it was an all-new, rally-inspired hot hatch that could thrill like a pure-bred sports car at half the price.This lovable rogue was originally conceived to be a homologation special for Toyota Gazoo Racing’s 2021 World Rally Championship contender (it had little in common with the regular Yaris), but Covid complications meant it would never actually hit the gravel.Toyota could have stuck a GR Yaris prototype in a museum and left it at that, then, but petrolhead boss Akio Toyoda made sure that it reached production – and everyone was extremely grateful that he did.Four years on, the GR Yaris is still riding a wave of success, with more than 32,000 examples having been sold – and now you can buy an early one for less than £25,000.WRC heroes Tommi Mäkinen, Jari-Matti Latvala, Ott Tänak and Kris Meeke helped to tune the GR Yaris into a B-road warrior of unparalleled ability, with its adjustable four-wheel drive system, 257bhp 1.6-litre three-cylinder turbo engine and light, diminutive chassis combining to take it to the top of the hot hatch class.“It’s just hugely impressive, all the time, and interactive and engaging enough with it that even though more near- or on-limit adjustability wouldn’t hurt, it’s still a handling hero of our time,” is how we described the GR Yaris when we road tested it back in 2021.The Japanese three-door was so light on its feet that it could be fired into a corner with laser-guided precision and shoot you out the other side with minimal inertia, thanks to its short wheelbase, wide track and light weight.Not only did it score top marks in our road test, it also won our Britain’s Best Affordable Driver’s Car contest ahead of the VW Golf GTI and Honda Civic Type R.The GR Yaris represented a high-water mark for fast road cars, offering exceptional levels of grip in both wet and dry conditions, thanks in part to that 4WD system.As standard, the front-to-rear torque distribution was 60:40, but if you wanted more traction, you could flick it to Track mode for a 50:50 split. Sport mode, meanwhile, tapped into the car’s playful side with a 30:70 configuration.And while the original GR Yaris felt like a new-age Subaru Impreza WRX or Mitsubishi Lancer Evolution, Toyota ensured that it came with all the trimmings – although that was determined by which specification the buyer chose.The Convenience Pack included 18in wheels, softer suspension and mod cons like a JBL sound system, while the Circuit Pack gave the car an extra layer of B-road swagger through stiffer front springs, stiffer anti-roll bars, uber-cool lightweight 18in BBS alloys and Michelin Pilot Sport 4S performance tyres.That would be our preference, of course. Past that point, it’s just a case of choosing between black, white or red paint.Superb to drive it may be, but the GR Yaris isn’t faultless. Visibility all round is pretty poor, especially out the back, and while it does have two rear seats, they are rather cramped, irrespective of your passengers’ height. Cabin isolation isn’t the best, either, and you will do well to get any more than 27mpg in mixed driving conditions.But do these niggles mean you should consider an alternative? Certainly not. The GR Yaris was a triumph and destined for greatness from the moment it first turned a wheel.And now that the updated GR Yaris has gone on sale at a whopping price of £44,250, the original is effectively a bargain.So if you want a fun, balanced, sweet-handling hot hatch for £25,000, you know where to look – and can thank us later.",
    "author": "",
    "published": "Sat, 15 Feb 2025 08:21:55 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/toyota-gr-yaris-2020-front-cornering-road.jpg?itok=TZ0GkmXh",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "fff2b316-ba00-46db-9e08-dd00be7a72be",
    "title": "Westbound Part 1: 10,000 Miles Across the U.S. on Ural Motorcycles",
    "link": "https://www.bikeexif.com/10000-miles-on-ural-motorcycles-pt-1",
    "description": "Westbound I remember when we pulled in for breakfast in Port Allegany and she came over to greet us. There was an immediate shift in energy. To this point, we were all silently asking ourselves what we’d gotten ourselves into. It had been two days and when we took our helmets off, I could see it on Greg’s face and in Mike’s blank stare. I could hear it in my team’s whispering of doubts back in NH. Here’s what I learned most from traveling 10,000 miles into the American West over 37 days: I didn’t really know what I was doing. After packing away our sleeping bags, we rolled through an unfamiliar town and found just the spot to shape what I would come to know most about this trip.…",
    "author": "Iron and Air",
    "published": "Sat, 15 Feb 2025 17:00:47 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/02/10000-miles-on-urals-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Lifestyle",
      "Motorcycle Vacations",
      "Iron \u0026 Air",
      "Triumph Scrambler",
      "Ural motorcycles"
    ]
  },
  {
    "id": "da85c701-672c-4bef-af82-5681c9fc432b",
    "title": "Grand Tourers: Two Royal Enfield Continental GT 650s built for the Alps",
    "link": "https://www.bikeexif.com/royal-enfield-continental-gt-650-malle",
    "description": "Whether they’re designing luggage or planning picturesque rallies through the European Alps, motorcycles are core to everything that Malle London does. But so is style. So it stands to reason that the vehicles Malle picks for their endeavors are as tasteful as the gear they create. These two Royal Enfield Continental GT 650s were built as the official support vehicles for the fourth running of the Great Malle Mountain Rally. Ridden by the rally’s support engineers—Malle co-founder Robert Nightingale and deBolex Engineering’s Calum Pryce-Tidd—the bikes were designed to be the last out and last in on the six-day regulation rally. Starting in Austria and finishing in Monaco, the Great Malle Mountain Rally crosses six countries over 2,000 km [1,243 miles], rising thousands of meters above sea level with more turns and switchbacks than you can count.…",
    "author": "Wesley Reyneke",
    "published": "Fri, 14 Feb 2025 18:06:59 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/02/royal-enfield-continental-gt-650-malle.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Malle London",
      "Royal Enfield",
      "Royal Enfield Continental GT"
    ]
  },
  {
    "id": "109068cd-6629-40aa-83f4-b924f0f1daf9",
    "title": "BMW Vision Driving Experience Prototype is Coming Soon!",
    "link": "https://www.bmwblog.com/2025/02/15/bmw-vision-driving-experience-vdx-heart-of-joy-reveal/",
    "description": "In an Instagram post, BMW teases one of its biggest reveals of the year: the BMW Vision Driving Experience (VDX). This prototype, referred to by BMW as a “test rig,” will be unveiled very soon.... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Sat, 15 Feb 2025 15:28:36 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2023/09/bmw-heart-of-joy-02-830x433.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Concepts",
      "concept",
      "Prototype",
      "VDX",
      "Vision Driving Experience"
    ]
  },
  {
    "id": "261cacfe-d262-4cc1-a15a-66a3ffdab06f",
    "title": "E30 M3 Too Pricey? Meet the BMW 320is, Its Underrated Twin",
    "link": "https://www.bmwblog.com/2025/02/15/bmw-320is-italian-m3-s14-e30-history/",
    "description": "The E30 M3 is – undeniably – an international icon. It routinely commands the highest prices at auctions, in the US and abroad, even over beloved legends like the E46 M3 and V8-powered E9X M3s.... First published by https://www.bmwblog.com",
    "author": "Steven Paul",
    "published": "Sat, 15 Feb 2025 13:00:08 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/02/bmw-s14-engine-e30-m3-00-528x830.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "3 Series",
      "320is",
      "E30 3 Series",
      "E30 320is",
      "E30 M3"
    ]
  },
  {
    "id": "57319f16-0586-410d-8894-997536352756",
    "title": "Brand New 12-Mile Chevy 454 SS Comes Out Of Storage After 35 Years",
    "link": "https://www.carscoops.com/2025/02/12-mile-chevrolet-454-ss-truck-is-7-4-liters-of-downsizing-antidote/",
    "description": "Classic muscle truck with a 7.4-liter V8 still has its original pre-inspection delivery covers and vintage tires",
    "author": "Chris Chilton",
    "published": "Sun, 16 Feb 2025 00:18:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/02/4f5rcvf54r32fgf-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Auction",
      "Chevrolet",
      "Classics",
      "Trucks"
    ]
  },
  {
    "id": "70c51a24-2282-482d-94d4-3102f478c964",
    "title": "This Delusional Honda Civic Thinks It’s A Mercedes Supercar",
    "link": "https://www.carscoops.com/2025/02/1996-honda-civic-transforms-into-a-mercedes-supercar/",
    "description": "The i-VTEC-powered coupe might be the solution for those who can't afford a genuine Mercedes",
    "author": "Thanos Pappas",
    "published": "Sat, 15 Feb 2025 22:39:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/02/1996-Honda-Civic-Mercedes-Supercar-main-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Asia",
      "Honda",
      "Honda Civic",
      "Honda Videos",
      "Mercedes",
      "Mercedes SLK",
      "Replica",
      "Tuning",
      "Video"
    ]
  },
  {
    "id": "9461dd99-6ad9-4100-a798-a4d7b998ad7e",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "df3752d6-7d01-4105-8529-d55dabc73a6e",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "7a13f0f9-d9ba-4d12-8c1c-4fa6f25a3a90",
    "title": "Lucid CEO Praises The 185-Mile EV, Judge Affirms Right To Repair Honda Passport Pricing In This Week's News Roundup",
    "link": "https://jalopnik.com/lucid-ceo-praises-the-185-mile-ev-judge-affirms-right-1851763727",
    "description": "If you want an electric vehicle with the longest range possible, you buy a Lucid Air. Specifically, you buy a Lucid Air Grand Touring with 19-inch wheels and an EPA range of 512 miles. Even Tesla can’t match that. Range anxiety? What range anxiety? And yet, in a recent interview, Lucid CEO Peter Rawlinson told Insid…Read more...",
    "author": "Jalopnik Staff",
    "published": "Sat, 15 Feb 2025 19:25:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/891a2126c3cb0a503bfda0621eee6d4c.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "honda",
      "tesla cybertruck",
      "tesla",
      "battery electric vehicles",
      "google",
      "collin woodard",
      "peter rawlinson",
      "att",
      "hodge",
      "electric truck",
      "rivian",
      "amazon",
      "erin marquis",
      "tesla inc",
      "donald trump",
      "bradley brownell"
    ]
  },
  {
    "id": "820ab81a-a1f2-4af4-875f-231fea784fe3",
    "title": "Nissan And Honda Will Merge No More, A Fake Buick GNX At The Superbowl And A Bad Pile Up Fit For The Movies In This Week's Car Culture Roundup",
    "link": "https://jalopnik.com/nissan-and-honda-will-merge-no-more-a-fake-buick-gnx-a-1851763728",
    "description": "The Superbowl Halftime show holds a grand American tradition of boring old white dudes complaining that they don’t understand popular culture, and the zeitgeist is moving on and leaving them behind. Kendrick Lamar’s stellar performance on Sunday night provided more entertainment than the game, throwing punches at two…Read more...",
    "author": "Jalopnik Staff",
    "published": "Sat, 15 Feb 2025 18:25:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/91983a4b9c5e83facc29fc72b9d94e74.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "toyota",
      "sports car",
      "i love you man",
      "aubrey",
      "collin woodard",
      "andy",
      "graham",
      "paul rudd",
      "mazda",
      "tim robinson",
      "convertible",
      "business finance",
      "owen bellwood",
      "roadsters",
      "donald trump",
      "mazda mx 5",
      "buick",
      "kendrick lamar",
      "toyota land cruiser",
      "ryan",
      "volkswagen beetle",
      "land rover defender",
      "buick regal"
    ]
  },
  {
    "id": "c1eb0519-bf81-433d-871e-4e85d1aa6428",
    "title": "Editor's Letter: I Got My Start with Jean Jennings. So Did Lots of People.",
    "link": "https://www.caranddriver.com/features/columns/a63756256/editors-letter-jean-jennings-remembered/",
    "description": "The formidable late editor from Car and Driver and Automobile Magazine was actually quite disarming in person, but she armed a generation of journalists by her example.",
    "author": "",
    "published": "Sat, 15 Feb 2025 21:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "880c4a5d-7e3b-46d3-8dae-6894e92b4d09",
    "title": "Mercedes 300SL Gullwing Among Classic Cars at Art Academy Auction",
    "link": "https://www.caranddriver.com/news/a63802476/mercedes-300sl-gullwing-classic-car-art-academy-auction/",
    "description": "Not everything that'll cross the block is priced out of reach, from a restored MGB GT Special to a '67 Volvo 1800 S.",
    "author": "",
    "published": "Sat, 15 Feb 2025 18:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "e1bc6862-5820-4471-9afe-cb0fbe14b3ac",
    "title": "Evolution of an Icon: The MZR 240z",
    "link": "",
    "description": "﻿ The Datsun 240Z was never the problem. It was the solution. The answer to a world where European sports cars carried steep price tags and Japanese cars were still thought of as nothing more than basic transportation. For years, Japanese cars in America were what students drove to class, what families bought when they were new, when money was tight, or what commuters relied on when fuel prices spiked. They were appliances, used for economy, and durability. It’s easy to look back on them now as more than products of their time. But they weren’t. They filled parking lots at office buildings and grocery stores, racked up hundreds of thousands of miles on city roads, and lived out their lives as forgettable hand-me-downs, passed from one generation to the next until they rusted into the ground. They were not the cars enthusiasts dreamed about, not the machines people pinned on their walls or took out on Sunday after church for a little exercise. Today we love the quirky, endearing nature of the classic Japanese econobox, but back then? It was a tool.  The Z was one of the cars that changed everything. It was Japan’s bold declaration, a machine shaped by the same relentless craftsmanship and discipline that defined the country’s post-war industrial rise. It embodied the Japanese philosophy of kaizen, continuous improvement.  The Z was beautiful, with the long nose of a Ferrari, and an inline-six that, despite its modest origins (and with some SU carburetors installed), could sing when you need it to. In 1970, it was fast enough, with a chassis that felt nimble, eager, and alive in a way most Americans had never experienced in something that did not wear a European badge. It was still affordable, but it was no longer just transportation. It was undeniably a sports car. But time does not stand still. Roads get wider. And for better or worse, cars get faster, stop better, turn sharper, and expectations shift. The Z’s magic is still there, but modern traffic, modern brakes, and modern speed put it in a different context. It still thrives on momentum and chassis respect. But, time marches on. The engineers at Nissan did not create the perfect Z, they created the best one they could for the money, theirs, and yours. So, as is often the case as we make engine noises in our garage over winter, pontificating on what we can modify, and how things could be better. The question is not whether the Z is still great as it was, it is how much better could it be? For Rahail Tariq, the Z had been lurking in his subconscious, a shape that had stuck with him from flipping through magazine pages. When he finally got his first 240Z, his first classic car, it was white, with black sills and a set of 260Z wheels that he did not even know were incorrect at the time. He bought it online in 2005, not as an expert but as someone drawn to its presence, and it’s silhouette. That car, with all its patina and imperfections, was the seed that eventually grew into MZR Roadsports.   Rahail’s connection to cars ran deeper than just his own discoveries. His father, a technician in the 1970s, was always bringing home interesting machinery, M5s, Mini Coopers, Daimlers, even an E-Type Jaguar. Growing up around those cars, seeing the way his father worked on them, improved them, and understood them, gave him an appreciation for cars as something alive, something that could always be made better. The Z was just the first car where Rahail realized that he was the one who would have to push it forward. In the UK, where classic Japanese sports cars did not have the same deep-rooted restoration culture as Porsches or E-Types, Rahail found himself frustrated. Nobody was building the Z the way he envisioned it. No one was taking it to its logical next step, not just restoring but refining, improving. That search led him to Martin Ryland, a Datsun expert who eventually became his collaborator and helped shape the vision of MZR. Restomods are sometimes frowned upon, seen as tampering with an icon, but consider this. Given the opportunity, is it possible Nissan would have never left the Z as it was? If the company had continued refining it with an unlimited budget, what would it have looked like? A lighter chassis, a more rigid structure, and an engine with sharper response and a little more urgency. That is exactly what MZR is doing, finishing what the original engineers, given enough time, could have done, maybe even would have done, but did not. Their Evolution models, built with bespoke carbon-fiber bodywork, are not just about chasing numbers. Yes, the RB 3.4L DOHC straight-six delivers over 300 horsepower, and yes, the six-speed manual brings precision to every shift, but the real magic is in how it all comes together. It is a 240Z honed and distilled, shaped by the same kaizen philosophy that defined its creation, an ongoing pursuit of refinement, balance, and purpose. The 240Z never needed saving, it was never the problem after all. But it deserved to be honored, not just looked at through the lens of nostalgia. It was built to be driven, and MZR has made sure that it still begs to be. Continue...",
    "author": "",
    "published": "Fri, 14 Feb 2025 12:04:49 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/02/12075145/18.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "320e74fb-8de7-44dd-bf77-6b00d2c279d1",
    "title": "The Right Way: Maxi-mum Adventure",
    "link": "",
    "description": "It’s akin to landing a dream job you lied through your teeth to get. You walk in on day one, staring down a pile of responsibilities you aren’t remotely qualified for. The job? Managing a car with a 1.5-liter turbo engine running around 2 bar of boost mounted where the groceries used to go. No airbag, no abs, no training wheels. Just figure it out before you get fired or, in this case, sent backward through a guardrail. Your new boss, (who ignores OSHA and HR) the Renault R5 Maxi Turbo, expects results.  Juan Carlos Fernandez knows what it’s like to start from nothing. In 1963, his family fled Cuba with an infant Juan in tow, leaving behind their home, their belongings, everything they had ever known. They landed in Puerto Rico with no roadmap, just the need to survive. His parents worked tirelessly to rebuild, instilling in him the kind of work ethic that doesn’t ask for shortcuts. By the time he was a teenager, cars had his full attention. His cousins were in the auto business, and he scraped together whatever he could to buy his first car, a $200 project. One car turned into two. Two turned into three. The hustle never stopped. If he needed more money, he worked harder. Decades later, that drive turned into Ferco Motors, the dealership he owns today.  A friend once told him the R5 was “so ugly it’s beautiful,” but to Juan, it was just beautiful. It had character, presence, and the kind of raw, unfiltered driving experience that modern cars have lost. It wasn’t built for straight-line speed or effortless performance, it was built to be driven hard, to demand something from the driver. And that’s exactly what drew him to it. The R5 is a product of Renault’s obsession with Group B, the golden era of rally racing where manufacturers built the most extreme machines they could get away with. The FIA required manufacturers to build a limited number of road-going versions to compete, and Renault’s answer was to take their humble economy hatch and reimagine it into something wild. At risk of boiling things down, and for the sake of brevity we’ll just say the engine was moved to the back, the body was widened, and the power was turned up The result was the R5 Turbo. That car made its competition debut in 1980 at the Tour de Corse, a rally known for its tight, twisting tarmac stages. French driver Jean Ragnotti piloted the car and, despite being up against much more developed machines, showed its potential. The real breakthrough came the following year when Ragnotti drove the R5 Turbo to an outright victory at the 1981 Monte Carlo Rally. It was undoubtedly good, but... was more possible?       Enter the R5 Maxi Turbo, the ultimate version, the final boss. It was built to compete with the Audi Quattro and the Peugeot 205 T16. Definitely a tough crowd. Renault brought in Bozian Racing, a French motorsport engineering firm known for squeezing every last drop of performance out of small-displacement engines. In this case they pulled 350 horsepower out of Renaults 1.5L engine. They made the car stiffer, and increased the work aerodynamics were doing.  It had some success in competition, and proved its mettle on tarmac, but as all-wheel-drive rivals took over, its time on the dirt and in the spotlight, faded.  Juan’s R5 wasn’t perfect when he bought it. It had been sitting, neglected, and the first drive was a disappointment. No boost, a failing clutch, just a reminder that even the greats need work, and time spares no one, and no thing. But with the right expertise, the right people, and a lot of effort, it came back to life, a worthy tribute to the Group B legend.  Juan Carlos Fernandez didn’t get here by taking the easy way. He came from nothing, worked for everything, and never asked for a shortcut. The R5 doesn’t give one either. It just wants you to show up for work. Continue...",
    "author": "",
    "published": "Fri, 07 Feb 2025 09:00:56 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/02/06155529/RenaultR5MaxiTurbo-websized-10.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "7877237e-da8d-4854-a629-d3f8e621651c",
    "title": "5+7 = V12: A Custom BMW Super Saloon",
    "link": "https://www.speedhunters.com/2025/02/5-plus-7-equals-v12-a-custom-bmw-super-saloon/",
    "description": "My dream collection wouldn’t be complete without a Lamborghini Miura SV, a Mercedes-Benz SL70 AMG and an Alpina B12 Coupé. I’d also have a Mercedes-AMG S65 as a daily and a Ferrari Enzo to abuse on track. Though I think the most achievable ‘dream’ V12 of mine is an older Aston Martin DBS, in black, […] The post 5+7 = V12: A Custom BMW Super Saloon appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Sat, 15 Feb 2025 06:30:01 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "5-Series",
      "BMW",
      "E34",
      "E38",
      "europe",
      "Lithuania",
      "M73",
      "M73B54",
      "v12"
    ]
  },
  {
    "id": "eea80b74-5344-4a71-9e4a-6f4c4f4366b8",
    "title": "Project Rough: The Mega Update",
    "link": "https://www.speedhunters.com/2025/02/project-rough-mega-update/",
    "description": "It’s mind-boggling to me that 24 months have already passed. However, the fact that my youngest is approaching three and constantly tries to have full-blown conversations with me confirms it. So, what about Rough, the ER34 Nissan Skyline GT-T? Is the project still a project? Do I still even have it? The latter question doesn’t need to be addressed […] The post Project Rough: The Mega Update appeared first on Speedhunters.",
    "author": "Ron Celestine",
    "published": "Fri, 14 Feb 2025 02:30:16 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Build",
      "Carbon",
      "Carbon fiber",
      "carbon fibre",
      "DIY",
      "er34",
      "japan",
      "Nissan",
      "project car",
      "Project Cars",
      "Project Rough",
      "R34",
      "SH Garage",
      "Skyline",
      "Speedhunters Garage",
      "Speedhunters Project Cars"
    ]
  },
  {
    "id": "83c72e72-7f3e-430c-823b-9bd22e52b8d6",
    "title": "QOTD: What Do You Want to Know About the Updated 2025 Hyundai Ioniq 5?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-what-do-you-want-to-know-about-the-updated-2025-hyundai-ioniq-5-44512066?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "I am in California today because I have been driving the 2025 Hyundai Ioniq 5. I have some more face time with Hyundai folks on the schedule. What do you want to know?",
    "author": "Tim Healey",
    "published": "Sat, 15 Feb 2025 02:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/14/20251/qotd-what-do-you-want-to-know-about-the-updated-2025-hyundai-ioniq-5.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "17c2f812-82ce-4df9-8573-954bcaee49b1",
    "title": "Used Car of the Day: 2016 BMW 740i",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-2016-bmw-740i-44512060?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today we have a 2016 BMW 740i with the M-Sport package for your perusal.",
    "author": "Tim Healey",
    "published": "Sat, 15 Feb 2025 01:02:17 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/14/20011/used-car-of-the-day-2016-bmw-740i.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  },
  {
    "id": "f5eb3c46-0a11-4639-8d9d-c3c2462a3f55",
    "title": "Thinking about buying a Ford F-150? Here are other top choices to consider",
    "link": "https://www.autoblog.com/news/thinking-about-buying-a-ford-f-150-here-are-other-top-choices-to-consider",
    "description": "Ford is at the top in towing and payload, but competing full-size pickups beat the Blue Oval in other ways.",
    "author": "Larry Printz",
    "published": "Sat, 15 Feb 2025 16:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyODM1MTgyODkyMjk1Njg5/2025-ford-f-150-lariat_01.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "GMC",
      "News",
      "1500",
      "GMC",
      "Ram",
      "Sierra 1500",
      "Toyota",
      "Ram",
      "f-150",
      "ford",
      "ram 1500",
      "Chevrolet",
      "gmc sierra 1500",
      "chevrolet silverado",
      "Ford",
      "Tundra",
      "Chevrolet",
      "Toyota Tundra",
      "F-150",
      "Silverado 1500",
      "Toyota"
    ]
  },
  {
    "id": "86558397-b098-4e9c-8ef4-a36d7faa3836",
    "title": "Is the 2025 Tesla Model Y worth $46,490?",
    "link": "https://www.autoblog.com/news/is-the-2025-tesla-model-y-worth-46490",
    "description": "Yes, it’s better than before, but so are its competitors.",
    "author": "Larry Printz",
    "published": "Sat, 15 Feb 2025 02:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyMDI3NTQ2MjM2MTY4MTY4/tesla-model-y-juniper.png",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Model Y Juniper",
      "News",
      "Tesla Model Y",
      "Tesla",
      "EVs",
      "Model Y",
      "tesla",
      "Tesla Model Y Juniper"
    ]
  },
  {
    "id": "4c8c6e3e-283d-4eea-bfbf-bb2e8d891b54",
    "title": "Ather Rizta long term review, 1,200km report",
    "link": "https://www.autocarindia.com/bike-long-termer/ather-rizta-long-term-review-1200km-report-434554#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "In the build-up to the Rizta’s launch, Ather had released some very bold advertisements showcasing how big the scooter’s seat would be, featuring a prominent Indian professional wrestler. Naturally, I initially took all of that with a grain of salt, but now that I’ve actually used the Rizta extensively with a pillion aboard, I can confirm this is a really spacious and comfortable seat. Pillions of all shapes and sizes have sat behind me, and even the taller and heftier ones were comfortable. The backrest (standard on the Z variants) also goes some way in keeping the passenger comfortable. The well-padded seat is one of the most spacious units around, backrest keeps the pillion comfy. With just the rider aboard, the Rizta’s ride can feel a little stiff, although it’s never uncomfortable. However, when you’re carrying a passenger, this setup pays dividends and shields you from all but the worst bumps Mumbai has to offer. That said, the Rizta’s suspension is a bit of a double-edged sword, but we’ll come to the bad bits later on. As anyone who has ever ridden with a pillion will tell you, if your vehicle has a less-than-ideal throttle response, it’s going to be unpleasant, especially in stop-and-go traffic, where you need to give minute inputs almost constantly. What I absolutely love about the Rizta is its crisp and direct throttle response, which allows you to modulate the throttle very precisely in stop-and-go traffic without causing any unwanted herky-jerkiness. Accelerator response feels well-tuned in both modes, is precise and direct. What isn’t nice in our pothole-littered city, though, is the stiff front fork. It thuds over every single bump, and the big ones, especially, make their presence felt with a rather rude jolt to the rider’s hands. The 450X-derived front fork is too stiff, which hampers overall comfort over bumps. Another problem is that when you’re making a lock-to-lock U-turn, the Rizta’s handlebar fouls your knees. On a scooter with so much space in most other regards, the lack of it in this area stands out like a sore thumb. Ather has repurposed a lot of what was on the sporty 450 here, which is why these downsides have also transferred over to the Rizta. Lock-to-lock U-turns require taller riders to move their knees out of the way. But in the grand scheme of things, these are two issues I can look past, given how light the Rizta is on my pocket and, otherwise, how well it handles the daily grind in general. And since the Rizta and the 450 are quite closely related under their distinctly different skins, there are also some strong points – like the crisp handling – that I’m thoroughly enjoying. Also See: Ather Rizta long term review, 700km report",
    "author": "Dinshaw Magol",
    "published": "Sat, 15 Feb 2025 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250212040330_A1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "de8f75c6-0c3a-4db5-a991-15632f5afc8c",
    "title": "Simple One review: Worth the wait?",
    "link": "https://www.autocarindia.com/bike-reviews/simple-one-review-worth-the-wait-434520#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Few products have had as tumultuous a journey from concept to reality as the Simple One. Shown first in 2021 with a promise to go on sale in 2022, it eventually went on sale in mid-2023. Fast forward to 2025, and after 1,817 units sold (as per VAHAN data), Simple Energy has updated the One. Simple One updates for 2025 The main update is that it now has a claimed 248km IDC range, up from the original 212km. It has the same 5kWh battery capacity as before, and the company says this increase has been achieved via some electronic trickery and a more efficient drivetrain.  There was no way to test those numbers in our limited time with it, but what I can tell you is that in 45km of mixed riding in all four modes (Eco, Ride, Dash and Sonic), the battery dropped from full to 76 percent SOC. Simple One design, performance This was my first time seeing a Simple One in the flesh, and I thought it was a smashing-looking thing, even if its sharp and angular design is somewhat similar to the Ather 450’s. Quality, too, is at a pleasantly high level, and there are no flimsy plastics or uneven panel gaps. At 30 litres, the One doesn’t have the biggest boot in the segment, but its shape allows you to fit an ECE-certified full-face helmet inside comfortably.   And once you swing your leg over it, you’ll discover the One has the go to match the show. With 8.5kW and 72Nm of torque on tap, acceleration in any mode is peppy, and even in the lowest mode, it can climb flyovers without slowing down. Achieving and maintaining the claimed 105kph top speed is effortless in Dash and Sonic. However, acceleration from a standstill doesn’t feel as spirited as in the Warp mode on an Ather 450. Simple One areas of improvement The problem is that in both of the top two modes, the scooter surges forward for a second or two even once the accelerator is closed, which can put you in trouble, considering the strong performance. We reported this issue when we first rode the prototype in 2022, and it’s disappointing that it hasn’t been resolved. Simple says it is aware of it and is working on a solution, but I think this should have been ironed out before customer deliveries began.   While the scooter’s sporty design language may lead you to believe that it will be stiffly sprung, the suspension setup is rather plush, and the One is one of the more comfortable electric scooters I’ve experienced. However, at 136kg, its weight isn’t something that you can shake off, and what only compounds matters further is the tall (for a scooter) 796mm seat height.  Simple One price, verdict Currently, Simple Energy has only 10 showrooms operational. The company says it plans to scale up to 150 showrooms by March 2026 and bring in a generation two product (the one we rode was termed ‘version 1.5’) to bolster its portfolio. Ultimately, all of that is in the future, and Simple still has much to prove. Until Simple Energy scales up its dealer network and builds a good after-sales reputation, the Rs 1.66 lakh One and its more affordable sibling, the Rs 1.45 lakh Dot One, will remain niche offerings.    All prices ex-showroom, Bengaluru Also See: Simple Energy One prototype review: A simple answer?",
    "author": "Dinshaw Magol",
    "published": "Tue, 11 Feb 2025 11:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250210021615_2.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "f47af110-6ee1-41c3-9231-d10049496eac",
    "title": "Maruti Swift S-CNG review: Effortless efficiency",
    "link": "https://www.autocarindia.com/car-reviews/maruti-swift-s-cng-review-effortless-efficiency-434576#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "The Maruti Swift has always been known for its efficiency, and the latest iteration, featuring a new three-cylinder Z-series petrol engine, continues this legacy. In real-world tests, it delivers an impressive 14kpl in the city and 19kpl on highways. To further enhance fuel savings, Maruti has introduced a compressed natural gas (CNG) variant, priced between Rs 8.20 lakh and Rs 9.20 lakh. This CNG version is available only in mid-level trims and comes at a premium of approximately Rs 90,000 over the petrol variant. Maruti Swift S-CNG design Our test Swift S-CNG is based on the ZXI trim, which is one step below the top-spec ZXI+. This means it lacks features like front fog lamps and dual-tone alloy wheels, instead sporting silver- finished 15-inch alloys. A noticeable addition is the CNG filler cap on the right rear fender that, unfortunately, looks like an aftermarket job, which it isn’t. However, the overall design remains youthful and retains the fourth-generation Swift’s signature curves and silhouette. Maruti Swift S-CNG interior Inside, the Swift maintains its minimalist, all-black cabin layout. While it is functional and user- friendly, certain omissions, such as the absence of cruise control buttons on the steering wheel, are evident. The monochrome multi-information display (MID) looks quite basic, but an interesting addition is the dual fuel gauge – one for petrol and another for CNG. Seat comfort The 7-inch touchscreen infotainment system, though nice to use, appears small within its oversized bezel. Seat comfort is good, ergonomics are spot on, and the rear seats offer adequate space for two adults. However, practicality takes a hit due to the 55-litre CNG cylinder occupying most of the boot, leaving just enough room for a soft cabin bag. The visible CNG cylinder mounting and lack of boot cladding don’t make for a pleasing sight. Additionally, the CNG variant does not include a spare tyre. Equipment list While on that topic, the Swift S-CNG has a decent list of features. These include automatic LED headlamps, a rear wiper and washer, a 7-inch touchscreen infotainment system with six speakers, wireless Android Auto and Apple CarPlay, automatic climate control, rear AC vents, a wireless charger, and crucial safety features such as an electronic stability program (ESP), six airbags, and hill-start assist. However, it lacks fog lamps and a rear-view camera. Maruti Swift S-CNG performance and efficiency By default, it switches on in petrol mode, and later switches to CNG automatically. By default, the Swift S-CNG starts on petrol, and once the engine reaches optimal temperatures, it automatically switches to CNG with an audible mechanical ‘clang’. We’re happy to report that despite being nearly 70 kilograms heavier than its petrol counterpart and 12hp and 10Nm down on power and torque, respectively, the Swift does its urban duties very competently. This 1.2-litre three-cylinder Z-Series engine’s clear focus on drivability and crisp throttle responses (even in CNG mode) ensures that most owners will find no reason to complain. And while it doesn’t warrant constant gear shifts to get a move on, owners are likely to appreciate its light clutch and buttery-smooth 5-speed manual transmission, which not only removes the stress from driving but makes for a pleasurable driving experience. 0-100kph time Maruti Suzuki Swift CNG: performanceSpeedCNG modePetrol mode0-20kph1.23s1.55s0-40kph3.22s3.05s0-60kph6.26s5.57s0-80kph9.77s8.51s0-100kph15.54s13.03s20-80kph (in 3rd gear)14.75s13.22s40-100kph (in 4th gear)21.5s9.26s Performance tests show the Swift S-CNG accelerates from 0-100kph in 15.5 seconds, which is 1.5 seconds slower than the petrol variant. In rolling acceleration tests, too, it was slower than its petrol-only counterpart, taking 1.5 seconds more in the 20-80kph third-gear sprint and 3.3 seconds more in the 40-100kph fourth-gear test. In our real world tests, the Swift S-CNG's overall fuel efficiency is identical to its claimed range. More importantly, the Swift S-CNG excels in fuel efficiency. In CNG mode, it returned 24.35 km/kg in city conditions and an impressive 31.38 km/kg on the highway, averaging 27.85 km/kg, which is close to the claimed figures. Maruti Swift S-CNG ride and handling Even in its CNG avatar, the Swift remains a fun to drive car. The rear suspension is slightly stiffer than the petrol variant to accommodate the additional weight of the CNG cylinder. The ride remains comfortable within city limits, but at highway speeds, sharper movements can be felt inside the cabin. The steering is light and effortless, with a natural returnability after turns. On the whole, the Swift S-CNG remains just as fun and enjoyable to drive as it is expected to be. Maruti Swift S-CNG verdict The Swift S-CNG’s dearth of luggage space and a missing spare tyre make it less practical for long highway journeys. Buyers looking for the absolute top-spec variant with all features may also find it lacking. However, its user-friendly nature, smooth driving experience, and outstanding fuel efficiency make it an excellent economical choice for city commutes. Also, see: Hyundai Exter review: Punches above its weight Tata Punch review, test drive 2024 Maruti Suzuki Dzire review: India's favourite sedan massively updated",
    "author": "Saumil Shah",
    "published": "Sat, 15 Feb 2025 08:30:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250214043052_140.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "26b35caf-71e7-4621-a21c-cd3de7502465",
    "title": "2025 Audi Q8 long term review, 2,300km report",
    "link": "https://www.autocarindia.com/car-long-termer/2025-audi-q8-long-term-review-2300km-report-434494#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Sandy brown, misty gold, light beige. That’s how people described the Q8’s new Sakhir Gold paint shade. The colour proved to be a big talking point in the time the car was with me. Most loved it, often saying it was nice, different and eye-catching. Indeed, in a world of greys and silvers, the Q8’s Sakhir Gold – muted as it is – catches your eye. I have to hand it to Audi here because, in the month that I’ve had it, there have been so many who have come up and asked me about the car, most starting with the colour, of course. As is the norm, the touchscreens are a pain to use, but the media knob is a saviour. Then, it’s the insides they like. The fit and finish are good, and the dark brown seats in our car lend the cabin a nice, rich look. There was high praise from a Defender owner, too; however, he was quick to notice the lack of certain equipment, such as ventilated or massage seats and a powered steering wheel adjust. These are odd misses for an otherwise well-specced car that has soft-close doors, a Bang \u0026 Olufsen sound system, four-zone climate control, a panoramic sunroof, and sliding rear seats. There are also the twin touchscreens, which I am not a fan of. Oddly enough, they started flickering on two separate occasions when answering calls on the car’s native operating system. It has not shown up since. Another oddity with the system is the radio tuner. The UI is not intuitive at all, and there’s no way to see the frequency during a scan. As a result, it’s easier to use voice commands to select a frequency. Tuning the radio is frustrating – controls are buried deep, and there’s no frequency readout. While there’s no third row, the second row slides back and forth, allowing us to fit a large-framed map flat on the boot floor. The rear seats split 40:20:40 (instead of 60:40), so I could carry a long, flat-packed Ikea bookcase despite four of us in the car. Delivering party supplies for one of my wife’s events was also easy enough, and the Q8 swallowed about 40 or so backpacks and all the party supplies. We also took the car to Goa for a short vacation – this time without our kids – so we had less to carry, and the 605-litre boot was more than enough for our two suitcases and laptop bags. The boot lid does taper, but at 605 litres, it can manage a lot. The drive to Goa proved to be redemption for the Q8’s 3.0-litre V6 turbo-petrol engine. It makes 340hp and 500Nm, and power is channelled to all four wheels via Audi’s Quattro all-wheel-drive system. I remember describing the performance as ‘more than adequate’ when I first reviewed the car in South Africa, but South Mumbai is another story. It feels very lethargic in constant start-stop traffic, and that, along with its size, makes it feel ponderous. A dedicated slot keeps the key fob safe and handy, and it feels nice to use. Getting out onto open roads then was a relief and a reminder of how nice the engine can be. Pop the car into Dynamic mode, and it’s sprightly enough. Overtaking is easy, and with the engine kept in a lower gear (higher revs), there isn’t that pause for a kickdown every time you need to get by. Even when you extend the engine, refinement is good, and you get a nice, sporty note. The trip to Goa was also redemption – only relatively speaking – for the TFSI engine’s drinking habits. Getting it past 5kpl in town is a challenge, and I managed it only once. Out on the two highway runs, though, we managed 9.3kpl (Mumbai to Goa) and 10.1kpl (Goa to Mumbai), measured tankful to tankful. You have to bear in mind that while these figures are poor in absolute terms, they are par for the course for petrol SUVs in this class. The glove box is small and not cooled, so no chilled drinks on long drives. It has been a busy first month for the Q8 in our fleet: lots of in-city running carrying cargo of various shapes and sizes, and a trip to Goa, too. What’s next? I’m sure it’s going to be a trip to Mahabaleshwar with Hormazd soon. Stay tuned for that ‘Maha’ test. Also see: Audi RS Q8 Performance bookings open New ICE-powered Audi A6 global debut on March 4 Audi revises its model naming strategy again",
    "author": "Sergius Barretto",
    "published": "Sat, 15 Feb 2025 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250212052635_Audi_Q8_long_term_review_front_static.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "21ef13e1-6eff-41d6-b088-02da34920260",
    "title": "Mahindra BE 6, XEV 9e record 30,179 bookings on day 1",
    "link": "https://www.autocarindia.com/car-news/mahindra-be-6-xev-9e-together-record-30179-bookings-434583#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Mahindra BE 6 and XEV 9e electric SUVs collectively amassed 30,179 bookings, which opened on Friday. The split between the XEV 9e and BE 6 is 56 percent and 44 percent, respectively. Notably, the Pack Three top model with a 79kWh battery pack was the most booked across the two electric vehicles. Deliveries range between six months from March to August 2025 Prices for BE 6 start from Rs 18.90 lakh, Rs 21.90 lakh for the XEV 9e The above mentioned ex-showroom prices don't include the charger cost Considering that about 1 lakh EVs were sold in 2024, Mahindra’s record day 1 bookings are impressive. Bookings for the BE 6 and XEV 9e are open across select Mahindra dealerships nationwide and on the official website. It should be noted that production capacity is capped at 5,000 units a month, and the same will be delivered in the six months from March to August.  Mahindra BE 6: Delivery timeline, battery packs, range  Mahindra BE 6 price list (ex-showroom)Variant PriceDelivery Pack One (59kWh)Rs 18.90 lakhAugust 2025Pack One Above (59kWh)Rs 20.50 lakh August 2025Pack Two (59kWh)Rs 21.90 lakh July 2025Pack Three Select (59kWh)Rs 24.50 lakh June 2025Pack Three (79kWh)Rs 26.90 lakh Mid-March 2025 The BE 6 comes in two states of tune – the 59kWh variants make 231hp, while the 79kWh variants produce 286hp; torque is rated at 380Nm for both battery packs, and they come in rear-wheel-drive (RWD) guise only. The larger BYD-sourced battery pack has an ARAI-claimed range of 682km, while the smaller battery pack promises a range of 556km.  Also, see: Mahindra BE 6 price, variants, colours explained From BE 6 Pack One to BE 6 Pack Three Select, Mahindra is offering the 59kWh battery pack. Only the BE6 Pack Three top model gets the 79kWh battery pack, which is also the largest. For more details, read our BE 6 review. Mahindra XEV 9e: Delivery timeline, battery packs, range Mahindra XEV 9e price list (ex-showroom)Variant Price Deliveries Pack One (59kWh)Rs 21.90 lakh August 2025Pack Two (59kWh)Rs 24.90 lakhJuly 2025Pack Three Select (59kWh)Rs 27.90 lakhJune 2025Pack Three (79kWh)Rs 30.50 lakh Mid-March 2025 The XEV 9e Pack One, Pack Two and Pack Three Select variants all use a similar 59kWh battery, which powers a 231hp and 380Nm rear axle-mounted motor with an MIDC range of 542km on a single charge. The claimed charging time is 8.7 hours on a 7.2kW AC charger, 6 hours on an 11.2kW AC charger and 20 minutes on a 140kW DC fast charger.   Also, see: Mahindra XEV 9e price, variants and features explained The Mahindra XEV 9e Pack Three top model comes with a larger 79kWh battery that powers a 286hp and 380Nm rear motor and is said to go 656km on one charge. Mahindra claims charging times of 11.7 hours (7.2kW AC charger), 8 hours (11.2kW AC charger) and 20 minutes (175kW DC fast charger). You can check out our XEV 9e review for a detailed report on the e-SUV. Also, see: Mahindra BE 6 price, variants, colours explained Mahindra XEV 9e price, variants and features explained",
    "author": "Uday Singh",
    "published": "Fri, 14 Feb 2025 21:11:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250214093417_Mahindra_BE 6_XEV_9e_record_bookings_on_day_1.png",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "697440cc-2992-4298-8f50-c807f0bd32db",
    "title": "Tata Curvv on discount for the first time",
    "link": "https://www.autocarindia.com/car-news/tata-curvv-on-discount-for-the-first-time-434581#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Tata Motors is offering attractive discounts on both the ICE-powered Curvv and Curvv EV for the first time. These benefits will be available until February 28 and apply to MY2025 stock of both models. Additionally, the ICE-powered Curvv gets a cash discount for MY2024 stock. The discount structure otherwise consists of scrappage and exchange bonuses, but buyers can choose only one of them. MY2025 ICE-powered Curvv gets discounts up to Rs 20,000 ICE-powered Curvv gets up to Rs 50,000 in discounts for MY2024 units Curvv EV gets discounts of up to Rs 20,000 only on MY2025 units Disclaimer: Discounts vary from city to city and are subject to stock availability. Please check with your local dealer for exact figures. Tata Curvv: up to Rs 50,000 off MY2025 stock of all ICE-powered Curvv variants are available with discounts of up to Rs 20,000. Buyers who go with MY2024 Curvv models can avail up to Rs 50,000 in discounts regardless of the variant they select. We've also confirmed with Tata dealers that larger discounts for the ICE-powered Curvv are possible, but the exact amounts remain unclear. Three engine options are available with the Curvv, with the sole diesel offering being a 1.5-litre turbo-diesel unit that generates 115hp and 260Nm of torque. Entry-level Curvv variants get a 1.2-litre turbo-petrol engine that makes 120hp and 170Nm, whereas pricier trims feature a 1.2-litre turbo-petrol mill producing 125hp and 225Nm. All engines can be had with a 6-speed manual or 7-speed dual-clutch transmission. Tata Curvv EV: up to Rs 20,000 off The Curvv EV gets discounts of up to Rs 20,000 on MY2025 stock. As Tata's current flagship electric offering, the Curvv EV comes equipped with a 45kWh battery pack as standard, which produces 150hp and 215Nm of torque. Higher variants sport a 55kWh battery pack that amps up the power output to 167hp. Tata Curvv discounts for February 2025Scrappage bonus (Rs)Exchange bonus (Rs)Consumer discount (Rs)Curvv EV (MY2025)20,00019,048-Curvv (MY2025)20,00013,793-Curvv (MY2024)--30,000 The Tata Curvv range is priced between Rs 9.99 lakh and Rs 19.19 lakh, whereas the Tata Curvv EV line-up starts at Rs 17.49 lakh and tops off at Rs 21.99 lakh. Also see: Tata Curvv EV gets up to Rs 70,000 discount this month Tata Motors announces high-speed EV charger network, 4,00,000 EV chargers by 2027 Tata Curvv vs Citroen Basalt comparison",
    "author": "Viraaj Bhatnagar",
    "published": "Fri, 14 Feb 2025 18:06:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250214052639_20241029020818_Tata Showroom BG Blur.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  }
]
