[
  {
    "id": "d3ac474d-588d-436b-b922-c6a5e9eab77d",
    "title": "3-Mile 2023 Ducati Streetfighter V4 Lamborghini at No Reserve",
    "link": "https://bringatrailer.com/listing/2023-ducati-streetfighter-v4-lamborghini-6/",
    "description": "This 2023 Ducati Streetfighter V4 Lamborghini is one of 630 units produced in collaboration with Lamborghini and features dedicated livery and design cues that recall Sant’Agata’s Huracán Super Trofeo Omologato (STO). This example was purchased new by its current owner and has been ridden 3 miles. Power is from a liquid-cooled 1,103cc Desmosedici Stradale V4 mated to a six-speed transmission with a slipper clutch, and the bike is finished in Citrea Green with Dac Orange and black accents. Equipment includes exposed carbon-fiber trim, a black solo seat, 17″ forged alloy wheels, triple Brembo disc brakes, semi-active Öhlins suspension, an Öhlins steering damper, and a single-sided aluminum swingarm along with a desmodromic valvetrain, electronic fuel injection, ride-by-wire elliptical throttle bodies, and an Akrapovič full titanium racing exhaust system. This Streetfighter V4 Lamborghini is now offered at no reserve on dealer consignment in Missouri with manufacturer’s literature, factory accessories, and a clean Oklahoma title.",
    "author": "bringatrailer",
    "published": "Wed, 21 May 2025 00:02:14 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/05/2023_ducati_streetfighter-v4-lamborghini_p7456-19-96703-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "94a02e7d-70ff-45ba-87a6-c2d36dc5eda6",
    "title": "2023 Lamborghini Huracan Sterrato",
    "link": "https://bringatrailer.com/listing/2023-lamborghini-huracan-sterrato-8/",
    "description": "This 2023 Lamborghini Huracán Sterrato is finished in Bianco Monocerus with multi-color livery decals over Nero Ade leather and Alcantara. The car was specified with the Grigio Style and Branding packages as well as carbon-fiber Sport seats, rally-style front light pods, black wheel arch flares, a central roof-mounted air intake, carbon-ceramic brakes, magnetorheological suspension, 19\" Morus wheels, and three ANIMA driving modes plus a Sterrato-specific Rally mode. Power is provided by a 5.2-liter V10 that drives all four wheels through a seven-speed dual-clutch automatic transaxle and a mechanically locking rear differential. Purchased new by the seller, this Sterrato has 2,700 miles and is now offered with a photocopy of a window sticker, a clean Carfax report, and a New Hampshire title.",
    "author": "bringatrailer",
    "published": "Wed, 21 May 2025 00:00:13 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/04/2023_lamborghini_huracan-sterrato_dsc00681-29939.jpeg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "18d211ef-dfeb-43a6-90b0-0c2995b5314c",
    "title": "KTM 390 Adventure X review: The sensible choice",
    "link": "https://www.autocarindia.com/bike-reviews/ktm-390-adventure-x-review-the-sensible-choice-435386#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Like its predecessor, the KTM 390 Adventure X undercuts its higher-spec counterpart and aims to deliver 90 percent of the experience at a much more affordable rate. For 2025, this motorcycle is all-new from the ground up, featuring more performance, better features and improved handling for just Rs 11,000 more than the outgoing model. The 390 Adventure X misses out on cruise control.   KTM 390 Adventure X design and quality (7/10) High resolution TFT adds to the appeal of this motorcycle What impressed me was the bright headlight that offers commendable illumination, and it might just be the best in class for now. I’m also happy to see that KTM has equipped this bike with the new TFT and ditched the monotone LCD from the older ‘X’ model. This new screen is vibrant and clear, giving the bike a premium feel. Switchgear quality is also solid, aside from the missing rocker switch for cruise control. The seating posture on the 390 Adventure is upright and commanding   KTM 390 Adventure X riding position and comfort (8/10) The X has the same ergonomics as the 390 Adventure, with a slightly lower seat height Apart from a slightly shorter seat height, the X is identical to the regular 390 Adventure. The posture is upright and commanding yet comfortable. However, the large windscreen isn’t adjustable, so you’re robbed of some of that sweet cooling airflow in this scorching heat at city speeds. Also, the seat remains quite firm, leading to saddle soreness after about an hour or two, which isn’t ideal for long-distance touring. While those shortcomings are worth noting, they’re far from being dealbreakers. The X corners surprsingly well and feels quite planted   KTM 390 Adventure X performance and refinement (8/10) In our tests, the 390 Adventure X managed a 0-100kph time of just 6.04s While this motorcycle packs the same motor as the standard 390 Adventure, it feels a lot more tame and approachable. This is because the X runs on what’s essentially the equivalent of Road Mode on the standard 390 Adventure. It’s not a dealbreaker, but it does make the bike feel rather mellow and un-KTM-like in its performance.  That said, performance is about the same as the standard 390 ADV, and this is the quickest bike in this segment. Despite the alloy wheels, the X can manage mild trails   Another surprise win? Less tyre noise. It was something I noticed on the standard bike, but here, it’s noticeably quieter. One letdown, though, is the quickshifter that requires a fair bit of force to engage and was mostly unusable on our test bike. That said, the X’s light clutch makes shifting manually easy and enjoyable. Moving on to braking, the X performs nearly on par with its counterpart despite missing out on sintered brake pads. Our braking tests showed nearly identical numbers between the two bikes, although the feel at the lever isn’t as good as the standard ADV. Seat height and weight are slightly down by 5mm and 1kg, respectively, which, while not massive, are both changes in the right direction. Unlike the 390 Adventure, the X uses organic brake pads that perform nearly on par   KTM 390 Adventure X ride comfort and handling (8/10) The X's non-adjustable suspension performs better than the higher spec adjustable suspension Despite running non-adjustable suspension and alloy wheels, the X still manages to feel pretty capable off-road. With the same 200mm/205mm wheel travel at both ends, it’ll do nearly all of what the full-spec 390 Adventure can, just with reduced confidence and feedback from the smaller front wheel. In fact, for on-road comfort, both Rishaad and I found ourselves preferring the non-adjustable setup on the X since it felt less fussy and a little more absorptive of poor road surfaces. Graphics and interface make the TFT feel upmarket.   KTM 390 Adventure X features and safety (8/10) Missing list of features aren't dealbreakers in any way The ‘X’ misses out on features like cruise control, riding modes, cornering ABS, adjustable brake and clutch levers, tubeless spoke wheels and an adjustable front fork. Cruise control was the only feature I truly missed and would’ve appreciated. Yes, it makes highway miles easier, but given the cost savings, I can live without it. The 390 Adventure X is considerably more affordable than the standard 390 Adventure.   KTM 390 Adventure X price and verdict (9/10) The ‘X’ costs Rs 77,000 less than the 390 Adventure Given the price difference, the 390 Adventure X makes a very strong case for itself. It delivers almost everything you’d want from the 390 Adventure platform at a pocket-friendly rate. For those skilled enough to push this platform to its limits, KTM still offers the fully specced 390 Adventure and even the Enduro R for hardcore off-road enthusiasts. But if you’re hunting for an affordable, lightweight ADV that punches well above its price tag, the 2025 KTM 390 Adventure X delivers. And if you’re not exactly ‘Ready to Race’, Royal Enfield’s Himalayan costs about the same and offers more all-around usability and comfort, although it feels much bigger and heavier. Also see: KTM 390 Adventure vs Royal Enfield Himalayan comparison review",
    "author": "Gavin Rodrigues",
    "published": "Mon, 19 May 2025 07:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250516112210_3.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "41c8ef2a-13a8-40a9-80fb-ecc105ce710f",
    "title": "Ather Rizta long term review, 2,000km report",
    "link": "https://www.autocarindia.com/bike-long-termer/ather-rizta-long-term-review-2000km-report-435322#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Spending a prolonged duration of time with a vehicle really brings out the nuances of living with it and paints a more detailed picture of how it will fit into your life. In that regard, the Rizta has fared wonderfully well, but over the past two months, one recurring electronic issue has been dampening its otherwise trouble-free experience. But since I’m the sort to sometimes have my dessert before dinner, we’ll start with the good points.  The first thing is that the charger now comes with an elastic cable that latches into place. Where that helps is that you don’t have the charger’s wires strewn about everywhere any time you need to put something in the boot. It may seem small, but it allows you to neatly store your charger and free up more usable space inside the boot for your other belongings.  Neat little elastic strap locks the charger’s wires into place, making storing it in the boot an easier and neater process. Another neat little touch is the small storage cubby just aft of the big 34-litre boot, where I routinely store my phone, keys and a soft microfibre cloth, which is used every so often to clean the Rizta (blame Mumbai’s incessant construction, road works and the dust they kick up!). Keeping your knick-knacks in this smaller area keeps them from getting tossed about inside the big boot on our woefully bouncy roads, something that is especially useful for our expensive modern electronic devices.  Small cubby allows you to securely store small personal items; it’s especially helpful for modern electronic devices. What puzzles me is that Ather hasn’t given the Rizta an external storage cubby, as I’ve seen on multiple other ICE and electric scooters. There is a lot of space to have one on the front apron, and it would save the user the hassle of opening the boot to store their small items every time they set off. Plenty of space available for an external storage cubby on the front apron, but the Rizta doesn’t get one. But the main issue is that over the past two months, I’ve been experiencing an electronic niggle that puts the Rizta into limp mode without any warning. The display shows nothing out of the ordinary except for the regen braking symbol indicating that it’s turned off. And when this happens, power delivery becomes very dull, and I’m unable to cross 25kph. A faulty connector in one of the sensors means it intermittently goes into limp mode without warning. This issue gets resolved temporarily if I cycle the ignition key, but it’s not an everlasting fix, and it reappears without warning. Upon speaking with Ather’s tech team, we have been informed that this has occurred due to a fault in the connector of one of the sensors, and this is the first time someone has reported this occurrence. This electronic niggle has somewhat dampened my confidence in the scooter, and I have been mindful not to stray outside a 10km radius of my home with the Rizta. We will be giving the scooter to the service team for an overall checkup and to have this issue resolved. Once the Rizta is back with us, the rest of our tenure with it, hopefully, will be trouble-free! Also See: Ather Rizta long term review, 1,200km report Ather Rizta long term review, 700km report",
    "author": "Dinshaw Magol",
    "published": "Mon, 12 May 2025 07:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250509043654_A1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "67a116b6-bf42-4379-8d8c-04a92a30675b",
    "title": "Tata Punch CNG vs Hyundai Exter CNG: Dual duel",
    "link": "https://www.autocarindia.com/car-comparison-reviews/tata-punch-cng-vs-hyundai-exter-cng-dual-duel-435397#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Two years ago, we pit the petrol-automatic versions of the Hyundai Exter and Tata Punch against each other. Then, the Exter had the upper hand thanks to its smoother and more refined powertrain. Today, we revisit this rivalry, but with a twist: both sub-compact SUVs are here in their CNG avatars. While they share several traits, like a dual-cylinder CNG setup, a claimed efficiency of 27km/kg and premium features, including a sunroof, this time, the spotlight is on their real-world efficiency. Tata Punch CNG vs Hyundai Exter CNG interior and ergonomics  Let’s begin with the Punch. It’s easy to understand why this Tata is among the country’s bestselling cars. The basics are done right – its high-riding stance, wide-opening doors and easy ingress make it especially friendly for elderly passengers. The high seating position offers a commanding view of the road, and the visible bonnet edges further help drivers feel in control. The driving experience is enhanced by light steering, gear shifts that are easy to execute (though not as precise as the Exter’s) and a clutch that doesn’t require much effort. Further, individual front armrests enhance long-distance driving comfort, and a surprisingly impressive audio system adds to its appeal. There’s a lot that the Hyundai Exter CNG and the Tata Punch CNG have in common. Switching over to the Hyundai, it’s clear why it continues to earn praise for its user-friendliness. Every control, from the gearbox to the steering, feels lighter and more polished – just right for urban use. While its seating position isn’t as high as the Punch’s, outward visibility remains excellent, thanks partly to its lower window line. The fit, finish and overall cabin quality are marginally better than the Tata, but the dark, monotone theme doesn’t feel as inviting, and the seats leave a bit to be desired. They feel a little too compact and don’t offer the same level of support as the Punch’s. Tata Punch CNG vs Hyundai Exter CNG engine and performance  The Punch’s engine performance has never been its strong point, and in its CNG avatar, it feels even more sluggish. While it can keep pace with urban traffic, it begins to struggle when asked for more. The Punch’s real strength lies in its composure at highway speeds; it feels stable and reassuring, which is something it does noticeably better than the Exter. Tata Punch CNG vs Hyundai Exter CNG specsTata Punch icng Accomplished + sHyundai Exter hy-cng duo SX TechL/W/H3827/1742/1615mm 3815/1710/1631mmWheelbase 2445mm 2450mmBoot capacity 210 litres NAEngine 3cyl, 1199cc Petrol + CNG 4cyl, 1197cc Petrol + CNGPower 73.5hp at 6000rpm 69hp at 6000rpmTorque 103Nm at 3250rpm 95.2Nm at 4000rpmKerb weight 1181kg 1093kg On the move, the Exter feels extremely refined. The 4-cylinder engine is quieter and more eager to rev, and its overall smoothness is hard to ignore. Thanks to shorter gearing and smart engine calibration, you rarely need to shift gears. It pulls cleanly from as low as 1,000rpm, making it ideal for stop-and-go traffic. In our acceleration tests, the Exter Hy-CNG Duo sprinted from 0 to 100kph in 14.85 seconds, a full 3 seconds quicker than the Punch iCNG. Moreover, the Exter is significantly quicker than the Tata when accelerating from 20 to 80kph in the third gear and 40 to 100kph in the fourth. The Exter’s shorter gearing improves drivability but hampers highway efficiency to an extent. On the highway, though, the Exter doesn’t feel as composed as the Punch. There is noticeably more vertical movement over undulations. Also, its engine spins 300rpm higher than the Punch’s, at 3,300rpm, while cruising at 100kph in the top gear. This also explains why its highway efficiency is slightly lower at 30.3km/kg in our test, while the Punch iCNG’s is 31km/kg. However, the Hyundai returned 22.8km/kg in the city because of its better drivability, much higher than Tata’s 20.7km/kg. Both cars delivered an impressive overall average, close to their claimed 27km/kg figure. Tata Punch CNG vs Hyundai Exter CNG performance and efficiencyTata Punch CNG Hyundai Exter CNGAcceleration from rest 20kph 1.60 sec1.54 sec40kph 4.05 sec3.63 sec60kph 7.05 sec6.55 sec80kph 11.59 sec10.39 sec100kph 17.85 sec14.85 sec120kph 27.87 sec22.69 secRolling acceleration20-80kph 16.01 sec13.02 sec40-100kph 22.80 sec 18.35 secEfficiency (Tested)City 20.7km/kg22.8km/kgHighway31.0km/kg 30.3km/kg   Tata Punch CNG vs Hyundai Exter CNG fuel efficiency  To determine their actual fuel efficiency, we devised a simple test. We first ran both cars until their CNG tanks were completely empty. After that, we refilled approximately 2 kg of gas in each vehicle and drove them around in real-world conditions within the city until they ran out of CNG. Then, we repeated the procedure and ran them on the highway. Since filling the exact same quantity of gas in each car is nearly impossible, we’ve calculated their efficiency based on the actual distance covered divided by the gas quantity. Tata Punch CNG vs Hyundai Exter CNG features and safety  For the record, the Tata Punch featured here is the Adventure + mid variant, whereas the Hyundai Exter is in its top-end SX trim. That said, to keep this comparison fair, we’re evaluating both cars based on their respective top-spec versions. Interestingly, Tata offers a broader spread of variants with the Punch iCNG. Its entry-level trims are more affordable than Hyundai’s CNG offerings, though its higher trims are pricier than the Exter. Punch iCNG gets a spare tyre, while the Exter only gets a tyre repair kit. When it comes to features, the Punch iCNG impresses with additions like cruise control and a large 10.25-inch touchscreen, which the Hyundai misses. But the Exter hits back with key safety features such as six airbags, a tyre-pressure monitoring system, hill-start assist and electrically folding mirrors, all of which are absent in the Punch. Tata Punch CNG vs Hyundai Exter CNG featuresTata Punch icng Accomplished + sHyundai Exter hy-cng duo SX TechAlloy wheels NA NAProjector headlamps YES YESSunroof YES YESPower folding mirrors NA YESTouchscreen 10.25-inch 8-inchAndroid Auto, Apple CarPlay Wireless WirelessAuto climate control YES YESWireless chargingNA NAVentilated seats NA NARear AC vents YES YESRearview camera YESYESCruise controlYESNAHill-start assist NA YESTyre pressure monitor NA YESESPYES YESAirbags 26 Both cars use dual CNG cylinders mounted below the boot floor, which naturally compromises cargo space compared to their petrol-only counterparts. That said, the Punch’s boot feels a bit more usable, especially if both cars’ parcel shelves are removed. Moreover, Tata provides a full-size spare tyre, while the Exter makes do with just a tyre repair kit. Tata Punch CNG vs Hyundai Exter CNG verdict  To sum things up, the Tata Punch iCNG is a compelling option for buyers looking for an economical, compact and practical highway cruiser. Its tough build, elevated seating and great audio system add plenty of appeal. Where it falls short is in outright performance and the absence of key safety features like hill-start assist, tyre-pressure monitoring and additional airbags. The Hyundai Exter, on the other hand, is the smoother, more refined and easier-to-drive option in the city. It delivers better fuel efficiency, offers more safety features, and still manages to undercut the Punch on price – despite packing in more equipment overall. It may not lead the sales charts just yet, but it’s the Exter that feels like the better-rounded product, and for that reason, it’s the winner in this comparison. Also See: Tata Punch CNG vs Hyundai Exter CNG video review",
    "author": "Saumil Shah",
    "published": "Mon, 19 May 2025 08:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250518091750_Hyundai_Exter_CNG_vs_Tata_Punch_CNG_Front_Quarter_Tracking.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "c7354983-5b77-4e7c-a2fe-d90155f09015",
    "title": "Maruti Swift long term review, 9,000km report",
    "link": "https://www.autocarindia.com/car-long-termer/maruti-swift-long-term-review-9000km-report-435387#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "I’d be lying if I said EVs aren’t perfect for the urban grind, which is where I do pretty much all my driving. Quiet, peppy off the line, seamless progress uninterrupted by gear shifts, and the ability to ‘fill up’ while I’m sat at my desk in the office – it’s a no-brainer, really. But I’d also be remiss not to point out that they feel monotone and soulless, and yes, that matters even on my commute. So, when the Autocar India Swift rotated into my possession after a series of back-to-back EVs, it proved to be a much-needed injection of attitude on my mundane Monday morning. Petrol, manual, and wrapped in the pretty and petite package of a premium hatchback, just looking at it makes me wonder why we, as a car-buying populace, have strayed so far from the light. Cute, sporty look with sufficient space; a Swift hallmark intact on new car. I burst out of the gate on a chirrup of clutch-popped wheelspin, just because I can, though I stop myself short of pulling the handbrake as I turn out onto the main road. But that’s what the Swift does to you after just a few metres of driving. After one-note EVs and big, fat SUVs, this feels small, feisty, and ready to be wrung out. The steering may have gotten lazy lately (it pays off in traffic), but the chassis is as tight as ever. The new Z12 three-cylinder naturally aspirated petrol engine, which has caught mountains of flak from keyboard warriors everywhere, is nowhere as bad as it’s made out to be. At its worst, it feels sluggish at low revs, which I do have to suffer through as I crawl my way to the office, but you soon learn to drive around it. This is likely a case of conservative fuelling at low revs to give the best economy, and boy, does it deliver on that front. Even in constant traffic, it rarely dips below 13kpl! Hilariously good fuel economy, even in rushhour, start-stop traffic. Let it rev, however, and it feels nice and peppy. What it’s lost in outright smoothness compared to the old K12 four-cylinder, it’s made up for with greater potency in the mid-range. Apologies for getting all road testy for a moment there, but it’s nice to enjoy a simple, honest-to-goodness petrol engine after a long time. Where the Swift disappoints is in Maruti’s obstinate obsession with cost trimming, which has made a fun, premium hatchback feel like a budget item in places. The sticker price has certainly gone up, and leaving aside the decision to go with a cheap AMT for the auto gearbox (a decision I mercifully don’t have to suffer), it’s small things that also pinch in the long run. Like the lack of an auto-dimming mirror, low-quality fabric for the roof liner, and just one (very weak) cabin light placed up front, which in turn highlights the lack of backlighting on the switches and USB ports. No backlighting on switches, USB ports makes them hard to find in the dark. On the topic of annoyances, Maruti’s idea to show turn-by-turn navigation directions from Google Maps in the MID display is noble, but it completely overrides all other information (including that amazing fuel economy meter), and it cannot be turned off unless you end the navigation. Unlike other fleet cars that I try to keep for as long as possible, I know I’m not going to hold on to the Swift for much longer. Apart from being quietly coveted by the rest of the team for being small and relatively hassle-free to live with, it’s also a regular feature on shoots as the camera car, and with good reason. Fun as this was, it’s back to the silent treatment for me. Navigation directions in MID handy but can’t be switched off; blocks other data. Also see: Maruti Swift long term review, 4,500km report Maruti Wagon R, Swift and Celerio get up to Rs 65,000 off this month Maruti Swift CNG vs Tata Altroz CNG comparison",
    "author": "Gavin D'Souza",
    "published": "Sun, 18 May 2025 12:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250516114215_Maruti_Swift_long_term_review_front_drift.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "6c926b15-5eda-472c-8e58-e80f7f4f9bce",
    "title": "BMW’s New Super Wagon Gets Slammed: H\u0026R Springs and More for the G99 M5",
    "link": "https://www.bmwblog.com/2025/05/20/bmw-m5-touring-g99-hr-springs/",
    "description": "One of the very first 2025 BMW M5 Touring (G99) models to hit Canadian roads has already undergone a series of enhancements, fixing some of the complaints customers had. Delivered in December 2024, this G99... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Tue, 20 May 2025 17:47:44 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/05/bmw-m5-g99-hr-springs-08-553x830.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M5",
      "Tuning",
      "2025 BMW M5",
      "G99 M5",
      "H\u0026R Springs"
    ]
  },
  {
    "id": "237b1cde-9073-4fba-9f02-6f66deafe1ce",
    "title": "2025 MINI JCW Convertible Hits the French Riviera in British Racing Green",
    "link": "https://www.bmwblog.com/2025/05/20/mini-john-cooper-works-convertible/",
    "description": "When MINI launched its newest generation of performance-tuned John Cooper Works models, all eyes seemed to gravitate toward the hardtop F66 Hatchback. But quietly basking in the background was the F67—the 2025 MINI John Cooper... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Tue, 20 May 2025 16:41:11 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/05/MINI-John-Cooper-Works-Convertible-british-racing-green-11-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "MINI",
      "F67",
      "JCW",
      "MINI John Cooper Works Convertible"
    ]
  },
  {
    "id": "5d4a0766-f6f7-423a-a862-da46dcd22f4b",
    "title": "Jaguar Says It Has No Intention of Manufacturing Cars in the U.S.",
    "link": "https://www.autoblog.com/news/jaguar-says-it-has-no-intention-of-manufacturing-cars-in-the-u-s",
    "description": "Jaguar Land Rover has confirmed it has no intention of building cars in the United States, even as President Donald Trump’s sweeping tariffs on imported vehicles shake up the global auto industry. “Following articles based on comments made by the JLR CEO in the full year earnings media call, we can ...",
    "author": "Elijah Nicholson-Messmer",
    "published": "Wed, 21 May 2025 00:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODk1Nzky/jaguar-land-rover.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Jaguar",
      "tariff",
      "Land Rover",
      "Performance",
      "Luxury",
      "jaguar land rover",
      "News"
    ]
  },
  {
    "id": "833f73f3-5936-4ea0-b34a-a86aceee3a80",
    "title": "Honda Downshifts on Its EV Goals Amid Trade, Sales Woes",
    "link": "https://www.autoblog.com/news/honda-downshifts-on-its-ev-goals-amid-trade-sales-woes",
    "description": "Japanese automaker Honda is scaling back its once-ambitious electric vehicle investment and sales targets in light of changing emissions regulations and the unsteady international trade environment affecting the largest markets served by the automobile industry. At the company’s annual business ...",
    "author": "James Ochoa",
    "published": "Tue, 20 May 2025 21:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODk4Mjgy/2025-honda-prologue-elite.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Hybrid",
      "Economy Cars",
      "honda",
      "News",
      "Electric"
    ]
  },
  {
    "id": "8f5d8666-9ea0-42c1-9663-8197711f0331",
    "title": "UK parking companies unite to create universal payment app",
    "link": "https://www.autocar.co.uk/car-news/consumer/uk-parking-companies-unite-create-universal-payment-app",
    "description": "RingGo, JustPark and PayByPhone among firms to share 'one app fits all' platform following government-backed trial The UK's largest private car park operators are joining forces to create a universal payment platform that means motorists no longer need a separate smartphone app for each provider. The Department for Transport (DfT) has announced that the new 'one-app-fits-all' interface is being developed and operated by the British Parking Association at no cost to the taxpayer, following a series of government-backed trials. It will be called the National Parking Platform, and will allow drivers to pay to leave their car at all participating car parks, including those run by RingGo, JustPark and PayByPhone – which currently each operate their own apps. The move will encourage \"a more flexible parking experience\", said the DfT, following widespread criticism of the reliability and ease of use of certain parking apps – a particularly pertinent issue as councils are phasing out traditional coin and card  payment machines in the interests of reducing operating costs. Autocar recently reported that the increasing use of apps in place of machines was frustrating motorists, who said connectivity problems and added complexity were causing delays to journeys and even forcing them to choose other parking locations. One driver in Guildford – which has recently disabled two-thirds of its payment machines in favour of the RingGo smartphone app – said: “My phone can’t establish a connection [to the RingGo app]. I’m already late for an appointment and don’t have time to waste trying to buy a ticket. I expect I shall be fined.” An elderly couple in the same town concurred: “We don’t like downloading and using apps and would much rather use coins or contactless payment. At least we have a smartphone. Many of our friends don’t. We will have to find another parking space.” The new universal parking app is being designed to alleviate those concerns, said the DfT. \"Currently, drivers face inconsistent parking rules, clunky user experiences, and unnecessary barriers to something that should be simple,\" it said.  \"The National Parking Platform fixes this, connecting participating car parks to a shared platform, through which drivers can pay using any approved app – cutting confusion, reducing the chance of fines, and opening up the parking market to fairer competition.\" The platform will be run by private parking companies, in partnership with councils, on a not-for-profit basis. The DfT promised that it will \"operate under clear terms to ensure transparency, sustainability, and public value\" – and said the government will monitor the platform to ensure compliance. It has already been rolled out to 10 local authorities and handles more than 500,000 transactions per month, said the DfT. It has not yet confirmed a timeframe for a wider rollout. Lilian Greenwood, minister for the future of roads, welcomed the development: \"This government is on the side of drivers, and dedicated to giving everyone simpler, more flexible parking. I’m delighted that this fantastic project is being taken on by the parking sector with no extra cost to taxpayers.  “This is public infrastructure done right: built by government, shaped with councils, and now delivered by the sector that knows it best, at a time when we’re investing a record £1.6bn through our Plan for Change, to mend our pothole-ridden roads which damage cars, and £4.8bn to deliver new road infrastructure that will better connect people.”",
    "author": "",
    "published": "Wed, 21 May 2025 00:05:18 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/car_park.jpg?itok=xciDKLVk",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "66ccb992-c2c4-4eaa-b6d5-c7599192f6aa",
    "title": "Rally inspired concept previews upcoming Vauxhall Mokka GSe",
    "link": "https://www.autocar.co.uk/car-news/new-cars/rally-inspired-concept-previews-upcoming-vauxhall-mokka-gse",
    "description": "Prototype uses same battery as standard crossover but adopts Abarth 600e's 278bhp powertrain Vauxhall has previewed its the upcoming Mokka GSe with a rally inspired concept. The Mokka GSe Rally prototype is based on the current crossover and features Bilstein rally suspension, a racing gearbox, and a lightweight chassis. According to Vauxhall, the concept is also the world's first rally car currently being developed according to the FIA's new eRally5 regulations, meaning it could potentially be used in global rally series from next year. Underneath, it draws power from the same 54kWh battery as the standard Mokka, and adopts the same 278bhp, 254lb ft single-motor setup from its Abarth 600e Stellantis sibling.  While no further technical specs have been given, in the 600e, the same powertrain yield 0-62mph times of 5.9sec. It also, like the 600e, gets limited-slop differential. Visually, underneath the GSe Rally’s striking design, it showcases a car that is clearly differentiated in styling terms to the standard Mokka with a front and rear diffs, flared wheel arches and larger alloys. These production-ready features - largely unusual for a concept – point to what we can expect from the upcoming Mokka GSe, a car which was recently teased by Vauxhall/Opel CEO Florian Huettl and which is expected to be revealed in the coming months.  The video also announced the sub brand would ditch models with combustion engines such as the previous Astra GSe In addition to the Mokka GSe, Huettl hinted that there will be further news on more electric Vauxhalls. He said: “[GSe] is also a promise that [Vauxhall’s] electric future will not be driven by compromise. There is more to come in 2025 – we are just getting started.”",
    "author": "",
    "published": "Tue, 20 May 2025 23:48:05 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/vauxhallmokkagserallyprototype-front.jpg?itok=5zGf0PAd",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "b39ce7a9-b007-4787-8f6b-6e95460ce440",
    "title": "New RAV4 GR Sport Has More Power Than A GR Corolla",
    "link": "https://www.carscoops.com/2025/05/2026-toyota-rav4-gr-sport-more-power-than-gr-corolla/",
    "description": "The sportiest version of Toyota's new compact SUV is available exclusively with the plug-in hybrid powertrain, producing a combined 320 hp",
    "author": "Thanos Pappas",
    "published": "Wed, 21 May 2025 01:00:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/05/2026-Toyota-RAV4-PHEV-GRSpor-08-copy-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Gazoo",
      "New Cars",
      "PHEV",
      "SUV",
      "Toyota",
      "Toyota GR",
      "Toyota RAV4"
    ]
  },
  {
    "id": "9b2c929d-5e97-4031-9e28-7b70d4a7283c",
    "title": "RAV4’s Evolution Is More Than Meets The Eye",
    "link": "https://www.carscoops.com/2025/05/2026-toyota-rav4-electrified-upgrades-sporty-design-tech-improvements/",
    "description": "The SUV is available in Core, Sport, and Rugged styles, alongside the new Woodland and GR-Sport grades",
    "author": "Thanos Pappas",
    "published": "Wed, 21 May 2025 01:00:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/05/dfsgsdfgdfg-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Hybrids",
      "New Cars",
      "PHEV",
      "SUV",
      "Toyota",
      "Toyota RAV4",
      "Toyota Videos",
      "Video"
    ]
  },
  {
    "id": "6f4375ac-7469-4e9f-b5e5-48eab8bc4bf9",
    "title": "Honda Dax Rebuild: Purpose Built Moto’s Teal Time Machine",
    "link": "https://www.bikeexif.com/honda-dax-purpose-built-moto",
    "description": "Restoring a motorcycle can seem like a mundane task compared to customizing one. But it can also be very rewarding, especially when you’re restoring the right bike for the right person. This 1970s Honda Dax comes from the fine folks at Australia’s Purpose Built Moto. Although the Gold Coast workshop relishes custom projects, the opportunity to restore the tired Dax back to its former glory was too good to resist. It also helped that the bike’s owner was already a customer… and friend. “Jake is a well-known local bloke and a great guy all around,” says Tom Gilroy, PBM shop boss. “I often see him and his wife out for a walk with their dog.” “The backstory on this bike is that Jake uses it to run up to the shops for late-night snacks, grab a coffee, or even pick up a beer on Sundays, hooning around Mermaid Beach and generally keeping his neighbors on their toes.…",
    "author": "Wesley Reyneke",
    "published": "Tue, 20 May 2025 23:33:58 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/05/honda-dax-purpose-built-moto.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Honda Dax",
      "Honda motorcycles",
      "Mini Bikes",
      "Purpose Built Moto"
    ]
  },
  {
    "id": "1660e3c9-750d-4506-970e-5bc4f9f22195",
    "title": "Hans Sures Gives the Combustion Engine the Renaissance Treatment",
    "link": "https://www.bikeexif.com/hans-sures-motorcycle-art",
    "description": "Nothing exists in a vacuum. An old idea augmented by new means—it plays itself out over and over again in every facet of society, culture, technology, and art. The balancing act between the novel and the familiar is ever-present in the artwork of Hans Sures, a creative director, designer, and illustrator based in London. He’s found the sweet spot where his art is recognizable, yet challenging in technique, presentation, and subject matter, leaning on Renaissance masters like Titian and da Vinci for stylistic inspiration. Though his work is influenced by ’60s and ’70s motor culture, the visual cues are from a different period altogether, removing the viewer from a particular place in time. It’s modern yet remains steeped in familiar stylistic tropes, enabling it to transcend its timestamp.…",
    "author": "Iron and Air",
    "published": "Mon, 19 May 2025 20:09:51 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/05/h_sures_barn_job.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Artists",
      "Iron \u0026 Air"
    ]
  },
  {
    "id": "9e58c6e3-5813-4ef2-a3b1-0919491a7988",
    "title": "2026 Toyota RAV4 Goes Hybrid-Only, Adds PHEV GR Sport Version With 320 HP",
    "link": "https://www.jalopnik.com/1865276/2026-toyota-rav4-hybrid-reveal-design-specs-details/",
    "description": "The sixth-generation RAV4 has fresh styling, an overhauled interior and trim levels including a rugged Woodland and new GR Sport tuned by the Gazoo Racing team.",
    "author": "Collin Woodard",
    "published": "Wed, 21 May 2025 01:00:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/2026-toyota-rav4-goes-hybrid-only-adds-phev-gr-sport-version-with-320-hp/l-intro-1747773495.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Toyota",
      "SUVs and Crossovers",
      "EVs and Hybrids",
      "Car Design"
    ]
  },
  {
    "id": "343eaf39-4249-4a06-b0f0-0d7b668e7c84",
    "title": "2025 Lexus IS 500 Ultimate Edition Celebrates The Naturally Aspirated V8 With The Most Boring Color Ever",
    "link": "https://www.jalopnik.com/1865360/2025-lexus-is500-ultimate-edition-reveal/",
    "description": "Aside from bigger brakes and some small appearance items, the Ultimate Edition isn't too different from a normal IS 500.",
    "author": "Logan K. Carter",
    "published": "Tue, 20 May 2025 21:27:56 +0000",
    "image": "https://www.jalopnik.com/img/gallery/2025-lexus-is-500-ultimate-edition-celebrates-the-naturally-aspirated-v8-with-the-most-boring-color-ever/l-intro-1747776397.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "6c7065e6-3849-4b8a-979e-3601aaf2a214",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "ff3d86c9-3b69-4e37-873b-4094dc7f03e7",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  },
  {
    "id": "5f658483-5f6e-4e90-9b51-c9629371afd2",
    "title": "2026 Toyota RAV4 GR Sport Is a Potent PHEV with Assertive Styling",
    "link": "https://www.caranddriver.com/news/a64825632/2026-toyota-rav4-gr-sport-is-a-potent-phev-with-assertive-styling/",
    "description": "Toyota's first-ever GR Sport trim has motorsports-inspired styling to match the RAV's new 320-hp plug-in hybrid powertrain.",
    "author": "",
    "published": "Wed, 21 May 2025 01:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "b7c777bc-f4ad-432e-96a3-fd794fbbd357",
    "title": "View Interior Photos of the 2026 Toyota RAV4 Hybrid",
    "link": "https://www.caranddriver.com/photos/g64829638/2026-toyota-rav4-interior-gallery/",
    "description": "See the redesigned Toyota RAV4 Hybrid's interior from every angle.",
    "author": "",
    "published": "Wed, 21 May 2025 01:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "c3f060d1-7201-4488-b77f-519d8b09dc19",
    "title": "A How-To Guide To ITBs With Project NSX",
    "link": "https://www.speedhunters.com/2025/04/guide-itbs-project-nsx/",
    "description": "What do we love so much about naturally aspirated engines? Perhaps the musicality, or the responsiveness, or the combination of both that creates an emotionally rewarding experience with every stab at the throttle pedal. Well, whatever underpins that appeal, I can say for sure that nothing turns it up to 11 quite like a set of […] The post A How-To Guide To ITBs With Project NSX appeared first on Speedhunters.",
    "author": "Blake Jones",
    "published": "Tue, 08 Apr 2025 23:31:04 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Australia",
      "honda",
      "individual throttle bodies",
      "ITB",
      "ITBs",
      "NA1",
      "NSX",
      "project car",
      "Project Cars",
      "Project NSX",
      "Speedhunters Project Car"
    ]
  },
  {
    "id": "08c69829-8cad-4702-8de6-70d825ec7103",
    "title": "3 Days At The World’s Most Luxurious Race Track",
    "link": "https://www.speedhunters.com/2025/04/3-days-worlds-luxurious-race-track/",
    "description": "That’s what Cornes \u0026 Co did here in Japan, and with that, we’re left with The Magarigawa Club. The Magarigawa Club is not hot off the press news, it’s actually been open for a little over 18 months now, but since it’s doors have opened, I had yet to have the chance to visit and see what […] The post 3 Days At The World’s Most Luxurious Race Track appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Sat, 05 Apr 2025 04:39:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Circuit",
      "honda",
      "japan",
      "Manthey",
      "Porsche"
    ]
  },
  {
    "id": "c664a82b-1aab-4df7-baee-c44511b3c363",
    "title": "Report: Subaru Increasing Prices On Some Models",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/report-subaru-increasing-prices-on-some-models-44514022?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Several Subaru models are set to become more expensive. Citing “current market conditions,” the automaker said it would update pricing “to offset increased costs while maintaining a solid value proposition for customers.”",
    "author": "Chris Teague",
    "published": "Tue, 20 May 2025 19:50:07 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/11/170848/s-see-53-photos-of-the-2026-subaru-forester-wilderness.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "566c7e9d-712e-407c-a527-b850a9f0b9ef",
    "title": "Volkswagen Could Give Future EVs More Traditional Names",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/volkswagen-could-give-future-evs-more-traditional-names-44514013?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Volkswagen long stuck with “real” model names instead of alphanumeric titles for most of its vehicles, but that changed with the ID line of electric vehicles. Now, just a few years later, the automaker is reportedly considering abandoning the ID naming convention for some future EVs.",
    "author": "Chris Teague",
    "published": "Tue, 20 May 2025 15:27:53 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/05/16216/s-see-21-photos-of-the-volkswagen-id-4.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "bca57a6e-6976-409f-979e-e8b8e4635ac9",
    "title": "BMW F 450 GS design seen in new spy shots",
    "link": "https://www.autocarindia.com/bike-news/fresh-bmw-f-450-gs-spy-shots-showcase-production-spec-design-435429#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Fresh spy shots of the BMW F 450 GS, which TVS will manufacture, have emerged on the internet ahead of its impending launch in late 2025. These spy shots feature a test mule that appears to be very close to the production-spec bike.  BMW F 450 GS appears to run on 19/17-inch alloys Its new headlight design is reminiscent of the big 1300 GS The bike gets a big colour TFT display, just like big BMW models BMW F 450 fresh details emerge F 450 GS appears to be a road-biased ADV The F 450 GS will be the entry point to the BMW GS family when it launches, and from the latest spy shots, it is clear that it will be a slim machine. The single front disc brake is another sign that the motorcycle will be lightweight, at least in its class. The headlight design is quite reminiscent of the big R 1300 GS, especially in the X-shaped headlight daytime running lamp. However, one must note that the main headlight unit comprises a stacked LED light setup, unlike the single light seen on the 1300.  This particular BMW F 450 GS is decked out with some accessories, such as a top box, a bash plate, knuckle guards and some crash protection. The bike is seen running on alloy wheels (likely to be 19/17-inchers, F/R) with road-biased dual-purpose tyres. The company could offer spoked wheels as an accessory. The riding triangle seems quite spacious and neutral, both typical ADV traits.  The BMW F 450 GS is slated to launch in India at the end of the year, and we expect its ex-showroom price to be around Rs 5 lakh. This small GS will rival the Honda NX500 and CFMoto 450 MT.  Image Source: motorradonline.de Also See: Norton V4 superbike India launch this year",
    "author": "Dinshaw Magol",
    "published": "Tue, 20 May 2025 17:28:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250520052811_BMW F 450 GS spy shot front three quarter.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "d544f940-3590-4ca4-836a-326cfdde8cee",
    "title": "Updated Yezdi Adventure with new headlamp launch on June 4",
    "link": "https://www.autocarindia.com/bike-news/updated-yezdi-adventure-with-new-headlamp-launch-on-june-4th-435427#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The updated Yezdi Adventure is set to launch on June 4, and it will receive a refreshed front-end design. Yezdi Adventure to get an asymmetrical headlight It will remain mechanically unchanged Yezdi Adventure launch confirmed This update will bring a refreshed headlight design The Yezdi Adventure was slated for a launch this month, but considering the recent geopolitical issues, the brand postponed it. Now, we have received an official communication that the launch date is June 4, 2025.  Classic Legends has shared a teaser image which suggests that the Yezdi Adventure will get a twin headlamp design with an asymmetric theme reminiscent of the previous-generation BMW GS models. This may come as a surprise because less than a year ago, Classic Legends launched a mildly updated version of the Adventure with minor aesthetic tweaks, primarily a metal crash cage around the fuel tank.  However, this more significant design update had always been part of the company’s plan but was postponed last year due to unfinished development. Now, with the update ready, the Yezdi Adventure is expected to receive a refreshed design. Otherwise, the Yezdi Adventure will remain mechanically unchanged and continue to pack a 334cc, single-cylinder, liquid-cooled engine producing the same 29.6hp and 29.8Nm. The Yezdi Adventure is currently priced between Rs 2.10 lakh and Rs 2.16 lakh, depending on the colour chosen. Also see:  2024 Yezdi Adventure video review",
    "author": "Ved Janve",
    "published": "Tue, 20 May 2025 16:39:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250520043853_Yezdi Adv.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  }
]
