[
  {
    "id": "8ac2e8a2-54ef-4c68-8f79-bae3905094ff",
    "title": "1962 Maserati 3500 GT Spider by Vignale",
    "link": "https://bringatrailer.com/listing/1962-maserati-spider-3500-2/",
    "description": "This 1962 Maserati Spider 3500 GT is one of approximately 250 Vignale-bodied convertibles built during five years of production and was ordered new by Auto-König of Munich, Germany, in January 1962. Chassis 1421 was shipped to Auto-König in August 1962 before being sold to its first owner near Munich, and it is said to have later undergone a color change to yellow following collision repairs. After additional accident damage in 1973, the car awaited repairs until being purchased in 1999 by a German owner who initiated a refurbishment that remained incomplete for several years. Under subsequent ownership, the unfinished car was sent to Leo B. Peschl Classic Sports Cars in Cologne, Germany, before being sold in 2016 to its current owner, who commissioned the completion of the refurbishment over the next three years. Work during the project included a repaint in the original shade of white with a blue hardtop, a re-trim of the interior in blue leather, and an overhaul of the 3.5-liter DOHC inline-six. Following the completion of the refurbishment, the car achieved Maserati Classiche certification in 2022. Additional features include triple Weber 42 DCOE carburetors, twin-plug ignition, a ZF five-speed manual transmission, a limited-slip differential, servo-assisted four-wheel disc brakes, 16” Borrani wire wheels, and a navy convertible top. This Tipo 101/C is now offered on dealer consignment in Roeselare, Belgium, with Maserati Classiche certification documents and badges, copies of its factory order and build sheets, photos from the refurbishment, and Belgian registration.",
    "author": "bringatrailer",
    "published": "Fri, 13 Jun 2025 00:00:08 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/05/1962_maserati_spider-3500_00045-exterior.edit_-83985-scaled-1-87121.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "16463a95-6906-4a2d-abd0-e4ab4c85056c",
    "title": "14k-Mile Euro 2001 BMW Z8",
    "link": "https://bringatrailer.com/listing/2001-bmw-z8-134/",
    "description": "This 2001 BMW Z8 is a triple-black example that was imported to the US from France in August 2005, acquired by the current owner in 2015, and listed on BaT in July 2023. The car is powered by a 4.9-liter S62 V8 paired with a six-speed manual transmission and features a color-matched removable hardtop, a black soft top, 18” split-spoke wheels, xenon headlights, heated power-adjustable sport seats, a six-disc CD changer, a Harman Kardon sound system, navigation, and air conditioning. Now showing 14k miles, this Z8 is now offered on dealer consignment with the owner’s manual, service records, spare parts, a clean Carfax report, and a clean Massachusetts title.",
    "author": "bringatrailer",
    "published": "Thu, 12 Jun 2025 23:55:12 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/06/BMW-Z8-Black-5-55253-scaled.jpg?fit=940%2C628",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "46e535e0-eb81-469c-bb8a-0b9d0a49f12d",
    "title": "Aprilia Tuono 457 track review: Raising the bar",
    "link": "https://www.autocarindia.com/bike-reviews/aprilia-tuono-457-track-review-raising-the-bar-435521#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "We recently took the Tuono 457 to the CoASTT High Performance Centre for our annual track day, and even though I missed out on testing it on the street, hopping on it at the track was worth the wait. It was so impressive, in fact, that it deserved a standalone story of its own. Aprilia Tuono 457 design (8/10) A good looking design but the traditional Tuono face is missed. The Tuono is essentially an RS 457 in streetwear – same engine, chassis, suspension, brakes and tyres. The tank is slightly reshaped, and of course, those upright handlebars change the ergonomics. But the big surprise was that the lap time in Rajini Krishnan’s hands was nearly identical to the RS 457’s at our 2024 Track Day. No clip-ons, no wind protection, and less front-end load, yet it hung right in there. That’s remarkable. The fuel tank shape is slightly reprofiled on the Tuono. A few things played to the Tuono’s advantage this year. The track surface at the CoASTT was in better shape than the last time we visited, the weather was a little kinder, and, as always, familiarity counts. This bike also ran the optional quickshifter, something Rajini appreciated. It’ll set you back Rs 20,000 – not cheap by any stretch, especially on a sub-Rs 4 lakh machine – but it works well and really adds to the experience. Aprilia Tuono 457 ergonomics (6/10) Acessible seat height but cramped for tall riders. Like with the RS 457, the real gem remains the engine, and Aprilia’s 457cc parallel-twin continues to be the segment’s crown jewel. 48 horsepower and segment-leading torque only tell half the story. The motor is also very smooth, and it packs crisp throttle response and a rich and evocative sound. With that wide, sculpted tank between your legs and the bike’s superbike-like soundtrack, there’s a genuine sense of occasion every time you roll on the gas. That said, it’s not all roses. Ergonomics is where the Tuono 457 will leave taller riders wanting – especially on track. I found myself cramped against the rear seat bump stop, with the bike’s bodywork feeling particularly slippery. The already compact RS 457 felt more accommodating with its wide, more forward set clip-ons, but the Tuono’s setup makes the cockpit feel more restrictive. Some of this can easily be fixed by adding some grip tape and maybe by modifying the rear seat to allow the rider more room to slide back. But if you’re close to 6 feet tall, you will find this bike cramped – particularly in how the fuel tank recesses lock your knees in place – and that won’t be just at the race track. Aprilia Tuono 457 performance (9/10) Superb mid-range makes up for flat top-end and it makes a great sound. Beyond the hard metrics, the Tuono 457 is engaging, playful and, crucially, fast enough to make every session exciting. The aluminium chassis, firm suspension and impressive Eurogrip Pro Torque Xtreme tyres all come together to make this (along with the RS 457) probably the most impressive handling bike ever to be made in India.  Quickshifter is an impressive but expensive option CoASTT is a flowing circuit with few heavy braking zones, and while the 457’s front brake fade is a known issue, it wasn’t a problem here. That said, if you plan on hitting more tracks with more demanding braking zones, upgrading the pads, fluid, or master cylinder is something you’ll have to look into. Aprilia Tuono 457 handling (9/10) Chassis, suspension and tyres work well but brake fade needs to be addressed. What makes the Tuono so special is that it isn’t a detuned RS that trades capability for comfort. It carries the same spirit, the same capability, and nearly the same lap times. Unfortunately, it’s not all perfect. First, there’s the bike’s size and the fact that the design isn’t as evocative as the RS 457, which is more visually linked to its bigger siblings.  More worryingly, however, there have also recently been some customer reports of unexpected engine reliability issues, and this is something that Aprilia needs to address in a speedy and decisive manner. From a sheer capability standpoint, though, the Tuono 457 has exceeded expectations, and that’s not something that happens very often. Aprilia Tuono 457 verdict (9/10) Nearly as capable as the RS 457 and with considerably more seat comfort.  What really struck me is how this bike stacks up against the competition. Whether it’s KTM’s singles or Yamaha’s twin-cylinder offerings, the Tuono feels like it’s operating on a higher plane – especially on a fast circuit like CoASTT that rewards power and flow. In fact, the lap time is closer to more powerful bikes like the Suzuki GSX-8R and Ducati Hypermotard Mono than it is to rivals like the KTM 390 Duke and Yamaha R3. Also see: Aprilia RS 457 vs Yamaha R3 comparison",
    "author": "Rishaad Mody",
    "published": "Mon, 9 Jun 2025 08:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250528051118_6.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "9b809473-33ae-498b-8c36-f7c3942d089d",
    "title": "2025 Royal Enfield Hunter 350 video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/2025-royal-enfield-hunter-350-video-review-435594#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: 2025 Royal Enfield Hunter 350 review: Meaningful changes",
    "author": "Dinshaw Magol",
    "published": "Thu, 5 Jun 2025 11:35:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250605113543_YT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "b60b8b62-16b9-4e10-8c3e-051e7470b531",
    "title": "2025 Vinfast VF7 review: 350hp AWD EV with a spacious back seat",
    "link": "https://www.autocarindia.com/car-reviews/2025-vinfast-vf7-review-350hp-awd-ev-with-a-spacious-back-seat-435668#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "The first product from Vietnamese EV maker Vinfast to be assembled and sold in India will be the VF7. The brand, which has a wide range of products positioned both above and below the VF7, has chosen this as the debut model for India as it wanted to enter a competitive segment, while also playing its premium card first. Some brief time with the model at Vinfast’s factory testing track in Hai Phong, Vietnam, gave us a better idea of how it could be positioned in our market, and suffice it to say, there’s more to it than first meets the eye. 2025 Vinfast VF7 exterior design and engineering – 7/10 Full of interesting details, but estate-like form factor lacks presence. A design signature of all Vinfast models is the moustache-like ‘V Face’ LED DRL band that sits on the nose and dips in the centre underneath the brand’s logo. Viewed head on, this does make many of their models look similar to one another, particularly this and the VF6, but look closer and you’ll see unique touches in each of them. V-face LED DRL band is the signature element bringing a family look to Vinfast EVs. The VF7 gets a pair of brushed metal ‘blades’ in the front air dam, while the bumper itself has an indented or concave look. In fact, this muscular surfacing can be found all over the car, and on the side, flush door handles help give the sculpted doors a clean look. For India, the VF7 will get 19-inch wheels, and ground clearance has been raised to 190mm. Only when viewed in profile do you realise this is a 4.5-metre-long vehicle with a 2.8-metre wheelbase, though the front and rear overhangs are quite short. Vertically oriented tail-lamps with interesting details look attractive. At the rear, there’s more sculpture to the tailgate, a slim windscreen and attractive vertically oriented LED tail-lamps. While the details are excellent, its long and low-slung shape means it doesn’t quite have the road presence of a boxy SUV, or even the coupe-like look of its smaller sibling the VF6, which could work against it in India, where a more traditional form factor is generally preferred. 2025 Vinfast VF7 interior space and comfort – 8/10 Big on rear seat and boot space, quality generally good too. While it might not look large on the road, it certainly is on the inside. Under the powered tailgate you’ll find a capacious 537-litre boot, although there is no spare tyre. Rear seat space should endear it to chauffeur-driven owners, because both leg and head room are vast. Due to the high floor, you’re sat a bit knees-up, but you don’t feel it as much when you’re stretched out. Rear seat leg and head room are both vast; gets a reclining feature, too.  Speaking of which, new for the Indian model is the ability to recline the rear seat back a generous amount, and the cushioning is soft and supportive, especially for the lower back. The windows are long but slim and set quite high, although the sense of space is greatly enhanced by the huge fixed glass roof that stretches from edge to edge. Interior is clean and uncluttered; infotainment screen is angled towards driver. Up front, the VF7 replaces the traditional instrument cluster with a heads-up display (plus essential info as a permanent fixture in the touchscreen) to give an uninhibited view over the low-set dashboard. The 12.9-inch touchscreen takes pride of place, angled proud of the dash with a set of drive-select toggle switches below it. This, combined with the light-coloured, soft-touch vegan leather trimming the dash and doors gives it a unique and premium look, albeit one without much flash value. Fit and finish are good, although some dull and basic looking plastics are a distraction. Soft-touch vegan leather trimming on dashboard gives a premium feel.    2025 Vinfast VF7 features and safety – 9/10 Loaded with features and targeting a 5 star Bharat NCAP score. Vinfast has chosen to only launch a single fully loaded trim level called Plus, in India, as a competitive feature set was deemed a high priority. Features like the aforementioned rear-seat recline, a wireless phone charger, vegan leather, ventilated seats and one-litre bottle holders in each door were said to be non-negotiables. Seven airbags are also standard, as are a host of electronic safety aids, including a radar-based ADAS suite with Level 2 Autonomous driving, all in the quest, Vinfast says, to achieve a 5-star Bharat NCAP rating. Other feature highlights include dual-zone climate control and the big glass roof. Small icons and graphics on the screen make it difficult to use on the move. While there are a few physical controls in the centre console and on the steering wheel, most functions are relegated to the touchscreen. Though this is a common practice these days, what makes Vinfast’s system less than ideal is the small size of the icons and graphics on the screen, which are difficult to target while on the move. 2025 Vinfast VF7 range and efficiency – 6/10 Large battery holds promise, but low WLTP rating is a concern. While there is only one trim level and one battery size for the VF7, it will be offered with two powertrain options – single-motor FWD and dual-motor AWD. The battery is a 70.8kWh LFP unit which can be charged at up to 7.2kW on an AC charger or on a CCS2 DC charger, although speeds and times were not specified for the latter. European-spec VF7 has a maximum WLTP-certified range of 450km. Vinfast says the Indian-spec car has had some tweaks to its powertrain and thus it’s best to wait for official MIDC or ARAI range figures. However, the WLTP rating for overseas models is rated at 450km for the FWD model and 431km for the AWD model. 2025 Vinfast VF7 performance and refinement – 9/10 AWD version offers addictive acceleration, modes alter character well. Vinfast VF7 specificationsLxWxH4545mm x 1890mm x 1635.75mmWheelbase 2840mmBattery capacity70.8kWhDrive layoutFWD/AWDMotor power204hp/350hpMotor torque 310Nm/500NmKerb weight 2090kg/2205kg0-100kph 9.5sec/5.8secAC charging Up to 7.2kWWheel size 245/50 R19 The Vinfast VF7 FWD model uses the same 204hp, 310Nm front-mounted motor as the VF6, which is claimed to get it to 100kph from a standstill in 9.5 seconds. However, the version we got to sample was the dual-motor version, which adds another similar motor on the rear axle. Total outputs for this version are 350hp and 500Nm, which shreds the 0-100kph sprint down to just 5.8sec. In practice, it feels genuinely fast, even spinning up its wheels under hard acceleration from low speeds. The ferocity of the power delivery starts to taper off close to about 120kph, but it will hold those speeds with ease. The good news is that it is civilised and manageable at low speeds, making it suitable for city driving too. The VF7 is genuinely fast, even spinning up its wheels under hard acceleration. Refinement was hard to judge on the relatively smooth expanse of Vinfast’s test track but the requisite electronic whine in the cabin was a welcome indicator of the power being deployed. The brakes felt strong and confidence inspiring, and the VF7 AWD’s not-inconsiderable 2.2-tonne mass was kept well in check. 2025 Vinfast VF7 ride comfort and handling – 8/10 Feels solid and confidence inspiring at high speeds. The dynamic capabilities of the VF7 were also hard to ascertain on the smooth track with almost no corners present. However, the general sense was of a secure and planted vehicle in the vein of what we’ve come to expect from European cars. The choice to move down a size from 20-inch to 19-inch wheels and tyres (Apollo tyres, no less) seems to have been the right one, as there is a degree of absorption that perhaps would have been lacking with the upsize. It feels secure and planted at high-speeds, almost European-like.  The longer wheelbase of the VF7 appeared to give it a greater sense of stability at high speeds than the VF6, if perhaps robbing it of a bit of handling playfulness in the process. That said, the drive modes did well to add (or remove) steering weight for the desired driving conditions. 2025 Vinfast VF7 price and verdict – 8/10 If priced aggressively, it could be a unique proposition in India. While the Vinfast VF7’s estate-like form factor might not be to everyone’s tastes, those seeking substance over style will appreciate it. The rear seat and boot are incredibly spacious, making this a great car for families or the chauffeur driven. Plus there’s the AWD version for those who like the occasional hit of performance on their Sunday drive. With local assembly from the get go, Vinfast is expected to go aggressive with the price, and we expect it to be in the region of Rs 25 lakh (ex-showroom) for the FWD version, going up to about Rs 29 lakh for the dual-motor AWD version. With the features and safety kit on offer, that should make it very competitive. Upon launch, prices are expected to range between Rs 25 lakh-29 lakh (ex-showroom). Whether in look, spec or character, the VF7 is a unique proposition for the Indian market, and perhaps that’s exactly what new entrant Vinfast needs to make people sit up and take notice. We’ll know more when the VF7 (followed closely by the VF6) goes on sale in India in the festive season of 2025. Also See: 2025 Vinfast VF6 review: Curvv EV rival is big on features Vinfast VF6 and VF7 video review",
    "author": "Gavin D'Souza",
    "published": "Wed, 11 Jun 2025 12:13:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250611121459_Vinfast VF7 front tracking .jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "796805f6-db3d-4d0b-9a33-db3973adcfd1",
    "title": "Vinfast VF6 and VF7 video review",
    "link": "https://www.autocarindia.com/car-video-reviews/vinfast-vf6-and-vf7-video-review-435654#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: 2025 Vinfast VF6 review: Curvv EV rival is big on features",
    "author": "Gavin D'Souza",
    "published": "Tue, 10 Jun 2025 11:07:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250610110626_Vinfast VF6 and VF7 review .jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "34127083-416c-4fa1-a0d9-e47be2833e92",
    "title": "2026 BMW XM Label: Frozen Tanzanite Blue, New Black Wheels",
    "link": "https://www.bmwblog.com/2025/06/12/2026-bmw-xm-label-frozen-tanzanite-blue-new-black-wheels/",
    "description": "Unsurprisingly, BMW isn’t investing in a full Life Cycle Impulse for the XM. However, it’s not neglecting its most powerful production vehicle either. For 2026, the plug-in hybrid SUV gains an extra layer of customization,... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Thu, 12 Jun 2025 15:38:05 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/06/2026-bmw-xm-frozen-tanzanite-blue-00-625x830.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "XM",
      "2026 BMW XM",
      "bmw xm",
      "XM Label"
    ]
  },
  {
    "id": "c6271d4f-7f5b-4cf5-a316-dcf2c18a5712",
    "title": "2026 BMW iX3 Leaked Specs Reveal Power And Battery Details",
    "link": "https://www.bmwblog.com/2025/06/12/2026-bmw-ix3-50-xdrive-leaked-specs/",
    "description": "When BMW previewed the new iX3 yesterday, it shared some key preliminary technical details. We learned that the 50 xDrive model for Europe will offer a range of up to 800 kilometers on the WLTP... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Thu, 12 Jun 2025 12:25:54 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/06/2026-bmw-ix3-na5-review-10-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "iX3",
      "iX3 NA5"
    ]
  },
  {
    "id": "83691742-3689-479d-ac57-c7bd7d0c7e21",
    "title": "Hyundai to reveal Ioniq 6 N at Goodwood Festival of Speed in July",
    "link": "https://www.autocar.co.uk/car-news/new-cars/hyundai-reveal-ioniq-6-n-goodwood-festival-speed-july",
    "description": "Electric saloon’s transformation into a BMW M3 alternative brings twin spoilers and big power boost Hyundai has confirmed its new Ioniq 6 N performance saloon will be revealed at the Goodwood Festival of Speed next month. The company has also released new images of the hot saloon, showing its twin rear spoilers and a chunky diffuser influenced by the one fitted to the extreme RN22e concept car. Although not fully shown, the front end of the new Ioniq 6 N draws on the sporty new N Line variant of the standard Ioniq 6, which was updated earlier this year. The changes are intended to “maintain aerodynamic performance while achieving a smoother, more refined silhouette”, said Hyundai. Asked what else we can expect, Simon Loasby, vice president of Hyundai styling group, said: “The huge wing. You’ve got all those curves on top so we need to counter the lift. \"Compared to Ioniq 5 N, we’ve had the chance to widen the fenders (who doesn’t love a wide body?) so it’s got even more stance, even more squat and even more cool factory.” Inside, the Ioniq 6 N is expected to adopt key components from the Ioniq 5 N crossover, such as its three-spoke steering wheel with N-specific drive mode buttons, as well as its more supportive front bucket seats. Power is most likely to come from the same 641bhp dual-motor powertrain used by the Ioniq 5 N. This is capable of replicating the power delivery of an internal combustion engine mated to a dual-clutch sequential gearbox, complete with shift paddles for simulated gearchanges. It’s possible that Hyundai will boost this set-up for the Ioniq 6 N, but a 0-62mph time of 3.4sec (as with the Ioniq 5 N) would put the saloon on a par with ICE mainstays such as the BMW M3. The Ioniq 5 N also packs an 84.0kWh battery that officially yields a range of 278 miles, although it’s likely that the more aerodynamic Ioniq 6 N will boost this nearer to the 300-mile mark. The car is likely to arrive in UK showrooms this winter. Prices are predicted to start at just below £70,000.",
    "author": "",
    "published": "Thu, 12 Jun 2025 12:46:00 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/ioniq_6_n_teaser_dual_4x3.jpg?itok=xqbGy9-0",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "79d0f5da-5cb7-44d9-b9f9-6fd6a056a29b",
    "title": "Volkswagen begins testing £22k ID 2 hatch ahead of 2026 arrival",
    "link": "https://www.autocar.co.uk/car-news/new-cars/volkswagen-begins-testing-%C2%A322k-id-2-hatch-ahead-2026-arrival",
    "description": "Production version of electric hatch was previewed by ID 2all concept in 2023 Volkswagen has started testing the ID 2, one of its most important cars in recent times, and prototypes have been spotted in a clever camouflage. Photographed near Germany's Nürburgring circuit, where the ID 2 is being put through its paces, the test mules are clad in Volkswagen Polo body panels in a bid to disguise the electric car, as well as avoid the attention that a classic camouflage livery may attract. Despite this test car's unassuming white look, certain details confirm what is underneath – such as the short front overhang, distinct fascia, smaller rear lights and a fake door release at the bottom of the boot lip. These details reveal that the production car will feature many similarities to the 2023 ID 2all concept. Indeed, VW design chief Andreas Mindt previously told Autocar that such an approach was likely because his team had fought hard to make sure the production model closely followed the styling and dimensions of the concept. He added: “It’s even better [than the concept]. I really like it and it’s one of the reasons I’m so optimistic for our future.” The pictures also give away some of the interior details. For example, while the ID 2all concept was fitted with a flat-bottomed steering wheel, the production mule looks to be using a wheel with a flat top too. This is similar to what was shown in the smaller ID Every1 concept, suggesting some of that car's kit (including the refitting of physical controls) will also be adopted by the ID 2. The production ID 2 is pencilled in to go on sale next year priced at around £22,000, which would make it one of the cheapest EVs in the UK. Before then, the ID 2X, its £25,000 supermini-sized crossover cousin, will be revealed at the Munich motor show in September, although it won’t go on sale until a year after the hatch.  Underneath, the ID 2 will be based on the shortened version of the MEB platform and, like the ID 2X, will be offered exclusively with a single motor on the front axle, giving 223bhp, and a choice of 38kWh and 56kWh batteries - the latter providing a range of around 280 miles. Volkswagen has said the larger battery will be capable of topping up at 125kW to take its state of charge from 10% to 80% in just 20 minutes.  A hot GTI variant of the ID 2 is also in the works and has been previewed by the ID GTI concept. It will enter production in 2027 with a bespoke soundtrack and gadgets but will not, like other hot EVs such as the Hyundai Ioniq 5 N, feature a fake gearshift. Details are still sketchy but VW technical chief Thomas Schäfer said it will prioritise “go-kart” handling and fun over outright power. The ID 2 is one of the Volkswagen Group’s four entry-level electric models in a line-up that also includes the Cupra Raval and Skoda Epiq. It will be built alongside the Raval at Seat’s Martorell plant in Spain, with the ID 2X and Epiq produced at VW’s nearby Pamplona factory.",
    "author": "",
    "published": "Thu, 12 Jun 2025 11:40:20 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/vw_id2_prototype_testing_front_3_4.jpg?itok=4BfBEoPm",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "a6887b22-790a-4019-8457-610abf967766",
    "title": "Something Blue: A Yamaha SR150 Street Tracker by 2LOUD Custom",
    "link": "https://www.bikeexif.com/yamaha-sr150-street-tracker",
    "description": "In Taiwan, small bikes rule the roost. The country is bursting with sub-200 cc commuter motorcycles, many of which are produced locally. They’re easy to handle in tight traffic, robust, and easy to maintain—and since they’re not subject to the same taxes as bigger bikes, they’re more affordable too. The utilitarian nature of these plucky single-cylinder machines means that, although they’re visually bland, they’re also very simple. And that makes them ripe for customization. The Taiwanese workshop 2LOUD Custom knows this all too well. Founder Ma ‘Max’ Yicheng has churned out countless customs based on small bikes from popular local brands like Kymco and SYM. Today, he’s treating us to a delightful Yamaha SR150 street tracker. A distant cousin of the more famous Yamaha SR500, the now-defunct SR150 was built in Taiwan exclusively for the local market.…",
    "author": "Wesley Reyneke",
    "published": "Thu, 12 Jun 2025 21:35:52 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/06/fb-6.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "2LOUD Custom",
      "Street Tracker",
      "Yamaha motorcycles",
      "Yamaha SR150"
    ]
  },
  {
    "id": "100fa594-fcec-4fdc-a970-4d04e253afce",
    "title": "Knives for Motorcycle Riders: Essential Picks for the Road",
    "link": "https://www.bikeexif.com/knives-for-motorcycle-riders",
    "description": "We were introduced to Angus “Mac” Macgyver in the 1980s. Every week, the secret agent portrayed by Richard Dean Anderson showed audiences that ingenuity, duct tape and a trusty Swiss Army Knife could get you out of just about any problem. While you might not have the brains MacGyver had, he was correct that a good blade can help get you out of a jam. But before you go out to purchase a Rambo-edition bowie knife, you’ll want to make a realistic assessment of what you’ll be asking of a knife you carry on your motorcycle. The first thing to do is hone in on the knife’s application. Is it going to be used for roadside repairs, cooking and camping, or just something on your hip to look the part?…",
    "author": "Tom Gosselin",
    "published": "Thu, 12 Jun 2025 17:00:14 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/06/nick-knives-cowboy.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Lifestyle",
      "Motorcycle accessories"
    ]
  },
  {
    "id": "c843505e-4452-4331-9916-f9865fdcb9ee",
    "title": "A Massive Muscle Car Just Squished A Porsche At A Wet Track Day",
    "link": "https://www.carscoops.com/2025/06/a-massive-muscle-car-just-squished-a-porsche-at-a-wet-track-day/",
    "description": "Driving on a track is dangerous, especially in the wet if you don't have appropriate tires",
    "author": "Brad Anderson",
    "published": "Fri, 13 Jun 2025 01:13:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/06/Porsche-911-GT3-RS-Crash-Netherlands-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Abarth Videos",
      "Accidents",
      "Dodge",
      "Dodge Challenger",
      "Dodge Videos",
      "Offbeat News",
      "Porsche",
      "Porsche 911",
      "Porsche 911 GT3 RS",
      "Porsche Videos"
    ]
  },
  {
    "id": "ce7e95d7-1b65-41f9-91c0-9fede6048471",
    "title": "Ten Minutes Separate This Hyundai From Glory",
    "link": "https://www.carscoops.com/2025/06/ten-minutes-separate-this-ioniq-5-n-from-glory/",
    "description": "A special Hyundai Ioniq 5 N is headed to Pikes Peak later this month",
    "author": "Michael Gauthier",
    "published": "Fri, 13 Jun 2025 00:30:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/06/Hyundai-Ioniq-5-N-Pikes-Pea-copy-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Hyundai",
      "Hyundai IONIQ 5",
      "Motorsports",
      "Pikes Peak",
      "Racing"
    ]
  },
  {
    "id": "4d7657cd-691a-477e-bd00-a282a0d3537f",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "fa4d7a69-7948-45b5-b5e9-c191585893b2",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  },
  {
    "id": "563b2d84-6ff0-465f-a444-42e898764aad",
    "title": "Trump Strikes Down California's Emissions Standards, California Sues Back",
    "link": "https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/",
    "description": "Trump signed three new laws that would roll back the state's ambitious emissions and electrification plans, and California responded with extreme swiftness.",
    "author": "Nicholas Werner",
    "published": "Thu, 12 Jun 2025 22:10:56 +0000",
    "image": "https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/l-intro-1749766114.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "2fb7fff5-c41c-4c54-8b73-dc322e2c20a5",
    "title": "Top Wall Street Auto Analyst Thinks The U.S. EV Market Is In For A World Of Hurt",
    "link": "https://www.jalopnik.com/1883218/wall-street-auto-analyst-us-ev-market-predictions/",
    "description": "Bank of America analyst John Murphy rolled out his annual \"Car Wars\" report on the state of the auto industry, and his outlook for EVs is pretty depressing.",
    "author": "Matthew DeBord",
    "published": "Thu, 12 Jun 2025 21:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/top-wall-street-auto-analyst-thinks-the-u-s-ev-market-is-in-for-a-world-of-hurt/l-intro-1749594926.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "EVs and Hybrids",
      "Buying"
    ]
  },
  {
    "id": "fce1722a-1b76-497b-b48d-0ba38baebf54",
    "title": "Skoda Octavia RS India launch confirmed for 2025",
    "link": "https://www.autocarindia.com/car-news/skoda-octavia-rs-india-launch-confirmed-for-2025-435695#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Skoda has confirmed the India launch of the Octavia RS for this year. Speaking to Autocar India, Ashish Gupta, the newly appointed brand director for Skoda India, said, “The Octavia RS is something that we will definitely bring to India this year.” Although Gupta didn’t commit to a specific timeline, we understand the new Octavia RS will be here in India by the festive season. Octavia RS will be brought to India as a CBU Powered by a 265hp, 2.0-litre turbo-petrol engine Other CBU models, including diesels, put on hold for now Skoda Octavia RS to be brought as a CBU Expected to have a price tag of north of Rs 50 lakh Having made an appearance at the Bharat Mobility Global Expo in January, the Octavia RS will finally go on sale as a full import this year, although allocations are likely to be limited. The Octavia already has a loyal fan following in India, especially in RS guise, so this will indeed be a much-awaited launch for enthusiasts. The 200 units of the previous-gen Octavia RS 245 brought to India, despite the steep price tag, were a quick sell for the brand. The fourth-generation Octavia RS is powered by a 265hp, 2.0-litre turbo-petrol engine, the same unit that does duty on the recently launched Volkswagen Golf GTI. We’ve already driven the new Octavia RS in Croatia, both on road and on track, more about which you can read here.    However, being a CBU, pricing will be on the steeper side, and we expect it to be north of Rs 50 lakh (ex-showroom). The positioning, therefore, will be quite similar to the VW Golf GTI. Skoda Kodiaq RS, Superb India launch put on hold Launch of Skoda diesels also unlikely in the near future While the launch confirmation of the Octavia RS is certainly good news, Skoda was also considering bringing the Kodiaq RS, the Superb and even the regular Octavia to India. In fact, the brand had also hinted at bringing back diesel with the Superb and considered locally assembling the Octavia. However, these models have been put on hold for now, and Gupta says that’s due to the uncertainty around the FTA agreements and other geopolitical scenarios. Superb diesel was showcased at the Bharat Mobility Global Expo earlier this year. “With talks of the FTA agreement, new policies and tariffs, the market is very uncertain. Even if I want to bring about a structure for my upcoming product portfolio, the variables are so many that every strategy is currently fraught with risks. Although we do have a plan in mind about what cars can make it to India and should make it to India, all these uncertainties do not allow us to take decisions,” says Gupta. So, while the Octavia RS will serve as a halo model and a brand builder, Skoda will focus on its locally produced models, especially the Kylaq. The compact SUV has turned around the brand’s fortune in India with average sales of 5,000 units a month; plus, there are lifecycle updates for the Kushaq and Slavia in the pipeline. Skoda is also actively expanding its dealer network and customer touchpoints to reach out to a wider market. Skoda Kylaq is averaging sales of 5,000 units a month.  “We definitely want to focus on models from our global line-up, but I want to do it in a structured manner. I do not want to carpet-bomb the market and ourselves. I want to focus on what matters at this point, and that is the Kylaq and the current portfolio that we have. Our objective is to have a portfolio that is consistent and always present. I’d rather have less and be consistent with it than have more and not be consistent with it,” Gupta explained.   Following the Kylaq’s launch, Skoda has jumped to the seventh position in India and even managed its highest-ever monthly sales of 7,422 units in March 2025.   With inputs from Saptarshi Mondal  Also See: Jeep Grand Cherokee Signature Edition launched at Rs 69.04 lakh Renault Duster, Bigster hybrid launch within 12 months of petrol model",
    "author": "Hormazd Sorabjee",
    "published": "Thu, 12 Jun 2025 18:23:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250612064029_Octavia RS Launch Confirmed.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "8aa8ec0d-88b8-4736-8a67-6eca813cf9b2",
    "title": "Arvid Lindblad – Red Bull junior next in line for F1?",
    "link": "https://www.autocarindia.com/motor-sports-news/arvid-lindblad-red-bull-junior-next-in-line-for-f1-435676#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "“Lando, I want you to remember me; I’ll see you in five years.” Then 14-year-old Arvid Lindblad made a bold promise to Lando Norris when he met him at Italy’s Adria Karting Raceway back in 2021. Fast forward to 2025, and now 17-year-old Lindblad is on the precipice of making those words come true. “It was quite a spur-of-the-moment thing,” the Brit reflects on his comment made to Norris. He shared that it was partly inspired by a young Lewis Hamilton (who was 10 at the time), approaching then McLaren team principal Ron Dennis at the 1995 Autosport Awards and telling him he wanted to race for McLaren in the future. Fast track Lindblad becomes the youngest F2 race winner “I’m sticking to the timeline quite well. I didn’t give myself much margin because I’ve gone through the categories as fast as possible,” quips Lindblad. After a meteoric rise through the motorsport ranks, he’s currently racing in F2 – just three years after making his single-seater debut back in 2022. And the Red Bull junior has already made history in the championship, becoming the youngest-ever F2 race winner thanks to his Sprint Race triumph at Jeddah. That was just the third round in his rookie F2 season. When asked if he expected his first win to come so soon, Lindblad replied, “Some people talk about having a learning year, I’ve never had that mindset. I want to win in everything that I do.” He added, “I knew the beginning of the season was going to be the hardest because I was coming with the least experience, and there was the most to learn. I wasn’t expecting it (his first F2 win) to come so early, but I knew that I had a really good team behind me.” But Lindblad isn’t just satisfied with the records and acknowledged that “there’s still a lot of work to be done.” “I do want to challenge for wins, pole positions, and podiums in Feature Races, especially in the second half of the season, ideally even sooner,” he added. Lindblad didn’t have to wait too long to taste his first Feature Race victory. A little over two months after Jeddah, he added another F2 win to his tally, this time for the Barcelona Feature Race – a result that moves him up to third in the standings. Lindblad points out that this is also a crucial year of learning for him, though. “I’m still very young and inexperienced,” he admitted. “I’m 17, racing in F2 in [just] my third year of [racing] cars. I think most people in F2 are in their fifth or sixth year in cars. So, it’s also a combination of just maximising every weekend and also trying to improve as a driver, because there’s still a lot that I have to experience and a lot of knowledge still to acquire.” F1 on the horizon Lindblad granted Super Licence It was a busy ‘off-season’ for Lindblad over the winter. After post-season testing in Abu Dhabi, he visited India to connect with his roots. While his surname is clearly indicative of his Swedish ancestry, few know about Lindblad’s Indian heritage (from his mother’s side). “I really enjoyed my time in India. It was amazing to see and experience my heritage and learn more about my Indian roots.” But it was soon time to go racing again. He competed in and won the 2025 Formula Regional Oceania Championship at the start of the year. One big reason why he undertook this campaign was to collect enough Super License points, which is necessary to race in F1. It’s no secret that Lindblad is on Red Bull’s radar. He’s been part of their junior programme since 2021 and has earned plenty of praise from Red Bull motorsport advisor Helmut Marko and F1 team principal Christian Horner. F1 currently requires drivers to be at least 18 years old to obtain even a Friday practice Super License. But there is a clause that allows drivers to receive one at 17, should they be “judged to have recently and consistently demonstrated outstanding ability and maturity in single-seater formula car competition.” It is understood that Red Bull had already applied for this exemption earlier this year, and following a recent meeting, the FIA World Motor Sport Council has granted Lindblad a Super Licence before he turns 18 this August. This paves the way for him to participate in upcoming Friday practice sessions. All the signs certainly indicate that Red Bull is gearing up for Lindblad to make his F1 debut sooner rather than later. But it’s also well known that Red Bull’s junior programme is fiercely competitive. Just earlier this year, Liam Lawson was replaced by Yuki Tsunoda at the parent team after just two races. However, Lindblad says he doesn’t necessarily feel the pressure to stand out. “The way I see it is I want to be in Formula 1. I had [that] dream long before I started being part of the Red Bull programme,” he added. “They believe in me, and that’s why I’m on their programme. But I’m here for myself, I want to win. And they want to win as well, so they want to bring drivers through to the main team. I see it more as them having confidence and belief in me, which actually gives me confidence, rather than anything to the contrary.” Also see: Fast track to F1? Lindblad discusses F3 title fight, India connect and more",
    "author": "Unnatee Gidithuri",
    "published": "Thu, 12 Jun 2025 17:20:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250611044700_arvid_lindblad_super_licence.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "dd8b6e6a-99c5-49a8-9c44-b39c2aed06af",
    "title": "Trump Administration Blocks California EV Rules, Threatens Higher Tariffs",
    "link": "https://www.caranddriver.com/news/a65049309/trump-blocks-california-ev-rules-threatens-tariffs/",
    "description": "President Trump signed joint resolutions of Congress to block California's plan to phase out the sale of cars using only internal combustion by 2035.",
    "author": "",
    "published": "Thu, 12 Jun 2025 21:06:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "02bba5a9-3157-4163-ab24-49a38aba2bb3",
    "title": "When and Where to Watch the 2025 24 Hours of Le Mans",
    "link": "https://www.caranddriver.com/news/a65045976/2025-24-hours-of-le-mans-where-to-watch/",
    "description": "The 24-hour gauntlet will kick off with the waving of the French tricolour at 10:00 a.m. ET this Saturday—here's how to watch it.",
    "author": "",
    "published": "Thu, 12 Jun 2025 18:51:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "3d69bab6-2a8a-4046-8e48-3d2bc10fdd45",
    "title": "A How-To Guide To ITBs With Project NSX",
    "link": "https://www.speedhunters.com/2025/04/guide-itbs-project-nsx/",
    "description": "What do we love so much about naturally aspirated engines? Perhaps the musicality, or the responsiveness, or the combination of both that creates an emotionally rewarding experience with every stab at the throttle pedal. Well, whatever underpins that appeal, I can say for sure that nothing turns it up to 11 quite like a set of […] The post A How-To Guide To ITBs With Project NSX appeared first on Speedhunters.",
    "author": "Blake Jones",
    "published": "Tue, 08 Apr 2025 23:31:04 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Australia",
      "honda",
      "individual throttle bodies",
      "ITB",
      "ITBs",
      "NA1",
      "NSX",
      "project car",
      "Project Cars",
      "Project NSX",
      "Speedhunters Project Car"
    ]
  },
  {
    "id": "f0a0d534-7420-4bcb-ae82-284dc1d42f59",
    "title": "3 Days At The World’s Most Luxurious Race Track",
    "link": "https://www.speedhunters.com/2025/04/3-days-worlds-luxurious-race-track/",
    "description": "That’s what Cornes \u0026 Co did here in Japan, and with that, we’re left with The Magarigawa Club. The Magarigawa Club is not hot off the press news, it’s actually been open for a little over 18 months now, but since it’s doors have opened, I had yet to have the chance to visit and see what […] The post 3 Days At The World’s Most Luxurious Race Track appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Sat, 05 Apr 2025 04:39:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Circuit",
      "honda",
      "japan",
      "Manthey",
      "Porsche"
    ]
  },
  {
    "id": "158c3bd7-bef5-4baf-b619-e44cd6d9f3c6",
    "title": "Hyundai Teases Upcoming Ioniq 6 N",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/hyundai-teases-upcoming-ioniq-6-n-44514562?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "The automaker from Korea will be serving an extra helping of kimchi on the Ioniq 6 when the N variant debuts later this year.",
    "author": "Matthew Guy",
    "published": "Thu, 12 Jun 2025 19:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/06/12/15062/post.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "d02d7934-f735-47e6-bc96-bf8bd52f7539",
    "title": "President Trump Signs Resolution Blocking California's More Restrictive Emissions Rules",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/president-trump-signs-resolution-blocking-california-s-more-restrictive-emissions-44514547?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "President Biden’s administration approved of California’s gas vehicle phase-out plans, but today, President Trump took action to block the state’s electrification efforts. The president signed joint resolutions earlier today that block California’s eventual gas-vehicle sales prohibition.",
    "author": "Chris Teague",
    "published": "Thu, 12 Jun 2025 18:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/06/12/14051/post.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "3d9fae91-36be-4aa9-afa5-c083db112ec2",
    "title": "The Kyza Creates A Concept To Make The M2 CS Look Tame",
    "link": "https://www.autoblog.com/news/kyza-creates-g87-bmw-m2-ks-render-2002-hommage-inspired",
    "description": "Khyzyl Saleem, better known as 'The Kyza,' is a sometimes controversial character. He's designed wacky cars for videogames, some of which occasionally come to life, and he's part of the TWR Supercat project that gives the old Jaguar XJS a whole new attitude far beyond anything the original creators ...",
    "author": "Sebastian Cenizo",
    "published": "Thu, 12 Jun 2025 20:44:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTA2MDIx/bmw-m2-ks-render-by-the-kyza.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "bmw",
      "render",
      "Performance",
      "M2",
      "car design",
      "News",
      "Concept Cars",
      "Coupe"
    ]
  },
  {
    "id": "7aeadb8c-6f4e-4317-a363-a23c7eb20d39",
    "title": "Can It Be A Blower Bentley Without A Blower?",
    "link": "https://www.autoblog.com/news/can-it-be-a-blower-bentley-without-a-blower",
    "description": "The 4½-Liter Blower Bentley is, perhaps, the most iconic Bentley ever built. It’s a car created by W.O. Bentley himself in response to the increasing power of race cars. A mere 54 were built from 1929 through 1931, with four fitted as race cars. Despite having never won an international race, ...",
    "author": "Larry Printz",
    "published": "Thu, 12 Jun 2025 20:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTAwOTU3/bentley-blower-jnr-ev.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Electric",
      "Bentley"
    ]
  }
]
