[
  {
    "id": "89cff9f1-611c-404a-98c1-56a4d5071f65",
    "title": "1995 Ducati 916 at No Reserve",
    "link": "https://bringatrailer.com/listing/1994-ducati-916-2/",
    "description": "This 1995 Ducati 916 was assembled at the Cagiva Center factory in Varese, Italy in the model’s first year of production. It was placed in long-term storage in 2015 and has not been started since the seller's acquisition in 2022. Finished in red, the motorcycle is equipped with a 916cc desmodromic L-twin, Weber-Marelli electronic fuel injection, a six-speed transmission, adjustable suspension, Brembo triple disc brakes, 17\" Brembo alloy wheels, an integrated clear windscreen, clip-on handlebars, a black vinyl Monoposto seat, and a carbon-fiber rear hugger. This 916 shows 11k miles and is offered at no reserve with a clean California title in the seller's name.",
    "author": "bringatrailer",
    "published": "Fri, 07 Mar 2025 00:55:07 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/02/1994_ducati_916_1994_ducati_916_736aa485-3f2a-440d-9f72-83157c322da7-7NJlkv-38166-38167-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "48b1f3a1-3be4-4177-a1c9-db431137b979",
    "title": "Ex-Reggie Jackson 409-Powered 1962 Chevrolet Impala SS Convertible 4-Speed",
    "link": "https://bringatrailer.com/listing/1962-chevrolet-impala-ss-15-2/",
    "description": "This 1962 Chevrolet Impala SS convertible was owned by Hall of Fame baseball player Reggie Jackson from 2007 until it was purchased on BaT in February 2022 by its current owner. A replacement 409ci V8 was mated to the four-speed manual transmission in 2015, and the Honduras Maroon exterior was repainted twelve years earlier. Additional equipment includes a black soft top and vinyl upholstery, quad headlights, chrome bumpers and trim, power steering, and painted 14″ wheels with covers as well as SS bucket seats and badging, a tachometer, an auxiliary gauge pod, a heater, and a hidden Pioneer cassette stereo and CD changer. This Impala SS is now offered on dealer consignment with a clean Florida title.",
    "author": "bringatrailer",
    "published": "Fri, 07 Mar 2025 00:50:11 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/02/1962_chevrolet_impala-ss_002-55101-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "1b99ef31-d750-4dcc-b8e1-085ba750f7d9",
    "title": "Volkswagen partners with CATL to improve EV battery tech",
    "link": "https://www.autoblog.com/news/volkswagen-partners-with-catl-to-improve-ev-battery-tech",
    "description": "Volkswagen hasn't been faring well in the world's largest car market, but a new partnership could be the key to turning it all around.",
    "author": "Joseph Pudlewski",
    "published": "Fri, 07 Mar 2025 00:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNTExNTAyMDc3MzM5MjY0/2025-volkswagen-id7.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "volkwagen",
      "News",
      "China",
      "Volkswagen",
      "EVs",
      "CATL"
    ]
  },
  {
    "id": "bb735a70-42b4-47b1-9498-2fd2d56cbfca",
    "title": "Another Chinese automaker is taking the fight to Tesla",
    "link": "https://www.autoblog.com/news/another-chinese-automaker-is-taking-the-fight-to-tesla",
    "description": "Xpeng saw a dramatic jump in sales last year, and now the Chinese automaker is taking the fight to Tesla on a global scale.",
    "author": "Joseph Pudlewski",
    "published": "Thu, 06 Mar 2025 23:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEzMjg3NTQ3NjM4MzkyMjcx/xpeng-g6.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "China",
      "G6",
      "tesla",
      "Xpeng G6",
      "News",
      "XPeng",
      "XPeng",
      "EVs"
    ]
  },
  {
    "id": "1ac91cbd-27e1-475f-ac9a-d4a2e83357a0",
    "title": "Tire Killer: A supercharged Triumph Speed Triple 1200 RR from the UK",
    "link": "https://www.bikeexif.com/supercharged-triumph-speed-triple-1200-rr",
    "description": "If you haven’t sampled the Triumph Speed Triple 1200 RR yet, you’re missing out. By combining the Speed Triple’s character-rich 1,160 cc triple-cylinder motor with classic café racer styling and sportbike ergonomics, Triumph has nailed the balance between modern and retro. And with a spec sheet that includes Öhlins semi-active electronically adjustable suspension, it means business. Still, Jody Millhouse and his team at Thornton Hundred saw the potential for more. Based in Milton Keynes, UK, the shop has a habit of cranking Triumph’s modern classics up to eleven. Think Triumph Bobbers with superchargers and swathes of carbon fiber, and you’ll get the idea. The Triumph Speed Triple 1200 RR isn’t the sort of bike you’d typically see on Thornton Hundred’s bench, but that didn’t hold them back.…",
    "author": "Wesley Reyneke",
    "published": "Thu, 06 Mar 2025 21:39:12 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/03/supercharged-triumph-speed-triple-1200-rr.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Triumph motorcycles",
      "Triumph Speed Triple"
    ]
  },
  {
    "id": "77de1ff5-da07-4fb1-a9f7-30c053f7cca9",
    "title": "Everything Zen: A charming BMW R65 bobber from Sydney",
    "link": "https://www.bikeexif.com/bmw-r65-bobber",
    "description": "Located in Sydney, Australia, Zen Motorcycles is as eclectic as the burgeoning motorcycle scene it serves. The shop sells brand new electric motorcycles alongside pre-owned gas guzzlers, and offers services on everything from vintage Harleys to modern sportbikes. Somehow, they still find time to build charming custom bikes—like this 1979 BMW R65 bobber. Fittingly, finding time was the most challenging aspect of this particular project. That’s because it was the pet project of Zen co-founder Bruce Crerar, and often had to sit on the back burner while client projects took precedence. “I’ve always been a fan of the boxer engine and some of the amazing builds people create all around the world and was inspired to try and create one for myself,” says Bruce.…",
    "author": "Wesley Reyneke",
    "published": "Tue, 04 Mar 2025 19:45:00 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/03/bmw-r65-bobber-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "BMW motorcycles",
      "BMW R65",
      "Bobber motorcycles"
    ]
  },
  {
    "id": "6782acb8-18b6-48be-96b4-563b19b1da16",
    "title": "Audi Q5",
    "link": "https://www.autocar.co.uk/car-review/audi/q5",
    "description": "Audi’s family SUV moves onto the PPC platform for its third generation, but fans will recognise the bones Ingolstadt has enjoyed playing around with the letters and numbers that accompany the Q5 badging on the back of an Audi Q5 in the last few years. But perhaps it should brandish just one word underneath the rear lights: success.The Q5 is Audi’s best-seller (taking 17% of the German brand's global sales in 2024) and can be seen across multiple continents, fulfilling the needs of family SUV owners worldwide.This new-generation model sits on the new Premium Platform Combustion (PPC) platform, which it shares with the new Audi A5 and Audi A6 saloons and estates.Unlike those cars, the Q5 isn't offered with a pure combustion engine. It comes with either a 2.0-litre petrol or 2.0-litre diesel engine with a mild-hybrid system. Two plug-in hybrid powertrains are planned for the future too.And there's a 3.0-litre petrol V6-engined sports model called the Audi SQ5, which gets its own separate review.Audi’s renewed investment in these powertrains and this model point to larger electric transition plans for the company, which focus on the slower than anticipated uptake of electric cars.",
    "author": "",
    "published": "Thu, 6 Mar 2025 23:05:18 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/q5_sakhir_gold_metalic001_02369.jpg?itok=3wnIKNe6",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "db498e79-103f-47b4-863b-ad312b2286ce",
    "title": "Audi SQ5",
    "link": "https://www.autocar.co.uk/car-review/audi/sq5",
    "description": "Ingolstadt’s sporty SUV steps away from diesel and goes back to petrol There’s a very small detail on the new-generation Audi SQ5 that I think means a great deal: the red Audi Sport oblong is back. This oh-so-subtle differentiator could for a very short amount of time be stuck on the back of anything that had four rings at the front. Then Audi got rid of it entirely. Now it’s back on a proper S car.It would be a reach to say this ties up with Audi Sport returning to form, but this SQ5 is certainly good and much more of an S car than Audi’s latest electric cars. With the EV stuff, S variants have been a touch meh – more of a trim level with a few nice bits, rather than the toned-down RS experience that we had all come to enjoy. Sure, the S6 E-tron is quicker than the regular Audi A6 E-tron, but with an EV it’s a bit like, so what? Plus it has a notably shorter range. By contrast, the SQ5 is notably different to the regular Audi Q5.",
    "author": "",
    "published": "Thu, 6 Mar 2025 23:05:18 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/sq5_ultra_blue_metalic_001_04307_1.jpg?itok=-yFonpyX",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "660675c4-d138-401d-8149-cffa38394264",
    "title": "Audi A6 Avant vs. BMW 5 Series Touring: Which Luxury Wagon Wins?",
    "link": "https://www.bmwblog.com/2025/03/06/audi-a6-avant-vs-bmw-5-series-touring-comparison/",
    "description": "Audi just debuted the newest addition to their lineup, the A6 Avant. The model is positioned squarely to be cross-shopped with the 5 Series Touring, and likewise won’t be offered in the United States market.... First published by https://www.bmwblog.com",
    "author": "Steven Paul",
    "published": "Thu, 06 Mar 2025 22:11:45 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/03/bmw-5-series-touring-audi-a6-avant-c9-05-830x830.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "5 Series",
      "Audi A6 Avant",
      "BMW 5 Series Touring",
      "G61"
    ]
  },
  {
    "id": "96944688-61d0-4195-924b-e3cedb0745f9",
    "title": "BMW’s Gen6 Motors Will Reverse in Snow and Ice Conditions",
    "link": "https://www.bmwblog.com/2025/03/06/bmw-neue-klasse-awd-reverse-snow-ice/",
    "description": "BMW’s newest dual-motor setup, which relies on asynchronous motors (ASMs) and externally excited synchronous motors (EESMs), has some people worried. Particularly, those in Norway, who frequently rely on all-wheel drive capabilities to traverse snow-covered parking... First published by https://www.bmwblog.com",
    "author": "Steven Paul",
    "published": "Thu, 06 Mar 2025 21:22:28 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/02/bmw-gen6-motors-06-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "News",
      "ASM",
      "EESM",
      "Gen6"
    ]
  },
  {
    "id": "6f05cebf-4947-426a-b7cd-29b7c3fd5251",
    "title": "Millionaire Tricked Into Paying $5.4M For Fake Mercedes-AMG ONE Sale",
    "link": "https://www.carscoops.com/2025/03/millionaire-loses-5400000-to-fake-mercedes-amg-one-scam/",
    "description": "The perpetrator is already in jail for a separate crime police say",
    "author": "Stephen Rivers",
    "published": "Fri, 07 Mar 2025 00:50:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "AMG",
      "Mercedes-AMG One",
      "Offbeat News",
      "Police",
      "Reports"
    ]
  },
  {
    "id": "b291913b-87a6-4912-ae49-645a73766f4f",
    "title": "Man Arrested After Alleged Molotov Cocktail Attack And Shooting At Tesla Store",
    "link": "https://www.carscoops.com/2025/03/man-arrested-after-alleged-shooting-and-arson-at-tesla-dealership/",
    "description": "In two attacks at an Oregon dealership, multiple windows were shot, and a Model X was firebombed",
    "author": "Michael Gauthier",
    "published": "Fri, 07 Mar 2025 00:10:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/03/TewslaHU-GHI-2-tg-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Dealers",
      "Elon Musk",
      "Offbeat News",
      "Police",
      "Tesla",
      "Video"
    ]
  },
  {
    "id": "979e95f9-c1fa-4b29-9711-fd14ab359641",
    "title": "New York Nissan Dealer Gives Woman A Free Car After A Wisconsin Dealer Called Her A Racial Slur On An Oil Change Sticker",
    "link": "https://www.jalopnik.com/1804909/dealership-gift-free-car-after-racial-slur-oil-change-sticker/",
    "description": "The dealership initially tried to cover up the evidence, and it turns out multiple employees knew about the slur that had been left on the customer's car",
    "author": "Lawrence Hodge",
    "published": "Thu, 06 Mar 2025 22:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/new-york-nissan-dealer-gives-woman-a-free-car-after-a-wisconsin-dealer-called-her-a-racial-slur-on-an-oil-change-sticker/l-intro-1741222457.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Buying",
      "Crime"
    ]
  },
  {
    "id": "e30bad59-857d-4a7d-a23e-e75dc38b4f71",
    "title": "Watch A De Tomaso Pantera Go For A Paint-Stripping, Rust-Removing Bath",
    "link": "https://www.jalopnik.com/1804900/de-tomaso-pantera-paint-stripping-rust-removal-video/",
    "description": "YouTuber minute_of_dangle has been chemical-dipping cars for years, and his latest project is this American V8-powered Italian sports car",
    "author": "Amber DaSilva",
    "published": "Thu, 06 Mar 2025 21:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/watch-a-de-tomaso-pantera-go-for-a-paint-stripping-rust-removing-bath/l-intro-1741221020.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Wrenching"
    ]
  },
  {
    "id": "a79dbd79-04aa-44c7-9bb1-369994aa315c",
    "title": "Electric or Bust: Jaguar Spills More Details on I-Type GT EV",
    "link": "https://www.caranddriver.com/news/a64077481/jaguar-electric-future-no-hybrids-gas-engines/",
    "description": "Jaguar boss Rawdon Glover reportedly said the brand's new platform can't support gas or hybrid powertrains, only electric ones.",
    "author": "",
    "published": "Thu, 06 Mar 2025 22:26:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "eafe2592-bcd7-4ee1-9e64-9f577fb2a30e",
    "title": "Maserati MC20 Folgore Is Canceled After Five Years of Gestation",
    "link": "https://www.caranddriver.com/news/a64071152/maserati-mc20-folgore-canceled/",
    "description": "First announced in 2020 when the gas-powered MC20 was unveiled, the Folgore version was supposed to arrive this year, but now it will never see the light of day.",
    "author": "",
    "published": "Thu, 06 Mar 2025 19:25:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "4b3b7893-ea94-4fa8-8dd2-d4bc65eb2636",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "d047cee0-efb5-4f6b-9467-33d103b019a6",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  },
  {
    "id": "6a10efc3-cd57-4fd9-a233-4aeae93263b1",
    "title": "The Magic Light of St. Moritz",
    "link": "",
    "description": "Photos: Rosario Liberti Tuberculosis is a heck of a way to start an article about some ice racing history, and an even wilder way for a town to find its purpose, but here we are. Back in 1866, an Englishman named Arthur Edward Vansittart Strettell, while coughing his bloody lungs out, decided St. Moritz might just save his life. The pure alpine air (or luck) worked its magic, and he stuck around long enough for people to notice. Soon, more of Europe’s well-heeled started showing up,not just to breathe better, but to winter in style.   That might have been part of the beginning, but Johannes Badrutt, a Swiss hotelier, turned it into a destination. In 1864, he made a bold wager with his English summer guests: return in winter, and if you don’t love it, I’ll pay for your entire trip. They took the bet, expecting bitter cold and suffering. Instead, they found sunshine bouncing off snow-capped peaks, a winter unlike anything they had known. St. Moritz was no longer just a retreat, it is possibly the birthplace of luxury winter tourism. By the time it hosted the 1928 and 1948 Winter Olympics, St. Moritz was more than just ski chalets and cocktails. It was home to the Cresta Run, a skeleton track where men in tweed willingly hurled themselves face-first down a mile of ice. Horse racing? On ice. Polo? On ice. It was only a matter of time before we ended up with cars, on ice. If it could be done with risk and elegance, it happened at St. Moritz.  Fast forward to 2019, and The ICE St. Moritz started carrying that same spirit forward. But this time, instead of jockeys or sledders, it’s Ferrari 250 SWBs, Bugatti Type 35s, and Maserati 450Ss sliding across the frozen lake, their reflections blurry and fractal on the ice.  Part concours, part fever dream, spiked tires chew through ice while vintage race cars dance across a surface that was never meant for them. And then there’s the light, snow refracting golden-hour sunlight, exhaust vapor swirling in the cold. It’s a photographer’s paradise, a filmmaker’s storyboard, a dreamscape of speed and style. With a little history behind us, and that light in mind, we’re sharing a gallery of the finest photos from St. Moritz 2025. Enjoy the view.  Continue...",
    "author": "",
    "published": "Tue, 04 Mar 2025 13:00:22 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/03/03183010/IMGL6436-Edit-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "40279303-9b23-400a-9c93-7086aed77072",
    "title": "The Perfect Elixir: Lab Eleven",
    "link": "",
    "description": "﻿ \"If a car sits too long, it starts to die.\" That is the ethos at Lab Eleven. No over-polished baubles. No overbuilt tech experiments masquerading as classics. Just 911s built to be used, built to last, and built to keep showing up for its only job, to be driven. The restomod world has a habit of missing the point. Somewhere between the bespoke interiors and the carbon fiber everything, a lot of builders lost track of why people love these cars in the first place. The formula has gotten predictable. Strip a 911 down to its studs, load it up with more power than anyone will ever use, tweak the suspension until it stops feeling a bit bitey, and then call it an improvement. It isn’t. It is just progress for the sake of it, and progress does not always move things forward. Lab Eleven is not interested in better for the sake of automotive performance theater. They are interested in better for the sake of driving. Pino La Rosa and his daughter Milena run their shop in Milan the way you would expect from people who actually care about these cars. Every Lab Eleven build starts with an accident free 993 and gets stripped down. What happens next depends on the car and the owner, but the process is always the same. Make it sharper, stronger, and more usable without killing what makes it a 911. \"We are not here to make a completely different car, we are here to make the best possible version of the car that already exists.\" That means no unnecessary gimmicks. No touchscreens, no pointless tech, no desperate attempts to make an air cooled car feel like something that rolled off a production line yesterday.  \"You should still feel the road, still hear the engine, still know what the car is doing beneath you.\"  The engines are rebuilt in three stages. A 3.6, a 3.8, or a 4.0 liter pushing anywhere from 300 to 400 horsepower. It is more than stock but not excessive, just enough to make the car feel alive. This may turn things into a bit of a handful for the rear engined uninitiated, but never more than one. Some panels are swapped for aluminum or carbon fiber, but only when it improves balance and durability. There are no qualifying laps that reward weight savings, and Colin Chapman is not breathing down your neck as you roll out of your garage. The goal is not to shave grams off a control arm or hub. It is about balance. Inside, they stick to materials that belong, wool fabrics, houndstooth, and leather that looks and feels right. Somewhere along the way, the restomod scene evolved into a competition to build the most expensive cars and coffee accessory. Machines that flick their blinkers a few times before arriving at an asphalt prison, only to be tucked back into a temperature controlled garage, polished with an overpriced orbital, and plugged into a twelve volt battery tender, the automotive equivalent of life support. Lab Eleven builds cars that need to be driven. Lab Eleven cars belong on alpine passes, winding back roads, and long stretches of open road where dirt and rock chips are part of the experience. A Porsche was never meant to be perfect. It was meant to be driven, to wear in, to collect the marks of use that prove it is alive, and when the time comes, you pass it on, imperfections and all. More info at : www.labeleven.it Visit : speedartmotorsports.com Continue...",
    "author": "",
    "published": "Fri, 28 Feb 2025 12:00:54 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/02/27114741/3-copy.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "85e07199-ea04-441b-9436-a82114df2fbb",
    "title": "RWB Dreams: A 36-Hour Adventure In LA",
    "link": "https://www.speedhunters.com/2025/03/rwb-dreams-a-36-hour-adventure-in-la/",
    "description": "Late last year, I took a whirlwind 36-hour trip from Vancouver, Canada to Los Angeles, USA with my friend Paul, driven by a single mission: to bring our friend Sid’s RWB Porsche 997 on a journey through some of LA’s most iconic roads and spots. It was one of those rare, fast-paced adventures that somehow […] The post RWB Dreams: A 36-Hour Adventure In LA appeared first on Speedhunters.",
    "author": "Alexander Turnbull",
    "published": "Tue, 04 Mar 2025 23:00:52 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Car Culture",
      "Drive",
      "i am the speedhunter",
      "iamthespeedhunter",
      "iats",
      "Los Angeles",
      "Rauh-Welt Begriff",
      "RWB"
    ]
  },
  {
    "id": "1f3a89e8-334a-4a43-ac6a-b6a142fc7153",
    "title": "Throwback: A Ford Escort Built To Divide \u0026 Conquer",
    "link": "https://www.speedhunters.com/2025/03/throwback-a-ford-built-to-divide-conquer/",
    "description": "None of us are born with these preferences; rather, they are developed and nurtured by our friends, family and social groups. If all your friends love Nissans and drifting, chances are that you’re going to follow a similar path. As your love and passion for one marque flourishes, your dissent for the ‘other side’ grows. Of […] The post Throwback: A Ford Escort Built To Divide \u0026 Conquer appeared first on Speedhunters.",
    "author": "TheSpeedhunters",
    "published": "Mon, 03 Mar 2025 21:30:52 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "2025",
      "C20XE",
      "Circuit",
      "Escort",
      "Ford",
      "Ireland",
      "Motorsport",
      "Race Car",
      "RACE!",
      "Throwback",
      "Vauxhall"
    ]
  },
  {
    "id": "c1b41cc2-9595-4f03-81e8-2e2fde75de2c",
    "title": "Alpinestars GP Tech V4 leather suit review",
    "link": "https://www.autocarindia.com/bike-reviews/alpinestars-gp-tech-v4-leather-suit-review-434689#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "The GP Tech V4 suit serves as a replacement for my Missile Ignition suit, which has served me very well for the past five years. The GP Tech V4 costs about half of what you’d pay for the top Racing Absolute suit used by the top racers, but it incorporates many of the learnings and top-tier materials that you will find there. The biggest improvement for me is the overall fit and comfort. The first time I wore this suit, I was in it from 8am to 4pm, with much of that time being spent hanging around the pit area. Normally, that would have been a rather uncomfortable experience, but the GP Tech was surprisingly pleasant. Much of this goes to all the work Alpinestars has put into incorporating stretch panels in strategic spots, but it’s also down to the materials. This suit uses kangaroo leather in certain panels on the chest, arms and legs, and this material has the benefit of being lighter than the usual bovine leather. I was surprised to see that the armour used is CE Level 1, but the reasoning is that it resides behind tough, hard shell protectors on the shoulders, elbows and knees, which amps up the safety but keeps weight and bulk down. The GP Tech V4 uses kangaroo leather in select areas. From a fit standpoint, the GP Tech V4 is superb once you squeeze into it, and the only thing that caught my attention was that it felt a bit tight behind the knees. However, this was only a problem when standing and not on the bike. My sole gripe is that the leather around the chest area bunches up slightly at the seams, which causes no functional issues, but it doesn’t look great. There are some innovative materials in use here, including Kevlar panels bonded under the leather in high-risk areas. This helps reduce the heat buildup when leather drags on the tarmac at high speed, which can burn the skin. Then, there’s the MATRYX® material, which uses a combination of Kevlar and polyamide yarn and promises high levels of abrasion resistance as well as excellent breathability. The suit uses Kevlar panels bonded under the leather in high-risk areas. Breathability is excellent, and there are even little intake ducts built into the hard armour on the shoulder and knees. One thing worth noting is that this suit is airbag-compatible but only with the newer systems. Older Astars airbag vests that need to be zipped into the suit don’t seem to be compatible with this one. Vents are built into the hard armour for better airflow. At around 2,000 dollars, the price for the GP Tech V4 hasn’t changed compared to its predecessor. You can get much more affordable suits for sure, even from Alpinestars, but if you’re a racetrack regular looking for the next step in comfort and protection, you’ll love the GP Tech V4. Where: alpinestars.com Price: Rs 1.8 lakh approx. Also see: Alpinestars GP Tech V2 riding gloves review Viaterra Grid 3 gloves review",
    "author": "Rishaad Mody",
    "published": "Tue, 4 Mar 2025 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250227025724_4.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "c6c67459-5f00-41c6-b97d-9cd6153e4dfa",
    "title": "KTM 390 Adventure vs Royal Enfield Himalayan comparison video",
    "link": "https://www.autocarindia.com/bike-video-reviews/ktm-390-adventure-vs-royal-enfield-himalayan-comparison-video-434713#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: KTM 390 Adventure fuel economy tested, explained",
    "author": "Rishaad Mody",
    "published": "Mon, 3 Mar 2025 10:54:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250303105333_KTM 390 Adventure Royal Enfield Himalayan comparison video .jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "aeb2774e-8684-46c2-9334-ef7ca4e0627f",
    "title": "2025 Audi RS Q8 Performance video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-audi-rs-q8-performance-video-review-434751#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: 2025 Audi RS Q8 Performance review: The best supercar for India",
    "author": "Jay Patil",
    "published": "Thu, 6 Mar 2025 11:22:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250306112229_www.autocarindia.com _70_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "8d0dc708-daff-49f8-bf40-9223b8f4630d",
    "title": "2025 Audi RS Q8 Performance review: a practical supercar for India",
    "link": "https://www.autocarindia.com/car-reviews/2025-audi-rs-q8-performance-review-the-best-supercar-for-india-434750#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "We drove the Audi RS Q8 Performance in Spain a few months back, and after sampling it in the city, on the highway, and a few hot laps around a racetrack, it was clear that it is simply brilliant in almost everything it does. Now, it has finally arrived on home soil and has been launched at a price of Rs 2.49 crore. While the price bump is not much, performance has surely taken a big leap. So, does it do enough to carry the ‘perfect performance car for India’ tag? Audi RS Q8 Performance exterior design 23-inch wheels Subtlety is what you get with almost every car with the four rings; however, this RS Q8 takes things up a notch. The chilly red paint pops and makes heads turn and highlights the lines and curves. Add the optional 23-inch wheels, especially in this shade that gets a tinge of gold, and it is clear that this Audi does not want to lie low in a crowd. LED Matrix headlamps get customisable daytime running lamp signatures. The rear gets big oval tail pipes that stand out, and LED tail-lamps that stretch end-to-end. Also, while its competition peppers their performance models with badges all over, the RS Q8 gets only one red rhombus at the rear. Audi RS Q8 Performance interior design While you can make the exterior dramatic, you can’t do much with the interior. Sure, thanks to the Q8 and its luxuries, quality levels are excellent, but there isn’t enough done for the RS badge. You get red stitching for the seats, seat belts and headrests, and the ambient lighting gets three colour options – green, blue and grey. The steering is round and simple – the chunky flat-bottom one we like is an optional extra – and the seats, although sporty, are soft and comfortable. They do get heating, ventilation and massage options. Although quality levels are excellent, the interior lacks drama. There is no dedicated physical RS button but you do get a fair bit of customisation options once you dig into the touchscreen. Also, since it is based on the Q8, there is no dearth of space in the rear and three adults can be seated in comfort. Big boot, no spare wheel It gets a sizeable boot as well, but you do miss a spare wheel. So those big 23 inchers will have to be looked after. RS Q8 Performance has a boot capacity of 605 litres.   Audi RS Q8 Performance engine and gearbox 640hp and 850Nm Powering the RS Q8 Performance is the same 4.0-litre, twin-turbo V8 as before but it now makes 640hp and 850Nm. The 40hp bump is the result of increased boost pressure, repositioning of the catalytic converter and a lighter sports exhaust. Sounds gibberish? Just know that at no point will you feel its lugging over two tonnes. 4.0-litre, twin-turbo V8 produces 40hp more than before.   0-100kph in 3.6 secs Acceleration is rapid with 0-100kph coming up in just 3.6 seconds, and it goes on to hit a top speed of 250kph (limited). Remove that, and you can stretch it to 305kph. The numbers and sense of speed are both incredible but the most adored feature will be the exhaust note. In an age of spacecraft sounds from electric motors, a good ol’ V8 rumble is music to the ears. Drive modes change character The drive experience can be altered based on the drive mode, with Dynamic giving you the best performance. However, the RS Q8 has always been liked for its duality, and in Comfort mode, you can see why. The engine is subdued, the suspension is softened, the steering loses most of its heft and it almost becomes a regular Q8. There is also an individual mode to customise the setting to your taste and an ‘All-road’ mode for some trail driving. The drive modes help bring out the duality in RS Q8's nature.   Extra 90mm of ground clearance The RS Q8 Performance also gets an ‘Off-Road’ mode that raises the suspension to its maximum and adds an extra 90mm to the ground clearance. It provides interesting data on the screen, too. But, who in their right mind will take an RS Q8 out into the wilderness? Audi RS Q8 Performance ride, handling and braking While you can clear small boulders thanks to its form factor, the most it will ever see is a dug up city road, and for that, the suspension is commendable. In Comfort, the hard edges from low-speed bumps are absorbed well, and while you do move about in the cabin, it isn’t a jarring experience. The movement is less over dusty trails and at moderate speeds and the ride is much better compared to its rivals. The ride quality is commendable, especially in comfort mode. Master of corners Where the RS Q8 Performance truly shines is in the corners. The level of grip from the Quattro sport differential and the massive tyres makes it impossible to feel nervous behind the wheel. It can carry much higher speeds into corners and you can exit totally stable with full power. Then there is active roll stabilisation – it uses a motor between the axles that disconnect the two halves in a straight line to reduce side-to-side movement, but link them up as soon as the corners arrive. This ensures stability as the chassis is controlled via electronics to stay as flat as possible. On a winding mountain road, the RS Q8 feels more like a hot hatch and not a big heavy SUV, and that is its biggest win. Grip is impressive around corners, thanks to Quattro sport differential and massive tyres.   Carbon ceramic brakes are standard fitment The rapid power delivery and high-speed cornering is backed by solid braking power – 420mm carbon ceramics up front and 370mm ones at the rear are standard fitment on the RS Q8 Performance. Sure, they take a tad longer to warm up than conventional steel brakes, but once up to temperature, there is superb brake bite and absolutely no fade after a hot downhill session. Audi RS Q8 Performance price and verdict Rs 2.49 crore before options At Rs 2.49 crore, the RS Q8 Performance is one hell of a performance car. Sure, by the time you tick some options and ensure you have a one-off that number will be over RS 3 crore, but it’s not a bad price for what it offers. With its loud and powerful engine, striking exterior and incredible driving manners, it’s got all the makings of a perfect supercar; however, the Q in its name makes it the perfect supercar for India. Also See: 2025 Audi RS Q8 video review",
    "author": "Jay Patil",
    "published": "Thu, 6 Mar 2025 11:06:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250306110328_2.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "d9423f86-5c3f-4372-a69b-0626aa6fafc9",
    "title": "Classic Legends earmarks 1000 crore investment to deliver growth",
    "link": "https://www.autocarindia.com/industry/classic-legends-earmarks-1000-crore-investment-to-deliver-growth-434763#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Recently appointed CBO Sharad Agarwal believes that Classic Legends' ability to balance tradition with modern demands will be key to driving future growth. Launched in 2018, Classic Legends, backed by Mahindra and Mahindra, has spent the past six years reviving iconic motorcycle brands like Jawa, Yezdi, and BSA. Despite a rich legacy, the company’s sales have been hovering around an average of 3,000 units per month. Amid fierce competition in the premium motorcycle segment, Sharad Agarwal, Chief Business Officer at Classic Legends, said that the company's commitment to preserving the authentic DNA of its brands while pursuing sustainable growth is a key focus area for this year. Classic Legends’ portfolio of Jawa, Yezdi, and BSA brings a unique advantage. \"We’re lucky to have three brands, and each of them has its own legacy and DNA in the category,\" Agarwal said. The company’s vision revolves around reviving the authentic classic character of these motorcycles with the right mix of performance and design, he adds. However, in a market dominated by heavyweights like Royal Enfield, KTM, and Bajaj, capturing significant market share is a daunting task. While Royal Enfield continues to dominate with sales averaging at 80,000 units per month, Classic Legends merely banking on nostalgia may not suffice. “Rather than pursuing aggressive short-term gains, we are focused on a medium to long-term trajectory. We’re expanding our footprint but want to have sustainable growth,” Agarwal explained. The company plans to stabilize its dealership network at around 400 outlets this year, aiming for broader coverage and customer reach. To fuel its ambitions, Classic Legends has earmarked a ₹1,000 crore investment till FY26 to strengthen marketing, distribution \u0026 new product development. “This funding is directed towards new models, processes, and expanding the production capabilities needed for a sustainable future. Our goal is to transform this classic motorcycling category with our challenger approach and grow these three brands,” Agarwal added. Global Expansion: A Path to Growth Classic Legends’ international aspirations are clear. The company is planning to expand BSA into key markets such as the US, Dubai, and Australia, with the BSA Scrambler set to launch internationally in the new financial year. Jawa, too, is poised for a global rollout soon. “When we’re expanding into new markets, it’s clearly showing the growth path that we’re going to take,” said Agarwal, highlighting the importance of exports in driving future sales. This international push is a strategic move to leverage BSA’s brand recall, especially in Western markets where the brand enjoys a cult following. However, cracking these markets will require competitive pricing, a robust dealer network, and a product lineup that can challenge established players. For electric vehicles, as well, Classic Legends is adopting a cautious approach. While many manufacturers like Royal Enfield are diving headfirst into the EV segment, Agarwal believes the premium category is yet to witness a meaningful EV transformation. “We’re ready with the technology, but we don't want to just do it as a ‘me too’ product. At the right time, we’ll enter,” he said. Also see: Ola Electric to get Rs 74 crore incentive from Government under PLI scheme",
    "author": "Prerna Lidhoo",
    "published": "Thu, 6 Mar 2025 16:22:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250306041021_Web.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "cb3aa02d-e388-4d48-be9d-8022c0636ba2",
    "title": "2025 Lexus LX 500d price starts at Rs 3 crore; bookings open",
    "link": "https://www.autocarindia.com/car-news/2025-lexus-lx-500d-price-starts-at-rs-3-crore-bookings-open-434761#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Bookings for the updated Lexus LX 500d have officially been opened, with prices starting at Rs 3 crore (ex-showroom, India). Lexus will offer the new LX 500d in two variants - a standard Urban version and an off-road-centric Overtrail edition - but the flagship SUV will not get any petrol powertrains. This is also the second Lexus Overtrail model to launch in India, with the NX 350h Overtrail having debuted here in 2024. Imposing exterior design with large grille, 22-inch wheels, and more Cabin gets three displays, massaging seats, 4-zone climate control, etc. Engine options solely limited to 304hp, 3.3-litre twin-turbo diesel V6 Lexus LX 500d exterior design Thanks to its ladder-frame construction, the LX 500d has a tall and imposing stance. Up front, the distinctive Lexus spindle grille is flanked by large, angular headlights with L-shaped LED signatures, and the lower half of the fascia contains huge vertically-oriented air intakes. The LX 500d’s side profile features a massive glass area and 22-inch alloy wheels, and at the rear, the large connected tail-lamps and chunky cladding take prominence. LX 500d Overtrail gets several cosmetic changes The LX 500d Overtrail ditches the Urban variant’s chrome trim in favour of blacked-out elements throughout the body, such as on the grille, fog lights, roof rails, wing mirrors, door handles, etc.  It also gets smaller 18-inch matte grey aluminium wheels shod in higher-profile tyres, as well as an exclusive ‘Moon Desert’ colour option. Lexus LX 500d interior and features LX 500d buyers can opt to have the cabin upholstered in either tan or crimson leather on the dashboard, doors, and seats. There’s a 12.3-inch infotainment touchscreen atop the satin silver-wreathed centre console, underneath which there’s a 7-inch drive mode display, HVAC vents and controls, and more. The three-spoke steering wheel gets paddleshifters, and straight ahead, there’s an 8-inch MID display in the instrument cluster and a heads-up display. Feature-wise, the LX 500d is packed with goodies like front-seat massage functions, heated and ventilated front and rear seats, 4-zone climate control, wireless Apple CarPlay and wired Android Auto, two 11-6-inch entertainment displays for rear passengers, a single-pane sunroof, 25-speaker 3D Mark Levinson sound system, and more. The SUV also comes with Lexus Connect Technology, which offers app-based features like remote start/stop and unlock, roadside assistance, find my car, vehicle health monitoring, etc. Safety is taken care of with an ADAS suite comprising blind spot monitoring, pre-collision system, lane departure and trace assist, safe exit assist, adaptive cruise control, and adaptive high beams, as well as 10 airbags, traction control, hill assist control, trailer sway control, and more. LX 500d Overtrail interior changes Much like the exterior, the LX 500d’s Overtrail variant sports some differences inside as well. The cabin gets a dark green ‘Overtrail Monolith’ colour scheme on the seats, dashboard, and doors, as well as black trim instead of satin silver in some areas. Lexus LX 500d engine and gearbox The LX 500d’s sole engine option is a 3.3-litre twin-turbo diesel V6 pumping out 304hp and 700Nm of torque, mated to a 10-speed automatic transmission. In the dynamics department, the SUV gets all-wheel drive, active height control, a standard centre differential lock, and adaptive suspension. The Overtrail variant additionally comes with front and rear differential locks. Five drive modes can be selected on the LX 500d for varying conditions, namely Normal, Eco, Comfort, Sport S, and Sport S+. There’s also a Custom mode which allows owners to tweak the settings according to their preferences. Lexus LX 500d price and rivals The standard LX 500d Urban starts at Rs 3 crore, with the Overtrail variant commanding a premium of Rs 12 lakh over that. In India, the LX 500d goes up against the BMW XM, Mercedes-Maybach GLS, and Range Rover. Lexus LX 500d price vs rivals (ex-showroom)LX 500dXMMaybach GLSRange RoverPrice (Rs, crore)3.00-3.122.603.39-3.712.40-4.98 Also see: New Toyota Celica, MR2, Lexus supercar under development Lexus Surf LX concept revealed with beach-inspired upgrades",
    "author": "Viraaj Bhatnagar",
    "published": "Thu, 6 Mar 2025 15:51:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250306034118_lexus lx urban_1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "19975f0b-1a9e-4919-b1c9-84d61112c8b3",
    "title": "QOTD: Should Fleet Managers Have Direct Vehicle Control?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-should-fleet-managers-have-direct-vehicle-control-44512501?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "As someone who once earned money delivering auto parts, I felt myself getting chills, and not in the good way, editing Matt's post on Ford's plans to give fleet owners more remote control over their vehicles. I'd have hated this during my time schlepping brake rotors across Aurora, Illinois in well-maintained older Ford Rangers and beat-up old Chevrolet S-10s.",
    "author": "Tim Healey",
    "published": "Thu, 06 Mar 2025 22:33:31 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/03/06/14421/driving-dystopia-ford-pro-introducing-remote-vehicle-controls-for-commercial-models.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "c06a01ed-a32d-44aa-bc7f-aab0b2e69621",
    "title": "Back In The U.S.S.R? Automakers Eye Return to Russia",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/back-in-u-s-s-r-automakers-eye-return-to-russia-44512495?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Ward's Auto is reporting that Hyundai and Renault are eyeing a return to the Russian market, assuming that Russia and Ukraine reach a peace deal following the former's invasion of the latter.",
    "author": "Tim Healey",
    "published": "Thu, 06 Mar 2025 21:05:07 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/19/16289/s-see-photos-of-the-2025-hyundai-ioniq-5.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  }
]
