[
  {
    "id": "002b3fe7-96d0-4d29-9ce7-33618677e413",
    "title": "47k-Mile 1993 Ford F-250 XL SuperCab 5.8L 5-Speed at No Reserve",
    "link": "https://bringatrailer.com/listing/1993-ford-f-250-25/",
    "description": "This 1993 Ford F-250 XL SuperCab pickup remained registered in Washington through the selling dealer's 2024 acquisition and now has 47k miles. It is finished in Vermilion over Dark Charcoal vinyl and powered by a 5.8-liter V8 linked to a five-speed manual transmission. Equipment includes a Brahma bed cap, 16\" steel wheels, front disc brakes, an AM/FM radio, a Reliance trailer brake controller, and dual fuel tanks. This F-250 is offered by the selling dealer at no reserve with manufacturer's literature, a clean Carfax report, and a clean New Jersey title.",
    "author": "bringatrailer",
    "published": "Fri, 31 Jan 2025 00:40:15 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/01/1993-Ford-F-250-red-manual-010-08449-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "ff3b9771-61b0-4266-9474-e3dee3da2fec",
    "title": "40k-Mile 2007 BMW M6 Convertible 6-Speed",
    "link": "https://bringatrailer.com/listing/2007-bmw-m6-convertible-40/",
    "description": "This 2007 BMW M6 convertible is finished in Monaco Blue Metallic over Portland Brown Merino leather and is powered by a 5.0-liter V10 paired with a six-speed manual transmission. The car has remained registered on the East Coast since new and now has 40k miles. Equipment includes a black soft top, a Magnaflow cat-back exhaust, a head-up display, carbon-fiber interior trim, Enhanced Premium Sound, soft-close doors, 19\" Style 167M wheels, adaptive xenon headlights, heated power-adjustable front seats, Comfort Access, and iDrive with navigation. Recently acquired by the selling dealer, this E64 M6 is now offered with a window sticker, a car cover, a December 2024 Blackstone Laboratories oil report, a clean Carfax report, and a clean New Jersey title.",
    "author": "bringatrailer",
    "published": "Fri, 31 Jan 2025 00:36:20 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/01/2007_bmw_m6-convertible_dsc04361-60440.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "cdcc506e-5e5e-4736-a68d-6cd63a686f78",
    "title": "The most and least expensive states to own a car in 2025",
    "link": "https://www.autoblog.com/news/the-most-and-least-expensive-states-to-own-a-car-in-2025",
    "description": "Owning a car can cost a lot more in some states than others. Here’s where it hits your wallet hardest.",
    "author": "Elijah Nicholson-Messmer",
    "published": "Thu, 30 Jan 2025 14:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNDY2OTE2NTU4NjQ0NzQ1/us-politics-transport.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "car ownership",
      "News"
    ]
  },
  {
    "id": "4da4bb89-d961-477e-8f26-888dfb0ea5e1",
    "title": "Toyota 4Runner Trailhunter is one heck of an off-road rig",
    "link": "https://www.autoblog.com/news/toyota-4runner-trailhunter-is-one-heck-of-an-off-road-rig",
    "description": "Both rugged and attractive, Toyota turned the relatively pedestrian 4Runner into something capable of running with the Jeeps.",
    "author": "Gabriel Ionica",
    "published": "Thu, 30 Jan 2025 02:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5NDgxNDQyOTE1NjU3MzY2/2025-toyota-4runner-trailhunter-exterior.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Toyota 4Runner Trailhunter",
      "Toyota",
      "toyota 4runner",
      "Toyota",
      "4Runner",
      "2025",
      "News"
    ]
  },
  {
    "id": "c30237ff-2746-45bc-af42-d8daf02d6707",
    "title": "How the BMW E36 Redefined the 3 Series:",
    "link": "https://www.bmwblog.com/2025/01/30/bmw-e36-design-history-evolution/",
    "description": "The E36 isn’t as storied as many of the other 3 Series generations. It wasn’t the first, it didn’t revolutionize performance the way the E30 M3 did, and the later E46 quickly surpassed it in... First published by https://www.bmwblog.com",
    "author": "Steven Paul",
    "published": "Thu, 30 Jan 2025 22:10:40 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2021/01/BMW-3-Series-Coupe-E36-768_53-830x623.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "3 Series",
      "BMW Design",
      "E36",
      "E36 3 Series"
    ]
  },
  {
    "id": "65b8d18e-fce4-49c2-8a6f-4f331c2e3ca6",
    "title": "The First-Ever BMW M3 CS Touring Debuts at Mount Panorama",
    "link": "https://www.bmwblog.com/2025/01/30/bmw-m3-cs-touring-global-debut-bathurst-2025/",
    "description": "It wasn’t Daytona—because why would BMW tease us like that? Instead, Australia had the honor of hosting the world premiere of the first-ever BMW M3 CS Touring. The debut took place at none other than... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Thu, 30 Jan 2025 20:25:31 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/01/bmw-m3-cs-touring-laguna-seca-blue-04-830x554.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M3",
      "bmw m3 cs touring",
      "G81 M3 Touring",
      "M3 CS Touring"
    ]
  },
  {
    "id": "3a012656-c2d2-4aef-95b7-eb8294e105b0",
    "title": "The 1972 Kawasaki H2 Mach IV: The Superbike to End All Superbikes",
    "link": "https://www.bikeexif.com/1972-kawasaki-h2-750-mach-iv",
    "description": "The motorcycle world was in the midst of an arms race in the early 1970s. Performance was king, and manufacturers were locked in a battle to build the fastest, most exhilarating machines for petrol-crazed riders. Honda had just dropped the CB750, a smooth, sophisticated four-cylinder revolution that brought superbike power to the masses. Yamaha was refining its two-stroke RD series and Suzuki had its triple-cylinder weapon in the form of the GT750—AKA the ‘Water Buffalo.’ Kawasaki wasn’t as interested in refinement. Beat to the punch on the four-cylinder, Kawasaki bet everything on two-stroke performance and set out to build the fastest bike the world had ever seen—something that would leave the competition coughing in a haze of blue smoke. The pinnacle of this effort was the 1972 Kawasaki H2 Mach IV, a 750 cc, three-cylinder two-stroke that redefined what speed meant on two wheels and permanently altered the course of the superbike segment.…",
    "author": "Dean Larson",
    "published": "Thu, 30 Jan 2025 19:38:54 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/01/kawasaki-h2-750-mach-iv-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Classic Motorcycles",
      "auction",
      "classic",
      "Kawasaki motorcycles"
    ]
  },
  {
    "id": "2a8dab7d-e5a6-4a41-8871-ed37743d29a7",
    "title": "Monochrome Maschine: A 1979 Moto Guzzi Le Mans II by Kaffeemaschine",
    "link": "https://www.bikeexif.com/moto-guzzi-le-mans-ii-kaffeemaschine",
    "description": "Axel Budde’s work is impossible to miss. His shop, Kaffeemaschine, focuses solely on classic Moto Guzzi models, turning them into elegant machines that are impossibly cool, highly refined, and built to be ridden. Based in Hamburg, Germany, Kaffeemaschine recently buttoned up this monochromatic charmer for a client who wanted one of the workshop’s signature GT tourer builds, but with a few twists. “He wanted a Kaffeemaschine GT, but a little more in the direction of a scrambler,” Axel explains. “And he wanted most of it black.” Further to those requirements, Axel’s client asked that the donor bike be the same age as him—so Kaffeemaschine sourced a 1979 Moto Guzzi Le Mans II. With the Le Mans on the bench and an established template to work from, the crew turned their attention to their customer’s most challenging requested… “The biggest issue was the fuel tank, as he wanted a different design,” says Axel.…",
    "author": "Wesley Reyneke",
    "published": "Wed, 29 Jan 2025 22:05:37 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/01/fb-16.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Kaffeemaschine",
      "Moto Guzzi Le Mans",
      "Moto Guzzi motorcycles",
      "Scramblers"
    ]
  },
  {
    "id": "0d7f8332-711d-4d3d-9a71-91931916647b",
    "title": "Kia Tasman Seen In California, But Don’t Look For It On The Lot",
    "link": "https://www.carscoops.com/2025/01/kia-tasman-seen-in-california-but-you-wont-find-it-on-the-lot/",
    "description": "The 25% Chicken Tax will prevent Kia from importing and selling the Tasman locally",
    "author": "Brad Anderson",
    "published": "Fri, 31 Jan 2025 00:33:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/01/kaitsajsms-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Kia",
      "Kia Tasman",
      "Trucks",
      "USA"
    ]
  },
  {
    "id": "f075df69-778c-4cbf-b9de-b21aedbae387",
    "title": "Morgan’s New Flagship Has Three Wipers And A BMW Engine",
    "link": "https://www.carscoops.com/2025/01/morgans-new-flagship-has-three-wipers-and-a-bmw-engine/",
    "description": "The Plus Six successor promises to be thoroughly modern, despite the old school vibe",
    "author": "Michael Gauthier",
    "published": "Thu, 30 Jan 2025 23:49:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/01/g5g64t3e-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Morgan",
      "New Cars",
      "teaser"
    ]
  },
  {
    "id": "d8ac0f23-f3e4-4458-9f19-b2c6a38419e7",
    "title": "Hyundai Unveils Adorable Electric Rickshaw Concepts That Lift Up To Navigate Flooded Roads",
    "link": "https://jalopnik.com/hyundai-unveils-adorable-electric-rickshaw-concepts-tha-1851751910",
    "description": "India’surban centers are some of the most dense and populous in the world, and its roadways are notoriously difficult to navigate. One of the most iconic and longstanding features of India’s vibrant cities are the swaths of colorful three-wheeled rickshaws called tuk-tuks that are used as taxis. India’s tuk-tuks are…Read more...",
    "author": "Logan Carter",
    "published": "Thu, 30 Jan 2025 22:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/ea389508d82fa7639338342b0df78ffa.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "hyundai",
      "electric rickshaw",
      "public transportation in the philippines",
      "rickshaws",
      "tvs motor company",
      "tuks",
      "tvs motor",
      "hyundai group",
      "vehicles for hire",
      "hyundai motor company",
      "auto rickshaw",
      "tvs"
    ]
  },
  {
    "id": "70758a64-5366-4d0c-afe0-05373d655d21",
    "title": "Trump Gutted FAA Days Before Fatal Air Collision",
    "link": "https://jalopnik.com/trump-gutted-faa-days-before-fatal-air-collision-1851752028",
    "description": "An American Airlines regional jet collided with a U.S. Army Black Hawk helicopter at about 9:00 p.m. Wednesday night, reportedly killing all 64 people in the plane and the three soldiers in the helicopter. Authorities are still in the process of searching for the bodies of the deceased, but it’s already being called…Read more...",
    "author": "Collin Woodard",
    "published": "Thu, 30 Jan 2025 21:15:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/62b382edaef838fb62ecaed66cb869d9.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "trump",
      "disaster accident",
      "spacex",
      "black hawk",
      "federal aviation administration",
      "spacex",
      "michael whitaker",
      "american airlines",
      "aviation safety",
      "hyperloop",
      "airport",
      "tesla",
      "mike whitaker",
      "biden",
      "air traffic control",
      "elon musk"
    ]
  },
  {
    "id": "8d131d97-622a-49fe-8641-0fe12a62814f",
    "title": "Musk hits new levels of hype as Tesla earnings fall short",
    "link": "https://www.autocar.co.uk/car-news/business-corporate/musk-hits-new-levels-hype-tesla-earnings-fall-short",
    "description": "Musk said a robotaxi will be added to a ride-hailing fleet in Austin, Texas, this summer CEO goes big on claims about robot and Cybercab after earnings deliver \"significant miss\" on expectation Tesla CEO Elon Musk ratcheted the hyperbole to new levels on the company’s latest earnings call, talking up the earnings potential of new projects like the Optimus robot and Cybercab autonomous car, even as earnings on the core automotive business delivered a “significant” miss on analysts' expectations. Tesla’s quarterly discussions with business analysts have rarely followed the patten of other listed automotive companies', with Musk preferring to make often-unfounded predictions about future launches and milestones rather than give colour to the current balance-sheet numbers. The policy has served him well, with investors taking his word for it and pushing Tesla to a $1.28 trillion (£1.0tn) valuation. But the call on 29 January pushed Musk’s fanciful depictions of vast future profit pools generated by Tesla-engineered creations to new heights. He predicted the humanoid Optimus “will be overwhelmingly the value of the company” and stated revenue from sales could “north of $10 trillion”. To put that into context, Tesla's revenue from selling electric cars in 2024 was $77 billion (£62bn), down 6% on the year before. Musk also announced the launch of \"unsupervised FSD\". Tesla’s current Full Self Driving system has always required the driver to pay attention, but Musk promised this system would be able take control in California and “many regions of the US” by the end of this year.  A robotaxi running the system would put onto a ride-hailing fleet in the Texas city of Austin in June, he said. The claims then escalated from there: “I expect us to be operating unsupervised activity with our internal fleet in several cities by the end of the year. Then it's probably next year when people are able to add or subtract their car from the fleet.\" This is a huge step, given that it shifts the burden of responsibility for any crashes from the driver onto Tesla, which still relies on cameras and its own AI-informed software stack to locate and direct the car.  The company refuses to introduce redundancy in the form of other sensors such as lidar (essentially 3D cameras) or even radar – technology that everyone else working in the space says is essential for full autonomy, even for brief periods on the highway. Musk may feel he has protection from official National Highway Traffic Safety Administration (NHTSA) guidelines on self-driving vehicles, thanks to his relationship with new US president Donald Trump (not mentioned on the call), but he won’t from the insurance industry. Oddly, perhaps, Musk didn’t push autonomous vehicles as Tesla’s big earnings-generator, as he has done in the past. In 2023, for example, he declared “the value of the company is primarily on the basis of autonomy” – something he now says about Optimus.  Musk then moved onto the Semi electric lorry, production of which is “ramping up” in 2026. That too will be become autonomous. “That’s probably a $10 billion-a-year thing. That's $1 billion a month at some point probably,” Musk predicted, before somewhat strangely dismissing that as chump change. “These days, does several billion a year matter?”  The unremarkable financial performance of Tesla in reality was largely glossed over. The company’s operating margin in Q4 of 2024 dropped to 6.2% from 10.8% in Q3 as income fell 23% to $1.58bn compared with the same quarter the year before.  CFO Vaibhav Taneja blamed a lower average selling price of Tesla’s cars on discounting. The end-of-year push to sell was seen strongly in the UK, where the Model Y was available to lease for as low as £349 a month (including VAT) in a December deal that extended into January ahead of the arrival of the facelifted car. Overall, Tesla delivered 1,789,226 cars in 2024, down 1% on the year before and arresting a remarkable growth run from just under 500,000 in 2020. The bulk remain the Model Y and Model 3, with the Model S, Model X and Cybertruck clocking just 85,133 sales in the year.  The Cybertruck didn’t warrant a single mention in the earnings call, and Tesla’s refusal to separate out its numbers looks to be out of sheer embarrassment more than anything else. The refreshed Model Y arriving in showrooms soon is likely to improve Tesla's sales, given its best-selling status in the brand’s line-up. However, Tesla’s 2025 growth guidance was muted partly as the result of the company’s need to retool plants in the US, China and Germany to shift to building the new model. Tesla claims the Model Y is still the world’s best-selling car, even if it was pushed down from first to fourth in Europe in 2024 according to figures published by Automotive News Europe. Tesla’s main engine for future vehicle sales growth was to be the 'Model 2', which has now been abandoned for what’s being called \"a more affordable model\", expected to be variant of the Model 3 or Model Y. This is on track for launch “in the first half of 2025”, Taneja said on the call without giving detail. It’s perhaps telling that Musk didn’t mention it at all. Musk also has to overcome growing dislike among potential Tesla buyers of his hobby of boosting right-wing politicians. Tesla claimed the cost of goods sold for each car was now down below $35,000, “driven largely by raw material cost improvement”. That will boost the financials of the new cheaper model – but given that battery costs are coming down across the board, it also helps rivals. Tesla’s other moats are gradually being filled in, too. The generous regulatory credit money it takes from car makers behind on the shift to EVs is likely to come to an end in the US at least as Trump looks to water down emissions-reduction schemes.  In Q4 of 2024, Tesla received $447m from sales of credits. Some of that might have come from JLR, which said it paid £30m to buy credits to cover its shortfall in the US.  However, JLR’s CFO said on the company’s most recent earnings call that he expected that bill to largely disappear next year, thanks to moves by Trump.  Tesla sales meanwhile could be impacted by Trump’s dislike of EVs in general. Without mentioning Trump by name, Musk downplayed this on the call in an answer to a question from an analyst: “You can't stop the advent of electric cars; it's going to happen.”  Musk’s trick over the years has been to qualify his wildest claims in such a way that deflects attention from the SEC financial authorities but also inspires his followers into believing them to be real. On Wednesday, he seemed to understand he was reaching the limits of believability, even as he doubled down. “Obviously I'm making these revenue predictions that sound absolutely insane. I realise that,” he said. “But I think they will prove to be accurate. Yeah.”",
    "author": "",
    "published": "Thu, 30 Jan 2025 14:43:41 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/tesla-cybercab.jpg?itok=Hw0BVSSl",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "7bed46f1-1a15-412d-8231-99fd7683fe49",
    "title": "Polestar gets rally-ready with beefed-up versions of 2, 3 and 4 EVs",
    "link": "https://www.autocar.co.uk/car-news/new-cars/polestar-gets-rally-ready-beefed-versions-2-3-and-4-evs",
    "description": "Off-roading makeover for Polestar's electric cars brings a suspension lift, studded tyres and ski racks Polestar has given its line-up of electric cars the full-bore rally treatment in a drive to emphasise “the Swedish brand’s performance DNA”. Making their public debut, appropriately, at the annual FAT Ice Race in Austria, the 'Arctic Circle' versions of the Polestar 2, 3 and 4 each feature extensive modifications aimed at improving their performance on icy terrain. All three cars get a suspension lift – 30mm for the 2, 40mm for the 3 and 20mm for the 4 – along with three-way adjustable Öhlins dampers, Pirelli studded tyres wrapped around rally-style OZ Racing wheels, beefy front spotlights and Recaro bucket seats. To complete the look, the snow-prepped EVs all wear chunky mud flaps, gold tow hooks and a bespoke rally livery. On top of that, the Polestar 2 Arctic Circle – based on the 469bhp dual-motor variant – gets a strut brace at each end, a Thule roof rack and ski mounts (complete with a set of all-terrain skis from Chamonix-based firm Black Crows). The 510bhp Polestar 3 Arctic Circle, meanwhile, gets a custom roof basket, a set of snow ladders and a heavy duty equipment case, while the 536bhp Polestar 4 gets a combination of those add-ons and – intriguingly – a drift-style hydraulic hand brake. There’s no word yet on whether Polestar plans to offer the Arctic Circle package on its production cars, but the hot Polestar 2 BST Edition 270 began life as an experimental one-off prototype before being taken to showrooms a year later – so it’s possible these concepts are intended as a sign of things to come. New company CEO Michael Lohscheller, who said just last week that he wants to “highlight the performance of our cars a little more”, pointed to the concepts as a statement of intent for future model development. He said: “The Arctic Circle collection illustrates our unique performance DNA, rooted in motorsport and combined with Scandinavian design. We develop our cars under challenging conditions within the Arctic Circle in Sweden, and at the FAT Ice Race we will showcase that on ice there is nothing better than a Polestar. “We are really excited to be part of this special event with our full model line-up, where it’s all about car culture and the performance experience.”",
    "author": "",
    "published": "Thu, 30 Jan 2025 12:57:55 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/polestar-arctic-circle-cars-front-qtr-tracking.jpg?itok=b5iZUXVQ",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "fca64e87-b35d-452b-af46-e8cbdf20298d",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "3cc5de2c-87eb-4753-a610-97e39a603d6c",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "9bfa907e-8935-4fb1-9995-d24ffd273a0b",
    "title": "2023 Porsche Cayenne",
    "link": "https://www.caranddriver.com/porsche/cayenne-2023",
    "description": "Review, Pricing, and Specs",
    "author": "",
    "published": "Thu, 30 Jan 2025 20:53:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "1fcc02b3-ea37-4333-8b52-337af9f5ccda",
    "title": "Honda Pilot, Acura MDX and TLX Recalled Due to Engines That May Stall",
    "link": "https://www.caranddriver.com/news/a63620082/honda-pilot-acura-mdx-tlx-stalling-engines-recall/",
    "description": "Honda is recalling roughly 295,000 vehicles to fix a potential fuel-injection issue on certain 2021 to 2025 models.",
    "author": "",
    "published": "Thu, 30 Jan 2025 20:10:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "e095696d-3927-44b4-b3bb-f4debf57af4b",
    "title": "Project 964: Hitting The Touge For The First Time In RWB Form",
    "link": "https://www.speedhunters.com/2025/01/project-964-hitting-the-touge-for-the-first-time-in-rwb-form/",
    "description": "While the car sat for a few weeks over the holidays so the sealant laid down around the fenders and other areas could properly cure, I’ve been doing my best to drive it as much as possible ever since. But for this post, I want to focus specifically on the car’s first touge outing in […] The post Project 964: Hitting The Touge For The First Time In RWB Form appeared first on Speedhunters.",
    "author": "Dino Dalle Carbonare",
    "published": "Wed, 29 Jan 2025 07:30:47 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "964",
      "Build",
      "Drive",
      "JDM",
      "Nakai",
      "Porsche",
      "Project 964",
      "project car",
      "Project Cars",
      "RAUH-Welt",
      "Rauh-Welt Begriff",
      "RWB",
      "SH Garage",
      "Speedhunters Garage",
      "Speedhunters Project Cars",
      "touge"
    ]
  },
  {
    "id": "edc50a5b-c913-4bd7-9a01-8f7778432ed3",
    "title": "Chasing The Dream: Tsukuba Time Attack In An HKS-Built GR86",
    "link": "https://www.speedhunters.com/2025/01/tsukuba-time-attack-in-an-hks-built-gr86/",
    "description": "For Jacky Tse of JTune, a New Zealand-based tuner and die-hard time attack fan, however, that dream wasn’t something to just watch from behind a screen. It was something to be realised. Jacky considers himself a “normal driver.” While he’s a casual track instructor, Jacky is not a professional racer. His goal was simple but ambitious: to […] The post Chasing The Dream: Tsukuba Time Attack In An HKS-Built GR86 appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Mon, 27 Jan 2025 09:00:31 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "86",
      "Build",
      "GR86",
      "HKS",
      "japan",
      "JTune",
      "The HKS",
      "time-attack",
      "Toyota",
      "Tsukuba",
      "Tsukuba Circuit"
    ]
  },
  {
    "id": "5aed39b5-d8be-44c4-937b-d33c6f7005a4",
    "title": "The Long Road Home: A Shelby GT350’s Revival",
    "link": "",
    "description": "https://www.youtube.com/watch?v=fJDrjdXmFeI Dave will be the first one to tell you his ’67 Shelby GT350 isn’t period correct. But when it comes to ticking the boxes of what truly matters, concours rules don’t even make the list. This car is more than a restoration; it’s the embodiment of perseverance, sacrifice, and a vision he held onto for decades. As a teenager, Dave watched the GT350 roll past his gas station, driven by a Vietnam veteran who had bought it brand new. To Dave, it wasn’t just a car; it was a rolling symbol of freedom and individuality. He knew, deep down, it would be his someday. That day came in 1973 when, after a few changes of ownership, he finally made the dream a reality. As it inevitably tends to do, life came by and happened. Marriage, family, and the responsibilities of adulthood meant the GT350 got pushed off to the back of his mind. Still, Dave never let go of the vision he had when he disassembled the car in 1976. Thirty years later, with his family’s support, he finally turned his attention back to the car, not to build a concours queen but to create something deeply personal.  “This car is not necessarily period correct.” Dave says, “It's not a concours car, but it's a hell of a machine because I built it the way I want it.” It took two years of bodywork, engine rebuilds, and assembly. He meticulously archived every bolt and part, documenting every detail as he blended authentic elements with personal touches to craft a machine that fulfills the longing he felt all those years ago watching it cruise by the station. Plenty of people want a factory-spec restoration, a polished time capsule built to live on manicured grass instead of asphalt. Instead Dave built something that embodies everything he values most: hard work, sacrifice, family, and the passion to see something through, no matter how long it takes. It’s not correct by concours standards, but it’s real by every measure that counts. For Dave, that’s all it ever needed to be. Continue...",
    "author": "",
    "published": "Fri, 24 Jan 2025 10:12:19 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/01/23122047/P1023919-copy-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "22a96de7-bf32-4def-96fe-ce39f12a3bfa",
    "title": "Round 2: A Box-Flared Reunion",
    "link": "",
    "description": "The attraction to automobiles does not always pertain entirely to a physical quality. Sure, a car’s design, or its smell, or its sound can be part of that attraction, but a bigger part lies within something more abstract. If there was ever anyone who could relate to such an emotion, it would be Rob Simon. His steed of choice has been, and always will be, the legendary BMW E30 M3. In the automotive space, the legendary Bavarian warrior needs no introduction or backstory. It has long been heralded as one of the most exceptional machines ever sculpted by mankind, offering a pure driving experience unmarred by unnecessary aids or features. Despite a near-death experience in his red E30 M3, Rob always lusted for another one. It wasn’t just the behind-the-wheel time he longed for but the deeper, unspoken connection it wove between him, his father, and his brother, all of which had E30 M30s of their own. That chance would thankfully arise once more, but not in the way he would expect. Tune in to the Petrolicious YouTube channel and relive Rob Simon’s BMW E30 M3 tale alongside us. Maybe bring some tissues along for the ride, too. Continue...",
    "author": "",
    "published": "Sun, 19 Jan 2025 17:00:20 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/01/09190240/Petrolicious-e30-web-1023693.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "34847535-3587-4642-a290-0888621070d8",
    "title": "Polaris Launches Revised Slingshot for 2025",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/polaris-launches-revised-slingshot-for-2025-44511616?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "It is tough to think of any vehicle, no matter its number of wheels, which offers a greater number of grins-per-mile than the Polaris Slingshot. Sure, it is wildly impractical and bonkers to look at, but that’s the locus of its appeal – and your author is totally on board. In other words, you’ll find no Slingshot slander in this post.",
    "author": "Matthew Guy",
    "published": "Thu, 30 Jan 2025 20:37:59 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/01/30/14375/polaris-launches-revised-slingshot-for-2025.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "e875d8df-a324-414e-bed2-75183bce245f",
    "title": "Used Car of the Day: 1990 Volkswagen Corrado",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-1990-volkswagen-corrado-44511607?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today I present to you this 1990 Volkswagen Corrado.",
    "author": "Tim Healey",
    "published": "Thu, 30 Jan 2025 20:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/01/30/14324/used-car-of-the-day-1990-volkswagen-corrado.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  },
  {
    "id": "5a27b75c-ad73-4c7e-bccc-75872c4d23a1",
    "title": "2025 Aston Martin Vantage India video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-aston-martin-vantage-india-video-review-434400#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: BMW i5 review: Silent M5",
    "author": "Sergius Barretto",
    "published": "Wed, 29 Jan 2025 18:18:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250129061653_www.autocarindia.com _68_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "fea6c8f5-bb96-4235-afa9-cc8cdc371a60",
    "title": "Kia Syros video review",
    "link": "https://www.autocarindia.com/car-video-reviews/kia-syros-video-review-434384#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see: Kia Syros review: Ace of Space",
    "author": "Jay Patil",
    "published": "Tue, 28 Jan 2025 15:08:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250128030852_Kia_Syros_video_review.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "f085355b-51d4-4b55-9d83-ce04b4578803",
    "title": "TVS Jupiter 110 road test video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/tvs-jupiter-110-road-test-video-review-434360#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: TVS Jupiter 110 road test, review",
    "author": "Dinshaw Magol",
    "published": "Mon, 27 Jan 2025 12:44:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250127124435_YT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "7f16a297-bb22-4485-bef8-5895e73586c2",
    "title": "Kriega Sling Pro Messenger bag review",
    "link": "https://www.autocarindia.com/bike-reviews/kriega-sling-pro-messenger-bag-review-434337#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Before I start telling you about this unique-looking bag, I have a confession to make: I have organisational OCD and am a creature of habit. I can’t stand disarray of any sort when it comes to packing my belongings, and the way I pack follows the saying – ‘a place for everything, and everything in its place.’ That’s why the Kriega Sling Pro Messenger Bag fits neatly into my life and has become my go-to bag for nearly everything over the past four months, from daily commutes to weekend trips and even shopping. Main pocket is quite deep. This bag is divided into three main compartments comprising an absolutely waterproof main compartment that holds seven litres, accompanied by two ancillary zippered ones that can hold a total of another seven. While seven litres may sound small, I have been able to fit two boxes containing my office lunch, a couple of t-shirts, and a 1-litre water bottle, with quite some room to spare. Kriega claims you can fit a 14-inch laptop into this compartment, but I’ve fit my colleague’s 15-inch one without hassle. Waist belt helps reduce load on your shoulder. Then, there are the two secondary zippered pockets, one larger than the other. Both appear quite slim at first glance, but as you’ll discover, this small bag is capable of holding much more than you think. The larger zippered pocket can hold a thick 500-page novel, a 750ml water bottle, a chunky power bank and my phone charger. In the smaller one, I usually have my old-fashioned leather wallet, sunscreen, a spare pair of spectacles, my Bluetooth earphones and house keys. As is evident, if you’re meticulous about how you pack your things, the Messenger Pro can swallow a lot. Total 14 litres of storage available. Since this is a sling bag, you get one main strap, which you sling across your torso, and anyone who has worn one will tell you that it can get a little uncomfortable on its own after some time. Thankfully, Kriega has also supplied a sturdy waist belt that alleviates most of the pressure from your shoulder. I’ve worn this bag all day for multiple days in a row, and I’m happy to report that you don’t feel any discomfort for the first 5-6 hours. After that, you will start to feel some soreness, but you can always reverse the strap’s mounting to the other side and sling it on the opposite shoulder. At Rs 15,799, the Kriega Sling Pro Messenger Bag is unquestionably a luxurious indulgence. That holds true even in the Kriega context because there are other similarly priced or more affordable backpacks from the same company that are more versatile, spacious and can even be equipped with a hydration bladder. So, to answer the all-important question: to buy or not to buy? The thing is, you’ve got to particularly want this form factor. I can confirm that it works well in an urban context while also being a bit of a unique style statement from a motorcycling perspective. But, if that’s not a particular priority, and if this is your first step into the world of Kriega, you will find some more versatile personal luggage-carrying options. Where: lazyassbikers.com Price: Rs 15,799 Also see: RS Taichi WP Backpack review",
    "author": "Dinshaw Magol",
    "published": "Mon, 27 Jan 2025 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250124123409_2.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "1b91af14-cd80-440e-89f1-ceb4ad094614",
    "title": "Renault Filante concept guns for EV range record",
    "link": "https://www.autocarindia.com/car-news/renault-filante-concept-guns-for-ev-range-record-434410#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Renault has developed a new concept dubbed the Filante Record 2025 as a test bed to push the limits of EV energy efficiency.  The Filante Record 2025 has the goal of setting new records for distance travelled on a single charge. The French carmaker plans to implement the ground-breaking technology and materials used in the Filante Record 2025 into its future production cars. Renault Filante Record 2025: design The Filante Record 2025's design is the result of a collaboration between Renault and French racing specialist Ligier. At a 5120mm length and 1190mm height, the concept measures just as long as a Range Rover and lower than a McLaren 750S. These dimensions help the Filante Record 2025 retain better control of the air flowing over its body. The 19-inch wheels, which Renault says are usually a major source of \"aerodynamic interference,\" are designed to minimise air drag as well and use special Michelin tyres that apparently reduce energy losses from friction. The interior of the Filante Record 2025 carries forward the minimalist philosophy with a snug cockpit inspired by aviation and space travel. The weight-saving ideology takes extreme measures, though, such as the driver's seat being swapped out for a hammock-style stretched canvas arrangement that adapts to the driver's body shape. History buffs will recognize that the Filante Record 2025 draws inspiration from Renault's previous speed record chasers, like the 40 CV des Records, Nervasport des Records and Étoile Filante ('Shooting Star') of the 1920s, 1930s, and 1950s respectively. Renault Filante Record 2025: powertrain Renault's EV division, Ampere, has developed a bespoke 87kWh battery pack for the Filante Record 2025. The battery cells apparently forgo intermediate modules and are integrated directly into the pack in an effort to optimise space, which allows for an equivalent capacity to that of the Renault Scenic, a two-tonne SUV sold abroad that can achieve up to 610km of range. Thanks to a lightweight carbon casing, the battery pack weighs under 600kg and measures just 1710mm wide. Overall, the Filante Record 2025 weighs 1000kg owing to the use of ultra-light materials for the body, namely carbonfibre and a 3D-printed high-strength aluminium alloy. The chassis itself is made from a composite of aluminium, carbon and steel, and Renault shaved off even more weight by equipping the Filante with steer-by-wire and brake-by-wire technologies, which require fewer mechanical components and allow for a greater degree of electronic precision when braking and cornering. Speaking with our sister publication Autocar UK, Renault's director of advanced design, Sandeep Bhambra, stated that the Filante Record 2025 \"seeks to convey an impression of flow and lightness.\" He added, \"We designed this vehicle as a sculpture in motion. Inspired by fighter planes and the speed records of the 19th century, it reflects both performance and timeless elegance.\" The learnings from the Filante Record 2025 and its technologies may benefit Renault's research in fitting smaller batteries into its production cars while achieving the same range, and the knock-on effect would be a reduction in cost for EVs. Renault will commence testing of the Filante Record 2025 this spring, first in wind tunnels and then on race tracks. Also see: Renault Duster 4X4 with LPG powertrain spied Honda asks Nissan to acquire Renault shares ahead of merger Renault Kiger EV, Triber EV India launch in FY2027",
    "author": "Viraaj Bhatnagar",
    "published": "Thu, 30 Jan 2025 18:38:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250130060947_b8f343d45867210194bebe0140e830de_jpg.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "71192a65-7d78-4623-ab77-0ded0e5efcaf",
    "title": "BMW M3 CS Touring officially revealed",
    "link": "https://www.autocarindia.com/car-news/bmw-m3-cs-touring-officially-revealed-434404#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "BMW has officially revealed the M3 CS Touring as a more radical version of its high-performance estate. Compared to the standard M3 Touring, the CS has new design elements, bump-up power and a slightly lower weight. Styling tweaks include a new grille, LED headlight signatures, refreshed bonnet The engine's output is higher at 543hp, a 20hp boost over the M3 Touring The car weighs 15kg less than the M3 Touring due to more use of carbon fibre BMW M3 CS Touring: exterior and interior changes Up front, the M3 CS Touring looks almost identical to the M3 CS sedan, save for the new diagonal LED signatures in the headlights that glow yellow. The elongated kidney grilles get a new horizontal Y-shaped design and a red border, the bonnet has two large air ducts finished in black, and there’s a more pronounced carbon-fibre splitter underneath the bumper. BMW only offers four colours for the M3 CS Touring: British Racing Green, Frozen Solid White, Laguna Seca Blue and Sapphire Black. Over to the side, not much has changed on the M3 CS Touring besides the carbon-fibre side mirror caps and fresh designs for the forged wheels. BMW has equipped the M3 CS Touring with 19-inch front and 20-inch rear wheels as standard, and buyers can opt for them to be painted in gold bronze or black, both with matte finishes. Its rear styling is the same except for a carbon-fibre diffuser and a red contour on the roof spoiler. The interior mostly resembles that of the M3 Touring but with a few notable changes, such as bucket seats with carbon-fibre shells and illuminated ‘CS’ logos, carbon-fibre paddle shifters and some carbon trim on the dashboard. BMW M3 CS Touring: engine and performance upgrades In line with previous BMW CS models, the M3 CS Touring extracts an additional 20hp from its 3.0-litre inline-six engine thanks to a 0.4bar increase in turbocharger boost pressure. The total power output of the engine stands at 543hp, and the 300kph top speed is 20kph higher than the standard M3 Touring. BMW also says that using carbon fibre for many of the M3 CS Touring’s exterior components has led to a 15kg lower weight than the M3 Touring. The enhanced power and reduced weight of the M3 CS Touring allow it to dispatch the 0-100kph run in 3.5 seconds, 0.1 seconds quicker than the M3 Touring. BMW has also included some upgrades on the vehicle dynamics front, such as firmer suspension and two cast-aluminium strut braces up front for greater rigidity. M compound brakes come standard on the M3 CS Touring, and carbon-ceramic ones are available as an optional extra. Deliveries for the M3 CS Touring will begin in March. The high-performance estate is expected to have a limited production run, but specific numbers have not yet been revealed. Although BMW launched the M4 CS in India in October, it is unlikely to bring the M3 CS Touring to the country as the estate body style hasn’t garnered much popularity here. Also see: BMW M3 electric previewed with camouflaged prototype BMW iX facelift revealed with more power, improved range Next-gen BMW X5 to get hydrogen powertrain",
    "author": "Viraaj Bhatnagar",
    "published": "Thu, 30 Jan 2025 15:58:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250130033005_P90584976_highRes_the_first_ever_bmw_m.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  }
]
