[
  {
    "id": "059fdfdd-0c6d-42e8-94f2-35eddb0d77d4",
    "title": "37k-Kilometer 2010 Porsche 911 GT3 RS",
    "link": "https://bringatrailer.com/listing/2010-porsche-911-gt3-rs-22/",
    "description": "This 2010 Porsche 911 GT3 RS is a Canadian-market example that was sold on BaT in February 2018 and recently acquired by the selling dealer. Finished in Grey Black and Guards Red over black leather and Alcantara upholstery, it is powered by a 3.8-liter flat-six linked with a six-speed manual transaxle and a limited-slip differential. Equipment includes red 19″ center-locking wheels, Öhlins TTX coilovers, RSS suspension links, a Sharkwerks short shifter, and Dundon Street Power Kit components in addition to xenon headlights, a rear wing, automatic climate control, a roll bar, carbon-backed bucket seats, and a CD stereo. The car has been registered in Quebec and Ontario, and its odometer currently indicates 37k kilometers. This 997.2 GT3 RS is now offered in Canada with owner's manuals, service records, a car cover, a clean Carfax report, and Ontario registration.",
    "author": "bringatrailer",
    "published": "Thu, 21 Nov 2024 01:00:07 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/08/2010_porsche_911-gt3-rs_1-99929.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "ed1f760c-d375-427a-b72a-78b89d22be60",
    "title": "2021 McLaren 765LT",
    "link": "https://bringatrailer.com/listing/2021-mclaren-765lt-16/",
    "description": "This 2021 McLaren 765LT is #139 of 765 examples produced and was sold new in Canada, where it has remained through the selling dealer's acquisition in 2024. Finished in MSO Papaya Spark over black Alcantara with McLaren Orange accents, it is powered by a twin-turbocharged 4.0-liter V8 paired with a seven-speed dual-clutch automatic transaxle. The car is equipped with the Black Pack as well as 19\" and 20\" diamond-cut forged alloy wheels, carbon-ceramic brakes, a vehicle-lift system, a titanium quad-exit exhaust system, and an active rear spoiler along with carbon-fiber exterior and interior trim. Inside, heated and power-adjustable bucket seats are accompanied by a Bowers \u0026 Wilkins sound system, McLaren Track Telemetry, and an 8\" touchscreen infotainment system. This 765LT has 27k kilometers (~17k miles) and is now offered in Canada by the selling dealer with the owner's manual, a battery maintainer, a car cover, and clean Alberta registration.",
    "author": "bringatrailer",
    "published": "Thu, 21 Nov 2024 00:55:16 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/04/2021_mclaren_765lt_013-23786.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "6f5c4ffa-b8e3-40ae-bb64-f98a1b362b5e",
    "title": "Check Out The 2026 Hyundai Ioniq 9 From Every Angle",
    "link": "https://jalopnik.com/check-out-the-2026-hyundai-ioniq-9-from-every-angle-1851703641",
    "description": "Hyundai just unveiled the 2026 Ioniq 9 at an iconic Hollywood Hills mansion ahead of its public debut at the Los Angeles Auto Show this week. The three-row electric SUV boasts a seriously aerodynamic design that still allows for a hugely spacious interior, and there are a lot of cool details inside and out that sets…Read more...",
    "author": "Daniel Golson",
    "published": "Thu, 21 Nov 2024 01:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/cad9c80de8756d1005997e2e28c91fc5.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "ioniq",
      "kia ev9",
      "hyundai motor group",
      "hyundai ioniq 6",
      "hyundai ioniq 5",
      "hyundai motor company",
      "la auto show"
    ]
  },
  {
    "id": "fb9c87b0-8e4d-41b1-be57-2b667a4316d7",
    "title": "2026 Hyundai Ioniq 9 Is An Aero-Focused Three-Row SUV With 300 Miles Of Range In Every Trim",
    "link": "https://jalopnik.com/2026-hyundai-ioniq-9-is-an-aero-focused-three-row-suv-w-1851703561",
    "description": "Three years after unveiling its Seven concept at the Los Angeles Auto Show, Hyundai is using that same show to debut the production 2026 Ioniq 9, a large three-row SUV that’s a sibling to Kia’s EV9. (The name was changed from 7 to 9 to leave room for more future Ioniq models.) It’s a wild-looking thing, with even…Read more...",
    "author": "Daniel Golson",
    "published": "Thu, 21 Nov 2024 01:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/f563a1b7ebe615989e218559a84de9a2.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "hyundai ioniq",
      "ioniq",
      "ioniq 9",
      "hyundai prophecy",
      "kia",
      "tesla",
      "sedans",
      "hyundai motor group",
      "hyundai ioniq 6",
      "hyundai electric global modular platform",
      "hyundai ioniq 5",
      "ev9",
      "hyundai motor company",
      "la auto show",
      "hybrid vehicles"
    ]
  },
  {
    "id": "53606eea-a9f9-4b75-a534-1291aae3b03f",
    "title": "2025 VW Tiguan: Faster, lighter, and smarter — everything you need to know",
    "link": "https://www.autoblog.com/news/2025-volkswagen-tiguan-all-new",
    "description": "Volkswagen's heavily refreshed Tiguan arrives for the 2025 model year with chiseled new looks, added safety features, and a power bump",
    "author": "Cole Attisha",
    "published": "Thu, 21 Nov 2024 01:01:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwODIzMDQ0MTMzMTAzNTkz/2025-vw-tiguan-r-line---ascott-grey----sam-dobbins-2024---0736-enhanced-nr_rt.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Tiguan",
      "Volkswagen",
      "2024",
      "Volkswagen",
      "VW",
      "News",
      "vw tiguan",
      "2025"
    ]
  },
  {
    "id": "9f236315-fdc2-4567-a05a-5e82fa3c3d03",
    "title": "Hyundai Ioniq 9 debuts at LA Auto Show as the brand's biggest EV yet",
    "link": "https://www.autoblog.com/news/hyundai-ioniq-9-debuts-at-la-auto-show-as-the-brands-biggest-ev-yet",
    "description": "A new three-row all-electric SUV joins the Ioniq lineup with sales starting in the U.S. early next year.",
    "author": "Sasha Lekach",
    "published": "Thu, 21 Nov 2024 01:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwNzk5MTcyNDM2MTc0ODI1/2026-hyundai-ioniq-9.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Hyundai Ioniq 9",
      "Ioniq 9",
      "Hyundai",
      "Hyundai",
      "News"
    ]
  },
  {
    "id": "308a862b-0756-482c-8165-574cfa0bc71a",
    "title": "Jaguar releases teaser of upcoming concept – with no rear window",
    "link": "https://www.autocar.co.uk/car-news/new-cars/jaguar-releases-teaser-upcoming-concept-%E2%80%93-no-rear-window",
    "description": "Concept has remarkably wide rear arches – and completely lacks a rear window Shock social media post showcases the dramatic curves of the car being revealed on 2 December Jaguar has released a new teaser image of its upcoming Design Vision Concept, providing our best look yet at the car that will set the tone for the brand's new era. The image, which appears to be of the car’s rear end, confirms Autocar’s exclusive report that the brand’s upcoming cars will omit a traditional rear window, in favour of a Polestar 4-style digital mirror. It also showcases the concept car’s dramatic proportions, with a remarkably wide rear wheel arch and track, as well as a repeated contrast between smooth curves and hard-edged straight lines. Conventional rear lights cannot be seen: they are either hidden out of view of the teaser shot, or are concealed by the prominent slats running across the car’s tail. Those slats mirror those featured in the new 'leaper' logo, suggesting the car could showcase Jaguar's new branding in large scale. The image was posted to social media accompanied by the text “copy nothing”, reiterating the mantra of JLR creative chief Gerry McGovern – itself derived from that of Jaguar founder William Lyons.   02 Dec 2024 Miami.Copy nothing.#Jaguar pic.twitter.com/NtLn7j1T7Y — Jaguar (@Jaguar) November 20, 2024   The unexpected post comes in the wake of the strong reaction to Jaguar’s rebrand, which was yesterday (19 November) detailed in full. “We are creating Jaguar for the future, restoring its status as a brand that enriches the lives of our clients and the Jaguar community,” said McGovern, commenting on the rebrand. JLR CEO Adrian Mardell has described Jaguar’s rebirth as “a complete reset”, calling its new effort “something spectacular”. The concept will be shown in full on 2 December, at Miami Art Week. It is set to preview a four-door electric GT, which is set to be the first in a three-car line-up due from 2026. The production car – which recently began road testing – will pack north of 575bhp and have a range of more than 430 miles. It will be priced north of £100,000, positioning it as a rival for the Porsche Taycan.",
    "author": "",
    "published": "Wed, 20 Nov 2024 20:07:34 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/jaguar-concept-teaser-20-november.jpg?itok=2xOcbJ8Z",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "71feb701-7e81-4a7e-8f92-6cc54f735154",
    "title": "Nissan wants 'urgent' action on ZEV mandate after government talks",
    "link": "https://www.autocar.co.uk/car-news/electric-cars/nissan-wants-urgent-action-zev-mandate-after-government-talks",
    "description": "Japanese firm warns fines risk future investment, while ministers insists phase-out date for ICEs remains Nissan has called for the UK government to make urgent changes to the Zero Emission Vehicle (ZEV) mandate, warning that failing to do so risks \"undermining the business case\" for future investment. Representatives from the Japanese firm were among a number of manufacturers who met with transport secretary Louise Haigh and business secretary Jonathan Reynolds today (Wednesday 20 November) to discuss the electric vehicle transition, including the ZEV mandate. Officials from BMW, Ford, Stellantis, Tesla, Toyota and Volkswagen also took part in the talks, along with representatives from the Society of Motor Manufacturers and Traders (SMMT), charging industry body ChargeUK and the British Vehicle Leasing and Rental Association (BVRLA). In a statement after the meeting the government confirmed that it would retain the planned 2030 date for the phase-out of pure combustion-engined vehicles – although certain hybrids will be allowed until 2035 – but did not address manufacturers’ concerns about the ZEV mandate, leaving open the possibility for future amendments. The ZEV mandate requires manufacturers to sell an increasing percentage of zero-emission cars each year, with stiff penalties for those who fail to achieve their targets. While there are a number of exemptions and the ability to pool or trade credits, in its simplest form firms this year must ensure that 22 per cent of their new car sales are zero-emission. That rises to 26 per cent next year, and ramps up further to 80 per cent by 2030. In a statement, Nissan cited SMMT data suggesting EV sales will only reach 18.5 per cent of the total market this year due to the slowdown in consumer demand for EVs, potentially leaving manufacturers in line for stiff penalties.  Calling the targets “outdated” Nissan said that the ZEV mandate could result in car firms being fined because of slowing consumer demand. One option for firms would be to purchase credits from EV-only brands, but Nissan – which has a major plant in Sunderland – noted that none of those brands currently manufacture in the UK, “meaning the UK automotive industry will effectively be subsidising EV sectors in other countries, at the expense of investment in Britain.” Nissan said it remains committed to a fully electric future, and is currently gearing up to build three EVs in Sunderland. But it wants the government to address the ZEV mandate by increasing the flexibility to ‘borrow’ credits from future years, and a two-year monitoring period for 2024 and 2025 in which no fines are levied. “Nissan has consistently supported the aims of the UK’s ZEV Mandate and have been working with Governments and partners towards a fully electric future since the first Nissan Leaf arrived in 2010,” said Nissan’s European chief Guillaume Cartier. “The Mandate risks undermining the business case for manufacturing cars in the UK, and the viability of thousands of jobs and billions of pounds in investment. We now need to see urgent action from the Government by the end of the year to avoid a potentially irreversible impact on the UK automotive sector.” Noting that Nissan employs 7000 people in the UK across its facilities and that it contributes more than £2bn to the UK economy, Cartier added that the firm was committed to working the government on a long-term solution, but said “action is needed urgently to ensure we protect UK car manufacturing and ensure we can all realise and support the transition to zero emissions and carbon neutrality.” But in a statement after the meeting the Department for Transport said: “Recognising the global challenges the industry has been facing, ministers underlined the Government’s commitment to working constructively and in close partnership with the sector as we support the transition to electric vehicles by 2030.” The government has always said that the sale of certain hybrid vehicles, likely with significant zero-emission capability, can be sold between 2030 and 2035, although it has only said that specifics will be given “in due course”. The statement didn't specifically address the ZEV mandate, so it is possible that some changes could be made to it in response to industry concerns. The government added that the UK has the fastest growth of zero-emission vehicle sales of any major European market, adding: “We’re providing more than £2.3 billion to support industry and consumers in making the switch, with 57 new public electric vehicle chargers added on average each day.” SMMT chief Mike Hawes said the meeting \"was an important opportunity to restate the UK automotive industry’s commitment to both economic growth and Net Zero. However, the industry also made clear its concerns about the pace of the EV transition and the negative effect this is having on the health of the overall market and the attractiveness of the UK as a manufacturing location. \"A strong market and manufacturing base that sustains jobs and drives growth requires workable regulation backed by support for consumers – fiscal incentives and confidence that the charging network will be there when it is needed. We will now work urgently with government to identify any adjustments necessary to help the industry and government meet their targets, instilling confidence in the consumer and other stakeholders, all of whom are part of this transition.\" Vicky Read, the head of ChargeUK, called the charging industry “a UK growth story”, adding that the progress made in the past 10 years “was acknowledged by the government” in the meeting.  Reed added: “Everyone is agreed that uncertainty is the enemy of the EV transition and threatens investment on all sides. We will study the forthcoming consultation closely and continue to make the case to retain what we already have – a strong ZEV mandate that works.” More reaction to follow.",
    "author": "",
    "published": "Wed, 20 Nov 2024 19:29:02 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/nissan_nissan_ariya_frontcorner_0.jpg?itok=unU72vOH",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "05a855b2-f647-40a8-b3d2-4d46397ed30e",
    "title": "NEW BMW M5 vs Audi RS7 Performance vs AMG E63 S Drag Race: Throttle House",
    "link": "https://www.bmwblog.com/2024/11/20/bmw-m5-vs-audi-rs7-vs-amg-e63-drag-race/",
    "description": "Throttle House recently pitted three of the most powerful performance sedans against each other in a drag race and a roll race. The new BMW M5, Audi RS7 Performance, and Mercedes-AMG E63 S faced off... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Wed, 20 Nov 2024 18:30:14 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/11/BMW-M5-G90-at-Magny-Cours-124-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M5",
      "Videos",
      "drag race",
      "G90 M5"
    ]
  },
  {
    "id": "6d832d6a-54bd-4063-9093-6c5218c2b46b",
    "title": "What Is BMW’s Monolithic Design Philosophy? A Deep Dive Into Bold Simplicity",
    "link": "https://www.bmwblog.com/2024/11/20/bmw-monolithic-design-philosophy-future/",
    "description": "BMW’s new design philosophy embraces simplicity and boldness, combining minimalist surfaces with striking proportions that distinguish it from traditional automotive styling. This so-called “monolithic” approach represents a pivotal shift for the brand. It signals a... First published by https://www.bmwblog.com",
    "author": "Nicolas Cavero",
    "published": "Wed, 20 Nov 2024 17:41:50 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2021/03/BMW_iX_xDrive50_13-830x622.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Interesting",
      "BMW Design",
      "BMW i5",
      "BMW iX",
      "Neue Klasse"
    ]
  },
  {
    "id": "68b4f986-257e-4edb-bea6-e918d5546b23",
    "title": "Viaterra P300 rain jacket review",
    "link": "https://www.autocarindia.com/bike-reviews/viaterra-p300-rain-jacket-review-433504#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "The Indian monsoon is nothing to be trifled with when it comes to waterproof gear, so a little before its onset this year, I purchased the Viaterra P300 waterproof liner. I’ve used enough Viaterra products by now to know that they work as intended, which is why I splurged on the P300. There are more affordable rain liners from Viaterra if you’re on a tight budget. Wearing a rain liner over an armoured riding jacket is cumbersome – there’s no two ways about it. But the P300 eases things to quite an extent. For example, the cuffs are nice and wide, enough so that even if I’m wearing my Grid full-gauntlet gloves, my hand can also slip through without a second thought. Then, there is the inner mesh lining, which helps with comfort as it lets the P300 slide over your jacket instead of bunching up in areas. It also makes the rain jacket easier to get on and off. But by far, the most helpful feature is the zipped vents on the front of the jacket. I’ve found that even in the heaviest of downpours, it’s best for my comfort to keep them fully open, and since there is a Velcro closure that keeps the top and bottom of the zip closed, there’s no water ingress at all. Vents allow good airflow, and the zipper is easy to use. In fact, I remember using this exact trick when I was efficiency-testing the Bajaj Freedom CNG bike at slow-moving Mumbai city speeds for nearly three hours with the P300 on in the pouring rain, and I remember being pleasantly surprised by the airflow that was allowed through to me. This is what makes it worth the extra money for me. My only gripe is that this jacket is slightly shorter at the front, which Viaterra has done to prevent the jacket from bunching and pooling water. On the one hand, Rishaad liked this feature in his P300, but I found that the bottom two inches of my riding jacket got wet in continuous heavy rain. Perhaps the next iteration can have a slight increase in the length. Another point is that the hood is removable, which is a great feature, but it would be nice if there was a pocket or some provision in the jacket to store it. At Rs 2,499, the Viaterra P300 is the most expensive of the made-in-India rain liners, but after staying dry as well as reasonably cool for this past monsoon, I can confidently say it’s well worth the investment. Where: viaterragear.com Price: Rs 2,499 Also see: Viaterra Holeshot Pro gloves review Viaterra Munro custom fit pants review",
    "author": "Dinshaw Magol",
    "published": "Sun, 17 Nov 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241111052108_1_1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "ba9d7dda-b3e6-40e3-aaea-7ac4dd2f5858",
    "title": "Arai Tour-X5 helmet review",
    "link": "https://www.autocarindia.com/bike-reviews/arai-tour-x5-helmet-review-433486#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "As with the older Tour-X4, Arai’s latest Adventure helmet is very versatile, in that it can also be configured as a road helmet without the peak or an MX-style helmet without the visor. However, it now addresses a universal complaint with the previous Tour-X4 – its visor change mechanism that needed the removal of four screws. The new one debuts a much easier system where the entire peak and visor can be removed by using just a small push tab under the covering plate. In typical Arai fashion, it’s a marvelously over-engineered solution that can be intimidating to use at first, but you quickly figure it out, and the system works well. Just ensure that the mechanism is properly clicked into place before you ride off!   The X5 gets a new Pinlock-compatible visor that has a more rounded profile with improved optics. One of the big changes here is the removal of the trademark eyebrow vents in the visor, which is a bit bittersweet. On the one hand, those vents definitely work well, but the flip side is that they tend to leak in continuous heavy rain, even when closed. The Tour-X5 also drops the chin vents on the sides of the helmet jaw. The total number of vents has reduced, but the actual venting is still superb, so I have no complaints.      I spent a week in this helmet at the GS Trophy, which was easily the most intense riding of my life, and the comfort was excellent. The best helmets are the ones that melt away into the background and let you focus on your riding, and this one manages just that.  The Tour-X5’s peak has also been redesigned, and I found that it had noticeably less lift at high speeds on an adventure bike. It also feels much better on naked bikes, with negligible lift at a steady 100kph. However, the tradeoff is that wind noise is quite high, so it’s best to use this helmet on a bike with good wind protection.    The Tour-X5 has a weight similar to the Tour-X4   Weighing 1,650 grams, it is more or less the same as the T4, but like the old helmet, it feels superbly balanced and great for all-day usage. Another really appreciable change is that Arai knows almost all its customers will install a Bluetooth communicator, so they’ve made it easier to do so. The cheek pads now have dedicated circular Velcro extensions for your speakers, and there are even small wire-managing tabs built into the liner. This is definitely the nicest helmet I’ve used for installing/removing a comms device, and it’ll be great to see other Arai models get a similar treatment.    It has convenient cut-outs for speakers   The helmet is now ECE 22-06-compliant, and quality is at a typically high level with a beautiful paint finish, the most luxurious inner liner material you’ll ever come across and a solid, built-to-last feel in every component. As always, this helmet is an investment in a top-quality handmade product, and the prices match that. They currently start at a little under Rs 60,000 for plain colours in Europe and go up for graphics. You will save a significant amount if you shop from some Asian markets, but be aware that Arai’s shell shapes and sizes are different in these markets, so it’s crucial to try before you buy.    Where: araihelmet.eu   Price: Rs 64,000 (approx.)   Also see: Arai Tour-X4 helmet review",
    "author": "Rishaad Mody",
    "published": "Mon, 11 Nov 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241108053256_1 _1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "4c53d8f2-21ea-44ed-8d9b-d994e3a68904",
    "title": "Mahindra XUV 3XO vs Tata Nexon diesel comparison",
    "link": "https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-vs-tata-nexon-diesel-comparison-433597#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "The newest entrant in the compact SUV space is the Mahindra XUV 3XO, which builds on the strengths of its predecessor, the XUV300, and ups its desirability quotient on account of a new interior, more features and an overall fresher design language. Mahindra’s changes seem to have paid off, as the 3XO has been well received by the market, with waiting periods on the rise. We put the diesel manual version through our real-world tests and, for perspective, compare it to the Tata Nexon diesel – one of the best-sellers in the segment – to find out which is better. The XUV 3XO’s squat stance, larger 17-inch alloys and connected LED tail-lamps give it a more premium look than the 300. However, certain design elements could come across as overdone to some. The Nexon’s sharper styling – the distinct Tata family look, coupé-like roofline and harmonious curves – lends it a more modern look. While both cars are similar in dimensions, the XUV 3XO’s wheelbase is much longer, which translates into more cabin room (more on that later). The Nexon sits slightly higher above the ground with a clearance of 208mm versus the XUV’s 201mm.   Mahindra XUV 3XO interior and seating The XUV 3XO’s cabin certainly looks more upmarket, thanks to a generous use of bright colours and a segment-first panoramic sunroof. Furthermore, soft-touch materials on the dashboard and door cards, as well as the dimpled, leather-wrapped steering, feel high quality – the overall fit and finish are top-notch. On the whole, the Mahindra’s cabin makes you feel like you’ve spent your money well, although it will require more effort to keep clean. Narrow seat, limited thigh support on offer in the Mahindra. The cabin fares well in terms of user-friendliness, too – ergonomics are agreeable, storage areas are well-defined, and the use of proper buttons and knobs makes things easier to use on the move. The driver’s seat, however, isn’t very comfy due to a snug backrest, inadequate thigh support and a cramped footwell, leaving no room for a dead pedal. XUV's longer wheelbase liberates more room. The rear seat experience is much better, though, with a broader seat, a comfier backrest angle and an overall greater sense of space than the Nexon. The shoulder room is good, too, so three abreast will be an easier fit. However, thigh support for the outer passengers will feel inadequate due to the curvy seat base design. What’s nice is that even the middle occupant gets a three-point seat belt as well as an adjustable head restraint. Three abreast comfier here; adjustable headrests, 3-point seat belts for all.   Tata Nexon interior and seating Shifting focus to the Nexon, the dark-coloured cabin hampers its sense of roominess and makes it appear a lot smaller, at least visually. The dashboard sports some modern-looking bits like a floating touchscreen, two-spoke steering wheel and capacitive touch controls for the HVAC system, but these bits are finished in piano black, which is likely to pick up surface scratches and smudge marks easily. Nexon's firm backrest isn’t very comfy. The Nexon continues to be plagued by ergonomic foibles, such as the inconvenient placement of its USB ports deep in a recess and the awkwardly angled bottle holders in the door. The buttons on the thick-rimmed steering protrude out a fair bit, and a wireless charging pad has replaced the front cup holders. Supportive seating in the Nexon, though contoured for two. The front seats have a ventilation function, but the seats are about as narrow as the 3XO’s. Knee and legroom at the rear are tighter, and even though there isn’t any dearth of shoulder room, its back seat seems to be designed to accommodate just two adults, as the thick, concave side bolsters force the outer passengers inward. Also, the middle passenger will have to make peace with the tall central floor hump and protruding air-con console. Adequate shoulder room, but concave shape is not comfy for outer occupants. In terms of boot space, the Nexon’s is a bit larger than the XUV’s, and its loading lip is higher, too. Interestingly, the 3XO only gets a temporary spare tyre (T135/90 R16), which is one of the reasons its boot space is more than that of its predecessor, which had a larger spare. Also, for an otherwise well-equipped car, the 3XO doesn’t get a parcel shelf as standard; it has to be bought as an accessory.   The Mahindra XUV 3XO has a much lower starting point, with its base variant priced at Rs 9.99 lakh – Rs 1 lakh lower than the Nexon’s. For this comparison, we have the XUV 3XO’s second-from-top AX7 variant priced at Rs 13.69 lakh and the Nexon’s fully loaded Fearless +S DT variant, which costs Rs 14.70 lakh. The Nexon’s Fearless variant is priced at Rs 13.70 lakh, but it misses the JBL sound system and the sunroof. The Mahindra also gets a fully loaded AX7 L variant priced at Rs 14.99 lakh, which adds ADAS, a 360-degree camera and an electronic parking brake. Excellent fit and finish and high-quality materials used in the cabin; Wireless Apple CarPlay, Android Auto didn’t work in test car; Bright colours, large sunroof elevate the cabin’s appeal; Footwell is too cramped in an otherwise user-friendly cabin. The Mahindra doesn’t get ventilated front seats, which the Nexon offers, but even this AX7 variant gets 17-inch alloys (vs Nexon’s 16 inchers) and a panoramic sunroof and rear disc brakes, which the Tata doesn’t get. As far as their user experience, user interface and sound systems go, the Nexon certainly has an edge. The touchscreen feels nicer to use, and the JBL speakerssound more immersive and deliver a better aural experience. In our XUV 3XO test vehicle, many features, such as wireless Android Auto and Apple CarPlay, hadn’t been activated. Even the different sound modes didn’t change the audio experience. Performance is stronger, and acceleration times are better, too; Diesel engine sounds gravelly and coarse at all times; The sound quality of the JBL speakers is excellent; Its dark colour scheme hampers the sense of roominess. What worked better, though, were the XUV’s LED headlamps, which illuminated the road more evenly and had a better spread, too. Interestingly, the Nexon’s 360-degree camera is clearer in the day, but in low-light conditions, the XUV’s two reversing lights brighten up the area better. The Nexon’s single reversing light results in a camera feed that isn’t as clear, although it displays a much wider view. Both the cars are powered by 1.5-litre, four-cylinder turbo-diesel engines mated to 6-speed manual transmissions. But that’s where their similarities end. To meet stringent BS6.2 emissions norms, Tata uses a Lean NOx Trap (LNT) and diesel particulate filter (DPF). It is accompanied by the cost-effective Passive Selective Catalytic Reduction that eliminates the need for a urea tank and an injection system, which are a part of the Selective Catalytic Reduction (SCR) system. The XUV 3XO diesel deploys the latter, which is more expensive as it warrants a separate AdBlue tank and other ancillaries. It also needs regular maintenance as owners have to refill the AdBlue tank at fixed intervals, which is an added cost. Right off the bat, the Mahindra’s diesel feels smoother and more refined. Yes, you can hear some diesel clatter at idle, but the engine note isn’t as coarse or as gravelly as the Tata’s. With 117hp and 300Nm, the XUV’s diesel has the numbers in its favour – 2hp and 40Nm more than the Nexon’s. However, its 1,469kg kerb weight makes it 112kg heavier than the Nexon diesel, which negates its advantage on paper. Like other Mahindras, a crisp throttle response lends it a nice feeling of power each time you dab the accelerator. There is some turbo lag below 1,700rpm, but the gush of torque beyond that makes the XUV sail past slower-moving traffic with ease. The Tata’s engine feels stronger, thanks to its lighter kerb weight and more aggressive power delivery. Turbo lag is also managed better, and the drive modes, which transform the way the Nexon behaves, make a significant difference. In ‘Eco’ mode, it feels starved of power in the interest of efficiency. However, dial it to ‘Sport’ mode, and the Nexon sprints forward with gusto. In our tests, both cars were neck and neck when accelerating from 0kph to 100, but in rolling acceleration, the Nexon leaves the XUV trailing by a significant margin in every gear. So, while the Nexon diesel impresses with its performance, refinement isn’t its strong suit. The gravelly diesel note gets progressively louder as you spin this engine harder.   The Mahindra XUV 3XO gets an automatic engine stop-start system to save fuel while idling, whereas the Nexon gets an Eco drive mode to abate fuel consumption. In our real-world test, the Nexon’s 1.5-litre diesel delivered an average fuel efficiency of 18kpl, which is 2.5kpl higher than what the XUV 3XO diesel achieved. In the city, the Nexon bettered the XUV’s number by 3kpl, delivering 16.5kpl. On the highway, the Nexon returned 19.4kpl in our tests, 2kpl better than the Mahindra. Also see: Mahindra XUV 3XO real-world fuel economy tested, explained Tata Nexon real-world fuel economy tested, explained Typical of a Mahindra, the XUV 3XO’s underpinnings feel tough. It soaks up harsh blows from bad roads with an added layer of cushioning, resulting in a plush low-speed ride, although the suspension can get quite loud while at work. At highway speeds, too, the XUV feels planted, and while vertical movement is greater than the Nexon’s, body movements aren’t to the point of feeling uncomfortable. There are steering modes on offer in the XUV 3XO that alter the weight and resistance of the electric power steering, and while ‘Sport’ mode makes the steering unnaturally heavy, ‘Comfort’ feels light and effortless, which is what most users are likely to prefer. While on the topic of user-friendliness, the clutch pedal doesn’t warrant any more effort than the Nexon’s, and even though its gearbox has long throws, it feels smoother and easier to slot into gates. The XUV gets rear disc brakes (the Nexon gets drums at the rear), so despite being 112kg heavier, in our panic braking tests from 80kph to a standstill, it stopped at a shorter distance. XUV’s suspension tackles bad roads with an added layer of cushioning; The Nexon is sportier to drive, and high-speed stability is excellent. The Nexon feels sportier thanks to sharper steering, a tighter chassis and an overall stiffer suspension setup. Its structure feels inherently robust, and it shrugs off bad roads and does so in a quieter manner. What’s also nice is that the Nexon remains glued to the road at highway speeds, and the body roll is well in check. However, since its suspension isn’t as absorbent as the XUV’s, passengers in the Nexon are likely to feel sharp body movements over rough sections of road, especially at city speeds.     The Tata Nexon brings a lot to the table, such as a spacious cabin, a long list of features, and a fantastic infotainment and audio experience. And besides feeling tough, it boasts a 5-star Global NCAP crash-test rating. The 3XO has scored five stars, too. What’s more, the Nexon’s strong diesel engine makes it both quicker and much more fuel-efficient than the Mahindra XUV 3XO. However, the XUV 3XO’s diesel engine is far ahead on smoothness and refinement; its driving controls are lighter, and ride quality in the city is plusher. A generous use of bright colours and higher-quality materials make its interiors feel more upmarket, too. Yes, it misses ventilated front seats, a very popular feature these days, but it makes up for it with others like a panoramic sunroof and ADAS (on the AX7 L), for a price very close to the Nexon’s. In summary, while the Nexon has strong fundamentals, it is the Mahindra that feels more polished and upmarket, and that’s why it wins this comparison test. Test scorecardMetricXUV 3XONexonCommentsComfort8/107/10The Mahindra has a comfier back seat, and ergonomics are more user-friendly. The Nexon’s front seats are better, though.Performance7/109/10Not only is the Nexon much quicker in terms of acceleration, but it is also much more fuel-efficient than the XUV.Refinement9/107/10The Tata’s diesel engine clatter is audible and sounds coarse, too. The XUV’s 1.5-litre is relatively smoother and quieter.Value8/107/10The XUV 3XO has a lower starting price, and its AX7 variant (as tested) is nearly a lakh cheaper than the top-spec Nexon.Safety9/109/10Both cars get similar safety kits, but the XUV also gets rear disc brakes and the option of ADAS, which the Nexon misses.Ride9/108/10Even though both feel tough, the XUV’s low-speed ride feels plush. The Nexon feels more confident at higher speeds.Handling8/109/10The Nexon’s steering is sharper, and its chassis feels stiffer, making it sportier and more enjoyable to drive.Build \u0026 quality9/108/10XUV’s interior feels better built and looks more upmarket, with better quality, fit and finish. Nexon could do with more polish. Also see: Mahindra XUV 3XO vs Tata Nexon comparison video Tata Nexon with panoramic sunroof priced from Rs 13.60 lakh Mahindra XUV 3XO AX5 review: In demand",
    "author": "Saumil Shah",
    "published": "Wed, 20 Nov 2024 15:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241120024710_Mahindra_XUV_3XO_diesel_vs_Tata_Nexon_front_action.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "9d815f2d-1aaa-4016-b121-ed169578b717",
    "title": "Mercedes AMG C 63 S E Performance 4Matic+ video review",
    "link": "https://www.autocarindia.com/car-video-reviews/mercedes-amg-c-63-s-e-performance-4matic-video-review-433586#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see: Mercedes AMG C 63 S E Performance 4Matic+ track drive: Plug and Play",
    "author": "Saumil Shah",
    "published": "Tue, 19 Nov 2024 11:03:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241119101658_MERCEDES_AMG_C_63_S_video_review.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "aa506b87-49fd-4b7c-9c10-6b123baf6871",
    "title": "Road Tested: The Cardo Packtalk Pro Bluetooth helmet comms system",
    "link": "https://www.bikeexif.com/cardo-packtalk-pro-review",
    "description": "Like our readers, we’re discerning when it comes to the motorcycles we ride and the gear we use. So, by extension, we’re also selective about the products we review. Style and quality rank high, but so does usability—especially when it comes to tech accessories. Adding a gadget to your arsenal should enhance your riding experience, not hinder it. That goes as much for how easy it is to set up, as for whether it blends with the rest of your get-up or sticks out like a sore thumb. All that counts for double when you’re evaluating a Bluetooth comms system like the Cardo Packtalk Pro. Relatively new to Cardo’s line-up, the Packtalk Pro sits just above the brand’s Packtalk Edge as a more feature-rich, and more expensive, version.…",
    "author": "Wesley Reyneke",
    "published": "Wed, 20 Nov 2024 20:02:44 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/11/cardo-packtalk-pro-review-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Motorcycle Gear",
      "Motorcycle accessories"
    ]
  },
  {
    "id": "3fbdded9-2db8-4846-8e52-124c2e168716",
    "title": "Obsidian: A slammed and stripped Harley Softail Deuce from Warsaw",
    "link": "https://www.bikeexif.com/harley-softail-deuce",
    "description": "Some custom motorcycle builders are drawn to the simplicity of vintage machines, while others favor the performance and reliability of modern motorcycles. The 2005-model Harley Softail Deuce sits somewhere in the middle. Officially named the Harley-Davidson Softail FXSTD, the mid-naughties Deuce featured Harley’s new (at the time) Twin Cam V-twin engine and disc brakes, but hadn’t yet adopted fuel injection or a pesky CAN bus system. That, combined with its relatively minimalist build, made it the perfect candidate for Wojciech Aleksiejuk’s latest custom build. Based in Warsaw, Poland, Wojciech worked at a Harley specialist shop for a few years before branching out independently, under the banner of Demiurge Cycles. Building custom bikes had been a hobby up until this point—but now that Wojciech had turned it into a full-time gig, he wanted to create something that could showcase his abilities.…",
    "author": "Wesley Reyneke",
    "published": "Tue, 19 Nov 2024 20:33:19 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/11/fb-15.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Bobber motorcycles",
      "Harley bobbers",
      "Harley Softail",
      "Harley-Davidson"
    ]
  },
  {
    "id": "a03bfd4b-c28e-4e98-886c-23bfda08d4cf",
    "title": "2025 VW Tiguan Adds Pace, Space And A New Face",
    "link": "https://www.carscoops.com/2024/11/2025-vw-tiguan-adds-pace-space-and-a-new-face/",
    "description": "North America's redesigned Tiguan appears to be a big step forward as it's more powerful, high-tech, and efficient",
    "author": "Michael Gauthier",
    "published": "Thu, 21 Nov 2024 01:00:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/11/2025-VW-Tiguan-R-Line--1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "LA Auto Show",
      "New Cars",
      "Video",
      "VW",
      "VW Tayron",
      "VW Tiguan",
      "VW Videos"
    ]
  },
  {
    "id": "c4e12098-cddb-4f62-b784-8bc9c72ad7cb",
    "title": "Faraday Future Teases Mainstream FX Prototype",
    "link": "https://www.carscoops.com/2024/11/faraday-future-teases-mainstream-fx-prototype/",
    "description": "If everything pans out, FX models could go into production next year and cost as little as $20,000",
    "author": "Michael Gauthier",
    "published": "Thu, 21 Nov 2024 00:15:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/11/Faraday-Future-FX-Teaser-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Faraday Future",
      "teaser"
    ]
  },
  {
    "id": "e9410008-ebe0-4cf1-a28a-2a6f451d5518",
    "title": "Jeep Compass, Meridian get up to Rs 4.95 lakh year end discounts",
    "link": "https://www.autocarindia.com/car-news/jeep-discounts-offers-and-benefits-this-month-433607#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "As the year draws to a close, Jeep India is offering attractive benefits on almost its entire line-up. You can save up to Rs 4.95 lakh on the Compass and Meridian SUVs and up to Rs 12 lakh on the flagship Grand Cherokee. Disclaimer: Discounts vary from city to city and are subject to stock availability. Please check with your local dealer for the exact figures. Jeep Compass Save up to Rs 4.70 lakh The Compass is available with benefits of up to Rs 3.15 lakh on select variants. Additionally, Jeep is offering corporate benefits worth Rs 1.40 lakh on MY2024 models and special offers worth Rs 15,000, taking the total up to Rs 4.70 lakh. Priced between Rs 18.99 lakh and Rs 28.33 lakh, the Compass only comes with a 170hp, 2.0-litre diesel engine that has manual and automatic transmission options. Only the top-spec Model S variants get a 4x4 option. Jeep Meridian Save up to Rs 4.95 lakh Jeep is selling the Meridian with benefits of up to Rs 2.80 lakh and additional corporate offers worth Rs 1.85 lakh on MY2024 models, depending on the variant. There’s also a special offer worth Rs 30,000, which takes the total benefits up to Rs 4.95 lakh. Recently, Jeep also introduced a new entry-level 5-seater version of the SUV, and it is currently priced between Rs 24.99 lakh and Rs 38.49 lakh. The Meridian shares its powertrain options with the Compass. Jeep Grand Cherokee Save up to Rs 12 lakh The year-end offers on Jeep’s flagship product in India, the Grand Cherokee SUV, are as high as Rs 12 lakh. The SUV is available only in the fully-loaded Limited (O) trim, priced at Rs 67.50 lakh. The Grand Cherokee has a 2.0-litre, four-cylinder turbo-petrol engine, which produces 272hp and 400Nm of peak torque and is paired to an 8-speed automatic gearbox, sending drive to all four wheels via a four-wheel-drive system. Also See: Tata Harrier, Safari discounts increase up to Rs 2.75 lakh in November Toyota Glanza, Taisor and Hyryder get over Rs 1 lakh year end benefits",
    "author": "Saptarshi Mondal",
    "published": "Wed, 20 Nov 2024 15:36:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241120033614_20240408054513_01.jpeg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "98baccf6-ef38-46e3-9931-ee2060aa53e1",
    "title": "Citroen C5 Aircross base Feel trim discontinued",
    "link": "https://www.autocarindia.com/car-news/citroen-c5-aircross-base-feel-trim-discontinued-433603#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Citroen has silently discontinued its C5 Aircross SUV's base trim, Feel, which was priced at Rs 36.91 lakh. The premium SUV is now only available in the fully loaded Shine trim that costs Rs 39.99 lakh (ex-showroom, India). The entry price of C5 Aircross has gone up by Rs 3.08 lakh Year-end benefits of up to Rs 1.75 lakh on some of its MY2023 units The entry-level Feel trim lacked a few niceties, such as the panoramic sunroof, powered tailgate, wireless phone charger, traction control and hill-descent control. It also made do with a smaller infotainment screen and different upholstery and trim materials. The top-spec Shine trim continues with all the said features and is also available in optional dual-tone paint shades at no additional cost. Under the hood, the C5 Aircross continues to pack a 2.0-litre diesel engine that produces 177hp and 400Nm of torque. The unit comes mated to an 8-speed torque converter automatic gearbox, for which Citroen claims a fuel economy of 17.5kpl. As part of year-end offers, Citroen is providing benefits of up to Rs 1.75 lakh on the C5 Aircross. However, these apply only to limited MY2023 units and are valid until December 31. In October, Citroen globally previewed an all-new concept for the next-gen C5 Aircross, but there are no plans for its introduction in India anytime soon. Also See: Volvo XC40 Recharge rebranded as EX40, priced at Rs 56.10 lakh Skoda-Volkswagen cars to get new 8-speed AT gearbox in 2026",
    "author": "Saptarshi Mondal",
    "published": "Wed, 20 Nov 2024 13:10:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241120010950_Untitled design _59_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "d5f2e51f-d59e-4b74-833c-a01be05216dd",
    "title": "2011 RUF RT Roadster | 1-of-1 RUF Coach Build",
    "link": "",
    "description": "2011 RUF RT Roadster Location: Miami, Florida Original delivery: USA Chassis/VIN: - Mileage: 6,900 miles Price: Call for Price   The Car | 1 of 1 RUF RT Roadster With a reputation for creating the pinnacle of bespoke performance sports cars, RUF can sometimes afford the luxury of creating one-off coach-built vehicles for close family friends and special clientele. The one-of-one RUF RT Roadster was the result of a unique idea presented by such a client to produce a true B-pillar Targa that hadn’t been available from Porsche from the 993 until the 991. This meant engineering a new body based on a 2011 997.2 chassis to create a Targa that would seamlessly combine nostalgia with the exhilarating driving feel RUF is so well known for. The team wanted to pay homage to the very first Targas produced which were famous for their ability to fully remove the rear window to provide a ‘soft window’ Targa experience. The RT Roadster reimagines the iconic rear quarter panel openings that feed the intercoolers, breathing cold air into the twin-turbo 3.8-liter flat-six that produces 650 horsepower delivered to all four wheels through a PDK transmission. Underneath rests a special RUF-tuned suspension and carbon ceramic brakes on all four corners. Finished in a truly bespoke Chromaflair satin paint, the lines of this RT Roadster flow as the paint transitions through its various layers of flake and its undertones are exposed. The interior is finished in contrasting red leather with silver stitching, extended carbon fiber accents, and painted Chromaflair satin interior trim, showcasing RUF's meticulous attention to detail. Factory options include phone connectivity, foldable carbon bucket seats, color-matching hard top panels, matching red leather luggage belts on the rear parcel shelf, and center lock wheels. The RT Roadster was unveiled at Rennsport VI in 2018 and subsequently featured in a MotorTrend article. It has been privately enjoyed by its original owner since then before being offered for sale to the general public. Continue...",
    "author": "",
    "published": "Tue, 12 Nov 2024 16:10:38 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/11/11091134/DSC05124-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "dd989025-c6a4-4bf1-877e-9e8d39afafb8",
    "title": "1986 Lamborghini Countach LP5000 Quattrovalvole | The 1st ever complete restoration undertaken by Lamborghini",
    "link": "",
    "description": "Photography by: Zach Brehl (@zachbrehl) 1986 Lamborghini Countach LP5000 Quattrovalvole (QV) Location: Toronto, Ontario Country of original delivery: Canada Chassis/VIN: GLA12978 Mileage: 25,334 kms (15,742 miles) Certification : Polo Storico Certification Price: Call for Price     The Car | The 1st nut-and-bolt restoration undertaken by Lamborghini As part of its Private Sales initiative, Petrolicious is proud to offer this highly storied, two-owner, factory-restored, US-specification 1986 Lamborghini Countach LP5000 Quattrovalvole. Believed to be the first nut-and-bolt restoration project ever undertaken by Lamborghini, years before the creation of their official heritage department, Polo Storico, in 2015, this Countach LP5000 QV represents a unique chapter in Lamborghini history. This 1986 Countach Quattrovalvole, finished in Rosso over Champagne with a Brown dashboard, was originally delivered on April 17, 1986, to a dealership called Autolynn in Oakville, Ontario, Canada. It was equipped with fuel injection to comply with North American emissions regulations and featured USA-specific bumpers. In the summer of 1988, the car was owned by a real estate agent who, after an afternoon drive, parked it in his driveway. Later that day, smoke began to emanate from the engine bay, ultimately igniting a fire that damaged the engine, body panels, and interior, scorching the seats and causing significant smoke damage. Deemed a write-off by the insurance company due to the scarcity and cost of replacement parts, the car seemed destined for obscurity—until the current custodian, a Canadian collector with a deep passion for the Countach, entered the picture. The search for parts was arduous. “I called every Lamborghini dealer in North America, faxed lists, and made countless calls, only to be told that parts were unavailable or would take months to arrive,” the owner recounted. “The factory had shifted focus to the new Diablo, making Countach components nearly impossible to find.” Then, an unexpected call came from a Toronto lawyer representing Lamborghini. The company, aware of his search through multiple inquiries across North America, wanted to inspect the salvaged parts. By 1989, he shipped the car to Milan. Lamborghini’s sales manager, Ubaldo Sgarzi, responded within a week of the car's arrival, confirming receipt and outlining plans to prepare an estimate for the restoration. With the production line for the Countach already dismantled, many parts had to be handmade or specially ordered from original suppliers. The extensive project took two and a half years and cost over USD $240,000— $30,000 more than the price of a new Diablo at the time. “The documentation is immense,” says the owner. Invoices, receipts, and correspondence attest to what was essentially a full rebuild. This restoration stands as a landmark: the first comprehensive restoration carried out by Lamborghini itself, years before the establishment of their official heritage department, Polo Storico, in 2015.   Continue...",
    "author": "",
    "published": "Thu, 07 Nov 2024 22:52:05 +0000",
    "image": "https://petrolicious.com/wp-content/uploads/2024/11/Countach-Petrolicious-13-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "00904194-651b-40dd-af60-485c5d34f75a",
    "title": "Full Throtl: A Fast \u0026 Furious-Inspired R34 Drag Machine",
    "link": "https://www.speedhunters.com/2024/11/a-fast-and-furious-inspired-r34-drag-machine/",
    "description": "If you don’t have even the smallest soft spot for an R34 Nissan Skyline GT-R, I’m calling bulls**t, respectfully. There’s no way you were a car enthusiast in the 2000s without fond memories of Need for Speed: Underground, 2 Fast 2 Furious, or some grainy YouTube clip of gold Top Secret or white Mine’s GT-Rs […] The post Full Throtl: A Fast \u0026 Furious-Inspired R34 Drag Machine appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Wed, 20 Nov 2024 02:00:35 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Car Spotlight",
      "Content",
      "Build",
      "CSF",
      "CSF Race",
      "er34",
      "GT-R",
      "GT-t",
      "gtr",
      "GTT",
      "Nissan",
      "R34",
      "SEMA",
      "SEMA 2024",
      "SEMA Show",
      "SEMA Show 2024",
      "Skyline",
      "Throtl"
    ]
  },
  {
    "id": "72f304eb-7792-424d-bcac-caffa8a1c90c",
    "title": "Beyond Storage: The Ultimate Dream Garage Space",
    "link": "https://www.speedhunters.com/2024/11/the-ultimate-dream-garage-space/",
    "description": "If you’re a long-time Speedhunters reader, you’ll know that I have a deep fascination with car spaces. I’m always excited to see how enthusiasts from around the world blend their love for cars with their passion for architecture. I’ve made a point to visit as many private car-centric spaces as possible since first checking out […] The post Beyond Storage: The Ultimate Dream Garage Space appeared first on Speedhunters.",
    "author": "Dino Dalle Carbonare",
    "published": "Tue, 19 Nov 2024 01:30:09 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Garage",
      "Garage House",
      "Garage Space",
      "indonesia",
      "Jakarta",
      "JDM",
      "JEDM Garage",
      "mancave",
      "Supercars"
    ]
  },
  {
    "id": "8c3511d4-25a3-4f37-bb48-0f4910b94f06",
    "title": "View Exterior Photos of the 2025 Hyundai Ioniq 9",
    "link": "https://www.caranddriver.com/photos/g62897072/2025-hyundai-ioniq-9-exterior-gallery/",
    "description": "See exterior photos of Hyundai's first electric three-row SUV, the 2025 Ioniq 9, which offers a battery-powered alternative to the Hyundai Palisade.",
    "author": "",
    "published": "Thu, 21 Nov 2024 01:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "f6e8c35e-2b5c-4823-ab5e-4e7d2b02204a",
    "title": "View Exterior Photos of the 2025 Volkswagen Tiguan",
    "link": "https://www.caranddriver.com/photos/g62954961/2025-volkswagen-tiguan-exterior-gallery/",
    "description": "Get a full view of the 2025 Volkswagen Tiguan in these exterior photos.",
    "author": "",
    "published": "Thu, 21 Nov 2024 01:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "f91121b7-ddfd-44a5-93c1-57395ef08669",
    "title": "2025 Volkswagen Tiguan: Style Standing Out",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/2025-volkswagen-tiguan-style-standing-out-44510380?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "The 2025 Volkswagen Tiguan sheds the boxy, unremarkable skin of the last-generation vehicle for something that is more than little bolder.",
    "author": "Tim Healey",
    "published": "Thu, 21 Nov 2024 01:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/11/20/161023/2025-volkswagen-tiguan-style-standing-out.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "cd119d61-4879-427f-a393-c89b00c3b7b2",
    "title": "QOTD: What Are You Looking Forward to From the 2024 Los Angeles Auto Show?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-what-are-you-looking-forward-to-from-the-2024-los-angeles-auto-show-44510407?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Tomorrow is the media day for the 2024 Los Angeles Auto Show. What are you looking forward to hearing about from the show?",
    "author": "Tim Healey",
    "published": "Wed, 20 Nov 2024 23:02:29 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/11/20/18011/qotd-what-are-you-looking-forward-to-from-the-2024-los-angeles-auto-show.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "15a7df13-4fe4-44e2-8acd-9d7d2dfeb96f",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "d0cfca1b-2745-4e7c-9828-78dc81f0cd51",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  }
]
