[
  {
    "id": "e2d29c3f-8333-46e5-b6e9-ce383beaee89",
    "title": "1990 Lamborghini Countach 25th Anniversary",
    "link": "https://bringatrailer.com/listing/1990-lamborghini-countach-25th-anniversary-2/",
    "description": "This 1990 Lamborghini Countach is one of approximately 658 examples of the 25th Anniversary variant built over a three-year production run. Chassis 12897 is said to have remained with the original owner in Canada through 2020 before being brought to the US. The car is finished in Rosso over Panna leather and powered by a 5.2-liter quad-cam V12 linked with a five-speed manual transmission and a limited-slip differential. Further equipment includes pop-up headlights, scissor doors, and 15\" OZ Racing multi-piece wheels along with a gated shifter, electronic climate control, and an Alpine stereo. Now showing 6k kilometers (~4k miles), this 25th Anniversary Countach is offered by the selling dealer in Illinois with an owner's manual, a collection of luggage, and a Montana title.",
    "author": "bringatrailer",
    "published": "Tue, 25 Mar 2025 00:00:12 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/01/1990_lamborghini_countach-25th-anniversary_dsc_6498-hdr-enhanced-nr-82608.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "019a0dd9-075b-48ee-a5ac-4b9225778db0",
    "title": "2018 McLaren 720S Luxury Coupe",
    "link": "https://bringatrailer.com/listing/2018-mclaren-720s-coupe-15/",
    "description": "This 2018 McLaren 720S Luxury coupe is finished in Glacier White over Arizona Tan luxury leather upholstery and is powered by a twin-turbocharged 4.0-liter V8 mated to a seven-speed dual-clutch transaxle. Equipment includes the Carbon Fiber Primary Interior Components package, the Exterior Carbon Fiber Pack 1, a vehicle-lift system, an active rear spoiler, carbon-ceramic brakes, dihedral soft close doors, and a touchscreen infotainment system with navigation and Bluetooth connectivity. Purchased by the current owner in 2024, this 720S is offered in Colorado with a clean Carfax report and a clean Montana title in the name of the owner's LLC.",
    "author": "bringatrailer",
    "published": "Mon, 24 Mar 2025 23:55:06 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/03/2018_mclaren_720s-coupe_img_2456-96760.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "3893bf52-f241-441e-a62a-8bee80f1badf",
    "title": "Lamborghini Made More Cash Than Ever in 2024",
    "link": "https://www.autoblog.com/news/lamborghini-made-more-cash-than-ever-in-2024",
    "description": "Every year since around 2011, Lamborghini has proudly proclaimed \"record-breaking deliveries,\" with the brand finally cresting 10,000 units sold globally in 2023. It may not be surprising, then, to learn that 2024 was the brand's crowning achievement—so far—and saw it not only shatter records for ...",
    "author": "Steven Paul",
    "published": "Tue, 25 Mar 2025 00:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODg0NzE0/stephan-winkelmann---chairman-and-ceo-of-lamborghini.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "SUV",
      "News",
      "Supercars",
      "Coupe",
      "Lamborghini"
    ]
  },
  {
    "id": "d41c5478-8c9f-433e-a65b-30c04a1f7e11",
    "title": "The Ram Power Wagon Could Get a Diesel Engine - Eventually",
    "link": "https://www.autoblog.com/news/the-ram-power-wagon-could-get-a-diesel-engine-eventually",
    "description": "The Ram Power Wagon is the automaker’s heftiest version of its heavy-duty pickup truck, but with one huge caveat: there is no diesel engine available. According to a Ram powertrain engineer, though, that could change in the future. Granted, the available V8 engine is a Hemi, but it still doesn’t ...",
    "author": "Joseph Pudlewski",
    "published": "Mon, 24 Mar 2025 20:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODg0Nzcz/2025-ram-power-wagon.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "2025",
      "Truck",
      "News",
      "power wagon",
      "RAM"
    ]
  },
  {
    "id": "59f9eb40-41d7-469d-b47c-5eb39f7f17b1",
    "title": "2025 BMW X3 Recall: Leaky Brake Hoses Could Impact Safety Systems",
    "link": "https://www.bmwblog.com/2025/03/24/bmw-2025-x3-recall-brake-hose-leak/",
    "description": "BMW of North America has issued a recall for certain 2025 BMW X3 models after discovering a potential defect with the rear brake hoses that could compromise braking performance and safety systems. The recall affects... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Mon, 24 Mar 2025 18:43:28 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/03/2025-BMW-X3-30e-xDrive-66-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW X3",
      "2025 BMW X3",
      "BMW recall",
      "BMW X3 M50"
    ]
  },
  {
    "id": "679a7ff8-c3ae-4255-bf37-3b77e81a6cc4",
    "title": "50 Years of the BMW 3 Series: The G20 (Seventh Generation)",
    "link": "https://www.bmwblog.com/2025/03/24/g20-bmw-3-series-review-performance-luxury-tech-2025/",
    "description": "BMW is celebrating the 50th anniversary of the 3 Series this year, so we at BMWBLOG are delving into the model’s storied history and its contribution to the automaker’s success. We’ve already looked at the... First published by https://www.bmwblog.com",
    "author": "Surya Solanki",
    "published": "Mon, 24 Mar 2025 18:34:19 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2019/03/BMW-G20-3-SERIES-Portimao-Blue-85-830x554.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "3 Series",
      "50 Years BMW 3 Series",
      "G20",
      "M340i"
    ]
  },
  {
    "id": "ec90f23d-2f82-4e39-bcb1-f02bf435488a",
    "title": "Future/Primitive: Origins of a Mysterious Ducati SportClassic",
    "link": "https://www.bikeexif.com/jane-ducati-sport-classic-custom",
    "description": "As a photographer, I’m always looking for strange and obscure things to shoot. I’d heard about this place in Brooklyn called Jane – a shop that had custom motorcycles, specialty coffee, and apparel – and as a moto enthusiast, I had to check it out. What I found inside was one of the most interesting incarnations of a Ducati I’d ever seen. It looked like a WWII-era P-51 Mustang fighter plane on two wheels. Bright blocks of colored paint made up the bodywork while it was adorned with intricate details of gold. It was bold, brash, and sexy. Adam and Alex, the owners of Jane, didn’t have much information beyond the fact that the bike was on consignment for the current owner, who wanted to remain anonymous.…",
    "author": "Iron and Air",
    "published": "Mon, 24 Mar 2025 17:00:58 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/03/ducati-sport-classic-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Featured Bikes",
      "Ducati",
      "Ducati SportClassic"
    ]
  },
  {
    "id": "161c8890-5038-4b1a-a809-aaef21d3466e",
    "title": "Speed Read: A neo-punk Yamaha XSR700 from Lisbon and more",
    "link": "https://www.bikeexif.com/custom-motorcycle-news-march-23-2025",
    "description": "We’ve cast our net wide this week to bring you four very different motorcycles from four different countries. Portugal offers up a Yamaha XSR700 street scrambler, Canada sends us a tasty Honda CB750 restomod, and Italy shows off the new Ducati Panigale V4 Tricolore Italia. Finally, we ogle an as-new 1991 Bimota TESI 1D 904 SR from New York, USA. Yamaha XSR700 by Unik Edition Deeply embedded in Lisbon’s buzzing custom motorcycle scene, Loek Janssen has a bike for every occasion—including a KTM 450 EXC-F in supermoto trim and a 1981 BMW R100 street scrambler. He’s just added this Yamaha XSR700 to his stable, to make sure all his bases are covered. Loek’s vision for the XSR was to have a bike he could scoot around the city with daily, and point down the occasional fire road whenever the craving hits.…",
    "author": "Wesley Reyneke",
    "published": "Sun, 23 Mar 2025 19:09:26 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/03/custom-motorcycle-news-225.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Latest Motorcycle News",
      "Honda CB750",
      "Restomod",
      "Scramblers",
      "Unik Edition",
      "Yamaha motorcycles",
      "Yamaha XSR700"
    ]
  },
  {
    "id": "7ef4da91-bf0b-43ed-8d10-7f00f6690ecf",
    "title": "Mild-hybrid diesel Toyota Hilux goes on sale at £49,640",
    "link": "https://www.autocar.co.uk/car-news/new-cars/mild-hybrid-diesel-toyota-hilux-goes-sale-%C2%A349640",
    "description": "Electrical assistance reduces engine idle speed from 720rpm to 600rpm Electrical assistance is said to improve engine's refinement and responsiveness without hurting truck's capabilities A new mild-hybrid diesel Toyota Hilux has gone on sale in the UK, priced from £49,640, with the brand claiming it offers the same capabilities as its regular counterpart plus better refinement and responsiveness. It uses the same 2.8-litre turbo diesel four that was already offered in the Hilux but adds an electric motor-generator and a 48V lithium ion battery, reducing the stress on the engine. For example, the electrical assistance reduces the engine’s idle speed from 720rpm to 600rpm and can supply a significant portion of the power needed to maintain a steady cruise. Its rapid power delivery compared with the diesel lump is also claimed to improve controllability in off-roading. The mild hybrid has been designed to offer the same capabilities as regular Hiluxes, such as the ability to wade through water measuring 700mm deep. It has six drive modes for off-roading, including one for rock crawling, one for deep snow and another for muddy roads. Its total outputs are rated at 201bhp and 369lb ft, delivered to each corner through a six-speed automatic gearbox. It takes 10.7sec to complete the 0-62mph sprint and its payload and towing capacities are unaffected at 1000kg and 3500kg. The new engine is available solely on the range-topping Hilux Invincible X Double Cab – which will be treated as a company car for benefit-in-kind tax purposes from 6 April 2025, as will all other new double-cab pick-ups with a payload of more than 1000kg. With CO2 emissions of 265g/km, it will land in the very top BIK bracket of 37%. This means that, for those in the 40% income tax bracket, it will cost £7289 in BIK – almost double the previous flat rate of £3960.",
    "author": "",
    "published": "Mon, 24 Mar 2025 16:13:26 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/2025-toyota-hilux-mild-hybrid-front-quarter.jpg?itok=l4krB_Xj",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "625a90b4-cf98-4198-b02a-fab5685020ce",
    "title": "Renault to revive 'Fast and Furious cars' as it taps into retro",
    "link": "https://www.autocar.co.uk/car-news/new-cars/renault-revive-fast-and-furious-cars-it-taps-retro",
    "description": "Van den Acker said now is the time for 70s/80s cars and in 10 years we could see the 90s and 00s return Chief designer believes in “window of opportunity” to create more \"cool\" retro revivals after 5 Turbo 3E Renault will continue to tap into its back catalogue with plans to revive iconic \"Fast and Furious cars\" of the 1990s and early 2000s. Speaking at the launch of the new Renault 5 Turbo 3E, group design chief Laurens van den Acker said he believes there is “a window of opportunity” for more desirable retro revivals, like the Renault 4 and Renault 5. “If you wait too long, people have forgotten about them”, he said. “If you're too early, it's still not cool enough. \"Ten years ago, we did the [Alpine] A110. It was perfect, because it was a '50s, '60s kind of car, and we said 'we need to do this car now, because if we wait 10 years, they will all be gone'. “And I think now is the time for '70s, '80s [cars], and in 10 years time we will be doing 'Fast and Furious' cars.\" Giving us a flavour of the kind of cars to expect on our roads in the future, van den Acker said: “We will be doing Subarus, Hondas, Datsuns, [Volkswagen] Golf GTIs”, before explaining that the models “grow with the people.\" This strategy could result in a revival of cars such as the Clio V6 or even the Sport Spider, both of which were rear-driven and could potentially be underpinned by the all-aluminum, rear-driven electric car platform under the 5 Turbo 3E. Van den Acker explained that revivals of cars like this could be achieved thanks to the changing relationship between engineers and designers at the Renault Group. \"The times where designers and engineers were enemies are long past,” he said. “Now we work together like never before, and it's the way to go, because that makes this sort of stuff happen.\" The launch of the 5 Turbo 3E is the latest in a series of retro revivals from the French firm and comes as part of van den Acker’s overall vision for its future models. Summing it up, he said he wants to “make the best of the past and the best of the future”.",
    "author": "",
    "published": "Mon, 24 Mar 2025 12:47:59 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/renault-5-turbo-3e-front_0.jpg?itok=mrAYV4Sg",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "c7ed2961-9b06-4949-b21d-8217d08f528e",
    "title": "Cadillac Is Already Discounting The 2026 Vistiq EV",
    "link": "https://www.carscoops.com/2025/03/2026-cadillac-vistiq-ev-already-being-discounted/",
    "description": "The Vistiq is making its way towards dealers with a $2,000 cash allowance",
    "author": "Michael Gauthier",
    "published": "Tue, 25 Mar 2025 00:30:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/03/2026-Cadillac-Vistiq-EV-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Cadillac",
      "Cadillac Vistiq",
      "Electric Vehicles"
    ]
  },
  {
    "id": "d7af458a-1f97-4e4a-a78f-1d97e9d8a00f",
    "title": "Thieves Steal 8 New Corvettes From GM’s Factory, Drop Them Off At Lowe’s",
    "link": "https://www.carscoops.com/2025/03/eight-corvettes-stolen-from-gms-bowling-green-plant-including-a-new-zr-1/",
    "description": "Police eventually recovered all of the cars after someone spotted the red ZR-1 parked close to the factory",
    "author": "Stephen Rivers",
    "published": "Mon, 24 Mar 2025 23:51:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/03/2025-stingray-extgal-22rrr-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Corvette",
      "GM",
      "Offbeat News",
      "Police",
      "Reports"
    ]
  },
  {
    "id": "ff499f3d-4e9c-4d40-ba65-ab76fad01fb8",
    "title": "I Had To See This Awful Elon Musk Song Performed In A Cybertruck, So Now All Of You Do Too",
    "link": "https://www.jalopnik.com/1818507/elon-musk-song-tesla-cybertruck-music-video/",
    "description": "There's no way someone would just put a music video shot in a Cybertruck that's about how great Elon Musk is on the internet, right?",
    "author": "Collin Woodard",
    "published": "Mon, 24 Mar 2025 22:33:27 +0000",
    "image": "https://www.jalopnik.com/img/gallery/i-had-to-see-this-awful-elon-musk-song-performed-in-a-cybertruck-so-now-all-of-you-do-too/l-intro-1742855328.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Tesla",
      "Entertainment"
    ]
  },
  {
    "id": "813c438a-b507-4a2f-9803-01c8fb0d2c15",
    "title": "Toyota's Will Vi Was Designed Like Cinderella's Carriage To Appeal To Young People, And You Can Bid On This One",
    "link": "https://www.jalopnik.com/1818493/2000-toyota-will-vi-for-sale-bring-a-trailer/",
    "description": "Toyota launched its JDM WiLL sub-brand as a partnership with several other Japanese companies specifically intended to appeal to young buyers",
    "author": "Logan K. Carter",
    "published": "Mon, 24 Mar 2025 22:04:05 +0000",
    "image": "https://www.jalopnik.com/img/gallery/toyotas-will-vi-was-designed-like-cinderellas-carriage-to-appeal-to-young-people-and-you-can-bid-on-this-one/l-intro-1742853797.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Found For Sale",
      "Car Design"
    ]
  },
  {
    "id": "0cb243ae-bd1c-4286-aee1-8346ac017ba6",
    "title": "2026 Chevy Corvette Zora's Cabin Ditches the Wall of Buttons in Spy Photos",
    "link": "https://www.caranddriver.com/news/a64276249/2026-chevy-corvette-zora-cabin-spy-photos/",
    "description": "New spy photos of the 2026 Corvette Zora reveal an airier cabin that appears to move away from the snug, fighter-jet-style cockpit and includes a bigger screen.",
    "author": "",
    "published": "Mon, 24 Mar 2025 19:47:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "a190c8a3-dafd-405c-9173-5761aeb2f5d1",
    "title": "California Now Has Nearly 50 Percent More EV Plugs Than Gas Pumps",
    "link": "https://www.caranddriver.com/news/a64272691/california-more-ev-plugs-than-gas-pumps/",
    "description": "And that's just public chargers. Add single-family home chargers to the mix, and EV plugs outnumber gas pumps by more than seven times, the state government boasts.",
    "author": "",
    "published": "Mon, 24 Mar 2025 16:12:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "3e00b7fb-3b27-40ff-bd53-6f9dbb210385",
    "title": "Porsche Macan Turbo Electric review: As close as it gets to ICE",
    "link": "https://www.autocarindia.com/car-reviews/porsche-macan-turbo-electric-review-as-close-as-it-gets-to-ice-434892#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "It’s an SUV that doesn’t just drive brilliantly ‘for an SUV’, but one that, in true Porsche fashion, drives brilliantly, period. It’s a defining moment for Porsche and a risky one, too. The legendary German sports car maker has taken a proven and successful formula, torn it up and rewritten it – with lithium. Porsche has electrified its bestselling Macan, which, since its debut in 2014, has been the compact performance SUV benchmark. But, with a pair of motors replacing engines, including the much-loved V6, and a heavy battery pack slung underneath the floor, the question is, does the Macan Electric still feel like a proper Porsche? The litmus, er, lithium test is a quick dash to Mahabaleshwar. Porsche Macan Turbo Electric platform and exterior Built on the PPE base It’s important to note that the Macan Electric has nothing in common with its combustion-powered predecessors. Porsche has ditched the ICE platform and moved to the all-new Premium Platform Electric (PPE), which has been co-developed with Audi. Without the constraints of an engine up front, designers had a freer hand in the styling, but yet, from the outside, the Macan Electric is unmistakably a Macan. Signature four-point DRLs look great. The signature four-point LED daytime running lamps remain, but the full-width rear light bar is now slimmer and more pronounced. A key differentiator is the Macan EV’s proportions. The lowered nose, short overhangs, longer wheelbase (up by 86mm), and slightly wider track help improve aerodynamics (down to a slippery 0.25Cd) while giving it a more hunkered-down look. The Taycan-inspired front end and the subtly integrated active aerodynamics (including adaptive air curtains and a deployable rear spoiler) mark it out as a performance SUV even before you step inside. Porsche Macan Turbo Electric interior features Three screen-layout shared with Panamera The interior remains reassuringly familiar and is unmistakably Porsche – superbly built and driver-focused. Material quality is top-notch, with leather, brushed aluminium and soft-touch plastics that deliver a premium ambience. However, the gloss-black surfaces are prone to fingerprints. Infotainment is intuitive, logical and easy to navigate. The driving position remains spot on, thanks to 18-way adjustable front seats, which offer fantastic support and even a massage function – a first for the Macan. Dominating the dashboard is a trio of screens similar to the Panamera: a 12.6-inch digital instrument cluster, a 10.9-inch touchscreen in the centre, and an optional passenger display of the same size – a Rs 1 lakh upgrade. It’s a crisp, clean and well-integrated layout, maintaining the minimalist elegance Porsche is known for. The infotainment system is superb – logically laid out, sharp in resolution and not overrun with an excess of apps. Apple CarPlay is not wireless Porsche has also struck a happy balance between digital screens and physical controls. Unlike many rivals that have gone fully touchscreen, the Macan retains some key physical buttons – most notably for climate control. This ensures that adjusting basic settings remains easy and intuitive. However, there are some surprising omissions. Wireless Apple CarPlay, a feature expected at this price point, is absent and requires a wired connection. This wouldn’t be a major issue if not for the awkwardly placed USB-C ports on the left side of the centre console, which are hidden from view and difficult to access in the right-hand-drive versions. The rear seat isn’t particularly generous despite a longer wheelbase. Also, the rear seats, while benefiting from the Macan Electric’s 86mm longer wheelbase, aren’t particularly generous. The legroom is decent, but the high window line, coupled with the sloping roof, gives the back a slightly claustrophobic feel. Taller passengers will find headroom just adequate, and the knee-up seating position – common in EVs due to battery packaging – is noticeable but not objectionable. The panoramic sunroof helps brighten things up, but the Macan remains more of a driver’s car than a rear-seat-friendly SUV. The small 84-litre frunk is useful for stowing charging cables but not much else. With no engine up front, the Macan Electric offers a small 84-litre frunk – useful for stowing charging cables but not much else. The rear boot is well-shaped and reasonably spacious at 480 litres in the Turbo variant, though lower-spec models offer a more generous 540 litres. Folding the rear seats expands cargo capacity. Overall, the Macan Electric’s cabin stays true to Porsche’s ethos – driver-focused, high-quality and functional – without succumbing entirely to the touch-only trend that plagues many modern EVs. Porsche Macan Turbo Electric performance and ride 0-100kph takes 3.3 seconds Four drive modes on offer. The Macan Electric has debuted in India with the top-of-the-line Turbo, which has a dual-motor, all- wheel-drive setup. Lower variants like the Macan 4 and Macan 4S with rear-wheel drive are yet to be available. Straight-line performance is where the Macan Turbo Electric feels utterly ballistic. With up to 639hp and 1,130Nm of torque, it delivers the kind of acceleration – the claimed 0 to 100kph time is 3.3 seconds – that can humble supercars. Engage Sport+ mode, activate launch control, and the Macan Electric catapults forward as if fired out of a cannon. 260kph top speed While some EVs struggle to sustain their initial surge, the Macan Electric maintains its ferocity well beyond the first few seconds, and given the space, the Turbo can crack 250kph. Porsche’s sophisticated thermal management ensures that performance remains consistent, even after repeated hard acceleration runs. As a result, the performance is always effortless, relentless and completely addictive. Macan EV perfectly balances performance and practicality, making for a great daily driver. And it’s not just heart-stopping acceleration that is the Macan Electric’s forte. Like most high-powered EVs, it blends performance with daily usability. Unlike high-strung ICE-powered performance SUVs that tend to feel jerky and restless in traffic, the Macan Electric is buttery smooth. Thanks to the absence of a traditional gearbox and the instant torque delivery of its electric motors, crawling through traffic is smooth and seamless. Ride is stiff but not uncomfortable However, despite this city-friendly character, the ride remains firmly on the stiffer side. It isn’t uncomfortable, but there’s no escaping the underlying firmness, particularly at low speeds. Comfort- seekers may find this a little intrusive, but Porsche enthusiasts will appreciate the taut setup. Road noise also creeps into the cabin, especially at speed over coarse tarmac, which slightly dampens the otherwise refined experience. On the patchy NH66, which has bumpy concrete surfacing for most parts, it’s deafeningly obvious that Porsche hasn’t been generous with sound insulation, but that’s more to do with saving weight than saving money. The sound I do like is the synthesised ‘engine’ growl that’s electronically induced. It’s neither obtrusive nor over the top – just enough to add a layer of aural engagement without feeling forced. In contrast to some artificial, gimmicky EV soundtracks, Porsche has taken a more subtle approach. 591km claimed range Battery-cooling fan kicks up a dust storm. Range anxiety is often a concern with EVs, but the Macan Turbo Electric has addressed this with a large 100kWh battery, of which 95kWh is useable. After a full day of spirited driving, including high-speed runs and a 4,500-foot elevation climb, it still had 31% charge remaining. Given its claimed 591km range, the battery’s real-world performance is reassuring. Charging speed is where the Macan Electric truly shines. Thanks to its 800-volt system, it can charge at up to 270kW, but the challenge is finding such high-speed chargers in India, where the fast-charging network mainly consists of 30kW to 60kW units. Porsche Macan Turbo Electric handling Sharp and precise steering The steering is sharp and precise, with a level of feedback that most EVs lack. One of the biggest challenges in transitioning to an electric platform is weight, and at nearly 400kg heavier than the Macan GTS, the Macan Electric isn’t exactly light. Yet, you’d never guess it from the way it handles. On the twisty Ambenali Ghat, the Macan Electric is an absolute delight to thread through corners. It’s quick to change direction and delivers an uncanny sense of precision despite its mass. Performance is effortless and completely addictive.  Its near-perfect 48:52 front-to-rear weight distribution and strong rear motor create a rear-engine-like balance, allowing it to rotate beautifully into corners, and with the traction control off, it’s easy to get the tail out for some sideways action. The rear-axle steering (a costly but worthwhile option at Rs 2.70 lakh) further enhances its dynamic prowess, making it feel far smaller and nimbler than its size suggests. Grip levels and the overall body control are outstanding, thanks to a low centre of gravity courtesy of the floor-mounted battery. The all-wheel-drive system ensures unwavering stability, even when pushing hard. The Macan Electric is quick to change direction despite its mass. The steering is one of the best in any EV – sharp, precise and with a level of feedback most electric cars lack. It’s on the heavier side at parking speeds, but that’s a small price to pay for its dynamic edge. Regen braking does not feel aggressive Porsche has also nailed the braking feel. Unlike many EVs with an artificial, grabby ‘regenerative’ braking sensation, the Macan Electric’s brakes feel natural and progressive. There are no paddles to manually adjust regen on the fly – just two settings, ‘on’ and ‘off’, which can be accessed via the touchscreen or assigned to a shortcut key on the steering wheel. When engaged, the regen remains mild and unobtrusive, ensuring smooth and predictable deceleration rather than aggressive one-pedal driving. True to Porsche’s philosophy, the Macan Electric is tuned to feel like a proper driver’s car, recovering energy efficiently without compromising its dynamic character. Porsche Macan Turbo Electric price and verdict Macan Electric isn’t just an electrified version of a traditional SUV but more of a sports car engineered into an SUV body. The Macan Turbo Electric isn’t just another fast electric SUV; it’s a true Porsche. It feels natural, intuitive and engaging in a way that many EVs don’t. It doesn’t come across as an electrified version of a traditional SUV but rather a sports car engineered into an SUV body. Sure, it lacks the mechanical soul of an ICE – the visceral sound of an engine, the ebb and flow of power, and the rhythm of shifting gears – but it makes up for it with instant torque, razor-sharp responses and a level of precision that set it apart. Yes, the rear seats could be more spacious, but none of that matters when you’re behind the wheel. What matters is that this EV delivers the same thrilling experience as its petrol-powered predecessor, and in some ways, even better. Like most Porsches, the Macan Turbo Electric, too, is pricey, at Rs 1.68 crore. But that won’t stop many Porsche aficionados from queuing up for one. Also, see: Porsche Taycan Turbo, Turbo S facelift review: Turbo-charged 2025 Rolls Royce Cullinan review: The Godfather of SUVs 2026 Audi Q5 review: Back to business",
    "author": "Hormazd Sorabjee",
    "published": "Mon, 24 Mar 2025 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250321080658_Porsche_Macan_Electric_Front_Quarter_Static.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "23b713e2-dd32-463e-a8d7-5b7c3ceab401",
    "title": "BMW iX long term review, 2,500km report",
    "link": "https://www.autocarindia.com/car-long-termer/bmw-ix-long-term-review-2500km-report-434889#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Between our long-term i7 and iX, it was the latter that everyone was after, but I still managed to hang on to the iX for over a month, and what an interesting month it was! Living with a large car as your daily driver in Mumbai is challenging. Every time I couldn’t squeeze through a narrow gap in traffic or find a parking space long enough, I missed having a smaller car. But beyond that, it proved its mettle. When the iX xDrive50 replaced the xDrive40 in BMW’s range, it got air springs as standard. The previous car’s coil springs delivered a superb ride, but the air springs offer an even greater degree of flexibility at both ends of the ride spectrum. The softer end is what I called on most often for tackling Mumbai’s minty-fresh dug-up roads. The ride was very good, and I have to add, without wallow, too, given, of course, the relatively low speeds the chaotic city roads allowed for. The spare tyre in the boot limits space; the parcel screen needs to be removed to stack more bags. The other bit I loved was the powertrain. The xDrive50 saw power go up from 326hp to a massive 523hp, with torque rising from 630Nm to 765Nm. This increase in power has not corroded the powertrain’s modularity, though. Stay away from Sport mode, and the car is quite relaxed to drive; and should you find that miraculous open stretch, power is a quick prod of the accelerator away. During a few long stints stuck in traffic, the comfy cabin was a nice space to be in. My daughter thought the rear seats were spot on for comfort, and my wife thought it was just superb, but I felt the backrest was a tad upright. The glass roof that can switch from translucent to transparent at the press of a button was also a big hit with friends. However, given that it lacks a fabric screen, I would like to see how it performs in keeping the heat out in peak summers. Right now, in Mumbai, we’re enjoying cooler days with lows in the early 20s, and before you Delhi folk laugh, let me assure you that is cool for anyone from here. The crystal-cut iDrive dial looks super, but at certain angles, it dazzles you with reflected sunlight. On to bits I didn’t like, the steering wheel is one. Perhaps it is a small matter, but it never felt right to me. After completing a turn, I like to let the wheel naturally return to the centre, and when it does that, the irregular, hexagonal shape of the wheel feels very odd while running through my palms. Another small irritant is the crystal iDrive dial. It looks lovely, as do other glassy bits like the seat-adjustment buttons, but the dial and the surrounding gloss panel reflect light very harshly at certain angles. Every morning, when headed to work, a particular stretch of road would always have the sun glinting straight at me. Besides these niggles, a bigger matter was the spare tyre in the boot. Picking up my son and his friends at the train station, we had to remove the parcel screen to fit in three large suitcases, and you have to be mindful not to load it above the head restraints. With the parcel screen in place, you’ll be able to fit only one big bag and perhaps a smaller carry-on. Handy mobile holder has a neat slot below, allowing you to pass a wire through to the USBs below. Back to the changes on the iX xDrive50, the biggest one is the larger 111.5kWh battery, up from 76.6kWh – a massive jump. And while I didn’t stretch that range out on a long drive, the benefit was not having to charge it often. In our instrumented real-world range test, we got a range of 504km (city and highway). This meant that with my usage, all within Mumbai city limits, I was charging it every two weeks with an indicated range of about 530km. So, all in all, it’s been a nice, comfy and easy-on-the-pocket month spent with the iX. I never thought I’d say that of a BMW. Given the handy spaces all around, the glovebox is oddly small and impractical to use. Also see: BMW iX xDrive50 review: More power, more range, more features BMW iX facelift revealed with more power, improved range New BMW iX3 design previewed by Neue Klasse X prototype",
    "author": "Sergius Barretto",
    "published": "Sun, 23 Mar 2025 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250320120030_BMW_iX_long_term_review_rear_static.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "e5b8a0b5-2bd9-46ee-8ab5-d4c556662336",
    "title": "Honda Activa e video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/honda-activa-e-video-review-434919#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: Honda Activa e review: promising EV, just not today",
    "author": "Dinshaw Magol",
    "published": "Mon, 24 Mar 2025 18:03:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250324060334_YT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "07295fb5-fe9b-47a6-b93b-ce40c496049d",
    "title": "Honda QC1 video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/honda-qc1-video-review-434918#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: Honda QC1 review: affordable but compromised Japanese EV",
    "author": "Dinshaw Magol",
    "published": "Mon, 24 Mar 2025 14:04:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250324020405_YT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "0586b40f-4740-421d-93b8-fcb9a7ab7b03",
    "title": "Daytona Vice",
    "link": "",
    "description": "If you replace every trim piece, every nut and bolt of a car, is it still the same car? This concept, (but swap car parts for nails, shiplap, and strakes) was first explored by the ancient Greek philosopher Plutarch, who opined on what became known as the Ship of Theseus paradox. In ancient writings he described how the Athenians preserved Theseus' ship by replacing its sacred wooden bits piece by piece, keeping it afloat perpetually. Theseus himself was a hero who valiantly and selflessly slew a Minotaur and navigated a twisting Labyrinth to save his people. His ship was not just a vessel, it was a symbol of triumph, endurance, and Athenian moxy. As its planks aged and were replaced, the Athenians were not merely maintaining a ship, they were keeping Theseus' legacy alive. And so the ages old debate began: if every part is replaced, does the identity remain? The question has lingered for centuries, not because it demands an answer, but because there isn’t one. The Athenians didn’t preserve Theseus’ ship because it was just a vibey cool looking boat. They preserved it because it meant something, because it was a vessel for a story too important to be lost. Theseus had moved beyond his life into folklore legend. For an automotive enthusiast, the Ferrari Daytona carries that same weight. It's one of our legends. For some, it is akin to an automotive sacred cow.  Either way, its fair to say that everyone can admit it is more than just another Ferrari. It is a machine born from victory and rebellion. It’s from an era of excess, flair, and audacity that would never come again. To erase imperfections, as we often do when things are over-restored beyond what they ever were, often means we erase the proof that the car had ever lived its own story. Machines, when used, aren’t just a sum of their parts. They carry history, wear, and the quiet fingerprints of every mile traveled. A Ferrari Daytona Spyder, already steeped in myth, should feel like a portal back to the moment it first rolled onto the streets. But what happens when every inch of it is refreshed, repainted, and reimagined?  That’s the battle at the heart of Camillo Mekacher-Vogel’s Ferrari Daytona Spyder. A Fly Yellow, one of one European spec Daytona, delivered new to a royal family in the Middle East before vanishing into obscurity. When it resurfaced decades later, its fate teetered on a knife’s edge. The easy path, the one so many owners take, would have been a flawless by the book restoration. Every imperfection erased, every part refreshed to be better than new. But Camillo saw something else. This car didn’t need to be perfect. It needed to be real. So began the fool’s errand against the inevitable, time, a fight not to restore but to preserve. \"We really wanted to maintain every possible original component,\" Camillo explained. \"Even the smallest details, like the original dashboard, are becoming increasingly rare in a world where everything gets over-restored.\" The safe option would have been just to replace any original component that was slightly blemished, but we wanted to keep the car as honest as possible. The judges at Cavallino understood that.\" The battle lines were clear. The engine bay, instead of being refinished into a glossy, factory fresh display, was carefully cleaned piece by piece. If someone in fifty years wants to know what an original Ferrari engine looked like, there will be very few left to show them. The dashboard, typically one of the first casualties in a restoration, remained intact, with every fragile, factory flaw left untouched. And where others would have swapped out components for pristine replacements, Camillo and team chose the harder road, keeping what was there, even if it wasn’t perfect. The car’s revival took months of careful work, bouncing between continents, its original wheels flying back and forth across the Atlantic to be properly restored in Italy, while Camillo flew between Milan and Wisconsin, where Motion Products carefully pieced the Daytona back together. Time was against them. The plan was to unveil the car at Cavallino Classic, the most prestigious Ferrari concours in the world. \"We immediately had this dream of presenting it at Cavallino,\" Camillo recalled, \"but at the same time, you have to respect an event like that and do your very best to present the car properly. We knew it was a risk, but we also knew it was the right thing to do.\" Would they understand the point? Would they see the car not as flawed, but as honest? \"\"People went wild over it,\" Camillo recalled. \"The fact that this car had been used, had been driven, had lived, it made it stand out even more among all the flawless restorations. It was a labor of love. We had the right people, the right vision, and the right car. Seeing it recognized that way, after all the effort we put into keeping it real, that was everything.\" Camillo Mekacher-Vogel’s Daytona didn’t just win. It dominated. Platinum Award, the concours equivalent of a heavyweight belt. The highest honor, certifying its authenticity and excellence. Best in Class for Ferrari Spiders. Beating flawless, fully restored examples. Gentlemen’s Choice, meaning some well dressed guys with no socks just really really liked it. A win not by technicality, but by sheer presence. The noble fight had been validated. It was never about winning outright. It was about taking a swing, about proving that some things are worth the fight even if you know time is waiting in the shadows. Every car, no matter how well kept, will need something replaced. Bolts tarnish. Leather cracks. Gas tanks rust from the inside out. But that is not death. That is maintenance. It's the cost of use. If we're passionate enough about something, as human beings we are in a unique position to be able see, and fight the entropic fade of everything we create.    But... maybe the real takeaway is that the Daytona, like any great car, isn't just valuable because of what it is, but because of what it represents. A defiance of time. Whether it is a multi million dollar Daytona or a beat up wagon on a road trip with your daughter, the real worth of a car is in the stories it collects, the people it carries, the roads it has seen, and the moments it endures. If you drink a bottle of great wine, you’ll enjoy it, but it fades into memory. (especially if you drink the whole bottle) A car, if kept alive, does more than just exist. It becomes a time machine, a vessel for memory, holding onto the stories, the people, and the moments that made it matter. Continue...",
    "author": "",
    "published": "Fri, 21 Mar 2025 11:01:36 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/03/20184020/Petrolicious-DaytonaVice-7.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "1b0e1ee4-7058-49a4-b513-ecbc62faa147",
    "title": "Ferdi Porsche on F.A.T., Porsche, and Finding the next F1 Phenom",
    "link": "",
    "description": "http://youtube.com/watch?v=7SaiVW3QfZc Photography: Rosario Liberti  In the early 1950s, a group of thrill-seekers in Zell am See, Austria, transformed their frozen lake into a playground of horsepower and daring. The inaugural Professor Ferdinand Porsche Memorial Race in 1952 saw skiers clinging to motorcycles, skijoring at breakneck speeds over the ice. This audacious blend of motorsport and winter sport marked the birth of a tradition that would see Porsche 356s and 550 Spyders sliding gracefully across the glistening surface, captivating thousands of spectators annually. The races continued until 1974, when a tragic accident halted the event, casting a shadow over the icy spectacle. Fast forward to 2019, and the frozen silence was broken by the roar of engines once more. Ferdi Porsche, great-grandson of the legendary Ferdinand Porsche, alongside his college friend Vinzenz Greger, resurrected the ice race, rebranding it under the F.A.T. International banner. This revival not only honored the legacy of the original races but also injected a modern flair, attracting a new generation of motorsport enthusiasts to the icy tracks of Zell am See. ​ To explore the history, evolution, and future of the F.A.T. Ice Race, as well as its impact on the automotive world, we sat down with Ferdi Porsche. In this conversation, he shares insights on reviving the event, Porsche’s enduring family spirit, the role of design in his vision, and his thoughts on the next generation of motorsport talent. Ferdi on F.A.T. and its Future Petrolicious:  Tell us a little bit about the FAT Ice race, and why its back? Ferdi Porsche: The ice race started in Selamsee in the 50s, and I honestly think it was an enthusiast event or race, basically. I think they saw that they had a frozen lake and decided to drive some cars around.  I found out about it because my dad bought a car that used to race on the frozen lake and it came with the spike tires and it still had the super long studs in there and I asked him what what it was because it was kind of forgotten already, the ice racing. I had the idea of bringing it back when I was in my architecture studies.  I was looking for something fun to do by the side and so this came at a perfect time. In 2019, we had the first ice race in Zell again. Then we did it twice before COVID. And when COVID hit, I was thinking, Okay, how do I, how do I take this to the next level? And how do I expand it from just one event? And that's when I found F.A.T. International and decided to revive the brand. Petrolicious: What does F.A.T. Stand for? F.A.T. used to stand for Francais Allemand Transit. It was a French German logistics company. And now it just stands for FAT It just literally describes the energy and the vibe of everything that we do basically. Funnily enough the first ice race kind of introduced that without the brand FAT being there. Petrolicious: What are the stars of this years F.A.T. Race? Ferdi: The stars of the show of the 25 Ice Race are probably the F.A.T. cars. Since F.A.T. was a sponsor in the 80s, 90s, and early 2000s for all the great cars, Ferraris, Porsches, Mercedes, everything, they naturally take center stage. We brought this tradition back and are now sponsoring cars again. We have the 963 that raced at Le Mans last year here. Sadly, it is not driving because it is not high up enough, but we also have the Dakar cars, the ones that work better on the ice. We have a bunch of WRC cars, so we really have an amazing array of cars this year. That was always the idea of Ice Race, being open to any brand and any manufacturer. I think this year we have 22 different car brands in the race. Petrolicious: What is your favorite Porsche model on the ice this year? Ferdi: That's a difficult question. There's so many different, there's so many cool Porsches that I can't really decide for one. It changes over time. Sometimes I'm more towards the super old stuff, 550s obviously, also because of the history and the connection to ice racing. But obviously I love the Dakar, a sick car, and just the vibe also matches that somehow. It's hard to decide. Petrolicious: What are your long term plans for F.A.T. Ferdi: With F.A.T., we do a bunch of things. We're a young team, and the idea is to do stuff that we like, stuff that we enjoy, because we believe that when we like it, other people will like it too. Obviously, we have the event side of things. Last year, we brought it to Aspen, and I’m looking at where I can bring it next apart from Zell. But we're also looking into the summer. We have our \"Hot on Top\" at Großglockner with Mankei, where we do car meets every month during the summer. The idea is to do stuff that we think is fun. So you can expect F.A.T. to be all around the world many times. Petrolicious: So not just ice? Ferdi: I think F.A.T. works on every terrain. Basically, it got famous through Le Mans. Proper racing on tarmac is where it was kind of born, and it's still happening today with the 963 that we have in Le Mans, but also with the karting league for the kids. So F.A.T. works on every terrain, but its spirit is kind of born from ice racing because it's somewhat more about fun than speed. Petrolicious: As an Architect, how does your design sensibilities influence what you do? Ferdi: I think studying architecture kind of gives you a great opportunity to look at a blank piece of paper and then come up with stuff. So I think that obviously plays into F.A.T. I know what I can and what I can't do. I'm not a graphic designer, but I like paying attention to all of that stuff. And I think the devil and the beauty is in the detail. So that's why everything that we do with F.A.T. is always very detail focused. Obviously, it's sometimes festival and wild, and you can never fully plan an event that happens on a frozen airfield. Everything just is a bit wabi-sabi sometimes, but I think that's also kind of the beauty of it. Petrolicious: Where do you place yourself in within Porsche today? Are you involved with the brand at all in decision making? Ferdi: I think Porsche still has this kind of family business vibe, even though it's obviously a big company now. We build a lot of cars these days, and so many people work for Porsche, but it still has this energy of being a family brand. Obviously, I have a lot of love for the brand and want to see it thrive. Whenever I can give my two cents on something, I do, but I'm not involved in the day-to-day business. Petrolicious: What advice would you give to a young person with limited resources who wants to get into ice racing or racing in general? Ferdi: It depends on how young you are, but I think you should start in the F.A.T. Karting League. It’s the most meritocratic and a cheaper way to get into racing without losing any of the skill-building opportunities. I would advise any young person to start there and see if they have talent. From there, you can work your way through our completely meritocratic system and fight your way into F4 with us. And if you're looking to buy a car, I think what's cool about the car world is that it's very open. It doesn’t really matter if you buy a $20,000 car, a $10,000 car, if you have no car at all, or a $10 million car. In the end, everybody sits together, has a burger, and is the same because they all share the same passion for cars. Petrolicious: Please tell us more about the karting school. Ferdi: Coming from what we do with F.A.T. and the energy we wanted to bring, it was inspired by all the car events I went to as a kid, many of which felt somewhat stuck up and catered to an older crowd. I wanted to do something a bit more rebellious in that space. When I met [Renowned Formula 1 engineer] Rob Smedley and heard about the karting league and what he has done, building these karts that try to change the whole system by making it more approachable for everybody, it felt like the perfect match. That is why we teamed up and are now bringing it to the whole world. This year, we are bringing it to the U.S. for the first time. In the coming years, we are expanding to Asia and the Middle East. The goal is really to create a platform for everybody to start racing. Obviously, it still comes at a certain price, so it is not yet for everybody, but that is how democratization works. You start at some point and then you try to push it down and down. Petrolicious: So you're on the hunt for a Formula 1 driver then? Ferdi: Yes, we're looking for the first female F1 driver. Petrolicious: Mind if I give you a few rapid fire this or that questions? Ferdi: Lets do it. Petrolicious: Lewis at Ferrari or Mercedes?Ferdi: Lewis at Mercedes. Petrolicious: Stuttgart or Maranello?Ferdi: Stuttgart. Petrolicious: Racing in the desert or racing on the ice?Ferdi: Racing on the ice. Petrolicious: 962 or 917?Ferdi: 962. Petrolicious: Turbo or naturally aspirated?Ferdi: Naturally aspirated. Petrolicious: ST or GT3 Touring?Ferdi: ST. Petrolicious: Gravel or tarmac?Ferdi: Gravel. Many thanks to Ferdi Porsche for sitting down with us for a chat. We'll follow up soon on the noble efforts at F.A.T. Karting with a full story. Continue...",
    "author": "",
    "published": "Wed, 19 Mar 2025 11:00:13 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/03/18114307/IMGL3350-Edit.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "3028e3d6-0174-4fce-93a0-06433b869d1d",
    "title": "Kei \u0026 Mighty: Exploring Japan’s WAZUKA Microcar Museum",
    "link": "https://www.speedhunters.com/2025/03/exploring-japans-wazuka-microcar-museum/",
    "description": "That might sound like a lot, but it manages some 82 million vehicles in some of the world’s most densely populated cities daily. As a country, it should be at a perpetual standstill. Yet, ever since the 1950s, the Japanese have held a tiny little ace up their sleeves… Kei-jidõsha, or ‘kei car’ as it’s […] The post Kei \u0026 Mighty: Exploring Japan’s WAZUKA Microcar Museum appeared first on Speedhunters.",
    "author": "Mark Riccioni",
    "published": "Fri, 14 Mar 2025 16:00:13 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "BUBU",
      "BUBU Shuttle-50",
      "Collection",
      "japan",
      "Kei",
      "Kei-car",
      "micro car",
      "microcar",
      "Museum",
      "WAZUKA Microcar Museum"
    ]
  },
  {
    "id": "6a58872e-951c-4a5c-9e4a-ce8911d90042",
    "title": "10-Year Throwback: For The Love Of Rotary",
    "link": "https://www.speedhunters.com/2025/03/10-year-throwback-for-the-love-of-rotary/",
    "description": "But finally, after the stars recently aligned, I managed to get the cool guys at Car Shop Glow (CSG) to bring their time attacking Mazda to a quiet location away from the hustle and bustle of Tokyo’s daily chaos. I can remember the first time I laid eyes on this RX-7 – it was probably […] The post 10-Year Throwback: For The Love Of Rotary appeared first on Speedhunters.",
    "author": "TheSpeedhunters",
    "published": "Thu, 13 Mar 2025 16:00:00 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "13b",
      "Car Shop Glow",
      "CSG",
      "FD3S",
      "japan",
      "mazda",
      "Rotary",
      "rx-7",
      "rx7",
      "Throwback",
      "time-attack",
      "Zest Racing"
    ]
  },
  {
    "id": "a7543be0-a91f-466a-b229-546e9bd933af",
    "title": "QOTD: What's Your Favorite Car Web Site?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-what-s-your-favorite-car-web-site-44512858?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "We lost a good group of car Web sites last week . Or will be losing them, anyway, come April 1. This follows a radical change to Autoblog last fall.",
    "author": "Tim Healey",
    "published": "Mon, 24 Mar 2025 22:02:48 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/03/24/18011/qotd-what-s-your-favorite-car-web-site.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "499a7aa5-4b39-4e92-a63a-f6ce8278beda",
    "title": "Report: HEMI V8 Engine Production Resumes In Michigan This Summer",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/report-hemi-v8-engine-production-resumes-in-michigan-this-summer-44512852?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Stellantis clearly did itself a major disservice by discontinuing its iconic line of V8 engines. But there have been endless rumors , and even public speculation from upper management , that the company wanted to correct that mistake and restore some goodwill with ardent Mopar fans. The latest of these are reports that the Dundee Engine Plant in Michigan will be retooled to manufacture the entire HEMI V8 family by August.",
    "author": "Matt Posky",
    "published": "Mon, 24 Mar 2025 21:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/03/24/16111/report-hemi-v8-engine-production-resumes-in-michigan-this-summer.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "afaa1214-4d82-4496-84ba-40835100ec17",
    "title": "Aston Martin India sees 50:50 sales split between SUVs and sports cars",
    "link": "https://www.autocarindia.com/industry/aston-martin-india-sees-5050-sales-split-between-suvs-and-sportscars-434927#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Aston Martin has revealed that the sales split between its SUV and sports car models in India is currently about 50:50. This means the DBX alone sells as many units as Aston Martin’s entire sports car line-up, which includes the Vantage and DB12. The third-gen Vanquish recently joined this list, too. The Aston Martin DBX sells as much as the Vantage and DB12 combined in India Aston Martin plans to maintain this balance between its SUV and sports car offerings Porsche and Lamborghini sales also skew towards their SUV models Aston Martin SUV and sports car sales in India are evenly split Speaking with Autocar India during the launch of the new Vanquish, Gautam Dutta, general manager of Sales at Aston Martin India, reflected on the commercial performance of the brand's current model line-up. “It’s been a balance,” he said, adding that Aston Martin’s “performance-oriented” brand positioning has helped create “appreciation” for both its sports cars and the DBX. Dutta also remarked: “Last year, the DBX gave us phenomenal results, but the Vantage was also very helpful in generating a lot of traction for us. So, it’s a balance that we are nicely maintaining between the SUV and other sports cars.” When asked about the precise split between the models, Dutta narrowed it down to 50:50. SUV sales are booming for other high-profile carmakers as well The DBX’s success compared to other Aston Martin models isn’t surprising, given the high demand for SUVs in India. This trend also holds true for brands like Porsche and Lamborghini, which offer sports cars and SUVs in their model portfolios. Porsche India’s unit sales for 2024 skewed a whopping 71 percent in favour of the Cayenne and Macan, with the remaining 29 percent occupied by the 911, Panamera, Taycan, 718 Cayman, and Boxster. Meanwhile, Lamborghini India recorded a 60:40 sales split between the Urus and the Italian marque’s supercars offerings in 2022. Also see: Aston Martin Valhalla India launch on cards Aston Martin Vantage India review: split personality",
    "author": "Viraaj Bhatnagar",
    "published": "Mon, 24 Mar 2025 20:05:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250324075223_DBX_707_2.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "4c215cee-8a34-4502-a10a-e1464bab9dbb",
    "title": "Aston Martin Valhalla India launch on cards",
    "link": "https://www.autocarindia.com/car-news/aston-martin-valhalla-india-launch-on-cards-434924#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Aston Martin is looking to bring the Valhalla plug-in hybrid supercar to India, we can exclusively report. The British carmaker just launched the new Vanquish in India as its new flagship model for Rs 8.85 crore, but should the limited-run Valhalla debut here, it will be positioned even higher in the brand’s line-up. Aston Martin may bring the 1,079hp Valhalla supercar to India The British carmaker is taking India “very, very seriously” Indian customers have been expressing interest in the Valhalla Aston Martin Valhalla possibly coming to India In a recent interview with Autocar India, Aston Martin India’s general manager of sales, Gautam Dutta, spoke about the relevance of the Indian market for the British carmaker. “Globally, India is being taken very, very seriously within Aston Martin,” adding that every Aston Martin model “offered in the global market will surely find its way to India. So, hoping that, yes, Valhalla should also come.” Indian buyers’ queries hint at demand for Valhalla Dutta also stated that Aston Martin has been receiving queries about the Valhalla from prospective Indian buyers, hinting at some demand for the plug-in hybrid supercar here. Deliveries for the Valhalla will commence in the second half of 2025, and it seems fairly possible that at least one of the 999 units will be India-bound. Aston Martin Valhalla details The Valhalla is Aston Martin’s first mid-engined plug-in hybrid supercar. Much like the Valkyrie, the Valhalla incorporates technologies from Aston Martin’s F1 division. The powertrain comprises an evolved form of Mercedes-AMG’s 4.0-litre twin-turbo V8 mated to three electric motors, together making 1,079hp and 1,110Nm of torque. 0-100kph in 2.5 seconds Aston Martin also developed a custom 8-speed dual-clutch transmission for the Valhalla, and the 0-100kph dash is dealt with in 2.5 seconds. An EV mode is on offer as well, where the Valhalla can silently trundle along without any V8 assistance for 14km and up to 140kph. The supercar is primarily built from carbon fibre to keep weight down, and its radical aerodynamics-focused styling echoes the Valkyrie. Aston Martin is yet to reveal the pricing for the Valhalla, but the car will go up against the likes of the Ferrari SF90 and Lamborghini Revuelto. Also see: Aston Martin Valkyrie Le Mans hypercar revealed Aston Martin Vantage India review: split personality",
    "author": "Viraaj Bhatnagar",
    "published": "Mon, 24 Mar 2025 18:25:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250324040444_Aston_Martin_Valhalla_10_1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "bdf26e0a-55cb-4edb-b717-0254062856e2",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "4cbbeae4-ea6f-4d16-9a0e-25a3ca4cc46b",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  }
]
