{
  "id": "0540addc-b130-4d5c-bb5c-8c741a3ccd02",
  "title": "Fujifilm Registers a new Tri-Wifi Band Camera",
  "link": "https://www.canonrumors.com/fujifilm-registers-a-new-tri-wifi-band-camera/",
  "description": "According to a post on Weibo by user E8M_8888, Fujifilm has registered a camera with the Chinese Certification Authority. This makes two models that Fujifilm has submitted for certification that are currently unknown. What Fujifilm will release this year is a bit up in the air, but two models are rumored. Fujirumors speculates that the [...] The post Fujifilm Registers a new Tri-Wifi Band Camera appeared first on Canon Rumors.",
  "author": "Richard",
  "published": "Sun, 02 Mar 2025 10:00:10 +0000",
  "source": "https://www.canonrumors.com/feed/",
  "categories": [
    "Industry Rumors",
    "1\" Camera",
    "Fujifilm",
    "X-E5"
  ],
  "byline": "Richard",
  "length": 1569,
  "excerpt": "According to a post on Weibo by user E8M_8888, Fujifilm has registered a camera with the Chinese Certification Authority.This makes two models that Fujifilm",
  "siteName": "Canon Rumors",
  "favicon": "",
  "text": "According to a post on Weibo by user E8M_8888, Fujifilm has registered a camera with the Chinese Certification Authority.This makes two models that Fujifilm has submitted for certification that are currently unknown. What Fujifilm will release this year is a bit up in the air, but two models are rumored.Fujirumors speculates that the FF240004 is possibly the already rumored GFX100RF, the rangefinder version of the GFX 100.The GFX 100RF is expected to have the following rough features (thank you FujiRumors)Cost around $5,000Coming in black and silver colorsNo Hybrid Viewfinder, EVF onlyA dedicated dial to change the aspect ratioApproximately the size of the X-Pro3No IBIS35mm F4 LensThere are also rumors of a small half-frame sensor camera or an X-E5 camera coming out, which would make sense for the FF250001 model. A 1″ sensor, which is what Fujifilm seems to be calling (according to rumors) the half-frame model, would make a lot of sense given the sudden interest in compact cameras. With Sony and Canon having new models in this market space, it would not surprise me to see Fujifilm jump in as well.The certification summary details via E8M_8888 are as follows;As with most certification submissions, the actual fine details over what is coming down the road are minimal. This is usually a good indication that something is coming out, because they aren’t going to go through the trouble of certification if the product is not going to be released.When you purchase through links on our site, we may earn an affiliate commission. Here's how it works.",
  "image": "https://www.canonrumors.com/wp-content/uploads/2025/03/Fujifilm-logo-header.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-64426\"\u003e\u003cdiv\u003e\u003cp\u003eAccording to a post on Weibo by user \u003ca href=\"https://weibo.com/u/2424567755\"\u003eE8M_8888\u003c/a\u003e, Fujifilm has registered a camera with the Chinese Certification Authority.\u003c/p\u003e\u003cp\u003eThis makes two models that Fujifilm has submitted for certification that are currently unknown.  What Fujifilm will release this year is a bit up in the air, but two models are rumored.\u003c/p\u003e\u003cp\u003eFujirumors speculates that the FF240004 is possibly the already rumored GFX100RF, the rangefinder version of the GFX 100.\u003c/p\u003e\u003cp\u003eThe GFX 100RF is expected to have the following rough features (thank you \u003ca href=\"https://www.fujirumors.com/breaking-fujifilm-gfx100rf-first-specs-no-ibis-gf35mmf4-lens-and-coming-march-2025/\"\u003eFujiRumors\u003c/a\u003e)\u003c/p\u003e\u003cul\u003e\u003cli\u003eCost around $5,000\u003c/li\u003e\u003cli\u003eComing in black and silver colors\u003c/li\u003e\u003cli\u003eNo Hybrid Viewfinder, EVF only\u003c/li\u003e\u003cli\u003eA dedicated dial to change the aspect ratio\u003c/li\u003e\u003cli\u003eApproximately the size of the X-Pro3\u003c/li\u003e\u003cli\u003eNo IBIS\u003c/li\u003e\u003cli\u003e35mm F4 Lens\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThere are also rumors of a \u003ca href=\"https://www.fujirumors.com/fujifilms-half-frame-camera-coming-with-vertical-lcd/\"\u003esmall half-frame sensor camera\u003c/a\u003e or an X-E5 camera coming out, which would make sense for the FF250001 model.  A 1″ sensor, which is what Fujifilm seems to be calling (according to rumors) the half-frame model, would make a lot of sense given the sudden interest in compact cameras.  With Sony and Canon having new models in this market space, it would not surprise me to see Fujifilm jump in as well.\u003c/p\u003e\u003cp\u003eThe certification summary details via E8M_8888 are as follows;\u003c/p\u003e\u003cp\u003eAs with most certification submissions, the actual fine details over what is coming down the road are minimal.  This is usually a good indication that something is coming out, because they aren’t going to go through the trouble of certification if the product is not going to be released.\u003c/p\u003e\u003cdiv id=\"wpadc-wrapper\"\u003e\u003cp\u003e\u003cspan\u003eWhen you purchase through links on our site, we may earn an affiliate commission. \u003c/span\u003e\u003cspan\u003e\u003ca href=\"https://www.canonrumors.com/affiliate-disclosure/\"\u003eHere\u0026#39;s how it works\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-02T05:00:10-05:00",
  "modifiedTime": "2025-03-02T12:08:05Z"
}
