{
  "id": "09f40793-1ec6-43f2-be62-f4d780bb4062",
  "title": "World-Renowned Collector Gifts Over 6,500 Photographs to the MET",
  "link": "https://petapixel.com/2025/05/16/world-renowned-collector-gifts-over-6500-photographs-to-the-met/",
  "description": "The Metropolitan Museum of Art is set to receive over 6,500 historical and contemporary photography works from world-renowned collector Artur Walther and the Walther Family Foundation. [Read More]",
  "author": "Kate Garibaldi",
  "published": "Fri, 16 May 2025 21:56:52 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Culture",
    "News",
    "arturwalther",
    "met",
    "metropolitanmuseumofart",
    "museum"
  ],
  "byline": "Kate Garibaldi",
  "length": 4893,
  "excerpt": "The Metropolitan Museum of Art is set to receive over 6,500 historical and contemporary photography works from world-renowned collector Artur Walther and",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "The Metropolitan Museum of Art is set to receive over 6,500 historical and contemporary photography works from world-renowned collector Artur Walther and the Walther Family Foundation. Art News reports that the Metropolitan Museum of Art (MET) in New York City has announced a promised gift of over 6,500 photographic works from the German-American collector Artur Walther and the Walther Family Foundation. Since 2010, under Walther’s direction, the eponymous art foundation has been operating annual photography-focused exhibitions and programs in New York and Germany. With a collection described by the museum as one of the “most distinguished private collections of photography in the world,” this exciting promised gift will bring to the public an enormous curated gathering of modern and contemporary photographic art. “Comprised of some 6,500 photographs, albums, and works of time-based media, the promised gift features modern and contemporary art from Africa, China, Japan, and Germany, among other places. Also included are 19th- and 20th-century vernacular photographs from the United States, Europe, Colombia, and Mexico,” the MET writes of the works to be gifted. With such a generous and extensive collection to be added to the museum’s offerings, the MET already has plans to exhibit the work in the newly reimagined Michael C. Rockefeller Wing, as well as adding pieces from it to the collection displays in the new Oscar L. and H.M. Agnes Hsu-Tang Wing. The MET, already known for its outstanding photography collection that it describes as “more than 75,000 works spanning the entire history of the medium,” is uniquely poised to utilize the works to create informative and inspiring exhibitions. “Selections from the collection will be prominently featured in several upcoming museum presentations. In the first of these, photographs by such renowned African artists as Seydou Keïta and Samuel Fosso will accompany the inauguration of the Michael C. Rockefeller Wing when it reopens in May 2025. A focused exhibition of international selections from the promised gift will then be presented in fall 2025, followed by a comprehensive show of the collection in 2028. Photographs and time-based media will also be incorporated into future displays in the Tang Wing, The Met’s new galleries for modern and contemporary art set to open in 2030.” “This vast trove of photographs from Artur Walther and his foundation is nothing short of extraordinary. It demonstrates Artur’s passion as a trailblazing collector and visionary explorer, and brings his sustained scholarly engagement with living artists and photographic practice to a new level,” said Max Hollein, The Met’s Marina Kellen French Director and Chief Executive Officer. “With its impressive scope, depth, and quality, the generous promised gift expands our ability to tell a global history of photography—one that reflects the diversity, complexity, and artistry of the medium across centuries and continents. In addition to the upcoming display in the Michael C. Rockefeller Wing, these works will also come to the fore and play an important role in our future collection displays of global 20th- and 21st- century art in the Tang Wing.” The gifted collection has a broad scope of images, with its strongest being described as African studio photography, German post-war photography, Chinese conceptual art, as well as vernacular images, which, in contrast to fine art, are more casual and functional, such as snapshots or amateur photographs. Highlights from the collection include work by 20th-century and contemporary photographers from all walks of life and multiple continents for a diverse and well-rounded assemblage. African art, one of the largest parts of the Walther collection, is represented by imagery from photographers Seydou Keïta, Malick Sidibé, Samuel Fosso, Zanele Muholi, David Goldblatt, Santu Mofokeng, Yto Barrada, Jo Ractliffe, Lebohang Kganye, S. J. Moodley, Guy Tillim, and J. D. ‘Okhai Ojeikere. Equally rich is the collection of photographs and video from China with notable pieces by Ai Weiwei, Hai Bo, Hong Hao, Luo Yongjin, Yang Fudong, and Zhang Huan. An especially large holding of work by Japanese photographers Daido Moriyama and Nobuyoshi Araki adds to the Asian voices represented. Of the importance of the promised gift, Jeff L. Rosenheim, Joyce Frank Menschel Curator in Charge of the Department of Photographs, added, “At The Met, The Walther Collection will become an essential resource for scholars and museum-goers. With its phenomenal range of photographs and time-based media, the Collection introduces perspectives from artists around the globe, situating the camera as a powerful tool for social critique, reflection, and change.” Image credits: Cover image by Hugo Schneider licensed under the Creative Commons Attribution-Share Alike 2.0 Generic license.",
  "image": "https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-800x420.jpg\" alt=\"The grand entrance of the Metropolitan Museum of Art in New York City, featuring wide stone steps, arched doorways, columns, and large banners advertising exhibitions on either side of the main entrance.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-800x420.jpg 800w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-320x168.jpg 320w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-150x79.jpg 150w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-300x157.jpg 300w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-400x209.jpg 400w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG-550x288.jpg 550w, https://petapixel.com/assets/uploads/2025/05/MET-PetaPixel-BG.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eThe Metropolitan Museum of Art is set to receive over 6,500 historical and contemporary photography works from world-renowned collector Artur Walther and the Walther Family Foundation.\u003c/p\u003e  \u003cp\u003e\u003ca href=\"https://www.artnews.com/art-news/news/met-receives-photography-collection-walter-artur-1234742347/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eArt News reports\u003c/a\u003e that the Metropolitan Museum of Art (MET) in New York City has \u003ca href=\"https://www.metmuseum.org/press-releases/artur-walther-gift\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eannounced\u003c/a\u003e a promised gift of over 6,500 photographic works from the German-American collector Artur Walther and the Walther Family Foundation. Since 2010, under Walther’s direction, the eponymous art foundation has been operating annual photography-focused exhibitions and programs in New York and Germany.\u003c/p\u003e \u003cp\u003eWith \u003ca href=\"https://www.walthercollection.com/en/collection/about-us\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003ea collection\u003c/a\u003e described by the museum as one of the “most distinguished private collections of photography in the world,” this exciting promised gift will bring to the public an enormous curated gathering of modern and contemporary photographic art.\u003c/p\u003e \u003cp\u003e“Comprised of some 6,500 photographs, albums, and works of time-based media, the promised gift features modern and contemporary art from Africa, China, Japan, and Germany, among other places. Also included are 19th- and 20th-century vernacular photographs from the United States, Europe, Colombia, and Mexico,” the MET writes of the works to be gifted. \u003c/p\u003e \u003cp\u003eWith such a generous and extensive collection to be added to the museum’s offerings, the MET already has plans to exhibit the work in the newly reimagined Michael C. Rockefeller Wing, as well as adding pieces from it to the collection displays in the new Oscar L. and H.M. Agnes Hsu-Tang Wing. The MET, already known for its outstanding photography collection that it describes as “more than 75,000 works spanning the entire history of the medium,” is uniquely poised to utilize the works to create informative and inspiring exhibitions. \u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DIUhYHFMBsA/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e\n \u003c/center\u003e \u003cp\u003e“Selections from the collection will be prominently featured in several upcoming museum presentations. In the first of these, photographs by such renowned African artists as Seydou Keïta and Samuel Fosso will accompany the inauguration of the Michael C. Rockefeller Wing when it reopens in May 2025. A focused exhibition of international selections from the promised gift will then be presented in fall 2025, followed by a comprehensive show of the collection in 2028. Photographs and time-based media will also be incorporated into future displays in the Tang Wing, The Met’s new galleries for modern and contemporary art set to open in 2030.”\u003c/p\u003e \u003cp\u003e“This vast trove of photographs from Artur Walther and his foundation is nothing short of extraordinary. It demonstrates Artur’s passion as a trailblazing collector and visionary explorer, and brings his sustained scholarly engagement with living artists and photographic practice to a new level,” said Max Hollein, The Met’s Marina Kellen French Director and Chief Executive Officer. “With its impressive scope, depth, and quality, the generous promised gift expands our ability to tell a global history of photography—one that reflects the diversity, complexity, and artistry of the medium across centuries and continents. In addition to the upcoming display in the Michael C. Rockefeller Wing, these works will also come to the fore and play an important role in our future collection displays of global 20th- and 21st- century art in the Tang Wing.”\u003c/p\u003e \u003cp\u003eThe gifted collection has a broad scope of images, with its strongest being described as African studio photography, German post-war photography, Chinese conceptual art, as well as vernacular images, which, in contrast to fine art, are more casual and functional, such as snapshots or amateur photographs. \u003c/p\u003e \u003cp\u003eHighlights from the collection include work by 20th-century and contemporary photographers from all walks of life and multiple continents for a diverse and well-rounded assemblage. African art, one of the largest parts of the Walther collection, is represented by imagery from photographers Seydou Keïta, Malick Sidibé, Samuel Fosso, Zanele Muholi, David Goldblatt, Santu Mofokeng, Yto Barrada, Jo Ractliffe, Lebohang Kganye, S. J. Moodley, Guy Tillim, and J. D. ‘Okhai Ojeikere. Equally rich is the collection of photographs and video from China with notable pieces by Ai Weiwei, Hai Bo, Hong Hao, Luo Yongjin, Yang Fudong, and Zhang Huan. An especially large holding of work by Japanese photographers Daido Moriyama and Nobuyoshi Araki adds to the Asian voices represented.\u003c/p\u003e \u003cp\u003eOf the importance of the \u003ca href=\"https://www.metmuseum.org/press-releases/artur-walther-gift\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003epromised gift\u003c/a\u003e, Jeff L. Rosenheim, Joyce Frank Menschel Curator in Charge of the Department of Photographs, added, “At The Met, The Walther Collection will become an essential resource for scholars and museum-goers. With its phenomenal range of photographs and time-based media, the Collection introduces perspectives from artists around the globe, situating the camera as a powerful tool for social critique, reflection, and change.”\u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e \u003ca href=\"https://www.flickr.com/photos/190838098@N06/50697537758/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eCover image by Hugo Schneider licensed under the\u003c/a\u003e \u003ca href=\"https://creativecommons.org/licenses/by-sa/2.0/deed.en\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eCreative Commons Attribution-Share Alike 2.0 Generic license.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-16T21:56:52Z",
  "modifiedTime": null
}
