{
  "id": "148aedb0-12a3-4b29-a008-2b7414031a5f",
  "title": "PSA: Update Your OWC Atlas CFexpress Type A Memory Card Now",
  "link": "https://petapixel.com/2025/01/24/psa-update-your-owc-atlas-cfexpress-type-a-memory-card-now/",
  "description": "The OWC Atlas CFexpress Type A memory card is one of PetaPixel's favorites, but OWC has found an issue with the card, and customers are advised to update their card's firmware as soon as possible. The good news is that the data on the card is safe. [Read More]",
  "author": "Jeremy Gray",
  "published": "Fri, 24 Jan 2025 20:55:10 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Equipment",
    "News",
    "Technology",
    "cfexpresstypea",
    "memorycard",
    "owc",
    "owcatlas",
    "owcatlascfexpresstypea",
    "psa"
  ],
  "byline": "Jeremy Gray",
  "length": 2666,
  "excerpt": "Your data is still safe.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "The OWC Atlas CFexpress Type A memory card is one of PetaPixel‘s favorites, but OWC has found an issue with the card, and customers are advised to update their card’s firmware as soon as possible. The good news is that the data on the card is safe. It has been a tumultuous time for memory cards lately. Earlier this month, PetaPixel reported that some SanDisk SD cards will corrupt when used on the Canon EOS R5 Mark II camera. Sony this week added more CFexpress Type A cards to its ongoing repair program to address issues with cards locking up in cold temperatures. Fortunately, like with Sony’s CFexpress Type A issue, OWC has a free fix. During ongoing quality assurance testing with its Atlas CFexpress Type A memory card, OWC discovered an unusual bug. After extended, continuous use, the card can lock up. OWC explains that this only occurs during “extreme” use, which it describes as an “edge case,” but it is technically possible to experience the issue. If a user pushes their Atlas CFexpress Type A card to this extreme limit and runs into the issue, it will no longer be usable. However, OWC explains that the data on the card is not lost or inaccessible; it is simply that new data cannot be written on the card until the problem has been fixed. For users who have not experienced any problems, the solution is straightforward, albeit not necessarily convenient. They can update their card’s firmware using OWC’s free Innergize software. However, users must have an OWC Atlas Memory Card Reader to do this. Users should transfer any images or data from their card before doing so. If someone does not have an OWC Atlas Memory Card Reader, they are advised to contact OWC’s support team, after which they will either be provided access to the necessary card reader or advised to send their card to OWC to have the firmware updated. OWC will cover shipping both ways. For those who already find themselves in the “extreme edge case” camp, having had their card rendered unusable, they must send the card to OWC. The company assures customers that the data on the card is safe, even though their camera and computer cannot recognize the card. “Once received by our team, we are then able to update and fully restore usability, including access to all data on your card,” OWC says. “Better, of course, is to prevent the risk of such inconvenience and, as such, we strongly suggest that you please update your card’s firmware now,” the company adds. Image credits: OWC PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"776956\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-800x420.jpg\" alt=\"OWC Atlas Pro CFexpress 4.0 Type A memory cards\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured-550x288.jpg 550w, https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eThe \u003ca href=\"https://petapixel.com/2024/04/11/owc-announces-its-first-cfexpress-type-a-cards-and-they-are-very-fast/\" data-wpel-link=\"internal\"\u003eOWC Atlas CFexpress Type A memory card\u003c/a\u003e is one of \u003cem\u003ePetaPixel\u003c/em\u003e‘s favorites, but OWC has found an issue with the card, and customers are advised to update their card’s firmware as soon as possible. The good news is that the data on the card is safe. \u003c/p\u003e  \u003cp\u003eIt has been a tumultuous time for memory cards lately. Earlier this month, \u003cem\u003ePetaPixel\u003c/em\u003e reported that \u003ca href=\"https://petapixel.com/2025/01/09/sandisk-sd-cards-corrupt-when-paired-with-the-r5-mark-ii-canon-warns/\" data-wpel-link=\"internal\"\u003esome SanDisk SD cards will corrupt\u003c/a\u003e when used on the Canon EOS R5 Mark II camera. Sony this week added more CFexpress Type A cards to its \u003ca href=\"https://petapixel.com/2025/01/23/more-sony-tough-cfexpress-cards-require-free-repair-to-toughen-up/\" data-wpel-link=\"internal\"\u003eongoing repair program\u003c/a\u003e to address issues with cards locking up in cold temperatures. Fortunately, like with Sony’s CFexpress Type A issue, OWC has a free fix. \u003c/p\u003e \u003cp\u003eDuring ongoing quality assurance testing with its Atlas CFexpress Type A memory card, OWC discovered an unusual bug. After extended, continuous use, the card can lock up. OWC explains that this only occurs during “extreme” use, which it describes as an “edge case,” but it is technically possible to experience the issue. \u003c/p\u003e \u003cp\u003eIf a user pushes their Atlas CFexpress Type A card to this extreme limit and runs into the issue, it will no longer be usable. However, OWC explains that the data on the card is not lost or inaccessible; it is simply that new data cannot be written on the card until the problem has been fixed. \u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/04/owc-cfexpress-type-a-cards-3-800x486.jpg\" alt=\"OWC Atlas Pro CFexpress 4.0 Type A memory cards\" width=\"800\" height=\"486\" srcset=\"https://petapixel.com/assets/uploads/2024/04/owc-cfexpress-type-a-cards-3-800x486.jpg 800w, https://petapixel.com/assets/uploads/2024/04/owc-cfexpress-type-a-cards-3-320x194.jpg 320w, https://petapixel.com/assets/uploads/2024/04/owc-cfexpress-type-a-cards-3-1536x932.jpg 1536w, https://petapixel.com/assets/uploads/2024/04/owc-cfexpress-type-a-cards-3.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eFor users who have not experienced any problems, the solution is straightforward, albeit not necessarily convenient. They can update their card’s firmware using OWC’s free Innergize software. However, users must have an OWC Atlas Memory Card Reader to do this. Users should transfer any images or data from their card before doing so. \u003c/p\u003e\n \u003cp\u003eIf someone does not have an OWC Atlas Memory Card Reader, they are advised to \u003ca href=\"https://www.owc.com/support\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003econtact OWC’s support team\u003c/a\u003e, after which they will either be provided access to the necessary card reader or advised to send their card to OWC to have the firmware updated. OWC will cover shipping both ways. \u003c/p\u003e \u003cp\u003eFor those who already find themselves in the “extreme edge case” camp, having had their card rendered unusable, they must send the card to OWC. The company assures customers that the data on the card is safe, even though their camera and computer cannot recognize the card. \u003c/p\u003e \u003cp\u003e“Once received by our team, we are then able to update and fully restore usability, including access to all data on your card,” OWC says. \u003c/p\u003e \u003cp\u003e“Better, of course, is to prevent the risk of such inconvenience and, as such, we strongly suggest that you please update your card’s firmware now,” the company adds. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e OWC \u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-24T20:55:10Z",
  "modifiedTime": null
}
