{
  "id": "53ec00c7-bbb2-4a67-b39d-3709c588769f",
  "title": "EssilorLuxottica, World’s Largest Eyewear Company, Buys 5.1% Stake in Nikon",
  "link": "https://petapixel.com/2024/10/14/essilorluxottica-worlds-largest-eyewear-company-buys-5-1-stake-in-nikon/",
  "description": "EssilorLuxottica, the world's largest eyewear company, has purchased a 5.1% stake in Nikon and is treating it as a \"long-term financial investment to support the company and its management.\" [Read More]",
  "author": "Jaron Schneider",
  "published": "Mon, 14 Oct 2024 16:10:27 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Industry",
    "News",
    "business",
    "EssilorLuxottica",
    "eyewear",
    "investment",
    "luxottica",
    "nikon"
  ],
  "byline": "Jaron Schneider",
  "length": 2503,
  "excerpt": "EssilorLuxottica has purchased a 5.1% stake in Nikon and is treating it as a \"long-term financial investment.\"",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "EssilorLuxottica, the world’s largest eyewear company, has purchased a 5.1% stake in Nikon and is treating it as a “long-term financial investment to support the company and its management.” While its name is less known by design, EssilorLuxottica is the largest company in the global eyewear space as it owns several brands like Ray-Ban, Oakley, Persol, and Vogue Eyewear, as well as the exclusive rights to produce eyewear with many high-end fashion names like Prada. It is also the parent company of LensCrafters, Pearle Vision, and Sunglass Hut as well as eyewear insurance company EyeMed. Since it produces glasses, owns the stores that sell them, and owns an insurance company that is accepted at those stores, there is a strong argument that EssilorLuxottica is vertically integrated. It is also the company that Meta chose to partner with to produce its Ray-Ban smart glasses in 2021 and with whom it continues to work. In July of last year, EssilorLuxottica purchased the indefinite rights to use Kodak’s brand for any products or services in connection with its business. As of October 2024, the company has a market cap of $106.24 billion. Now the eyewear brand has invested in Nikon. This is, however, not the first time the two companies have gotten together. According to Reuters, EssilorLuxottica entered into a joint venture with Nikon in 2000 to create Nikon-Essilor, a wholesale lens business based in Tokyo and which serves regional and global customers. At the time, the agreement was with Essilor which joined with Luxottica in 2017. “Nikon Essilor Co. Ltd is a wholesale company based out of Ryogoku, Tokyo Japan. The Nikon-Essilor partnership began in 2000 with a strong focus on innovation. Our mutual success has been fostered by addressing the challenges confronting visual corrections and improving quality of life,” the company describes itself. “Our reputation is largely founded on our outstanding innovations, which continue to pave the way for the future of optics. Nikon-Essilor seeks to establish strong connections with partner opticians and customers through our common passion for pushing the limits of eyeglasses.” The 5.1% investment stake in Nikon by EssilorLuxottica equates to a 170 million euro ($187 million) investment and was revealed as part of a regulatory filing. Image credits: Header photo licensed via Depositphotos. PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003carticle data-post-id=\"763791\"\u003e\n\u003cheader\u003e\n\n\n\u003c/header\u003e\n\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-800x420.jpg\" alt=\"Graphic featuring the text \u0026#34;EssilorLuxottica\u0026#34; at the top. Below, a yellow logo with diagonal stripes and the text \u0026#34;Nikon\u0026#34; is displayed. The background consists of swirling dark and light patterns.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon-550x288.jpg 550w, https://petapixel.com/assets/uploads/2024/10/Worlds-Largest-Eyewear-Company-EssilorLuxottica-Buys-5.1-Stake-in-Nikon.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.essilorluxottica.com/en/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eEssilorLuxottica\u003c/a\u003e, the world’s largest eyewear company, has purchased a 5.1% stake in Nikon and is treating it as a “long-term financial investment to support the company and its management.”\u003c/p\u003e  \u003cp\u003eWhile its name is less known by design, EssilorLuxottica is the largest company in the global eyewear space as it owns several brands like Ray-Ban, Oakley, Persol, and Vogue Eyewear, as well as the exclusive rights to produce eyewear with many high-end fashion names like Prada. It is also the parent company of LensCrafters, Pearle Vision, and Sunglass Hut as well as eyewear insurance company EyeMed. Since it produces glasses, owns the stores that sell them, and owns an insurance company that is accepted at those stores, there is a strong argument that EssilorLuxottica is vertically integrated. \u003c/p\u003e \u003cp\u003eIt is also the company that Meta chose to partner with to produce its Ray-Ban smart glasses \u003ca href=\"https://petapixel.com/2021/09/09/facebook-and-ray-ban-launch-camera-equipped-smart-glasses/\" data-wpel-link=\"internal\"\u003ein 2021\u003c/a\u003e and with whom \u003ca href=\"https://petapixel.com/2023/09/27/metas-second-gen-ray-ban-smart-glasses-sport-better-cameras-and-ai/\" data-wpel-link=\"internal\"\u003eit continues to work\u003c/a\u003e. In July of last year, EssilorLuxottica purchased \u003ca href=\"https://petapixel.com/2023/07/28/kodak-is-indefinitely-licensing-its-brand-to-the-worlds-largest-eyewear-company/\" data-wpel-link=\"internal\"\u003ethe indefinite rights to use Kodak’s brand\u003c/a\u003e for any products or services in connection with its business. \u003c/p\u003e \u003cp\u003eAs of October 2024, the company has a market cap \u003ca href=\"https://companiesmarketcap.com/essilor-luxottica/marketcap/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eof $106.24 billion\u003c/a\u003e. \u003c/p\u003e \u003cp\u003eNow the eyewear brand has invested in Nikon. This is, however, not the first time the two companies have gotten together. \u003ca href=\"https://www.reuters.com/markets/asia/essilorluxottica-sees-5-stake-nikon-financial-investment-source-says-2024-10-08/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eAccording to \u003cem\u003eReuters\u003c/em\u003e\u003c/a\u003e, EssilorLuxottica entered into a joint venture with Nikon in 2000 to create Nikon-Essilor, a wholesale lens business based in Tokyo and which serves regional and global customers. At the time, the agreement was with Essilor which joined with Luxottica in 2017. \u003c/p\u003e \u003cp\u003e“Nikon Essilor Co. Ltd is a wholesale company based out of Ryogoku, Tokyo Japan. The Nikon-Essilor partnership began in 2000 with a strong focus on innovation. Our mutual success has been fostered by addressing the challenges confronting visual corrections and improving quality of life,” the company describes itself.\u003c/p\u003e\n\u003cp\u003e“Our reputation is largely founded on our outstanding innovations, which continue to pave the way for the future of optics. Nikon-Essilor seeks to establish strong connections with partner opticians and customers through our common passion for pushing the limits of eyeglasses.”\u003c/p\u003e \u003cp\u003eThe 5.1% investment stake in Nikon by EssilorLuxottica equates to a 170 million euro ($187 million) investment and was revealed as part of a regulatory filing. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Header photo licensed via \u003ca href=\"https://depositphotos.com/\" rel=\"nofollow external noopener\" data-wpel-link=\"external\" target=\"_blank\"\u003eDepositphotos\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e  \u003c/div\u003e\n\n\n\u003cdiv\u003e\n\u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\n\n\n\n\u003c/div\u003e\n\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-14T16:10:27Z",
  "modifiedTime": null
}
