{
  "id": "6330f7ab-24d8-42fc-a073-98d2c351e19b",
  "title": "The New Sony a1 II Has Better Dynamic Range Than the Original a1",
  "link": "https://petapixel.com/2024/12/26/the-new-sony-a1-ii-has-better-dynamic-range-than-the-original-a1/",
  "description": "Very shortly after publishing the dynamic range performance for Canon's latest flagship camera, the EOS R1, the prolific Bill Claff at Photons to Photos added Sony's new flagship, the a1 II, to his ever-expanding library. [Read More]",
  "author": "Jeremy Gray",
  "published": "Thu, 26 Dec 2024 20:38:24 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Equipment",
    "News",
    "dynamicrange",
    "flagship",
    "flagshipcamera",
    "photonstophotos",
    "Sony",
    "sonya1",
    "sonya1ii",
    "sonya1markii"
  ],
  "byline": "Jeremy Gray",
  "length": 2693,
  "excerpt": "The Sony a1 II really can do it all.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "Very shortly after publishing the dynamic range performance for Canon’s latest flagship camera, the EOS R1, the prolific Bill Claff at Photons to Photos added Sony’s new flagship, the a1 II, to his ever-expanding library. Although the Sony a1 II shares its sensor and imaging pipeline with its predecessor, the new a1 II doesn’t perform the same as the original a1 in terms of dynamic range, neither in terms of the maximum photographic dynamic range (PDR) or the sensor’s behavior as ISO increases. The a1 II peaks at 11.61 PDR, while the original a1 maxes out at 11.34, 0.27 steps lower. Both cameras, unsurprisingly, deliver their best dynamic range performance at their base ISO of 100. Sony a1 II (black) versus a1 (blue) dynamic range performance | Credit: Photons to Photos The reasonable dynamic range improvement is quite interesting in and of itself, but there’s another surprise on offer. Like many cameras, the a1 and a1 II’s dynamic range steadily decrease as ISO increases, until a point where the camera swaps amplification behavior and dynamic range spikes a bit. It’s basically a free boost to dynamic range, although one that sensors can only take advantage of once at a determined ISO. It’s a neat party trick that image sensor and camera engineers get to use to recover dynamic range above base ISO, but it’s a one-and-done, so precisely when this bell gets rung is a crucial decision and one that depends a bit on the sensor itself and the practical use cases for the camera. In the case of the a1, this spike occurred around ISO 500. With the a1 II, it’s at a slightly higher ISO, around 640. This means the a1 has a much better dynamic range than its successor at ISO 500, a shortfall the a1 II quickly corrects before recovering its dynamic range lead, which it holds throughout the rest of the ISO range. By the way, both the a1 and a1 II include baked-in noise reduction beyond ISO 12,800, which artificially inflates the dynamic range slightly at super-high ISOs. Overall, the Sony a1 and a1 II are among the best dynamic range performers in the full-frame camera segment. Sony’s best performers, the a7R series cameras, top out at around 11.7 PDR, barely better than the new a1 II. While the a7R IV and V offer more resolution than the a1 and a1 II — 61 megapixels versus 50 — in terms of overall image quality, Sony’s super-fast a1 cameras are not far off the pace. The a1 II really can do it all. Image credits: Featured image created using an asset licensed via Depositphotos. PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"773979\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured.jpg\" alt=\"The image shows a Sony Alpha 1 camera, featuring a black body with a prominent grip, numerous control dials, and an exposed sensor in the center. The brand name \u0026#34;Sony\u0026#34; is displayed on the top. The background is a smoky gray.\" width=\"1600\" height=\"840\" srcset=\"https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured.jpg 1600w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-dynamic-range-featured-550x288.jpg 550w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"/\u003e\u003c/p\u003e \u003cp\u003eVery shortly after publishing the \u003ca href=\"https://petapixel.com/2024/12/24/the-canon-eos-r1-vs-r3-dynamic-range-showdown/\" data-wpel-link=\"internal\"\u003edynamic range performance\u003c/a\u003e for Canon’s latest flagship camera, \u003ca href=\"https://petapixel.com/2024/11/16/canon-eos-r1-review-a-flagship-made-for-a-select-few/\" data-wpel-link=\"internal\"\u003ethe EOS R1\u003c/a\u003e, the prolific Bill Claff at \u003ca href=\"https://www.photonstophotos.net/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003e\u003cem\u003ePhotons to Photos\u003c/em\u003e\u003c/a\u003e added Sony’s new flagship, \u003ca href=\"https://petapixel.com/2024/11/19/sony-new-a1-ii-pairs-updated-design-with-largely-familiar-performance/\" data-wpel-link=\"internal\"\u003ethe a1 II\u003c/a\u003e, to his ever-expanding library. \u003c/p\u003e  \u003cp\u003eAlthough the Sony a1 II \u003ca href=\"https://petapixel.com/2024/11/19/the-biggest-differences-between-the-sony-a1-and-the-new-sony-a1-ii/\" data-wpel-link=\"internal\"\u003eshares its sensor and imaging pipeline with its predecessor\u003c/a\u003e, the new a1 II doesn’t perform the same as the original a1 in terms of dynamic range, neither in terms of the maximum photographic dynamic range (PDR) or the sensor’s behavior as ISO increases. \u003c/p\u003e \u003cp\u003eThe a1 II peaks at 11.61 PDR, while the original a1 maxes out at 11.34, 0.27 steps lower. Both cameras, unsurprisingly, deliver their best dynamic range performance at their base ISO of 100. \u003c/p\u003e \u003cfigure id=\"attachment_773981\" aria-describedby=\"caption-attachment-773981\"\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-a1-dynamic-range-photons-to-photos.jpg\" alt=\"Graph comparing photographic dynamic range against ISO settings for two Sony cameras. Blue line with circles (Sony ILCE-1) and black line with triangles (Sony ILCE-1M2) both show a decreasing trend as ISO settings increase from 50 to 204800.\" width=\"1600\" height=\"872\" srcset=\"https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-a1-dynamic-range-photons-to-photos.jpg 1600w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-a1-dynamic-range-photons-to-photos-320x174.jpg 320w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-a1-dynamic-range-photons-to-photos-800x436.jpg 800w, https://petapixel.com/assets/uploads/2024/12/sony-a1-ii-a1-dynamic-range-photons-to-photos-1536x837.jpg 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"/\u003e\u003cfigcaption id=\"caption-attachment-773981\"\u003eSony a1 II (black) versus a1 (blue) dynamic range performance | Credit: Photons to Photos\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eThe reasonable dynamic range improvement is quite interesting in and of itself, but there’s another surprise on offer. Like many cameras, the a1 and a1 II’s dynamic range steadily decrease as ISO increases, until a point where the camera swaps amplification behavior and dynamic range spikes a bit. It’s basically a free boost to dynamic range, although one that sensors can only take advantage of once at a determined ISO. It’s a neat party trick that image sensor and camera engineers get to use to recover dynamic range above base ISO, but it’s a one-and-done, so precisely when this bell gets rung is a crucial decision and one that depends a bit on the sensor itself and the practical use cases for the camera. \u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/Hp3Vaud_csQ?si=fbwDthl8L0z7gUca\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e\n \u003cp\u003eIn the case of the a1, this spike occurred around ISO 500. With the a1 II, it’s at a slightly higher ISO, around 640. This means the a1 has a much better dynamic range than its successor at ISO 500, a shortfall the a1 II quickly corrects before recovering its dynamic range lead, which it holds throughout the rest of the ISO range. By the way, both the a1 and a1 II include baked-in noise reduction beyond ISO 12,800, which artificially inflates the dynamic range slightly at super-high ISOs. \u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/fpgWgKI2Suc?si=NDY9BIJ3tBAy4I60\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eOverall, the Sony a1 and a1 II are among the best dynamic range performers in the full-frame camera segment. Sony’s best performers, the a7R series cameras, top out at around 11.7 PDR, barely better than the new a1 II. While the a7R IV and V offer more resolution than the a1 and a1 II — 61 megapixels versus 50 — in terms of overall image quality, Sony’s super-fast a1 cameras are not far off the pace. \u003ca href=\"https://petapixel.com/2024/11/19/sony-a1-ii-hands-on-first-impressions-expensive-excellence/\" data-wpel-link=\"internal\"\u003eThe a1 II really can do it all\u003c/a\u003e. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Featured image created using an asset licensed via \u003ca href=\"https://depositphotos.com/\" rel=\"nofollow external noopener\" data-wpel-link=\"external\" target=\"_blank\"\u003eDepositphotos\u003c/a\u003e.\u003c/em\u003e \u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n    \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-26T20:38:24Z",
  "modifiedTime": null
}
