{
  "id": "78eac51e-ece4-43fc-9889-812666b6d06a",
  "title": "SmallRig’s New Parabolic Softboxes Set Up in Seconds",
  "link": "https://petapixel.com/2025/07/17/smallrigs-new-parabolic-softboxes-set-up-in-seconds/",
  "description": "SmallRig unveiled its new FP-60 and FP-90 Quick-Setup Folding Parabolic Softboxes, promising to cut lighting setup times in half … [Read More]",
  "author": "Kate Garibaldi",
  "published": "Thu, 17 Jul 2025 21:45:21 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Equipment",
    "Lighting",
    "News",
    "fp60",
    "fp90",
    "lighting",
    "parabolic",
    "smallrig",
    "softbox"
  ],
  "byline": "Kate Garibaldi",
  "length": 3142,
  "excerpt": "SmallRig's new parabolic softboxes can set up in seconds.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "SmallRig unveiled its new FP-60 and FP-90 Quick-Setup Folding Parabolic Softboxes, promising to cut lighting setup times in half with a revolutionary pull-and-shoot system. Designed for both studio professionals and on-the-go creatives, these softboxes aim to deliver next-gen speed without compromising on quality. Speed Meets Precision The SmallRig FP-60 and FP-90 are designed with a quick-release, umbrella-style structure that allows photographers to deploy them in a single motion. This upgraded mechanism means no more fidgeting with rods or complicated assembly. With their 16-rib design, the softboxes open effortlessly, ensuring an even spread of light for portraits, product shots, and more. SmallRig’s emphasis on simplicity extends beyond just setup time; the softboxes are also engineered for anti-pinch deployment, eliminating the common issue of stuck panels or misaligned frames. The dual-layer diffusion and reflective lining offer even, ultra-soft light that promises to enhance the texture and tone of any shot. With these features, SmallRig combines the efficiency of speed with the subtlety of professional-grade lighting. Built for Durability While the FP-60 and FP-90 softboxes are quick to deploy, they also come built to last. Constructed with sturdy stainless steel ribs, they offer durability without adding unnecessary weight. The FP-60 weighs 31 ounces (900 grams), while the larger FP-90 weighs 42 ounces (1,200 grams), making them both light enough for portability yet robust enough for constant use. They also come with essential accessories, including inner and outer diffusion cloths, a honeycomb grid, and a convenient carrying bag, making them adaptable to a variety of lighting setups. Compatibility, Portability, and Versatility Both the FP-60 and FP-90 feature a standard Bowens mount, a universal system known for its wide compatibility with a range of lighting equipment. The buckle design enables photographers to quickly switch accessories or modify setups, providing the flexibility needed on set or during location shoots. When opened, the FP-60 is 23.6 x 15.7 inches (600 x 400 millimeters), and the FP-90 is 35.4 x 23.6 inches (900 x 600 millimeters). For photographers on the go, the FP-60 is compact when stored, measuring 25.2 x 8.7 x 2.7 inches (640 x 220 x 70 millimeters), while the FP-90 Folding Parabolic Softbox measures 35.4 x 8.7 x 3.3 inches (900 x 220 x 85 millimeters). The FP-60 and FP-90 Quick-Setup Folding Parabolic Softboxes offer a welcome solution for photographers who need to streamline their lighting setup without compromising on results. Whether a seasoned pro or an enthusiast, these softboxes promise to save users time with their quick-release functionality, sturdy build, and professional light diffusion. Pricing and Availability SmallRig’s FP-60 Quick-Setup Folding Parabolic Softbox is priced at $110, while the larger FP-90 model retails for $150. Image credits: SmallRig PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"805297\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-800x420.jpg\" alt=\"A film set with a softbox light and microphone above two people talking at a table in a library, next to a studio photo of the same softbox light mounted on a stand against a white background.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-800x420.jpg 800w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-320x168.jpg 320w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-150x79.jpg 150w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-300x157.jpg 300w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-400x209.jpg 400w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured-550x288.jpg 550w, https://petapixel.com/assets/uploads/2025/07/smallrig-umbrella-featured.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eSmallRig unveiled its new FP-60 and FP-90 Quick-Setup Folding Parabolic Softboxes, promising to cut lighting setup times in half with a revolutionary pull-and-shoot system. Designed for both studio professionals and on-the-go creatives, these softboxes aim to deliver next-gen speed without compromising on quality.\u003c/p\u003e \u003ch2\u003eSpeed Meets Precision\u003c/h2\u003e \u003cp\u003eThe \u003ca href=\"https://www.smallrig.com/Quick-Setup-Folding-Parabolic-Softbox.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eSmallRig FP-60 and FP-90\u003c/a\u003e are designed with a quick-release, umbrella-style structure that allows photographers to deploy them in a single motion. This upgraded mechanism means no more fidgeting with rods or complicated assembly. With their 16-rib design, the softboxes open effortlessly, ensuring an even spread of light for portraits, product shots, and more.\u003c/p\u003e \u003cp\u003eSmallRig’s emphasis on simplicity extends beyond just setup time; the softboxes are also engineered for anti-pinch deployment, eliminating the common issue of stuck panels or misaligned frames. The dual-layer diffusion and reflective lining offer even, ultra-soft light that promises to enhance the texture and tone of any shot. With these features, SmallRig combines the efficiency of speed with the subtlety of professional-grade lighting.\u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-800x447.jpg\" alt=\"A person holds a folded, compact softbox light modifier against their side. Text highlights its flat storage design, measuring 64 cm long and weighing 900g when stored, with an orange background.\" width=\"800\" height=\"447\" srcset=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-800x447.jpg 800w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-320x179.jpg 320w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90.jpg 1009w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-2-800x584.jpg\" alt=\"A comparison of fruit photographed with and without a softbox. The left image shows harsh shadows without a softbox, while the right image shows softer shadows with a softbox. Text explains dual-layer diffusion for even illumination.\" width=\"800\" height=\"584\" srcset=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-2-800x584.jpg 800w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-2-320x234.jpg 320w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-2.jpg 1044w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DMK2jHKBmya/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e\n \u003c/center\u003e \u003ch2\u003eBuilt for Durability\u003c/h2\u003e \u003cp\u003eWhile the FP-60 and FP-90 softboxes are quick to deploy, they also come built to last. Constructed with sturdy stainless steel ribs, they offer durability without adding unnecessary weight. The FP-60 weighs 31 ounces (900 grams), while the larger FP-90 weighs 42 ounces (1,200 grams), making them both light enough for portability yet robust enough for constant use. They also come with essential accessories, including inner and outer diffusion cloths, a honeycomb grid, and a convenient carrying bag, making them adaptable to a variety of lighting setups.\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-3-800x234.jpg\" alt=\"A person attaches a 135mm quick-release bayonet mount adapter to equipment; four compatible adapter types are displayed on the right: Profoto, Elinchrom, Broncolor (L Mount), and Broncolor (S Mount).\" width=\"800\" height=\"234\" srcset=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-3-800x234.jpg 800w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-3-320x94.jpg 320w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-3.jpg 1036w\" sizes=\"auto, (max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-4-800x220.jpg\" alt=\"Three images showcase features of a product: dual-layer waterproof lining with water droplets, a hand holding a convenient storage bag, and stainless steel ribs for strong support. Text overlays describe each feature.\" width=\"800\" height=\"220\" srcset=\"https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-4-800x220.jpg 800w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-4-320x88.jpg 320w, https://petapixel.com/assets/uploads/2025/07/SmallRig-FP-60-FP-90-Image-4.jpg 1036w\" sizes=\"auto, (max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003ch2\u003eCompatibility, Portability, and Versatility\u003c/h2\u003e \u003cp\u003eBoth the FP-60 and FP-90 feature a standard Bowens mount, a universal system known for its wide compatibility with a range of lighting equipment. The buckle design enables photographers to quickly switch accessories or modify setups, providing the flexibility needed on set or during location shoots.\u003c/p\u003e \u003cp\u003eWhen opened, the FP-60 is 23.6 x 15.7 inches (600 x 400 millimeters), and the FP-90 is 35.4 x 23.6 inches (900 x 600 millimeters).\u003c/p\u003e \u003cp\u003eFor photographers on the go, the FP-60 is compact when stored, measuring 25.2 x 8.7 x 2.7 inches (640 x 220 x 70 millimeters), while the FP-90 Folding Parabolic Softbox measures 35.4 x 8.7 x 3.3 inches (900 x 220 x 85 millimeters).\u003c/p\u003e \u003cp\u003eThe FP-60 and FP-90 Quick-Setup Folding Parabolic Softboxes offer a welcome solution for photographers who need to streamline their lighting setup without compromising on results. Whether a seasoned pro or an enthusiast, these softboxes promise to save users time with their quick-release functionality, sturdy build, and professional light diffusion. \u003c/p\u003e\n \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/qfJ05tVLGFk?si=dJSbKk6ZcomAkpB1\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003ch2\u003ePricing and Availability\u003c/h2\u003e \u003cp\u003e\u003ca href=\"https://www.smallrig.com/Quick-Setup-Folding-Parabolic-Softbox.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eSmallRig’s FP-60 Quick-Setup Folding Parabolic Softbox\u003c/a\u003e is priced at $110, while the larger \u003ca href=\"https://www.smallrig.com/Quick-Setup-Folding-Parabolic-Softbox.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eFP-90\u003c/a\u003e model retails for $150. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e SmallRig\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-17T21:45:21Z",
  "modifiedTime": null
}
