{
  "id": "830fd3ec-2f88-4fe4-bcf7-293be09ce2b6",
  "title": "Photographer Helps Save Endangered Sea Turtle After Shark Attack",
  "link": "https://petapixel.com/2025/04/05/photographer-helps-save-endangered-sea-turtle-after-shark-attack/",
  "description": "An underwater photographer helped save an endangered loggerhead sea turtle that is believed to be the victim of a shark attack. [Read More]",
  "author": "Kate Garibaldi",
  "published": "Sat, 05 Apr 2025 17:30:17 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "News",
    "endangeredspecies",
    "florida",
    "floridakeys",
    "loggerhead",
    "mikepapish",
    "seaturtle",
    "theturtlehospital",
    "turtle"
  ],
  "byline": "Kate Garibaldi",
  "length": 4101,
  "excerpt": "An underwater photographer helped save an endangered loggerhead sea turtle that is believed to be the victim of a shark attack.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "An underwater photographer helped save an endangered loggerhead sea turtle that is believed to be the victim of a shark attack. While photographing near Alligator Reef off Islamorada in the Florida Keys, underwater photographer Mike Papish noticed a turtle struggling to swim. “I saw he had a badly damaged flipper, and his face was a little mashed-up from a shark attack,” Papish told NBC News. Thankfully for the turtle, Papish and his friends from Sundance Water Sports, Brock, Cody and, Captain Eamon, put together a plan to rescue him. They used their boat to bring the animal to shore and contacted The Turtle Hospital, who quickly arrived. A non-profit dedicated solely to the rehabilitation of endangered sea turtles, The Turtle Hospital has successfully treated over 3,000 sea turtles since its founding in 1986. “The Turtle Hospital contains up-to-date equipment needed to perform a variety of surgeries on different species of sea turtles,” its website explains. “The Turtle Hospital is very fortunate to have a large rehabilitation facility. The chain link enclosure is covered with a shaded cloth for the comfort of the turtles, the employees and the guests. Inside are 23 individual tanks, ranging in size from 150 – 800 gallons – in addition to the tidal pool made up of 100,000-gallons of saltwater.” As the only organization of its kind in Florida, it was perfect to contact, as the facility can handle exactly such a situation. The Turtle Hospital staff quickly arrived in their ambulance, which was built precisely to move sea turtles that can weigh 300 pounds and transport the animal into their care. At the facility, manager and specialist Bette Zirkelbach, along with veterinarian Dr. Terry Norton, were able to assess the injured sea turtle. His injuries were severe but treatable, including the loss of part of his front left flipper and visible scars on his head. The endangered loggerhead sea turtle, now nicknamed “Lenny,” is believed to be six to seven decades old. For his species, this is already an achievement, let alone surviving such an ordeal. Loggerhead sea turtles are a long-lived species named after their large heads. They face many threats including fishing bycatch, habitat loss, vessel strikes, direct harvest of the animals and their eggs. They are also vulnerable to ocean pollution and marine debris, often mistaking plastic discarded by humans, such as fishing line and plastic, particularly bags, as food. Due to extreme population loss and continued threats, loggerhead sea turtles are listed on CITES Appendix I which includes species threatened with extinction and provides the greatest level of protection. Of anywhere on Earth, South Florida is a special habitat for these rare animals. Loggerhead sea turtles have nine distinct population segments, and are found worldwide. Despite this, recent studies posted by the National Oceanic and Atmospheric Administration (NOAA) show that “only two loggerhead nesting beaches have greater than 10,000 females nesting per year: South Florida and Oman.” Therefore, Lenny as a mature adult is a crucial individual animal to help save. Zirkelbach spoke with NBC News about the struggles that these endangered sea turtles face. “These turtles are up against a lot when they’re hatchlings. Everything eats baby turtles, from crabs to birds to fish, once they enter the ocean. Two red ant bites can kill a hatchling. So when you realize that and what Lenny would have had to endure to make it out to sea and survive, you know, he beat the statistics,” Zirkelbach explained. “There are not a lot of predators, right, that could get a mouth around a turtle that size. So we are assuming it was a very large shark.” Thankfully, after a few weeks in The Turtle Hospital’s expert care, Lenny was able to be released. Photographer Mike Papish accompanied The Turtle Hospital staff to help give Lenny a warm send-off and take a few photos to remember him by. “He looked back as I was getting his last shot, and then he just kind of waved,” Papish said. Image credits: NBC News, Mike Papish",
  "image": "https://petapixel.com/assets/uploads/2025/04/Lenny-Loggerhead-Sea-Turtle-by-Mike-Papish-PetaPixel-BG.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/_nPWL1YLkxU?si=sug0Hg2TGi2EB47K\u0026amp;start=1145\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eAn underwater photographer helped save an endangered loggerhead sea turtle that is believed to be the victim of a shark attack.\u003c/p\u003e  \u003cp\u003eWhile photographing near Alligator Reef off Islamorada in the Florida Keys, underwater photographer \u003ca href=\"https://www.instagram.com/underwaterexploring/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eMike Papish\u003c/a\u003e noticed a turtle struggling to swim.\u003c/p\u003e \u003cp\u003e“I saw he had a badly damaged flipper, and his face was a little mashed-up from a shark attack,” Papish told \u003ca href=\"https://www.nbcnews.com/news/animal-news/sea-turtle-rescue-florida-rcna199618\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eNBC News.\u003c/a\u003e\u003c/p\u003e \u003cp\u003eThankfully for the turtle, Papish and his friends from \u003ca href=\"https://www.instagram.com/sundancewatersports/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eSundance Water Sports\u003c/a\u003e, Brock, Cody and, Captain Eamon, put together a plan to rescue him. They used their boat to bring the animal to shore and contacted The Turtle Hospital, who quickly arrived.\u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DHMvpM8R4hD/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003eA non-profit dedicated solely to the rehabilitation of endangered sea turtles, \u003ca href=\"https://turtlehospital.org/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eThe Turtle Hospital\u003c/a\u003e has successfully treated over 3,000 sea turtles since its founding in 1986.\u003c/p\u003e\n \u003cp\u003e“The Turtle Hospital contains up-to-date equipment needed to perform a variety of surgeries on different species of sea turtles,” its website explains.\u003c/p\u003e \u003cp\u003e“The Turtle Hospital is very fortunate to have a large rehabilitation facility. The chain link enclosure is covered with a shaded cloth for the comfort of the turtles, the employees and the guests. Inside are 23 individual tanks, ranging in size from 150 – 800 gallons – in addition to the tidal pool made up of 100,000-gallons of saltwater.”\u003c/p\u003e \u003cp\u003eAs the only organization of its kind in Florida, it was perfect to contact, as the facility can handle exactly such a situation. The Turtle Hospital staff quickly arrived in their ambulance, which was built precisely to move sea turtles that can weigh 300 pounds and transport the animal into their care. \u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DH__OPQuzIi/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003eAt the facility, manager and specialist Bette Zirkelbach, along with veterinarian Dr. Terry Norton, were able to assess the injured sea turtle. His injuries were severe but treatable, including the loss of part of his front left flipper and visible scars on his head. The endangered loggerhead sea turtle, now nicknamed “Lenny,” is believed to be six to seven decades old. For his species, this is already an achievement, let alone surviving such an ordeal.\u003c/p\u003e \u003cp\u003eLoggerhead sea turtles are a long-lived species named after their large heads. They face many threats including fishing bycatch, habitat loss, vessel strikes, direct harvest of the animals and their eggs. They are also vulnerable to ocean pollution and marine debris, often mistaking plastic discarded by humans, such as fishing line and plastic, particularly bags, as food. \u003c/p\u003e \u003cp\u003eDue to extreme population loss and continued threats, loggerhead sea turtles are \u003ca href=\"https://cites.org/sites/default/files/documents/E-CoP19-64-02.pdf\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003elisted on CITES Appendix I\u003c/a\u003e which includes species threatened with extinction and provides the greatest level of protection.\u003c/p\u003e\n \u003cp\u003eOf anywhere on Earth, South Florida is a special habitat for these rare animals. Loggerhead sea turtles have nine distinct population segments, and are found worldwide. Despite this, recent studies posted by the \u003ca href=\"https://www.fisheries.noaa.gov/species/loggerhead-turtle\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eNational Oceanic and Atmospheric Administration (NOAA)\u003c/a\u003e show that “only two loggerhead nesting beaches have greater than 10,000 females nesting per year: South Florida and Oman.”\u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DHUbkfAR3xY/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003eTherefore, Lenny as a mature adult is a crucial individual animal to help save. \u003ca href=\"https://www.nbcnews.com/news/animal-news/sea-turtle-rescue-florida-rcna199618\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eZirkelbach spoke with NBC News\u003c/a\u003e about the struggles that these endangered sea turtles face. \u003c/p\u003e \u003cp\u003e“These turtles are up against a lot when they’re hatchlings. Everything eats baby turtles, from crabs to birds to fish, once they enter the ocean. Two red ant bites can kill a hatchling. So when you realize that and what Lenny would have had to endure to make it out to sea and survive, you know, he beat the statistics,” Zirkelbach explained.\u003c/p\u003e \u003cp\u003e“There are not a lot of predators, right, that could get a mouth around a turtle that size. So we are assuming it was a very large shark.”\u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DHuPD0BM3Kj/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003eThankfully, after a few weeks in The Turtle Hospital’s expert care, Lenny was able to be released. Photographer Mike Papish accompanied The Turtle Hospital staff to help give Lenny a warm send-off and take a few photos to remember him by.\u003c/p\u003e\n \u003cp\u003e“He looked back as I was getting his last shot, and then he just kind of waved,” Papish said.\u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e NBC News, Mike Papish\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-05T17:30:17Z",
  "modifiedTime": null
}
