{
  "id": "84f9ae3a-7fb9-4e29-a8fa-e456866510b6",
  "title": "Panasonic DC-ZS99 Review: A Disappointing Trend Chaser",
  "link": "https://petapixel.com/2025/01/02/panasonic-dc-zs99-review-a-disappointing-trend-chaser/",
  "description": "Here, we thought that the smartphone would kill the point-and-shoot digital camera. There is, instead, a steady resurgence with more and more (mostly young) people purchasing used point-and-shoot cameras. The Panasonic ZS99 aims to capitalize on the trend, offering a modernized take on an older P\u0026S model. [Read More]",
  "author": "Chris Niccolls",
  "published": "Thu, 02 Jan 2025 15:00:18 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Equipment",
    "Reviews",
    "cameravssmartphone",
    "nikoncoolpixa1000",
    "panasonicdczs99",
    "panasonicdxzs70",
    "panasonicdxzs80",
    "pocketcamera",
    "pointandshoot",
    "pointandshootcamera",
    "smartphone",
    "travelcamera",
    "vintagecamera"
  ],
  "byline": "Chris Niccolls",
  "length": 9160,
  "excerpt": "A questionable rehash that is worse than its predecessor in key ways.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "Here, we thought that the smartphone would kill the point-and-shoot digital camera. There is, instead, a steady resurgence with more and more (mostly young) people purchasing used point-and-shoot cameras. The Panasonic ZS99 aims to capitalize on the trend, offering a modernized take on an older P\u0026S model. I think there are only two reasons to buy a point-and-shoot digital camera and expect a different result from a smartphone. Smartphones take stunningly good images as far as image quality goes relative to their tiny sensor sizes, so you either get a camera with a significantly larger sensor than a phone or get one with a much bigger telephoto zoom range. The Panasonic ZS99 is a brand-new design that seeks to do the latter. With the ZS99 available for $499, is its larger zoom range worth the price of admission? The ZS99 looks exactly like the older ZS80. This is good because they were always a refined and classy-looking camera series. Panasonic DC-ZS99 Review: How it Feels The ZS99 is essentially a rehash of the older ZS80. It borrows its appearance and many components, including the lens and sensor assembly, from the ZS80. The sensor is a relatively small Type 1/2.3 20-megapixel chip, probably the same sensor we have seen in multiple Panasonic point-and-shoots for years. We get the excellent 30x zoom lens from the ZS80, which provides a full-frame equivalent range of 24-720mm. Compared to a smartphone, this gives a considerable reach advantage over even a 10x telephoto camera, and most phones only feature a 3x or 5x telephoto. The grip is sufficient, and the camera is very pocketable, with no significant changes in overall look from its predecessor. The camera still has the same 3-inch 1.84-million dot LCD panel, which flips up above the camera into selfie mode. The battery is still a classic Panasonic BLG-10PP type, and the camera has a single UHS-I SD slot. Very little has changed over the years. The back panel flips up in one direction only. This is great for selfies but not much else. Sadly there is no EVF located on the ZS99. It used to sit in the top-left corner, and I’m sad to see it go. At least the USB connection is now a modern type-C, which complies with worldwide regulations, and the Bluetooth is now 5.0 compliant. However, this comes with a major loss as the EVF that graced the ZS80 has been removed. I consider this a huge oversight as the back LCD panel is not ideal in bright conditions and we lose the ability to bring the camera up against the face when shooting the maximum telephoto ranges to stabilize the whole platform. I constantly hear that younger generations of photographers who are used to shooting phones at arm’s length don’t care about EVFs. But this doesn’t give new shooters enough credit. Anyone who tries one will surely come to use it more often and will miss it sorely if it ceases to exist on future models. They may not know what they are missing, but that doesn’t mean they will eventually fail to appreciate the omission. We now have a modern USB-C port on the camera. The camera can also connect wirelessly to a phone via Bluetooth or Wi-Fi. I mostly spent the day looking for nice natural light and the warmth of winter sunlight. Color is vibrant and pleasant overall. I’ve always liked the color palette of Panasonic cameras. Panasonic DC-ZS99 Review: How it Shoots I always get a tinge of nostalgia when I review a compact camera. I grew up selling these products, and I treasure the opportunity to test them again all these years later. However, a big part of the nostalgic feeling is due to the cameras being essentially the same as the original models, making the overall experience a genuinely vintage one. To its credit, though, the ZS99 utilizes Panasonic’s DFD contrast-based autofocusing, which is snappy and precise. The camera is swift, too, and the shutter release feels good. The zoom operates with a basic rocker switch around the shutter and zooms the lens with adequate haste. There is a manual control command dial, and the ZS99 has both a front and rear dial to change settings. I could never get tight compositions like this at a distance with a smartphone. Cropping heavily on a phone will throw all semblance of detail away. The ZS99 is a convenient walk-around camera with an enormous zoom range in a small package. The lens is sharp enough for the 20-megapixel sensor but tends to flare slightly from bright light sources. I often found myself shielding the front element with my left hand in order to prevent heavy ghosting in the image. The sensor is prone to some reflections as well when pointed at the Sun. The ZS99 offers a RAW file format, but the small sensor in this camera does not deliver much dynamic range. Similarly, the ZS99 also has full manual control, but the aperture range is limited to f/8, and diffraction softens the image significantly. The depth of field doesn’t change that much either, and although shutter speeds can be set slower, there is no option for filters to help accommodate longer exposures. This is all to say that although the ZS99 does offer some creative control, there isn’t much incentive to use it, and it will probably be avoided by most users. Video is unchanged from before, which means it is records 4K video, but only at 30 frames per second. If you are okay with lower-resolution slow motion, you caokay 60fps at 1080p and 120fps at 720p. The ZS99 has a huge zoom range, but it’s not a bright lens by any stretch. If you try to match on a smartphone what the ZS99 can do with its lens, you’ll be disappointed. The lens will flare and ghosts will appear all over the frame in bright conditions. The sensor will also reflect a rainbow pattern towards the sun. Image quality is not why people buy these cameras, although there is a certain classic charm to the vintage look of these older sensors. Colors are nice overall, but skin tones tend to take on a waxy look, and the images are over-sharpened across the board. A modern smartphone’s main camera will take a better photo in most situations, especially when it comes to dynamic range. Although a smartphone controls the look of the depth of field in a largely artificial way, especially when shooting portraits, the results are far more usable nowadays, and the ZS99 can’t come close. However, The ZS99 does a better job when competing with the 5x lens on most phones and easily dominates when the zoom is pushed anywhere beyond that mark. The ZS99 is an excellent picture taker because of its telephoto reach, and its main strength is the versatility it offers while still fitting in a pocket. Don’t worry about trying to get nice sunstars or anything. The ZS99 has some creative control, but most will use it as an automatic camera. Lots of depth of field whether you want it or not. Unlike a phone, there is no way to digitally blur the background in the camera. Letting the shadows go dark is fine. Boosting them would be an issue with a lot of digital noise added. Panasonic DC-ZS99 Review: A Lazy Experience Panasonic is not the only one that has been guilty of rereleasing an old product with a few changes and a new name. The demand for compact digital cameras is rising, and it makes sense to modernize the products to meet the demand. Major improvements require money and extensive R\u0026D, so it is understandable that most manufacturers are simply rehashing the back catalog. Still, I would be far more excited to see new camera designs that offer substantial improvements to image quality and functionality. Connectivity is more important than ever, but the ZS99 interfaces with a phone in much the same way the older cameras did before, so no fundamental changes there. We are left with a camera that complies with the latest USB standards but loses a significant piece of hardware, all at a $499 price, equivalent to what the older products sold for. It could be that my perspective is outdated, though, and that new users won’t care or even desire the things I wish the ZS99 had. I would buy the older ZS80 used and get the same image quality and versatility without having to give up the EVF. The ZS99 does what it is designed for well. I wish it did a little more. The shutter is very responsive on the ZS99, which makes the timing of shots more predictable and effective. Wildlife is certainly within reach of the ZS99 lens. The built-in IBIS does a good job of steadying the camera. Are There Alternatives? The only real path to get the same kind of zoom range in a small package is the used market. The older Panasonic ZS80 or even ZS70 will provide the same lens and sensor assembly plus the addition of an EVF to compose with. The Nikon Coolpix A1000 is less detailed and slightly bulkier, but it does give a longer 35x zoom lens. I just liked the simple composition and play of light in this photo. Skin tones are okay, but any highlights can block up real quick. Luckily, I had soft, natural light for this portrait. Should You Buy It? No. I don’t think the ZS99 is desirable, but I’m probably out of touch. If you want a new camera that beats a smartphone’s zoom range handily, the ZS99 is your best bet.",
  "image": "https://petapixel.com/assets/uploads/2024/12/zs99-review-header.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/ubwJL_kWIwM?si=0mdLHmb9UyD2qjv-\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eHere, we thought that the smartphone would kill the point-and-shoot digital camera. There is, instead, a steady resurgence with more and more (mostly young) people purchasing used point-and-shoot cameras. The Panasonic ZS99 aims to capitalize on the trend, offering a modernized take on an older P\u0026amp;S model. \u003c/p\u003e  \u003cp\u003eI think there are only two reasons to buy a point-and-shoot digital camera and expect a different result from a smartphone. Smartphones take stunningly good images as far as image quality goes relative to their tiny sensor sizes, so you either get a camera with a significantly larger sensor than a phone or get one with a much bigger telephoto zoom range. The Panasonic ZS99 is a brand-new design that seeks to do the latter. With the ZS99 available for $499, is its larger zoom range worth the price of admission?  \u003c/p\u003e \u003cfigure id=\"attachment_774265\" aria-describedby=\"caption-attachment-774265\"\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Beauty-800x450.jpg\" alt=\"A black and silver Lumix camera with a Leica lens sits on a wooden surface. The background is a blurred mix of white and brown tones.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Beauty-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Beauty-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Beauty-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Beauty-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774265\"\u003eThe ZS99 looks exactly like the older ZS80. This is good because they were always a refined and classy-looking camera series.\u003c/figcaption\u003e\u003c/figure\u003e \u003ch2\u003ePanasonic DC-ZS99 Review: How it Feels\u003c/h2\u003e \u003cp\u003eThe ZS99 is essentially a rehash of the older ZS80. It borrows its appearance and many components, including the lens and sensor assembly, from the ZS80. The sensor is a relatively small Type 1/2.3 20-megapixel chip, probably the same sensor we have seen in multiple Panasonic point-and-shoots for years. We get the excellent 30x zoom lens from the ZS80, which provides a full-frame equivalent range of 24-720mm. Compared to a smartphone, this gives a considerable reach advantage over even a 10x telephoto camera, and most phones only feature a 3x or 5x telephoto. \u003c/p\u003e \u003cp\u003eThe grip is sufficient, and the camera is very pocketable, with no significant changes in overall look from its predecessor. The camera still has the same 3-inch 1.84-million dot LCD panel, which flips up above the camera into selfie mode. The battery is still a classic Panasonic BLG-10PP type, and the camera has a single UHS-I SD slot. Very little has changed over the years.\u003c/p\u003e \u003cfigure id=\"attachment_774271\" aria-describedby=\"caption-attachment-774271\"\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Selfie-800x450.jpg\" alt=\"A Panasonic Lumix camera sits on a wooden surface in front of a rustic, weathered wooden wall. The camera\u0026#39;s LCD screen is flipped up, displaying its menu interface with various settings options.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Selfie-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Selfie-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Selfie-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Selfie-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774271\"\u003eThe back panel flips up in one direction only. This is great for selfies but not much else.\u003c/figcaption\u003e\u003c/figure\u003e\n \u003cfigure id=\"attachment_774270\" aria-describedby=\"caption-attachment-774270\"\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-No-EVF-800x450.jpg\" alt=\"Close-up of a digital camera screen displaying menu options, including Slide Show, Playback Mode, Protect, Rating, Title Edit, and Face Rec Edit. The background is blurred with a warm brown tone.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-No-EVF-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-No-EVF-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-No-EVF-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-No-EVF-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774270\"\u003eSadly there is no EVF located on the ZS99. It used to sit in the top-left corner, and I’m sad to see it go.\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eAt least the USB connection is now a modern type-C, which complies with worldwide regulations, and the Bluetooth is now 5.0 compliant. However, this comes with a major loss as the EVF that graced the ZS80 has been removed. I consider this a huge oversight as the back LCD panel is not ideal in bright conditions and we lose the ability to bring the camera up against the face when shooting the maximum telephoto ranges to stabilize the whole platform. \u003c/p\u003e \u003cp\u003eI constantly hear that younger generations of photographers who are used to shooting phones at arm’s length don’t care about EVFs. But this doesn’t give new shooters enough credit. Anyone who tries one will surely come to use it more often and will miss it sorely if it ceases to exist on future models. They may not know what they are missing, but that doesn’t mean they will eventually fail to appreciate the omission. \u003c/p\u003e \u003cfigure id=\"attachment_774272\" aria-describedby=\"caption-attachment-774272\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-USB-C-800x450.jpg\" alt=\"A person plugs a cable into the HDMI and charge port of a black camera. The camera is positioned on a wooden surface, and the person\u0026#39;s thumb is visible holding the plug.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-USB-C-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-USB-C-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-USB-C-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-USB-C-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774272\"\u003eWe now have a modern USB-C port on the camera. The camera can also connect wirelessly to a phone via Bluetooth or Wi-Fi.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774253\" aria-describedby=\"caption-attachment-774253\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010286-800x600.jpg\" alt=\"A wooden fence with a warm orange hue is illuminated by sunlight. In front of the fence, a utility pole stands with blue graffiti markings. Shadows of trees are cast on the fence, creating a contrasting pattern.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010286-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010286-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010286-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010286.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774253\"\u003eI mostly spent the day looking for nice natural light and the warmth of winter sunlight.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774251\" aria-describedby=\"caption-attachment-774251\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010273-600x800.jpg\" alt=\"A vibrant mural of a pink octopus with swirling tentacles painted on a blue wall. Nearby, colorful abstract shapes adorn the adjacent building. Wooden pallets and discarded items are scattered in the foreground, adding an urban feel.\" width=\"600\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010273-600x800.jpg 600w, https://petapixel.com/assets/uploads/2024/12/P1010273-240x320.jpg 240w, https://petapixel.com/assets/uploads/2024/12/P1010273-1152x1536.jpg 1152w, https://petapixel.com/assets/uploads/2024/12/P1010273.jpg 1350w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003cfigcaption id=\"caption-attachment-774251\"\u003eColor is vibrant and pleasant overall. I’ve always liked the color palette of Panasonic cameras.\u003c/figcaption\u003e\u003c/figure\u003e \u003ch2\u003ePanasonic DC-ZS99 Review: How it Shoots\u003c/h2\u003e \u003cp\u003eI always get a tinge of nostalgia when I review a compact camera. I grew up selling these products, and I treasure the opportunity to test them again all these years later. However, a big part of the nostalgic feeling is due to the cameras being essentially the same as the original models, making the overall experience a genuinely vintage one. \u003c/p\u003e\n \u003cp\u003eTo its credit, though, the ZS99 utilizes Panasonic’s DFD contrast-based autofocusing, which is snappy and precise. The camera is swift, too, and the shutter release feels good. The zoom operates with a basic rocker switch around the shutter and zooms the lens with adequate haste. \u003c/p\u003e \u003cfigure id=\"attachment_774269\" aria-describedby=\"caption-attachment-774269\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Mode-Dial-800x450.jpg\" alt=\"Close-up of a camera\u0026#39;s mode dial and power switch. The dial shows options like \u0026#34;M,\u0026#34; \u0026#34;A,\u0026#34; and \u0026#34;C\u0026#34; for different shooting modes. Next to it is a power switch labeled \u0026#34;ON/OFF\u0026#34; and a zoom button marked \u0026#34;W\u0026#34; and \u0026#34;T\u0026#34;. The background is wooden.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Mode-Dial-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Mode-Dial-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Mode-Dial-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Mode-Dial-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774269\"\u003eThere is a manual control command dial, and the ZS99 has both a front and rear dial to change settings.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774262\" aria-describedby=\"caption-attachment-774262\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010311-600x800.jpg\" alt=\"Two individuals stand facing a blue wall with a small window above them. The window is framed in white, with a red curtain and a neon sign that reads \u0026#34;Massage.\u0026#34; Both individuals are wearing hooded jackets. One holds a coffee cup.\" width=\"600\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010311-600x800.jpg 600w, https://petapixel.com/assets/uploads/2024/12/P1010311-240x320.jpg 240w, https://petapixel.com/assets/uploads/2024/12/P1010311-1152x1536.jpg 1152w, https://petapixel.com/assets/uploads/2024/12/P1010311.jpg 1350w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003cfigcaption id=\"caption-attachment-774262\"\u003eI could never get tight compositions like this at a distance with a smartphone. Cropping heavily on a phone will throw all semblance of detail away.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774259\" aria-describedby=\"caption-attachment-774259\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010302-800x600.jpg\" alt=\"A colorful assortment of clothes is hanging on a rack, featuring various textures and patterns, including leopard print, faux fur, and suede. A pink price tag is visible, displaying \u0026#34;$15 or $30.\u0026#34; Bright sunlight highlights the fabric details.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010302-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010302-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010302-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010302.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774259\"\u003eThe ZS99 is a convenient walk-around camera with an enormous zoom range in a small package.\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eThe lens is sharp enough for the 20-megapixel sensor but tends to flare slightly from bright light sources. I often found myself shielding the front element with my left hand in order to prevent heavy ghosting in the image. The sensor is prone to some reflections as well when pointed at the Sun. The ZS99 offers a RAW file format, but the small sensor in this camera does not deliver much dynamic range. \u003c/p\u003e \u003cp\u003eSimilarly, the ZS99 also has full manual control, but the aperture range is limited to f/8, and diffraction softens the image significantly. The depth of field doesn’t change that much either, and although shutter speeds can be set slower, there is no option for filters to help accommodate longer exposures. \u003c/p\u003e \u003cp\u003eThis is all to say that although the ZS99 does offer some creative control, there isn’t much incentive to use it, and it will probably be avoided by most users. \u003c/p\u003e\n \u003cp\u003eVideo is unchanged from before, which means it is records 4K video, but only at 30 frames per second. If you are okay with lower-resolution slow motion, you caokay 60fps at 1080p and 120fps at 720p. \u003c/p\u003e \u003cfigure id=\"attachment_774268\" aria-describedby=\"caption-attachment-774268\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Lens-800x450.jpg\" alt=\"Close-up of a camera lens with the text \u0026#34;DC VARIO-ELMAR 1:3.3-6.4/4.3 12.9 ASPH.\u0026#34; engraved on the edge. The lens surface has concentric circular patterns, creating a textured appearance. The background is softly blurred.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Lens-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Lens-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Lens-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-Lens-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774268\"\u003eThe ZS99 has a huge zoom range, but it’s not a bright lens by any stretch.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774273\" aria-describedby=\"caption-attachment-774273\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-vs-iPhone-720mm-800x450.jpg\" alt=\"Two side-by-side images of a Santa Claus figure dressed in a red suit with white trim, black belt, and hat. The Santa has a full white beard and is standing behind a black railing. Signs and foliage are visible in the background.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-vs-iPhone-720mm-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-vs-iPhone-720mm-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-vs-iPhone-720mm-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-vs-iPhone-720mm-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774273\"\u003eIf you try to match on a smartphone what the ZS99 can do with its lens, you’ll be disappointed.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774257\" aria-describedby=\"caption-attachment-774257\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010298-600x800.jpg\" alt=\"Street scene with people walking past a FedEx truck. A vintage-style neon sign reads \u0026#34;BLOCK\u0026#34; against a bright sun and partly cloudy sky. The urban setting includes a mix of building styles and bare trees.\" width=\"600\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010298-600x800.jpg 600w, https://petapixel.com/assets/uploads/2024/12/P1010298-240x320.jpg 240w, https://petapixel.com/assets/uploads/2024/12/P1010298-1152x1536.jpg 1152w, https://petapixel.com/assets/uploads/2024/12/P1010298.jpg 1350w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003cfigcaption id=\"caption-attachment-774257\"\u003eThe lens will flare and ghosts will appear all over the frame in bright conditions. The sensor will also reflect a rainbow pattern towards the sun.\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eImage quality is not why people buy these cameras, although there is a certain classic charm to the vintage look of these older sensors. Colors are nice overall, but skin tones tend to take on a waxy look, and the images are over-sharpened across the board. A modern smartphone’s main camera will take a better photo in most situations, especially when it comes to dynamic range. Although a smartphone controls the look of the depth of field in a largely artificial way, especially when shooting portraits, the results are far more usable nowadays, and the ZS99 can’t come close. However, The ZS99 does a better job when competing with the 5x lens on most phones and easily dominates when the zoom is pushed anywhere beyond that mark. The ZS99 is an excellent picture taker because of its telephoto reach, and its main strength is the versatility it offers while still fitting in a pocket.\u003c/p\u003e \u003cfigure id=\"attachment_774258\" aria-describedby=\"caption-attachment-774258\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010300-600x800.jpg\" alt=\"Red vintage sign reading \u0026#34;Block Tigerstedt Est. 1932\u0026#34; with decorative script, mounted on a building facade. The sun shines behind the sign, casting a glow. Blue sky with a few clouds in the background.\" width=\"600\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010300-600x800.jpg 600w, https://petapixel.com/assets/uploads/2024/12/P1010300-240x320.jpg 240w, https://petapixel.com/assets/uploads/2024/12/P1010300-1152x1536.jpg 1152w, https://petapixel.com/assets/uploads/2024/12/P1010300.jpg 1350w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003cfigcaption id=\"caption-attachment-774258\"\u003eDon’t worry about trying to get nice sunstars or anything. The ZS99 has some creative control, but most will use it as an automatic camera.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774255\" aria-describedby=\"caption-attachment-774255\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010294-800x600.jpg\" alt=\"Bare tree branches with clusters of red berries frame a clear blue sky with scattered clouds.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010294-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010294-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010294-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010294.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774255\"\u003eLots of depth of field whether you want it or not. Unlike a phone, there is no way to digitally blur the background in the camera.\u003c/figcaption\u003e\u003c/figure\u003e\n \u003cfigure id=\"attachment_774254\" aria-describedby=\"caption-attachment-774254\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010292-600x800.jpg\" alt=\"A building wall with two side-by-side windows featuring red and orange curtains. Shadows of tree branches are cast on the wall, and a bush is partially visible in the foreground.\" width=\"600\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010292-600x800.jpg 600w, https://petapixel.com/assets/uploads/2024/12/P1010292-240x320.jpg 240w, https://petapixel.com/assets/uploads/2024/12/P1010292-1152x1536.jpg 1152w, https://petapixel.com/assets/uploads/2024/12/P1010292.jpg 1350w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003cfigcaption id=\"caption-attachment-774254\"\u003eLetting the shadows go dark is fine. Boosting them would be an issue with a lot of digital noise added.\u003c/figcaption\u003e\u003c/figure\u003e \u003ch2\u003ePanasonic DC-ZS99 Review: A Lazy Experience\u003c/h2\u003e \u003cp\u003ePanasonic is not the only one that has been guilty of rereleasing an old product with a few changes and a new name. The demand for compact digital cameras is rising, and it makes sense to modernize the products to meet the demand. Major improvements require money and extensive R\u0026amp;D, so it is understandable that most manufacturers are simply rehashing the back catalog. \u003c/p\u003e \u003cp\u003eStill, I would be far more excited to see new camera designs that offer substantial improvements to image quality and functionality. Connectivity is more important than ever, but the ZS99 interfaces with a phone in much the same way the older cameras did before, so no fundamental changes there. \u003c/p\u003e \u003cp\u003eWe are left with a camera that complies with the latest USB standards but loses a significant piece of hardware, all at a $499 price, equivalent to what the older products sold for. It could be that my perspective is outdated, though, and that new users won’t care or even desire the things I wish the ZS99 had. I would buy the older ZS80 used and get the same image quality and versatility without having to give up the EVF.\u003c/p\u003e \u003cfigure id=\"attachment_774267\" aria-describedby=\"caption-attachment-774267\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-In-Hand-800x450.jpg\" alt=\"A man in a black jacket holds a camera pointed towards the sky on a sunny winter day. He stands on a snow-dusted sidewalk lined with trees and houses.\" width=\"800\" height=\"450\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-In-Hand-800x450.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-In-Hand-320x180.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-In-Hand-1536x864.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Panasonic-ZS99-In-Hand-2048x1152.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774267\"\u003eThe ZS99 does what it is designed for well. I wish it did a little more.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774263\" aria-describedby=\"caption-attachment-774263\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010313-800x600.jpg\" alt=\"Silhouette of a person seen through a glass door, lifting a chair in a dimly lit room. The reflection creates a layered effect. A sign with the number 9 is visible on the right side. Chairs are stacked on tables in the background.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010313-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010313-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010313-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010313.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774263\"\u003eThe shutter is very responsive on the ZS99, which makes the timing of shots more predictable and effective.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774252\" aria-describedby=\"caption-attachment-774252\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010278-800x600.jpg\" alt=\"A Northern Flicker woodpecker with a speckled body and red markings perches on the edge of a roof next to a bare branch. The roof has gray and red shingles, and the bird appears alert and poised.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010278-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010278-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010278-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010278.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774252\"\u003eWildlife is certainly within reach of the ZS99 lens. The built-in IBIS does a good job of steadying the camera.\u003c/figcaption\u003e\u003c/figure\u003e\n \u003ch2\u003eAre There Alternatives?\u003c/h2\u003e \u003cp\u003eThe only real path to get the same kind of zoom range in a small package is the used market. The older Panasonic ZS80 or even ZS70 will provide the same lens and sensor assembly plus the addition of an EVF to compose with. The Nikon Coolpix A1000 is less detailed and slightly bulkier, but it does give a longer 35x zoom lens. \u003c/p\u003e \u003cfigure id=\"attachment_774264\" aria-describedby=\"caption-attachment-774264\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010315-800x600.jpg\" alt=\"A rusty metal wall casts a shadow in the shape of a triangle. A blue chain-link fence stands in front. In the background, a yellow brick building with a rooftop ladder and a black vent is visible.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010315-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010315-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010315-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010315.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774264\"\u003eI just liked the simple composition and play of light in this photo.\u003c/figcaption\u003e\u003c/figure\u003e \u003cfigure id=\"attachment_774256\" aria-describedby=\"caption-attachment-774256\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/P1010297-800x600.jpg\" alt=\"A person with short hair and a beard is standing in front of a colorful mural with stylized lettering. They are wearing a dark jacket and looking directly at the camera. The mural features vibrant colors and intricate designs.\" width=\"800\" height=\"600\" srcset=\"https://petapixel.com/assets/uploads/2024/12/P1010297-800x600.jpg 800w, https://petapixel.com/assets/uploads/2024/12/P1010297-320x240.jpg 320w, https://petapixel.com/assets/uploads/2024/12/P1010297-1536x1152.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/P1010297.jpg 1800w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-774256\"\u003eSkin tones are okay, but any highlights can block up real quick. Luckily, I had soft, natural light for this portrait.\u003c/figcaption\u003e\u003c/figure\u003e \u003ch2\u003eShould You Buy It?\u003c/h2\u003e \u003cp\u003eNo. I don’t think the ZS99 is desirable, but I’m probably out of touch. If you want a new camera that beats a smartphone’s zoom range handily, the ZS99 is your best bet. \u003c/p\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-02T15:00:18Z",
  "modifiedTime": "2025-01-02T15:02:03Z"
}
