{
  "id": "8e21c0f2-c4d8-4df7-a230-51fa5ea2e6ae",
  "title": "Fujifilm Launches X half – A Compact Digital Half-Frame Camera",
  "link": "https://www.lightstalking.com/fujifilm-x-hf1/",
  "description": "Fujifilm has announced a global launch of its most recent camera in the X series, the X half in June 2025. It is for photographers who would like to rediscover the beauty of film photography in digital format and is based on the concept of classic half-frame cameras. The post Fujifilm Launches X half – A Compact Digital Half-Frame Camera appeared first on Light Stalking.",
  "author": "Dahlia Ambrose",
  "published": "Thu, 22 May 2025 12:00:00 +0000",
  "source": "https://www.lightstalking.com/feed/",
  "categories": [
    "Photography News"
  ],
  "byline": "Dahlia Ambrose",
  "length": 2762,
  "excerpt": "Fujifilm has announced a global launch of its most recent camera in the X series, the X half in June 2025. It is for photographers who would like to rediscover the beauty of film photography in digital format and is based on the concept of classic half-frame cameras.",
  "siteName": "Light Stalking",
  "favicon": "",
  "text": "Fujifilm has announced the global launch of its most recent camera in the X series, the X half, in June 2025. It is for photographers who would like to rediscover the beauty of film photography in digital format and the design and features are based on the concept of classic half-frame cameras. Image via Fujifilm The Fujifilm X half or the X-HF1, will be the latest model in the X series and the camera weighs only 240g. The camera design and features evolve from the half frame film cameras that were capable of shooting at half the size of 35mm film. This is not their first half-frame camera – of the many film cameras Fujifilm introduced, Fujica Half was a half frame camera that was released in 1963. The camera comes with a frame advance lever so photographers can have a film camera experience in digital format. The aspect ratio used is 3:4 which is very different from what is used in most digital cameras. The camera comes with a vertical optical viewfinder and an LCD monitor that helps with vertical composition. There is also a “2in1” function that allows to have two vertical images in a single frame which will be great to create storytelling images. Image via Fujifilm The film simulation feature will allow the user to have photographic film effects when capturing their images. Besides the simulations there are various filters that can be used based on the subject or scene one is shooting. There is also a film camera mode in the X half model, that allows the photographer to shoot through the viewfinder and use the frame advance lever to advance to the next shot. There will be no option to view or preview the images until a specified number of shots are taken. Here are some of the most important product features: 18MP vertical CMOS sensor Capture still and videos in 3:4 aspect ratio Back illuminated 1 inch sensor 10.8mm f/2.8 prime lens Create composite photos using the frame advance lever Dedicated X half app to create collages and make edits, create 2in1 and contact sheets 13 film simulation modes and 26 filters Date stamp feature Film camera mode to experience film photography, can be selected between 36, 54 or 72-shots and cancelled any time Prints can be made directly from the camera using Instax Link series More information about this product can be found here. The camera is priced at $849.00 and is available to pre-order. Fujifilm mentions that it has named this product “X half” envisioning that it would be a great camera for both newcomers and enthusiasts in photography, but the cost and features seem that this camera could be for someone who takes up photography for fun. We have more news for you to read if you are interested at this link here.",
  "image": "https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"site-content\" role=\"main\"\u003e\n\t\n\u003carticle id=\"post-519932\"\u003e\n\t\n\t\u003cdiv\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eFujifilm has announced the global launch of its most recent camera in the X series, the X half, in June 2025. It is for photographers who would like to rediscover the beauty of film photography in digital format and the design and features are based on the concept of classic half-frame cameras.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-1024x614.png.webp 1024w, https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-400x240.png.webp 400w, https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-768x461.png.webp 768w, https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half.png.webp 1195w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"614\" src=\"https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-1024x614.png\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-1024x614.png 1024w, https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-400x240.png 400w, https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half-768x461.png 768w, https://www.lightstalking.com/wp-content/uploads/fujifilm-x-half.png 1195w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eImage via Fujifilm\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eThe Fujifilm X half or the X-HF1, will be the latest model in the X series and the camera weighs only 240g. The camera design and features evolve from the half frame film cameras that were capable of shooting at half the size of 35mm film. This is not their first half-frame camera – of the many film cameras Fujifilm introduced, Fujica Half was a half frame camera that was released in 1963.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe camera comes with a frame advance lever so photographers can have a film camera experience in digital format. The aspect ratio used is 3:4 which is very different from what is used in most digital cameras. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe camera comes with a vertical optical viewfinder and an LCD monitor that helps with vertical composition. There is also a “2in1” function that allows to have two vertical images in a single frame which will be great to create storytelling images.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/2-in-1.png.webp 728w, https://www.lightstalking.com/wp-content/uploads/2-in-1-356x300.png.webp 356w\" sizes=\"(max-width: 728px) 100vw, 728px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"728\" height=\"614\" src=\"https://www.lightstalking.com/wp-content/uploads/2-in-1.png\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/2-in-1.png 728w, https://www.lightstalking.com/wp-content/uploads/2-in-1-356x300.png 356w\" sizes=\"(max-width: 728px) 100vw, 728px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eImage via Fujifilm\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eThe film simulation feature will allow the user to have photographic film effects when capturing their images. Besides the simulations there are various filters that can be used based on the subject or scene one is shooting. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere is also a film camera mode in the X half model, that allows the photographer to shoot through the viewfinder and use the frame advance lever to advance to the next shot. There will be no option to view or preview the images until a specified number of shots are taken.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere are some of the most important product features:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e18MP vertical CMOS sensor \u003c/li\u003e\n\n\n\n\u003cli\u003eCapture still and videos in 3:4 aspect ratio\u003c/li\u003e\n\n\n\n\u003cli\u003eBack illuminated 1 inch sensor\u003c/li\u003e\n\n\n\n\u003cli\u003e10.8mm f/2.8 prime lens\u003c/li\u003e\n\n\n\n\u003cli\u003eCreate composite photos using the frame advance lever\u003c/li\u003e\n\n\n\n\u003cli\u003eDedicated X half app to create collages and make edits, create 2in1 and contact sheets\u003c/li\u003e\n\n\n\n\u003cli\u003e13 film simulation modes and 26 filters\u003c/li\u003e\n\n\n\n\u003cli\u003eDate stamp feature\u003c/li\u003e\n\n\n\n\u003cli\u003eFilm camera mode to experience film photography, can be selected between 36, 54 or 72-shots and cancelled any time\u003c/li\u003e\n\n\n\n\u003cli\u003ePrints can be made directly from the camera using Instax Link series\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eMore information about this product can be found \u003ca href=\"https://www.fujifilm.com/de/en/news/hq/12389\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehere\u003c/a\u003e. The camera is priced at $849.00 and is available to pre-order. Fujifilm mentions that it has named this product “X half” envisioning that it would be a great camera for both newcomers and enthusiasts in photography, but the cost and features seem that this camera could be for someone who takes up photography for fun.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe have more news for you to read if you are interested \u003ca href=\"https://www.lightstalking.com/category/news/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eat this link\u003c/a\u003e here.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\u003cp\u003e\u003cimg alt=\"\" src=\"https://secure.gravatar.com/avatar/b3e61dfef3cd02736c0bf50e47171ee6?s=120\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/b3e61dfef3cd02736c0bf50e47171ee6?s=240\u0026amp;r=g 2x\" height=\"120\" width=\"120\" decoding=\"async\"/\u003e\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-22T12:00:00Z",
  "modifiedTime": null
}
