{
  "id": "9a4dd5e0-1398-4e78-a04b-fd7fe3b8eec2",
  "title": "Fujifilm Increased X100VI Production, Is ‘Closer’ To Shipping Outstanding Orders",
  "link": "https://petapixel.com/2025/03/11/fujifilm-increased-x100vi-production-is-closer-to-shipping-outstanding-orders/",
  "description": "Last February, Fujifilm announced the X100VI and it quickly became one of the most popular cameras on the planet. Despite planning for increased demand and stockpiling cameras ahead of launch, wait times for the camera quickly exceeded months. The company says it has since increased production and is now closer to shipping outstanding orders. [Read More]",
  "author": "Jaron Schneider",
  "published": "Tue, 11 Mar 2025 21:31:37 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Features",
    "Interviews",
    "News",
    "cp+",
    "demand",
    "fuji",
    "fujifilm",
    "fujifilmx100vi",
    "interview",
    "manufacturing",
    "production",
    "x100VI"
  ],
  "byline": "Jaron Schneider",
  "length": 3223,
  "excerpt": "After overwhelming demand for the X100Vi, Fujifilm says it has increased production and is now closer to shipping outstanding orders.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "Last February, Fujifilm announced the X100VI and it quickly became one of the most popular cameras on the planet. Despite planning for increased demand and stockpiling cameras ahead of launch, wait times for the camera quickly exceeded months. The company says it has since increased production and is now closer to shipping outstanding orders. Last March, Fujifilm said that demand for the camera greatly exceeded its predictions and despite increasing manufacturing capacity, it was only able to produce 15,000 new cameras per month. At that rate, it admitted that it would take “months” to fulfill demand. Now a year later, Fujifilm is still catching up to that surge. “We’ve more than doubled our production compared to the previous model. But on top of that, we are also still increasing production. Now we can produce higher than [15,000 units per month] and we have been, but it’s not like we can produce double that [amount again],” General Manager of Professional Imaging Group, Imaging Solutions Division, Fujifilm Corporation, tells PetaPixel during an interview at the CP+ show in February. “We’ve been doing what we can to increase our production for the X100VI, but the processes are quite complicated — especially for pieces like the top plate. To make these sharp edges, it goes through many processes. So, this type of camera is not so suited for ramping up production,” he explains. “In one year since we launched this product, compared to the previous models which took us to sell three or four years, we’ve already shipped an equivalent amount. So I know people are quite frustrated when they say it’s still not available. I think one issue is that the first-day orders were so big when it was announced, that’s why people say they’ve been waiting for eight, or 10 months, which we totally understand is so frustrating. So until we clear that, some people will still continue to say, ‘We’ve been waiting for 10 months.'” While some might be shocked that it has taken more than a year to get past the camera orders placed during the pre-order period, it is indicative of just how popular the X100VI is. “We are doing our best and I think we are getting closer to clearing those orders and so I just hope people will be a just a bit more patient not to buy from higher priced resellers available in the market.” In that last note, Igarashi is speaking about scalpers who have flooded the second-hand market with X100VI cameras that are significantly more expensive than Fujifilm is charging for them. While it can be tempting to give in to these types of sellers out of a desire to have the camera immediately, Fujifilm encourages photographers not to reward that kind of behavior. “We don’t want people to buy from the people who want to make a profit out of selling the cameras. Of course, we are doing our best and I think we are getting closer to clearing those orders and so I just hope people will be just a bit more patient [and] not to buy the higher priced products available in the market.” Image credits: Fujifilm PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"783521\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-800x420.jpg\" alt=\"Fujifilm X100VI\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month-550x288.jpg 550w, https://petapixel.com/assets/uploads/2024/03/Fujifilm-Confirms-X100VI-Production-Capacity-Capped-at-15000-Per-Month.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eLast February, Fujifilm announced the X100VI and it quickly became one of the most popular cameras on the planet. Despite planning for increased demand and stockpiling cameras ahead of launch, wait times for the camera quickly exceeded months. The company says it has since increased production and is now closer to shipping outstanding orders.\u003c/p\u003e  \u003cp\u003eLast March, Fujifilm said that demand for the camera greatly exceeded its predictions and despite increasing manufacturing capacity, it was \u003ca href=\"https://petapixel.com/2024/03/06/fujifilm-says-it-will-take-months-to-fulfill-overwhelming-x100vi-orders/\" data-wpel-link=\"internal\"\u003eonly able to produce 15,000 new cameras per month\u003c/a\u003e. At that rate, it admitted that it would \u003ca href=\"https://petapixel.com/2024/03/06/fujifilm-says-it-will-take-months-to-fulfill-overwhelming-x100vi-orders/\" data-wpel-link=\"internal\"\u003etake “months” to fulfill demand\u003c/a\u003e. Now a year later, Fujifilm is still catching up to that surge.\u003c/p\u003e \u003cp\u003e“We’ve more than doubled our production compared to the previous model. But on top of that, we are also still increasing production. Now we can produce higher than [15,000 units per month] and we have been, but it’s not like we can produce double that [amount again],” General Manager of Professional Imaging Group, Imaging Solutions Division, Fujifilm Corporation, tells \u003cem\u003ePetaPixel\u003c/em\u003e during an interview \u003ca href=\"https://petapixel.com/2025/03/03/japans-cp-show-was-always-important-but-now-its-the-new-photokina/\" data-wpel-link=\"internal\"\u003eat the CP+ show\u003c/a\u003e in February.\u003c/p\u003e \u003cp\u003e“We’ve been doing what we can to increase our production for the X100VI, but the processes are quite complicated — especially for pieces like the top plate. To make these sharp edges, it goes through many processes. So, this type of camera is not so suited for ramping up production,” he explains. \u003c/p\u003e \u003cp\u003e“In one year since we launched this product, compared to the previous models which took us to sell three or four years, we’ve already shipped an equivalent amount. So I know people are quite frustrated when they say it’s still not available. I think one issue is that the first-day orders were so big when it was announced, that’s why people say they’ve been waiting for eight, or 10 months, which we totally understand is so frustrating. So until we clear that, some people will still continue to say, ‘We’ve been waiting for 10 months.\u0026#39;”\u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/V8OLe_FBAUc\" title=\"Fujifilm X100 VI Review: What\u0026#39;s All the HYPE About?!\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e\n \u003cp\u003eWhile some might be shocked that it has taken more than a year to get past the camera orders placed during the pre-order period, it is indicative of just how popular the X100VI is. \u003c/p\u003e \u003cp\u003e“We are doing our best and I think we are getting closer to clearing those orders and so I just hope people will be a just a bit more patient not to buy from higher priced resellers available in the market.”\u003c/p\u003e \u003cp\u003eIn that last note, Igarashi is speaking about scalpers who have flooded the second-hand market with X100VI cameras that are significantly more expensive than Fujifilm is charging for them. While it can be tempting to give in to these types of sellers out of a desire to have the camera immediately, Fujifilm encourages photographers not to reward that kind of behavior. \u003c/p\u003e \u003cp\u003e“We don’t want people to buy from the people who want to make a profit out of selling the cameras. Of course, we are doing our best and I think we are getting closer to clearing those orders and so I just hope people will be just a bit more patient [and] not to buy the higher priced products available in the market.”\u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Fujifilm\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-11T21:31:37Z",
  "modifiedTime": "2025-03-11T21:41:32Z"
}
