{
  "id": "b2135390-df72-428e-8451-05225f1a8c44",
  "title": "5 Ways to Create More Artistic Photos (Fast!)",
  "link": "https://digital-photography-school.com/create-more-artistic-photos-tips/",
  "description": "The post 5 Ways to Create More Artistic Photos (Fast!) appeared first on Digital Photography School. It was authored by Jaymes Dempsey. Looking back at this article from Jaymes, maybe all in one long post it can be a little overwhelming, what about if you were to write down the five points and then tackle them one at a time? Use minimalism to improve your compositions Add split toning to enhance the colors Decrease the depth of […] The post 5 Ways to Create More Artistic Photos (Fast!) appeared first on Digital Photography School. It was authored by Jaymes Dempsey.",
  "author": "Jaymes Dempsey",
  "published": "Mon, 21 Jul 2025 10:49:07 +0000",
  "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
  "categories": [
    "Featured: Tips and Tutorials",
    "Photography Tips and Tutorials",
    "photographic inspiration"
  ],
  "byline": "Jaymes Dempsey",
  "length": 8238,
  "excerpt": "How can you creat more artistic photos? Discover five ways to take your photo creativity to the next level and improve your photography, fast.",
  "siteName": "Digital Photography School",
  "favicon": "https://digital-photography-school.com/android-chrome-192x192.png",
  "text": "Looking back at this article from Jaymes, maybe all in one long post it can be a little overwhelming, what about if you were to write down the five points and then tackle them one at a time? Use minimalism to improve your compositions Add split toning to enhance the colors Decrease the depth of field for a softer look Look at the work of good photographers for inspiration Lengthen your shutter speeds for more abstract photos Each of the points above are explained in detail below – one at a time, create a photograph employing the points above. Share a result or all five results in our private Facebook group! Updated 2025 by Simon ? Are you looking to create more artistic photos? Do you feel like your photos need a bit of an upgrade? You’re not alone. This type of struggle is one that most photographers feel at one point or another. I’ve felt it myself, which is why I developed several methods for increasing the artistry in my own photography. And I’m going to share these methods with you today. So if you’re looking to add a level of creative and artistic flair to your photos, keep reading. 300mm, 1/1250 sec, f/6.3, ISO 200 1. Use minimalism to improve your compositions Creating more artistic photos can start by changing up your compositions. Because here’s the thing: After doing photography for a bit, you start to fall into compositional patterns. You’ll take the same type of photo, over and over again. You may not even realize it. So in order to take things to the next level… …you should make a strong effort to break free of your compositional patterns. One of my favorite ways to do that is with minimalism. Minimalism involves using lots of negative space, while also positioning your subject toward the edges of the frame. 400mm, 1/320 sec, f/5.6, ISO 400 For instance, a minimalistic photographer might take a single plant and place it down at the very top or bottom of the frame, while the rest of the scene stays primarily white: 100mm, 1/125 sec, f/2.8, ISO 320 Minimalism is great, and one of the things I love most about it is how it feels so different from normal compositional techniques. Once you start thinking minimalist, your whole outlook can change. And your photos will start to look far more artistic. 2. Add split toning to enhance the colors If you’re looking to increase the artistry in your photos, ask yourself: How am I doing with color? Because color is one of the most neglected aspects of photography, despite its important role in most photos. Color adds contrast, creates harmony and disharmony, and evokes different moods. (All in a wonderfully subtle way!) Now, one aspect of improving the use of color in your photography involves looking for interesting color combinations when out shooting. But you can also make changes after you’ve finished your photoshoots. More specifically, split toning will allow you to add a bit of mood and contrast to your photos. Here’s a photo with a bit of split toning to deepen the yellow highlights and the green shadows: 90mm, 1/160 sec, f/9.0, ISO 320 Basically, a split tone just involves putting one color cast in the highlights of your photo and one color cast in the shadows of your photo. Cold shadows and warm highlights are pretty common, so you could easily go with a blue/yellow split-tone combination. But you should also experiment with other possibilities to make things as artistic (and interesting!) as possible. Note that pretty much every RAW photo editor offers split toning in one form or another. So no matter your preferred post-processing software, you’ll be able to add some color! 3. Decrease the depth of field for a softer look This is one of my personal favorites for making photos more artistic: Bringing down that depth of field. With a shallow depth of field, you can create all sorts of interesting effects: Stunning background bokeh, soft subjects, and even abstract-type images. Now, to create a shallow depth of field look, you’ll need to use a lens with a wide maximum aperture (something in the area of f/1.2 to f/2.8 is best). You’ll also want a lens of at least 50mm, and you’ll want to get close to your subject, if possible. The closer you are to your subject, the better the soft-focus effect. Note that it can be difficult to focus when working at such a wide aperture. So you may need to switch your lens over to manual, in order to ensure you nail focus every time. To add additional interest, you might try positioning a light source in the background, so that you can create cool bokeh, like this: 90mm, 1/100 sec, f/2.8, ISO 320 I’d also recommend thinking about your subject a bit differently. Don’t envision the subject as a single entity; instead, look for shapes and lines that you can use for a more powerful composition. That way, you’ll be able to use the soft-focus effect for more artistic, abstract-style images. 4. Look at the work of good photographers for inspiration If you’re the type of person who likes to get out and practice photography, you may grumble at this suggestion. After all, practice makes perfect, right? But it’s important to realize that it’s hard to know what perfect would mean… …if you haven’t ever seen it. That’s why I urge you to look at the work of photographers you admire. Do it all the time. If you like, you can simply look at photographers in your favorite genres. One of the photographers whose work I view over and over again is Jess Findlay. While he and I gravitate toward different subjects, his work serves as a constant inspiration to me. Or you can expand your horizons, looking for photographers in many different areas. (In fact, I like to look at work that’s not in my areas of interest; I find that it gives me fresh ideas that would’ve never occurred to me if I’d stuck to my preferred genres.) When you look at photography that you like, ask yourself: What is it that makes this work special? What is it that makes it so artistic? Then come up with some ideas for incorporating that level of artistry into your own work. Don’t copy blindly, but try to pull out bits and pieces of wisdom that you can use to enhance your own photos. For instance, if you notice that a photographer likes to shoot from a low angle, start shooting from a low angle yourself. If you notice that a photographer loves to juxtapose two contrasting subjects, try juxtaposing some contrasting subjects yourself. Just give it a try. My guess is that you’ll notice improvements in your own photos pretty quickly. And then you won’t want to stop looking at other photos! 5. Lengthen your shutter speeds for more abstract photos Here’s a final, practical tip for creating more artistic photos: Use creatively long shutter speeds. For instance, photograph moving a flower, but drop the shutter speed way down, so you get a cool blur effect. And then move your camera around, even as you’re taking the photo. That’ll give you an even more interesting abstract: 100mm, 1/6 sec, f/2.8, ISO 250 Personally, I love doing handheld abstracts with long shutter speeds. Sure, they take a lot of experimentation, but they’re also very liberating. And they’re great for situations where the light is too low to get sharp shots handheld and you don’t want to use a tripod. Now, to pull off this type of abstract image, you’ll need to put your camera in Manual mode (or Shutter Priority) and drop the shutter speed until it reaches 1/10s to 1s (or longer). Then, as you hit the shutter button, move your camera. I’d recommend aligning the movement with compositional elements in your scene (e.g., if there are trees in the scene, move the camera along the tree trunks). You’ll end up with some very artistic blurs! Five ways to make your photography more artistic: Conclusion Hopefully, you now know a few easy ways to make your photos more artistic. After all, capturing artistic photos doesn’t have to be hard… …it just involves changing things up! So try some of the ideas I’ve suggested, and see how things go. I bet you’ll like the result! 300mm, 1/400 sec, f/6.3, ISO 320 Do you have ideas for creating more artistic photos? Share them in the comments! Read more from our Tips \u0026 Tutorials category I need help with...",
  "image": "https://digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\t\t\t\n\t\t\n\t\t\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=1200%2C1200\u0026amp;ssl=1\" alt=\"create-more-artistic-photos-fast\" width=\"1200\" height=\"1200\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?w=1200\u0026amp;ssl=1 1200w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=300%2C300\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=600%2C600\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=150%2C150\u0026amp;ssl=1 150w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=768%2C768\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=717%2C717\u0026amp;ssl=1 717w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=50%2C50\u0026amp;ssl=1 50w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLooking back at this article from Jaymes, maybe all in one long post it can be a little overwhelming, what about if you were to write down the five points and then tackle them one at a time?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cb\u003eUse minimalism to improve your compositions\u003c/b\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cb\u003eAdd split toning to enhance the colors\u003c/b\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cb\u003eDecrease the depth of field for a softer look\u003c/b\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cb\u003eLook at the work of good photographers for inspiration\u003c/b\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cb\u003eLengthen your shutter speeds for more abstract photos\u003c/b\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEach of the points above are explained in detail below – one at a time, create a photograph employing the points above. Share a result or all five results in our \u003ca href=\"https://www.facebook.com/groups/digitalphotographyschoolgroup/\" target=\"_blank\" rel=\"nofollow noopenernoopener\"\u003eprivate Facebook group!\u003c/a\u003e\u003c/p\u003e\n\u003ch6 data-section=\"\" id=\"updated-by-simon\"\u003eUpdated 2025 by Simon ?\u003c/h6\u003e\n\u003cp\u003eAre you looking to create more artistic photos? Do you feel like your photos need a bit of an upgrade?\u003c/p\u003e\n\u003cp\u003eYou’re not alone.\u003c/p\u003e\n\u003cp\u003eThis type of struggle is one that most photographers feel at one point or another. I’ve felt it myself, which is why I developed several methods for increasing the artistry in my own photography.\u003c/p\u003e\n\u003cp\u003eAnd I’m going to share these methods with you today.\u003c/p\u003e\n\u003cp\u003eSo if you’re looking to add a level of creative and artistic flair to your photos, keep reading.\u003c/p\u003e\n\u003cdiv id=\"attachment_184974\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184974\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=1500%2C1004\u0026amp;ssl=1\" alt=\"Image: 300mm, 1/1250 sec, f/6.3, ISO 200\" width=\"1500\" height=\"1004\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=600%2C402\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=768%2C514\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=436%2C293\u0026amp;ssl=1 436w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5002.jpg?resize=717%2C480\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184974\"\u003e300mm, 1/1250 sec, f/6.3, ISO 200\u003c/p\u003e\u003c/div\u003e\n\u003ch2 data-section=\"\" id=\"use-minimalism-to-improve-your-compositions\"\u003e1. Use minimalism to improve your compositions\u003c/h2\u003e\n\u003cp\u003eCreating more artistic photos can start by changing up your \u003ca href=\"https://digital-photography-school.com/divine-composition-with-fibonaccis-ratio-the-rule-of-thirds-on-steroids/\"\u003ecompositions\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBecause here’s the thing:\u003c/p\u003e\n\u003cp\u003eAfter doing photography for a bit, you start to fall into compositional patterns. You’ll take the same type of photo, over and over again. You may not even realize it.\u003c/p\u003e\n\u003cp\u003eSo in order to take things to the next level…\u003c/p\u003e\n\u003cp\u003e…you should make a strong effort to break free of your compositional patterns.\u003c/p\u003e\n\u003cp\u003eOne of my favorite ways to do that is with \u003ca href=\"https://digital-photography-school.com/tips-for-achieving-minimalism-in-photography/\"\u003eminimalism\u003c/a\u003e. Minimalism involves using lots of \u003ca href=\"https://digital-photography-school.com/negative-space-in-photography/\"\u003enegative space\u003c/a\u003e, while also positioning your subject toward the edges of the frame.\u003c/p\u003e\n\u003cdiv id=\"attachment_184969\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184969\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5003.jpg?resize=1500%2C1124\u0026amp;ssl=1\" alt=\"create-more-artistic-photos-fast\" width=\"1500\" height=\"1124\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5003.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5003.jpg?resize=300%2C225\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5003.jpg?resize=600%2C450\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5003.jpg?resize=768%2C575\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5003.jpg?resize=717%2C537\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184969\"\u003e400mm, 1/320 sec, f/5.6, ISO 400\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eFor instance, a minimalistic photographer might take a single plant and place it down at the very top or bottom of the frame, while the rest of the scene stays primarily white:\u003c/p\u003e\n\u003cdiv id=\"attachment_184968\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184968\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"Image: 100mm, 1/125 sec, f/2.8, ISO 320\" width=\"1500\" height=\"1000\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5006.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184968\"\u003e100mm, 1/125 sec, f/2.8, ISO 320\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eMinimalism is great, and one of the things I love most about it is how it feels so \u003cem\u003edifferent \u003c/em\u003efrom normal compositional techniques. Once you start thinking minimalist, your whole outlook can change.\u003c/p\u003e\n\u003cp\u003eAnd your photos will start to look far more artistic.\u003c/p\u003e\n\u003ch2 data-section=\"\" id=\"add-split-toning-to-enhance-the-colors\"\u003e2. Add split toning to enhance the colors\u003c/h2\u003e\n\u003cp\u003eIf you’re looking to increase the artistry in your photos, ask yourself:\u003c/p\u003e\n\u003cp\u003eHow am I doing with \u003ca href=\"https://digital-photography-school.com/how-to-use-color-in-your-photography/\"\u003ecolor\u003c/a\u003e?\u003c/p\u003e\n\u003cp\u003eBecause color is one of the most neglected aspects of photography, despite its important role in most photos.\u003c/p\u003e\n\u003cp\u003eColor adds \u003ca href=\"https://digital-photography-school.com/conceptual-contrast-photography/\"\u003econtrast\u003c/a\u003e, creates harmony and disharmony, and evokes different moods.\u003c/p\u003e\n\u003cp\u003e(All in a wonderfully subtle way!)\u003c/p\u003e\n\u003cp\u003eNow, one aspect of improving the use of color in your photography involves looking for interesting color combinations when out shooting.\u003c/p\u003e\n\u003cp\u003eBut you can also make changes after you’ve finished your photoshoots.\u003c/p\u003e\n\u003cp\u003eMore specifically, \u003ca href=\"https://digital-photography-school.com/how-rescue-image-lightroom-split-toning/\"\u003esplit toning\u003c/a\u003e will allow you to add a bit of mood and contrast to your photos.\u003c/p\u003e\n\u003cp\u003eHere’s a photo with a bit of split toning to deepen the yellow highlights and the green shadows:\u003c/p\u003e\n\u003cdiv id=\"attachment_184970\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184970\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-201.jpg?resize=1000%2C1500\u0026amp;ssl=1\" alt=\"Image: 90mm, 1/160 sec, f/9.0, ISO 320\" width=\"1000\" height=\"1500\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-201.jpg?w=1000\u0026amp;ssl=1 1000w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-201.jpg?resize=200%2C300\u0026amp;ssl=1 200w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-201.jpg?resize=400%2C600\u0026amp;ssl=1 400w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-201.jpg?resize=768%2C1152\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-201.jpg?resize=717%2C1076\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184970\"\u003e90mm, 1/160 sec, f/9.0, ISO 320\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eBasically, a split tone just involves putting one color cast in the highlights of your photo and one color cast in the shadows of your photo. Cold shadows and warm highlights are pretty common, so you could easily go with a blue/yellow split-tone combination. But you should also experiment with other possibilities to make things as artistic (and interesting!) as possible.\u003c/p\u003e\n\u003cp\u003eNote that pretty much every RAW photo editor offers split toning in one form or another. So no matter your preferred post-processing software, you’ll be able to add some color!\u003c/p\u003e\n\u003ch2 data-section=\"\" id=\"decrease-the-depth-of-field-for-a-softer-look\"\u003e3. Decrease the depth of field for a softer look\u003c/h2\u003e\n\u003cp\u003eThis is one of my personal favorites for making photos more artistic:\u003c/p\u003e\n\u003cp\u003eBringing down that \u003ca href=\"https://digital-photography-school.com/control-depth-of-field-in-photography/\"\u003edepth of field\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWith a \u003ca href=\"https://digital-photography-school.com/3-elements-getting-shallow-depth-of-field-images/\"\u003eshallow depth of field\u003c/a\u003e, you can create all sorts of interesting effects: \u003ca href=\"https://digital-photography-school.com/four-ways-generate-stunning-bokeh/\"\u003eStunning background bokeh\u003c/a\u003e, soft subjects, and even \u003ca href=\"https://digital-photography-school.com/find-opportunities-abstract-photography-anywhere/\"\u003eabstract-type images\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eNow, to create a shallow depth of field look, you’ll need to use a lens with a wide maximum \u003ca href=\"https://digital-photography-school.com/aperture/\"\u003eaperture\u003c/a\u003e (something in the area of f/1.2 to f/2.8 is best). You’ll also want a lens of at least 50mm, and you’ll want to get close to your subject, if possible. The closer you are to your subject, the better the soft-focus effect.\u003c/p\u003e\n\u003cp\u003eNote that it can be difficult to focus when working at such a wide aperture. So you may need to switch your lens over to manual, in order to ensure you nail focus every time.\u003c/p\u003e\n\u003cp\u003eTo add additional interest, you might try positioning a light source in the background, so that you can create cool bokeh, like this:\u003c/p\u003e\n\u003cdiv id=\"attachment_184971\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184971\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5004.jpg?resize=1000%2C1500\u0026amp;ssl=1\" alt=\"create-more-artistic-photos-fast\" width=\"1000\" height=\"1500\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5004.jpg?w=1000\u0026amp;ssl=1 1000w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5004.jpg?resize=200%2C300\u0026amp;ssl=1 200w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5004.jpg?resize=400%2C600\u0026amp;ssl=1 400w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5004.jpg?resize=768%2C1152\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5004.jpg?resize=717%2C1076\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184971\"\u003e90mm, 1/100 sec, f/2.8, ISO 320\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI’d also recommend thinking about your subject a bit differently. Don’t envision the subject as a single entity; instead, look for shapes and lines that you can use for a more powerful composition. That way, you’ll be able to use the soft-focus effect for more artistic, abstract-style images.\u003c/p\u003e\n\u003ch2 data-section=\"\" id=\"look-at-the-work-of-good-photographers-for-inspiration\"\u003e4. Look at the work of good photographers for inspiration\u003c/h2\u003e\n\u003cp\u003eIf you’re the type of person who likes to get out and practice photography, you may grumble at this suggestion. After all, practice makes perfect, right?\u003c/p\u003e\n\u003cp\u003eBut it’s important to realize that it’s hard to know what perfect would mean…\u003c/p\u003e\n\u003cp\u003e…if you haven’t ever seen it.\u003c/p\u003e\n\u003cp\u003eThat’s why I urge you to look at the work of photographers you admire. Do it \u003cem\u003eall the time\u003c/em\u003e. If you like, you can simply look at photographers in your favorite genres.\u003c/p\u003e\n\u003cdiv id=\"attachment_184967\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184967\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-1-1.png?resize=1500%2C651\u0026amp;ssl=1\" alt=\"Image: One of the photographers whose work I view over and over again is Jess Findlay. While he and...\" width=\"1500\" height=\"651\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-1-1.png?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-1-1.png?resize=300%2C130\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-1-1.png?resize=600%2C260\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-1-1.png?resize=768%2C333\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-1-1.png?resize=717%2C311\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184967\"\u003eOne of the photographers whose work I view over and over again is \u003cspan\u003eJess Findlay\u003c/span\u003e. While he and I gravitate toward different subjects, his work serves as a constant inspiration to me.\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eOr you can expand your horizons, looking for photographers in many different areas.\u003c/p\u003e\n\u003cp\u003e(In fact, I like to look at work that’s not in my areas of interest; I find that it gives me fresh ideas that would’ve never occurred to me if I’d stuck to my preferred genres.)\u003c/p\u003e\n\u003cp\u003eWhen you look at photography that you like, ask yourself:\u003c/p\u003e\n\u003cp\u003eWhat is it that makes this work special? What is it that makes it so artistic?\u003c/p\u003e\n\u003cp\u003eThen come up with some ideas for incorporating that level of artistry into your own work. Don’t copy blindly, but try to pull out bits and pieces of wisdom that you can use to enhance your own photos.\u003c/p\u003e\n\u003cp\u003eFor instance, if you notice that a photographer likes to shoot from a \u003ca href=\"https://digital-photography-school.com/7-tips-for-great-low-angle-shots/\"\u003elow angle\u003c/a\u003e, start shooting from a low angle yourself.\u003c/p\u003e\n\u003cp\u003eIf you notice that a photographer loves to juxtapose two contrasting subjects, try juxtaposing some contrasting subjects yourself.\u003c/p\u003e\n\u003cp\u003eJust give it a try. My guess is that you’ll notice improvements in your own photos pretty quickly.\u003c/p\u003e\n\u003cp\u003eAnd then you won’t want to \u003cem\u003estop \u003c/em\u003elooking at other photos!\u003c/p\u003e\n\u003ch2 data-section=\"\" id=\"lengthen-your-shutter-speeds-for-more-abstract-photos\"\u003e5. Lengthen your shutter speeds for more abstract photos\u003c/h2\u003e\n\u003cp\u003eHere’s a final, practical tip for creating more artistic photos:\u003c/p\u003e\n\u003cp\u003eUse creatively \u003ca href=\"https://digital-photography-school.com/easy-beginners-tips-for-long-exposure-photography/\"\u003elong shutter speeds\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor instance, photograph moving a flower, but drop the shutter speed way down, so you get a cool blur effect.\u003c/p\u003e\n\u003cp\u003eAnd then move your camera around, even as you’re taking the photo. That’ll give you an even more interesting abstract:\u003c/p\u003e\n\u003cdiv id=\"attachment_184972\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184972\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-300.jpg?resize=1500%2C1148\u0026amp;ssl=1\" alt=\"create-more-artistic-photos-fast\" width=\"1500\" height=\"1148\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-300.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-300.jpg?resize=300%2C230\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-300.jpg?resize=600%2C459\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-300.jpg?resize=768%2C588\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-300.jpg?resize=717%2C549\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184972\"\u003e100mm, 1/6 sec, f/2.8, ISO 250\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003ePersonally, I love doing handheld abstracts with long shutter speeds. Sure, they take a lot of experimentation, but they’re also very liberating. And they’re great for situations where the light is too low to get sharp shots handheld and you don’t want to use a tripod.\u003c/p\u003e\n\u003cp\u003eNow, to pull off this type of abstract image, you’ll need to put your camera in Manual mode (or Shutter Priority) and drop the shutter speed until it reaches 1/10s to 1s (or longer). Then, as you hit the shutter button, \u003ca href=\"https://digital-photography-school.com/creative-reasons-to-use-intentional-camera-movement/\"\u003emove your camera\u003c/a\u003e. I’d recommend aligning the movement with compositional elements in your scene (e.g., if there are trees in the scene, move the camera along the tree trunks).\u003c/p\u003e\n\u003cp\u003eYou’ll end up with some very artistic blurs!\u003c/p\u003e\n\u003ch2 data-section=\"\" id=\"five-ways-to-make-your-photography-more-artistic-conclusion\"\u003eFive ways to make your photography more artistic: Conclusion\u003c/h2\u003e\n\u003cp\u003eHopefully, you now know a few easy ways to make your photos more artistic.\u003c/p\u003e\n\u003cp\u003eAfter all, capturing artistic photos doesn’t have to be hard…\u003c/p\u003e\n\u003cp\u003e…it just involves changing things up!\u003c/p\u003e\n\u003cp\u003eSo try some of the ideas I’ve suggested, and see how things go. I bet you’ll like the result!\u003c/p\u003e\n\u003cdiv id=\"attachment_184975\"\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-184975\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=1500%2C1004\u0026amp;ssl=1\" alt=\"create-more-artistic-photos-fast\" width=\"1500\" height=\"1004\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=600%2C402\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=768%2C514\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=436%2C293\u0026amp;ssl=1 436w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2019/12/artistic-photos-5001.jpg?resize=717%2C480\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-184975\"\u003e300mm, 1/400 sec, f/6.3, ISO 320\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003cem\u003eDo you have ideas for creating more artistic photos? Share them in the comments!\u003c/em\u003e\u003c/p\u003e\n\n\u003cimg src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?w=600\u0026amp;h=1260\u0026amp;ssl=1\" id=\"pinterest-image\" width=\"600\" h=\"1260\" alt=\"5 Ways to Create More Artistic Photos (Fast!)\"/\u003e\t  \n      \n    \u003c/section\u003e\n\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003ch3\u003eRead more from our \u003ca href=\"https://digital-photography-school.com/tips/\"\u003eTips \u0026amp; Tutorials\u003c/a\u003e category\u003c/h3\u003e\n\t\t\t\n\n\t\t\t\t\t\u003c/section\u003e\n\n\t\t\t\u003csection\u003e\n\t\t\u003cspan\u003eI need help with...\u003c/span\u003e\n\t\t\n\t\u003c/section\u003e\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-07-21T10:49:07Z",
  "modifiedTime": "2025-07-21T10:49:09Z"
}
