[
  {
    "id": "93b9a781-a063-4b4e-b7e1-02c4a3b2188b",
    "title": "Here’s what Apple sees as the key benefits of macOS Tahoe 26",
    "link": "https://9to5mac.com/2025/06/30/heres-what-apple-sees-as-the-key-benefits-of-macos-tahoe-26/",
    "description": "9to5Mac is brought to you by CleanMyMac: Tidy up your Mac and iPhone today! Try 7 days free and use our code 9TO5MAC15 for 15% off. Also check out CleanMyPhone for your iPhone! macOS Tahoe 26 represents one of the more dramatic changes we’ve seen to the look and feel of the Mac operating system in recent years. There’s new functionality too, of course, and Apple thinks the blend of the two will greatly enhance the experience of Mac users … more…",
    "author": "Ben Lovejoy",
    "published": "Tue, 01 Jul 2025 00:52:21 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/06/Heres-what-Apple-sees-as-the-key-design-changes-in-macOS-Tahoe-26.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "c7275539-2ad0-4cbc-a2c9-e0adea97b417",
    "title": "The Google Keep Apple Watch app is no longer available",
    "link": "https://9to5google.com/2025/06/30/google-keep-apple-watch/",
    "description": "While Google released a new watchOS app today, the company also got rid of Google Keep for Apple Watch. more…",
    "author": "9to5Google",
    "published": "Tue, 01 Jul 2025 00:33:06 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/06/google-keep-logo-2.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "25095a3e-762f-4b6c-935f-eedab5d3f01c",
    "title": "Apple Music celebrates 10 years with the launch of a new global hub for artists",
    "link": "https://www.apple.com/newsroom/2025/06/apple-music-celebrates-10-years-with-the-launch-of-a-new-global-hub-for-artists/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-06-30T12:59:33.062Z",
    "image": "https://www.apple.com/newsroom/images/2025/06/apple-music-celebrates-10-years-with-the-launch-of-a-new-global-hub-for-artists/tile/Apple-Music-10th-anniversary-Los-Angeles-studio-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "PRESS RELEASE"
    ]
  },
  {
    "id": "fe2f5b81-c85e-42c0-960a-f5ff41861398",
    "title": "Apple Sports serves up tennis, just in time for Wimbledon",
    "link": "https://www.apple.com/newsroom/2025/06/apple-sports-serves-up-tennis-just-in-time-for-wimbledon/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-06-25T15:29:16.641Z",
    "image": "https://www.apple.com/newsroom/images/2025/06/apple-sports-serves-up-tennis-just-in-time-for-wimbledon/tile/Apple-Sports-app-tennis-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "cecec6cb-914b-43ab-996f-c542e4986e08",
    "title": "Apple loses bid to dismiss wide-ranging DOJ antitrust case",
    "link": "https://appleinsider.com/articles/25/06/30/apple-loses-bid-to-dismiss-wide-ranging-doj-antitrust-case?utm_medium=rss",
    "description": "Apple's motion to dismiss the U.S. Department of Justice antitrust lawsuit has been rejected, which means a trial that could result in upending more of Apple's businesses will soon begin.The US DOJ antitrust suit is moving forwardAn antitrust investigation brought on by a case with Spotify in 2019 opened Apple up to a lot of scrutiny. In 2024, after years of vague threats, the Department of Justice finally filed a wide-sweeping and vague antitrust lawsuit against Apple.The lawsuit got off to a messy start with the judge recusing himself and being replaced by US District Judge Julien Neals. Apple wrote a letter to the judge and requested an immediate dismissal, and now, more than a year later, Apple's request has finally been addressed. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Wesley Hilliard",
    "published": "Mon, 30 Jun 2025 21:20:30 +0000",
    "image": "https://photos5.appleinsider.com/gallery/64205-133712-IMG_2324-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "187af584-cb19-4f05-9d20-917d5cbf6510",
    "title": "New UPS text scam targets iPhone users with fake package redelivery info",
    "link": "https://appleinsider.com/articles/25/06/30/new-ups-text-scam-targets-iphone-users-with-fake-package-redelivery-info?utm_medium=rss",
    "description": "Cybercriminals and fraudsters are using fake texts, this time from UPS, to gain access to iPhone users' personal information. Here's how to stay safe and keep your data from falling into the wrong hands.Scammers are impersonating UPS and trying to steal iPhone users' information.Text messages claiming to be from the package delivery service UPS have been popping up as part of a new phishing scam. Much like the fake DMV texts our staffers receiver earlier in June 2025, which scared people with claims of unpaid traffic tickets and threats of legal action, the fraudulent UPS texts inform users of a supposed failed package delivery.The message even instructions about how to reschedule delivery, and claims that failing to do so will cause the unspecified package to be returned to its sender. The scammers behind the message put in a considerable amount of effort, and it may appear legitimate at first glance, given the lack of any obvious grammatical errors. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Marko Zivkovic",
    "published": "Mon, 30 Jun 2025 21:07:00 +0000",
    "image": "https://photos5.appleinsider.com/gallery/64204-133709-cropped-scam-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "a648ed53-bfde-424c-a012-1c6102c62810",
    "title": "Shot on iPhone 16 Pro | Big Man - Behind The Scenes | Apple",
    "link": "https://www.youtube.com/watch?v=HVuB_LoUE7Q",
    "description": "",
    "author": "Apple",
    "published": "2025-06-18T19:11:01+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "01d7458e-908b-4094-a013-39feebda5d53",
    "title": "Shot on iPhone 16 Pro | Big Man - Starring Stormzy | Apple",
    "link": "https://www.youtube.com/watch?v=AUrLMJQf2Bw",
    "description": "",
    "author": "Apple",
    "published": "2025-06-18T19:10:36+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "618ead37-7afe-4fbe-ae5f-8a6ec59a2ac8",
    "title": "Make taxes less taxing with Intuit QuickBooks for Mac or PC",
    "link": "https://www.cultofmac.com/deals/intuit-quickbooks-desktop-pro-2024-deal",
    "description": "If you want to track your income, expenses and more with greater ease, consider investing in Intuit QuickBooks Desktop Pro. (via Cult of Mac - Your source for the latest Apple news, rumors, analysis, reviews, how-tos and deals.)",
    "author": "Cult of Mac Deals",
    "published": "Mon, 30 Jun 2025 22:45:47 +0000",
    "image": "https://cdn.cultofmac.com/wp-content/uploads/2024/02/sale_324028_article_image.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Deals",
      "Cult of Mac Deals",
      "Mac apps"
    ]
  },
  {
    "id": "d7ff662d-a614-46f0-9196-1353ce4595cf",
    "title": "Apple might rely on AI rivals to make Siri smarter",
    "link": "https://www.cultofmac.com/news/siri-claude-chatgpt",
    "description": "Apple’s struggle to develop artificial intelligence might reach the point where the company needs to outsource Siri to an AI partner. (via Cult of Mac - Your source for the latest Apple news, rumors, analysis, reviews, how-tos and deals.)",
    "author": "Ed Hardy",
    "published": "Mon, 30 Jun 2025 20:32:46 +0000",
    "image": "https://cdn.cultofmac.com/wp-content/uploads/2025/06/Siri-ChatGPT-Claude.jpg.webp",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "News",
      "Apple Intelligence",
      "Apple rumors",
      "artificial intelligence",
      "ChatGPT",
      "OpenAI",
      "Siri"
    ]
  },
  {
    "id": "59388018-e07f-4aba-9200-d46ab47414dd",
    "title": "Charge your iPhone from another iPhone!",
    "link": "https://www.youtube.com/shorts/PWwjkXdWpaA",
    "description": "",
    "author": "MacRumors",
    "published": "2025-06-28T17:30:18+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "58ccb8f0-08b1-4a9b-9de2-9c825dc6ad05",
    "title": "Apple AirPods Pro 3: New Features Coming Soon!",
    "link": "https://www.youtube.com/watch?v=41uOQNcNHwo",
    "description": "",
    "author": "MacRumors",
    "published": "2025-06-27T17:52:59+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "435bbc35-6e28-4c0a-a0fc-5a6b07f46cf9",
    "title": "The Talk Show: ‘The Cutting Edge Latest Supermodel’",
    "link": "https://daringfireball.net/thetalkshow/2025/06/30/ep-426",
    "description": "",
    "author": "John Gruber",
    "published": "2025-06-30T23:11:56Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "51d4822a-0073-4176-91d7-2de524f268b0",
    "title": "Upcoming Sponsorship Openings at Daring Fireball",
    "link": "https://daringfireball.net/feeds/sponsors/",
    "description": "",
    "author": "John Gruber",
    "published": "2025-06-28T21:02:00Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "7dcf0538-a5ce-4dc5-b56c-36eb5372e18d",
    "title": "A cheap MacBook powered by an iPhone chip? Here’s how it could work",
    "link": "https://www.macworld.com/article/2832014/apple-may-launch-a-low-cost-macbook-powered-by-an-iphone-chip-later-this-year.html",
    "description": "Macworld Apple’s most affordable new laptop is a $999 MacBook Air. For a lot of people, that’s still too expensive, especially when compared to Chromebooks and budget PCs. But Apple may finally be doing something about that. According to analyst Ming-Chi Kuo, Apple plans to release a brand-new MacBook model that’s designed for the low-cost market. The laptop will not use an M-series chip, but an A18 Pro, the same chip found in the iPhone 16 Pro. Kuo believes it will have a 13-inch display and come in blue, pink, silver, and yellow. Kuo claims that the new laptop will become available either at the end of this year or the beginning of 2026. Apple has established late fall as the timeframe for the MacBook Pro releases, and the company is expected to update that laptop to the M5 this year. If Apple doesn’t release the new A18 Pro-based laptop at the same time, the company could launch it alongside the M5 MacBook Air update in 2026, which usually arrives in the first quarter. The use of an A18 Pro is interesting. It’s an iPhone chip, but Apple’s A- and M-series chips are based on the same general architecture–the M chips take advantage of the MacBook’s size and are more equipped to handle larger processing tasks. An A18 Pro MacBook will be able to do everything a M-series MacBook can, but it will be slower. In our past reviews, the A18 Pro in the iPhone 16 Pro has a Geekbench Multi-Core score of 8048, while the M4 MacBook Air’s score is 14680, but it will still be plenty capable. A16 Pro vs. M-series chips: Geekbench 6.4 Results are expressed as Geekbench scores. Higher scores/longer bars are faster. In fact, compared to all of the base-level M chips, the A18 Pro is even slower than the M1 that was released five years ago, though the difference is nominal. Even if Apple can improve the performance of an A16 Pro in a MacBook, it will feel like an M1 MacBook Air–which isn’t bad at all. Even today, an M1 MacBook Air is a good laptop for a lot of people who only use it for basic tasks such as email and web browsing. The use of a 13-inch display is also interesting. While the display will likely be similar to that of the 13-inch MacBook Air–an LED backlit panel–what will Apple do to maintain the profile difference between this laptop and the Air? The 13-inch Air is 0.44 inches (1.13 cm) thick and weighs 2.7 pounds (1.24 kg). At first, it would seem as though Apple would need to make this new laptop thicker and heavier to avoid negating the Air’s airiness, but that may not be the case because Apple could emphasize the Air’s mix of performance and portability. Offering the new laptop in blue, pink, silver, and yellow brings back memories of the iBook and its candy colors. But that also raises the question: will these laptops have aluminum cases? Kuo doesn’t offer details on the case material. Apple ditched plastic laptop cases years ago, but that doesn’t mean it won’t return. Plastic is cheaper than aluminum, and Kuo reports that Apple’s goal is to sell 25 million MacBook units a year, which would be a 5 million increase. To move 5 million units, Apple may have to bring the price significantly lower, and plastic may allow the company to do that. MacRumors reports that there may be references to this new laptop in the code of Apple Intelligence. Kuo doesn’t offer any more specifics about the laptop, though if this rumor holds up, we should hear more about it in the coming months.",
    "author": "",
    "published": "Mon, 30 Jun 2025 19:56:30 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/06/macbook_air_15_m4_sky_blue_7-7.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "MacBook"
    ]
  },
  {
    "id": "83aad53e-2f0f-4e93-8669-a4e654b8ad1c",
    "title": "iOS 18.6 beta 2 is here, but the changes are only for EU users",
    "link": "https://www.macworld.com/article/2818007/ios-18-6-beta-features-release.html",
    "description": "Macworld Apple has released the first beta of iOS 18.6. With all the new features and attention on iOS 26, this release is likely to be simply a bugfix and compatibility update. But while there aren’t any visible changes in iOS 18.6, it may be required to support new hardware Apple could release in the fall, such as AirPods Pro 3 or the upcoming home hub device. As such, 9to5Mac noticed the following string in the code: /System/Library/PrivateFrameworks/ProgressUI.framework/apple-logo-1088@2x~home.png That string’s image has “~home.png” in it, a structure not used in other images, and could be in reference to the rumored upcoming home hub or “HomePad” device. EU App Store changes Apple is rolling out new App Store guidelines and a new user experience for those in the EU, in an attempt to comply with the EU’s Digital Markets Act. Critics say Apple’s new terms are intentionally confusing, do not comply with EU law, and punish developers even more than before should they choose to avoid the App Store and distribute their apps themselves. iOS 18.6 includes a new user experience when customers attempt to install an alternative app marketplace or install apps directly from the web. This only applies to customers in the EU. iOS 18.6: How to install the public beta If you want to be among the first to test iOS 18.6, you can sign up for the public beta test. Click Sign Up on the Apple Beta page and register with your Apple ID. Log in to the Beta Software Program. Click Enroll your iOS device. Open the Settings app, tap General, then Software Update. In the Beta Updates section, select the iOS Public Beta. It may take a few moments after registering for the beta option to appear in Software Update. iOS 18.6: How to install the developer beta You’ll need to be registered as an Apple developer, but a free developer account will do. You can get one via Xcode or the Apple Developer app in iOS. Here’s how to do it via the Apple Developer app: Download the Apple Developer App from the App Store. Open the app. Tap on Account. Sign in using your usual Apple ID. Registered developers can choose to get the Public Beta instead by selecting iOS Public Beta in the Software Update screen. It may take a little time after registering as a developer for the option to appear in Software Updates. We expect iOS 18.6 to arrive in July. Find out everything you need to know about iOS 18 in our iOS 18 superguide.",
    "author": "",
    "published": "Mon, 30 Jun 2025 19:27:51 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/06/ios18-6-2.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "iOS"
    ]
  },
  {
    "id": "713e5105-5dda-4095-9943-ad95bdd8aeca",
    "title": "How to Install iPadOS 26 Beta on iPad",
    "link": "https://osxdaily.com/2025/06/30/how-to-install-ipados-26-beta-on-ipad/",
    "description": "iPadOS 26 offers a compelling set of features for iPad users that they have long asked for, including Mac-like windowing, improved multitasking capabilities, an improved Files app, the inclusion of Preview app, Phone app, plus all the popular iOS 26 features like the new Liquid Glass interface appearance, a redesigned Lock Screen, wallpapers in Messages, ... Read More",
    "author": "Paul Horowitz",
    "published": "Mon, 30 Jun 2025 18:56:28 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "iPad",
      "Tips \u0026 Tricks",
      "beta",
      "iOS 26",
      "iPadOS",
      "iPadOS 26",
      "iPadOS 26 beta",
      "tips",
      "tricks"
    ]
  },
  {
    "id": "adca28a0-39d5-445f-91bc-768509a58149",
    "title": "Deals: iPad Mini $399, iPad Air 13″ $699, M4 MacBook Air Starting at $849",
    "link": "https://osxdaily.com/2025/06/30/deals-ipad-mini-399-ipad-air-13-699-m4-macbook-air-starting-at-849/",
    "description": "Amazon is offering some nice deals on iPad models and the M4 MacBook Air again. This time we have the polar opposites of iPad available at $100 off, including the iPad Air with an 8″ display for $399, and the iPad Air with 13″ display for $699. Whether you want a small screen or a ... Read More",
    "author": "OSXDaily",
    "published": "Mon, 30 Jun 2025 18:51:49 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Deals",
      "deals"
    ]
  },
  {
    "id": "7ee58adb-daef-4f72-bd66-be98f7dc2b36",
    "title": "∞ The Dalrymple Report: Alexa+, Charging, and iOS 26",
    "link": "https://www.loopinsight.com/2025/06/27/the-dalrymple-report-alexa-charging-and-ios-26/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-alexa-charging-and-ios-26",
    "description": "Dave got a new speaker assistant for his home... and it's powered by Alexa. We talk about how much better Alexa is than Siri and even throw in some comments about Gemini, Google's AI assistant (spoiler, it's better than Siri too). We also talk about charging one device off of anotherfor instance, charging your AirPods using your phone. And we look at some of the new features of Apple's new OSes. Follow this podcast Show Notes: Charge AirPods (or Even an iPhone) With Your iPhone iOS 26 Brings New Functionality to HomePod A few iOS 26 Best and Hidden Features iPhone Users Upset About Apple Promoting F1 Movie With Wallet App Notification Shows and movies we're watching Anatomy of a Scandal, Netflix Sally, Disney+",
    "author": "Jim Dalrymple",
    "published": "Fri, 27 Jun 2025 17:41:20 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "3f5b7ea9-e903-49e8-b6ad-e1a27f72e9ad",
    "title": "∞ The Dalrymple Report: ETA, Liquid Glass, and iCloud Storage",
    "link": "https://www.loopinsight.com/2025/06/20/the-dalrymple-report-eta-liquid-glass-and-icloud-storage/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-eta-liquid-glass-and-icloud-storage",
    "description": "Have you ever shared your ETA with someone? Most of us have. Dave has a suggestion for how ETA should work in the future. We talk about the Apple's new design, Liquid Glass, and what drove the company to move in that direction for its OSes. We also talk about a new lawsuit that Apple faces over iCloud storage. Follow this podcast Brought to you by: LinkedIn Jobs: LinkedIn Jobs helps you find the candidates you want to talk to, faster. Did you know every week, nearly 40 million job seekers visit LinkedIn? Post your job for free at LinkedIn.com/DALRYMPLE. Terms and conditions apply. Show Notes: WWDC: The Bento Boxes On AR being the driver for Apple's Liquid Glass Apple must face consumer lawsuit over iCloud storage, US judge rules YouTube's Latest Move Against Ad Blockers: Video Delays Shows and movies we're watching Anatomy of a Scandal, Netflix Trailer to upcoming Springsteen biopic",
    "author": "Jim Dalrymple",
    "published": "Fri, 20 Jun 2025 16:02:18 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "98c33410-79d7-47b5-9aec-407dcd80694f",
    "title": "Retreating to Safety",
    "link": "https://marco.org/2025/05/30/retreat",
    "description": "Ten years ago, Apple’s Phil Schiller surprised Apple enthusiasts and developers by walking out on stage at John Gruber’s The Talk Show Live WWDC event and giving an open, human, honest interview to a somewhat jaded community. I wrote this in response: Both Apple and Phil Schiller himself took a huge risk in doing this. That they agreed at all is a noteworthy gift to this community of long-time enthusiasts, many of whom have felt under-appreciated as the company has grown. […] Phil’s appearance on the show was warm, genuine, informative, and entertaining. It was human. And humanizing the company and its decisions, especially to developers — remember, developer relations is all under Phil — might be worth the PR risk. This started a ten-year run of interviews by Apple executives on The Talk Show every year at WWDC that proved to be great, surprisingly safe PR for Apple. No executive ever said something they shouldn’t have (they’re pros), no sensational or negative news stories ever resulted from them, and Apple’s enthusiastic fans and developers felt seen, heard, and appreciated. *     *     * For unspecified reasons, Apple has declined to participate this year, ending what had become a beloved tradition in our community — and I can’t help but suspect that it won’t come back. (A lot has changed in the meantime.) Maybe Apple has good reasons. Maybe not. We’ll see what their WWDC PR strategy looks like in a couple of weeks. In the absence of any other information, it’s easy to assume that Apple no longer wants its executives to be interviewed in a human, unscripted, unedited context that may contain hard questions, and that Apple no longer feels it necessary to show their appreciation to our community and developers in this way. I hope that’s either not the case, or it doesn’t stay the case for long. This will be the first WWDC I’m not attending since 2009 (excluding the remote 2020 one, of course). Given my realizations about my relationship with Apple and how they view developers, I’ve decided that it’s best for me to take a break this year, gain some perspective, and decide what my future relationship should look like. Maybe Apple’s leaders are doing that, too.",
    "author": "",
    "published": "Fri, 30 May 2025 11:33:22 EDT",
    "image": "https://marco.org/media/2015/06/tts2015-schiller6.jpg",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "c777d1b2-493a-47f7-b078-cee484e63163",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "47ca6bef-96ac-4dc0-a45d-7739473eab9b",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "e795edde-ef49-45f5-a09d-bed2ff5cf7a0",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  },
  {
    "id": "a88f48cb-cd5f-4a63-aa3f-b1e09b2ee950",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 10:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "bffb177b-8d2c-4ab2-8870-24ecf28c477d",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 06:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "65a66a9d-5a0e-49cf-bb58-2e124d28a5e8",
    "title": "Apple Music Celebrates Its 10th Anniversary with a New Campus, Radio Events, and a Special Playlist",
    "link": "https://www.macstories.net/news/apple-music-celebrates-its-10th-anniversary-with-a-new-campus-radio-events-and-a-special-playlist/",
    "description": "Source: Apple. It’s been 10 years since Apple Music launched the summer following Apple’s acquisition of Beats. To mark the anniversary, Apple has made several announcements. First of all, the company will soon open a 15,000 square foot multi-use campus in Culver City, California. According to Apple’s press release: …the new studio represents a major […] The post Apple Music Celebrates Its 10th Anniversary with a New Campus, Radio Events, and a Special Playlist first appeared on MacStories.",
    "author": "John Voorhees",
    "published": "Mon, 30 Jun 2025 15:30:41 +0000",
    "image": "https://cdn.macstories.net/apple-music-10th-anniversary-los-angeles-studio-1751296873866.jpg",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "Apple Music",
      "services"
    ]
  },
  {
    "id": "38cbefd3-fd6a-4265-af25-cf10af53e7f5",
    "title": "Podcast Rewind: Upgrading from a 2012 Mac mini Server, Every Phone We’ve Ever Owned, and Seeing F1: The Movie in IMAX",
    "link": "https://www.macstories.net/news/podcast-rewind-upgrading-from-a-2012-mac-mini-server-every-phone-weve-ever-owned-and-seeing-f1-the-movie-in-imax/",
    "description": "Enjoy the latest episodes from MacStories’ family of podcasts: Comfort Zone Niléane hosts the next installment of the Our Tech Stories series, Chris has an iPad keyboard case with a kickstand, and everyone attempts to replace a cherished app with something from Apple. MacStories Unwind This week, Federico and John dig into MacStories’ big infrastructure […] The post Podcast Rewind: Upgrading from a 2012 Mac mini Server, Every Phone We’ve Ever Owned, and Seeing F1: The Movie in IMAX first appeared on MacStories.",
    "author": "Devon Dundee",
    "published": "Fri, 27 Jun 2025 17:35:35 +0000",
    "image": "https://cdn.macstories.net/untitled-1738434411572.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "Comfort Zone",
      "Magic Rays of Light",
      "podcast",
      "unwind"
    ]
  }
]
