{
  "id": "03dae757-f7e4-4584-96ab-6bd2f19bd7fc",
  "title": "Use These 4 Apps and Tools to Detect Phishing Emails",
  "link": "https://www.makeuseof.com/best-apps-tools-detect-phishing-emails/",
  "description": "Phishing emails are everywhere, but there are a bunch of tools you can use to avoid them.",
  "author": "Spencer Abel",
  "published": "Sun, 17 Nov 2024 21:00:13 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Security",
    "Scams",
    "Phishing",
    "Email Security"
  ],
  "byline": "Spencer Abel",
  "length": 12657,
  "excerpt": "Phishing emails are everywhere, but there are a bunch of tools you can use to avoid them.",
  "siteName": "MakeUseOf",
  "favicon": "https://www.makeuseof.com/public/build/images/favicon-240x240.df310da5.png",
  "text": "Scams Sign in to your MUO account Phishing emails are no longer exclusively sent by Nigerian princes needing financial assistance. Scammers are now tech-savvy criminals who leverage state-of-the-art tools to con their victims. But it's not like they're the only ones with an arsenal of tools to pull from. 1 VirusTotal Most phishing emails will send you attached files and links or try to send you to a website. How do you know if these files, links, and websites are secure? One way to find out is to run them through VirusTotal's malware scanner. When run through the free VirusTotal detection, 70+ antivirus scanners and URL/domain blocklisting services will analyze your file, link, or website. Once run through the scanner, you'll be provided results from the antivirus scanners, indicating whether the link, file, or domain you input is deemed to be clean or some form of malware. For example, this VirusTotal scan for 17ebook.com shows that several sites consider this malicious, malware, or phishing, so you should probably avoid it. 2 CheckPhish Before clicking on a link that takes you to an unknown website, be sure to run it through a website scanner like CheckPhish. CheckPhish scans suspect websites to identify if they are malicious. After you scan a website, you'll be notified if it is clean, suspicious, or a known threat. You will also learn information such as where the IP address is located, the hosting provider, certificate details, related URLS, and its history of phishing. CheckPhish will also alert you if the URL in question is a typosquatting website. A typosquatting website is one that imitates a legitimate website but is designed with nefarious intentions. These websites are often a character or two different from popular websites. Once they are accessed, you may have no idea you're on the wrong site, as this imitator domain resembles the website you were trying to access. 3 urlscan.io urlscan.io is exclusively used to analyze websites for malware. After the scan, you'll receive a verdict indicating whether the site is safe or unsafe or if a verdict cannot be determined. You'll also be provided a screenshot of the website, DNS and IP records, and the platform hosting the website. 4 Mailwasher Regardless of your email client, it will most likely filter scams, spam, and junk email. But that doesn't necessarily mean downloading a spam blocker like Mailwasher is unnecessary. Cybersecurity specialists believe in a concept called defense in depth, which means that multiple layers of security create a robust digital defense. Using Mailwasher alongside the built-in spam filter used by your email client will only increase your security. Mailwasher can detect spam, phishing emails, viruses, and even unwanted newsletters and emails. It is not a browser plug-in that can run in the background as you open your mail client. Instead, you must connect your email to MailWasher and run the program to inspect emails. If you're suspicious of an email, you can preview it without opening it. If the program has judged an email to be malicious, you can delete it from the program itself. Scammers may have evolved over recent years, but they're not the only ones who can leverage the latest tools to their advantage.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/07/phishing-alert-on-smartphone.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n        \n        \n\n            \u003carticle\u003e\n\n        \n                \n    \n\n\n\n    \n    \n    \n        \n           \u003cheader\u003e\n            \n                                                \n\n\n        \n                           \n            \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n\n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n                    \n\n        \u003ca href=\"https://www.makeuseof.com/tag/scam/\"\u003e\u003cspan\u003eScams\u003c/span\u003e\u003c/a\u003e\n\n\u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://static1.makeuseofimages.com/wordpress%2Fwp-content%2Fauthors%2F66ba6ffdc79d3-spencer%20profile%20pic.jpeg?fit=crop\u0026amp;w=90\u0026amp;h=90\" alt=\"4\" loading=\"lazy\" decoding=\"async\"/\u003e\n                                    \u003c/p\u003e\n                    \u003c/div\u003e\n\n            \n\n\n            \u003ca id=\"login-button-article-sidebar\"\u003e\n            \u003cp\u003eSign in to your \u003cspan\u003eMUO\u003c/span\u003e account\u003c/p\u003e\n            \n        \u003c/a\u003e\n            \n                                \n                                    \n                                                                                                                        \n                                            \n                                                    \n    \n\n\n            \n                \n    \n    \n        \n    \n\n    \n            \u003c/header\u003e\n\n                                                        \n        \n\n        \n                                        \n                                \n            \n                        \n        \n        \n\n    \n            \n    \n                                                            \n            \n    \n    \n                                                                            \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n                                                    \n                        \n    \n                                                                                                                        \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                                                    \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                                    \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                                                    \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                                    \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                                                    \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                                    \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                                                    \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                                    \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n            \n    \n    \n        \n                    \n                        \n                                    \n\n\n\n\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003ePhishing emails are no longer exclusively sent by Nigerian princes needing financial assistance. Scammers are now tech-savvy criminals who leverage state-of-the-art tools to con their victims. But it\u0026#39;s not like they\u0026#39;re the only ones with an arsenal of tools to pull from.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"virustotal\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003ca href=\"https://www.virustotal.com/gui/home/upload\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eVirusTotal\u003c/a\u003e \u003c/span\u003e \u003c/h2\u003e\n\n\n\n\u003cp\u003eMost phishing emails will send you attached files and links or try to send you to a website. How do you know if these files, links, and websites are secure?\u003c/p\u003e\n\n\u003cp\u003eOne way to find out is to run them through VirusTotal\u0026#39;s malware scanner. When run through the free VirusTotal detection, 70+ antivirus scanners and URL/domain blocklisting services will analyze your file, link, or website.\u003c/p\u003e\n\n\n\u003cp\u003eOnce run through the scanner, you\u0026#39;ll be provided results from the antivirus scanners, indicating whether the link, file, or domain you input is deemed to be clean or some form of malware. For example, this \u003ca href=\"http://www.virustotal.com/gui/domain/17ebook.com\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eVirusTotal scan\u003c/a\u003e for 17ebook.com shows that several sites consider this malicious, malware, or phishing, so you should probably avoid it.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"checkphish\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003ca href=\"http://checkphish.bolster.ai/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eCheckPhish\u003c/a\u003e \u003c/span\u003e \u003c/h2\u003e\n\n\n\u003cp\u003eBefore clicking on a link that takes you to an unknown website, be sure to run it through a website scanner like \u003ca href=\"https://checkphish.bolster.ai/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eCheckPhish\u003c/a\u003e. CheckPhish scans suspect websites to identify if they are malicious. After you scan a website, you\u0026#39;ll be notified if it is clean, suspicious, or a known threat. You will also learn information such as where the IP address is located, the hosting provider, certificate details, related URLS, and its history of phishing.\u003c/p\u003e\n\n\n\u003cp\u003eCheckPhish will also alert you if the URL in question is a \u003ca href=\"https://www.makeuseof.com/what-is-typosquatting/\" target=\"_blank\"\u003etyposquatting website.\u003c/a\u003e A typosquatting website is one that imitates a legitimate website but is designed with nefarious intentions. These websites are often a character or two different from popular websites. Once they are accessed, you may have no idea you\u0026#39;re on the wrong site, as this imitator domain resembles the website you were trying to access.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"urlscan-io\"\u003e\u003cspan\u003e3 \u003c/span\u003e\u003cspan\u003e\u003ca href=\"https://urlscan.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eurlscan.io\u003c/a\u003e \u003c/span\u003e \u003c/h2\u003e\n\n\n\u003cp\u003eurlscan.io is exclusively used to analyze websites for malware. After the scan, you\u0026#39;ll receive a verdict indicating whether the site is safe or unsafe or if a verdict cannot be determined. You\u0026#39;ll also be provided a screenshot of the website, DNS and IP records, and the platform hosting the website.\u003c/p\u003e\n\n\n\n\n\n\n\u003ch2 id=\"mailwasher\"\u003e\u003cspan\u003e4 \u003c/span\u003e\u003cspan\u003e\u003ca href=\"http://www.mailwasher.net/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMailwasher\u003c/a\u003e \u003c/span\u003e \u003c/h2\u003e\n\u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\u003cfigure\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\"/\u003e\u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\u003cimg width=\"1526\" height=\"610\" loading=\"lazy\" decoding=\"async\" alt=\"MailWasher checking email. \" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/screenshot-2024-11-14-at-13-40-44.png\"/\u003e \u003c/picture\u003e \u003c/figure\u003e \u003c/div\u003e\n\n\u003cp\u003eRegardless of your email client, it will most likely filter scams, spam, and junk email. But that doesn\u0026#39;t necessarily mean downloading a spam blocker like \u003ca href=\"https://www.mailwasher.net/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eMailwasher\u003c/a\u003e is unnecessary. Cybersecurity specialists believe in a concept called defense in depth, which means that multiple layers of security create a robust digital defense. Using Mailwasher alongside the built-in spam filter used by your email client will only increase your security.\u003c/p\u003e\n\n\u003cp\u003eMailwasher can detect spam, phishing emails, viruses, and even unwanted newsletters and emails. It is not a browser plug-in that can run in the background as you open your mail client. Instead, you must connect your email to MailWasher and run the program to inspect emails. If you\u0026#39;re suspicious of an email, you can preview it without opening it. If the program has judged an email to be malicious, you can delete it from the program itself.\u003c/p\u003e\n\n\n\u003cp\u003eScammers may have evolved over recent years, but they\u0026#39;re not the only ones who can leverage the latest tools to their advantage.\u003c/p\u003e\n\n \u003c/div\u003e\n\n\n    \n        \n\n    \n\n        \n\n\n                \n        \n        \n\n\n        \n\n\n\n\n\n                \n    \u003c/article\u003e\n\n    \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2024-11-17T21:00:13Z",
  "modifiedTime": "2024-11-17T21:00:13Z"
}
