{
  "id": "14100c4d-7d9c-4826-961a-5ee48db7ab7f",
  "title": "ONLYOFFICE Docs 9.0 Brings AI Smarts, Markdown Support, and a Sleek Redesign",
  "link": "https://www.makeuseof.com/onlyoffice-docs-9/",
  "description": "This post is sponsored by ONLYOFFICE.",
  "author": "Sponsored",
  "published": "Wed, 18 Jun 2025 19:00:16 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Promoted"
  ],
  "byline": "Sponsored",
  "length": 19349,
  "excerpt": "This post is sponsored by ONLYOFFICE.",
  "siteName": "MakeUseOf",
  "favicon": "https://static0.makeuseofimages.com/assets/images/favicon-240x240.df310da5.png",
  "text": "This article is sponsored by ONLYOFFICE. Product choices and opinions expressed are from the sponsor and do not reflect the views of MakeUseOf editorial staff. The latest update to ONLYOFFICE Docs marks a major leap forward in user experience, compatibility, and productivity. Version 9.0 introduces a clean, intuitive interface across all editors, while packing in meaningful upgrades like AI-powered features, Markdown support, and a versatile Diagram Viewer. Whether you’re working solo or collaborating across teams, this release is designed to help you move faster, smarter, and with fewer barriers. ONLYOFFICE’s commitment to user-first design shines through in this release, which spans across its document, spreadsheet, presentation, and PDF tools. With over 15 million users globally, the platform is quickly evolving into one of the most compelling alternatives to mainstream office software. A Redesigned Interface Makes Editing Feel Modern Again ONLYOFFICE Docs 9 The first thing users will notice in Docs 9.0 is the updated interface. Available across all editors, the new design is focused on clarity, reducing clutter, and making essential tools easier to access. Whether you’re revising a PDF, formatting a document, building a spreadsheet, or designing a presentation, the refreshed look helps you stay focused on the task at hand. In practical terms, this means improved spacing, more readable icons, and smoother workflows across the board. Users can choose between Modern Light and Modern Dark themes via the View tab for visual comfort in any environment. One of the most useful additions is the new Diagram Viewer, which eliminates the need for third-party apps when opening diagram files. Available on the web, desktop, and mobile, it supports formats such as Visio (.vsd, .vsdx) and OpenDocument Graphics (.odg). Whether you're reviewing org charts, flow diagrams, or technical schematics, this built-in viewer streamlines the process of opening and inspecting visuals on any device. Markdown and Expanded Format Support Widen the Compatibility Net ONLYOFFICE Docs 9.0 boosts cross-platform and multi-format usability by adding support for Markdown (.md) files. It’s a welcome update for developers, writers, and anyone who works in plain text environments. Other additions include editable Excel Binary Workbooks (.xlsb), enhanced support for Visio files, and broader compatibility for open document formats. These improvements make the platform more flexible for professionals managing a diverse range of documents. Docs 9.0 isn’t just about looking better—it’s about working smarter. New AI-powered features bring automation to the forefront of the suite, particularly in spreadsheets and macros. These tools are designed to simplify workflows that typically require manual effort. In spreadsheets, AI now helps users apply formulas, analyze data trends, and uncover insights faster. Macro support benefits from AI-assisted creation and VBA conversion, letting users build automations without diving deep into coding. For teams handling large datasets or routine calculations, these features can significantly cut down on tedious work. The PDF Editor also receives a significant upgrade in this release. Users can now co-author PDF forms in real time, enabling teams to fill out or design forms together. This collaborative form editor is especially helpful for tax documents, HR paperwork, and legal agreements that require input from multiple people. Docs 9.0 also introduces drag-and-drop page reordering via the thumbnails panel and shortcut-based page duplication, allowing for more flexible document structuring. Combined, these features make working with PDFs nearly as seamless as editing Word documents. Document and Presentation Editing Are More Powerful Than Ever The Document Editor now allows users to apply paragraph borders with a single click from the toolbar. Content Controls have been improved to support enhanced visual tracking of changes and custom plugin-based buttons, expanding interactivity and visibility. Presentation creators will find that Docs 9.0 introduces support for paragraph direction control—ideal for RTL languages—and more advanced text animations that appear properly during slideshow mode. This gives presenters more flexibility in multilingual environments and helps deliver more polished visuals. Localization Updates and RTL Improvements Support a Global Audience True to its open-source roots, ONLYOFFICE continues to prioritize accessibility and localization. Docs 9.0 includes Right-to-Left (RTL) text improvements for languages such as Arabic and Hebrew. Users can now set paragraph direction from the toolbar, enjoy better cursor navigation, and experience accurate border rendering in RTL layouts. New language support includes Urdu and additional Arabic spellchecking tools, along with enhanced font settings in the Simplified Chinese interface. Server admins can now also upload custom dictionaries, further tailoring the editing experience to specific organizational needs. Smarter Charts and Better Data Control for All Editors Across all editors, chart tools are more capable thanks to new options like Up/Down bars and stylized WordArt captions. These features make it easier to produce visually engaging graphs that communicate data clearly. Spreadsheet users benefit from asynchronous calculation support, allowing complex custom functions to run more efficiently. There’s also a new option to pull in data from external spreadsheets, making Docs 9.0 more capable as a lightweight data integration tool. Mobile and Desktop Apps Get In on the Action Too ONLYOFFICE hasn’t left mobile and desktop users behind. The mobile apps for iOS and Android now support opening Markdown files and include AI-based text recognition in images, giving users more freedom to work on the go. Desktop editors also gain access to the new features, including AI support, diagram viewing, and the redesigned interface. Whether self-hosted or deployed via desktop and mobile, Docs 9.0 aims for consistency across platforms. Available Now for Self-Hosting, With Cloud Updates to Follow ONLYOFFICE Docs 9.0 is available now as a self-hosted package for organizations and users who prefer to run the software on their own infrastructure. For those using cloud-based deployments, the update will roll out shortly. This approach gives enterprises and privacy-conscious users more control over when and how to adopt new features. Docs 9.0 proves that ONLYOFFICE is serious about becoming a go-to productivity suite. By blending sleek design, expanded compatibility, collaborative workflows, and intelligent automation, the platform offers a compelling alternative to traditional office software. For professionals seeking a robust, flexible, and open-source toolset for editing documents, spreadsheets, presentations, and PDFs, this latest update is a powerful reason to give ONLYOFFICE another look.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/release-9-cover.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\n\u003cdiv id=\"custom_block_0\" data-nosnippet=\"\"\u003e\n\n        \n            \u003cp\u003e\u003cem\u003eThis article is sponsored by ONLYOFFICE. Product choices and opinions expressed are from the sponsor and do not reflect the views of MakeUseOf editorial staff.\u003c/em\u003e\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003cp\u003eThe latest update to \u003ca href=\"https://www.onlyoffice.com/office-suite.aspx?utm_source=muo\u0026amp;utm_medium=sponsored\u0026amp;utm_campaign=muo_docs9.0\" rel=\"noopener noreferrer sponsored\" target=\"_blank\"\u003eONLYOFFICE Docs\u003c/a\u003e marks a major leap forward in user experience, compatibility, and productivity. Version 9.0 introduces a clean, intuitive interface across all editors, while packing in meaningful upgrades like AI-powered features, Markdown support, and a versatile Diagram Viewer.\u003c/p\u003e    \u003cp\u003eWhether you’re working solo or collaborating across teams, this release is designed to help you move faster, smarter, and with fewer barriers.\u003c/p\u003e    \u003cp\u003eONLYOFFICE’s commitment to user-first design shines through in this release, which spans across its document, spreadsheet, presentation, and PDF tools. With over 15 million users globally, the platform is quickly evolving into one of the most compelling alternatives to mainstream office software.\u003c/p\u003e    \u003ch2 id=\"a-redesigned-interface-makes-editing-feel-modern-again\"\u003e\n                        A Redesigned Interface Makes Editing Feel Modern Again\n               \u003c/h2\u003e    \n    \n                \n                                \n    \n                            \n    \n        \n        \n    \n\n        \n\n    \n\n        \n                    \n    \n                                                            \n    \u003cdiv data-show-streamrentbuy-links=\"false\" data-include-community-rating=\"false\" id=\"eac6-4427-8e42b576db9f\"\u003e\n                                    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png?q=70\u0026amp;fit=crop\u0026amp;w=420\u0026amp;h=280\u0026amp;dpr=1\"/\u003e\n                    \n                    \u003cimg width=\"420\" height=\"280\" loading=\"lazy\" decoding=\"async\" alt=\"OnlyOffice Docs logo\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/01/logo_center.png\"/\u003e\n        \n    \u003c/picture\u003e\n                \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n                                \u003cdiv\u003e\n                        \u003cp\u003e\n                                                                                        \t\n\u003ch5\u003e\n\t\n\n\t\t\t\t\t\tONLYOFFICE Docs 9\n\t\t\t\u003c/h5\u003e\n                            \n                                                                                                            \u003c/p\u003e\n\n                                            \u003c/div\u003e\n            \u003c/div\u003e\n\u003cp\u003eThe first thing users will notice in Docs 9.0 is the updated interface. Available across all editors, the new design is focused on clarity, reducing clutter, and making essential tools easier to access. Whether you’re revising a PDF, formatting a document, building a spreadsheet, or designing a presentation, the refreshed look helps you stay focused on the task at hand.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"ONLYOFFICE Docs 9 redesigned interface\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/redesigned-interface.png\"/\u003e\n        \n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\u003cp\u003eIn practical terms, this means improved spacing, more readable icons, and smoother workflows across the board. Users can choose between Modern Light and Modern Dark themes via the View tab for visual comfort in any environment.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"Diagram Viewer onlyoffice docs 9\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/diagram-viewer.png\"/\u003e\n        \n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\u003cp\u003eOne of the most useful additions is the new Diagram Viewer, which eliminates the need for third-party apps when opening diagram files. Available on the web, desktop, and mobile, it supports formats such as Visio (.vsd, .vsdx) and OpenDocument Graphics (.odg).\u003c/p\u003e    \u003cp\u003eWhether you\u0026#39;re reviewing org charts, flow diagrams, or technical schematics, this built-in viewer streamlines the process of opening and inspecting visuals on any device.\u003c/p\u003e    \u003ch2 id=\"markdown-and-expanded-format-support-widen-the-compatibility-net\"\u003e\n                        Markdown and Expanded Format Support Widen the Compatibility Net\n               \u003c/h2\u003e\u003cp\u003eONLYOFFICE Docs 9.0 boosts cross-platform and multi-format usability by adding support for Markdown (.md) files. It’s a welcome update for developers, writers, and anyone who works in plain text environments.\u003c/p\u003e    \u003cp\u003eOther additions include editable Excel Binary Workbooks (.xlsb), enhanced support for Visio files, and broader compatibility for open document formats. These improvements make the platform more flexible for professionals managing a diverse range of documents.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"AI Spreadsheets onlyoffice docs 9\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-spreadsheets.png\"/\u003e\n        \n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\u003cp\u003eDocs 9.0 isn’t just about looking better—it’s about working smarter. New AI-powered features bring automation to the forefront of the suite, particularly in spreadsheets and macros. These tools are designed to simplify workflows that typically require manual effort.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"AI Macro onlyoffice docs 9\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/06/ai-macro.png\"/\u003e\n        \n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\u003cp\u003eIn spreadsheets, AI now helps users apply formulas, analyze data trends, and uncover insights faster. Macro support benefits from AI-assisted creation and VBA conversion, letting users build automations without diving deep into coding. For teams handling large datasets or routine calculations, these features can significantly cut down on tedious work.\u003c/p\u003e    \u003cp\u003eThe PDF Editor also receives a significant upgrade in this release. Users can now co-author PDF forms in real time, enabling teams to fill out or design forms together. This collaborative form editor is especially helpful for tax documents, HR paperwork, and legal agreements that require input from multiple people.\u003c/p\u003e    \u003cp\u003eDocs 9.0 also introduces drag-and-drop page reordering via the thumbnails panel and shortcut-based page duplication, allowing for more flexible document structuring. Combined, these features make working with PDFs nearly as seamless as editing Word documents.\u003c/p\u003e    \u003ch2 id=\"document-and-presentation-editing-are-more-powerful-than-ever\"\u003e\n                        Document and Presentation Editing Are More Powerful Than Ever\n               \u003c/h2\u003e\u003cp\u003eThe Document Editor now allows users to apply paragraph borders with a single click from the toolbar. Content Controls have been improved to support enhanced visual tracking of changes and custom plugin-based buttons, expanding interactivity and visibility.\u003c/p\u003e    \u003cp\u003ePresentation creators will find that Docs 9.0 introduces support for paragraph direction control—ideal for RTL languages—and more advanced text animations that appear properly during slideshow mode. This gives presenters more flexibility in multilingual environments and helps deliver more polished visuals.\u003c/p\u003e    \u003ch2 id=\"localization-updates-and-rtl-improvements-support-a-global-audience\"\u003e\n                        Localization Updates and RTL Improvements Support a Global Audience\n               \u003c/h2\u003e\u003cp\u003eTrue to its open-source roots, ONLYOFFICE continues to prioritize accessibility and localization. Docs 9.0 includes Right-to-Left (RTL) text improvements for languages such as Arabic and Hebrew. Users can now set paragraph direction from the toolbar, enjoy better cursor navigation, and experience accurate border rendering in RTL layouts.\u003c/p\u003e    \u003cp\u003eNew language support includes Urdu and additional Arabic spellchecking tools, along with enhanced font settings in the Simplified Chinese interface. Server admins can now also upload custom dictionaries, further tailoring the editing experience to specific organizational needs.\u003c/p\u003e    \u003ch2 id=\"smarter-charts-and-better-data-control-for-all-editors\"\u003e\n                        Smarter Charts and Better Data Control for All Editors\n               \u003c/h2\u003e\u003cp\u003eAcross all editors, chart tools are more capable thanks to new options like Up/Down bars and stylized WordArt captions. These features make it easier to produce visually engaging graphs that communicate data clearly.\u003c/p\u003e    \u003cp\u003eSpreadsheet users benefit from asynchronous calculation support, allowing complex custom functions to run more efficiently. There’s also a new option to pull in data from external spreadsheets, making Docs 9.0 more capable as a lightweight data integration tool.\u003c/p\u003e    \u003ch2 id=\"mobile-and-desktop-apps-get-in-on-the-action-too\"\u003e\n                        Mobile and Desktop Apps Get In on the Action Too\n               \u003c/h2\u003e\u003cp\u003eONLYOFFICE hasn’t left mobile and desktop users behind. The mobile apps for iOS and Android now support opening Markdown files and include AI-based text recognition in images, giving users more freedom to work on the go.\u003c/p\u003e    \u003cp\u003eDesktop editors also gain access to the new features, including AI support, diagram viewing, and the redesigned interface. Whether self-hosted or deployed via desktop and mobile, Docs 9.0 aims for consistency across platforms.\u003c/p\u003e    \u003ch2 id=\"available-now-for-self-hosting-with-cloud-updates-to-follow\"\u003e\n                        Available Now for Self-Hosting, With Cloud Updates to Follow\n               \u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://www.onlyoffice.com/office-suite.aspx?utm_source=muo\u0026amp;utm_medium=sponsored\u0026amp;utm_campaign=muo_docs9.0\" rel=\"noopener noreferrer sponsored\" target=\"_blank\"\u003eONLYOFFICE Docs\u003c/a\u003e 9.0 is available now as a self-hosted package for organizations and users who prefer to run the software on their own infrastructure. For those using cloud-based deployments, the update will roll out shortly. This approach gives enterprises and privacy-conscious users more control over when and how to adopt new features.\u003c/p\u003e    \u003cp\u003eDocs 9.0 proves that ONLYOFFICE is serious about becoming a go-to productivity suite. By blending sleek design, expanded compatibility, collaborative workflows, and intelligent automation, the platform offers a compelling alternative to traditional office software.\u003c/p\u003e    \u003cp\u003eFor professionals seeking a robust, flexible, and open-source toolset for editing documents, spreadsheets, presentations, and PDFs, this latest update is a powerful reason to give ONLYOFFICE another look.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "21 min read",
  "publishedTime": "2025-06-18T19:00:16Z",
  "modifiedTime": "2025-06-18T19:00:16Z"
}
