{
  "id": "76047e1c-cca9-4ce6-ac25-5d4a42b399f2",
  "title": "How to Use Google Wallet to Store Loyalty Cards and Gift Cards",
  "link": "https://www.howtogeek.com/google-wallet-store-loyalty-gift-cards/",
  "description": "Arguably more useful than storing your payment cards.",
  "author": "Bertel King",
  "published": "Wed, 05 Mar 2025 22:15:16 GMT",
  "source": "https://www.howtogeek.com/feed/",
  "categories": [
    "Android",
    "Google Wallet",
    "Google Play Store",
    "Android Phones \u0026 Tablets"
  ],
  "byline": "Bertel King",
  "length": 10200,
  "excerpt": "Arguably more useful than storing your payment cards.",
  "siteName": "How-To Geek",
  "favicon": "https://www.howtogeek.com/public/build/images/favicon-240x240.f06f736a.png",
  "text": "Quick Links Google Wallet Isn't Just for Payments ​How to Use Your Cards In-Store and Online Regardless of whether you use Google Wallet to make payments, it's worth using the app to consolidate your various membership and gift cards. Doing so is easier than you might think.​ Google Wallet Isn't Just for Payments Just like a physical wallet, Google Wallet can store various types of cards that you're compelled to carry around. Debit and credit cards first come to mind, but that's just the top of the list. You can use Google Wallet as a transit pass to let you board the metro. In some places, Google Wallet can even store your driver's license. Loyalty cards come in a few forms. Some merely offer discounts, like a Kroger card. Others are required for entry, such as with wholesale retailers like Costco and Sam's Club. Some establishments that aren't retailers fall into this category as well, such as gyms and airlines. Gift cards, which carry a balance that can only be used in a specific store, function differently from your regular payment cards. Google Wallet treats them more like loyalty cards and all the other types of non-payment cards you can add. Related How to Add Loyalty Cards To add loyalty cards to Google Wallet, open the app and then: Tap the \"Add to Wallet\" button on the bottom right. This will take you to a screen presenting different types of cards that Google Wallet supports. Select \"Loyalty Card.\" Google Wallet will then provide you with a list of stores to pick from. You can find many national brands, like CVS, Lowe's, and Regal Cinemas just by scrolling. This is hardly an exhaustive list, so don't panic if what you're looking for doesn't appear under \"Popular Nearby.\" Just hit the search bar at the top and type away. Then tap the one you're looking for when it pops up. At this point, Google Wallet will open a camera and let you scan your loyalty card to add it automatically. If your card doesn't scan for whatever reason, you can often enter the member ID number manually instead by tapping the \"Enter Manually\" button in the bottom right. How you're able to add cards varies by retailer. Some will allow you to enter your number manually, while others will only allow you to scan with the camera. Some, like CVS, might prompt you to search for your card by entering your name, phone number, and other information to connect Google Wallet to their online account. ​How to Add Gift Cards To add gift cards to Google Wallet, open the app and follow these instructions: Tap the \"Add to Wallet\" button in the bottom-right corner. Select \"Gift Cards.\" This will pull up a list of popular retailers nearby that offer gift cards. You can tap one or search manually, just like with loyalty cards. Once you've selected a retailer, here the instructions differ. Instead of scanning a card, you must enter information manually. Some stores, like McDonald's, only ask you for a card number and the remaining balance. Others, like Kohl's, will ask you to enter a PIN as well. In either case, you can also enter notes, such as a reminder of who the gift card is from. Hit \"Add to Wallet\" when you're done. ​How to Use Your Cards In-Store and Online To use either a loyalty card or a gift card in-store, open the Google Wallet app. You will see your payment cards at the top, prompting you to hold your phone against the reader. Immediately below, you will see your other cards. To use a card: Tap on a card to bring up its barcode. Place the on-screen barcode in front of a scanner. If the barcode does not work, or a scanner is not available, the membership or gift card number is listed below the barcode. The latter is also useful whenever you want to use a gift card online. You can hold down on the number to copy and paste the information into a web browser or another app. To view your remaining balance, tap the menu button in the top-right when the barcode is visible. How to Remove a Card Memberships and gift cards don't linger around as long as payment cards. Some you will remove after a year when your annual membership is set to expire. Gift cards might not even make it until the end of the day before you deplete them of any value. To delete a card: Tap on the card in Google Wallet so that the barcode appears. Tap the menu button in the top right. Scroll down to the bottom to find the \"Remove\" button. Using Google Wallet for your loyalty and gift cards keeps them from fattening up what might otherwise be a slim wallet. This might also be the key to you finally getting to try out a wallet that only holds a couple of cards. If you have a Galaxy phone, you're not limited to Google Wallet. You can opt to use Samsung Wallet instead, since both apps have most of the same features.",
  "image": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066004.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e        \u003cdiv\u003e\n        \u003ch3\u003eQuick Links\u003c/h3\u003e\n        \u003cdiv\u003e\n                                                                                                    \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#google-wallet-isn-39-t-just-for-payments\"\u003eGoogle Wallet Isn\u0026#39;t Just for Payments\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#how-to-use-your-cards-in-store-and-online\"\u003e​How to Use Your Cards In-Store and Online\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n            \n            \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cp\u003eRegardless of whether you use Google Wallet to make payments, it\u0026#39;s worth using the app to consolidate your various membership and gift cards. Doing so is easier than you might think.​\u003c/p\u003e    \u003ch2 id=\"google-wallet-isn-39-t-just-for-payments\"\u003e\n                        Google Wallet Isn\u0026#39;t Just for Payments\n               \u003c/h2\u003e\n\u003cp\u003eJust like a physical wallet, \u003ca href=\"https://www.anrdoezrs.net/links/3607085/type/dlg/sid/UUhtgUeUpU2010632/https://play.google.com/store/apps/details?id=com.google.android.apps.walletnfcrel\" rel=\"noopener noreferrer sponsored nofollow\" target=\"_blank\"\u003eGoogle Wallet\u003c/a\u003e can store various types of cards that you\u0026#39;re compelled to carry around. Debit and credit cards first come to mind, but that\u0026#39;s just the top of the list. You can use Google Wallet as a transit pass to let you board the metro. In some places, \u003ca href=\"https://www.howtogeek.com/google-wallet-new-mexico-id/\" target=\"_blank\"\u003eGoogle Wallet can even store your driver\u0026#39;s license\u003c/a\u003e.\u003c/p\u003e    \n\u003cp\u003eLoyalty cards come in a few forms. Some merely offer discounts, like a Kroger card. Others are required for entry, such as with wholesale retailers like Costco and Sam\u0026#39;s Club. Some establishments that aren\u0026#39;t retailers fall into this category as well, such as gyms and airlines.\u003c/p\u003e    \n\u003cp\u003eGift cards, which carry a balance that can only be used in a specific store, function differently from your regular payment cards. Google Wallet treats them more like loyalty cards and all the other types of non-payment cards you can add.\u003c/p\u003e            \n    \n                    \n                        \n                \n    \n                                        \n    \n        \n    \n        \n                \n        \n    \u003cdiv data-include-community-rating=\"false\" id=\"c023-4a07-b1b4a5ec279f\" data-nosnippet=\"\"\u003e\n        \n        \n                        \t                \n\t\t\u003ca href=\"https://www.howtogeek.com/google-wallet-features-you-should-be-using/\"\u003e\n\t\n\t\u003cdiv data-img-url=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"A hand with the Google Wallet logo and some feature icons around it\" data-img-url=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg\" src=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/a-hand-with-the-google-wallet-logo-and-some-feature-icons-around-it.jpg\"/\u003e\n    \u003c/picture\u003e\n                \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\t\t\u003c/a\u003e\n\t\n\n        \n                    \u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\n                \n        \n        \n        \n            \u003c/div\u003e\n\u003ch2 id=\"how-to-add-loyalty-cards\"\u003e\n                        How to Add Loyalty Cards\n               \u003c/h2\u003e\n\u003cp\u003eTo add loyalty cards to Google Wallet, open the app and then:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Tap the \u0026#34;Add to Wallet\u0026#34; button on the bottom right. This will take you to a screen presenting different types of cards that Google Wallet supports.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select \u0026#34;Loyalty Card.\u0026#34;\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\n\u003cp\u003eGoogle Wallet will then provide you with a list of stores to pick from. You can find many national brands, like CVS, Lowe\u0026#39;s, and Regal Cinemas just by scrolling. This is hardly an exhaustive list, so don\u0026#39;t panic if what you\u0026#39;re looking for doesn\u0026#39;t appear under \u0026#34;Popular Nearby.\u0026#34; Just hit the search bar at the top and type away. Then tap the one you\u0026#39;re looking for when it pops up.\u003c/p\u003e    \n\u003cp\u003eAt this point, Google Wallet will open a camera and let you scan your loyalty card to add it automatically.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\n\u003cp\u003eIf your card doesn\u0026#39;t scan for whatever reason, you can often enter the member ID number manually instead by tapping the \u0026#34;Enter Manually\u0026#34; button in the bottom right.\u003c/p\u003e    \n\n\u003cdiv id=\"custom_block_14\"\u003e\n\n        \n            \u003cp\u003eHow you\u0026#39;re able to add cards varies by retailer. Some will allow you to enter your number manually, while others will only allow you to scan with the camera. Some, like CVS, might prompt you to search for your card by entering your name, phone number, and other information to connect Google Wallet to their online account.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003ch2 id=\"how-to-add-gift-cards\"\u003e\n                        ​How to Add Gift Cards\n               \u003c/h2\u003e\n\u003cp\u003eTo add gift cards to Google Wallet, open the app and follow these instructions:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Tap the \u0026#34;Add to Wallet\u0026#34; button in the bottom-right corner.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select \u0026#34;Gift Cards.\u0026#34; This will pull up a list of popular retailers nearby that offer gift cards. You can tap one or search manually, just like with loyalty cards.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\n\u003cp\u003eOnce you\u0026#39;ve selected a retailer, here the instructions differ. Instead of scanning a card, you must enter information manually.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                    \n    \n\n\u003cp\u003eSome stores, like McDonald\u0026#39;s, only ask you for a card number and the remaining balance. Others, like Kohl\u0026#39;s, will ask you to enter a PIN as well. In either case, you can also enter notes, such as a reminder of who the gift card is from. Hit \u0026#34;Add to Wallet\u0026#34; when you\u0026#39;re done.\u003c/p\u003e    \u003ch2 id=\"how-to-use-your-cards-in-store-and-online\"\u003e\n                        ​How to Use Your Cards In-Store and Online\n               \u003c/h2\u003e\n\u003cp\u003eTo use either a loyalty card or a gift card in-store, open the Google Wallet app. You will see your payment cards at the top, prompting you to hold your phone against the reader. Immediately below, you will see your other cards.\u003c/p\u003e    \n\u003cp\u003eTo use a card:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Tap on a card to bring up its barcode.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Place the on-screen barcode in front of a scanner.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\n\u003cp\u003eIf the barcode does not work, or a scanner is not available, the membership or gift card number is listed below the barcode. The latter is also useful whenever you want to use a gift card online. You can hold down on the number to copy and paste the information into a web browser or another app.\u003c/p\u003e    \n\u003cp\u003eTo view your remaining balance, tap the menu button in the top-right when the barcode is visible.\u003c/p\u003e    \u003ch2 id=\"how-to-remove-a-card\"\u003e\n                        How to Remove a Card\n               \u003c/h2\u003e\n\u003cp\u003eMemberships and gift cards don\u0026#39;t linger around as long as payment cards. Some you will remove after a year when your annual membership is set to expire. Gift cards might not even make it until the end of the day before you deplete them of any value.\u003c/p\u003e    \n\u003cp\u003eTo delete a card:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Tap on the card in Google Wallet so that the barcode appears.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Tap the menu button in the top right.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Scroll down to the bottom to find the \u0026#34;Remove\u0026#34; button.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\u003chr/\u003e\n\u003cp\u003e Using Google Wallet for your loyalty and gift cards keeps them from fattening up what might otherwise be a slim wallet. This might also be the key to you finally getting to try out a wallet that only holds a couple of cards.\u003c/p\u003e    \n\u003cp\u003eIf you have a Galaxy phone, you\u0026#39;re not limited to Google Wallet. You can opt to use Samsung Wallet instead, since \u003ca href=\"https://www.howtogeek.com/google-wallet-vs-samsung-wallet-which-should-you-use/\" target=\"_blank\"\u003eboth apps have most of the same features\u003c/a\u003e.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-03-05T22:15:16Z",
  "modifiedTime": "2025-03-05T22:15:16Z"
}
