{
  "id": "86adf987-76e8-4f44-86ad-331345215ea2",
  "title": "No, Your YouTube Account Isn't Being Demonetized: It's a Scam",
  "link": "https://www.makeuseof.com/what-is-youtube-demotization-scam/",
  "description": "Your YouTube channel is completely fine; just don't sign that form!",
  "author": "Danny Maiorca",
  "published": "Thu, 30 Jan 2025 22:45:59 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Security",
    "YouTube",
    "Scams"
  ],
  "byline": "Danny Maiorca",
  "length": 8837,
  "excerpt": "Your YouTube channel is completely fine; just don't sign that form!",
  "siteName": "MakeUseOf",
  "favicon": "https://www.makeuseof.com/public/build/images/favicon-240x240.df310da5.png",
  "text": "YouTube Sign in to your MUO account Quick Links What Is the YouTube Demonetization Scam? What to Do if You See the YouTube Demonetization Scam Are you worried that all the hard work you've put into your YouTube channel is about to be undone with demonetization? Don't worry; if you see an unlisted, AI deepfake video warning you, it's part of the YouTube demonetization scam​​​​​​. What Is the YouTube Demonetization Scam? The YouTube demonetization scam targets those with a monetized YouTube channel, aiming to scare the victim into handing over the keys to the channel. Scammers send an email with an unlisted YouTube video featuring an AI deepfake of YouTube CEO Neal Mohan, claiming that YouTube is updating its monetization policy. Unless you sign the form in the scam email, your channel will no longer receive income from YouTube, and your account will be demonetized. Concerningly, the email looks legitimate at first glance; it comes from a \"no-reply\" address. However, if you look closely, you'll see \"scoutcamp.bounces\" in the Mailed By section. Examining the \"mailed by\" URL is one way you can easily spot phishing emails. However, the unlisted YouTube video reveals more red flags when examined closely. Although the channel publishing the listed video has over 1,000 subscribers and a YouTube icon for its profile picture, the username—@ch-crtrs-f9n—is fake. What to Do if You See the YouTube Demonetization Scam Although the YouTube demonetization email looks convincing, don't sign the form. If your channel is really about to be demonetized, you can contact YouTube's official support team to verify whether this is the case (and why). Many YouTubers have warned the company's support team, but you should do the same by forwarding the email to them. Since the video is malicious, I also recommend reporting inappropriate content. You don't need to share the email and its content on your social media profile, but doing so might be worthwhile if you have a big enough following.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/07/youtube-on-smartphone-screen.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n        \n        \n        \n\n\n\n\n\n            \u003carticle\u003e\n\n        \n                \n    \n\n\n\n    \n    \n    \n        \n           \u003cheader\u003e\n            \n                                                \n\n\n    \n                           \n            \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n\n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n                    \n\n        \u003ca href=\"https://www.makeuseof.com/tag/youtube/\"\u003e\u003cspan\u003eYouTube\u003c/span\u003e\u003c/a\u003e\n\n\u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://static1.makeuseofimages.com/wordpress%2Fwp-content%2Fauthors%2F6471b559e4a0c-Danny%20Maiorca-2023.jpeg?fit=crop\u0026amp;w=90\u0026amp;h=90\" alt=\"4\" loading=\"lazy\" decoding=\"async\"/\u003e\n                                    \u003c/p\u003e\n                    \u003c/div\u003e\n\n            \n\n\n            \u003ca id=\"login-button-article-sidebar\"\u003e\n            \u003cp\u003eSign in to your \u003cspan\u003eMUO\u003c/span\u003e account\u003c/p\u003e\n            \n        \u003c/a\u003e\n            \n                                \n                                    \n                                                                                                                        \n                                            \n                                                    \n    \n\n\n            \n                \n    \n    \n        \n    \n\n    \n            \u003c/header\u003e\n\n                            \n        \n\n        \n                                        \n                                \n            \n                        \n        \n        \n\n    \n            \n    \n                                                            \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                            \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n                                                    \n                        \n    \n                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n            \n    \n    \n        \n                    \n                        \n                                    \u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e        \u003cdiv\u003e\n        \u003ch3\u003eQuick Links\u003c/h3\u003e\n        \u003cdiv\u003e\n                                                                                                    \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#what-is-the-youtube-demonetization-scam\"\u003eWhat Is the YouTube Demonetization Scam?\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#what-to-do-if-you-see-the-youtube-demonetization-scam\"\u003eWhat to Do if You See the YouTube Demonetization Scam\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n            \n            \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cp\u003eAre you worried that all the hard work you\u0026#39;ve put into your YouTube channel is about to be undone with demonetization? Don\u0026#39;t worry; if you see an unlisted, AI deepfake video warning you, it\u0026#39;s part of the YouTube demonetization scam​​​​​​.\u003c/p\u003e    \u003ch2 id=\"what-is-the-youtube-demonetization-scam\"\u003e\n                        What Is the YouTube Demonetization Scam?\n               \u003c/h2\u003e\n\u003cp\u003eThe YouTube demonetization scam targets those with a monetized YouTube channel, aiming to scare the victim into handing over the keys to the channel. Scammers send an email with an unlisted YouTube video featuring an AI deepfake of YouTube CEO Neal Mohan, claiming that YouTube is updating its monetization policy. Unless you sign the form in the scam email, your channel will no longer receive income from YouTube, and your account will be demonetized.\u003c/p\u003e    \n\u003cp\u003eConcerningly, the email looks legitimate at first glance; it comes from a \u0026#34;no-reply\u0026#34; address. However, if you look closely, you\u0026#39;ll see \u0026#34;scoutcamp.bounces\u0026#34; in the \u003cstrong\u003eMailed By\u003c/strong\u003e section. Examining the \u0026#34;mailed by\u0026#34; URL is one way you can \u003ca href=\"https://www.makeuseof.com/how-spot-phishing-emails/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eeasily spot phishing emails\u003c/a\u003e.\u003c/p\u003e    \n    \n    \n\n\u003cp\u003eHowever, the unlisted YouTube video reveals more red flags when examined closely. Although the channel publishing the listed video has over 1,000 subscribers and a YouTube icon for its profile picture, the username—@ch-crtrs-f9n—is fake.\u003c/p\u003e    \u003ch2 id=\"what-to-do-if-you-see-the-youtube-demonetization-scam\"\u003e\n                        What to Do if You See the YouTube Demonetization Scam\n               \u003c/h2\u003e\n\u003cp\u003eAlthough the YouTube demonetization email looks convincing, don\u0026#39;t sign the form. If your channel is really about to be demonetized, you can contact YouTube\u0026#39;s official support team to verify whether this is the case (and why).\u003c/p\u003e    \n\u003cp\u003eMany YouTubers have warned the company\u0026#39;s support team, but you should do the same by forwarding the email to them. Since the video is malicious, I also recommend \u003ca href=\"https://www.makeuseof.com/youtube-how-to-report-content/\" target=\"_blank\"\u003ereporting inappropriate content\u003c/a\u003e.\u003c/p\u003e    \n    \n    \n\n\u003cp\u003eYou don\u0026#39;t need to share the email and its content on your social media profile, but doing so might be worthwhile if you have a big enough following.\u003c/p\u003e    \u003c/div\u003e\n    \n                \n        \n        \n\n\n        \n\n\n\n\n\n                \n    \u003c/article\u003e\n\n    \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-30T22:45:59Z",
  "modifiedTime": "2025-01-30T22:45:59Z"
}
