{
  "id": "9a0bb92e-08c9-4300-a19d-0bcf601d3523",
  "title": "5 Google TV Settings I Always Change Immediately",
  "link": "https://www.makeuseof.com/google-tv-settings-i-always-change/",
  "description": "Changing your Google TV settings is a simple way to make your viewing experience much better.",
  "author": "Sanuj Bhatia",
  "published": "Wed, 04 Jun 2025 21:19:39 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Entertainment",
    "Google TV",
    "Android TV"
  ],
  "byline": "Sanuj Bhatia",
  "length": 12936,
  "excerpt": "Changing your Google TV settings is a simple way to make your viewing experience much better.",
  "siteName": "MakeUseOf",
  "favicon": "https://static0.makeuseofimages.com/assets/images/favicon-240x240.df310da5.png",
  "text": "While there are plenty of streaming devices, Google TVs are a leap ahead, mainly due to the Android-based OS running behind the scenes. However, the default setup doesn't always deliver the best experience, and there are a few Google TV settings I always change for a better viewing experience. 6 Manage Content Recommendations During the Google TV setup, you're asked to input and enable your subscription services and apps. Using this, in addition to showing you the list of apps and games on your device, Google TVs also show a variety of other content, like TV shows and movies, on the home screen. This offers an easy way to find new content to stream and continue watching from where you left off. However, if you add or forget to enable a service subscription during setup, it's easy to manage. To choose which services Google TV recommends on your home screen, follow these steps: Scroll to the bottom of the home screen. Click Manage services. Turn home screen recommendations on or off for each service. 5 Disable Auto-Playing Video Previews Similarly, in addition to displaying recommendations, Google promotes a significant amount of content on the home screen in the bar above the recommendations. While this is beneficial for some users, as it allows them to view trailers and previews while exploring new content, it can be annoying, especially since these videos start playing automatically by default. You can easily turn off these video previews on Google TV: Open Settings. Select Accounts \u0026 sign-in. Now select the profile for which you want to disable video previews. Scroll down and disable the toggle for video previews. Related You’re Not Using Your Smart TV’s Best Features—Here’s What You’re Missing Your smart TV has so many amazing features you should be making the most of. 4 Turn Off Animations for a Faster Experience Similar to Android smartphones, Google TVs are available in various price ranges. The now-not-sold Chromecast with Google TV started at $40, while the new Google TV Streamer is sold at an expensive $100. Other players also offer Google TV streaming devices, such as Xiaomi and Walmart. These offer different hardware, but often struggle with processing. One way to improve your Google TV experience is by disabling animations. This gives your streaming device more resources to process data rather than spending them on rendering animations. To do this, you'll need to enable Developer Settings first and then disable the animations altogether. Here's how you can get started: Open Settings. Go to System, then About. With the selector on Android TV OS Build Number, click the OK button on your Google TV's remote seven times. Go back to System settings, then select Developer Options. In Developer Options, scroll down and set Window animation scale, Transition animation scale, and Animator duration scale to Animation off. This small tweak can make a big difference to your Google TV device's performance. 3 Enable Apps-Only Mode If you find the default home screen of Google TV too busy, you should try the Apps Only mode. This mode turns off unnecessary recommendations from the home screen and puts your apps at the forefront. It is, however, worth noting that the Apps Only mode disables Google Assistant and Google Home integration, and you will also be unable to download new apps. For that, you'll have to disable Apps Only mode again. To turn on Apps Only mode on your Google TV, follow these steps: Go to Settings. Select Accounts \u0026 sign-in. Select the profile for which you want to disable home screen clutter. In the profile settings, turn on the toggle for Apps only mode. Select Turn on, and now you have a much simpler Google TV home screen. 2 Set Up User Profiles More often than not, you're not the only one using the TV in the house. There might be other family members or friends using the same TV. In such cases, you can set up a profile for each user, allowing everyone to have their own personalized recommendations and watchlists without mixing them up with the main profile. To add more profiles to your Google TV, follow these steps: Open Settings. Select Accounts \u0026 sign-in. Click Add account and sign in with the Google ID of the other members using the QR code. Give them a try, as it can streamline your Google TV experience. 1 Bonus: Use a Custom DNS The Domain Name System (DNS) is like a phonebook for the internet, turning website names into IP addresses. By default, most Google TVs rely on Google's DNS servers, and while they're rarely down, a DNS issue could be why some video streaming apps on your smart TV are buffering. Thankfully, you can easily switch to a custom DNS on your TV for better speeds and improved privacy, like Cloudflare's 1.1.1.1 DNS service. Other benefits include ad-blocking and bypassing content restrictions. To change DNS on your Google TV: Go to Settings and select Network \u0026 Internet. Select the Wi-Fi your device is connected to and go to IP Settings. Select Static. Do not change the IP Address, Gateway, or Network prefix length; keep hitting Next. Now, set a custom DNS on your Google TV. Keep in mind that using some custom DNS servers can cause issues. In this case, simply forget the network and reconnect to return to the default settings.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/06/google-tv-remote-in-hand.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\u003cp\u003eWhile there are plenty of streaming devices, Google TVs are a leap ahead, mainly due to the Android-based OS running behind the scenes. However, the default setup doesn\u0026#39;t always deliver the best experience, and there are a few Google TV settings I always change for a better viewing experience.\u003c/p\u003e    \u003ch2 id=\"manage-content-recommendations\"\u003e\n            \u003cspan\u003e6 \u003c/span\u003e\n        \u003cspan\u003e\n                            Manage Content Recommendations\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003cp\u003eDuring the Google TV setup, you\u0026#39;re asked to input and enable your subscription services and apps. Using this, in addition to showing you the list of apps and games on your device, Google TVs also show a variety of other content, like TV shows and movies, on the home screen. This offers an easy way to find new content to stream and continue watching from where you left off.\u003c/p\u003e    \u003cp\u003eHowever, if you add or forget to enable a service subscription during setup, it\u0026#39;s easy to manage. To choose which services Google TV recommends on your home screen, follow these steps:\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                        \n    \n    \u003col\u003e\n                    \u003cli\u003e\n                                        Scroll to the bottom of the home screen.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Click \u003cstrong\u003eManage services\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Turn home screen recommendations on or off for each service.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\u003ch2 id=\"disable-auto-playing-video-previews\"\u003e\n            \u003cspan\u003e5 \u003c/span\u003e\n        \u003cspan\u003e\n                            Disable Auto-Playing Video Previews\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003cp\u003eSimilarly, in addition to displaying recommendations, Google promotes a significant amount of content on the home screen in the bar above the recommendations. While this is beneficial for some users, as it allows them to view trailers and previews while exploring new content, it can be annoying, especially since these videos start playing automatically by default. You can easily turn off these video previews on Google TV:\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                        \n    \n    \u003col\u003e\n                    \u003cli\u003e\n                                        Open \u003cstrong\u003eSettings\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select \u003cstrong\u003eAccounts \u0026amp; sign-in\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Now select the profile for which you want to disable video previews.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Scroll down and disable the toggle for video previews.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n        \n    \n                    \n                        \n    \n    \n                                        \n    \n        \n    \n        \n                \n        \n    \u003cdiv data-include-community-rating=\"false\" id=\"5970-4fb3-96ed3a0def08\" data-nosnippet=\"\"\u003e\n        \n        \n                        \t                \n\t\t\u003ca href=\"https://www.makeuseof.com/best-smart-tv-features-youre-not-using/\"\u003e\n\t\n\t\u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\n                             \n                    \u003cimg width=\"2100\" height=\"1400\" loading=\"lazy\" decoding=\"async\" alt=\"a smart tv with photography displayed on the screen\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/a-smart-tv-with-photography-displayed-on-the-screen.jpg\"/\u003e\n                \n    \u003c/picture\u003e\n                \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\t\t\u003c/a\u003e\n\t\n\n        \n                    \u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\n\n                \n                 \n                \t\n\u003ch5\u003e\n\t\n\n\t\t\t\t\t        \t\t\t\t\n\t\t\u003ca href=\"https://www.makeuseof.com/best-smart-tv-features-youre-not-using/\" title=\"You’re Not Using Your Smart TV’s Best Features—Here’s What You’re Missing\" target=\"_blank\"\u003e\n\t\t\tYou’re Not Using Your Smart TV’s Best Features—Here’s What You’re Missing\n\t\t\u003c/a\u003e\n\t\u003c/h5\u003e\n\n                                                    \n                \t\t\t\t\t\t\t\t\t\u003cp\u003eYour smart TV has so many amazing features you should be making the most of.\u003c/p\u003e\n\t\t\t\n\n                    \n\n\n                \n                \n                \n                \n\n                \n                \n                \n                \t\n\n\n                \n\n                \n                \n                \n            \u003c/div\u003e\n                \n        \n        \n        \n            \u003c/div\u003e\n\u003ch2 id=\"turn-off-animations-for-a-faster-experience\"\u003e\n            \u003cspan\u003e4 \u003c/span\u003e\n        \u003cspan\u003e\n                            Turn Off Animations for a Faster Experience\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003cp\u003eSimilar to Android smartphones, Google TVs are available in various price ranges. The now-not-sold Chromecast with Google TV started at $40, while the \u003ca href=\"https://www.makeuseof.com/reasons-upgrade-google-tv-streamer/\" target=\"_blank\"\u003enew Google TV Streamer\u003c/a\u003e is sold at an expensive $100. Other players also offer Google TV streaming devices, such as Xiaomi and Walmart. These offer different hardware, but often struggle with processing.\u003c/p\u003e    \u003cp\u003eOne way to improve your Google TV experience is by disabling animations. This gives your streaming device more resources to process data rather than spending them on rendering animations. To do this, you\u0026#39;ll need to enable Developer Settings first and then disable the animations altogether.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                        \n    \n\u003cp\u003eHere\u0026#39;s how you can get started:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Open \u003cstrong\u003eSettings\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Go to \u003cstrong\u003eSystem\u003c/strong\u003e, then \u003cstrong\u003eAbout\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        With the selector on \u003cstrong\u003eAndroid TV OS Build Number\u003c/strong\u003e, click the OK button on your Google TV\u0026#39;s remote seven times.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Go back to \u003cstrong\u003eSystem\u003c/strong\u003e settings, then select \u003cstrong\u003eDeveloper Options\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        In Developer Options, scroll down and set \u003cstrong\u003eWindow animation scale\u003c/strong\u003e, \u003cstrong\u003eTransition animation scale\u003c/strong\u003e, and \u003cstrong\u003eAnimator duration scale\u003c/strong\u003e to \u003cstrong\u003eAnimation off\u003c/strong\u003e.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\u003cp\u003eThis small tweak can make a big difference to your Google TV device\u0026#39;s performance.\u003c/p\u003e    \u003ch2 id=\"enable-apps-only-mode\"\u003e\n            \u003cspan\u003e3 \u003c/span\u003e\n        \u003cspan\u003e\n                            Enable Apps-Only Mode\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003cp\u003eIf you find the default home screen of Google TV too busy, you should try the \u003cstrong\u003eApps Only mode\u003c/strong\u003e. This mode turns off unnecessary recommendations from the home screen and puts your apps at the forefront.\u003c/p\u003e    \u003cp\u003eIt is, however, worth noting that the Apps Only mode disables Google Assistant and Google Home integration, and you will also be unable to download new apps. For that, you\u0026#39;ll have to disable Apps Only mode again.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                \n    \n\u003cp\u003eTo turn on Apps Only mode on your Google TV, follow these steps:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Go to \u003cstrong\u003eSettings\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select \u003cstrong\u003eAccounts \u0026amp; sign-in\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select the profile for which you want to disable home screen clutter.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        In the profile settings, turn on the toggle for \u003cstrong\u003eApps only mode\u003c/strong\u003e.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\u003cp\u003eSelect \u003cstrong\u003eTurn on\u003c/strong\u003e, and now you have a much simpler Google TV home screen.\u003c/p\u003e    \u003ch2 id=\"set-up-user-profiles\"\u003e\n            \u003cspan\u003e2 \u003c/span\u003e\n        \u003cspan\u003e\n                            Set Up User Profiles\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003cp\u003eMore often than not, you\u0026#39;re not the only one using the TV in the house. There might be other family members or friends using the same TV. In such cases, you can set up a profile for each user, allowing everyone to have their own personalized recommendations and watchlists without mixing them up with the main profile.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                        \n    \n\u003cp\u003eTo add more profiles to your Google TV, follow these steps:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Open \u003cstrong\u003eSettings\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select \u003cstrong\u003eAccounts \u0026amp; sign-in\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Click \u003cstrong\u003eAdd account\u003c/strong\u003e and sign in with the Google ID of the other members using the QR code.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\u003cp\u003eGive them a try, as it can streamline your Google TV experience.\u003c/p\u003e    \u003ch2 id=\"bonus-use-a-custom-dns\"\u003e\n            \u003cspan\u003e1 \u003c/span\u003e\n        \u003cspan\u003e\n                            Bonus: Use a Custom DNS\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003cp\u003eThe Domain Name System (DNS) is like a phonebook for the internet, turning website names into IP addresses. By default, most Google TVs rely on Google\u0026#39;s DNS servers, and while they\u0026#39;re rarely down, a DNS issue could be why some video streaming apps on your smart TV are buffering.\u003c/p\u003e    \u003cp\u003eThankfully, you can easily switch to a \u003ca href=\"https://www.makeuseof.com/why-changed-smart-tv-dns-settings-how-to-do-it/\" target=\"_blank\"\u003ecustom DNS on your TV\u003c/a\u003e for better speeds and improved privacy, like \u003ca href=\"https://www.cloudflare.com/learning/dns/what-is-1.1.1.1/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eCloudflare\u0026#39;s 1.1.1.1 DNS\u003c/a\u003e service. Other benefits include ad-blocking and bypassing content restrictions.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n    \n\u003cp\u003eTo change DNS on your Google TV:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Go to \u003cstrong\u003eSettings\u003c/strong\u003e and select \u003cstrong\u003eNetwork \u0026amp; Internet\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select the Wi-Fi your device is connected to and go to \u003cstrong\u003eIP Settings\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Select \u003cstrong\u003eStatic\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Do not change the IP Address, Gateway, or Network prefix length; keep hitting \u003cstrong\u003eNext\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Now, set a custom DNS on your Google TV.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\u003cp\u003eKeep in mind that using some custom DNS servers can cause issues. In this case, simply forget the network and reconnect to return to the default settings.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-06-04T21:19:39Z",
  "modifiedTime": "2025-06-04T21:19:39Z"
}
