{
  "id": "aa7c2c2e-8cec-41e6-b335-09b89023d194",
  "title": "Windows 11's Latest Update Broke Clipboard History: Here's a Fix",
  "link": "https://www.makeuseof.com/windows-11-latest-update-broke-clipboard-history/",
  "description": "Windows 11 24H2 brought in some great new features, but it also broke some on the way in.",
  "author": "Simon Batt",
  "published": "Wed, 16 Oct 2024 23:05:21 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Windows",
    "Windows 11"
  ],
  "byline": "Simon Batt",
  "length": 6862,
  "excerpt": "Windows 11 24H2 brought in some great new features, but it also broke some on the way in.",
  "siteName": "MakeUseOf",
  "favicon": "https://www.makeuseof.com/public/build/images/favicon-240x240.df310da5.png",
  "text": "Windows 11 Sign in to your MUO account If you've upgraded to Windows 11 version 24H2, you may have noticed that a few things aren't working as they should. For instance, if you use Clipboard History to store data for later, there's a small chance that it'll stay blank no matter what you try. Fortunately, while Microsoft works on a fix, there's a way to get around it. Windows 11 24H2 Breaks Some User's Clipboard History As spotted by Windows Latest, the Clipboard History feature may break after you install the Windows 11 24H2 update. Instead of remembering everything you copy, the Clipboard History feature will claim you haven't copied anything yet. No matter how many times you copy something, Windows 11 will refuse to add it to your history. Fortunately, affected users have already reported the bug to Microsoft, so there's a good chance that the company is working on a fix. Fortunately, you don't have to wait for an official fix to get the feature working again. How to Fix a Faulty Clipboard History on Windows 11 24H2 The bug won't affect every Windows 11 PC, so you shouldn't need to perform the fix on every computer you have. Even if you are affected, the fix is thankfully easy to perform. As detailed by Windows Latest, you can fix this issue by opening the Settings panel. Click on System, then Clipboard. Disable Suggested Actions, then open Clipboard History using Windows key + V. You should now see your previously copied items, and you can re-enable Suggested Actions without breaking the clipboard again. If that fails, try turning both the Clipboard History feature and its device sync option on and off again. And if none of those work, don't fret; there are still plenty of ways to fix the Clipboard History feature on Windows 11.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/10/windows-11-logo-on-laptop-muo-featured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n        \n        \n\n            \u003carticle\u003e\n\n        \n                \n    \n\n\n    \n    \n    \n        \n           \u003cheader\u003e\n            \n                                                \n\n\n        \n                           \n            \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n\n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n                    \n\n        \u003ca href=\"https://www.makeuseof.com/tag/windows-11/\"\u003e\u003cspan\u003eWindows 11\u003c/span\u003e\u003c/a\u003e\n\n\u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://static1.makeuseofimages.com/wordpress%2Fwp-content%2Fauthors%2F66952a45d954f-Simon_Batt_2020_2_Portrait_500x500_grey.png?fit=crop\u0026amp;w=90\u0026amp;h=90\" alt=\"4\" loading=\"lazy\" decoding=\"async\"/\u003e\n                                    \u003c/p\u003e\n                    \u003c/div\u003e\n\n            \n\n    \n\n            \u003ca id=\"login-button-article-sidebar\" href=\"https://www.makeuseof.com/register\"\u003e\n            \u003cp\u003eSign in to your \u003cspan\u003eMUO\u003c/span\u003e account\u003c/p\u003e\n            \n        \u003c/a\u003e\n            \n                                \n                                    \n                                                                                                                        \n                                            \n                                                    \n    \n\n\n            \n                \n    \n    \n        \n    \n\n    \n            \u003c/header\u003e\n\n                            \n        \n\n        \n                                        \n                                \n            \n                        \n        \n        \n\n    \n            \n    \n                                                            \n            \n    \n    \n                                                                            \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n                                                    \n                        \n    \n                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n            \n    \n    \n        \n                    \n                        \n                                    \n\n\n\n\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eIf you\u0026#39;ve upgraded to Windows 11 version 24H2, you may have noticed that a few things aren\u0026#39;t working as they should. For instance, if you use Clipboard History to store data for later, there\u0026#39;s a small chance that it\u0026#39;ll stay blank no matter what you try. Fortunately, while Microsoft works on a fix, there\u0026#39;s a way to get around it.\u003c/p\u003e\n\n\n\n\n\n\u003ch2 id=\"windows-11-24h2-breaks-some-user-39-s-clipboard-history\"\u003e Windows 11 24H2 Breaks Some User\u0026#39;s Clipboard History \u003c/h2\u003e\n\u003cp\u003eAs spotted by \u003ca href=\"https://www.windowslatest.com/2024/10/16/windows-11-24h2-clipboard-history-blank-disk-cleanup-reporting-issues/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eWindows Latest\u003c/a\u003e, the Clipboard History feature may break after you install the Windows 11 24H2 update. Instead of remembering everything you copy, the Clipboard History feature will claim you haven\u0026#39;t copied anything yet. No matter how many times you copy something, Windows 11 will refuse to add it to your history.\u003c/p\u003e\n\n\n\u003cp\u003eFortunately, affected users have already reported the bug to Microsoft, so there\u0026#39;s a good chance that the company is working on a fix. Fortunately, you don\u0026#39;t have to wait for an official fix to get the feature working again.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"how-to-fix-a-faulty-clipboard-history-on-windows-11-24h2\"\u003e How to Fix a Faulty Clipboard History on Windows 11 24H2 \u003c/h2\u003e\n\n\n\n\u003cp\u003eThe bug won\u0026#39;t affect every Windows 11 PC, so you shouldn\u0026#39;t need to perform the fix on every computer you have. Even if you are affected, the fix is thankfully easy to perform.\u003c/p\u003e\n\n\u003cp\u003eAs detailed by Windows Latest, you can fix this issue by opening the \u003cstrong\u003eSettings\u003c/strong\u003e panel. Click on \u003cstrong\u003eSystem\u003c/strong\u003e, then \u003cstrong\u003eClipboard\u003c/strong\u003e. Disable \u003cstrong\u003eSuggested Actions\u003c/strong\u003e, then \u003ca href=\"https://www.makeuseof.com/tag/windows-10-clipboard-paste/\" target=\"_blank\"\u003eopen Clipboard History\u003c/a\u003e using \u003cstrong\u003eWindows key + V\u003c/strong\u003e. You should now see your previously copied items, and you can re-enable Suggested Actions without breaking the clipboard again.\u003c/p\u003e\n\n\n\u003cp\u003eIf that fails, try turning both the Clipboard History feature and its device sync option on and off again. And if none of those work, don\u0026#39;t fret; there are still plenty of \u003ca href=\"https://www.makeuseof.com/windows-11-fix-clipboard-history/\" target=\"_blank\"\u003eways to fix the Clipboard History feature on Windows 11\u003c/a\u003e.\u003c/p\u003e\n\n \u003c/div\u003e\n\n\n    \n        \n\n    \n\n        \n\n\n                \n        \n        \n\n\n        \n\n\n\n\n\n                    \n        \n    \u003c/article\u003e\n\n    \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-16T23:05:21Z",
  "modifiedTime": "2024-10-16T23:05:21Z"
}
