{
  "id": "c1c98fc6-261d-4148-a391-51a24a408dd1",
  "title": "A Unique Linear Position Sensor Using Magnetostriction",
  "link": "https://hackaday.com/2025/02/18/a-unique-linear-position-sensor-using-magnetostriction/",
  "description": "To the extent that you’re familiar with magnetostriction, you probably know that it’s what makes big transformers hum, or that it’s what tips you off if you happen to walk …read more",
  "author": "Dan Maloney",
  "published": "Wed, 19 Feb 2025 00:00:49 +0000",
  "source": "https://hackaday.com/blog/feed/",
  "categories": [
    "Misc Hacks",
    "coil",
    "magnet",
    "magnetostriction",
    "magnetostrictive",
    "nickel",
    "torsion",
    "Windenmann"
  ],
  "byline": "",
  "length": 1944,
  "excerpt": "To the extent that you’re familiar with magnetostriction, you probably know that it’s what makes big transformers hum, or that it’s what tips you off if you happen to walk out of …",
  "siteName": "Hackaday",
  "favicon": "https://hackaday.com/wp-content/themes/hackaday-2/img/hackaday-logo_1024x1024.png?v=3",
  "text": "Skip to content To the extent that you’re familiar with magnetostriction, you probably know that it’s what makes big transformers hum, or that it’s what tips you off if you happen to walk out of a store without paying for something. But magnetostriction has other uses, too, such as in this clever linear position sensor. Magnetostriction is just the tendency for magnetic materials to change size or shape slightly while undergoing magnetization, thanks to the tiny magnetic domains shifting within the material while they’re aligning. [Florian B.]’s sensor uses a side effect of magnetostriction known as the Wiedenmann effect, which causes a wire to experience a twisting force if a current pulse is applied to it in a magnetic field. When the current pulse is turned off, a mechanical wave travels along the wire to a coil, creating a signal. The difference in time between sending the pulse and receiving the reflection can be used to calculate the position of the magnet along the wire. To turn that principle into a practical linear sensor, [Florian B.] used nickel wire stretched tightly down the middle of a PVC tube. At one end is a coil of copper magnet wire, while the other end has a damper to prevent reflections. Around the tube is a ring-shaped cursor magnet, which can move up and down the tube. An exciter circuit applies the current pulse to the wire, and an oscilloscope is used to receive the signal from the wire. This project still appears to be in the prototype phase, as evidenced by the Fischertechnik test rig. [Florian] has been working on the exciter circuit most recently, but he’s done quite a bit of work on optimizing the cursor magnet and the coil configuration, as well as designs for the signal amplifier. It’s a pretty neat project, and we’re looking forward to updates. If you need a deeper dive into magnetostriction, [Ben Krasnow] points the way.",
  "image": "https://hackaday.com/wp-content/uploads/2025/02/magnetostrictive_sensor.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"page\"\u003e\n    \n\n    \u003cp\u003e\u003ca href=\"#content\"\u003eSkip to content\u003c/a\u003e\u003c/p\u003e\n\n    \u003cdiv id=\"content\"\u003e\n        \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n            \n\u003carticle itemscope=\"\" itemtype=\"http://schema.org/Article\" id=\"post-759160\"\u003e\n    \n\n    \u003cdiv itemprop=\"articleBody\"\u003e\n        \u003cp\u003eTo the extent that you’re familiar with magnetostriction, you probably know that it’s what makes big transformers hum, or that it’s what tips you off if you happen to walk out of a store without paying for something. But magnetostriction has other uses, too, such as in \u003ca href=\"https://hackaday.io/project/202298-magnetostrictive-position-sensor\" target=\"_blank\"\u003ethis clever linear position sensor\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMagnetostriction is just the tendency for magnetic materials to change size or shape slightly while undergoing magnetization, thanks to the tiny magnetic domains shifting within the material while they’re aligning. [Florian B.]’s sensor uses a side effect of magnetostriction known as the Wiedenmann effect, which causes a wire to experience a twisting force if a current pulse is applied to it in a magnetic field. When the current pulse is turned off, a mechanical wave travels along the wire to a coil, creating a signal. The difference in time between sending the pulse and receiving the reflection can be used to calculate the position of the magnet along the wire.\u003c/p\u003e\n\u003cp\u003eTo turn that principle into a practical linear sensor, [Florian B.] used nickel wire stretched tightly down the middle of a PVC tube. At one end is a coil of copper magnet wire, while the other end has a damper to prevent reflections. Around the tube is a ring-shaped cursor magnet, which can move up and down the tube. An exciter circuit applies the current pulse to the wire, and an oscilloscope is used to receive the signal from the wire.\u003c/p\u003e\n\u003cp\u003eThis project still appears to be in the prototype phase, as evidenced by the Fischertechnik test rig. [Florian] has been working on the exciter circuit most recently, but he’s done quite a bit of work on optimizing the cursor magnet and the coil configuration, as well as designs for the signal amplifier. It’s a pretty neat project, and we’re looking forward to updates.\u003c/p\u003e\n\u003cp\u003eIf you need a deeper dive into magnetostriction, \u003ca href=\"https://hackaday.com/2015/12/03/how-store-anti-theft-alarms-work-magnetostriction/\"\u003e[Ben Krasnow] points the way\u003c/a\u003e.\u003c/p\u003e\n\t            \u003c/div\u003e\n    \u003cul\u003e\n    \t\t\t\t\t\u003cli\u003e\n    \t\t\t\t\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fhackaday.com%2F2025%2F02%2F18%2Fa-unique-linear-position-sensor-using-magnetostriction%2F\" target=\"_blank\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_face.png\"/\u003e \u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\t\t\u003cli\u003e\n                        \u003ca href=\"https://twitter.com/intent/tweet?text=A%20Unique%20Linear%20Position%20Sensor%20Using%20Magnetostriction%20via%20@hackaday\u0026amp;url=https://hackaday.com/2025/02/18/a-unique-linear-position-sensor-using-magnetostriction/\" target=\"_blank\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_twitter.png\"/\u003e\u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\t\t\u003cli\u003e\n    \t\t\t\t\u003ca href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Fhackaday.com%2F2025%2F02%2F18%2Fa-unique-linear-position-sensor-using-magnetostriction%2F\" target=\"_blank\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_in.png\"/\u003e\u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\t\t\u003cli\u003e\n                \u003ca href=\"mailto:?subject=A+Unique+Linear+Position+Sensor+Using+Magnetostriction | Hackaday\u0026amp;body=https%3A%2F%2Fhackaday.com%2F2025%2F02%2F18%2Fa-unique-linear-position-sensor-using-magnetostriction%2F\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_mail1.png\"/\u003e\u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\u003c/ul\u003e\n    \n\u003c/article\u003e\n\n            \t\n\t\n            \n\n            \n\n\n        \n        \n\n        \n        \n\n        \n        \u003c/main\u003e\n    \u003c/div\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-19T00:00:49Z",
  "modifiedTime": "2025-02-18T23:03:00Z"
}
