[
  {
    "title": "O´Neil hoping for Wolves lift-off at Brentford",
    "link": "https://www.soccernews.com/o-neil-hoping-for-wolves-lift-off-at-brentford/376729/",
    "description": "Gary O’Neil believes one victory is all it will take to provide lift-off for Wolves’ season, as the Premier League’s bottom side prepare to visit Brentford on Saturday. Wolves have taken just one point from their first six matches of the season, having last failed to win any of their first seven games of a […] The post O´Neil hoping for Wolves lift-off at Brentford appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 23:55:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  },
  {
    "title": "Prediction: Real Madrid vs Villarreal",
    "link": "https://www.soccernews.com/prediction-real-madrid-vs-villarreal-5/376716/",
    "description": "Verdict: Both teams to score Best Odds: 7/10 Bookmaker: Luckster Turning their attention back to La Liga duties on Saturday night, Real Madrid will welcome Villarreal to the Bernabeu. Real Madrid Starting with the hosts, putting in a toothless performance earlier in the week as they suffered a shock 1-0 loss away at French outfit […] The post Prediction: Real Madrid vs Villarreal appeared first on Soccer News.",
    "author": "Tom Dunstan",
    "published": "Wed, 02 Oct 2024 21:44:42 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "Free Soccer Predictions",
      "La Liga"
    ]
  },
  {
    "title": "´It´s a great night for everyone´ – Genesio revels as Lille shock Madrid",
    "link": "https://www.soccernews.com/it-s-a-great-night-for-everyone-genesio-revels-as-lille-shock-madrid/376724/",
    "description": "Bruno Genesio revelled in “a great night for everyone”, as “incredible” Lille stunned Champions League holders Real Madrid 1-0 at Stade Pierre-Mauroy. Jonathan David’s first-half penalty – after Eduardo Camavinga handled from Edon Zhegrova’s free-kick – ended Madrid’s 14-match unbeaten streak in this competition, while condemning them to a first reverse overall in 36 games. […] The post ´It´s a great night for everyone´ – Genesio revels as Lille shock Madrid appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 23:34:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "Ligue 1"
    ]
  },
  {
    "title": "Motta praises Juve spirit after thrilling fightback at Leipzig",
    "link": "https://www.soccernews.com/motta-praises-juve-spirit-after-thrilling-fightback-at-leipzig/376725/",
    "description": "Thiago Motta hailed Juventus’ team spirit after they shrugged off two injuries and Michele Di Gregorio’s red card to secure a thrilling 3-2 Champions League win over RB Leipzig. Juventus, who are yet to concede a goal in Serie A this season, twice had to fight back from a goal down before securing the win […] The post Motta praises Juve spirit after thrilling fightback at Leipzig appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 23:28:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "Serie A"
    ]
  },
  {
    "title": "Dinamo Zagreb 2-2 Monaco: Zakaria snatches point at drenched Stadion Maksimir",
    "link": "https://www.soccernews.com/dinamo-zagreb-2-2-monaco-zakaria-snatches-point-at-drenched-stadion-maksimir/376726/",
    "description": "Monaco came from two goals down to snatch a 2-2 draw at Dinamo Zagreb in the Champions League at a rain-sodden Stadion Maksimir, with Denis Zakaria equalising with an 89th-minute penalty. Petar Sucic put Dinamo ahead in first-half stoppage time with a delightful chipped finish, later doubling their lead in 66th minute when Martin Baturina […] The post Dinamo Zagreb 2-2 Monaco: Zakaria snatches point at drenched Stadion Maksimir appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 23:15:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  },
  {
    "title": "Sturm Graz 0-1 Club Brugge: Tzolis strike seals visitors´ first win",
    "link": "https://www.soccernews.com/sturm-graz-0-1-club-brugge-tzolis-strike-seals-visitors-first-win/376727/",
    "description": "Christos Tzolis scored the only goal as Club Brugge edged out Sturm Graz 1-0 for their first win in this season’s Champions League. The Greece international delivered the decisive blow in the 23rd minute at 28 Black Arena on Wednesday. Both sides were seeking their first point in the competition, having recorded defeats on matchday […] The post Sturm Graz 0-1 Club Brugge: Tzolis strike seals visitors´ first win appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 22:57:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  },
  {
    "title": "Benfica 4-0 Atletico Madrid: Los Colchoneros routed by high-flying hosts",
    "link": "https://www.soccernews.com/benfica-4-0-atletico-madrid-los-colchoneros-routed-by-high-flying-hosts/376728/",
    "description": "Benfica put on a brilliant display in a 4-0 Champions League demolition of Atletico Madrid on Wednesday, taking them to two wins from as many games in the competition. Bruno Lage’s side ran riot in Lisbon as Kerem Akturkoglu, Angel Di Maria, Alexander Bah and Orkun Kokcu all got on the scoresheet against a shell-shocked […] The post Benfica 4-0 Atletico Madrid: Los Colchoneros routed by high-flying hosts appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 22:53:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  },
  {
    "title": "RB Leipzig 2-3 Juventus: Ten-man Bianconeri claim improbable comeback win",
    "link": "https://www.soccernews.com/rb-leipzig-2-3-juventus-ten-man-bianconeri-claim-improbable-comeback-win/376717/",
    "description": "Ten-man Juventus twice came from behind to stun RB Leipzig 3-2 on Wednesday as Francisco Conceicao’s 82nd-minute strike continued the Serie A giants’ winning start to their Champions League campaign. Juve were reduced to 10 just before the hour mark when goalkeeper Michele Di Gregorio was sent off for a handball outside the box, having […] The post RB Leipzig 2-3 Juventus: Ten-man Bianconeri claim improbable comeback win appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 22:40:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "Serie A"
    ]
  },
  {
    "title": "Lille 1-0 Real Madrid: David penalty stuns Champions League holders",
    "link": "https://www.soccernews.com/lille-1-0-real-madrid-david-penalty-stuns-champions-league-holders/376718/",
    "description": "Jonathan David’s first-half penalty saw Lille stun Champions League holders Real Madrid on Wednesday, handing Los Blancos their first loss in any competition since January. Fifteen-time European champions Madrid had not tasted defeat since going down to Atletico Madrid in the Copa del Rey 36 games ago, while they were also unbeaten in their last […] The post Lille 1-0 Real Madrid: David penalty stuns Champions League holders appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 22:29:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  },
  {
    "title": "Liverpool 2-0 Bologna: Mac Allister and Salah strike as Slot´s side stay perfect",
    "link": "https://www.soccernews.com/liverpool-2-0-bologna-mac-allister-and-salah-strike-as-slot-s-side-stay-perfect/376719/",
    "description": "Liverpool made it two wins from two in this season’s Champions League following a 2-0 victory over Bologna at Anfield. Alexis Mac Allister and Mohamed Salah were on target for Arne Slot’s side, who maintained their perfect start to the league phase, having also beaten AC Milan 3-1 on matchday one. The Reds broke through […] The post Liverpool 2-0 Bologna: Mac Allister and Salah strike as Slot´s side stay perfect appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 02 Oct 2024 22:22:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "English Premier League"
    ]
  }
]