{
  "id": "2eca3f6e-f508-4517-8374-de9fb76af92f",
  "title": "Four Tips to Help You Build High-Quality, Engaging, and Age-Appropriate Apps",
  "link": "http://android-developers.googleblog.com/2024/12/build-high-quality-enagaing-age-appropriate-apps.html",
  "description": "",
  "author": "Android Developers",
  "published": "2024-12-04T12:00:00.000-08:00",
  "source": "http://feeds.feedburner.com/blogspot/hsDu",
  "categories": [
    "Android Development",
    "app development",
    "Developer Tools",
    "Google Play",
    "user safety"
  ],
  "byline": "",
  "length": 5728,
  "excerpt": "Explore the latest updates, resources, and best practices to help developers build high-quality, engaging, and age-appropriate apps.",
  "siteName": "Android Developers Blog",
  "favicon": "",
  "text": "Posted by Mindy Brooks – Senior Director, Android Platform App developers play a vital role in shaping how people of all ages interact with technology. Whether your app content is specifically designed for kids or simply attracts their attention, there is an added responsibility to ensure a safe and trusted experience. Google is here to support you in that work. Today, we’re sharing some important reminders and updates on how we empower developers to build high-quality, engaging, and age-appropriate apps across the Android ecosystem. Help Determine Android User Age with Digital IDs Understanding a user's age range can be critical for providing minors with safer and more appropriate app experiences, as well as complying with local age-related regulations. Android’s new Credential Manager API, now in Beta, addresses this challenge by helping developers verify a user’s age with a digital ID saved to any digital wallet application. Importantly, Android’s Credential Manager was built with both safety and privacy at its core – it minimizes data exposure by only sharing information necessary with developers and asks the user for explicit permission to share an age signal. We encourage you to try out the Beta API for yourself and look forward to hearing your feedback. While digital IDs are still in their early days, we’re continuing to work with governments on further adoption to strengthen this solution. Android is also exploring how the API can support a range of age assurance methods, helping developers to safely confirm the age of their users, especially for users that can't or don't want to use a digital ID. Please keep in mind that ID-based solutions are just one tool that developers can use to determine age and the best approach will depend on your app. Shield Young Users from Inappropriate Content on Google Play As part of our continued commitment to creating a safe and positive environment for children across the Play Store, we recently launched the Restrict Declared Minors (RDM) setting within the Google Play Console that allows developers to designate their app as inappropriate for minors. When enabled, Google Play users with declared ages below 18 will not be able to download or purchase the app nor will they be able to continue subscriptions or make new purchases if the app is already installed. Beyond Play’s broader kids safety policies, this new setting gives developers an additional tool to proactively prevent minors from accessing content that may be unsuitable for them. It also empowers developers to take a more proactive role in ensuring their apps reach the appropriate audience. As a reminder, this feature is simply one tool of many to keep your apps safe and we are continuing to improve it based on early feedback. Developers remain solely responsible for compliance with relevant laws and regulations. You can learn more about opting in to RDM here. Develop Teacher Approved Apps and Games on Google Play Great content for kids can take many forms, whether that’s sparking curiosity, helping kids learn, or just plain fun. Google Play’s Teacher Approved program highlights high-quality apps that are reviewed and rated by teachers and child development specialists. Our team of teachers and experts across the world review and rate apps on factors like age-appropriateness, quality of experience, enrichment, and delight. For added transparency, we include information in the app listing about why the app was rated highly to help parents determine if the app is right for their child. Apps in the program also must meet strict privacy and security requirements. Building a teacher-approved app not only helps raise app quality for kids – it can also increase your reach and engagement. All apps in this program are eligible to appear and be featured on Google Play's Kids tab where families go to easily discover quality apps and games. Please visit Google Play Academy for more information about how to design high-quality apps for kids. Stay Updated With Google Play’s Families Policies Google Play policies provide additional protections for children and families. Our Families policies require that apps and games targeted to children have appropriate content, show ads suitable for children, and meet other requirements including ones related to personally identifiable information. We frequently update and strengthen these policies to ensure that Google Play remains a place where families can find safe and high-quality content for their children. This includes our new Child Safety Standards Policy for social and dating apps that goes into effect in January. Developers can showcase compliance with Play’s Families policies with a special badge on the Google Play Data safety section. This is another great way that you can better help families find apps that meet their needs, while supporting Play’s commitment to provide users more transparency and control over their data. To display the badge, please visit the \"Security practices\" section of your Data Safety form in your Google Play Developer Console. Additional Resources Protecting kids online is a responsibility we all share and we hope these reminders are helpful as you prepare for 2025. We’re grateful for your partnership in making Android and Google Play fantastic platforms for delightful, high-quality content for kids and families. For more resources: Learn more about Android’s Credential Manager API. Watch our interactive Play Academy courses on complying with Play’s Families policies, including SDK requirements, selecting your target age and content settings, and more. Review the updated Child Safety Standards Policy ahead of the January deadline.",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhpZZECD6v6Oe6NOAfHECBkglPgmtKCfpHhyOlh_xk42sZonI-XVbEjlMtil3oPmxKicWpfdbqsQKSpktd4VQfJWcA2yqn_dDRsX0uTNR7RBVPsgHHfAFoB3ZK0REkt4SFyBtwq4VYOgyYxeLZ4j7V3LARW6AbsnXExgVFHrQCDAhDzpwqdtfa6OduK/w1200-h630-p-k-no-nu/Android-KidsandFamilies_1024x512.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cmeta content=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhpZZECD6v6Oe6NOAfHECBkglPgmtKCfpHhyOlh_xk42sZonI-XVbEjlMtil3oPmxKicWpfdbqsQKSpktd4VQfJWcA2yqn_dDRsX0uTNR7RBVPsgHHfAFoB3ZK0REkt4SFyBtwq4VYOgyYxeLZ4j7V3LARW6AbsnXExgVFHrQCDAhDzpwqdtfa6OduK/s1600/Android-KidsandFamilies_1024x512.png\" name=\"twitter:image\"/\u003e\n\u003cp\u003e\n\n\u003cem\u003ePosted by Mindy Brooks – Senior Director, Android Platform\u003c/em\u003e\n  \n\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0dFfNFKUlc_64L7o7AHhmbCICWev_05aki86EKm9vF5WpdszfwxVX7ICsU8ytWhBX9z_3lmp1p_UtPsPqMqXJ-HRLhWe5Sz8bRGmXY7Rw9BJn0utansHa6ShItCCGmC3LKXix1lMwsXVaFN98AuyABRT6fMvjBlzpqiowufcH4sLkHkjyWgBcsNC3/s1600/Android-KidsandFamilies_4209x1253.png\"\u003e\u003cimg data-original-height=\"800\" data-original-width=\"1058\" height=\"199\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0dFfNFKUlc_64L7o7AHhmbCICWev_05aki86EKm9vF5WpdszfwxVX7ICsU8ytWhBX9z_3lmp1p_UtPsPqMqXJ-HRLhWe5Sz8bRGmXY7Rw9BJn0utansHa6ShItCCGmC3LKXix1lMwsXVaFN98AuyABRT6fMvjBlzpqiowufcH4sLkHkjyWgBcsNC3/s1600/Android-KidsandFamilies_4209x1253.png\" width=\"670\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApp developers play a vital role in shaping how people of all ages interact with technology. Whether your app content is specifically designed for kids or simply attracts their attention, there is an added responsibility to ensure a safe and trusted experience. Google is here to support you in that work. Today, we’re sharing some important reminders and updates on how we empower developers to build high-quality, engaging, and age-appropriate apps across the Android ecosystem.\u003c/p\u003e\n\n\u003ch3\u003eHelp Determine Android User Age with Digital IDs\u003c/h3\u003e\n\n\u003cp\u003eUnderstanding a user\u0026#39;s age range can be critical for providing minors with safer and more appropriate app experiences, as well as complying with local age-related regulations. Android’s new Credential Manager API, \u003ca href=\"https://developer.android.com/reference/kotlin/androidx/credentials/DigitalCredential\" target=\"_blank\"\u003enow in Beta\u003c/a\u003e, addresses this challenge by helping developers verify a user’s age with a digital ID saved to any digital wallet application. Importantly, Android’s Credential Manager was built with both safety and privacy at its core – it minimizes data exposure by only sharing information necessary with developers and asks the user for explicit permission to share an age signal. We encourage you to \u003ca href=\"https://developer.android.com/identity/verify\" target=\"_blank\"\u003etry out\u003c/a\u003e the Beta API for yourself and look forward to hearing your feedback.\u003c/p\u003e\n\n\u003cp\u003eWhile digital IDs are still in their early days, we’re continuing to work with governments on further adoption to strengthen this solution. Android is also exploring how the API can support a range of age assurance methods, helping developers to safely confirm the age of their users, especially for users that can\u0026#39;t or don\u0026#39;t want to use a digital ID. Please keep in mind that ID-based solutions are just one tool that developers can use to determine age and the best approach will depend on your app.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"A diagram showing the flow of information between a user, their Android device, and a developer\u0026#39;s app when using the Credential Manager API. The diagram shows how a digital ID from a user\u0026#39;s digital wallet is used to provide app information to the developer\u0026#39;s app.\" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdSQMp7m7bwu9QFLg8pEAWApSFZ-wGI8ZKAxANEyUl7PhvuqrC13L1sVUsDF-1RxxrIc2XiAenc5Fx86PEbuW0_dSMf20M0bUH7c1-9o9mwON1zO66qd7a5Y4PwqB9wcT7ZUMBF_BnPDoRpvCf6fhfOkAeMcKDojqN-p36uEYh8zuGXiA3hWRZjaTMguc/s1600/credential_mngr_apigraphic.png\" width=\"100%\"/\u003e\u003c/p\u003e\u003cbr/\u003e\n\n\n\u003ch3\u003eShield Young Users from Inappropriate Content on Google Play\u003c/h3\u003e\n\n\u003cp\u003eAs part of our continued commitment to creating a safe and positive environment for children across the Play Store, we recently launched the Restrict Declared Minors (RDM) setting within the Google Play Console that allows developers to designate their app as inappropriate for minors. When enabled, Google Play users with declared ages below 18 will not be able to download or purchase the app nor will they be able to continue subscriptions or make new purchases if the app is already installed.\u003c/p\u003e\n\n\u003cp\u003eBeyond Play’s broader kids safety policies, this new setting gives developers an additional tool to proactively prevent minors from accessing content that may be unsuitable for them. It also empowers developers to take a more proactive role in ensuring their apps reach the appropriate audience. As a reminder, this feature is simply one tool of many to keep your apps safe and we are continuing to improve it based on early feedback. Developers remain solely responsible for compliance with relevant laws and regulations. You can learn more about opting in to RDM \u003ca href=\"https://support.google.com/googleplay/android-developer/answer/9867159#zippy=%2Cages-and-over\" target=\"_blank\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\u003ch3\u003eDevelop Teacher Approved Apps and Games on Google Play\u003c/h3\u003e\n\n\u003cp\u003eGreat content for kids can take many forms, whether that’s sparking curiosity, helping kids learn, or just plain fun. Google Play’s \u003ca href=\"https://play.google.com/console/about/programs/teacherapproved/\" target=\"_blank\"\u003eTeacher Approved\u003c/a\u003e program highlights high-quality apps that are reviewed and rated by teachers and child development specialists. Our team of teachers and experts across the world review and rate apps on factors like age-appropriateness, quality of experience, enrichment, and delight. For added transparency, we include information in the app listing about why the app was rated highly to help parents determine if the app is right for their child. Apps in the program also must meet \u003ca href=\"https://play.google.com/console/about/programs/families/\" target=\"_blank\"\u003estrict privacy and security requirements\u003c/a\u003e.\u003c/p\u003e\n\n\n\u003cp\u003eBuilding a teacher-approved app not only helps raise app quality for kids – it can also increase your reach and engagement. All apps in this program are eligible to appear and be featured on \u003ca href=\"https://play.google.com/store/apps/category/FAMILY?hl=en_US\u0026amp;gl=US\" target=\"_blank\"\u003eGoogle Play\u0026#39;s Kids\u003c/a\u003e tab where families go to easily discover quality apps and games. Please visit \u003ca href=\"https://playacademy.exceedlms.com/student/path/22151?sid=ef8b4aa9-5ba9-4c6a-a81e-49e0778090b0\u0026amp;sid_i=4\" target=\"_blank\"\u003eGoogle Play Academy\u003c/a\u003e for more information about how to design high-quality apps for kids.\u003c/p\u003e\n\n\u003ciframe allowfullscreen=\"\" height=\"398\" src=\"https://www.youtube.com/embed/-FUmVUPThX8\" width=\"100%\" youtube-src-id=\"-FUmVUPThX8\"\u003e\u003c/iframe\u003e\u003cbr/\u003e\n\n\u003ch3\u003eStay Updated With Google Play’s Families Policies\u003c/h3\u003e\n  \n\u003cp\u003eGoogle Play policies provide additional protections for children and families. Our \u003ca href=\"https://support.google.com/googleplay/android-developer/answer/9893335?hl=en\u0026amp;ref_topic=9877766\" target=\"_blank\"\u003eFamilies policies\u003c/a\u003e require that apps and games targeted to children have appropriate content, show ads suitable for children, and meet other requirements including ones related to personally identifiable information. We frequently update and strengthen these policies to ensure that Google Play remains a place where families can find safe and high-quality content for their children. This includes our \u003ca href=\"https://support.google.com/googleplay/android-developer/answer/14585136?sjid=8930141697655092967-NC\" target=\"_blank\"\u003enew Child Safety Standards Policy\u003c/a\u003e for social and dating apps that goes into effect in January.\u003c/p\u003e\n\n\u003cp\u003eDevelopers can showcase compliance with Play’s \u003ca href=\"https://support.google.com/googleplay/android-developer/answer/9893335?hl=en\u0026amp;ref_topic=9877766\" target=\"_blank\"\u003eFamilies policies\u003c/a\u003e with a special badge on the Google Play Data safety section. This is another great way that you can better help families find apps that meet their needs, while supporting Play’s commitment to provide users more transparency and control over their data. To display the badge, please visit the \u0026#34;Security practices\u0026#34; section of your Data Safety form in your Google Play Developer Console.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg alt=\"A mobile phone screen displays an app\u0026#39;s data safety information, including data encryption, deletion options, and adherence to Play Families Policy. The \u0026#39;Data safety\u0026#39; section is expanded within the app\u0026#39;s details page.\" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEinnrasC9YHU5XIlOPAPbcNMuWYLSit5h5yjvbtEIhOczFc-TI5uc3SE_Np04QDms-dxo3lubjDTLBJxLrKLN21oxHCGLl-ZGHGYwXHPCU4WZ09s6kBTmfmginK-HDWMwxofG6hH8eemwImyHLLMbHSxS5wqft_AOIyg7OP9vjj3XYD1A-yVwz06lQPOO4/s1600/image1.png\" width=\"40%\"/\u003e\u003c/p\u003e\u003cbr/\u003e\n\n\u003ch4\u003e\u003cspan\u003eAdditional Resources\u003c/span\u003e\u003c/h4\u003e\n\n\u003cp\u003eProtecting kids online is a responsibility we all share and we hope these reminders are helpful as you prepare for 2025. We’re grateful for your partnership in making Android and Google Play fantastic platforms for delightful, high-quality content for kids and families. For more resources: \u003c/p\u003e\n\u003cul\u003e\u003cul\u003e\n\u003cli\u003eLearn more about \u003ca href=\"https://developer.android.com/identity/verify\" target=\"_blank\"\u003eAndroid’s Credential Manager API\u003c/a\u003e.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\n\u003cli\u003eWatch our interactive \u003ca href=\"https://playacademy.exceedlms.com/student/path/19753\" target=\"_blank\"\u003ePlay Academy courses\u003c/a\u003e on complying with Play’s Families policies, including SDK requirements, selecting your target age and content settings, and more.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\n\u003cli\u003eReview the updated \u003ca href=\"https://support.google.com/googleplay/android-developer/answer/14585136?sjid=8930141697655092967-NC\" target=\"_blank\"\u003eChild Safety Standards Policy\u003c/a\u003e ahead of the January deadline.\u003c/li\u003e\n  \n\u003c/ul\u003e\u003c/ul\u003e \n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
