{
  "id": "8f39ce0d-a89d-4830-9dea-18417c276464",
  "title": "#WeArePlay | Tentang Anak connects parents to experts across Indonesia",
  "link": "http://android-developers.googleblog.com/2024/12/weareplay-tentang-anak-connects-parents-to-experts-indonesia.html",
  "description": "",
  "author": "Android Developers",
  "published": "2024-12-04T06:00:00.000-08:00",
  "source": "http://feeds.feedburner.com/blogspot/hsDu",
  "categories": [
    "#WeArePlay",
    "android developers",
    "app development",
    "developer stories",
    "Featured",
    "Game Development",
    "Google Play",
    "google play developers",
    "success stories"
  ],
  "byline": "",
  "length": 3144,
  "excerpt": "Tentang Anak is an app created by Mesty and Garri to address the lack of educational resources, providing reliable info for parents in Indonesia.",
  "siteName": "Android Developers Blog",
  "favicon": "",
  "text": "Posted by Robbie McLachlan, Developer Marketing In our latest film for #WeArePlay, which celebrates the people behind apps and games, we meet Mesty and Garri - the husband and wife duo who created Tentang Anak. Their app helps parents across Indonesia navigate their parenting journey with confidence: with a focus on child health, growth tracking, and providing accessible expert consultations. What inspired you to create Tentang Anak? Mesty: I saw so much misinformation about child health and parenting, especially in Indonesia where there’s a huge gap between the number of pediatricians and children. I wanted to provide parents with reliable, accessible information that could help them raise healthy, well-rounded children, allowing them to feel confident and calm in their parenting journey. Garri: For me, it was about seeing the need for a one-stop solution for parents. Everything was scattered—pregnancy, growth tracking, expert advice—and I realized we could create something that brings it all together in one place. I wanted to build a platform that supported parents, especially in remote areas, with everything they need to raise their kids with confidence. How does Tentang Anak ensure that the expert advice is both accurate and accessible to parents in remote areas of Indonesia? Mesty: We make sure to partner with a team of highly qualified pediatricians, psychologists, and child development experts to ensure our advice is accurate and up-to-date. Garri: Exactly, staying current with the latest research and best practices is crucial. Misinformation can have a huge impact, especially when it comes to child health. Parents often turn to social media or unverified sources for answers, which can lead to confusion or even harm. By partnering with qualified experts and constantly updating our content, we make sure that parents get accurate, reliable, and timely advice. This is especially important in remote areas where access to healthcare professionals can be limited. How has Google Play supported Tentang Anak? Garri: Google Play has provided us with the tools and support to optimize our app's performance and engagement. From using Google’s analytics and A/B testing to improve the user experience, to the seamless distribution through the Play Store, Google has been a key partner in scaling Tentang Anak and making sure parents across Indonesia can access the app. What is next for Tentang Anak? Mesty: We’re focused on expanding our reach across Indonesia, ensuring that more parents, especially in remote areas, have access to the support and resources they need. We’re also enhancing our app with more interactive features to keep parents engaged and informed. Garri: At the same time, we’re expanding our offerings with products for children, including children's books, vitamins, and skincare. Our goal is to make Tentang Anak the go-to platform and brand for all things parenting in Indonesia, and we’re excited to see how we can grow and help even more families. Discover more global #WeArePlay stories and share your favorites. How useful did you find this blog post? ★ ★ ★ ★ ★",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0Gl7Aura9SiUpfcIyLSP6W8YBGb76MMr3YxDcZD2Dc6WlvPJZ17dBIhZazB_-tsaiPVPFWRDRb8FS8b9XOBTlkpMNHGCCVBP2rkmub3mjHCVdAf-cuavtGO6Z8wxQaUF82vg92PexgU9t70JBnzy84lmffADvKzqgYxwUsOtDHKVIBF6CimT3bYxmOD8/w1200-h630-p-k-no-nu/WeArePlay-Tentang-Anak.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cmeta content=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0Gl7Aura9SiUpfcIyLSP6W8YBGb76MMr3YxDcZD2Dc6WlvPJZ17dBIhZazB_-tsaiPVPFWRDRb8FS8b9XOBTlkpMNHGCCVBP2rkmub3mjHCVdAf-cuavtGO6Z8wxQaUF82vg92PexgU9t70JBnzy84lmffADvKzqgYxwUsOtDHKVIBF6CimT3bYxmOD8/s1600/WeArePlay-Tentang-Anak.jpg\" name=\"twitter:image\"/\u003e\n\u003cp\u003e\n\n\u003cem\u003ePosted by Robbie McLachlan, Developer Marketing\u003c/em\u003e\u003c/p\u003e\n\n\n\u003cp\u003eIn our latest film for \u003ca href=\"https://play.google.com/console/about/weareplay/\" target=\"_blank\"\u003e#WeArePlay\u003c/a\u003e, which celebrates the people behind apps and games, we meet Mesty and Garri - the husband and wife duo who created \u003ca href=\"https://play.google.com/store/apps/dev?id=7254559593325176277\u0026amp;hl=en\u0026amp;gl=id\" target=\"_blank\"\u003eTentang Anak\u003c/a\u003e. Their app helps parents across Indonesia navigate their parenting journey with confidence: with a focus on child health, growth tracking, and providing accessible expert consultations.\u003c/p\u003e\n\n\u003ciframe allowfullscreen=\"\" height=\"413\" src=\"https://www.youtube.com/embed/NDdzo7Uichc\" width=\"100%\" youtube-src-id=\"NDdzo7Uichc\"\u003e\u003c/iframe\u003e\u003cbr/\u003e\n\n\u003ch4\u003e\u003cb\u003e\u003cspan\u003eWhat inspired you to create Tentang Anak?\u003c/span\u003e\u003c/b\u003e\u003c/h4\u003e\n\n\u003cp\u003e\u003cb\u003eMesty:\u003c/b\u003e I saw so much misinformation about child health and parenting, especially in Indonesia where there’s a huge gap between the number of pediatricians and children. I wanted to provide parents with reliable, accessible information that could help them raise healthy, well-rounded children, allowing them to feel confident and calm in their parenting journey.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eGarri:\u003c/b\u003e For me, it was about seeing the need for a one-stop solution for parents. Everything was scattered—pregnancy, growth tracking, expert advice—and I realized we could create something that brings it all together in one place. I wanted to build a platform that supported parents, especially in remote areas, with everything they need to raise their kids with confidence.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"A child has their height measured against a wall-mounted height chart. Mesty holds the measuring bar, while a hand holding a smartphone appears to be taking a picture.\" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgO4of55LYFztOF71EJNN2hAt7wmqkSX9p9rYl0CRj0RcPDHXcbDwegIGc3niTZLNAlB_LuShb2A0jQ9vhfq-jPMSGrTUeKk-xQYiAy7Z1w_lNeTn6HK9JzGbYb7YIvbW3NWLYwJO_BsfqCynUlLWstNxZpWjBTWLaTVztpZCOiKwEXaSC0xAhFziltNaE/s1600/08_TENTANG_ANAK_Mesty\u0026amp;kid.jpg\" width=\"100%\"/\u003e\u003c/p\u003e\u003cbr/\u003e\n\n\u003ch4\u003e\u003cb\u003e\u003cspan\u003eHow does Tentang Anak ensure that the expert advice is both accurate and accessible to parents in remote areas of Indonesia?\u003c/span\u003e\u003c/b\u003e\u003c/h4\u003e\n\n\u003cp\u003e\u003cb\u003eMesty:\u003c/b\u003e We make sure to partner with a team of highly qualified pediatricians, psychologists, and child development experts to ensure our advice is accurate and up-to-date.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eGarri:\u003c/b\u003e Exactly, staying current with the latest research and best practices is crucial. Misinformation can have a huge impact, especially when it comes to child health. Parents often turn to social media or unverified sources for answers, which can lead to confusion or even harm. By partnering with qualified experts and constantly updating our content, we make sure that parents get accurate, reliable, and timely advice. This is especially important in remote areas where access to healthcare professionals can be limited.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\" A hand holds a smartphone displaying a webpage with various colorful sections and icons.\" id=\"imgCaption\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0QZfZNhrbmpKtqNQJj_SqeoAGLFZBQWKOkB0qkwfWE0sB6w0-nEiqGCnab4gT4ldm6PkFYf34YiVCEgQTd_rZtlAbLbAXW93yk5u2zByuX_0YCwjNkq-kSoHMiXmaipgmyTAo-zkdTsqo3uOumKQsxrLVvR1gpsDdbJ83AO_nFEiR6OBZ2lfeVwNxJR4/s1600/07_TENTANG_ANAK_app2.jpg\" width=\"100%\"/\u003e\u003c/p\u003e\u003cbr/\u003e\n\n\u003ch4\u003e\u003cb\u003e\u003cspan\u003eHow has Google Play supported Tentang Anak?\u003c/span\u003e\u003c/b\u003e\u003c/h4\u003e\n\n\u003cp\u003e\u003cb\u003eGarri:\u003c/b\u003e Google Play has provided us with the tools and support to optimize our app\u0026#39;s performance and engagement. From using Google’s analytics and A/B testing to improve the user experience, to the seamless distribution through the Play Store, Google has been a key partner in scaling Tentang Anak and making sure parents across Indonesia can access the app.\u003c/p\u003e\n\n\u003ch4\u003e\u003cb\u003e\u003cspan\u003eWhat is next for Tentang Anak?\u003c/span\u003e\u003c/b\u003e\u003c/h4\u003e\n\n\u003cp\u003e\u003cb\u003eMesty:\u003c/b\u003e We’re focused on expanding our reach across Indonesia, ensuring that more parents, especially in remote areas, have access to the support and resources they need. We’re also enhancing our app with more interactive features to keep parents engaged and informed.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eGarri:\u003c/b\u003e At the same time, we’re expanding our offerings with products for children, including children\u0026#39;s books, vitamins, and skincare. Our goal is to make Tentang Anak the go-to platform and brand for all things parenting in Indonesia, and we’re excited to see how we can grow and help even more families.\u003c/p\u003e\n\n\u003cp\u003eDiscover more \u003ca href=\"https://play.google.com/console/about/weareplay/\" target=\"_blank\"\u003eglobal #WeArePlay stories\u003c/a\u003e and share your favorites.\u003c/p\u003e\n\n\u003ccenter\u003e How useful did you find this blog post?\u003c/center\u003e\n\u003cbr/\u003e\u003ccenter\u003e\n\u003ca href=\"https://docs.google.com/forms/d/e/1FAIpQLScLTlzFd_aV-3rAdBqO1QxwCsuAcDCIM6fJFXyNcyf7zElVXg/viewform?usp=pp_url\u0026amp;entry.753333049=1%E2%98%85+%E2%80%93+Not+at+all\u0026amp;entry.2056663615\u0026amp;entry.646747778=changeme-mm/yy\" target=\"_blank\"\u003e★\u003c/a\u003e \u003ca href=\"https://docs.google.com/forms/d/e/1FAIpQLScLTlzFd_aV-3rAdBqO1QxwCsuAcDCIM6fJFXyNcyf7zElVXg/viewform?usp=pp_url\u0026amp;entry.753333049=2%E2%98%85+%E2%80%93+Not+very\u0026amp;entry.2056663615\u0026amp;entry.646747778=changeme-mm/yy\" target=\"_blank\"\u003e★\u003c/a\u003e \u003ca href=\"https://docs.google.com/forms/d/e/1FAIpQLScLTlzFd_aV-3rAdBqO1QxwCsuAcDCIM6fJFXyNcyf7zElVXg/viewform?usp=pp_url\u0026amp;entry.753333049=3%E2%98%85+%E2%80%93+Somewhat\u0026amp;entry.2056663615\u0026amp;entry.646747778=changeme-mm/yy\" target=\"_blank\"\u003e★\u003c/a\u003e \u003ca href=\"https://docs.google.com/forms/d/e/1FAIpQLScLTlzFd_aV-3rAdBqO1QxwCsuAcDCIM6fJFXyNcyf7zElVXg/viewform?usp=pp_url\u0026amp;entry.753333049=4%E2%98%85+%E2%80%93+Very\u0026amp;entry.2056663615\u0026amp;entry.646747778=changeme-mm/yy\" target=\"_blank\"\u003e★\u003c/a\u003e \u003ca href=\"https://docs.google.com/forms/d/e/1FAIpQLScLTlzFd_aV-3rAdBqO1QxwCsuAcDCIM6fJFXyNcyf7zElVXg/viewform?usp=pp_url\u0026amp;entry.753333049=5%E2%98%85+%E2%80%93+Extremely\u0026amp;entry.2056663615\u0026amp;entry.646747778=changeme-mm/yy\" target=\"_blank\"\u003e★\u003c/a\u003e\n  \u003c/center\u003e\n\n\u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjxnvf5XzyebGljqgi8J7by9XsvaL5WWLNamSyTg4w_c0kPHjY1B1no1FQsdSfUHUwNw0UuYfXuo6i7K6VpdyV2-K8ms4VFmZA438ujm6qwtZMt5rJfMGymhQ_iCX2Z8h0MuJo7gXUQ4Hb-hjKYK1isibMZZxCyX_vo3kGoP5tieK2PI2ZhYdGh4gsqhwA/s260/lockup_ic_Google_Play_H_260x53px_clr.png\"\u003e\u003cimg alt=\"\" data-original-height=\"53\" data-original-width=\"260\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjxnvf5XzyebGljqgi8J7by9XsvaL5WWLNamSyTg4w_c0kPHjY1B1no1FQsdSfUHUwNw0UuYfXuo6i7K6VpdyV2-K8ms4VFmZA438ujm6qwtZMt5rJfMGymhQ_iCX2Z8h0MuJo7gXUQ4Hb-hjKYK1isibMZZxCyX_vo3kGoP5tieK2PI2ZhYdGh4gsqhwA/s200/lockup_ic_Google_Play_H_260x53px_clr.png\" width=\"200\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
