{
  "id": "c54af701-8879-4005-bd37-49a9cec295b1",
  "title": "Android Weekly Issue #681",
  "link": "https://androidweekly.net/issues/issue-681/rss.xml",
  "description": "Articles \u0026 Tutorials Sponsored 🚀 Faster Android app releases with automated QA Manual testing on Android is slow, fragmented, and unreliable—and without broad device coverage, critical bugs slip through. QA Wolf delivers 80% automated coverage in weeks, running tests on high-fidelity Android emulators with full gesture, sensor, and visual support. Tests run in 100% parallel with zero flakes—so you can release faster, with confidence. Schedule a demo. Boost Android Development with the Gemini CLI in 5 Minutes Mickco Lai presents a 5-minute guide to set up Gemini CLI for Android, covering installation, model control, and workspace-aware prompts via GEMINI.md. Live Notifications and Now Bar in Samsung One UI 7 Explore Samsung's One UI 7 Live Notifications and Now Bar, explaining how ongoing notifications gain enhanced visibility and control. Passkeys \u0026 Credential Manager in Android Anand Gaur shows how Credential Manager centralizes passkeys, passwords, and federated sign‑ins into a secure biometric-based login flow with synced credentials across Android devices. Kotlin Value Class: Type Safety Without Runtime Overhead Shakarim Bazhenov explains Kotlin’s value class offers type-safe wrappers over primitives with zero runtime overhead via inlining, detailing boxing cases and JvmInline usage. Top 3 Updates for Android Developer Productivity @ Google I/O ‘25 A recap of the top 3 updates for Android Developer Productivity from Google I/O ‘25. Initial exploration of using Koog for developing Kotlin based AI agents John O'Reilly explores Koog, a Kotlin-based AI agent framework, to generate Compose UI in Android Studio using LLMs and MCP server integrations. Real-Time Android Preference Editing Guide Charles Muchene shows you how to eliminate the rebuild-test cycle when working with Android preferences. Pref Editor lets you modify values instantly. Reducing App Size: Proguard, R8, App Bundles \u0026 Resource Shrinking Ignacio Carrión details using Proguard/R8, resource optimization, App Bundles, and monitoring for continuous Android app size reduction. Place a sponsored post Advertise to more than 80k Android developers! We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product! Libraries \u0026 Code Store A Kotlin Multiplatform solution for working with data. Whether you’re building alone or with a team of thousands, Store can help vanilla-kotlin A modern, production-ready microservices development style in Kotlin built with best practices, enterprise-grade patterns, and libraries. News Agentic AI takes Gemini in Android Studio to the next level Google introduces Agent Mode, enabling Gemini in Android Studio to handle complex tasks from natural-language prompts. Announcing the Swift on Android Workgroup Announcing the Swift on Android Working Group, with the goal of establishing and maintaining Android as an officially supported platform for Swift. Kotlin 2.2.0 Released The Kotlin 2.2.0 release is out! This version includes both new and stable language features, tooling updates, performance improvements for different platforms, and important fixes. Videos \u0026 Podcasts Test APIs Without Leaving Android Studio! For Free! Learn how to test APIs without leaving Android Studio! For Free! ✅ The Full Android 16 Migration Checklist - Your Todos For API Level 36 Philipp Lackner shares every major change about Android 16 with you so afterwards you'll clearly know what you have to adjust in your code. Clipping To Custom Shapes \u0026 Auto Text Size Jov Mit's live stream recording, getting into creating custom shapes, clipping to custom shapes and auto sizing text in Compose. (69) The Full Jetpack Compose Responsive UI Crash Course Philipp Lackner teaches about all kinds of different ways to make your Compose Multiplatform UI dynamic and responsive while minimizing duplicate code. Specials AI won't replace good engineers - it'll make them invaluable Kaushik Gopal argues that AI enhances strong engineers but cannot replace human intuition and engineering judgment.",
  "author": "",
  "published": "Sun, 29 Jun 2025 11:37:28 +0000",
  "source": "https://androidweekly.net/rss.xml",
  "categories": null,
  "byline": "",
  "length": 1248,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "Manual testing on Android is slow, fragmented, and unreliable—and without broad device coverage, critical bugs slip through. QA Wolf delivers 80% automated coverage in weeks, running tests on high-fidelity Android emulators with full gesture, sensor, and visual support. Tests run in 100% parallel with zero flakes—so you can release faster, with confidence. Schedule a demo. Anand Gaur shows how Credential Manager centralizes passkeys, passwords, and federated sign‑ins into a secure biometric-based login flow with synced credentials across Android devices. We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product! A Kotlin Multiplatform solution for working with data. Whether you’re building alone or with a team of thousands, Store can help A modern, production-ready microservices development style in Kotlin built with best practices, enterprise-grade patterns, and libraries. The Kotlin 2.2.0 release is out! This version includes both new and stable language features, tooling updates, performance improvements for different platforms, and important fixes. ]]\u003e",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.qawolf.com/?utm_source=androidweekly\u0026amp;utm_medium=newsletter\u0026amp;utm_campaign=ACQ_All_Demo_Conversions__NewsletterAudience_-_Newsletter_FasterAndroidAppReleases_20250622-None_Experiment-FALSE\u0026amp;utm_term=cta-ScheduleADemo\u0026amp;utm_content=FasterAndroidAppReleases_ScheduleADemo_None_Headline%3AFasterAndroidAppReleasesWithAutomatedQA____Newsletter-PrimaryPlacement_20250622_v1_\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/686124/d93c93bc789800784e/square_logo_new__1_.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eManual testing on Android is slow, fragmented, and unreliable—and without broad device coverage, critical bugs slip through. QA Wolf delivers 80% automated coverage in weeks, running tests on high-fidelity Android emulators with full gesture, sensor, and visual support. Tests run in 100% parallel with zero flakes—so you can release faster, with confidence. Schedule a demo.\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eAnand Gaur shows how Credential Manager centralizes passkeys, passwords, and federated sign‑ins into a secure biometric-based login flow with synced credentials across Android devices.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://androidweekly.net/jobs/new\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/686125/673c93bc7898007899/square_aw.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eWe reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product!\n\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eA Kotlin Multiplatform solution for working with data. Whether you’re building alone or with a team of thousands, Store can help \n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eA modern, production-ready microservices development style in Kotlin built with best practices, enterprise-grade patterns, and libraries.\n\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://android-developers.googleblog.com/2025/06/agentic-ai-takes-gemini-in-android-studio-to-next-level.html\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/6860ac/7e3c93bc789800645d/square_Bildschirmfoto_2025-06-29_um_13.35.41.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eThe Kotlin 2.2.0 release is out! This version includes both new and stable language features, tooling updates, performance improvements for different platforms, and important fixes. \n\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.youtube.com/watch?v=rZszkFxZ8xA\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/6860ad/7b3c93bc7898006484/square_Bildschirmfoto_2025-06-29_um_13.36.27.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n]]\u0026gt;\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
