{
  "id": "e0f625b9-cb06-4ce7-a780-c8d332c8e88b",
  "title": "Compose Tips for Delightful UI — ’24 wrap up",
  "link": "https://medium.com/androiddevelopers/compose-tips-for-delightful-ui-24-wrap-up-1cfe18163ddd?source=rss----95b274b437c2---4",
  "description": "",
  "author": "Simona Milanović",
  "published": "Tue, 24 Dec 2024 15:56:00 GMT",
  "source": "https://medium.com/feed/androiddevelopers",
  "categories": [
    "api",
    "best-practices",
    "ui",
    "jetpack-compose",
    "featured"
  ],
  "byline": "Simona Milanović",
  "length": 3777,
  "excerpt": "In July 2024, we launched a brand new YouTube series called “Compose Tips for Delightful UI”. The series set out to give short, actionable and technical tips for working with Jetpack Compose and…",
  "siteName": "Android Developers",
  "favicon": "https://miro.medium.com/v2/resize:fill:1000:1000/7*GAOKVe--MXbEJmV9230oOQ.png",
  "text": "In July 2024, we launched a brand new YouTube series called “Compose Tips for Delightful UI”. The series set out to give short, actionable and technical tips for working with Jetpack Compose and share small examples of APIs that are not as widely known.We aimed to show how you can achieve a premium look and feel of your app, by using the powers and strengths of Compose, and cover the most important (but low cost) UI concepts to keep in mind when designing and developing an app.With the end of 2024 approaching, we ended our Season 1 which covered a variety of different, delightful topics that will make your UIs shine:Edge-to-edge and insetsLearn how to easily make your Android apps go edge-to-edge using Compose, ensuring it has a modern, delightful UI. Follow three simple steps to safely handle insets, to prevent content from overlapping system UI elements:PagerEasily add the Pager composable to your apps to get out of the box, delightful gestures on paged content. This episode covers how to use the Pager composable, configuration parameters such as controlling the fling distance, and tying into the PagerState to create animations:Nested scrollingScrolling can be a valuable tool for making fun and delightful apps! In this episode, learn how to use nested scrolling in Compose, for a seemingly complex coordination between multiple components on a single scroll:BrushBrushes in Jetpack Compose are a fundamental part as to how content is drawn on screen. Understanding the different types of brushes you can use can help make your app stand out from the crowd. In this episode, we dive into solid color brushes, different gradient brushes, as well as various options for gradient brushes:ShadersIn addition to Brushes, in Compose there is another delightful mechanism for painting your pixels and rendering graphics on screen, called Shaders. In this episode, we dive into the details of using shaders in Jetpack Compose, combined with render effects and how they can be applied to your whole UI:Flow layoutsFlowRow and FlowColumn are similar to Row and Column layouts, however the items will flow into the next row or column when there is no more space in the area. In this video, Flow layouts are covered along with how to use them and tricks for using them to work on different window sizes:Lazy gridsLists are vital to the Android UI — we use columns and rows everywhere in our apps! This episode shows how grids can sometimes serve as a better alternative, to make these layouts more dynamic and delightful — especially when supporting different window sizes across devices:AnchoredDraggableIn this episode, we cover Compose AnchoredDraggable, which is a Jetpack Compose API that lets you build components that can be dragged between anchor points and settles an anchor point at the end of the gesture. AnchoredDraggable is often used to build components like SwipeToDismiss, Navigation Drawers, Bottom Sheets and more:Graphics layersLearn all about Graphics Layers in Compose and how you can use the APIs to composite graphics layers together to create interesting visual effects. This episode covers how to use blend modes to blend between two layers, and how to set the saturation of a whole layer:Clipping and maskingClipping or masking parts of your content is a way to create delightful UI effects, and is a common need when working with custom UI components. Clipping is the process of removing parts of your content based on a set path or shape, whereas masking is similar, but allows for semi-transparent pixels too:You can check out the full YouTube playlist here.We are incredibly grateful for your feedback and suggestions for what else you’d like to see us cover, so please keep it coming.See you soon for Season 2 in 2025 — happy composing!",
  "image": "https://miro.medium.com/v2/resize:fit:800/1*EKZEUvYLMRmTgd3r5i73Gg.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca rel=\"noopener follow\" href=\"https://medium.com/@anomisSi?source=post_page---byline--1cfe18163ddd--------------------------------\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Simona Milanović\" src=\"https://miro.medium.com/v2/da:true/resize:fill:88:88/0*JuDXNZF_XDNLQV_-\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/androiddevelopers?source=post_page---byline--1cfe18163ddd--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Android Developers\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*4Tg6pPzer7cIarYaszIKaQ.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cp id=\"9885\"\u003eIn July 2024, we launched a brand new YouTube series called \u003cstrong\u003e“Compose Tips for Delightful UI”.\u003c/strong\u003e The series set out to give \u003cstrong\u003eshort, actionable and technical tips\u003c/strong\u003e for working with Jetpack Compose and share small examples of APIs that are not as widely known.\u003c/p\u003e\u003cp id=\"62a4\"\u003eWe aimed to show how\u003cstrong\u003e \u003c/strong\u003eyou can\u003cstrong\u003e achieve a premium look and feel \u003c/strong\u003eof your app, by using the powers and strengths of Compose, and cover the\u003cstrong\u003e most important (but low cost) UI concepts\u003c/strong\u003e to keep in mind when designing and developing an app.\u003c/p\u003e\u003cp id=\"423b\"\u003eWith the end of 2024 approaching, we ended our Season 1 which covered a variety of different, delightful topics that will make your UIs shine:\u003c/p\u003e\u003ch2 id=\"a0b1\"\u003eEdge-to-edge and insets\u003c/h2\u003e\u003cp id=\"c287\"\u003eLearn how to easily make your Android apps go edge-to-edge using Compose, ensuring it has a modern, delightful UI. Follow three simple steps to safely handle insets, to prevent content from overlapping system UI elements:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"56f6\"\u003ePager\u003c/h2\u003e\u003cp id=\"d2db\"\u003eEasily add the \u003ccode\u003ePager\u003c/code\u003e composable to your apps to get out of the box, delightful gestures on paged content. This episode covers how to use the \u003ccode\u003ePager\u003c/code\u003e composable, configuration parameters such as controlling the fling distance, and tying into the \u003ccode\u003ePagerState\u003c/code\u003e to create animations:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"3f53\"\u003eNested scrolling\u003c/h2\u003e\u003cp id=\"dda3\"\u003eScrolling can be a valuable tool for making fun and delightful apps! In this episode, learn how to use nested scrolling in Compose, for a seemingly complex coordination between multiple components on a single scroll:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"2823\"\u003eBrush\u003c/h2\u003e\u003cp id=\"2fcc\"\u003eBrushes in Jetpack Compose are a fundamental part as to how content is drawn on screen. Understanding the different types of brushes you can use can help make your app stand out from the crowd. In this episode, we dive into solid color brushes, different gradient brushes, as well as various options for gradient brushes:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"9bd8\"\u003eShaders\u003c/h2\u003e\u003cp id=\"6d46\"\u003eIn addition to Brushes, in Compose there is another delightful mechanism for painting your pixels and rendering graphics on screen, called Shaders. In this episode, we dive into the details of using shaders in Jetpack Compose, combined with render effects and how they can be applied to your whole UI:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"47cd\"\u003eFlow layouts\u003c/h2\u003e\u003cp id=\"63d4\"\u003e\u003ccode\u003eFlowRow\u003c/code\u003e and \u003ccode\u003eFlowColumn\u003c/code\u003e are similar to \u003ccode\u003eRow\u003c/code\u003e and \u003ccode\u003eColumn\u003c/code\u003e layouts, however the items will flow into the next row or column when there is no more space in the area. In this video, Flow layouts are covered along with how to use them and tricks for using them to work on different window sizes:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"7858\"\u003eLazy grids\u003c/h2\u003e\u003cp id=\"0c6d\"\u003eLists are vital to the Android UI — we use columns and rows everywhere in our apps! This episode shows how grids can sometimes serve as a better alternative, to make these layouts more dynamic and delightful — especially when supporting different window sizes across devices:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"2eb4\"\u003eAnchoredDraggable\u003c/h2\u003e\u003cp id=\"3c8e\"\u003eIn this episode, we cover Compose \u003ccode\u003eAnchoredDraggable\u003c/code\u003e, which is a Jetpack Compose API that lets you build components that can be dragged between anchor points and settles an anchor point at the end of the gesture. \u003ccode\u003eAnchoredDraggable\u003c/code\u003e is often used to build components like \u003ccode\u003eSwipeToDismiss\u003c/code\u003e, Navigation Drawers, Bottom Sheets and more:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"afd1\"\u003eGraphics layers\u003c/h2\u003e\u003cp id=\"f0a0\"\u003eLearn all about Graphics Layers in Compose and how you can use the APIs to composite graphics layers together to create interesting visual effects. This episode covers how to use blend modes to blend between two layers, and how to set the saturation of a whole layer:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"9376\"\u003eClipping and masking\u003c/h2\u003e\u003cp id=\"7e1d\"\u003eClipping or masking parts of your content is a way to create delightful UI effects, and is a common need when working with custom UI components. Clipping is the process of removing parts of your content based on a set path or shape, whereas masking is similar, but allows for semi-transparent pixels too:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"23a1\"\u003eYou can check out the full\u003cstrong\u003e YouTube playlist \u003c/strong\u003e\u003ca href=\"https://www.youtube.com/playlist?list=PLWz5rJ2EKKc9tgU26tbUAy01MzC2Yjztb\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cstrong\u003ehere\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"6c46\"\u003eWe are incredibly grateful for your feedback and suggestions for what else you’d like to see us cover, so please keep it coming.\u003c/p\u003e\u003cp id=\"feec\"\u003eSee you soon for Season 2 in 2025 —\u003cstrong\u003e happy composing!\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-24T15:56:00.513Z",
  "modifiedTime": null
}
