[
  {
    "id": "2c1654c5-336c-4ecd-87e7-8ffa0e7de169",
    "title": "Earn 3% on Online Shopping With This Card",
    "link": "https://www.wisebread.com/node/2571965",
    "description": "Link for teaser title:  https://www.wisebread.com/compare/pxd-2024-aug-bofa-customized-cash-rewards-revi... This card with no annual fee with a $200 welcome offer also lets you earn 3% cash back when you choose online shopping.",
    "author": "webmaster",
    "published": "Thu, 04 Jul 2024 16:14:53 +0000",
    "image": "https://www.wisebread.com/files/fruganomics/imagecache/128x112/blog-images/man_glasses_laptop_881009178_0.jpg",
    "source": "http://feeds.killeraces.com/wisebread",
    "categories": null
  },
  {
    "id": "a33f81e1-ef75-490e-8db3-74f03ae7024d",
    "title": "Why Online Shoppers Will Love This Credit Card",
    "link": "https://www.wisebread.com/node/2569723",
    "description": "Link for teaser title:  https://www.wisebread.com/compare/pxd-2024-aug-bofa-customized-cash-rewards-revi... This card offers 3% cash back on online shopping, including cable, streaming services, internet, and phone plan purchases.",
    "author": "webmaster",
    "published": "Thu, 04 Jul 2024 16:12:04 +0000",
    "image": "https://www.wisebread.com/files/fruganomics/imagecache/128x112/blog-images/woman-with-cell-164x144.png",
    "source": "http://feeds.killeraces.com/wisebread",
    "categories": null
  },
  {
    "id": "82c46e17-d7bc-49b5-bee1-3395c07a12d6",
    "title": "#551: The Dark Experiment That Explains Your Money Problems, with Dr. Brad Klontz and Adrian Brambila",
    "link": "https://affordanything.com/551-the-dark-experiment-that-explains-your-money-problems-with-dr-brad-klontz-and-adrian-brambila/",
    "description": "Financial psychologist Dr. Brad Klontz and Youtuber Adrian Brambila join us to talk about money psychology, starting with a dark but revealing story about an experiment with dogs. Scientists put dogs in electrified cages from which they couldn’t escape. Eventually, the dogs stopped trying to escape and just lay down, even when later moved to [...]",
    "author": "Paula Pant",
    "published": "Tue, 22 Oct 2024 16:23:32 +0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/pscrb.fm/rss/p/chrt.fm/track/8G441/traffic.megaphone.fm/WWO1151956978.mp3?updated=1729608508",
    "source": "https://affordanything.com/feed/",
    "categories": [
      "Episodes",
      "FIRE",
      "Investing",
      "behavioral finance",
      "financial freedom",
      "financial independence",
      "investing"
    ]
  },
  {
    "id": "c4ac5a50-411d-4dfd-9716-1238c638af11",
    "title": "#550: Paul Merriman: The 4-Fund Strategy That Beats the S\u0026P 500",
    "link": "https://affordanything.com/550-paul-merriman-the-4-fund-strategy-that-beats-the-sp-500/",
    "description": "Paul Merriman, a former wealth manager turned financial educator, joins us to share investing wisdom that could reshape how you think about your money. We kick things off talking about portfolio diversification. Paul suggests a simple four-fund strategy that includes large cap, small cap, and value stocks. He says this mix has historically beaten the S\u0026P 500 with lower risk. We then dive into international investing. Paul explains that while adding international stocks doesn't necessarily boost returns, it can help smooth out the ride. He keeps half his equity portfolio in international stocks, even at age 81. Got kids? Paul's got some advice for you too. He tells us about putting money aside for his new granddaughter, aiming to fund her Roth IRA as soon as she can earn income. He breaks down how investing just a dollar a day from birth to age 21 could turn into millions by retirement age. It's a powerful lesson in starting early and the magic of compound interest. We also chat about some common investing mistakes. Paul stresses that young investors often underestimate the power of stocks over bonds for long-term growth. He shares some eye-opening numbers: $100 invested in bonds since 1928 would have grown to about $12,000, while the same amount in small cap value stocks would be worth nearly $15 million. Paul wants you to think of investing as a partnership with businesses. When you buy a mutual fund, you're becoming a senior partner in thousands of companies. At first, your contributions drive most of the growth. But over time, market returns take over, and you become the junior partner to a much larger fortune. We wrap up with Paul sharing his excitement about a 40-hour financial education program he helped create at Western Washington University. It's designed to teach students essential money skills throughout their college years, from budgeting as freshmen to understanding 401(k)s as seniors. Throughout our chat, Paul's message is clear: start early, stay diversified, and think long-term. He believes that with the right education and mindset, anyone can build a solid financial future.",
    "author": "Paula Pant",
    "published": "Fri, 18 Oct 2024 11:06:01 +0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/pscrb.fm/rss/p/chrt.fm/track/8G441/traffic.megaphone.fm/WWO7439290836.mp3?updated=1729199482",
    "source": "https://affordanything.com/feed/",
    "categories": [
      "Episodes",
      "FIRE",
      "international investing",
      "investing",
      "investing in the market"
    ]
  },
  {
    "id": "b58d2dc0-8c2c-4ab7-b26c-5caff2ccb15a",
    "title": "I’m Still Alive; also, join the 7th Annual Uber Frugal Month Group Challenge!",
    "link": "https://frugalwoods.com/2023/12/13/im-still-alive-also-join-the-7th-annual-uber-frugal-month-group-challenge/",
    "description": "I’m still here! I took an unplanned (and therefore unannounced) break from writing the blog, which was intended to be for a week, but expanded to a month and then two months… WHOOPS. I confess I needed some time off from ye olde Frugalwoods after consistently posting for 9.5 years. That’s the longest I’ve ever done any one job and I realized during this impromptu hiatus that I–gasp–MISSED writing and MISSED all of you. Sometimes one must have some absence in order for one to realize what one misses. So, I’m checking in to let you know that I haven’t died or abandoned Frugalwoods, but that I am trying to discern how often I’ll write going forward. The days of thrice weekly posts are definitively over, but on the other extreme, I don’t particularly want to take full months off again either. Thank you for your patience as I–once again–figure out what I want to do with my life. Continue reading I’m Still Alive; also, join the 7th Annual Uber Frugal Month Group Challenge! at Frugalwoods.",
    "author": "Liz Frugalwoods",
    "published": "Wed, 13 Dec 2023 09:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/Frugalwoods",
    "categories": [
      "Frugalwoods Philosophy",
      "Uber Frugal Month"
    ]
  },
  {
    "id": "0cae9e6e-7fba-44b8-8064-ec9989daf790",
    "title": "Reader Case Study: Yearning For a Debt-Free Future",
    "link": "https://frugalwoods.com/2023/09/29/reader-case-study-yearning-for-a-debt-free-future/",
    "description": "Brian and Michael, both 34, live with their two cats in central Connecticut. Michael works as a project coordinator for a state behavioral health agency serving young people and has a side job as an advocate and disability leadership coordinator. Brian is a quality assurance manager for a state-run hospital. The couple’s been together since 2013 and looks forward to celebrating their 10-year anniversary in November. While Brian and Michael have achieved a lot, they feel as though their debt and lack of home ownership is holding them back. They’d like our advice on how to unlock this next level of adulting and, crucially, how to be permanently debt-free. What’s a Reader Case Study? Case Studies address financial and life dilemmas that readers of Frugalwoods send in requesting advice. Then, we (that’d be me and YOU, dear reader) read through their situation and provide advice, encouragement, insight and feedback in the comments section. Continue reading Reader Case Study: Yearning For a Debt-Free Future at Frugalwoods.",
    "author": "Liz Frugalwoods",
    "published": "Fri, 29 Sep 2023 08:00:00 +0000",
    "image": "https://frugalwoods.com/wp-content/uploads/2023/09/rcs-150x150.jpg",
    "source": "https://feeds.feedburner.com/Frugalwoods",
    "categories": [
      "Reader Case Studies",
      "featured"
    ]
  },
  {
    "id": "001a63c3-55e9-4eef-95c8-50462d90a447",
    "title": "You must begin from where you are",
    "link": "https://budgetsaresexy.com/you-must-begin-from-where-you-are/",
    "description": "“You must begin from where you are” What a perfect truth right there. Where else could you even start? The past is gone no matter... Read More [This post, You must begin from where you are, was first published by J. Money on Budgets Are Sexy]",
    "author": "J. Money",
    "published": "Tue, 15 Oct 2024 09:28:13 +0000",
    "image": "https://budgetsaresexy.com/images/starting-line.png",
    "source": "https://feeds2.feedburner.com/budgetsaresexy",
    "categories": [
      "Advice",
      "Get Motivated",
      "Life"
    ]
  },
  {
    "id": "d2460cf7-3093-470b-a8b2-be82a1b75bb8",
    "title": "I froze my credit and it was SO EASY! (And Free)",
    "link": "https://budgetsaresexy.com/i-froze-my-credit-and-it-was-stupidly-easy-and-free/",
    "description": "Y’all – after years of purposely ignoring this for reasons not even worth mentioning (they’re all lame) I finally froze my credit AND IT WAS... Read More [This post, I froze my credit and it was SO EASY! (And Free), was first published by J. Money on Budgets Are Sexy]",
    "author": "J. Money",
    "published": "Tue, 01 Oct 2024 09:55:03 +0000",
    "image": "https://budgetsaresexy.com/images/credit-lock.png",
    "source": "https://feeds2.feedburner.com/budgetsaresexy",
    "categories": [
      "Credit Cards"
    ]
  },
  {
    "id": "7bcabce9-afd4-4c01-bd3e-3cc72d614551",
    "title": "Financial Peace University vs. True Financial Freedom vs. Crown Financial MoneyLife",
    "link": "https://www.goodfinancialcents.com/financial-peace-university-vs-true-financial-freedom-vs-crown-financial-moneylife/",
    "description": "I recently completed three of the top Christian financial education programs for churches: SeedTime’s True Financial Freedom, Dave Ramsey’s Financial Peace University, and Crown Financial’s MoneyLife. These popular programs all claim to help you get control of your finances from a biblical perspective. However, they go about it in different ways with varying teaching styles […] The post Financial Peace University vs. True Financial Freedom vs. Crown Financial MoneyLife appeared first on Good Financial Cents®.",
    "author": "Dylan Drake",
    "published": "Thu, 13 Jun 2024 20:29:12 +0000",
    "image": "https://www.goodfinancialcents.com/wp-content/uploads/2024/06/Screenshot-2024-06-13-at-3.14.12 PM-1024x450.png",
    "source": "https://www.goodfinancialcents.com/feed/",
    "categories": [
      "Debt"
    ]
  },
  {
    "id": "55dcdde5-6407-44b5-93e1-a436c4a77f92",
    "title": "6 Ways to Help Your Child Build Credit During College",
    "link": "https://www.goodfinancialcents.com/6-ways-to-help-your-child-build-credit-during-college/",
    "description": "College students have a lot on their plate already, including the need to study to get good grades, participating in any number of on-campus activities and potentially working part-time to have some spending money. That said, college students should also focus on their financial future, including steps they can take to build credit before they […] The post 6 Ways to Help Your Child Build Credit During College appeared first on Good Financial Cents®.",
    "author": "Jeff Rose, CFP®",
    "published": "Mon, 12 Feb 2024 17:55:46 +0000",
    "image": "https://www.goodfinancialcents.com/wp-content/uploads/2024/02/College-Ave-Ambition-Card-1024x549.png",
    "source": "https://www.goodfinancialcents.com/feed/",
    "categories": [
      "Credit",
      "Unclassified"
    ]
  },
  {
    "id": "d0b751c5-0fbe-4d1e-9d76-ec36ffe8f1aa",
    "title": "3 Steps To Being More Productive (even when you feel lazy)",
    "link": "https://www.iwillteachyoutoberich.com/steps-to-being-more-productivity/",
    "description": "How many times have you told yourself you’ll start working out five times per week, eat less processed foods, or commit to finding a side hustle, only not to follow through when you get tired?  I’ve worked with my mentor, BJ Fogg, Stanford professor and author of the bestselling book, Tiny Habits, where we developed […] Source",
    "author": "Ramit Sethi",
    "published": "Sun, 20 Oct 2024 20:07:44 +0000",
    "image": "",
    "source": "https://www.iwillteachyoutoberich.com/feed/",
    "categories": [
      "Personal Development \u0026 Productivity",
      "Big Wins",
      "Mindset",
      "time management"
    ]
  },
  {
    "id": "eabe316f-9e1b-4234-8e2c-ac1ba49e5162",
    "title": "How Much Do Content Creators Make In 2024? (+ my tips inside)",
    "link": "https://www.iwillteachyoutoberich.com/how-much-do-content-creators-make/",
    "description": "If you’re one of the world’s biggest YouTubers like Mr Beast, you can take home around $50 million a year. However, most content creators who are making money from their content take an average of anywhere between $10-$500 per post.  In this post, I’ll walk you through some of the top earning content creators based […] Source",
    "author": "Ramit Sethi",
    "published": "Sat, 19 Oct 2024 19:53:40 +0000",
    "image": "",
    "source": "https://www.iwillteachyoutoberich.com/feed/",
    "categories": [
      "Grow Your Business"
    ]
  },
  {
    "id": "40d608b9-c679-4492-bca6-7a064ed2ceea",
    "title": "Apply Stop Losses To Protect Your Wealth And Quality Of Life",
    "link": "https://www.financialsamurai.com/apply-stop-losses-to-protect-your-wealth-and-quality-of-life/",
    "description": "As an investor, it’s essential to understand that risk assets come with no guaranteed returns. Setting and following a stop loss can help protect your capital, especially if you're an active investor who picks individual stocks. Without stop losses, you could expose yourself to significant losses. Yet, I've come to realize that stop losses aren't […] The post Apply Stop Losses To Protect Your Wealth And Quality Of Life appeared first on Financial Samurai.",
    "author": "Financial Samurai",
    "published": "Mon, 28 Oct 2024 14:46:00 +0000",
    "image": "",
    "source": "https://www.financialsamurai.com/feed/",
    "categories": [
      "Retirement"
    ]
  },
  {
    "id": "2af7d535-d04f-447a-b715-b22aa48d50c6",
    "title": "How Speaking To A Financial Professional Saved Me From Myself",
    "link": "https://www.financialsamurai.com/how-a-financial-professional-saved-me-from-myself/",
    "description": "Empower is offering free financial consultations until October 31, 2024, for anyone with over $250,000 in investable assets. If you complete two video calls by the deadline, you'll receive a free $100 Visa gift card via e-mail in November. There is no obligation to use their services afterward. I wanted to share my experience speaking with them and […] The post How Speaking To A Financial Professional Saved Me From Myself appeared first on Financial Samurai.",
    "author": "Financial Samurai",
    "published": "Sat, 26 Oct 2024 11:48:00 +0000",
    "image": "",
    "source": "https://www.financialsamurai.com/feed/",
    "categories": [
      "Investments"
    ]
  },
  {
    "id": "e8f12325-8aaa-4d7e-ac9b-beb3b3dfebaa",
    "title": "Here’s My Daily Trading Routine That I’ve Used For 10+ Years",
    "link": "https://www.learntotradethemarket.com/forex-trading-strategies/daily-trading-routine-nial-fuller",
    "description": "Here’s what you need to know about trading routines: Trading routines, are the real key to success in the market. There’s no magic indicator or algorithmic trading robot that is going to easily make you a profitable trader. Just like Bill Gates routine each and everyday, over the course of years, led him to insane financial success, so will your trading routine. The post Here’s My Daily Trading Routine That I’ve Used For 10+ Years first appeared on Learn To Trade The Market.",
    "author": "Nial Fuller",
    "published": "Sun, 20 Jun 2021 22:00:31 +0000",
    "image": "",
    "source": "https://www.learntotradethemarket.com/feed",
    "categories": [
      "Forex Trading Strategies By Nial Fuller"
    ]
  },
  {
    "id": "a88905ff-c8ce-4029-bbd0-a72a91a30596",
    "title": "Beware Of Scammers Impersonating Nial Fuller On Social Media",
    "link": "https://www.learntotradethemarket.com/nial-fullers-blog/nial-fuller-scam-warning",
    "description": "There are scammers impersonating Nial Fuller (pretending to be me) on social media sites and other websites across the internet. These impersonators are actively contacting our members and followers on social media chat apps and platforms. The fake scam accounts will initially appear as me (Nial Fuller), with similar profile pictures and text to my real profiles. The impersonators will try to talk with you for some time before eventually offering you a 'trade for you service' or a 'managed account service' or something similar to this. The post Beware Of Scammers Impersonating Nial Fuller On Social Media first appeared on Learn To Trade The Market.",
    "author": "Nial Fuller",
    "published": "Tue, 18 May 2021 09:03:19 +0000",
    "image": "",
    "source": "https://www.learntotradethemarket.com/feed",
    "categories": [
      "Nial Fullers’ Blog"
    ]
  },
  {
    "id": "f5dbd32a-d0c9-432d-bcf3-e6800e256fcb",
    "title": "Are You Prepared for Retirement?",
    "link": "https://moneyning.com/retirement/are-you-prepared-for-retirement/",
    "description": "One of the best things you can do for your financial future is to start preparing for retirement as early as you can. Unfortunately, not very many Americans are getting ready for retirement. Indeed, according to a report from the Federal Reserve, 31 percent of Americans have no retirement savings at all. Not only that, […] The post Are You Prepared for Retirement? first appeared on MoneyNing.",
    "author": "",
    "published": "Mon, 28 Oct 2024 15:49:31 +0000",
    "image": "https://moneyning.com/wp-content/uploads/2020/07/retirement.jpg",
    "source": "http://feeds.feedburner.com/MoneyNing",
    "categories": [
      "Retirement",
      "Financial Freedom",
      "Saving Money"
    ]
  },
  {
    "id": "f00ef81e-3497-4093-bdca-2a0748933cdb",
    "title": "How to Cash In Your Pennies for More Than a Cent",
    "link": "https://moneyning.com/make-money/how-to-cash-in-your-pennies-for-more-than-a-cent/",
    "description": "If you want a collecting hobby that could yield a financial profit, collecting coins and old pennies is a win-win choice. The post How to Cash In Your Pennies for More Than a Cent first appeared on MoneyNing.",
    "author": "Jamie Simmerman",
    "published": "Mon, 21 Oct 2024 15:58:43 +0000",
    "image": "https://moneyning.com/wp-content/uploads/2019/01/photo-1530037768512-3c9a22715452.jpeg",
    "source": "http://feeds.feedburner.com/MoneyNing",
    "categories": [
      "Make Money",
      "Money Management"
    ]
  },
  {
    "id": "cd54b49e-6fb9-463b-ac90-8fc3e443d666",
    "title": "10 Ways to Get $10 Free PayPal Money Instantly",
    "link": "https://millennialmoney.com/free-10-dollars-paypal-instantly/",
    "description": "The post 10 Ways to Get $10 Free PayPal Money Instantly appeared first on Millennial Money. While some sites offer $10 free PayPal money instantly, some of these methods actually require time, effort, and patience. The post 10 Ways to Get $10 Free PayPal Money Instantly appeared first on Millennial Money.",
    "author": "Grant Sabatier",
    "published": "Sat, 29 Jun 2024 15:13:06 +0000",
    "image": "https://millennialmoney.com/wp-content/uploads/2022/07/branded-surveys-logo-square.svg",
    "source": "https://millennialmoney.com/feed/",
    "categories": [
      "Fast Cash"
    ]
  },
  {
    "id": "52400bcb-7b98-41fb-99a1-811acc1ae7ca",
    "title": "How To Make Money Without a Car in 2024",
    "link": "https://millennialmoney.com/make-money-without-a-car/",
    "description": "The post How To Make Money Without a Car in 2024 appeared first on Millennial Money. Whether you want to make some extra spending money or are looking for a full-time career opportunity, there are many ways to make make money without a car! The post How To Make Money Without a Car in 2024 appeared first on Millennial Money.",
    "author": "Grant Sabatier",
    "published": "Thu, 20 Jun 2024 15:04:12 +0000",
    "image": "https://millennialmoney.com/wp-content/uploads/2019/10/mypoints.jpg",
    "source": "https://millennialmoney.com/feed/",
    "categories": [
      "Fast Cash"
    ]
  },
  {
    "id": "2a35c7c3-b708-49e0-8171-14d3c53149b6",
    "title": "Block Advisors Business Formation Services Review",
    "link": "https://www.moneycrashers.com/block-advisors-business-formation-services-review/",
    "description": "Starting a new business can be both exciting and stressful. It pays to work with professionals who have the experience needed to help you choose the right type of business and form it properly. Block Advisors is one company that aims to lighten the load for entrepreneurs looking to form a business.  We’ve reviewed Block The post Block Advisors Business Formation Services Review appeared first on Money Crashers.",
    "author": "Grant Sabatier",
    "published": "Thu, 01 Aug 2024 17:44:00 +0000",
    "image": "",
    "source": "https://www.moneycrashers.com/feed/",
    "categories": [
      "Save Money"
    ]
  },
  {
    "id": "0f1e55ba-75db-43be-b450-a8f6c7dd44f5",
    "title": "Block Advisors Payroll and Bookkeeping Services Review 2024",
    "link": "https://www.moneycrashers.com/block-advisors-payroll-and-bookkeeping-services-review/",
    "description": "Managing your business’s payroll and bookkeeping can be a time-consuming—and sometimes complicated—task. To ease the burden, you might want to consider paying for bookkeeping and payroll services from a company like Block Advisors. Use the Block Advisors bookkeeping and payroll review below to compare Block Advisors’ plans, explore their features, and consider the biggest pros The post Block Advisors Payroll and Bookkeeping Services Review 2024 appeared first on Money Crashers.",
    "author": "Grant Sabatier",
    "published": "Thu, 01 Aug 2024 17:41:00 +0000",
    "image": "",
    "source": "https://www.moneycrashers.com/feed/",
    "categories": [
      "Save Money"
    ]
  },
  {
    "id": "3dab3a81-b7a7-42fd-abae-6e7c566d28d2",
    "title": "What $20 Gets You at Gas Stations in Each State",
    "link": "https://www.nerdwallet.com/article/finance/gas-prices-falling",
    "description": "Gas prices are falling toward four-year lows — but vary widely across the country. Here's how much gas $20 will buy you in each state.",
    "author": "Taryn Phaneuf",
    "published": "Mon, 28 Oct 2024 23:03:10 +0000",
    "image": "https://www.nerdwallet.com/blog/content/themes/nerdwallet/assets/tracking/nw-pixel-v1.gif?post_id=1652648",
    "source": "https://www.nerdwallet.com/blog/feed/",
    "categories": [
      "Personal Finance"
    ]
  },
  {
    "id": "e8cd8075-7b62-42a7-a8fb-f549b9f64580",
    "title": "Moving Checklist",
    "link": "https://www.nerdwallet.com/article/mortgages/moving-checklist",
    "description": "Here's what to do as soon as you find a new place, as well as right after you hire the movers, six weeks before, two weeks before, and on and after moving day.",
    "author": "Tina Orem",
    "published": "Mon, 28 Oct 2024 22:58:36 +0000",
    "image": "https://www.nerdwallet.com/blog/content/themes/nerdwallet/assets/tracking/nw-pixel-v1.gif?post_id=1647632",
    "source": "https://www.nerdwallet.com/blog/feed/",
    "categories": [
      "Homeownership",
      "Mortgages"
    ]
  },
  {
    "id": "9018e517-16e6-4c3e-b3f2-d3a1ae0b3104",
    "title": "How To Turn Your Hobby Into a Money-Making Business",
    "link": "https://www.makingsenseofcents.com/2024/10/how-to-turn-your-hobby-into-a-money-making-business.html",
    "description": "Do you want to learn how to turn your hobby into a money-making business? Do you love a hobby so much you wish you could do it all day? Well, you might be able to turn that passion into a real business! Many people have found ways to make extra money from things they enjoy... The post How To Turn Your Hobby Into a Money-Making Business appeared first on Making Sense Of Cents.",
    "author": "Michelle Schroeder-Gardner",
    "published": "Mon, 28 Oct 2024 10:25:00 +0000",
    "image": "https://www.makingsenseofcents.com/wp-content/uploads/2024/10/How-To-Turn-Your-Hobby-Into-a-Money-Making-Business-1-1024x683.jpg",
    "source": "https://www.makingsenseofcents.com/feed",
    "categories": [
      "Extra Income",
      "Start A Business"
    ]
  },
  {
    "id": "8c54d2aa-a273-4a34-8ecc-6be6450fc645",
    "title": "How To Make Money as a Travel Photographer",
    "link": "https://www.makingsenseofcents.com/2024/10/how-to-make-money-as-a-travel-photographer.html",
    "description": "Do you want to learn how to make money as a travel photographer? Photography can be an exciting way to get paid to travel. If you enjoy taking pictures and traveling, this might be your dream job. Lots of people love seeing photos from different places, and you could be the one to share them.... The post How To Make Money as a Travel Photographer appeared first on Making Sense Of Cents.",
    "author": "Michelle Schroeder-Gardner",
    "published": "Fri, 25 Oct 2024 10:48:00 +0000",
    "image": "https://www.makingsenseofcents.com/wp-content/uploads/2024/10/How-To-Make-Money-as-a-Travel-Photographer-1-1024x681.jpg",
    "source": "https://www.makingsenseofcents.com/feed",
    "categories": [
      "Career",
      "Extra Income",
      "Jobs",
      "Start A Business",
      "Travel"
    ]
  },
  {
    "id": "2e6adac1-f20a-475f-9d0b-e1aeff5543e2",
    "title": "A values-driven life",
    "link": "https://www.getrichslowly.org/a-values-driven-life/",
    "description": "Hello, friends. Just a quick note to let you all know that my life, at last, seems to be settling. A full two months after the death of my mother, the fog has lifted and I find that I'm motivated to pursue productive pursuits once more. I spent much of the past several weeks doing some serious soul-searching. It's clear to me (and to Kim) that above all else, I need to make 2023 the year of me. 2023 — The Year of Me More than a decade ago, I got into the habit of theming my years and months. It was fun! It was also fruitful. Whenever I decided to devote a span of time to one thing, I had great results, whether it was with fitness or writing or dating. This habit of theming lasted for a couple of years, then fell by the wayside.\u003c/",
    "author": "J.D. Roth",
    "published": "Fri, 02 Dec 2022 23:05:45 +0000",
    "image": "",
    "source": "https://www.getrichslowly.org/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "835270ac-e885-46f6-a462-1e2711899a72",
    "title": "A man of no ambition",
    "link": "https://www.getrichslowly.org/a-man-of-no-ambition/",
    "description": "A memory came to me this morning while I was walking the dog, a memory of those days when I was fresh out of college and just beginning to work for my father at the box factory. A salesman had come knocking on our door. This was strange since the box factory was (and still is) located in a rural area. But somehow this guy had found us and he was there to make his pitch: He was a salesman who trained salesmen. (And, presumably, saleswomen although this wasn't part of the spiel in 1992.) Dad, amused, introduced this fellow to me. \"This is J.D.,\" Dad said. \"He's our salesman. Talk to him.\" So, this guy sat down with me in a back room of the shabby trailer house that served as company HQ. (This was the very trailer house I'd grown up in. And trust me when I say it was a pit, a sty. It was just as bad as you're imagining. Maybe worse.)",
    "author": "J.D. Roth",
    "published": "Wed, 02 Nov 2022 18:23:24 +0000",
    "image": "",
    "source": "https://www.getrichslowly.org/feed/",
    "categories": [
      "Psychology"
    ]
  },
  {
    "id": "f65a3428-72f8-48a9-8560-ba2baab42ed2",
    "title": "The 18 Best Financial Advisor Conferences To Attend In 2025",
    "link": "https://feeds.feedblitz.com/~/906999728/0/kitcesnerdseyeview~The-Best-Financial-Advisor-Conferences-To-Attend-In/",
    "description": "Financial advisor conferences are not what they used to be. Once the domain of membership associations that, especially amongst independent financial advisors, created a central space for networking and community, conferences were primarily built around professional development (i.e., continuing education) and often held a space for the vendors who served those advisors, with organizations likeRead More... The post The 18 Best Financial Advisor Conferences To Attend In 2025 first appeared on Kitces.com.",
    "author": "Michael Kitces",
    "published": "Mon, 28 Oct 2024 11:01:25 +0000",
    "image": "https://feeds.feedblitz.com/~/i/906999728/0/kitcesnerdseyeview",
    "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
    "categories": [
      "Conferences"
    ]
  },
  {
    "id": "a79a9687-4a3f-4338-bd9d-1086276c6053",
    "title": "Weekend Reading For Financial Planners (October 26–27)",
    "link": "https://feeds.feedblitz.com/~/906864725/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-October-%e2%80%93/",
    "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that a recent study by Cerulli Associates and Osaic found that at a time when consumers are increasingly seeking comprehensive planning relationships with their financial advisors, many advisors appear to be overestimating the comprehensiveness of theRead More... The post Weekend Reading For Financial Planners (October 26–27) first appeared on Kitces.com.",
    "author": "Adam Van Deusen",
    "published": "Fri, 25 Oct 2024 18:00:44 +0000",
    "image": "https://feeds.feedblitz.com/~/i/906864725/0/kitcesnerdseyeview",
    "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
    "categories": [
      "Weekend Reading",
      "OPTIN: Value Of Advice (BAR)",
      "OPTIN: Value Of Advice (SLIDE IN)"
    ]
  },
  {
    "id": "cdc8f069-8879-43cc-8502-2b1918d63eb6",
    "title": "Investing Blog Roundup: How to Actually Build a TIPS Ladder",
    "link": "https://obliviousinvestor.com/investing-blog-roundup-how-to-actually-build-a-tips-ladder/",
    "description": "TIPS are an extremely useful investment option in some scenarios. If you want to have a certain amount of purchasing power available, on a specific date, nothing can do that for you other than I Bonds and individual TIPS, held to maturity. But most investors these days don’t actually have any experience buying individual bonds, […]",
    "author": "Mike",
    "published": "Mon, 28 Oct 2024 12:00:50 +0000",
    "image": "https://www.obliviousinvestor.com/wp-content/uploads/2014/04/NewBook8CoverTiltedScaled2.png",
    "source": "https://obliviousinvestor.com/feed/",
    "categories": [
      "Roundup"
    ]
  },
  {
    "id": "abcbc57a-e2f8-4022-9592-48bf2ab7d727",
    "title": "Pets and Estate Planning: Challenges and Solutions",
    "link": "https://obliviousinvestor.com/pets-and-estate-planning-challenges-and-solutions/",
    "description": "Pets create certain distinct challenges with respect to estate planning. At its core, the issue is that pets, legally speaking, are property. In your mind, your beloved terrier Marty is a member of the family. But as far as the law is concerned, Marty is no different from a piece of furniture. Marty cannot own […]",
    "author": "Mike",
    "published": "Mon, 21 Oct 2024 12:00:38 +0000",
    "image": "https://www.obliviousinvestor.com/wp-content/uploads/2014/04/NewBook8CoverTiltedScaled2.png",
    "source": "https://obliviousinvestor.com/feed/",
    "categories": [
      "Estate Planning"
    ]
  },
  {
    "id": "393bc168-030e-4f04-94da-b5ba0897bc14",
    "title": "Motley Fool vs. Action Alerts PLUS",
    "link": "https://wellkeptwallet.com/motley-fool-vs-action-alerts-plus/",
    "description": "Motley Fool Stock Advisor and TheStreet’s Action Alerts PLUS are two popular stock-picking services. They can help you find individual stocks that will outperform the broad stock market. However, each service caters to a different investment strategy, has varying recommendation frequencies and provides different platform features.  This Motley Fool Stock Advisor vs. TheStreet’s Action Alerts... The post Motley Fool vs. Action Alerts PLUS appeared first on Well Kept Wallet.",
    "author": "Josh Patoka",
    "published": "Mon, 21 Oct 2024 14:29:36 +0000",
    "image": "",
    "source": "https://wellkeptwallet.com/feed/",
    "categories": [
      "Investing"
    ]
  },
  {
    "id": "037c97b0-b6be-42c2-83a4-93300cf1ad53",
    "title": "The Motley Fool vs. Morningstar",
    "link": "https://wellkeptwallet.com/motley-fool-vs-morningstar/",
    "description": "A trustworthy investment research service is crucial for investing in individual stocks and funds. The Motley Fool and Morningstar are two of the most popular platforms, and I’ve used both of them for extensive research to compare the overlapping features, such as analyst reports and portfolio trackers, and distinguish the investment styles. When comparing The... The post The Motley Fool vs. Morningstar appeared first on Well Kept Wallet.",
    "author": "Josh Patoka",
    "published": "Thu, 17 Oct 2024 18:31:43 +0000",
    "image": "",
    "source": "https://wellkeptwallet.com/feed/",
    "categories": [
      "Investing"
    ]
  },
  {
    "id": "b7eec0d7-fd89-4446-ae0c-d41ae645fa80",
    "title": "FlexJobs Review: Is FlexJobs Legit? Read Before Signing Up…",
    "link": "https://www.sidehustlenation.com/flexjobs-review/",
    "description": "FlexJobs promises to connect remote job seekers with verified, scam-free job listings. But is it worth paying for?",
    "author": "Nick Loper",
    "published": "Thu, 16 May 2024 19:13:58 +0000",
    "image": "https://getlasso.co/wp-content/uploads/flexjobs-logo.png",
    "source": "https://www.sidehustlenation.com/feed",
    "categories": [
      "Reviews"
    ]
  },
  {
    "id": "f6cfb62b-e088-43a3-8a56-bf641ca16899",
    "title": "How to Start a Billboard Business: $30k a Month Part-Time",
    "link": "https://www.sidehustlenation.com/how-to-start-a-billboard-business/",
    "description": "Even with the rise of digital technology, billboards remain a profitable business. In fact, Chris Brown built his billboard side hustle to $30,000 a month (part-time!). Chris now owns approximately 30 billboards around Bentonville, Arkansas, and retired early at the age of 42.",
    "author": "Nick Loper",
    "published": "Thu, 16 May 2024 09:00:44 +0000",
    "image": "https://traffic.megaphone.fm/YAP8304129779.mp3",
    "source": "https://www.sidehustlenation.com/feed",
    "categories": [
      "Hustle 101"
    ]
  },
  {
    "id": "1fd6899d-0cbb-4b44-9952-b42573142892",
    "title": "SAVE Plan Forbearance Extended: What Borrowers Should Know",
    "link": "https://thecollegeinvestor.com/47929/save-plan-forbearance-extended-what-borrowers-should-know/",
    "description": "Borrowers in the SAVE Student Loan Plan face extended forbearance. However, there are options for loan forgiveness and other repayment plans. The post SAVE Plan Forbearance Extended: What Borrowers Should Know appeared first on The College Investor.",
    "author": "Robert Farrington",
    "published": "Mon, 28 Oct 2024 15:53:36 +0000",
    "image": "https://thecollegeinvestor.com/wp-content/uploads/2024/08/What_Is_Administrative_Forbearance_1280x720.png.webp",
    "source": "https://thecollegeinvestor.com/feed/",
    "categories": [
      "News"
    ]
  },
  {
    "id": "def853cb-507c-431c-b8e6-0ea335345254",
    "title": "What Does Capitalized Interest Mean And Can You Avoid It?",
    "link": "https://thecollegeinvestor.com/34219/what-is-capitalized-interest/",
    "description": "Capitalized interest is unpaid interest that is added to a loan balance after a period of reduced payment ends and normal repayment begins. The post What Does Capitalized Interest Mean And Can You Avoid It? appeared first on The College Investor.",
    "author": "Robert Farrington",
    "published": "Mon, 28 Oct 2024 15:00:00 +0000",
    "image": "https://thecollegeinvestor.com/wp-content/uploads/2020/07/WP_Interest.jpg.webp",
    "source": "https://thecollegeinvestor.com/feed/",
    "categories": [
      "Student Loans"
    ]
  },
  {
    "id": "61c21b01-b5d3-44d7-82a4-4ca7112689f9",
    "title": "*HOT* Walmart Plus Membership Discount | 50% Off!",
    "link": "https://moneysavingmom.com/free-walmart-plus-membership-trial/",
    "description": "Save BIG on a Walmart + membership right now! It gives you free shipping, gas savings, and more! Walmart+ Discount: 50% Off! WOW! Walmart is currently offering a 50% discount on a Walmart+ membership making it just $49! That’s a savings of $49! This is a RARE deal and just in time for the WalmartRead More",
    "author": "Meagan",
    "published": "Mon, 28 Oct 2024 20:06:00 +0000",
    "image": "https://moneysavingmom.com/wp-content/uploads/2024/10/Screenshot-2024-10-28-at-3.29.08-PM-630x571.png",
    "source": "https://moneysavingmom.com/feed/",
    "categories": [
      "Deals",
      "Grocery Deals",
      "Hot Deals",
      "Online Deals",
      "Prime Day Deals",
      "Walmart Deals"
    ]
  },
  {
    "id": "39956704-7a00-4d26-9e0a-3ff8673ce033",
    "title": "*HOT* Ulta $1.65 Stocking Stuffers + Free In-Store Pickup!",
    "link": "https://moneysavingmom.com/ulta-stocking-stuffers-deal/",
    "description": "You can grab stocking stuffers for just $1.65 each at Ulta! Right now, Ulta has some fun stocking stuffers on sale 5/$10 right now (regularly $2.99)! Plus, you can score $3.50 off a $15 purchase with coupon code 919938 at checkout. Here is a deal idea to get these for just $1.65 each: Buy 10 ULTARead More",
    "author": "Gretchen",
    "published": "Mon, 28 Oct 2024 20:05:00 +0000",
    "image": "https://moneysavingmom.com/wp-content/uploads/2023/12/Screenshot-2024-10-28-at-9.54.36 AM-630x629.jpg",
    "source": "https://moneysavingmom.com/feed/",
    "categories": [
      "Beauty Deals",
      "Christmas Gifts",
      "Deals",
      "Gift Ideas",
      "Hot Deals",
      "Online Deals",
      "ULTA Deals"
    ]
  },
  {
    "id": "132941a8-dcc6-44cc-9249-d0c5dc7509f4",
    "title": "Social Security Fix Requires Political Courage",
    "link": "https://www.savingadvice.com/articles/2024/10/28/10148817_social-security-fix.html",
    "description": "Social Security recipients will get a 2.5 percent cost of living adjustment (COLA) in January. That is not much to help seniors keep up with...",
    "author": "Max Erkiletian",
    "published": "Mon, 28 Oct 2024 10:36:11 +0000",
    "image": "https://www.savingadvice.com/wp-content/uploads/2024/10/couple-6653517_1280-300x200.jpg",
    "source": "https://www.savingadvice.com/feed/",
    "categories": [
      "News",
      "Donald Trump",
      "Kamala Harris",
      "social security",
      "Social Security Administration",
      "Social security benefits",
      "Social Security stability"
    ]
  },
  {
    "id": "8b68df85-ebd0-4665-b1a3-b18827940cf5",
    "title": "Habits of Wealthy People That You Should Adopt Today",
    "link": "https://www.savingadvice.com/articles/2024/10/27/1040918_habits-of-wealthy-people-that-you-should-adopt-today.html",
    "description": "Success is measured differently by different people. No matter how different a person’s definition of the word, building wealth seems to be a common factor...",
    "author": "Amanda Blankenship",
    "published": "Mon, 28 Oct 2024 02:00:55 +0000",
    "image": "https://www.savingadvice.com/wp-content/uploads/2016/04/habits-of-the-wealthy-scaled.jpg",
    "source": "https://www.savingadvice.com/feed/",
    "categories": [
      "Debt",
      "Personal Finance",
      "wealthy habits"
    ]
  },
  {
    "id": "24bdd361-084b-4503-9d41-535707f76840",
    "title": "560: The Ultimate Guide To Short Form Video Marketing And Getting Results Fast",
    "link": "https://mywifequitherjob.com/episode560/",
    "description": "This episode marks the beginning of a 4 part series on “Creating Content To Promote Your Business”.  Toni and I will be covering everything from video, blogging, to email marketing and podcasting. To kick things off, we’re starting with one of the hottest trends, short-form video. Enjoy! What You’ll Learn The building blocks of video Which platform to begin with How to create effective short form video Sponsors SellersSummit.com – The Sellers Summit is the ecommerce conference that I’ve run for the past 8 years. It’s small and intimate and you’ll learn a ton! Click Here To Grab The Recordings. […] The post 560: The Ultimate Guide To Short Form Video Marketing And Getting Results Fast appeared first on MyWifeQuitHerJob.com.",
    "author": "Steve Chou",
    "published": "Tue, 22 Oct 2024 17:25:31 +0000",
    "image": "https://traffic.libsyn.com/mywifequitherjob/MWQHJ560SteveToni.mp3",
    "source": "https://mywifequitherjob.com/feed/",
    "categories": [
      "Blogging",
      "The My Wife Quit Her Job Podcast With Steve Chou"
    ]
  },
  {
    "id": "73bffdc1-f165-4a22-a534-0e0b22b2a7ce",
    "title": "559: The Brutal Truth About Playing It Safe And Why It’s Holding You Back With Chase Jarvis",
    "link": "https://mywifequitherjob.com/episode559/",
    "description": "Today I’m thrilled to have my friend Chase Jarvis on the show. Chase is an acclaimed photographer, director, and entrepreneur who has worked for top-tier brands like Apple, Nike, and Redbull. His work has been featured in prominent publications such as New York Times and Wired Magazine. In this episode, Chase and I discuss the levers you can pull to make money doing what you love and to finally stop playing it safe. What You’ll Learn Why playing it safe is preventing you from achieving your full potential The 7 levers you can pull to do what you love How […] The post 559: The Brutal Truth About Playing It Safe And Why It’s Holding You Back With Chase Jarvis appeared first on MyWifeQuitHerJob.com.",
    "author": "Steve Chou",
    "published": "Wed, 09 Oct 2024 15:24:04 +0000",
    "image": "https://traffic.libsyn.com/mywifequitherjob/MWQHJ559ChaseJarvis.mp3",
    "source": "https://mywifequitherjob.com/feed/",
    "categories": [
      "Productivity/Personal Development",
      "The My Wife Quit Her Job Podcast With Steve Chou"
    ]
  }
]
