{
  "id": "128273e5-0f14-467d-9f53-d4a5211427b3",
  "title": "Why I Regret Getting Microbladed Eyebrows as a Latina Millennial",
  "link": "https://www.popsugar.com/beauty/latina-regrets-getting-eyebrows-microbladed-49398145",
  "description": "Image Source: Getty/isayildiz From a young age, Latina girls and young women are bombarded with ideas of what womanhood should look like. Part of this includes the pressure to uphold societal beauty standards that are often impossible to meet. These very standards still align with what is imposed by white supremacy. From the pressure for AfroLatinas to chemically straighten their hair to the push for all Latinas to have curvaceous yet thin bodies, being Latina means striving for desirability. Other standards that define beauty in our communities include having plump lips, light skin, and long, dark, flowy hair. This means that when one has a feature that doesn't fit this standard, it becomes easy to grow an insecurity around it. For me, it was several things, including something seemingly small yet significant: eyebrows. I have always had naturally thin eyebrows with not much hair (still do). From a young age, even when wearing makeup wasn't encouraged for girls, my mother did encourage me to paint my eyebrows like she would do herself. As a Latina, eyebrows are kind of huge for us. Some of the women who were lauded as beautiful and praised for meeting the \"Latina beauty standards\" had big, bushy eyebrows, from Salma Hayek and Gina Torres to Zoe Saldaña. While eyebrows weren't huge in Dominican culture specifically, we were still affected by representations of Latinidad seen in Hollywood. Salma Hayek for example, also played Minerva Mirabal, a Dominican shero, in the film adaptation of Julia Alvarez's book \"In the Time of the Butterflies,\" despite not being Dominican herself. With time, I became insecure, especially as I looked up to feminist icons like Frida Kahlo whose eyebrows were a big part of claiming their pride. These views of Latinidad that were alive during my teenage years were limiting, as they not only imposed harmful beauty standards, but they also painted us all with broad strokes when Latinidad is incredibly diverse. Years later, I was able to deconstruct a lot of these colonial notions, but I failed to realize that eyebrows were a blind spot for me: I was still insecure and never took a moment to understand the root of this insecurity. This is how these harmful beliefs become internalized. So, last year, when the idea of getting my eyebrows microbladed came up, I was excited. I was experiencing changes in my life, from a shift in my career to a change in family dynamics, and I felt that how I looked was something I could control. I found a trusted microblader who used natural, vegetable-based tint. When I first got them done, I felt refreshed and in love with my new look. As time went on, I realized something had changed. I no longer felt as beautiful in photos. I started feeling self-conscious when looking at photos, and this, coupled with natural aging (I was about to turn 33) made me feel different, like a certain softness was gone. I quickly realized that it was the procedure that had changed something in my face and changed my overall look. It took me some time to notice and get used to it. Women who get a lot of fillers have begun to share that they often face this experience, as little by little, the changes become very apparent. Over recent years, microblading is having the same fate, as more women are coming to regret the procedure. Now, over a year later, I have begun speeding up the process for fading the tint, hoping I can get it done naturally. Microblading is a semi-permanent procedure that should fade after a few years. I have used oils and even risky measures like trying to lighten them with hair-lightening products. Still, some people who have gotten microblading say the tint never truly fades, so I'm considering laser removal. Eyebrows Before Microblading Image Source: Amanda Alcántara Eyebrows After Microblading Image Source: Amanda Alcántara Eyebrows Currently Image Source: Amanda Alcántara The procedure, while initially appealing, often leads to dissatisfaction as the results can feel unnatural or too permanent. With time, the ink might even begin to change colors. This regret is compounded by the realization that beauty standards are constantly changing, and what is trendy today may not be tomorrow. What has helped me overcome regret has been acceptance. However, acceptance takes time and is a process on its own. It became evident to me that this is something I needed to embrace, similar to when I started feeling self-conscious about some fine lines and wrinkles I'm getting around my eyes. I had a moment of enlightenment, realizing that this is all a product of the passage of time, and it's part of the process of becoming wiser and more confident in who I am. Embracing the passage of time allowed me to realize that my microbladed eyebrows are also part of my story. If I approach myself with compassion, then I can say, \"My eyebrows are this way because I used to be self-conscious about them before, and that's part of my story.\" Therefore, I can embrace these microblades now. I can allow myself to patiently make the decision of what next steps I will take, whether that is to continue allowing it to fade naturally or perhaps getting laser removal down the line if they don't fade at all. Recently, through this acceptance, I also cut my hair in order to embrace my natural beauty and start a new chapter of self-love, and the change has been refreshing. Ultimately, I've learned to love my eyebrows anew. Even with the microblading, I've accepted myself and the choices I've made. This experience has taught me the importance of self-acceptance and the need to challenge unrealistic beauty standards. It has also allowed me compassion in the face of perfectionism when it comes to feeling like we need to be perfect deconstructed beings - we are not. And the images around me still impact me, which is why the process of unlearning is a daily practice. Amanda Alcántara is a Dominican-American writer and journalist, and the author of \"Chula\" (2019). Her creative writing and journalistic work has been featured in the anthology \"Latinas: Struggles \u0026 Protests in 21st Century USA,\" the poetry anthology \"LatiNext,\" and several news publications.",
  "author": "Amanda Alcántara",
  "published": "Thu, 10 Oct 2024 07:57:47 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Identity",
    "Juntos"
  ],
  "byline": "Amanda Alcántara",
  "length": 6030,
  "excerpt": "In this personal essay I share the cultural pressure I experienced as a Latina to have thicker eyebrows which led me to microblading which I now regret.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "From a young age, Latina girls and young women are bombarded with ideas of what womanhood should look like. Part of this includes the pressure to uphold societal beauty standards that are often impossible to meet. These very standards still align with what is imposed by white supremacy. From the pressure for AfroLatinas to chemically straighten their hair to the push for all Latinas to have curvaceous yet thin bodies, being Latina means striving for desirability. Other standards that define beauty in our communities include having plump lips, light skin, and long, dark, flowy hair. This means that when one has a feature that doesn't fit this standard, it becomes easy to grow an insecurity around it. For me, it was several things, including something seemingly small yet significant: eyebrows. I have always had naturally thin eyebrows with not much hair (still do). From a young age, even when wearing makeup wasn't encouraged for girls, my mother did encourage me to paint my eyebrows like she would do herself. As a Latina, eyebrows are kind of huge for us. Some of the women who were lauded as beautiful and praised for meeting the \"Latina beauty standards\" had big, bushy eyebrows, from Salma Hayek and Gina Torres to Zoe Saldaña. While eyebrows weren't huge in Dominican culture specifically, we were still affected by representations of Latinidad seen in Hollywood. Salma Hayek for example, also played Minerva Mirabal, a Dominican shero, in the film adaptation of Julia Alvarez's book \"In the Time of the Butterflies,\" despite not being Dominican herself. With time, I became insecure, especially as I looked up to feminist icons like Frida Kahlo whose eyebrows were a big part of claiming their pride. These views of Latinidad that were alive during my teenage years were limiting, as they not only imposed harmful beauty standards, but they also painted us all with broad strokes when Latinidad is incredibly diverse. Years later, I was able to deconstruct a lot of these colonial notions, but I failed to realize that eyebrows were a blind spot for me: I was still insecure and never took a moment to understand the root of this insecurity. This is how these harmful beliefs become internalized. So, last year, when the idea of getting my eyebrows microbladed came up, I was excited. I was experiencing changes in my life, from a shift in my career to a change in family dynamics, and I felt that how I looked was something I could control. I found a trusted microblader who used natural, vegetable-based tint. When I first got them done, I felt refreshed and in love with my new look. As time went on, I realized something had changed. I no longer felt as beautiful in photos. I started feeling self-conscious when looking at photos, and this, coupled with natural aging (I was about to turn 33) made me feel different, like a certain softness was gone. I quickly realized that it was the procedure that had changed something in my face and changed my overall look. It took me some time to notice and get used to it. Women who get a lot of fillers have begun to share that they often face this experience, as little by little, the changes become very apparent.Over recent years, microblading is having the same fate, as more women are coming to regret the procedure. Now, over a year later, I have begun speeding up the process for fading the tint, hoping I can get it done naturally. Microblading is a semi-permanent procedure that should fade after a few years. I have used oils and even risky measures like trying to lighten them with hair-lightening products. Still, some people who have gotten microblading say the tint never truly fades, so I'm considering laser removal. Eyebrows Before MicrobladingEyebrows After MicrobladingThe procedure, while initially appealing, often leads to dissatisfaction as the results can feel unnatural or too permanent. With time, the ink might even begin to change colors. This regret is compounded by the realization that beauty standards are constantly changing, and what is trendy today may not be tomorrow.What has helped me overcome regret has been acceptance. However, acceptance takes time and is a process on its own. It became evident to me that this is something I needed to embrace, similar to when I started feeling self-conscious about some fine lines and wrinkles I'm getting around my eyes. I had a moment of enlightenment, realizing that this is all a product of the passage of time, and it's part of the process of becoming wiser and more confident in who I am. Embracing the passage of time allowed me to realize that my microbladed eyebrows are also part of my story. If I approach myself with compassion, then I can say, \"My eyebrows are this way because I used to be self-conscious about them before, and that's part of my story.\" Therefore, I can embrace these microblades now. I can allow myself to patiently make the decision of what next steps I will take, whether that is to continue allowing it to fade naturally or perhaps getting laser removal down the line if they don't fade at all. Recently, through this acceptance, I also cut my hair in order to embrace my natural beauty and start a new chapter of self-love, and the change has been refreshing. Ultimately, I've learned to love my eyebrows anew. Even with the microblading, I've accepted myself and the choices I've made. This experience has taught me the importance of self-acceptance and the need to challenge unrealistic beauty standards. It has also allowed me compassion in the face of perfectionism when it comes to feeling like we need to be perfect deconstructed beings — we are not. And the images around me still impact me, which is why the process of unlearning is a daily practice.Amanda Alcántara is a Dominican-American writer and journalist, and the author of \"Chula\" (2019). Her creative writing and journalistic work has been featured in the anthology \"Latinas: Struggles \u0026 Protests in 21st Century USA,\" the poetry anthology \"LatiNext,\" and several news publications.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/cbrJAA-xwpM_wx--8gdKyZOCc38=/0x828:7935x4994/fit-in/7952x5304/top/filters:format_auto():quality(85):upscale()/2024/10/03/005/n/1922153/ccc692bc66ff23b62c97d3.79176588_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003cp data-element-index=\"0\"\u003eFrom a young age, Latina girls and young women are bombarded with ideas of what womanhood should look like. Part of this includes the pressure to uphold societal beauty standards that are often impossible to meet. These very standards still align with what is imposed by white supremacy. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eFrom the pressure for AfroLatinas to chemically straighten their hair to the push for all Latinas to have curvaceous yet thin bodies, being Latina means striving for desirability. Other standards that define beauty in our communities include having plump lips, light skin, and long, dark, flowy hair. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eThis means that when one has a feature that doesn\u0026#39;t fit this standard, it becomes easy to grow an insecurity around it. For me, it was several things, including something seemingly small yet significant: eyebrows. I have always had naturally thin eyebrows with not much hair (still do). From a young age, even when wearing makeup wasn\u0026#39;t encouraged for girls, my mother did encourage me to paint my eyebrows like she would do herself. \u003c/p\u003e\u003cp data-element-index=\"3\"\u003eAs a Latina, eyebrows are kind of huge for us. Some of the women who were lauded as beautiful and praised for meeting the \u0026#34;Latina beauty standards\u0026#34; had big, bushy eyebrows, from Salma Hayek and Gina Torres to Zoe Saldaña. While eyebrows weren\u0026#39;t huge in Dominican culture specifically, we were still affected by representations of Latinidad seen in Hollywood. Salma Hayek for example, also played Minerva Mirabal, a Dominican shero, in the film adaptation of Julia Alvarez\u0026#39;s book \u0026#34;In the Time of the Butterflies,\u0026#34; despite not being Dominican herself. With time, I became insecure, especially as I looked up to feminist icons like Frida Kahlo whose eyebrows were a big part of claiming their pride. \u003c/p\u003e\u003cp data-element-index=\"4\"\u003eThese views of Latinidad that were alive during my teenage years were limiting, as they not only imposed harmful beauty standards, but they also painted us all with broad strokes when Latinidad is incredibly diverse. Years later, I was able to deconstruct a lot of these colonial notions, but I failed to realize that eyebrows were a blind spot for me: I was still insecure and never took a moment to understand the root of this insecurity. This is how these harmful beliefs become internalized. \u003c/p\u003e\u003cp data-element-index=\"5\"\u003eSo, last year, when the idea of getting my eyebrows microbladed came up, I was excited. I was experiencing changes in my life, from a shift in my career to a change in family dynamics, and I felt that how I looked was something I could control. I found a trusted microblader who used natural, vegetable-based tint. When I first got them done, I felt refreshed and in love with my new look. \u003c/p\u003e\u003cp data-element-index=\"6\"\u003eAs time went on, I realized something had changed. I no longer felt as beautiful in photos. I started feeling self-conscious when looking at photos, and this, coupled with natural aging (I was about to turn 33) made me feel different, like a certain softness was gone. I quickly realized that it was the procedure that had changed something in my face and changed my overall look. It took me some time to notice and get used to it. Women who get a lot of fillers have \u003ca href=\"https://www.theguardian.com/lifeandstyle/2023/may/28/the-tide-has-turned-on-beauty-fillers-but-dont-assume-natural-is-in?ref=popsugar.com\u0026amp;=___psv__p_49398145__t_w__r_www.popsugar.com%2F_\" target=\"_blank\"\u003ebegun to share\u003c/a\u003e that they often face this experience, as little by little, the changes become very apparent.\u003c/p\u003e\u003cp data-element-index=\"7\"\u003eOver recent years, \u003ca href=\"https://www.popsugar.com/beauty/microblading-removal-49333393\"\u003emicroblading is having the same fate\u003c/a\u003e, as more women are coming to regret the procedure. Now, over a year later, I have begun speeding up the process for fading the tint, hoping I can get it done naturally. Microblading is a semi-permanent procedure that should fade after a few years. I have used oils and even risky measures like trying to lighten them with hair-lightening products. Still, some people who have gotten microblading say the tint never truly fades, so I\u0026#39;m considering laser removal. \u003c/p\u003e\u003cp data-element-index=\"8\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eEyebrows Before Microblading\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\" data-element-has-beginning-title=\"true\" data-element-has-ending-title=\"true\"\u003e\u003cp data-element-index=\"0\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eEyebrows After Microblading\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"9\"\u003e\u003cp data-element-index=\"0\"\u003eThe procedure, while initially appealing, often leads to dissatisfaction as the results can feel unnatural or too permanent. With time, the ink might even begin to change colors. This regret is compounded by the realization that beauty standards are constantly changing, and what is trendy today may not be tomorrow.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eWhat has helped me overcome regret has been acceptance. However, acceptance takes time and is a process on its own. It became evident to me that this is something I needed to embrace, similar to when I started feeling self-conscious about some fine lines and wrinkles I\u0026#39;m getting around my eyes. I had a moment of enlightenment, realizing that this is all a product of the passage of time, and it\u0026#39;s part of the process of becoming wiser and more confident in who I am. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eEmbracing the passage of time allowed me to realize that my microbladed eyebrows are also part of my story. If I approach myself with compassion, then I can say, \u0026#34;My eyebrows are this way because I used to be self-conscious about them before, and that\u0026#39;s part of my story.\u0026#34; Therefore, I can embrace these microblades now. I can allow myself to patiently make the decision of what next steps I will take, whether that is to continue allowing it to fade naturally or perhaps getting laser removal down the line if they don\u0026#39;t fade at all. \u003c/p\u003e\u003cp data-element-index=\"3\"\u003eRecently, through this acceptance, I also cut my hair in order to embrace my natural beauty and start a new chapter of self-love, and the change has been refreshing. Ultimately, I\u0026#39;ve learned to love my eyebrows anew. Even with the microblading, I\u0026#39;ve accepted myself and the choices I\u0026#39;ve made. This experience has taught me the importance of self-acceptance and the need to challenge unrealistic beauty standards. It has also allowed me compassion in the face of perfectionism when it comes to feeling like we need to be perfect deconstructed beings — we are not. And the images around me still impact me, which is why the process of unlearning is a daily practice.\u003c/p\u003e\u003cp data-element-index=\"5\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/amandaalcantara\"\u003eAmanda Alcántara\u003c/a\u003e is a Dominican-American writer and journalist, and the author of \u0026#34;Chula\u0026#34; (2019). Her creative writing and journalistic work has been featured in the anthology \u0026#34;Latinas: Struggles \u0026amp; Protests in 21st Century USA,\u0026#34; the poetry anthology \u0026#34;LatiNext,\u0026#34; and several news publications.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-10T14:57:48Z",
  "modifiedTime": "2024-10-10T14:57:48Z"
}
