{
  "id": "6304f570-bdf6-4a79-a6f9-3eb17d0785e2",
  "title": "ITG Goes To Fashion Week – Fall ‘25 Edition",
  "link": "https://intothegloss.com/2025/02/nyfw-best-beauty-fall-winter-2025/",
  "description": "Feat. Diotima, Sandy Liang, Luar + Christopher John Rogers (and more!)",
  "author": "",
  "published": "Thu, 20 Feb 2025 10:30:00 -0500",
  "source": "https://feeds.feedburner.com/intothegloss/oqoU",
  "categories": null,
  "byline": "Into The Gloss",
  "length": 7876,
  "excerpt": "Feat. Diotima, Sandy Liang, Luar, Christopher John Rogers + more",
  "siteName": "Into The Gloss",
  "favicon": "https://assets2.intothegloss.com/assets/misc/favicon-c5289286f05468868b306868af5d5003.png",
  "text": "Photographed by Emma Craft.There was a moment at the start of fashion week where we were getting worried. Don’t get us wrong, we love a clean, minimal look, but we also love variety. So when the week glided off to a “clean girl aesthetic” start, the thought crossed our minds that we could be headed into another season of muted tones, polished hair, and barely-there makeup. Thankfully that thought bubble popped almost immediately after we found our way to Chistopher John Rogers’ Brooklyn Navy Yard show. Color! Extra hair hanging on the wall in bags! Nails that weren’t nude! Baby, we were back. So we asked photographer Emma Craft to capture this season for ITG. Below, her work, and our thoughts on the looks that caught our eye. –Ashley Weatherford and Daise Bedolla Brandon MaxwellThe scene at Brandon Maxwell, which called for a 9:30am arrival time backstage, was surprisingly chill—the backstage theatrics we were promised from the likes of Project Runway and America’s Next Top Model were nowhere to be seen. Instead, lead makeup artist Fulvia Farolfi and her team quietly plugged away on a very minimal look. The drama-free makeup was anchored by a wash of Merit products, including their much-talked-about blush balm in Terracotta, which, after a hiatus, returned to store shelves just in time to coincide with fashion week. On nails, Jin Soon went for a bare look that was not actually bare—a clear matte top cat was involved. And then there was the hair, which also kept a literal low profile in a neck-grazing bun. Christopher John RogersChristopher John Rogers hasn’t had a show in two years—five if you’re counting NYFW specifically—which meant everyone was excited to see what he was cooking up backstage. We first saw Jin Soon again, who had conjured up three colorful earth-tone manicures this time. On the makeup front, Alex Levy and MAC constructed what they called “a galactic lip” on some models, which was a layer cake of teal or olive eyeliners and shadows, topped with clear gloss. And then a handful of models were given a bright, cherry red lip. This was all balanced with a lot of sleek hairstyles that were parted down the middle in an almost basket weave-like manner. Using a slew of Bumble and Bumble products, hairstylist Sonny Molina wanted models to play up the idea of a woman in charge, so he decided on a “severe bang” for a few. The exaggerated bangs were stored in little baggies next to their intended models ahead of the show. And then one by one, a hairstylist would take the bag back to their station, like a kid with their afternoon snack, ready to dive in. Sandy LiangAside from the bright pops of blue, pink, chartreuse, and purples that dotted the models eyelids, courtesy of makeup artist Fara Homidi and her team, the best part about the Sandy Liang beauty look was the hair. Amika hairstylist Evanie Frausto wanted a “really hot hair look,” in both the literal and sexy-hot senses of the word. Literally, he imagined a New York girl getting off from work after a long summer day at the office. A little sweaty, she’d throw her hair up in a ponytail or a claw clip. Basically, this is the look for those of us who never quite learned to do our hair (us included). Evanie Frausto used Amika’s Fluxus hairspray, Headstrong hairspray, and Superfruit Star styling oil. The models’ skin was prepped with Facile’s Core Four—the Bare Necessity gel cleanser, Barely There moisturizer, Dew You serum, and Lip Jelly moisturizer—before they got “mannequin latex lips” and “doll eyes” from Fara Homidi and her team using custom mixed colors.Ulla JohnsonTresemmé’s hairstylist Mustafa Yanaz and Sisley’s makeup artist Romy Soleimani kept things relatively simple for Ulla Johnson, whose designs were far more intricate with varying textures and gold accents. Yanaz wanted to work with the models’ natural hair texture to create the “best version of themselves.” That meant some wore “wind-kissed waves” while others wore “hidden fishtails,” some of which took three or four times to perfect. Soleimani gave the models blink-and-you’ll-miss-it cat eye wings with either “barely there” or deep mulberry lips. The key to both is to blur the edges of the lips lightly using the tips of your fingers. Soleimani prepped the models with Sisley’s Lyslait cleansing milk, Floral toning lotion, Nutritive lip balm, Mattifying moisturizing skincare, and Velvet nourishing cream before applying a light layer of Phyto-Teint Perfection foundation, Phyto Cernes Eclat concealer, and Blur Expert powder. The model’s small cat eye wing was drawn on with the Ligne Noire eyeliner. Yanaz used Tresemmé’s All-In-One Style Primer, Plumping mousse, Smoothing cream, A-List Workable hairspray, Dry texturizing spray, and A-List hair fragrance.MeruertYou couldn’t help but feel a little bit like Alice in Wonderland backstage at Meruert. Was it the hair? (Yes, it definitely was the hair.) Most models got their baby hairs coiled and lacquered to their forehead, but a few really went the extra mile with braided extensions that were piled on top of each other to make a leaning tower of Kanekalon. Even though it was only the middle of fashion week, Kanako Takase, the creative director from Addiction Tokyo who engineered the makeup look, wanted the models to embrace an \"exhausted beauty” look. So shadows of red and brown were dusted under the eyes and towards the temples. The wacky hair meshed with the shadowy makeup really caught you off guard, which was not not welcome. A backstage that surprises you is always a backstage worth the trip.LuarThis show was so cool and a real throwback to the cut creases of yesteryear. MAC (under the direction of Terry Barber) was on hand again to re-create what they called “DIY club drag” for some, where a matte white eyeshadow extended up to the brow bone. Others got a more sculpted cheekbones look, where contour powder took center stage under the cheeks and around the forehead. Jawara took the lead to make the hair really have a moment. Some models had sleek buns, a few walked out with cornrows, and a handful had a really standout moment—brushed up pieces in the front, and a low bun in the back. All the texture products came to play here—Tresemmé mousse, gel, and texturizing spray keyed the look. And we can’t forget to talk about the nails. They were four inches long and feathered. You know, low key. DiotimaThe first thing we noticed about the last show we saw were the wigs. Rows of them sat perched on mannequins in front of a wall that read “Diotima Matriarch,” which was a nod to the inspiration of the evening—the work of artist Dawoud Bey in which he photographed a family’s matriarch wearing hair rollers in the kitchen. Oribe hairstylist Joey George built on the style by deconstructing some of the curls, as if they had become slightly undone through the course of an evening. Meanwhile, the staples of makeup artist Kanako’s look for the models included a deep burgundy blush from Addiction Tokyo—to lean into the “rage” and “rebellion” behind the collection—and a glossy black rose petal, a nod to the small, shiny, black roses on some of the designs, worn only on one eye. For the first look, makeup artist Kanako used Addiction Tokyo’s The Liquid Blush Foggy in Brand New You and Stray Girl for a deep burgundy cheek. For the second look, she used The Eyeshadow in Cinnamon on the eyes and The Blush in Raspberry Chocolate and Kiss The Night for the cheeks. On the nails, models wore either The Nail Polish in Red Dress or The Nail Polish in Calm World with Shanghai Romance, as chosen by nail artist Naomi Yasuda. Hairstylist Joey George used an Oribe Italian resin flat brush to prep the wigs, along with the Hair Alchemy treatment serum, Maximista spray, Imperméable anti-humidity spray, and Superfine strong hair spray. More: hair stylistsHairMakeupmodel in makeupNailsBackstage",
  "image": "https://images.ctfassets.net/g8qtv9gzg47d/5NJz7uLdUjYuQWfgW09HL6/842aeea430a5f5b875111a293273aa3a/_DSC7491.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/2E1ydSM8cvOeunljpERKG0/e3522367295c8362deca4619437eeab2/_DSC7060.jpg\" alt=\" dsc7060\"/\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/4iybX7iLwRbgBHhfX7xf5X/39e986dd8c7e010081810d9b90c2ee59/_DSC7194.jpg\" alt=\" dsc7194\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/2E1ydSM8cvOeunljpERKG0/e3522367295c8362deca4619437eeab2/_DSC7060.jpg\" alt=\" dsc7060\"/\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/4vHLsxoBwPfdwf5vonjxFA/4a7af20d34b2ae66515e55848fd90c47/_DSC7510_copy.jpg\" alt=\" dsc7510 copy\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/4iybX7iLwRbgBHhfX7xf5X/39e986dd8c7e010081810d9b90c2ee59/_DSC7194.jpg\" alt=\" dsc7194\"/\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/1lEOveb4dindItufqbMC3J/aaf2843f2328af804a7bb025bf161f76/_DSC7564.jpg\" alt=\" dsc7564\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003ePhotographed by Emma Craft.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere was a moment at the start of fashion week where we were getting worried. Don’t get us wrong, we love a clean, minimal look, but we also love \u003cem\u003evariety\u003c/em\u003e. So when the week glided off to a “clean girl aesthetic” start, the thought crossed our minds that we could be headed into another season of muted tones, polished hair, and barely-there makeup. Thankfully that thought bubble popped almost immediately after we found our way to Chistopher John Rogers’ Brooklyn Navy Yard show. Color! Extra hair hanging on the wall in bags! Nails that weren’t nude! Baby, we were back. So we asked photographer Emma Craft to capture this season for ITG. Below, her work, and our thoughts on the looks that caught our eye. –Ashley Weatherford and Daise Bedolla\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/1lEOveb4dindItufqbMC3J/aaf2843f2328af804a7bb025bf161f76/_DSC7564.jpg\" alt=\" dsc7564\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eBrandon Maxwell\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eThe scene at Brandon Maxwell, which called for a 9:30am arrival time backstage, was surprisingly chill—the backstage theatrics we were promised from the likes of \u003cem\u003eProject Runway\u003c/em\u003e and \u003cem\u003eAmerica’s Next Top Model\u003c/em\u003e were nowhere to be seen. Instead, lead makeup artist Fulvia Farolfi and her team quietly plugged away on a very minimal look. The drama-free makeup was anchored by a wash of Merit products, including their much-talked-about blush balm in \u003cem\u003eTerracotta\u003c/em\u003e, which, after a hiatus, returned to store shelves just in time to coincide with fashion week. On nails, Jin Soon went for a bare look that was not actually bare—a clear matte top cat was involved. And then there was the hair, which also kept a literal low profile in a neck-grazing bun. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eChristopher John Rogers\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eChristopher John Rogers hasn’t had a show in two years—five if you’re counting NYFW specifically—which meant everyone was excited to see what he was cooking up backstage. We first saw Jin Soon again, who had conjured up three colorful earth-tone manicures this time. On the makeup front, Alex Levy and MAC constructed what they called “a galactic lip” on some models, which was a layer cake of teal or olive eyeliners and shadows, topped with clear gloss. And then a handful of models were given a bright, cherry red lip. This was all balanced with a lot of sleek hairstyles that were parted down the middle in an almost basket weave-like manner. Using a slew of Bumble and Bumble products, hairstylist Sonny Molina wanted models to play up the idea of a woman in charge, so he decided on a “severe bang” for a few. The exaggerated bangs were stored in little baggies next to their intended models ahead of the show. And then one by one, a hairstylist would take the bag back to their station, like a kid with their afternoon snack, ready to dive in. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eSandy Liang\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eAside from the bright pops of blue, pink, chartreuse, and purples that dotted the models eyelids, courtesy of makeup artist \u003ca href=\"https://intothegloss.com/2024/05/fara-homidi-beauty-make-up-artist-top-shelf/\" rel=\"nofollow\" target=\"_blank\"\u003eFara Homidi\u003c/a\u003e and her team, the best part about the \u003ca href=\"https://intothegloss.com/2016/03/sandy-liang/\" rel=\"nofollow\" target=\"_blank\"\u003eSandy Liang\u003c/a\u003e beauty look was the hair. Amika hairstylist Evanie Frausto wanted a “really hot hair look,” in both the literal and sexy-hot senses of the word. Literally, he imagined a New York girl getting off from work after a long summer day at the office. A little sweaty, she’d throw her hair up in a ponytail or a claw clip. Basically, this is the look for those of us who never quite learned to do our hair (us included). \u003c/p\u003e\n\u003cp\u003e\u003cem\u003eEvanie Frausto used Amika’s Fluxus hairspray, Headstrong hairspray, and Superfruit Star styling oil. The models’ skin was prepped with Facile’s Core Four—the Bare Necessity gel cleanser, Barely There moisturizer, Dew You serum, and Lip Jelly moisturizer—before they got “mannequin latex lips” and “doll eyes” from Fara Homidi and her team using custom mixed colors.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eUlla Johnson\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eTresemmé’s hairstylist Mustafa Yanaz and Sisley’s makeup artist \u003ca href=\"https://intothegloss.com/2016/09/how-to-color-correct/\" rel=\"nofollow\" target=\"_blank\"\u003eRomy Soleimani\u003c/a\u003e kept things relatively simple for \u003ca href=\"https://intothegloss.com/2016/06/ulla-johnson/\" rel=\"nofollow\" target=\"_blank\"\u003eUlla Johnson\u003c/a\u003e, whose designs were far more intricate with varying textures and gold accents. Yanaz wanted to work with the models’ natural hair texture to create the “best version of themselves.” That meant some wore “wind-kissed waves” while others wore “hidden fishtails,” some of which took three or four times to perfect. Soleimani gave the models blink-and-you’ll-miss-it cat eye wings with either “barely there” or deep mulberry lips. The key to both is to blur the edges of the lips lightly using the tips of your fingers.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSoleimani prepped the models with Sisley’s Lyslait cleansing milk, Floral toning lotion, Nutritive lip balm, Mattifying moisturizing skincare, and Velvet nourishing cream before applying a light layer of Phyto-Teint Perfection foundation, Phyto Cernes Eclat concealer, and Blur Expert powder. The model’s small cat eye wing was drawn on with the Ligne Noire eyeliner. Yanaz used Tresemmé’s All-In-One Style Primer, Plumping mousse, Smoothing cream, A-List Workable hairspray, Dry texturizing spray, and A-List hair fragrance.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eMeruert\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eYou couldn’t help but feel a little bit like Alice in Wonderland backstage at Meruert. Was it the hair? (Yes, it definitely was the hair.) Most models got their baby hairs coiled and lacquered to their forehead, but a few really went the extra mile with braided extensions that were piled on top of each other to make a leaning tower of Kanekalon. Even though it was only the middle of fashion week, Kanako Takase, the creative director from Addiction Tokyo who engineered the makeup look, wanted the models to embrace an \u0026#34;exhausted beauty” look. So shadows of red and brown were dusted under the eyes and towards the temples. The wacky hair meshed with the shadowy makeup really caught you off guard, which was not \u003cem\u003enot\u003c/em\u003e welcome. A backstage that surprises you is always a backstage worth the trip.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eLuar\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eThis show was so cool and a real throwback to the cut creases of yesteryear. MAC (under the direction of Terry Barber) was on hand again to re-create what they called “DIY club drag” for some, where a matte white eyeshadow extended up to the brow bone. Others got a more sculpted cheekbones look, where contour powder took center stage under the cheeks and around the forehead. Jawara took the lead to make the hair really have a moment. Some models had sleek buns, a few walked out with cornrows, and a handful had a really standout moment—brushed up pieces in the front, and a low bun in the back. All the texture products came to play here—Tresemmé mousse, gel, and texturizing spray keyed the look. And we can’t forget to talk about the nails. They were four inches long and feathered. You know, low key. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eDiotima\u003c/h2\u003e\u003c/p\u003e\u003cng-slick-slider ng-arrows=\"true\" ng-center=\"true\" ng-fade=\"false\" ng-progress=\"true\"\u003e\u003c/ng-slick-slider\u003e\u003cdiv\u003e\u003cp\u003eThe first thing we noticed about the last show we saw were the wigs. Rows of them sat perched on mannequins in front of a wall that read “Diotima Matriarch,” which was a nod to the inspiration of the evening—the work of artist Dawoud Bey in which he photographed a family’s matriarch wearing hair rollers in the kitchen. Oribe hairstylist Joey George built on the style by deconstructing some of the curls, as if they had become slightly undone through the course of an evening. Meanwhile, the staples of makeup artist Kanako’s look for the models included a deep burgundy blush from Addiction Tokyo—to lean into the “rage” and “rebellion” behind the collection—and a glossy black rose petal, a nod to the small, shiny, black roses on some of the designs, worn only on one eye.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eFor the first look, makeup artist Kanako used Addiction Tokyo’s The Liquid Blush Foggy in Brand New You and Stray Girl for a deep burgundy cheek. For the second look, she used The Eyeshadow in Cinnamon on the eyes and The Blush in Raspberry Chocolate and Kiss The Night for the cheeks. On the nails, models wore either The Nail Polish in Red Dress or The Nail Polish in Calm World with Shanghai Romance, as chosen by nail artist Naomi Yasuda. Hairstylist Joey George used an Oribe Italian resin flat brush to prep the wigs, along with the Hair Alchemy treatment serum, Maximista spray, Imperméable anti-humidity spray, and Superfine strong hair spray.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cul\u003e\n\t\u003cli\u003eMore: \n\t\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://intothegloss.com/tags/hair-stylists/\"\u003ehair stylists\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://intothegloss.com/tags/hair/\"\u003eHair\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://intothegloss.com/tags/makeup/\"\u003eMakeup\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://intothegloss.com/tags/model-in-makeup/\"\u003emodel in makeup\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://intothegloss.com/tags/nails/\"\u003eNails\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://intothegloss.com/tags/backstage/\"\u003eBackstage\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-02-20T10:30:00-05:00",
  "modifiedTime": null
}
