{
  "id": "64fdefdb-fc76-41da-a040-ac94e8082d41",
  "title": "The Ordinary Is Bringing Back This Discontinued Fan-Favorite Product",
  "link": "https://www.refinery29.com/en-us/the-ordinary-hyaluronic-acid-serum-original?utm_source=feed\u0026utm_medium=rss",
  "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Last year, I had the opportunity to travel to Toronto to hear all about The Ordinary’s newly reformulated Hyaluronic Acid 2% + B5 serum, which had been “renovated” to reduce tackiness and improve hydration levels thanks to the addition of ceramides in the formula. I loved it, but no matter how good a reformulation is, one thing is almost certainly guaranteed: People — many of them — will be left heartbroken and pine for the original. (Ahem, Givenchy Prisme Libre.) Well, we’ve got some very good news to report: As of today (and just in time for spooky season), The Ordinary has officially resurrected its original Hyaluronic Acid 2% + B5 serum from the grave. (After all, nothing’s scarier than dry, unhappy skin.) While this is not replacing the new version, the brand heard feedback and decided to do something about it. “When Hyaluronic Acid 2% + B5 with Ceramides was launched, we heard from some loyal community members that they, in fact, preferred the original formulation,” Nicola Kilner, the co-founder and CEO of DECIEM, parent company of The Ordinary, exclusively tells Refinery29. “[They] found that the original worked well for their skin type and concerns and had been avid users for a long time, therefore the change didn’t suit their regimen as it once had.” Kilner adds that fans of the OG formula didn’t necessarily dislike the new version, either — they just wanted options. Hyaluronic Acid 2% + B5 (Original Formulation), $6 While it’s music to our ears, at the same time, the decision is not entirely surprising. After all, hyaluronic acid is somewhat of a divisive skincare ingredient in beauty circles. Still, you don’t see many brands keeping two versions of the same product to appease customers, especially when certain concerns led to it being remade in the first place. The Ordinary’s reformulated hyaluronic acid serum was born from some consumers disliking the sticky texture. “We are always listening to feedback across our social channels and reviews, and so are thrilled to be able to act on both asks, the new and the original,” Kilner explains. “However, with so many loyal fans of the original formulation expressing that they preferred the simpler formulation’s texture and results, we decided to bring it back and offer our community the choice between the two.” As for how the brand plans to avoid confusion among the two versions, Kilner shared that Deciem plans to include clear labeling differences on the packaging and online product pages, in addition to outlining the different claims with each version. (With the addition of ceramides, the brand claims that the reformulated version has added support for the skin barrier, plus improvement in the appearance of fine lines, skin elasticity, and suppleness.) That’s not even the best part: The Ordinary’s Hyaluronic Acid 2% + B5 is not just being brought back, but at its original price of $6. (The reformulated version retails at $9.90 a bottle.) “This is to ensure we remain accessible to customers.” Kilner says. “The slightly higher price of Hyaluronic Acid 2% + B5 with Ceramides reflects the more complex formulation, which includes an additional form of hydrolyzed hyaluronic acid and ceramides. The lower price of Hyaluronic Acid 2% + B5 reflects the more simple formulation, which contains four forms of hyaluronic acid and pro-vitamin B5.” As for when you’ll be able to reunite with the iconic HA serum? You can currently shop it on The Ordinary’s website, with a rollout to The Ordinary stores and select retailers to follow. Like what you see? How about some more R29 goodness, right here?",
  "author": "Karina Hoshikawa",
  "published": "Thu, 10 Oct 2024 16:31:56 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Karina Hoshikawa",
  "length": 3667,
  "excerpt": "The Ordinary is bringing back the original formulation of its Hyaluronic Acid 2% + B5 serum, and we have all the details.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Photo: Courtesy of The Ordinary.Last year, I had the opportunity to travel to Toronto to hear all about The Ordinary’s newly reformulated Hyaluronic Acid 2% + B5 serum, which had been “renovated” to reduce tackiness and improve hydration levels thanks to the addition of ceramides in the formula. I loved it, but no matter how good a reformulation is, one thing is almost certainly guaranteed: People — many of them — will be left heartbroken and pine for the original. (Ahem, Givenchy Prisme Libre.)Well, we’ve got some very good news to report: As of today (and just in time for spooky season), The Ordinary has officially resurrected its original Hyaluronic Acid 2% + B5 serum from the grave. (After all, nothing’s scarier than dry, unhappy skin.) While this is not replacing the new version, the brand heard feedback and decided to do something about it. “When Hyaluronic Acid 2% + B5 with Ceramides was launched, we heard from some loyal community members that they, in fact, preferred the original formulation,” Nicola Kilner, the co-founder and CEO of DECIEM, parent company of The Ordinary, exclusively tells Refinery29. “[They] found that the original worked well for their skin type and concerns and had been avid users for a long time, therefore the change didn’t suit their regimen as it once had.” Kilner adds that fans of the OG formula didn’t necessarily dislike the new version, either — they just wanted options.AdvertisementADVERTISEMENTWhile it’s music to our ears, at the same time, the decision is not entirely surprising. After all, hyaluronic acid is somewhat of a divisive skincare ingredient in beauty circles. Still, you don’t see many brands keeping two versions of the same product to appease customers, especially when certain concerns led to it being remade in the first place. The Ordinary’s reformulated hyaluronic acid serum was born from some consumers disliking the sticky texture. “We are always listening to feedback across our social channels and reviews, and so are thrilled to be able to act on both asks, the new and the original,” Kilner explains. “However, with so many loyal fans of the original formulation expressing that they preferred the simpler formulation's texture and results, we decided to bring it back and offer our community the choice between the two.” As for how the brand plans to avoid confusion among the two versions, Kilner shared that Deciem plans to include clear labeling differences on the packaging and online product pages, in addition to outlining the different claims with each version. (With the addition of ceramides, the brand claims that the reformulated version has added support for the skin barrier, plus improvement in the appearance of fine lines, skin elasticity, and suppleness.)That’s not even the best part: The Ordinary’s Hyaluronic Acid 2% + B5 is not just being brought back, but at its original price of $6. (The reformulated version retails at $9.90 a bottle.) “This is to ensure we remain accessible to customers.” Kilner says. “The slightly higher price of Hyaluronic Acid 2% + B5 with Ceramides reflects the more complex formulation, which includes an additional form of hydrolyzed hyaluronic acid and ceramides. The lower price of Hyaluronic Acid 2% + B5 reflects the more simple formulation, which contains four forms of hyaluronic acid and pro-vitamin B5.” As for when you’ll be able to reunite with the iconic HA serum? You can currently shop it on The Ordinary’s website, with a rollout to The Ordinary stores and select retailers to follow.",
  "image": "https://www.refinery29.com/images/11792909.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-main-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of The Ordinary.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLast year, I had the opportunity to travel to Toronto to hear all about \u003ca href=\"https://www.refinery29.com/en-us/the-ordinary-hyaluronic-acid-serum-review\"\u003eThe Ordinary’s newly reformulated Hyaluronic Acid 2% + B5 serum\u003c/a\u003e, which had been “renovated” to reduce tackiness and improve hydration levels thanks to the addition of \u003ca href=\"https://www.refinery29.com/en-us/the-ordinary-natural-moisturizing-factors-phytoceramides-review\"\u003eceramides\u003c/a\u003e in the formula. I loved it, but no matter how good a reformulation is, one thing is almost certainly guaranteed: People — many of them — will be left heartbroken and pine for the original. (Ahem, Givenchy Prisme Libre.)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWell, we’ve got some \u003cem\u003every\u003c/em\u003e good news to report: As of today (and just in time for spooky season), The Ordinary has officially resurrected its original \u003ca href=\"https://theordinary.com/en-us/hyaluronic-acid-2-b5-serum-original-formulation-100425.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eHyaluronic Acid 2% + B5 serum\u003c/a\u003e from the grave. (After all, nothing’s scarier than dry, unhappy skin.) While this is not replacing the new version, the brand heard feedback and decided to do something about it. “When \u003ca href=\"https://theordinary.com/en-us/hyaluronic-acid-2-b5-serum-with-ceramides-100637.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eHyaluronic Acid 2% + B5 with Ceramides\u003c/a\u003e was launched, we heard from some loyal community members that they, in fact, preferred the original formulation,” Nicola Kilner, the co-founder and CEO of DECIEM, parent company of The Ordinary, exclusively tells Refinery29. “[They] found that the original worked well for their skin type and concerns and had been avid users for a long time, therefore the change didn’t suit their regimen as it once had.” Kilner adds that fans of the OG formula didn’t necessarily dislike the new version, either — they just wanted options.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhile it’s music to our ears, at the same time, the decision is not entirely surprising. After all, hyaluronic acid is somewhat of a divisive skincare ingredient in beauty circles. Still, you don’t see many brands keeping two versions of the same product to appease customers, especially when certain concerns led to it being remade in the first place. The Ordinary’s \u003ca href=\"https://theordinary.com/en-us/hyaluronic-acid-2-b5-serum-with-ceramides-100637.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ereformulated hyaluronic acid serum\u003c/a\u003e was born from some consumers disliking the sticky texture. “We are always listening to feedback across our social channels and reviews, and so are thrilled to be able to act on both asks, the new and the original,” Kilner explains. “However, with so many loyal fans of the \u003ca href=\"https://theordinary.com/en-us/hyaluronic-acid-2-b5-serum-original-formulation-100425.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eoriginal formulation\u003c/a\u003e expressing that they preferred the simpler formulation\u0026#39;s texture and results, we decided to bring it back and offer our community the choice between the two.” As for how the brand plans to avoid confusion among the two versions, Kilner shared that Deciem plans to include clear labeling differences on the packaging and online product pages, in addition to outlining the different claims with each version. (With the addition of ceramides, the brand claims that the reformulated version has added support for the skin barrier, plus improvement in the appearance of fine lines, skin elasticity, and suppleness.)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThat’s not even the best part: \u003ca href=\"https://theordinary.com/en-us/hyaluronic-acid-2-b5-serum-original-formulation-100425.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eThe Ordinary’s Hyaluronic Acid 2% + B5\u003c/a\u003e is not just being brought back, but at its original price of $6. (The reformulated version retails at $9.90 a bottle.) “This is to ensure we remain accessible to customers.” Kilner says. “The slightly higher price of Hyaluronic Acid 2% + B5 with Ceramides reflects the more complex formulation, which includes an additional form of hydrolyzed hyaluronic acid and ceramides. The lower price of Hyaluronic Acid 2% + B5 reflects the more simple formulation, which contains four forms of hyaluronic acid and pro-vitamin B5.” As for when you’ll be able to reunite with the iconic HA serum? You can currently shop it on The Ordinary’s website, with a rollout to The Ordinary stores and select retailers to follow.\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-10T16:31:56Z",
  "modifiedTime": null
}
