{
  "id": "6664402d-6f92-4215-ae1d-187fdb738ec9",
  "title": "Run, Don’t Walk: Nordstrom’s Entire Beauty Section Is On Sale",
  "link": "https://www.refinery29.com/en-us/nordstrom-beauty-sale-products?utm_source=feed\u0026utm_medium=rss",
  "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. This is not a drill: Reader-favorite Nordstrom just blessed us with a sitewide sale on its A+ beauty assortment. From now through March 30, you can score 15% off almost all the retailer’s hair, makeup, skincare, fragrance, and more. (Bonus: Nordy Club members get triple points on all beauty.)  Nordstrom is home to some of the best names in beauty — think Charlotte Tilbury, Nars, La Mer, Nécessaire — all marked down for this extra-special spring sale: (A few brands and products are excluded, including Chanel, Dyson, Shark, Sisley Paris, Victoria Beckham Beauty, and more.) With pages of covetable beauty picks to sift through, we did the legwork and rounded up 10 must-shop finds from Nordstrom’s major beauty blowout. DashDividers_1_500x100 Nécessaire The Body Wash, $28 $23.80 If we had to choose one product from editor-beloved Nécessaire, it would be this one. This luxurious body wash comes in subtle scents like santal, hinoki, and eucalyptus, setting the stage for your ultimate everything shower.  Clinique Almost Lipstick, $25 $21.25 TikTok made it famous, but Black Honey’s real power is in its universal appeal. The sheer, warm cherry-brown shade is truly a one-swipe wonder — no mirror needed.  La Mer Crème de la Mer Moisturizing Cream, $200 $170 A rare discount on La Mer’s iconic cream is no small deal. Infused with the brand’s proprietary Miracle Broth, this decadent formula leaves skin feeling softer, smoother, and naturally radiant. Nars Radiant Creamy Concealer, $32 $27.20 This cult-favorite concealer has outlasted others for a reason With its skin-like finish and never-cakey coverage, it’s in a league of its own. Supergoop! Glowscreen SPF 40 Broad Spectrum Sunscreen, $38 $32.30 Turn up the glow with Supergoop!’s highlighter-sunscreen hybrid. With broad-spectrum SPF 40 protection and a luminous finish, it’s a summer essential in shades like rose gold, champagne, and bronze. Dior Addict Lip Glow Balm, $40 $34 It doesn’t get more posh than Dior’s Lip Glow Balm, closely resembling an objet d’art more than a lip balm. Housed in a vintage-inspired tube, this pH-reactive balm delivers a sheer tint that adjusts to your unique tone — choose from pale pink, icy blue, tangerine, and more. Olaplex Nº9 Bond Protector Nourishing Hair Serum, $30 $25.50 Olaplex’s bond-building magic now comes in serum form. Lightweight and hydrating, it shields hair from heat up to 450° while leaving strands smooth and nourished. Westman Atelier Baby Cheeks Blush Stick, $48 $40.80 Cream blush done right. Gucci Westman’s Baby Cheeks blends like a dream and comes in a range of flawless shades — the perfect addition to your spring routine. ​​Charlotte Tilbury Lip Cheat Lip Liner, $25 $21.25 There’s a reason Charlotte Tilbury’s lip pencil has cult status — the ultra-creamy, long-wearing formula perfects your pout with precise, pigmented definition. Gucci Flora Gorgeous Gardenia Eau de Parfum, $138 $117.30 Floral perfumes just hit different. Gucci’s Flora Gorgeous Garden blends white florals, jasmine, and pear blossom for a bright garden party mood. Like what you see? How about some more R29 goodness, right here?You Can Finally Shop Ultra Violette In The U.S.Shark Beauty Perfected the LED MaskWhat We're Buying From Amazon’s Big Spring Sale",
  "author": "Karina Hoshikawa",
  "published": "Tue, 25 Mar 2025 17:22:19 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Karina Hoshikawa",
  "length": 2456,
  "excerpt": "Nordstrom is having a sitewide sale on all things beauty, and here's what we're shopping from top brands across skincare, makeup, hair, fragrance, and more.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Nordstrom is home to some of the best names in beauty — think Charlotte Tilbury, Nars, La Mer, Nécessaire — all marked down for this extra-special spring sale: (A few brands and products are excluded, including Chanel, Dyson, Shark, Sisley Paris, Victoria Beckham Beauty, and more.) With pages of covetable beauty picks to sift through, we did the legwork and rounded up 10 must-shop finds from Nordstrom’s major beauty blowout.AdvertisementADVERTISEMENTIf we had to choose one product from editor-beloved Nécessaire, it would be this one. This luxurious body wash comes in subtle scents like santal, hinoki, and eucalyptus, setting the stage for your ultimate everything shower. TikTok made it famous, but Black Honey’s real power is in its universal appeal. The sheer, warm cherry-brown shade is truly a one-swipe wonder — no mirror needed. A rare discount on La Mer’s iconic cream is no small deal. Infused with the brand’s proprietary Miracle Broth, this decadent formula leaves skin feeling softer, smoother, and naturally radiant.This cult-favorite concealer has outlasted others for a reason With its skin-like finish and never-cakey coverage, it’s in a league of its own.Turn up the glow with Supergoop!’s highlighter-sunscreen hybrid. With broad-spectrum SPF 40 protection and a luminous finish, it’s a summer essential in shades like rose gold, champagne, and bronze.It doesn’t get more posh than Dior’s Lip Glow Balm, closely resembling an objet d’art more than a lip balm. Housed in a vintage-inspired tube, this pH-reactive balm delivers a sheer tint that adjusts to your unique tone — choose from pale pink, icy blue, tangerine, and more.AdvertisementADVERTISEMENTOlaplex’s bond-building magic now comes in serum form. Lightweight and hydrating, it shields hair from heat up to 450° while leaving strands smooth and nourished.Cream blush done right. Gucci Westman’s Baby Cheeks blends like a dream and comes in a range of flawless shades — the perfect addition to your spring routine.There’s a reason Charlotte Tilbury’s lip pencil has cult status — the ultra-creamy, long-wearing formula perfects your pout with precise, pigmented definition.Floral perfumes just hit different. Gucci’s Flora Gorgeous Garden blends white florals, jasmine, and pear blossom for a bright garden party mood.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11871371.jpg?crop=2856%2C1500%2Cx839%2Cy0",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-main-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eNordstrom is home to some of the best names in beauty — think Charlotte Tilbury, Nars, La Mer, Nécessaire — all marked down for this \u003ca href=\"https://www.nordstrom.com/browse/sale/beauty?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eextra-special spring sale\u003c/a\u003e: (A few brands and products are excluded, including Chanel, Dyson, Shark, Sisley Paris, Victoria Beckham Beauty, and more.) With pages of covetable beauty picks to sift through, we did the legwork and rounded up 10 must-shop finds from Nordstrom’s major beauty blowout.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf we had to choose one product from editor-beloved Nécessaire, it would be this one. This luxurious body wash comes in subtle scents like santal, hinoki, and eucalyptus, setting the stage for your ultimate everything shower. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTikTok made it famous, but Black Honey’s real power is in its universal appeal. The \u003ca href=\"https://www.refinery29.com/en-us/clinique-black-honey-lipstick-makeup-collection\"\u003esheer, warm cherry-brown shade\u003c/a\u003e is truly a one-swipe wonder — no mirror needed. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eA rare discount on La Mer’s iconic cream is no small deal. Infused with the brand’s proprietary Miracle Broth, this decadent formula leaves skin feeling softer, smoother, and naturally radiant.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis cult-favorite concealer has outlasted others for a reason With its skin-like finish and never-cakey coverage, it’s in a league of its own.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTurn up the glow with Supergoop!’s \u003ca href=\"https://www.refinery29.com/en-gb/supergoop-glowscreen-sunscreen-review\"\u003ehighlighter-sunscreen hybrid\u003c/a\u003e. With broad-spectrum SPF 40 protection and a luminous finish, it’s a summer essential in shades like rose gold, champagne, and bronze.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIt doesn’t get more posh than \u003ca href=\"https://www.refinery29.com/en-us/2018/01/185962/dior-addict-lip-glow-balm-review\"\u003eDior’s Lip Glow Balm\u003c/a\u003e, closely resembling an \u003cem\u003eobjet d’art \u003c/em\u003emore\u003cem\u003e \u003c/em\u003ethan a lip balm. Housed in a vintage-inspired tube, this pH-reactive balm delivers a sheer tint that adjusts to your unique tone — choose from pale pink, icy blue, tangerine, and more.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOlaplex’s bond-building magic now comes in \u003ca href=\"https://www.refinery29.com/en-us/2022/04/10934564/olaplex-no-9-bond-protector-nourishing-hair-serum-review\"\u003eserum form\u003c/a\u003e. Lightweight and hydrating, it shields hair from heat up to 450° while leaving strands smooth and nourished.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/best-blush\"\u003eCream blush\u003c/a\u003e done right. Gucci Westman’s Baby Cheeks blends like a dream and comes in a range of flawless shades — the perfect addition to your spring routine.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere’s a reason Charlotte Tilbury’s \u003ca href=\"https://www.refinery29.com/en-us/best-lip-liner-pencils\"\u003elip pencil\u003c/a\u003e has cult status — the ultra-creamy, long-wearing formula perfects your pout with precise, pigmented definition.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/best-new-spring-fragrances-perfumes\"\u003eFloral perfumes\u003c/a\u003e just hit different. Gucci’s Flora Gorgeous Garden blends white florals, jasmine, and pear blossom for a bright garden party mood.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-25T17:22:19Z",
  "modifiedTime": null
}
