{
  "id": "676df4b9-1619-47c2-88f6-7ab8e7d99804",
  "title": "A Look Back at 2016",
  "link": "http://www.frmheadtotoe.com/2017/01/a-look-back-at-2016.html",
  "description": "",
  "author": "Jen",
  "published": "2017-01-01T15:36:00.000-08:00",
  "source": "http://feeds.feedburner.com/frmheadtotoe",
  "categories": [
    "Lifestyle"
  ],
  "byline": "xxxxx",
  "length": 1822,
  "excerpt": "xxxxx",
  "siteName": "From Head To Toe",
  "favicon": "",
  "text": "It always feels so strange on the first day of the new year to realize another 365 days has passed and be given the opportunity to start fresh again. Today may be the same as yesterday but truthfully, because we collectively step forward and reflect together, it is not just another day. It's a time to be thankful for the good and bad and pay that wisdom forward. This past year for me has been the most physically difficult of my life as well as emotionally fulfilling beyond my expectation. Before getting pregnant, I always feared how my small frame would handle growing and delivering a baby, but now I can look back and say look what I did. (For the record I was 4'11\" and 80 lbs pre-pregnancy which I will say openly in the hopes that it abates that fear in others.) Photos of my pregnant body still leave me in wonder at the sacrifices mothers go through and what a blessing it is that life is created that way. I will never be the same and I'm okay with that because there is nothing in my life I have ever done that compares with how fulfilled I feel being a mother. I've written and re-written dozens of ways to try and explain how bringing Aria into the world has shifted my definition of joy, burden, humility, sacrifice, and love but maybe the best way is to just share this video of what the past year has been like for my husband and me. One second from each day of 2016. I can't watch it without tearing up! I blame the hormones. ;) Never have I been more willing to let go of my anxieties and run toward the daily joy of being in the moment, watching my daughter grow. This year my goal is to leave fear at the door so I can be fully present for her, and also for me. There's no guarantee that things will be perfect but I'm excited for the beautiful imperfections that 2017 will inevitably bring!",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg4nUOjdt7N4tpuEfdMlMKUkqI6q5idnaofCG2cQsJrg9jx89bJvfd8hyphenhyphenJsrUjJ-Ms4dD6FzWnt1UgVtbqF1UcyzcS-95rUuBPIQe5UFltM057v6ds7LK-ZXT4WNEAU_AVlE6KuwyzIYeUo/s640/1-Second-A-Day-blog1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg4nUOjdt7N4tpuEfdMlMKUkqI6q5idnaofCG2cQsJrg9jx89bJvfd8hyphenhyphenJsrUjJ-Ms4dD6FzWnt1UgVtbqF1UcyzcS-95rUuBPIQe5UFltM057v6ds7LK-ZXT4WNEAU_AVlE6KuwyzIYeUo/s1600/1-Second-A-Day-blog1.jpg\" imageanchor=\"1\"\u003e\u003cimg height=\"378\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg4nUOjdt7N4tpuEfdMlMKUkqI6q5idnaofCG2cQsJrg9jx89bJvfd8hyphenhyphenJsrUjJ-Ms4dD6FzWnt1UgVtbqF1UcyzcS-95rUuBPIQe5UFltM057v6ds7LK-ZXT4WNEAU_AVlE6KuwyzIYeUo/s640/1-Second-A-Day-blog1.jpg\" width=\"640\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\nIt always feels so strange on the first day of the new year to realize another 365 days has passed and be given the opportunity to start fresh again. Today may be the same as yesterday but truthfully, because we collectively step forward and reflect together, it is not just another day. It\u0026#39;s a time to be thankful for the good and bad and pay that wisdom forward.\u003c/p\u003e\u003cp\u003e\n\nThis past year for me has been the most physically difficult of my life as well as emotionally fulfilling beyond my expectation. Before getting pregnant, I always feared how my small frame would handle growing and delivering a baby, but now I can look back and say \u003ci\u003elook what I did\u003c/i\u003e. (For the record I was 4\u0026#39;11\u0026#34; and 80 lbs pre-pregnancy which I will say openly in the hopes that it abates that fear in others.) Photos of my pregnant body still leave me in wonder at the sacrifices mothers go through and what a blessing it is that life is created that way. I will never be the same and I\u0026#39;m okay with that because there is nothing in my life I have ever done that compares with how fulfilled I feel being a mother.\u003c/p\u003e\u003cp\u003e\n\nI\u0026#39;ve written and re-written dozens of ways to try and explain how bringing Aria into the world has shifted my definition of joy, burden, humility, sacrifice, and love but maybe the best way is to just share this video of what the past year has been like for my husband and me. One second from each day of 2016.\u003c/p\u003e\u003cp\u003e\n\u003ciframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"https://www.youtube.com/embed/NfbghbAhGyI\" width=\"640\"\u003e\u003c/iframe\u003e\u003cbr/\u003e\u003c/p\u003e\n\n\u003cp\u003e\nI can\u0026#39;t watch it without tearing up! I blame the hormones. ;)\u003c/p\u003e\n\n\u003cp\u003e\nNever have I been more willing to let go of my anxieties and run toward the daily joy of being in the moment, watching my daughter grow. This year my goal is to leave fear at the door so I can be fully present for her, and also for me. There\u0026#39;s no guarantee that things will be perfect but I\u0026#39;m excited for the beautiful imperfections that 2017 will inevitably bring!\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
