{
  "id": "7b0d4c19-617f-46a1-abc0-2b7ddfbe71e2",
  "title": "How Innbeauty Project's Founders Are Building an Affordable, Multi-Generational Skin-Care Brand",
  "link": "https://fashionista.com/2024/09/innbeauty-project-alisa-metzger-jen-shane-founder-interview",
  "description": "With two seasoned beauty industry veterans at its helm, five-year-old skin-care brand Innbeauty Project isn't focused on following trends or pigeonholing its age demographic. \"If you've got a skin concern, we've got a high-performance solution for you, whether you're 16 or 60 or 70 and everywhere ...Continue reading",
  "author": "Catie Pusateri",
  "published": "Mon, 16 Sep 2024 12:00:00 GMT",
  "source": "https://fashionista.com/.rss/excerpt/beauty",
  "categories": [
    "Beauty",
    "Business",
    "Sephora",
    "Careers",
    "Network",
    "Innbeauty Project",
    "Beauty",
    "label to watch",
    "Beauty Brands",
    "Skin Care",
    "How To Make It",
    "beauty products"
  ],
  "byline": "Catie Pusateri",
  "length": 6030,
  "excerpt": "\"If we feel like we can't put out a superior product when it comes to price, efficacy [and] quality, we don't bother.\"",
  "siteName": "Fashionista",
  "favicon": "https://fashionista.com/site/images/apple-touch-icon-114x114-precomposed.png?v=2024-10-10-142059-a968f66-000136",
  "text": "With two seasoned beauty industry veterans at its helm, five-year-old skin-care brand Innbeauty Project isn't focused on following trends or pigeonholing its age demographic.\"If you've got a skin concern, we've got a high-performance solution for you, whether you're 16 or 60 or 70 and everywhere in between,\" co-founder Alisa Metzger tells Fashionista. \"We really don't formulate for an age group.\"Metzger and co-founder Jen Shane's beauty-based paths first crossed at the brand Tula, right at the peak of the \"clean\" skin-care and wellness boom. Metzger came from a marketing background, which included positions at L'Oréal, Procter \u0026 Gamble and Coty, while Shane had formulation experience as a product developer for Tarte, Bare Minerals and Tatcha. The duo quit their jobs in pursuit of building an efficacious skin-care brand centered around accessibility.It's no secret that the skin-care industry tends to put higher price tags on high-performing formulas, with some luxury creams and serums from the likes of La Mer, Augustinus Bader and Estée Lauder reaching triple digits. Compiling — and maintaining — an effective skin-care routine can become a luxury few can regularly afford. Metzger says Innbeauty Project set out to address the burning question: \"How do we come to the market and really fill this white space for highly effective, highly clinical, high-quality skin care, but at a more accessible price point?\"The answer? Instead of sourcing through a contract manufacturer who could potentially place up to a 50% markup on each ingredient, Innbeauty Project sources all of its materials itself. Unlike many of the brand's competitors, it also takes packaging into its own hands by directly working with factories in Asia rather than going through a middleman. As a result, Innbeauty Project's skin-care products range in price from $18 to $48.\"It becomes really challenging on the operational side, but we really believe in passing off the savings to our customer, and that's how we're going to win and occupy this white space that we're in,\" Metzger shares.Innbeauty Project Extreme Cream, $48, available herePhoto: Courtesy of Innbeauty ProjectInnbeauty Project launched in 2019 at the height of the race to capture Gen Z's attention, but don't call it a Gen-Z brand. Easily identified by its bold typeface and bright packaging, Innbeauty Project's products represent its multi-generational customer — from colorful, juicy lip oils to a gravity-defying firming serum. It also offers acne-fighting products (see: its overnight drying Pimple Paste), a radiant-finish mineral SPF as well as retinol, vitamin C and high-performance acids for a variety of different skin types and concerns.\"If we feel like we can't put out a superior product when it comes to price, efficacy [and] quality, we don't bother,\" Metzger says.Scroll to ContinueRecommended ArticlesHowever, the brand's breakout product is clear: Extreme Cream. Formulated with lifting peptides, bio-retinol, ceramides and reverse emulsion technology, the $48 firming moisturizer addresses sagging skin to hydrate and visibly smooth wrinkles while promoting a firmer, contoured jawline. As the formulator behind this innovation, creating it was a personal journey for Shane: \"I come from a family of saggers.\"\"We were able to find a peptide that specifically works on the fibrous connections between your ligaments, which are really deep down in the top layer of your skin, which sag as you age from gravitational pull,\" Shane continues. \"So, it's kind of like Spanx for your face. Over time it tightens those connections back up, which is really innovative and cool and new. We see the most success when we're really trying to innovate in a category like that.\"In the age of \"Sephora tweens\" making headlines for their hauls of wrinkle-prevention creams, serums and retinols, capturing a younger beauty customer base has become increasingly lucrative. While Innbeauty Project is targeting a multi-generational audience, skin care isn't always one-size-fits-all — especially when it comes to actives. \"We have her at 16, and she's loving certain products, and other products are not right for her,\" Metzger says of Innbeauty Project's customer. \"We will not market them to her.\"In lieu of billboards and extensive marketing, Innbeauty Project invests in research-backed clinical studies. \"We go above and beyond with clinical testing,\" Shane says. \"Our clinical budgets are not normal.\" Though clinical studies are not necessarily sought out by the average consumer, Metzger notes they're a core component to boosting the brand's integrity and backing up its efficacy.Photo: Courtesy of Innbeauty ProjectIt's paying off, too: Sephora, the brand's exclusive retail partner, recently crowned Innbeauty Project as its 2024 Breakout Brand. The brand has also tripled its Sephora retail footprint, allowing the brand to expand to a nearly 40-person team — not long after Metzger and Shane were packing boxes themselves in their homes during their Covid-era beginnings. On the heels of this growth, Innbeauty Project also launched its first-ever brand campaign, \"Great Skin Days,\" featuring athlete Ayan Broomfield, professional makeup artist Erica Taylor and influencer Hannah Chody.As for Innbeauty Project's future, there's an entire skin-care world to tap into outside of the U.S. The brand is looking to explore more ways to partner with Sephora as well as expand into international markets in a way that fits its brand ethos.\"I think it's very easy to get caught up in trend and leaning into what's happening right now,\" Metzger says. \"Everything we do is so forward thinking. We want this to be a hero, household name, five years, 10 years, 15, 20, 25 years from now. We want Innbeauty Project to still be a shining star in the world of skin care.\"Please note: Occasionally, we use affiliate links on our site. This in no way affects our editorial decision-making.Never miss the latest fashion industry news. Sign up for the Fashionista daily newsletter.",
  "image": "https://fashionista.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjA5MjM3NjgwNDM1NzY3MTQw/innbeauty-project-extreme-cream-lifestyle.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWith two seasoned beauty industry veterans at its helm, five-year-old skin-care brand \u003ca href=\"https://fashionista.com/tag/innbeauty-project\"\u003eInnbeauty Project\u003c/a\u003e isn\u0026#39;t focused on following trends or pigeonholing its age demographic.\u003c/p\u003e\u003cp\u003e\u0026#34;If you\u0026#39;ve got a skin concern, we\u0026#39;ve got a high-performance solution for you, whether you\u0026#39;re 16 or 60 or 70 and everywhere in between,\u0026#34; co-founder Alisa Metzger tells Fashionista. \u0026#34;We really don\u0026#39;t formulate for an age group.\u0026#34;\u003c/p\u003e\u003cp\u003eMetzger and co-founder Jen Shane\u0026#39;s beauty-based paths first crossed at the brand Tula, right at the peak of the \u0026#34;clean\u0026#34; skin-care and wellness boom. Metzger came from a marketing background, which included positions at \u003ca href=\"https://fashionista.com/tag/loreal\"\u003eL\u0026#39;Oréal\u003c/a\u003e, \u003ca href=\"https://fashionista.com/tag/procter--gamble\"\u003eProcter \u0026amp; Gamble\u003c/a\u003e and \u003ca href=\"https://fashionista.com/tag/coty\"\u003eCoty\u003c/a\u003e, while Shane had formulation experience as a product developer for \u003ca href=\"https://fashionista.com/tag/tarte\"\u003eTarte\u003c/a\u003e, \u003ca href=\"https://fashionista.com/tag/bare-minerals\"\u003eBare Minerals\u003c/a\u003e and \u003ca href=\"https://fashionista.com/tag/tatcha\"\u003eTatcha\u003c/a\u003e. The duo quit their jobs in pursuit of building an efficacious skin-care brand centered around accessibility.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s no secret that the skin-care industry tends to put higher price tags on high-performing formulas, with some luxury creams and serums from the likes of \u003ca href=\"https://fashionista.com/designers/la-mer\"\u003eLa Mer\u003c/a\u003e, \u003ca href=\"https://fashionista.com/tag/augustinus-bader\"\u003eAugustinus Bader\u003c/a\u003e and \u003ca href=\"https://fashionista.com/tag/estee-lauder\"\u003eEstée Lauder\u003c/a\u003e reaching triple digits. Compiling — and maintaining — an effective skin-care routine can become a luxury few can regularly afford. Metzger says Innbeauty Project set out to address the burning question: \u0026#34;How do we come to the market and really fill this white space for highly effective, highly clinical, high-quality skin care, but at a more accessible price point?\u0026#34;\u003c/p\u003e\u003cp\u003eThe answer? Instead of sourcing through a contract manufacturer who could potentially place up to a 50% markup on each ingredient, Innbeauty Project sources all of its materials itself. Unlike many of the brand\u0026#39;s competitors, it also takes packaging into its own hands by directly working with factories in Asia rather than going through a middleman. As a result, Innbeauty Project\u0026#39;s skin-care products range in price from $18 to $48.\u003c/p\u003e\u003cp\u003e\u0026#34;It becomes really challenging on the operational side, but we really believe in passing off the savings to our customer, and that\u0026#39;s how we\u0026#39;re going to win and occupy this white space that we\u0026#39;re in,\u0026#34; Metzger shares.\u003c/p\u003e\u003cdiv\u003e\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\u003cphoenix-picture\u003e\u003ca\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.webp 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.webp 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.webp 700w\"/\u003e\u003csource sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.png 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.png 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.png 700w\"/\u003e\u003cimg alt=\"Innbeauty Project Extreme Cream, $48, available here\" decoding=\"async\" src=\"https://fashionista.com/.image/t_share/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.png\" data-src=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5MjM3NTY1NTQ1MzkxNzI4/innbeauty-project-extreme-cream.png\" height=\"7500\" width=\"5000\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" itemprop=\"contentUrl url\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/phoenix-picture\u003e\u003cfigcaption\u003e\u003cp itemprop=\"caption\"\u003eInnbeauty Project Extreme Cream, $48, \u003ca href=\"https://howl.me/cm4XZJOS6tH\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003eavailable here\u003c/a\u003e\u003c/p\u003e\u003cp itemprop=\"author\"\u003e\u003cspan\u003ePhoto: Courtesy of Innbeauty Project\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eInnbeauty Project launched in 2019 at the height of the race to capture Gen Z\u0026#39;s attention, but don\u0026#39;t call it a Gen-Z brand. Easily identified by its bold typeface and bright packaging, Innbeauty Project\u0026#39;s products represent its multi-generational customer — from colorful, juicy lip oils to a gravity-defying firming serum. It also offers acne-fighting products (see: its overnight drying \u003ca href=\"https://howl.me/cm4X0fM6krF\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003ePimple Paste\u003c/a\u003e), a radiant-finish mineral SPF as well as retinol, vitamin C and high-performance acids for a variety of different skin types and concerns.\u003c/p\u003e\u003cp\u003e\u0026#34;If we feel like we can\u0026#39;t put out a superior product when it comes to price, efficacy [and] quality, we don\u0026#39;t bother,\u0026#34; Metzger says.\u003c/p\u003e\u003csection id=\"phx-3\"\u003e\u003cp\u003e\u003cspan\u003eScroll to Continue\u003c/span\u003e\u003c/p\u003e\u003cdiv id=\"phx-5\"\u003e\u003cp\u003e\u003ch2 role=\"heading\" aria-level=\"2\"\u003eRecommended Articles\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eHowever, the brand\u0026#39;s breakout product is clear: \u003ca href=\"https://howl.me/cm4XZJOS6tH\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003eExtreme Cream\u003c/a\u003e. Formulated with lifting peptides, bio-retinol, ceramides and reverse emulsion technology, the $48 firming moisturizer addresses sagging skin to hydrate and visibly smooth wrinkles while promoting a firmer, contoured jawline. As the formulator behind this innovation, creating it was a personal journey for Shane: \u0026#34;I come from a family of saggers.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We were able to find a peptide that specifically works on the fibrous connections between your ligaments, which are really deep down in the top layer of your skin, which sag as you age from gravitational pull,\u0026#34; Shane continues. \u0026#34;So, it\u0026#39;s kind of like Spanx for your face. Over time it tightens those connections back up, which is really innovative and cool and new. We see the most success when we\u0026#39;re really trying to innovate in a category like that.\u0026#34;\u003c/p\u003e\u003cp\u003eIn the age of \u0026#34;\u003ca href=\"https://fashionista.com/tag/sephora\"\u003eSephora\u003c/a\u003e tweens\u0026#34; making headlines for their hauls of wrinkle-prevention creams, serums and retinols, capturing a younger beauty customer base has become increasingly lucrative. While Innbeauty Project is targeting a multi-generational audience, skin care isn\u0026#39;t always one-size-fits-all — especially when it comes to actives. \u0026#34;We have her at 16, and she\u0026#39;s loving certain products, and other products are not right for her,\u0026#34; Metzger says of Innbeauty Project\u0026#39;s customer. \u0026#34;We will not market them to her.\u0026#34;\u003c/p\u003e\u003cp\u003eIn lieu of billboards and extensive marketing, Innbeauty Project invests in research-backed clinical studies. \u0026#34;We go above and beyond with clinical testing,\u0026#34; Shane says. \u0026#34;Our clinical budgets are not normal.\u0026#34; Though clinical studies are not necessarily sought out by the average consumer, Metzger notes they\u0026#39;re a core component to boosting the brand\u0026#39;s integrity and backing up its efficacy.\u003c/p\u003e\u003cdiv\u003e\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\u003cphoenix-picture\u003e\u003ca\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.webp 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.webp 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.webp 700w\"/\u003e\u003csource sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.png 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.png 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.png 700w\"/\u003e\u003cimg alt=\"innbeauty-project-great-skin-days-campaign\" decoding=\"async\" src=\"https://fashionista.com/.image/t_share/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.png\" data-src=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5MjM3NTY1NTQ1NDU3MjY0/innbeauty-project-great-skin-days-campaign.png\" height=\"6001\" width=\"4001\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" itemprop=\"contentUrl url\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/phoenix-picture\u003e\u003cfigcaption\u003e\u003cp itemprop=\"author\"\u003e\u003cspan\u003ePhoto: Courtesy of Innbeauty Project\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eIt\u0026#39;s paying off, too: Sephora, the brand\u0026#39;s exclusive retail partner, recently crowned Innbeauty Project as its 2024 Breakout Brand. The brand has also tripled its Sephora retail footprint, allowing the brand to expand to a nearly 40-person team — not long after Metzger and Shane were packing boxes themselves in their homes during their Covid-era beginnings. On the heels of this growth, Innbeauty Project also launched its first-ever brand campaign, \u0026#34;Great Skin Days,\u0026#34; featuring athlete Ayan Broomfield, professional makeup artist Erica Taylor and influencer Hannah Chody.\u003c/p\u003e\u003cp\u003eAs for Innbeauty Project\u0026#39;s future, there\u0026#39;s an entire skin-care world to tap into outside of the U.S. The brand is looking to explore more ways to partner with Sephora as well as expand into international markets in a way that fits its brand ethos.\u003c/p\u003e\u003cp\u003e\u0026#34;I think it\u0026#39;s very easy to get caught up in trend and leaning into what\u0026#39;s happening right now,\u0026#34; Metzger says. \u0026#34;Everything we do is so forward thinking. We want this to be a hero, household name, five years, 10 years, 15, 20, 25 years from now. We want Innbeauty Project to still be a shining star in the world of skin care.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cem\u003ePlease note: Occasionally, we use affiliate links on our site. This in no way affects our editorial decision-making.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://breakingmedia.us1.list-manage.com/subscribe?u=9ddd1593650687cb23ac29940\u0026amp;id=a23c93579d\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003e\u003cem\u003eNever miss the latest fashion industry news. Sign up for the Fashionista daily newsletter.\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-09-16T12:00:00Z",
  "modifiedTime": null
}
