{
  "id": "8d030792-aa40-4431-b76b-db94fd0369e7",
  "title": "I Tried the TikTok-Loved Microneedling Tool and Serum That Claims to Grow Your Edges",
  "link": "https://www.popsugar.com/beauty/oneskin-os-o1-hair-scalp-serum-review-49452080",
  "description": "Image Source: PS Photography / Deena Campbell My haircare philosophy has always been rooted in tradition. Growing up in a Black household, Jamaican black castor oil was the gold standard: trusted, time-tested, and deeply woven into our haircare routines. Anything too clinical or serum-based felt overly complicated and, honestly, a little impersonal. Oils also meant growth. So when I first came across the OneSkin OS-01 Hair Peptide Scalp Serum ($62 for one-month supply, originally $69) and OneSkin OS-01 Hair Dermaroller ($20), I was equally intrigued and skeptical. A biotech-backed peptide serum for the scalp? Still, my edges (which had been slowly thinning and weakening over time) were in need of serious reinforcement. Curiosity won, and I decided to see how science could change my life. Also, while pricey, the brand does offer the chance to save 20% on the OneSkin OS-01 Hair Peptide Scalp Serum 3-Month Supply ($166, originally $207) and 25% on the OneSkin OS-01 Hair Peptide Scalp Serum 6-Month Supply ($321, originally $424). So, there's a win - read on to see why I think it's worth the splurge. About the Peptide Scalp Serum and Dermaroller The OS-01 HAIR Peptide Scalp Serum is part of OneSkin's longevity-based line, developed with the goal of optimizing skin health at the cellular level, including your scalp. It contains their patented OS-01 peptide - the same ingredient in their cult-favorite OneSkin OS-01 Face Topical Supplement ($120) and OS-01 Body Topical Supplement ($99) - along with panax ginseng root extract and oryza sativa (rice) bran water that support a healthier scalp environment and help reduce hair shedding over time. The Dermaroller is a sleek, 0.5mm microneedling tool meant to increase serum absorption and stimulate circulation at the hair follicle level. You roll it across the scalp before applying the serum, kind of like aerating your lawn before watering it. How to Use The Peptide Scalp Serum and Dermaroller The duo is meant to be used together for best results. First, use the OS-01 Hair Dermaroller by gently rolling it across the scalp in multiple directions: front to back, side to side, and diagonally. I was sure to focus on areas of concern like my thinning edges. Then, I applied a few drops of the Peptide Scalp Serum directly to my scalp and massaged it in with my fingertips. I used the combo three to four times per week, always on clean, dry hair. The dermarolling takes less than two minutes, and the serum absorbs quickly so you can use styling products shortly thereafter. Image Source: PS Photography / Deena Campbell What I Like About the Peptide Scalp Serum and Dermaroller Real talk: I was fully bracing myself for pain with the dermaroller. I hate needles! But to my surprise, it didn't hurt at all. The sensation was more like a light tingle than anything sharp, and after the first few passes, I barely noticed it. Weirdly enough, it made the whole process feel kind of luxe, almost like I was giving my scalp a spa moment. Technically, you can use the serum on its own, but I wouldn't want to. The dermaroller helped it absorb faster and more evenly, and my scalp felt like it was soaking up every drop. The serum itself was pleasant, too. I initially expected a goopy mess, but it was anything but. The lightweight, non-greasy, and nearly fragrance-free formula dried down quickly and didn't leave any weird residue or build-up. I could apply it in the morning and go about my day without feeling like I had product sitting on my scalp. But what ultimately sold me was the science. OneSkin's entire philosophy centers around cellular longevity. Their signature OS-01 peptide was developed to target senescent cells (aka \"zombie cells\" that stop functioning but don't die off), which can accumulate in the skin and contribute to inflammation, thinning, and delayed regeneration. In clinical studies, the brand found that consistent use of the OS-01 peptide not only improved markers of scalp barrier function and hydration, but also helped reduce pro-inflammatory aging signals. Healthier scalp skin creates a more supportive environment for hair follicles, which is essential for anyone dealing with hair shedding. That level of transparency and intention really spoke to me, especially as someone who's not just chasing a temporary cosmetic fix but focused on building long-term strength and fullness. I still love my oils and always will, but these science-forward products have earned a permanent spot in my routine. Image Source: PS Photography / Deena Campbell What to Consider Before Trying the Peptide Scalp Serum and Dermaroller Consistency is key. This isn't a one-and-done miracle. You need to stick with it to see results. Don't skip the dermaroller. It makes a huge difference in how the serum absorbs (and no, it doesn't hurt!). If you have scalp sensitivities, test patch the dermaroller first or check in with a dermatologist. Where Is the Peptide Scalp Serum and Dermaroller Available? OneSkin Peptide Scalp Serum and Dermaroller is available on the brand's website. Rating: Deena Campbell is the former beauty director of Marie Claire and a passionate advocate for driving meaningful conversations about beauty, particularly around ensuring BIPOC individuals feel seen and their stories are told.",
  "author": "Deena Campbell",
  "published": "Fri, 18 Jul 2025 12:00:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Product Reviews",
    "Beauty Shopping"
  ],
  "byline": "Deena Campbell",
  "length": 5496,
  "excerpt": "One editor tried out Oneskin OS-O1 Hair Scalp Serum and shared her results. See why it's worth the buy here.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "PS Photography | Deena CampbellPS Photography | Deena CampbellWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.My haircare philosophy has always been rooted in tradition. Growing up in a Black household, Jamaican black castor oil was the gold standard: trusted, time-tested, and deeply woven into our haircare routines. Anything too clinical or serum-based felt overly complicated and, honestly, a little impersonal. Oils also meant growth. So when I first came across the OneSkin OS-01 Hair Peptide Scalp Serum ($62 for one-month supply, originally $69) and OneSkin OS-01 Hair Dermaroller ($20), I was equally intrigued and skeptical. A biotech-backed peptide serum for the scalp? Still, my edges (which had been slowly thinning and weakening over time) were in need of serious reinforcement. Curiosity won, and I decided to see how science could change my life. Also, while pricey, the brand does offer the chance to save 20% on the OneSkin OS-01 Hair Peptide Scalp Serum 3-Month Supply ($166, originally $207) and 25% on the OneSkin OS-01 Hair Peptide Scalp Serum 6-Month Supply ($321, originally $424). So, there's a win — read on to see why I think it's worth the splurge. About the Peptide Scalp Serum and Dermaroller The OS-01 HAIR Peptide Scalp Serum is part of OneSkin's longevity-based line, developed with the goal of optimizing skin health at the cellular level, including your scalp. It contains their patented OS-01 peptide — the same ingredient in their cult-favorite OneSkin OS-01 Face Topical Supplement ($120) and OS-01 Body Topical Supplement ($99) — along with panax ginseng root extract and oryza sativa (rice) bran water that support a healthier scalp environment and help reduce hair shedding over time. The Dermaroller is a sleek, 0.5mm microneedling tool meant to increase serum absorption and stimulate circulation at the hair follicle level. You roll it across the scalp before applying the serum, kind of like aerating your lawn before watering it. How to Use The Peptide Scalp Serum and DermarollerThe duo is meant to be used together for best results. First, use the OS-01 Hair Dermaroller by gently rolling it across the scalp in multiple directions: front to back, side to side, and diagonally. I was sure to focus on areas of concern like my thinning edges. Then, I applied a few drops of the Peptide Scalp Serum directly to my scalp and massaged it in with my fingertips. I used the combo three to four times per week, always on clean, dry hair. The dermarolling takes less than two minutes, and the serum absorbs quickly so you can use styling products shortly thereafter. PS Photography | Deena CampbellWhat I Like About the Peptide Scalp Serum and DermarollerReal talk: I was fully bracing myself for pain with the dermaroller. I hate needles! But to my surprise, it didn't hurt at all. The sensation was more like a light tingle than anything sharp, and after the first few passes, I barely noticed it. Weirdly enough, it made the whole process feel kind of luxe, almost like I was giving my scalp a spa moment. Technically, you can use the serum on its own, but I wouldn't want to. The dermaroller helped it absorb faster and more evenly, and my scalp felt like it was soaking up every drop. The serum itself was pleasant, too. I initially expected a goopy mess, but it was anything but. The lightweight, non-greasy, and nearly fragrance-free formula dried down quickly and didn't leave any weird residue or build-up. I could apply it in the morning and go about my day without feeling like I had product sitting on my scalp. But what ultimately sold me was the science. OneSkin's entire philosophy centers around cellular longevity. Their signature OS-01 peptide was developed to target senescent cells (aka \"zombie cells\" that stop functioning but don't die off), which can accumulate in the skin and contribute to inflammation, thinning, and delayed regeneration. In clinical studies, the brand found that consistent use of the OS-01 peptide not only improved markers of scalp barrier function and hydration, but also helped reduce pro-inflammatory aging signals. Healthier scalp skin creates a more supportive environment for hair follicles, which is essential for anyone dealing with hair shedding. That level of transparency and intention really spoke to me, especially as someone who's not just chasing a temporary cosmetic fix but focused on building long-term strength and fullness. I still love my oils and always will, but these science-forward products have earned a permanent spot in my routine. PS Photography | Deena CampbellWhat to Consider Before Trying the Peptide Scalp Serum and DermarollerConsistency is key. This isn't a one-and-done miracle. You need to stick with it to see results. Don't skip the dermaroller. It makes a huge difference in how the serum absorbs (and no, it doesn't hurt!). If you have scalp sensitivities, test patch the dermaroller first or check in with a dermatologist. Where Is the Peptide Scalp Serum and Dermaroller Available?OneSkin Peptide Scalp Serum and Dermaroller is available on the brand's website. Rating:★★★★Deena Campbell is the former beauty director of Marie Claire and a passionate advocate for driving meaningful conversations about beauty, particularly around ensuring BIPOC individuals feel seen and their stories are told.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/tFbjv7z2V1Tz-jGJTgVcd9ljIDQ=/0x1:1384x728/fit-in/1456x728/top/filters:format_auto():quality(85):upscale()/2025/07/17/028/n/1922153/6cc2fa0f68798a21680282.03802683_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv data-element-type=\"ParagraphMainImage\" data-element-index=\"0\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/pAs_KKX5AP7EMD2XYO9f3i0C5Gs=/fit-in/792x528/top/filters:format_auto():upscale()/2025/07/17/029/n/1922153/tmp_T6wVNF_c558c1ed8c83fc75_Basic_Collage-4-Main_2_up_-_1456x970_2_.jpeg\" width=\"792\" height=\"528\" fetchpriority=\"high\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/pAs_KKX5AP7EMD2XYO9f3i0C5Gs=/fit-in/792x528/top/filters:format_auto():upscale()/2025/07/17/029/n/1922153/tmp_T6wVNF_c558c1ed8c83fc75_Basic_Collage-4-Main_2_up_-_1456x970_2_.jpeg 1000w, https://media1.popsugar-assets.com/files/thumbor/CBdMfhjZ7vPPE64eCpEQZSx-JCI=/fit-in/1584x1056/top/filters:format_auto():upscale()/2025/07/17/029/n/1922153/tmp_T6wVNF_c558c1ed8c83fc75_Basic_Collage-4-Main_2_up_-_1456x970_2_.jpeg 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Deena Campbell\u003c/span\u003e\u003c/figcaption\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Deena Campbell\u003c/span\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eMy haircare philosophy has always been rooted in tradition. Growing up in a Black household, \u003ca href=\"https://www.popsugar.com/beauty/best-jamaican-black-castor-oil-hair-products-47367583\"\u003eJamaican black castor oil\u003c/a\u003e was the gold standard: trusted, time-tested, and deeply woven into our haircare routines. Anything too clinical or serum-based felt overly complicated and, honestly, a little impersonal. Oils also meant growth. So when I first came across the \u003ca href=\"https://go.linkby.com/IBSAIGFB?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOneSkin OS-01 Hair Peptide Scalp Serum\u003c/a\u003e ($62 for one-month supply, originally $69) and \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair-dermaroller?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOneSkin OS-01 Hair Dermaroller\u003c/a\u003e ($20), I was equally intrigued and skeptical. A biotech-backed peptide serum for the scalp? Still, my edges (which had been slowly thinning and weakening over time) were in need of serious reinforcement. Curiosity won, and I decided to see how science could change my life.\n\u003c/p\u003e\u003cdiv\u003e\u003ca href=\"https://go.linkby.com/IBSAIGFB?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"oneskin.co\" data-vars-price=\"$62\" data-vars-href=\"https://go.linkby.com/IBSAIGFB\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ExrYbYx1Qc91NKyJK2MtkbLtwlI=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/2f2c49226878079058df54.19169588_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ExrYbYx1Qc91NKyJK2MtkbLtwlI=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/2f2c49226878079058df54.19169588_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/JATsRkx-45gXzjRuFj9PQBr5268=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/2f2c49226878079058df54.19169588_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/a7mhpEMnSlb7SMC1QrIQwNyHw-I=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/2f2c49226878079058df54.19169588_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair-dermaroller?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"oneskin.co\" data-vars-price=\"$20\" data-vars-href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair-dermaroller\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/vsza0xH8wXBjWxU-Q3BAC5wPWXA=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/e887f3196878079852cb13.83166764_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/vsza0xH8wXBjWxU-Q3BAC5wPWXA=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/e887f3196878079852cb13.83166764_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/FwDfWXzQEZSqfP_S6ofmEZIdf9k=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/e887f3196878079852cb13.83166764_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/qkW_x-PR0Zr5hjH9nEKElepIFqU=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/e887f3196878079852cb13.83166764_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"1\"\u003eAlso, while pricey, the brand does offer the chance to save 20% on the \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?variant=46312157970691\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOneSkin OS-01 Hair Peptide Scalp Serum 3-Month Supply\u003c/a\u003e ($166, originally $207) and 25% on the \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?variant=46312158003459\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOneSkin OS-01 Hair Peptide Scalp Serum 6-Month Supply\u003c/a\u003e ($321, originally $424). So, there\u0026#39;s a win — read on to see why I think it\u0026#39;s worth the splurge. \n\u003c/p\u003e\u003cdiv\u003e\u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?variant=46312157970691\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"oneskin.co\" data-vars-price=\"$166\" data-vars-href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?variant=46312157970691\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/LwE4w-dmAJ-x2_UGS6ENLq6fbro=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5cdf02d9687807a45c5a01.55265877_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/LwE4w-dmAJ-x2_UGS6ENLq6fbro=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5cdf02d9687807a45c5a01.55265877_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/uJfxT4KQPNgoQCIKw1ozgxH7mew=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5cdf02d9687807a45c5a01.55265877_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/eV43HKztbiX-IoW1q9gC0iCg8oI=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5cdf02d9687807a45c5a01.55265877_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?variant=46312158003459\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"oneskin.co\" data-vars-price=\"$321\" data-vars-href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?variant=46312158003459\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/w_MFz84_8bd2_2-1G4tzSIs8CDU=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/635999dc687807af1a9297.08576832_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/w_MFz84_8bd2_2-1G4tzSIs8CDU=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/635999dc687807af1a9297.08576832_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/t4QKgpV0QZkQDyO6vHLTyOa5tRc=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/635999dc687807af1a9297.08576832_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/NBweCa-j7FJfkz6EutbQ0il9iaM=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/635999dc687807af1a9297.08576832_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eAbout the Peptide Scalp Serum and Dermaroller\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-element-index=\"3\" data-element-has-ending-title=\"false\"\u003e\u003cul\u003e\n\u003cli\u003eThe OS-01 HAIR Peptide Scalp Serum is part of OneSkin\u0026#39;s longevity-based line, developed with the goal of optimizing skin health at the cellular level, including your scalp.\u003c/li\u003e\n\u003cli\u003eIt contains their patented OS-01 peptide — the same ingredient in their cult-favorite \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/01-face-topical-supplement?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOneSkin OS-01 Face Topical Supplement\u003c/a\u003e ($120) and \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-body-topical-supplement?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOS-01 Body Topical Supplement\u003c/a\u003e ($99) — along with panax ginseng root extract and oryza sativa (rice) bran water that support a healthier scalp environment and help reduce hair shedding over time.\u003c/li\u003e\n\u003cli\u003eThe Dermaroller is a sleek, 0.5mm microneedling tool meant to increase serum absorption and stimulate circulation at the hair follicle level. You roll it across the scalp before applying the serum, kind of like aerating your lawn before watering it.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://go.linkby.com/IBSAIGFB/products/01-face-topical-supplement?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"oneskin.co\" data-vars-price=\"$120\" data-vars-href=\"https://go.linkby.com/IBSAIGFB/products/01-face-topical-supplement\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/viotnnzSq6TgalAPZafbQU13dfg=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/780adc85687807bb70cb34.50590466_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/viotnnzSq6TgalAPZafbQU13dfg=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/780adc85687807bb70cb34.50590466_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/bi7fUCzOGnAvdlIg1BjTO82PYDc=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/780adc85687807bb70cb34.50590466_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/cXIpup1X890DGHAI6y365OfcYuQ=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/780adc85687807bb70cb34.50590466_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-body-topical-supplement?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"oneskin.co\" data-vars-price=\"$99\" data-vars-href=\"https://go.linkby.com/IBSAIGFB/products/os-01-body-topical-supplement\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/xj6_DPdq-dGXR2UYs-gXfrRCqDU=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5fdfbdef687807c55141a3.11725819_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/xj6_DPdq-dGXR2UYs-gXfrRCqDU=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5fdfbdef687807c55141a3.11725819_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/L1Q5TYNegxW-hpKyrLNHghptkEQ=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5fdfbdef687807c55141a3.11725819_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/ej1P_o4KNvXZPr6tk8fndQkjZuw=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/16/883/n/1922153/5fdfbdef687807c55141a3.11725819_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"4\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eHow to Use The Peptide Scalp Serum and Dermaroller\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"5\"\u003eThe duo is meant to be used together for best results. First, use the \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair-dermaroller?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOS-01 Hair Dermaroller\u003c/a\u003e by gently rolling it across the scalp in multiple directions: front to back, side to side, and diagonally. I was sure to focus on areas of concern like my thinning edges. Then, I applied a few drops of the \u003ca href=\"https://go.linkby.com/IBSAIGFB?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003ePeptide Scalp Serum\u003c/a\u003e directly to my scalp and massaged it in with my fingertips.\n\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eI used the combo three to four times per week, always on clean, dry hair. The dermarolling takes less than two minutes, and the serum absorbs quickly so you can use styling products shortly thereafter. \n\u003c/p\u003e\u003c/div\u003e\u003cfigure data-element-type=\"ParagraphImage\" data-element-index=\"3\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/B_z5C4SoBQQg9n_CstSHEKH4n3U=/fit-in/792x1056/filters:format_auto():upscale()/2025/07/17/029/n/1922153/tmp_CumhGe_d7646d28d11e32d5_IMG_8112.JPEG\" width=\"792\" height=\"1056\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/B_z5C4SoBQQg9n_CstSHEKH4n3U=/fit-in/792x1056/filters:format_auto():upscale()/2025/07/17/029/n/1922153/tmp_CumhGe_d7646d28d11e32d5_IMG_8112.JPEG 1000w, https://media1.popsugar-assets.com/files/thumbor/skhgmZxNBeb4L-WCP-yUQJQpSu0=/fit-in/1584x2112/filters:format_auto():upscale()/2025/07/17/029/n/1922153/tmp_CumhGe_d7646d28d11e32d5_IMG_8112.JPEG 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Deena Campbell\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"4\" data-element-has-beginning-title=\"true\"\u003e\u003cp data-element-index=\"0\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat I Like About the Peptide Scalp Serum and Dermaroller\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eReal talk: I was fully bracing myself for pain with the dermaroller. I \u003cem\u003ehate\u003c/em\u003e needles! But to my surprise, it didn\u0026#39;t hurt at all. The sensation was more like a light tingle than anything sharp, and after the first few passes, I barely noticed it. Weirdly enough, it made the whole process feel kind of luxe, almost like I was giving my scalp a \u003ca href=\"https://www.popsugar.com/latest/Spa\"\u003espa moment\u003c/a\u003e. Technically, you can use the serum on its own, but I wouldn\u0026#39;t want to. The dermaroller helped it absorb faster and more evenly, and my scalp felt like it was soaking up every drop.\n\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eThe serum itself was pleasant, too. I initially expected a goopy mess, but it was anything but. The lightweight, non-greasy, and nearly fragrance-free formula dried down quickly and didn\u0026#39;t leave any weird residue or build-up. I could apply it in the morning and go about my day without feeling like I had product sitting on my scalp. But what ultimately sold me was the science. OneSkin\u0026#39;s entire philosophy centers around cellular longevity. Their signature OS-01 peptide was developed to target senescent cells (aka \u0026#34;zombie cells\u0026#34; that stop functioning but don\u0026#39;t die off), which can accumulate in the skin and contribute to inflammation, thinning, and delayed regeneration.\n\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eIn clinical studies, the brand found that consistent use of the \u003ca href=\"https://go.linkby.com/IBSAIGFB/pages/science?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003eOS-01 peptide\u003c/a\u003e not only improved markers of scalp barrier function and hydration, but also helped reduce pro-inflammatory aging signals. Healthier scalp skin creates a more supportive environment for hair follicles, which is essential for anyone dealing with hair shedding. That level of transparency and intention really spoke to me, especially as someone who\u0026#39;s not just chasing a temporary cosmetic fix but focused on building long-term strength and fullness. I still love my oils and always will, but these science-forward products have earned a permanent spot in my routine.\n\u003c/p\u003e\u003c/div\u003e\u003cfigure data-element-type=\"ParagraphImage\" data-element-index=\"6\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/G4axgY4frhWqYZdfRbFSESwM0nY=/fit-in/792x1087/filters:format_auto():upscale()/2025/07/16/890/n/1922153/tmp_NsSZvB_419949d10d8584fb_oneskin_duo2.jpg\" width=\"792\" height=\"1087\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/G4axgY4frhWqYZdfRbFSESwM0nY=/fit-in/792x1087/filters:format_auto():upscale()/2025/07/16/890/n/1922153/tmp_NsSZvB_419949d10d8584fb_oneskin_duo2.jpg 1000w, https://media1.popsugar-assets.com/files/thumbor/d7InizhTQPT76Dv7I-p-kXp8NLo=/fit-in/1584x2174/filters:format_auto():upscale()/2025/07/16/890/n/1922153/tmp_NsSZvB_419949d10d8584fb_oneskin_duo2.jpg 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Deena Campbell\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"7\" data-element-has-beginning-title=\"true\"\u003e\u003cp data-element-index=\"0\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat to Consider Before Trying the Peptide Scalp Serum and Dermaroller\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eConsistency is key. This isn\u0026#39;t a one-and-done miracle. You need to stick with it to see results. Don\u0026#39;t skip the dermaroller. It makes a huge difference in how the serum absorbs (and no, it doesn\u0026#39;t hurt!). If you have scalp sensitivities, test patch the dermaroller first or check in with a dermatologist. \u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhere Is the Peptide Scalp Serum and Dermaroller Available?\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eOneSkin Peptide Scalp Serum and Dermaroller is available on the \u003ca href=\"https://go.linkby.com/IBSAIGFB/products/os-01-hair?ref=popsugar.com\u0026amp;=___psv__p_49452080__t_w_\" target=\"_blank\"\u003ebrand\u0026#39;s website\u003c/a\u003e. \u003c/p\u003e\u003cp data-element-index=\"4\"\u003e\u003cstrong\u003eRating:\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"5\"\u003e★★★★\u003c/p\u003e\u003cp data-element-index=\"7\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/deena-campbell\"\u003eDeena Campbell\u003c/a\u003e is the former beauty director of Marie Claire and a passionate advocate for driving meaningful conversations about beauty, particularly around ensuring BIPOC individuals feel seen and their stories are told.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-18T19:00:02Z",
  "modifiedTime": "2025-07-18T19:00:02Z"
}
