{
  "id": "a0823db5-d460-4237-9e47-6aa3a324e127",
  "title": "My Scalp Was Itchy and Dry Until I Tried a \"Scalp \"Detox\"",
  "link": "https://www.popsugar.com/beauty/scalp-detox-editor-experiment-49232685",
  "description": "I have no problem admitting that I'm an avid TikTok scroller - in fact, I've found some of my best beauty hacks on the app. Whether it's a quick hair trick or an entirely new makeup tutorial from one of my favorite celebrities, although occasionally it takes a little digging, there are plenty of gems to be found. Recently, scalp \"detoxes\" have been all the rage on the platform, and as someone who often deals with a dry, itchy scalp, I was curious about giving them a try. Put simply, a scalp detox helps rid your scalp of product buildup and dead skin cells through exfoliation. If you think about it, it makes a lot of sense. We exfoliate and hydrate our bodies and our faces, so why not our scalps? However, TikTok's take is a little different. Users testing it out were forgoing any hair products for up to a week, then using products or professional treatments to completely clear up any buildup. To try it out, I opted to try a mix of a DIY at-home detox and a professional Keravive scalp detox treatment. I've previously gone a full seven days without washing my hair for a hair \"reset\" experiment, and while the results were great, the actual detoxing period was not fun. I only wash my hair once or twice a week, but skipping it altogether leaves me feeling pretty gross. This time, I patiently waited until the guy I was dating went on a trip to Montana for a week, then I let things get . . . well, greasy. Each night before bed, I used the Diane Shampoo Massage Brush ($9) on dry hair to gently exfoliate, but other than that, I skipped out on products. That meant no dry shampoo, no hair oil - not even a hair stick to keep a slicked-back bun in place. Grease was my only hair product. My Scalp Detox Experience On day seven, when I could no longer stand it, I visited Nassif MD Plastic Surgery in Beverly Hills to try out a Keravive treatment. It was my first time, but essentially, it's like a facial for your scalp. The treatment started with an aesthetician using a suction device to vacuum up debris and gunk from my scalp, section by section. From there, they infused a peptide complex into my skin to help with hydration. The entire treatment took about an hour, and I didn't leave before checking out all of the sh*t they suctioned out of my scalp. Let me tell you: it was gross. After, I left with an at-home scalp spray that I was told to apply the next day and let sit for an hour prior to washing. The next morning, I was practically foaming at the mouth in anticipation of washing my hair. I applied the scalp spray, let it sit while I worked out, then got in the shower. When the shampoo touched my head, it felt heavenly. I was a little worried that so much exfoliation would leave me with more dandruff, so I decided to end my scalp detox with the Briogeo Scalp Revival Cooling Mask ($34). After shampooing once, I left the mask on for 10 minutes, shampooed again, conditioned, then got out of the shower. My Scalp Detox Results After blow-drying my hair, I immediately noticed that my scalp felt better than it had in months. It wasn't itchy, I couldn't see any flakes, and it felt squeaky clean. My roots didn't feel weighed down by product, either. Although I don't plan on adding a Keravive treatment to my monthly routine, I'll probably try to do it every three months as maintenance, but I absolutely plan on doing a DIY scalp detox at home at least once a month and incorporating the Aveda Scalp Solutions Balancing Shampoo ($28). If your scalp is oily, itchy, or flaky, or if you've been experiencing an increased amount of hair shedding, it could be due to buildup, and a scalp detox could help. If you can't get in to get a professional treatment, I'd suggest testing out the Aveda scalp shampoo. Renee Rodriguez (she/her) is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for the PS TikTok and Instagram accounts.",
  "author": "Renee Rodriguez",
  "published": "Thu, 27 Mar 2025 14:05:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Hair",
    "Hair Trends",
    "Scalp",
    "Hype Check",
    "Editor Experiments"
  ],
  "byline": "Renee Rodriguez",
  "length": 4382,
  "excerpt": "One editor tried a scalp detox, where she skipped out on washing her hair for a week and then exfoliated her scalp. See photos and read about her results.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "PS Photography | Renee RodriguezPS Photography | Renee RodriguezWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.I have no problem admitting that I'm an avid TikTok scroller — in fact, I've found some of my best beauty hacks on the app. Whether it's a quick hair trick or an entirely new makeup tutorial from one of my favorite celebrities, although occasionally it takes a little digging, there are plenty of gems to be found. Recently, scalp \"detoxes\" have been all the rage on the platform, and as someone who often deals with a dry, itchy scalp, I was curious about giving them a try. Put simply, a scalp detox helps rid your scalp of product buildup and dead skin cells through exfoliation. If you think about it, it makes a lot of sense. We exfoliate and hydrate our bodies and our faces, so why not our scalps? However, TikTok's take is a little different. Users testing it out were forgoing any hair products for up to a week, then using products or professional treatments to completely clear up any buildup. To try it out, I opted to try a mix of a DIY at-home detox and a professional Keravive scalp detox treatment. I've previously gone a full seven days without washing my hair for a hair \"reset\" experiment, and while the results were great, the actual detoxing period was not fun. I only wash my hair once or twice a week, but skipping it altogether leaves me feeling pretty gross. This time, I patiently waited until the guy I was dating went on a trip to Montana for a week, then I let things get . . . well, greasy. Each night before bed, I used the Diane Shampoo Massage Brush ($9) on dry hair to gently exfoliate, but other than that, I skipped out on products. That meant no dry shampoo, no hair oil — not even a hair stick to keep a slicked-back bun in place. Grease was my only hair product. My Scalp Detox ExperienceOn day seven, when I could no longer stand it, I visited Nassif MD Plastic Surgery in Beverly Hills to try out a Keravive treatment. It was my first time, but essentially, it's like a facial for your scalp. PS Photography | Renee RodriguezThe treatment started with an aesthetician using a suction device to vacuum up debris and gunk from my scalp, section by section. From there, they infused a peptide complex into my skin to help with hydration. The entire treatment took about an hour, and I didn't leave before checking out all of the sh*t they suctioned out of my scalp. Let me tell you: it was gross. After, I left with an at-home scalp spray that I was told to apply the next day and let sit for an hour prior to washing. PS Photography | Renee RodriguezThe next morning, I was practically foaming at the mouth in anticipation of washing my hair. I applied the scalp spray, let it sit while I worked out, then got in the shower. When the shampoo touched my head, it felt heavenly. I was a little worried that so much exfoliation would leave me with more dandruff, so I decided to end my scalp detox with the Briogeo Scalp Revival Cooling Mask ($34). After shampooing once, I left the mask on for 10 minutes, shampooed again, conditioned, then got out of the shower. My Scalp Detox ResultsAfter blow-drying my hair, I immediately noticed that my scalp felt better than it had in months. It wasn't itchy, I couldn't see any flakes, and it felt squeaky clean. My roots didn't feel weighed down by product, either. Although I don't plan on adding a Keravive treatment to my monthly routine, I'll probably try to do it every three months as maintenance, but I absolutely plan on doing a DIY scalp detox at home at least once a month and incorporating the Aveda Scalp Solutions Balancing Shampoo ($28). If your scalp is oily, itchy, or flaky, or if you've been experiencing an increased amount of hair shedding, it could be due to buildup, and a scalp detox could help. If you can't get in to get a professional treatment, I'd suggest testing out the Aveda scalp shampoo. Renee Rodriguez (she/her) is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for the PS TikTok and Instagram accounts.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/YM8RfxBeH64O3crNYX6EBxKB7mw=/0x214:3253x1922/fit-in/3264x2176/top/filters:format_auto():quality(85):upscale()/2023/07/20/009/n/1922153/febd8b0b64b9bfbe79d284.05406884_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv data-element-type=\"ParagraphMainImage\" data-element-index=\"0\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/yKVsT5vEkoGGbsHRqE9g9ifGfEg=/fit-in/792x528/top/filters:format_auto():upscale()/2025/03/27/843/n/1922153/tmp_QkMZOf_2fa9376dccc5b68e_Basic_Collage-3-Main_-_1456x970_54_.png\" alt=\"Scalp Detox Editor Experiment\" width=\"792\" height=\"528\" fetchpriority=\"high\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/yKVsT5vEkoGGbsHRqE9g9ifGfEg=/fit-in/792x528/top/filters:format_auto():upscale()/2025/03/27/843/n/1922153/tmp_QkMZOf_2fa9376dccc5b68e_Basic_Collage-3-Main_-_1456x970_54_.png 1000w, https://media1.popsugar-assets.com/files/thumbor/dRAnWGSF2V2JrVll5Fx7bw9MWP8=/fit-in/1584x1056/top/filters:format_auto():upscale()/2025/03/27/843/n/1922153/tmp_QkMZOf_2fa9376dccc5b68e_Basic_Collage-3-Main_-_1456x970_54_.png 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Renee Rodriguez\u003c/span\u003e\u003c/figcaption\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Renee Rodriguez\u003c/span\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eI have no problem admitting that I\u0026#39;m an avid TikTok scroller — in fact, I\u0026#39;ve found some of my best beauty hacks on the app. Whether it\u0026#39;s a quick \u003ca href=\"https://www.popsugar.com/beauty/invisible-hair-tie-ponytail-hack-49428082\"\u003ehair trick\u003c/a\u003e or an entirely new \u003ca href=\"https://www.popsugar.com/beauty/passport-photo-makeup-how-to-48965585\"\u003emakeup tutorial\u003c/a\u003e from one of my favorite celebrities, although occasionally it takes a little digging, there are plenty of gems to be found. Recently, scalp \u0026#34;detoxes\u0026#34; have been all the rage on the platform, and as someone who often deals with a \u003ca href=\"https://www.popsugar.com/beauty/Causes-Itchy-Scalp-7608023\"\u003edry, itchy scalp\u003c/a\u003e, I was curious about giving them a try. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003ePut simply, a scalp detox helps rid your scalp of product buildup and dead skin cells \u003ca href=\"https://www.popsugar.com/beauty/best-face-scrubs-47248562\"\u003ethrough exfoliation\u003c/a\u003e. If you think about it, it makes a lot of sense. We exfoliate and hydrate our bodies and our faces, so why not our scalps? However, TikTok\u0026#39;s take is a little different. Users testing it out were forgoing any hair products for up to a week, then using products or professional treatments to completely clear up any buildup. To try it out, I opted to try a mix of a DIY at-home detox and a professional Keravive scalp detox treatment. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eI\u0026#39;ve previously gone a full seven days without washing my hair for a \u003ca href=\"https://www.popsugar.com/beauty/hair-detox-editor-experiment-48617885\"\u003ehair \u0026#34;reset\u0026#34; experiment\u003c/a\u003e, and while the results were great, the actual detoxing period was not fun. I only wash my hair once or twice a week, but skipping it altogether leaves me feeling pretty gross. \u003c/p\u003e\u003cp data-element-index=\"3\"\u003eThis time, I patiently waited until the guy I was dating went on a trip to Montana for a week, then I let things get . . . well, greasy. Each night before bed, I used the \u003ca href=\"https://ulta.ztk5.net/c/1141873/164999/3037?u=https%3A%2F%2Fwww.ulta.com%2Fp%2Fshampoo-massage-brush-pimprod2015416%3Fsku%3D2562440%26CATARGETID%3D330000200003045805%26CAPCID%3D519982306226%26CATCI%3Ddsa-1253065341569%26CAAGID%3D122159139059%26CADevice%3Dc%26gclid%3DCjwKCAjwtuOlBhBREiwA7agf1tgzxjQ6VlHFmjeG5J1imi7zBHU3Jij0OTJkEUIsJsn0WLifhWU8-xoCTp8QAvD_BwE\u0026amp;subId1=___psv__p_49232685__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eDiane Shampoo Massage Brush\u003c/a\u003e ($9) on dry hair to gently exfoliate, but other than that, I skipped out on products. That meant no \u003ca href=\"https://www.popsugar.com/beauty/Best-Dry-Shampoo-43600835\"\u003edry shampoo\u003c/a\u003e, no \u003ca href=\"https://www.popsugar.com/beauty/best-hair-oils-35814000\"\u003ehair oil\u003c/a\u003e — not even a hair stick to keep a slicked-back bun in place. Grease was my only hair product. \u003c/p\u003e\u003cdiv\u003e\u003ca href=\"https://ulta.ztk5.net/c/1141873/164999/3037?u=https%3A%2F%2Fwww.ulta.com%2Fp%2Fshampoo-massage-brush-pimprod2015416%3Fsku%3D2562440%26CATARGETID%3D330000200003045805%26CAPCID%3D519982306226%26CATCI%3Ddsa-1253065341569%26CAAGID%3D122159139059%26CADevice%3Dc%26gclid%3DCjwKCAjwtuOlBhBREiwA7agf1tgzxjQ6VlHFmjeG5J1imi7zBHU3Jij0OTJkEUIsJsn0WLifhWU8-xoCTp8QAvD_BwE\u0026amp;subId1=___psv__p_49232685__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"ulta\" data-vars-price=\"$9\" data-vars-href=\"https://www.ulta.com/p/shampoo-massage-brush-pimprod2015416?sku=2562440\u0026amp;CATARGETID=330000200003045805\u0026amp;CAPCID=519982306226\u0026amp;CATCI=dsa-1253065341569\u0026amp;CAAGID=122159139059\u0026amp;CADevice=c\u0026amp;gclid=CjwKCAjwtuOlBhBREiwA7agf1tgzxjQ6VlHFmjeG5J1imi7zBHU3Jij0OTJkEUIsJsn0WLifhWU8-xoCTp8QAvD_BwE\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/YloQFYJYnq1LaHtuHVZRzKtqyK4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/20/995/n/44344577/shopxZX0AZ.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/YloQFYJYnq1LaHtuHVZRzKtqyK4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/20/995/n/44344577/shopxZX0AZ.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/BJGXgwJaa2w6AYLuY4imlEa2VF8=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/20/995/n/44344577/shopxZX0AZ.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/L79PCurUlR6zg51MFWCRJ4pNGh0=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2023/07/20/995/n/44344577/shopxZX0AZ.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"4\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eMy Scalp Detox Experience\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"5\"\u003eOn day seven, when I could no longer stand it, I visited \u003ca href=\"https://www.nassifmdmedspa.com/?utm_source=GMBlisting\u0026amp;utm_medium=organic\u0026amp;utm_campaign=gmb\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49232685__t_w_\" target=\"_blank\"\u003eNassif MD Plastic Surgery\u003c/a\u003e in Beverly Hills to try out a Keravive treatment. It was my first time, but essentially, it\u0026#39;s like a facial for your scalp. \u003c/p\u003e\u003c/div\u003e\u003cfigure data-element-type=\"ParagraphImage\" data-element-index=\"4\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/7GM62mPL8zj3OZQpL4PRLJStU80=/fit-in/600x1067/filters:format_auto():upscale()/2023/07/20/011/n/1922153/tmp_pf12xA_6366b51a8213e341_ezgif.com-video-to-gif_23_.gif\" alt=\"Scalp Detox Editor Experiment \" width=\"600\" height=\"1067\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/7GM62mPL8zj3OZQpL4PRLJStU80=/fit-in/600x1067/filters:format_auto():upscale()/2023/07/20/011/n/1922153/tmp_pf12xA_6366b51a8213e341_ezgif.com-video-to-gif_23_.gif 1000w, https://media1.popsugar-assets.com/files/thumbor/yYlBacbQWqdgqtNDoIAZ1dS3PTQ=/fit-in/1200x2134/filters:format_auto():upscale()/2023/07/20/011/n/1922153/tmp_pf12xA_6366b51a8213e341_ezgif.com-video-to-gif_23_.gif 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Renee Rodriguez\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-element-index=\"0\"\u003eThe treatment started with an aesthetician using a suction device to vacuum up debris and gunk from my scalp, section by section. From there, they infused a peptide complex into my skin to help with hydration. The entire treatment took about an hour, and I didn\u0026#39;t leave before checking out all of the sh*t they suctioned out of my scalp. Let me tell you: it was gross. After, I left with an at-home scalp spray that I was told to apply the next day and let sit for an hour prior to washing. \u003c/p\u003e\u003cfigure data-element-type=\"ParagraphImage\" data-element-index=\"6\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/wSyZ0DOd_CZcH5jlM7yTl8QXINk=/fit-in/792x1405/filters:format_auto():upscale()/2023/07/20/005/n/1922153/tmp_eijfb5_eaaa92e13a77d2e8_IMG_7167.jpg\" alt=\"Scalp Detox Editor Experiment\" width=\"792\" height=\"1405\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/wSyZ0DOd_CZcH5jlM7yTl8QXINk=/fit-in/792x1405/filters:format_auto():upscale()/2023/07/20/005/n/1922153/tmp_eijfb5_eaaa92e13a77d2e8_IMG_7167.jpg 1000w, https://media1.popsugar-assets.com/files/thumbor/YrZv_hnBtSWQEJl2KYk-uCngUWE=/fit-in/1584x2810/filters:format_auto():upscale()/2023/07/20/005/n/1922153/tmp_eijfb5_eaaa92e13a77d2e8_IMG_7167.jpg 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Renee Rodriguez\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"7\"\u003e\u003cp data-element-index=\"0\"\u003eThe next morning, I was practically foaming at the mouth in anticipation of washing my hair. I applied the scalp spray, let it sit while I worked out, then got in the shower. When the shampoo touched my head, it felt heavenly.  \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eI was a little worried that so much exfoliation would leave me with \u003cem\u003emore\u003c/em\u003e dandruff, so I decided to end my scalp detox with the \u003ca href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM\u0026amp;mid=2417\u0026amp;murl=http%3A%2F%2Fwww.sephora.com%2Fproduct%2Fbriogeo-scalp-revival-charcoal-tea-tree-cooling-hydration-mask-dry-itchy-scalp-mask-P469440%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2444073\u0026amp;u1=___psv__p_49232685__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eBriogeo Scalp Revival Cooling Mask\u003c/a\u003e ($34). After shampooing once, I left the mask on for 10 minutes, shampooed again, conditioned, then got out of the shower. \u003c/p\u003e\u003cdiv\u003e\u003ca href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM\u0026amp;mid=2417\u0026amp;murl=http%3A%2F%2Fwww.sephora.com%2Fproduct%2Fbriogeo-scalp-revival-charcoal-tea-tree-cooling-hydration-mask-dry-itchy-scalp-mask-P469440%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2444073\u0026amp;u1=___psv__p_49232685__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"sephora\" data-vars-price=\"$34\" data-vars-href=\"http://www.sephora.com/product/briogeo-scalp-revival-charcoal-tea-tree-cooling-hydration-mask-dry-itchy-scalp-mask-P469440?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2444073\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/kAUIHMKVbXgkF1-sRk8hQb86h9c=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/03/27/987/n/44344577/317ab25267e5d46318dc21.12723301_Briogeo-Scal.webp\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/kAUIHMKVbXgkF1-sRk8hQb86h9c=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/03/27/987/n/44344577/317ab25267e5d46318dc21.12723301_Briogeo-Scal.webp\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ZZs5kBlIcPIN0BDEgLa8nYdJBJw=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/03/27/987/n/44344577/317ab25267e5d46318dc21.12723301_Briogeo-Scal.webp\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/c-wepyqOKKwBJQsCKhU1gPnfA4M=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/03/27/987/n/44344577/317ab25267e5d46318dc21.12723301_Briogeo-Scal.webp\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eMy Scalp Detox Results\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eAfter blow-drying my hair, I immediately noticed that my scalp felt better than it had in months. It wasn\u0026#39;t itchy, I couldn\u0026#39;t see any flakes, and it felt squeaky clean. My roots didn\u0026#39;t feel weighed down by product, either. Although I don\u0026#39;t plan on adding a Keravive treatment to my monthly routine, I\u0026#39;ll probably try to do it every three months as maintenance, but I absolutely plan on doing a DIY scalp detox at home at least once a month and incorporating the \u003ca href=\"http://www.amazon.com/Aveda-Scalp-Solutions-Balancing-Shampoo/dp/B0BRK74S9Z?tag=popsugarshopx-20\u0026amp;asc_source=imdb\u0026amp;asc_campaign=feed\u0026amp;asc_refurl=https://www.popsugar.com/beauty/scalp-detox-editor-experiment-49232685\u0026amp;ascsubtag=___psv__p_49232685__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eAveda Scalp Solutions Balancing Shampoo\u003c/a\u003e ($28). If your scalp is oily, itchy, or flaky, or if you\u0026#39;ve been experiencing an increased amount of hair shedding, it could be due to buildup, and a scalp detox could help. If you can\u0026#39;t get in to get a professional treatment, I\u0026#39;d suggest testing out the Aveda scalp shampoo.  \u003c/p\u003e\u003cdiv\u003e\u003ca href=\"http://www.amazon.com/Aveda-Scalp-Solutions-Balancing-Shampoo/dp/B0BRK74S9Z?tag=popsugarshopx-20\u0026amp;asc_source=imdb\u0026amp;asc_campaign=feed\u0026amp;asc_refurl=https://www.popsugar.com/beauty/scalp-detox-editor-experiment-49232685\u0026amp;ascsubtag=___psv__p_49232685__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"amazon\" data-vars-price=\"$28\" data-vars-href=\"http://www.amazon.com/Aveda-Scalp-Solutions-Balancing-Shampoo/dp/B0BRK74S9Z\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/oVMThWvHaic_h6y90hZAiuM6E-k=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/03/27/988/n/44344577/281fa85c67e5d46f3b1ce2.86466813_Aveda-Scalp-.webp\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/oVMThWvHaic_h6y90hZAiuM6E-k=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/03/27/988/n/44344577/281fa85c67e5d46f3b1ce2.86466813_Aveda-Scalp-.webp\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/pt9gxs77cEAddbRO552Ml164lXc=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/03/27/988/n/44344577/281fa85c67e5d46f3b1ce2.86466813_Aveda-Scalp-.webp\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/gW6CL4S8-DrUC7GLsiRJITIdNEo=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/03/27/988/n/44344577/281fa85c67e5d46f3b1ce2.86466813_Aveda-Scalp-.webp\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"5\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/renee-rodriguez\"\u003eRenee Rodriguez\u003c/a\u003e (she/her) is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for the PS TikTok and Instagram accounts.\u003cbr/\u003e \u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2023-07-24T21:45:03Z",
  "modifiedTime": "2025-03-27T21:05:02Z"
}
