{
  "id": "aa60be63-115d-45e4-b2e0-b251461b36dc",
  "title": "Refinery29 Loves: Everything To See \u0026 Shop In April",
  "link": "https://www.refinery29.com/en-us/fashion-beauty-news-april-2025?utm_source=feed\u0026utm_medium=rss",
  "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. Following the last six months of industry musical chairs, another wave took place in March when it was announced that three major fashion houses were undergoing changes: Demna leaving Balenciaga to become Gucci’s new artistic director, Donatella Versace stepping down as creative director of her namesake legacy brand and Jonathan Anderson leaving Loewe after 11 years at its helm. But career changes weren’t the only headline-worthy fashion moments in March, with Paris Fashion Week providing plenty of moments that stopped the internet. Chappell Roan stepped straight from the 2025 Grammy Awards into the Rick Owens show wearing an alien-inspired, dotted face paint look complete with white contacts. Doechii made her fashion week debut with a gravity-defying blowdry at Schiaparelli, not to mention a frosted green eyeshadow look and black-lined lips for the Acne FROW. Plus, Gigi Hadid made a case for the “silver tequila” bob at the Le Grand Dîner du Louvre. For those on the hunt for even more fashion and beauty inspiration, you’ll be glad to know that April has a slew of exciting releases, launches, and products heading your way. Read ahead to take a look at all the best fashion and beauty bits coming this month.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.Reformation x Devon Lee CarlsonFollowing drops with Laura Harrier and Camille Rowe, Reformation is back with another It Girl collaboration. This time, the brand tapped Devon Lee Carlson to design the new collection. The standout looks of the 20-piece collection include a chocolate polka dot mini dress, a '90s-inspired sky blue co-ord complete with a matching neck scarf, and a backless black lace knit dress — all made using materials like organic cotton and deadstock fabrics.Shop now at ReformationReformation x Devon Lee Carlson Cher Dress, $, available at ReformationOld Navy Launches Special-Occasion Dresses This spring and summer, Old Navy wants you to get dressed up — literally. The retailer just launched The Occasion, a new collection of elevated — and affordable — dresses and separates for special events. With prices ranging from $44.99 to $64.99, the capsule features elegant twist-front maxi dresses, sleek cowl-neck satin gowns, joyful bubble-hem mini dresses, all of which are available in sizes XS to 4X (or 0 to 30). “I’ve designed dresses for women in every scenario — from everyday moments to the red carpet — so it was a pleasure to lend my expertise to Sarah [Holme, Old Navy head of design and product development] and collaborate with the Old Navy design team on The Occasion,” chief creative officer Zac Posen said in a press release. “This collection is elevated, accessible, and truly makes any event feel special.” Shop now at Old Navy Old Navy Satin Cowl Maxi Dress, $, available at Old NavyCoach Becomes Official Partner of the WNBA Professional women’s basketball just got even more stylish because Coach is now an official partner of the WNBA. The deal — which, according to a press release, is meant to encourage players and fans to embrace and express all aspects of their personalities — will pop up in different ways throughout the 2025 season. That includes the WNBA Draft, which was held in New York City on April 14 and saw top prospects like Paige Bueckers (the first overall pick), Hailey Van Lith, and Aneesah Morrow sporting Coach at the event. Another aspect of the partnership? Coach will become the presenting sponsor of WNBA Pride, a platform celebrating the LGBTQ+ community. Photo: GettyJones Road Just Enough Tinted MoisturizerSummer is coming, and that means switching up our coverage in favor of something more warm-weather-appropriate. Jones Road (created by makeup artist Bobbi Brown) is on the case with the launch of the new Just Enough Tinted Moisturizer. Designed to conceal redness and even out the skin tone with light coverage, this product is ideal for those who don’t like to wear a lot of makeup. The silky formula minimizes the appearance of redness and hyperpigmentation without a mask-like finish and provides just enough tint for minimal makeup days. Shop now at Jones Road BeautyJones Road Just Enough Tinted Moisturizer, $, available at Jones RoadCult Gaia Introduces Bridal Collection The brand behind the viral Ark bag and Cassidy Sandal — and the latest Gap collaborator — Cult Gaia is walking down the aisle. The LA brand has just launched its debut bridal collection, and it’s full of sculptural, statement-making styles that break the typical wedding-day mold — think a mini dress made from silk-chiffon braided material, a floral-lace gown with removable sleeves, a plisséd 3-D top, and more. “Crafted for the effortless bride, each piece is thoughtfully created to captivate, inspire, and evoke pure emotion on your most special days,” Cult Gaia founder Jasmin Larian Hekmat said in a press release. Prices range from $428 to $3,498. Shop now at Cult GaiaCult Gaia Henley Dress, $, available at Cult Gaia\u0026 Other Stories’ Heart-filled Savoir CollectionWhen it comes to \u0026 Other Stories’ spring 2025 Savoir Collection, it’s all about love. The latest edition of the brand’s more luxurious, atelier-focused line is made up of cherry reds, blossom pinks, and pieces covered in whimsical heart, lip, and bow motifs. Find a cropped white button-front shirt with beaded detailing on the collar, wide-leg pleated trousers with delicate ties on the leg, a warm-weather-ready maxi dress with sequinned embellishments, and so much more. Shop on April 10 at \u0026 Other Stories The Ordinary Multi-Antioxidant Radiance SerumAntioxidants (think vitamin C) can offer a neutralizing and protective effect against free radicals like UV and pollution, keeping skin bright, bouncy, and smooth. But while one antioxidant is a great start, The Ordinary is now bringing eight key antioxidant ingredients together in its new Multi-Antioxidant Radiance Serum. Here’s why it’s beneficial: Our skin is consistently exposed to the aforementioned environmental aggressors, and these free radicals build up and lead to fine lines, dullness, and uneven skin tone. This serum works hard to prevent that from happening — and our beauty director is already a big fan.Shop now at The Ordinary and SephoraThe Ordinary Multi-Antioxidant Radiance Serum, $, available at SephoraBarbour x CrocsBarbour might be best known for being a favorite of the British Royal Family, but this spring, the heritage label is stepping into a more casual territory, announcing a collaboration with functional footwear brand Crocs. The limited-edition collection contains a wax jacket, two footwear styles in a tartan graphic print, and nine Jibbitz charms, bringing together the playfulness of Crocs and the practicality of Barbour. Festival season, here we come.Shop now at BarbourBarbour x Crocs Oversized Bedale Waxed Jacket, $, available at Barbour​​Dyson Supersonic r™ hair dryer in Ceramic PinkThe beauty world stood still in 2016 when Dyson brought out its first ergonomic hair dryer. Since then, the tech giant has dominated the hair space with the Coralle straightener and the highly coveted Airwrap multi-styler. Recently, the company announced that its professional Supersonic r™ hair dryer will soon be available to the public, having previously only been exclusive to salons and hairstylists. To mark the occasion, you can buy the curve-nozzled dryer in a pearly pink colorway (with a purple gemstone shade available in the summer). The Supersonic r™ is Dyson’s lightest and most powerful hairdryer, offering easier maneuverability in comparison to the original model, as well as specific attachments for straight, wavy, curly and coily hair types.Shop now at Dyson Dyson Supersonic r™ hair dryer, $, available at DysonNomasei Debuts First Stiletto HeelsParis-based footwear brand Nomasei is the label behind the fashion crowd’s favorite stylish (and comfy!) loafer, but it’s not stopping there. For the first time ever, the brand debuted stiletto heels: the Gattaca ($595), a streamlined slingback pump available in embossed white and black patent leathers, and the Before Sunrise ($651), an open-toed sandal with ankle straps also available in embossed black and white leather. According to the press release, Nomasei co-founder Paule Tenaillon was inspired by her years designing classic tango heels in Buenos Aires, where comfort and wearability were all-important. As a result, both styles (which were named for the cult ’90s films) also emphasize arch support and memory foam. Shop now at Nomasei Nomasei Gattaca Pumps, $, available at NomaseiSol de Janeiro Limited-Edition Perfume Mist CollectionIf you ask us, a new season calls for a new scent. Luckily, Sol de Janeiro is launching three fragrances this month, each with its own distinct Powerpuff Girl-esque personality. Flor Mística is spring in a bottle, thanks to notes of orange blossom, flamingo flower, and Brazilian gardenia. Água Mística is for fans of something fresh, with notes of neroli water, salty skin, and tangerine, while Dança Mística is made for the dance floor, with hints of purple fig, warm vanilla, sandalwood, and lily of the valley. Plus, the set comes with a Scent Menu —  tips on how to layer the fragrances to create your own unique combination. Shop now at Sol de JaneiroSol de Janeiro Limited Edition Perfume Mist Trio, $, available at Sol de JaneiroSANDRO x Louise BourgeoisFor the artistic among us, the announcement of Sandro’s latest collection will be joyous news to the ears. Taking inspiration from French-American artist Louise Bourgeois, the spring collection features geometric patterns. In particular, spirals feature heavily in the collection, inspired in part by the artist’s famous “Spider” sculpture. Boasting Mediterranean blues and oat milk neutrals, the collection features linen dresses, silky trousers, and cotton poplin pants — a perfect spring wardrobe.Shop on April 9 at SandroColorwow Texas Hold’em Big Hold Hairspray Colorwow's Texas Hold'em Hairspray is a perfect paradox — it delivers a strong hold yet feels like the lightest hairspray you've ever tried. It kept our beauty director’s waves intact throughout an entire day, an eight-hour night flight, and a lengthy layover in an airport, making it feel almost a shame to wash out. Even better? It offers additional heat and UV protection, shields against frizz-inducing humidity, and brushes out with ease, leaving hair feeling soft and silky, not crispy or chalky. Shop now at SephoraColorWow Texas Hold 'Em Big Hold Hairspray, $, available at SephoraMagda Butrym x H\u0026MEach H\u0026M designer collaboration is an anticipated event. Whether you’ve previously recurred a pair of Simone Rocha beaded drop earrings or a corseted Mugler dress, the collaborations offer a chance to enter the world of luxury at a much sweeter price point. For the latest collection, the Swedish giant has turned to Polish designer Magda Butrym, who has dubbed the 19-piece collection a “celebration of femininity in bloom.” From denim bustiers with 3D rose adornments to shimmering gowns with glittering floral embellishments, this collection is made for spring soirees.Shop on April 24 at H\u0026MLike what you see? How about some more R29 goodness, right here?Refinery29 Loves: Everything To Shop In MarchWe Tried $779 Of Victoria Beckham Beauty16 Under-$100 Buys R29 Editors Tried In March",
  "author": "Alicia Lansom",
  "published": "Wed, 16 Apr 2025 17:05:00 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Alicia Lansom",
  "length": 1512,
  "excerpt": "From new a Reformation collection to a professional Dyson hairdryer, take a look at all the best fashion and beauty bits coming your way this month.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. Following the last six months of industry musical chairs, another wave took place in March when it was announced that three major fashion houses were undergoing changes: Demna leaving Balenciaga to become Gucci’s new artistic director, Donatella Versace stepping down as creative director of her namesake legacy brand and Jonathan Anderson leaving Loewe after 11 years at its helm. But career changes weren’t the only headline-worthy fashion moments in March, with Paris Fashion Week providing plenty of moments that stopped the internet. Chappell Roan stepped straight from the 2025 Grammy Awards into the Rick Owens show wearing an alien-inspired, dotted face paint look complete with white contacts. Doechii made her fashion week debut with a gravity-defying blowdry at Schiaparelli, not to mention a frosted green eyeshadow look and black-lined lips for the Acne FROW. Plus, Gigi Hadid made a case for the “silver tequila” bob at the Le Grand Dîner du Louvre. For those on the hunt for even more fashion and beauty inspiration, you’ll be glad to know that April has a slew of exciting releases, launches, and products heading your way. Read ahead to take a look at all the best fashion and beauty bits coming this month.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.",
  "image": "https://www.refinery29.com/images/11873964.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"r29-container\"\u003e\u003carticle\u003e\u003csection id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eWelcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFollowing the last six months of industry musical chairs, another wave took place in March when it was announced that three major fashion houses were undergoing changes: Demna leaving \u003ca href=\"https://www.refinery29.com/en-us/2021/06/10511689/balenciaga-spring-2022-gucci-crocs\"\u003eBalenciaga\u003c/a\u003e to become Gucci’s new artistic director, Donatella Versace stepping down as creative director of her namesake legacy brand and \u003ca href=\"https://www.refinery29.com/en-us/uniqlo-jw-anderson-spring-summer-2024\"\u003eJonathan Anderson\u003c/a\u003e leaving Loewe after 11 years at its helm. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBut career changes weren’t the only headline-worthy fashion moments in March, with Paris Fashion Week providing plenty of moments that stopped the internet. Chappell Roan stepped straight from the 2025 Grammy Awards into the Rick Owens show wearing an alien-inspired, dotted face paint look complete with white contacts. Doechii made her fashion week debut with a gravity-defying blowdry at Schiaparelli, not to mention a frosted green eyeshadow look and black-lined lips for the Acne FROW. Plus, Gigi Hadid made a case for the “silver tequila” bob at the Le Grand Dîner du Louvre. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor those on the hunt for even more fashion and beauty inspiration, you’ll be glad to know that April has a slew of exciting releases, launches, and products heading your way. Read ahead to take a look at all the best fashion and beauty bits coming this month.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-16T17:05:00Z",
  "modifiedTime": null
}
