{
  "id": "d1063dcb-d879-460e-8484-c45e7085163f",
  "title": "Celebrity Hairstylist Mara Roszak Can Spot an Oscar Winner",
  "link": "https://www.elle.com/beauty/a64052532/mara-roszak-roz-career-interview-2025/",
  "description": "",
  "author": "",
  "published": "Mon, 10 Mar 2025 21:02:00 +0000",
  "source": "https://www.elle.com/rss/beauty.xml/",
  "categories": null,
  "byline": "Kathleen Hou",
  "length": 7356,
  "excerpt": "The multi-hyphenate balances Slack while creating Oscar red-carpet styles.",
  "siteName": "ELLE",
  "favicon": "https://www.elle.com/_assets/design-tokens/elle/static/images/apple-touch-icon.0dd915e.png",
  "text": "In ELLE.com’s series Office Hours, we ask people in powerful positions to take us through their first jobs, worst jobs, and everything in between. This month, we spoke to celebrity hairstylist and brand founder Mara Roszak. In 2021, she created the clean, high-performance hair care line RŌZ, which is now available at Sephora and has won multiple beauty awards. “Building RŌZ has been a dream I’ve had for the longest time,” Roszak tells ELLE.com. “I get to take all the learnings from my day-to-day hair career and pour that knowledge into building this brand.” The entrepreneur also has a special talent for pairing up with the star of the moment. Over the years, she has created the hairstyles for multiple Oscar winners’ big nights: Zoe Saldaña (2024 Best Supporting Actress), Emma Stone twice (2023 and 2017 Best Actress), Michelle Yeoh (2022 Best Actress), and Brie Larson (2016 Best Actress). Below, Roszak talks about the gig that kickstarted her career, her new approach to hiring, and the secret to creating a red-carpet look.My first jobI worked at Starbucks. As a 16-year-old, I took the bus to get to the job. It was an interesting experience, but it was customer service. I faced lots of different people. The scent of a barista apron at the end of the day is unlike anything you could ever imagine. And you don’t want it in a fragrance, I can tell you that much.My worst job I’ve been working in hair since I was 16, so I can really only speak to my experience as a hairdresser. My worst gig was when I had to do someone’s hair on a moving bus—on a bed. There was no table to lay anything out on, and every time the bus moved, I had to adjust how I held my hairdryer or curling iron. We were literally rocking back and forth. Plus, it was the first time I had worked with this client, so it wasn’t the ideal first impression. It was insane, but I’m always up for a challenge.The job that changed everything I did Sarah Michelle Gellar’s hair. I had just graduated beauty school. I had no driver’s license. I grew up in Los Angeles, but I didn’t necessarily know anyone in the industry. My mom is a sculptor, and my dad is a music engineer. But we did have a family friend who was a publicist; I didn’t even know what that was, but she represented a ton of amazing talent and called us out of the blue. She was like, “I know Mara went to beauty school and was doing hair. I have a client. Could she go blow her hair out?”That person turned out to be Sarah. I had my mom drop me off. It was the beginning of a really long relationship. Shortly thereafter, I traveled the world with her because she did press for her movie The Grudge. Publicists started recommending me to other clients, and simultaneously, I got a job as an assistant shampooing hair at a salon in Beverly Hills.An essential lesson I learned at a young ageI was wise enough as an 18-year-old to know I didn’t know everything. I was there to learn and listen to what the client wanted. I’ve learned so much from my clients throughout the years by being open. If there’s been a surprise [in my career], it’s just how lovely these people were and are. I feel so fortunate to be surrounded by such supportive women, who are strong, driven, talented, dedicated, very hard-working, and true and authentic to who they are. Many of these women are now supporters of my business and my brand. We are constantly building each other up, and I get to be there for these huge career moments. How RŌZ first startedWhen you’re behind the chair, you’re talking to people all day long. Some of my very loyal clients say that they remember me talking about the idea for the brand before it began. I’m obsessed with products, and I could not find a styling oil that was lightweight enough for my fine-haired clients and my frizzier texture. It needed to really work across the board on multiple hair types. I wanted it to protect hair from heat, be lightweight, de-frizz, and be a one-stop product for a smooth blowout. My clients were also asking for it.I found a formulator that could help me bring that idea to life, all while working on packaging design. I wanted to avoid single-use plastic by using aluminum and glass. I wanted the brand to be California nature-inspired, and the scent comes from the misty mountains of Big Sur, where I got married, and Laurel Canyon, where I grew up. Our second product we ever launched was Willow Glen, and that’s the street I grew up on.My best career adviceBe open to learning. With RŌZ, we didn’t have the funding to hire [anyone]. It was me, myself and I. I started to “puzzle piece” with people who had skill sets that I didn’t have. I knew enough about supply chain to be dangerous, but eventually, I had to bring in someone who [really was an expert]. When you can’t have a team, pick up the phone and call as many people as possible to really learn how to take that next step.The art of asking for a favorWe don’t know everything all the time. I had to get real with myself, because asking for a favor can feel hard. You don’t want to put anyone out. But when people come to me, I’m so thrilled to be able to help in some way. Especially with building this business, I’ve had to get more and more comfortable with asking for favors, and putting myself in their position. I think you see firsthand that people really do want to help. Reminding yourself of that is key.How I design a red-carpet hairstyle I love creating styles that sort of stand the test of time. My approach to hairstyling is that I always want it to feel approachable. The people that I’m working with tend to have that persona and embody that, too. I bring out what is naturally beautiful about their hair. It will have movement and be free-form. It’s not a heavy-handed approach to hair styling. My RŌZ products are in line with that. They are not products that are hard to use or make the hair look like a hard shell. The biggest lesson I’ve learned as a leaderIt’s really leading with kindness and generosity and giving people the benefit of the doubt. We’re showing up, doing, and trying our best. As a leader, it’s okay to be vulnerable and show you don’t have all the answers. I do say, “I don’t know, but let me look into that.” Or I’ll say, “Hey, team, does anyone have an idea or strong feelings about this?” As a good leader, you have good instincts and intuition, and know when the answer is right for your business.My new approach to hiring It is definitely feeling someone’s enthusiasm. But I also heard another founder share this: Building anything can be challenging, no matter what position you’re being hired for. Now, I share the truth about why they maybe shouldn’t take the role. It’s not to scare them, but just to be honest. I say, “Are you someone who is willing to occasionally take that early morning call because the website is down?” And that is an extreme example. Or will you jump in to support another team member on a project that maybe you weren’t originally signed on to do? Are you willing to take action and ownership in the role and see the project through? It all comes down to expectations. It’s only fair to share the reality of what it can be like. We have a lovely team and culture, but we move very quickly and work very hard, so I try to be very honest at the outset. This interview has been edited and condensed for clarity.",
  "image": "https://hips.hearstapps.com/hmg-prod/images/office-hours-index-67cb0def9b301.png?crop=1.00xw:1.00xh;0,0\u0026resize=1200:*",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-journey-body=\"standard-article\"\u003e\u003cp data-journey-content=\"true\" data-node-id=\"0\"\u003e\u003cem\u003eIn ELLE.com’s series Office Hours, we ask people in powerful positions to take us through their first jobs, worst jobs, and everything in between. This month, we spoke to celebrity hairstylist and brand founder \u003c/em\u003e\u003cem\u003eMara Roszak\u003c/em\u003e\u003cem\u003e.  In 2021, she created the clean, high-performance hair care line RŌZ, which is now \u003ca href=\"https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fbrand%2Froz\u0026amp;u1=ell|xid:{xid}\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.sephora.com/brand/roz\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"available at Sephora\" data-vars-ga-product-id=\"f3cbcb1c-959d-427c-9674-ca537c724200\" rel=\"nofollow\" data-href=\"https://www.sephora.com/brand/roz\" data-product-url=\"https://www.sephora.com/brand/roz\" data-affiliate=\"true\" data-affiliate-url=\"https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fbrand%2Froz\u0026amp;u1=ell|xid:{xid}\" data-affiliate-network=\"{\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/sDlD/sephora-fw-error-www\u0026#34;,\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Trackonomics\u0026#34;},\u0026#34;metadata\u0026#34;:{\u0026#34;trackonomics\u0026#34;:{\u0026#34;network_name\u0026#34;:\u0026#34;ls\u0026#34;}},\u0026#34;product_metadata\u0026#34;:{\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;:{\u0026#34;network_name\u0026#34;:\u0026#34;ls\u0026#34;,\u0026#34;link\u0026#34;:\u0026#34;https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fbrand%2Froz\u0026amp;u1={subid}\u0026#34;}}}\" data-vars-ga-product-price=\"$0.00\" data-vars-ga-product-retailer-id=\"0dbffd92-b739-46a2-8a59-ff7a2259e77e\" data-vars-ga-link-treatment=\"(not set) | (not set)\"\u003eavailable at Sephora\u003c/a\u003e \u003cstrong\u003e\u003c/strong\u003eand has won multiple beauty awards. \u003cstrong\u003e\u003c/strong\u003e\u003c/em\u003e\u003cem\u003e“Building RŌZ has been a dream I’ve had for the longest time,” Roszak tells ELLE.com. “I get to take all the learnings from my day-to-day hair career and pour that knowledge into building this brand.” \u003c/em\u003e\u003cem\u003eThe entrepreneur \u003c/em\u003e\u003cem\u003ealso has a special talent for pairing up with the star of the moment. \u003c/em\u003e\u003cem\u003eOver the years, \u003c/em\u003e\u003cem\u003eshe has created \u003cstrong\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/strong\u003e\u003c/em\u003e\u003cem\u003ethe hairstyles for multiple Oscar winners’ big nights: \u003ca href=\"https://www.elle.com/culture/celebrities/a63989981/zoe-saldana-best-supporting-actress-speech-oscars-2025-transcript/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.elle.com/culture/celebrities/a63989981/zoe-saldana-best-supporting-actress-speech-oscars-2025-transcript/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"Zoe Saldaña\"\u003eZoe Saldaña\u003c/a\u003e \u003cstrong\u003e\u003c/strong\u003e(2024 Best Supporting Actress), Emma Stone twice (2023 and 2017 Best Actress), \u003ca href=\"https://www.elle.com/culture/celebrities/a41539926/michelle-yeoh-interview-elle-women-in-hollywood-2022/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.elle.com/culture/celebrities/a41539926/michelle-yeoh-interview-elle-women-in-hollywood-2022/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"Michelle Yeoh\"\u003eMichelle Yeoh\u003c/a\u003e (2022 Best Actress), and Brie Larson (2016 Best Actress). Below, \u003c/em\u003e\u003cem\u003eRoszak talks about the gig that kickstarted her career, her new approach to hiring, and \u003c/em\u003e\u003cem\u003ethe secret to creating a red-carpet look.\u003c/em\u003e\u003c/p\u003e\u003ch2 data-node-id=\"1\"\u003eMy first job\u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"2\"\u003eI worked at Starbucks. As a 16-year-old, I took the bus to get to the job. It was an interesting experience, but it was customer service. I faced lots of different people. The scent of a barista apron at the end of the day is unlike anything you could ever imagine. And you don’t want it in a fragrance, I can tell you that much.\u003c/p\u003e\u003ch2 data-node-id=\"3\"\u003eMy worst job \u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"4\"\u003eI’ve been working in hair since I was 16, so I can really only speak to my experience as a hairdresser. My worst gig was when I had to do someone’s hair on a moving bus—on a bed. There was no table to lay anything out on, and every time the bus moved, I had to adjust how I held my hairdryer or curling iron. We were literally rocking back and forth. Plus, it was the first time I had worked with this client, so it wasn’t the ideal first impression. It was insane, but I’m always up for a challenge.\u003c/p\u003e\u003ch2 data-node-id=\"6\"\u003eThe job that changed everything \u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"7\"\u003eI did Sarah Michelle Gellar’s hair. I had just graduated beauty school. I had no driver’s license. I grew up in Los Angeles, but I didn’t necessarily know anyone in the industry. My mom is a sculptor, and my dad is a music engineer. But we did have a family friend who was a publicist; I didn’t even know what that was, but she represented a ton of amazing talent and called us out of the blue. She was like, “I know Mara went to beauty school and was doing hair. I have a client. Could she go blow her hair out?”\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"8\"\u003eThat person turned out to be Sarah. I had my mom drop me off. It was the beginning of a really long relationship. Shortly thereafter, I traveled the world with her because she did press for her movie \u003cem\u003eThe Grudge\u003c/em\u003e. Publicists started recommending me to other clients, and simultaneously, I got a job as an assistant shampooing hair at a salon in Beverly Hills.\u003c/p\u003e\u003ch2 data-node-id=\"9\"\u003eAn essential lesson I learned at a young age\u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"10\"\u003eI was wise enough as an 18-year-old to know I didn’t know everything. I was there to learn and listen to what the client wanted. I’ve learned so much from my clients throughout the years by being open. If there’s been a surprise [in my career], it’s just how lovely these people were and are. I feel so fortunate to be surrounded by such supportive women, who are strong, driven, talented, dedicated, very hard-working, and true and authentic to who they are. Many of these women are now supporters of my business and my brand. We are constantly building each other up, and I get to be there for these huge career moments. \u003c/p\u003e\u003cdiv size=\"medium\" data-embed=\"body-image\" data-lazy-id=\"P0-11\" data-node-id=\"11\"\u003e\u003cp\u003e\u003cimg alt=\"personal message and insights from mara roszak\" title=\"personal message and insights from mara roszak\" loading=\"lazy\" width=\"1080\" height=\"2776\" decoding=\"async\" data-nimg=\"1\" sizes=\"100vw\" srcset=\"https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-67cb0e384b978.png?resize=320:* 640w, https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-67cb0e384b978.png?resize=480:* 980w, https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-67cb0e384b978.png?resize=640:* 1120w\" src=\"https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-67cb0e384b978.png?resize=640:*\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003ch2 data-node-id=\"13\"\u003eHow RŌZ first started\u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"14\"\u003eWhen you’re behind the chair, you’re talking to people all day long. Some of my very loyal clients say that they remember me talking about the idea for the brand before it began. I’m obsessed with products, and I could not find a \u003ca href=\"https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fsanta-lucia-heat-protectant-styling-hair-oil-P515292%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2854271%26om_mmc%3Dppc-GG_17791296871___2854271__9060373_c%26country_switch%3Dus%26lang%3Den%26gad_source%3D1%26gclid%3DCj0KCQiAz6q-BhCfARIsAOezPxnOOmVbETp8gFirE1PCAbTpB4JTPs3sZgJ7AedRmFfwL0hAfSVpHXwaAq8gEALw_wcB%26gclsrc%3Daw.ds\u0026amp;u1=ell|xid:{xid}\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.sephora.com/product/santa-lucia-heat-protectant-styling-hair-oil-P515292?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2854271\u0026amp;om_mmc=ppc-GG_17791296871___2854271__9060373_c\u0026amp;country_switch=us\u0026amp;lang=en\u0026amp;gad_source=1\u0026amp;gclid=Cj0KCQiAz6q-BhCfARIsAOezPxnOOmVbETp8gFirE1PCAbTpB4JTPs3sZgJ7AedRmFfwL0hAfSVpHXwaAq8gEALw_wcB\u0026amp;gclsrc=aw.ds\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"styling oil\" data-vars-ga-product-id=\"00a13b21-220d-4642-8e7e-ffcfaab02108\" rel=\"nofollow\" data-href=\"https://www.sephora.com/product/santa-lucia-heat-protectant-styling-hair-oil-P515292?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2854271\u0026amp;om_mmc=ppc-GG_17791296871___2854271__9060373_c\u0026amp;country_switch=us\u0026amp;lang=en\u0026amp;gad_source=1\u0026amp;gclid=Cj0KCQiAz6q-BhCfARIsAOezPxnOOmVbETp8gFirE1PCAbTpB4JTPs3sZgJ7AedRmFfwL0hAfSVpHXwaAq8gEALw_wcB\u0026amp;gclsrc=aw.ds\" data-product-url=\"https://www.sephora.com/product/santa-lucia-heat-protectant-styling-hair-oil-P515292?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2854271\u0026amp;om_mmc=ppc-GG_17791296871___2854271__9060373_c\u0026amp;country_switch=us\u0026amp;lang=en\u0026amp;gad_source=1\u0026amp;gclid=Cj0KCQiAz6q-BhCfARIsAOezPxnOOmVbETp8gFirE1PCAbTpB4JTPs3sZgJ7AedRmFfwL0hAfSVpHXwaAq8gEALw_wcB\u0026amp;gclsrc=aw.ds\" data-affiliate=\"true\" data-affiliate-url=\"https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fsanta-lucia-heat-protectant-styling-hair-oil-P515292%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2854271%26om_mmc%3Dppc-GG_17791296871___2854271__9060373_c%26country_switch%3Dus%26lang%3Den%26gad_source%3D1%26gclid%3DCj0KCQiAz6q-BhCfARIsAOezPxnOOmVbETp8gFirE1PCAbTpB4JTPs3sZgJ7AedRmFfwL0hAfSVpHXwaAq8gEALw_wcB%26gclsrc%3Daw.ds\u0026amp;u1=ell|xid:{xid}\" data-affiliate-network=\"{\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/sEBn/sephora-santa-lucia-heat-protectant-styling\u0026#34;,\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Trackonomics\u0026#34;},\u0026#34;metadata\u0026#34;:{\u0026#34;trackonomics\u0026#34;:{\u0026#34;network_name\u0026#34;:\u0026#34;ls\u0026#34;}},\u0026#34;product_metadata\u0026#34;:{\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;:{\u0026#34;network_name\u0026#34;:\u0026#34;ls\u0026#34;,\u0026#34;link\u0026#34;:\u0026#34;https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fsanta-lucia-heat-protectant-styling-hair-oil-P515292%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2854271%26om_mmc%3Dppc-GG_17791296871___2854271__9060373_c%26country_switch%3Dus%26lang%3Den%26gad_source%3D1%26gclid%3DCj0KCQiAz6q-BhCfARIsAOezPxnOOmVbETp8gFirE1PCAbTpB4JTPs3sZgJ7AedRmFfwL0hAfSVpHXwaAq8gEALw_wcB%26gclsrc%3Daw.ds\u0026amp;u1={subid}\u0026#34;}}}\" data-vars-ga-product-price=\"$0.00\" data-vars-ga-product-retailer-id=\"c852b944-ef45-4028-bb93-052223313f95\" data-vars-ga-link-treatment=\"(not set) | (not set)\"\u003estyling oil\u003c/a\u003e that was lightweight enough for my fine-haired clients and my frizzier texture. It needed to really work across the board on multiple hair types. I wanted it to protect hair from heat, be lightweight, de-frizz, and be a one-stop product for a smooth blowout. My clients were also asking for it.\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"15\"\u003eI found a formulator that could help me bring that idea to life, all while working on packaging design. I wanted to avoid single-use plastic by using aluminum and glass. I wanted the brand to be California nature-inspired, and the scent comes from the misty mountains of Big Sur, where I got married, and Laurel Canyon, where I grew up. Our second product we ever launched was \u003ca href=\"https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fwillow-glen-pre-wash-hair-scalp-oil-P515331%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2854248%26om_mmc%3Dppc-GG_17862731482_145018771328_pla-430665346244_2854248_612880517923_9004425_c%26gad_source%3D1%26gclid%3DCj0KCQiAz6q-BhCfARIsAOezPxlwuNrWU-e2d5myN0aG0jIR53I2CVR8d1gYJA4Ae9k5WObYB6TA1SAaAi3jEALw_wcB%26gclsrc%3Daw.ds\u0026amp;u1=ell|xid:{xid}\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.sephora.com/product/willow-glen-pre-wash-hair-scalp-oil-P515331?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2854248\u0026amp;om_mmc=ppc-GG_17862731482_145018771328_pla-430665346244_2854248_612880517923_9004425_c\u0026amp;gad_source=1\u0026amp;gclid=Cj0KCQiAz6q-BhCfARIsAOezPxlwuNrWU-e2d5myN0aG0jIR53I2CVR8d1gYJA4Ae9k5WObYB6TA1SAaAi3jEALw_wcB\u0026amp;gclsrc=aw.ds\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"Willow Glen\" data-vars-ga-product-id=\"64f4d299-c2a1-4c90-b04d-80da026928d6\" rel=\"nofollow\" data-href=\"https://www.sephora.com/product/willow-glen-pre-wash-hair-scalp-oil-P515331?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2854248\u0026amp;om_mmc=ppc-GG_17862731482_145018771328_pla-430665346244_2854248_612880517923_9004425_c\u0026amp;gad_source=1\u0026amp;gclid=Cj0KCQiAz6q-BhCfARIsAOezPxlwuNrWU-e2d5myN0aG0jIR53I2CVR8d1gYJA4Ae9k5WObYB6TA1SAaAi3jEALw_wcB\u0026amp;gclsrc=aw.ds\" data-product-url=\"https://www.sephora.com/product/willow-glen-pre-wash-hair-scalp-oil-P515331?country_switch=us\u0026amp;lang=en\u0026amp;skuId=2854248\u0026amp;om_mmc=ppc-GG_17862731482_145018771328_pla-430665346244_2854248_612880517923_9004425_c\u0026amp;gad_source=1\u0026amp;gclid=Cj0KCQiAz6q-BhCfARIsAOezPxlwuNrWU-e2d5myN0aG0jIR53I2CVR8d1gYJA4Ae9k5WObYB6TA1SAaAi3jEALw_wcB\u0026amp;gclsrc=aw.ds\" data-affiliate=\"true\" data-affiliate-url=\"https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fwillow-glen-pre-wash-hair-scalp-oil-P515331%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2854248%26om_mmc%3Dppc-GG_17862731482_145018771328_pla-430665346244_2854248_612880517923_9004425_c%26gad_source%3D1%26gclid%3DCj0KCQiAz6q-BhCfARIsAOezPxlwuNrWU-e2d5myN0aG0jIR53I2CVR8d1gYJA4Ae9k5WObYB6TA1SAaAi3jEALw_wcB%26gclsrc%3Daw.ds\u0026amp;u1=ell|xid:{xid}\" data-affiliate-network=\"{\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/sDkm/sephora-willow-glen-pre-wash-hair\u0026#34;,\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Trackonomics\u0026#34;},\u0026#34;metadata\u0026#34;:{\u0026#34;trackonomics\u0026#34;:{\u0026#34;network_name\u0026#34;:\u0026#34;ls\u0026#34;}},\u0026#34;product_metadata\u0026#34;:{\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;:{\u0026#34;network_name\u0026#34;:\u0026#34;ls\u0026#34;,\u0026#34;link\u0026#34;:\u0026#34;https://click.linksynergy.com/deeplink?id=SyrN4SGJMyU\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fwillow-glen-pre-wash-hair-scalp-oil-P515331%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2854248%26om_mmc%3Dppc-GG_17862731482_145018771328_pla-430665346244_2854248_612880517923_9004425_c%26gad_source%3D1%26gclid%3DCj0KCQiAz6q-BhCfARIsAOezPxlwuNrWU-e2d5myN0aG0jIR53I2CVR8d1gYJA4Ae9k5WObYB6TA1SAaAi3jEALw_wcB%26gclsrc%3Daw.ds\u0026amp;u1={subid}\u0026#34;}}}\" data-vars-ga-product-price=\"$0.00\" data-vars-ga-product-retailer-id=\"de11212b-de26-42ce-8511-c01d63d84ab4\" data-vars-ga-link-treatment=\"(not set) | (not set)\"\u003eWillow Glen\u003c/a\u003e, and that’s the street I grew up on.\u003c/p\u003e\u003ch2 data-node-id=\"16\"\u003eMy best career advice\u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"17\"\u003eBe open to learning. With RŌZ, we didn’t have the funding to \u003cstrong\u003e\u003c/strong\u003ehire [anyone]. It was me, myself and I. I started to “puzzle piece” \u003cstrong\u003e\u003c/strong\u003ewith people who had skill sets that I didn’t have. I knew enough about supply chain to be dangerous, but eventually, I had to bring in someone who [really was an expert]. When you can’t have a team, pick up the phone and call as many people as possible to really learn how to take that next step.\u003c/p\u003e\u003ch2 data-node-id=\"18\"\u003eThe art of asking for a favor\u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"19\"\u003eWe don’t know everything all the time. I had to get real with myself, because asking for a favor can feel hard. You don’t want to put anyone out. But when people come to me, I’m so thrilled to be able to help in some way. Especially with building this business, I’ve had to get more and more comfortable with asking for favors, and putting myself in their position. I think you see  firsthand that people really do want to help. Reminding yourself of that is key.\u003c/p\u003e\u003cdiv size=\"medium\" data-embed=\"body-image\" data-lazy-id=\"P0-12\" data-node-id=\"20\"\u003e\u003cp\u003e\u003cimg alt=\"personal note detailing morning routines and hair care from mara roszak\" title=\"personal note detailing morning routines and hair care from mara roszak\" loading=\"lazy\" width=\"1080\" height=\"2760\" decoding=\"async\" data-nimg=\"1\" sizes=\"100vw\" srcset=\"https://hips.hearstapps.com/hmg-prod/images/office-hours-image-2-67cb0e72b4da2.png?resize=320:* 640w, https://hips.hearstapps.com/hmg-prod/images/office-hours-image-2-67cb0e72b4da2.png?resize=480:* 980w, https://hips.hearstapps.com/hmg-prod/images/office-hours-image-2-67cb0e72b4da2.png?resize=640:* 1120w\" src=\"https://hips.hearstapps.com/hmg-prod/images/office-hours-image-2-67cb0e72b4da2.png?resize=640:*\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003ch2 data-node-id=\"21\"\u003eHow I design a red-carpet hairstyle \u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"22\"\u003eI love creating styles that sort of stand the test of time. My approach to hairstyling is that I always want it to feel approachable. The people that I’m working with tend to have that persona and embody that, too. I bring out what is naturally beautiful about their hair. It will have movement and be free-form. It’s not a heavy-handed approach to hair styling. My RŌZ products are in line with that. They are not products that are hard to use or make the hair look like a hard shell. \u003c/p\u003e\u003ch2 data-node-id=\"23\"\u003eThe biggest lesson I’ve learned as a leader\u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"24\"\u003eIt’s really leading with kindness and generosity and giving people the benefit of the doubt. We’re showing up, doing, and trying our best. As a leader, it’s okay to be vulnerable and show you don’t have all the answers. I do say, “I don’t know, but let me look into that.” Or I’ll say, “Hey, team, does anyone have an idea or strong feelings about this?” As a good leader, you have good instincts and intuition, and know when the answer is right for your business.\u003c/p\u003e\u003ch2 data-node-id=\"25\"\u003eMy new approach to hiring \u003c/h2\u003e\u003cp data-journey-content=\"true\" data-node-id=\"26\"\u003e It is definitely feeling someone’s enthusiasm. But I also heard another founder share this: Building anything can be challenging, no matter what position you’re being hired for. Now, I share the truth about why they maybe shouldn’t take the role. It’s not to scare them, but just to be honest. \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"27\"\u003eI say, “Are you someone who is willing to occasionally take that early morning call because the website is down?” And that is an extreme example. Or will you jump in to support another team member on a project that maybe you weren’t originally signed on to do? Are you willing to take action and ownership in the role and see the project through?  It all comes down to expectations. It’s only fair to  share the reality of what it can be like.  We have a lovely team and culture, but we move very quickly and work very hard, so I try to be very honest at the outset. \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"28\"\u003e\u003cem\u003eThis interview has been edited and condensed for clarity.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-10T21:02:59.014712-04:00",
  "modifiedTime": "2025-03-10T21:02:00Z"
}
