{
  "id": "fb543b72-5dc3-435e-bdb1-c0648ef28c86",
  "title": "We're Obsessed With the \"Wolf Cut\" Hair Trend",
  "link": "https://www.popsugar.com/beauty/wolf-cut-haircut-trend-48379219",
  "description": "We don't need to tell you that shag and mullet haircuts have been all the rage for the last year - celebrity examples like Rihanna, Keke Palmer, Debby Ryan, Billie Eilish, and Miley Cyrus are all the proof you need - but a new type of haircut called the \"wolf cut\" is threatening to eclipse both of those styles, and it's all thanks to TikTok. The wolf cut haircut is everywhere right now, but what exactly is it, and why is everyone so obsessed? Keep reading to learn more. Experts Featured in This Article Sally Hershberger is a celebrity hairstylist, founder of hair-care brand Sally Hershberger 24K, and a salon owner. What Is a Wolf Cut? If the shag and the mullet had a baby, you'd have the wolf haircut. It combines the length and volume of a mullet with the choppy layers of a shag for a very wild and edgy new look. \"[It's] a softer take on the mullet,\" celebrity hairstylist Sally Hershberger says. \"It's a really cool, lived-in, sexy look that has lots of movement and layers.\" The main difference between the updated \"wolf cut\" and your classic mullet is where the layers sit. Instead of the style being layer-heavy only at the top of the head, they're spread throughout. Although people on TikTok are cutting their hair themselves to get the look at home, a professional hairstylist will help you get the shape just right. Although the wolf cut only recently hit the mainstream consciousness here, the style has been a long-time favorite in South Korea. Many K-pop stars - namely Choi Beomgyu of the band Tomorrow X Together (TXT) - have worn the choppy, short-in-the-front, long-in-the-back hairstyle for quite some time. How to Get the Wolf Haircut At the salon, ask your stylist for a wolf cut and come prepared with reference photos. \"Ask your stylist for lots of shaggy, wavy layers,\" says Hershberger. \"Depending on the look you want, you can also go for bangs or curtain bangs, which both look really cool with this cut.\" She emphasizes that the trend can be as dramatic as you want it to be, meaning you can ask your stylist for even more texture for a true wolf-like look or keep it on the subtler side. How to Style a Wolf Cut Wolf cut hair isn't difficult to style but it does require some daily maintenance. Should you choose to leave it as is, depending on your hair type, the style won't have as much volume and may fall flat. If you have straight hair, curling it or blowing it out roughly will help give it more shape. If your hair is already curly or wavy, you can let it air dry. In terms of styling products, look for volume-boosting formulas and products that will add texture. Try sea salt sprays, texturizing pomades, and wavy-enhancing creams, and work them into your hair with your fingertips. We recommend the Not Your Mother's Sea Salt Spray ($10), the IGK Beach Club Soft Styling Paste ($25), and the Ouidad Curl Shaper Bounce Back Reactivating Mist ($24). To refresh the style throughout the day, simply tousle it with your fingertips to rough it up. Check out more examples of the wolf cut hairstyle ahead.",
  "author": "Jessica Harrington",
  "published": "Tue, 10 Jun 2025 10:25:01 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Beauty Trends",
    "Hair",
    "Hair Trends",
    "Haircuts"
  ],
  "byline": "Jessica Harrington",
  "length": 3266,
  "excerpt": "The wolf cut haircut is a mix of a shag and a mullet haircut. The style comes from Korea, works on straight and curly hair, and is great for all hair types",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.We don't need to tell you that shag and mullet haircuts have been all the rage for the last year — celebrity examples like Rihanna, Keke Palmer, Debby Ryan, Billie Eilish, and Miley Cyrus are all the proof you need — but a new type of haircut called the \"wolf cut\" is threatening to eclipse both of those styles, and it's all thanks to TikTok. The wolf cut haircut is everywhere right now, but what exactly is it, and why is everyone so obsessed? Keep reading to learn more. Experts Featured in This ArticleSally Hershberger is a celebrity hairstylist, founder of hair-care brand Sally Hershberger 24K, and a salon owner. What Is a Wolf Cut?If the shag and the mullet had a baby, you'd have the wolf haircut. It combines the length and volume of a mullet with the choppy layers of a shag for a very wild and edgy new look. \"[It's] a softer take on the mullet,\" celebrity hairstylist Sally Hershberger says. \"It's a really cool, lived-in, sexy look that has lots of movement and layers.\" The main difference between the updated \"wolf cut\" and your classic mullet is where the layers sit. Instead of the style being layer-heavy only at the top of the head, they're spread throughout. Although people on TikTok are cutting their hair themselves to get the look at home, a professional hairstylist will help you get the shape just right. Although the wolf cut only recently hit the mainstream consciousness here, the style has been a long-time favorite in South Korea. Many K-pop stars — namely Choi Beomgyu of the band Tomorrow X Together (TXT) — have worn the choppy, short-in-the-front, long-in-the-back hairstyle for quite some time. How to Get the Wolf HaircutAt the salon, ask your stylist for a wolf cut and come prepared with reference photos. \"Ask your stylist for lots of shaggy, wavy layers,\" says Hershberger. \"Depending on the look you want, you can also go for bangs or curtain bangs, which both look really cool with this cut.\" She emphasizes that the trend can be as dramatic as you want it to be, meaning you can ask your stylist for even more texture for a true wolf-like look or keep it on the subtler side. How to Style a Wolf CutWolf cut hair isn't difficult to style but it does require some daily maintenance. Should you choose to leave it as is, depending on your hair type, the style won't have as much volume and may fall flat. If you have straight hair, curling it or blowing it out roughly will help give it more shape. If your hair is already curly or wavy, you can let it air dry. In terms of styling products, look for volume-boosting formulas and products that will add texture. Try sea salt sprays, texturizing pomades, and wavy-enhancing creams, and work them into your hair with your fingertips. We recommend the Not Your Mother's Sea Salt Spray ($10), the IGK Beach Club Soft Styling Paste ($25), and the Ouidad Curl Shaper Bounce Back Reactivating Mist ($24). To refresh the style throughout the day, simply tousle it with your fingertips to rough it up. Check out more examples of the wolf cut hairstyle ahead.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/Yj1v7RFYSLWcPqKRQtpPsfpDaeg=/282x238:2210x1250/fit-in/2667x4000/filters:format_auto():quality(85):upscale()/2021/06/17/832/n/1922153/689c981360cb9b909ea946.21763662_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eWe don\u0026#39;t need to tell you that \u003ca href=\"https://www.popsugar.com/beauty/shag-haircuts-45708173/1000\"\u003eshag\u003c/a\u003e and \u003ca href=\"https://www.popsugar.com/beauty/Mullet-Haircut-Trend-45900249\"\u003emullet haircuts\u003c/a\u003e have been all the rage for the last year — celebrity examples like Rihanna, Keke Palmer, Debby Ryan, Billie Eilish, and Miley Cyrus are all the proof you need — but a new type of haircut called the \u0026#34;\u003ca href=\"https://www.tiktok.com/@noordabashh/video/6932116644638526726?ref=popsugar.com\u0026amp;=___psv__p_48379219__t_w_\" target=\"_blank\"\u003ewolf cut\u003c/a\u003e\u0026#34; is threatening to eclipse both of those styles, and it\u0026#39;s all thanks to TikTok. The wolf cut haircut is everywhere right now, but what exactly is it, and why is everyone so obsessed? Keep reading to learn more.  \u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch3\u003eExperts Featured in This Article\u003c/h3\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003e\u003ca href=\"https://www.instagram.com/sallyhershberger/?hl=en\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_48379219__t_w_\" target=\"_blank\"\u003eSally Hershberger\u003c/a\u003e is a celebrity hairstylist, founder of hair-care brand Sally Hershberger 24K, and a salon owner.\u003cbr/\u003e \u003c/p\u003e\u003cp data-element-index=\"5\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat Is a Wolf Cut?\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eIf the shag and the mullet had a baby, you\u0026#39;d have the wolf haircut. It combines the \u003ca href=\"https://www.popsugar.com/beauty/how-make-hair-thicker-48725463\"\u003elength and volume\u003c/a\u003e of a mullet with the choppy layers of a shag for a very wild and edgy new look. \u0026#34;[It\u0026#39;s] a softer take on the mullet,\u0026#34; celebrity hairstylist \u003ca href=\"https://www.instagram.com/sallyhershberger/?hl=en\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_48379219__t_w_\" target=\"_blank\"\u003eSally Hershberger\u003c/a\u003e says. \u0026#34;It\u0026#39;s a really cool, lived-in, sexy look that has lots of movement and \u003ca href=\"https://www.popsugar.com/beauty/layered-haircuts-49089591\"\u003elayers\u003c/a\u003e.\u0026#34;  \u003c/p\u003e\u003cp data-element-index=\"7\"\u003eThe main difference between the updated \u0026#34;wolf cut\u0026#34; and your classic mullet is where the layers sit. Instead of the style being layer-heavy only at the top of the head, they\u0026#39;re spread throughout. Although people on TikTok are cutting their hair themselves to get the look at home, a professional hairstylist will help you get the shape just right.  \u003c/p\u003e\u003cp data-element-index=\"8\"\u003eAlthough the wolf cut only recently hit the mainstream consciousness \u003cem\u003ehere\u003c/em\u003e, the style has been a long-time favorite in South Korea. Many K-pop stars — namely Choi Beomgyu of the band Tomorrow X Together (TXT) — have worn the choppy, short-in-the-front, long-in-the-back hairstyle for quite some time.  \u003c/p\u003e\u003cp data-element-index=\"9\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eHow to Get the Wolf Haircut\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"10\"\u003eAt the salon, ask your stylist for a wolf cut and come prepared with reference photos. \u0026#34;Ask your stylist for lots of shaggy, wavy layers,\u0026#34; says Hershberger. \u0026#34;Depending on the look you want, you can also go for bangs or curtain bangs, which both look really cool with this cut.\u0026#34; She emphasizes that the trend can be as dramatic as you want it to be, meaning you can ask your stylist for even \u003ca href=\"https://www.popsugar.com/beauty/What-My-Natural-Hair-Type-36337831\"\u003emore texture\u003c/a\u003e for a true wolf-like look or keep it on the subtler side. \u003c/p\u003e\u003cp data-element-index=\"11\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eHow to Style a Wolf Cut\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"12\"\u003eWolf cut hair isn\u0026#39;t difficult to style but it does require some daily maintenance. Should you choose to leave it as is, depending on your hair type, the style won\u0026#39;t have as much volume and may fall flat. If you have straight hair, curling it or blowing it out roughly will help give it more shape. If your hair is already curly or wavy, you can let it air dry. \u003c/p\u003e\u003cp data-element-index=\"13\"\u003eIn terms of styling products, look for volume-boosting formulas and products that will add texture. Try sea salt sprays, texturizing pomades, and wavy-enhancing creams, and work them into your hair with your fingertips. We recommend the \u003ca href=\"https://ulta.ztk5.net/c/1141873/164999/3037?u=http%3A%2F%2Fwww.ulta.com%2Fp%2Fbeach-babe-soft-waves-texturizing-spray-xlsImpprod13451001%3Fsku%3D2297693\u0026amp;subId1=___psv__p_48379219__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eNot Your Mother\u0026#39;s Sea Salt Spray\u003c/a\u003e ($10), the \u003ca href=\"http://www.amazon.com/IGK-Beach-Styling-Buildable-texture/dp/B08BQF3XZ6/?tag=popsugarshopx-20\u0026amp;asc_source=flipboard\u0026amp;asc_campaign=feed\u0026amp;asc_refurl=https://www.popsugar.com/beauty/wolf-cut-haircut-trend-48379219\u0026amp;ascsubtag=___psv__p_48379219__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eIGK Beach Club Soft Styling Paste\u003c/a\u003e ($25), and the \u003ca href=\"https://ulta.ztk5.net/c/1141873/164999/3037?u=http%3A%2F%2Fwww.ulta.com%2Fp%2Fcurl-shaper-bounce-back-reactivating-mist-pimprod2019181%3Fsku%3D2569967\u0026amp;subId1=___psv__p_48379219__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eOuidad Curl Shaper Bounce Back Reactivating Mist\u003c/a\u003e ($24). \u003c/p\u003e\u003cp data-element-index=\"14\"\u003eTo refresh the style throughout the day, simply tousle it with your fingertips to rough it up.   \u003c/p\u003e\u003cp data-element-index=\"15\"\u003eCheck out more examples of the wolf cut hairstyle ahead.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2021-06-18T15:01:05Z",
  "modifiedTime": "2025-06-10T17:25:01Z"
}
