{
  "id": "11c701ac-8df4-450d-bee2-b4b5164af77f",
  "title": "Today in Apple history: Apple IIe becomes a high-profit hit",
  "link": "https://www.cultofmac.com/apple-history/apple-iie-launch",
  "description": "On January 1, 1983, Apple launched the Apple IIe, the third model in the series (and the last before the Macintosh's arrival a year later). (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Luke Dormehl",
  "published": "Wed, 01 Jan 2025 18:00:38 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "Apple history",
    "TIAH: 1980s",
    "Today in Apple history"
  ],
  "byline": "Luke Dormehl",
  "length": 2291,
  "excerpt": "On January 1, 1983, Apple launched the Apple IIe, the third model in the series (and the last before the Macintosh's arrival a year later).",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "Apple history The Apple IIe became a top-selling computer for Cupertino. Photo: Bilby/Wikipedia CC January 1, 1983: Apple launches the Apple IIe, the third model in the Apple II series — and the last before the Macintosh will arrive a year later. It proves a big seller, and proof positive of the Apple II brand’s sustained value. Apple IIe: The unplanned update The Apple IIe took over from the Apple II Plus. Originally, Apple planned to abandon the Apple II with that model and replace the product line with the Apple III. However, the continued popularity of the Apple II, and the failure of the Apple III — largely thanks to its high price and some glaring engineering faults — pushed Apple to upgrade its proven hit product for another go-around. (In the end, Apple continued producing some version of the Apple II until the early 1990s.) The Apple IIe added as standard some of the functionality that Apple II enthusiasts already enjoyed, thanks to the new model’s impressive number of expansion slots. Features included 80-column text-mode support, 64KB of RAM (expandable up to 128KB) and, for the first time, lowercase letters! It also dropped the chip count on the motherboard from more than 100 to just 31. That let Apple squeeze out more profit from each machine sold. In fact, the Apple IIe sold for approximately three times more than the computer cost to manufacture. A critical and commercial success The Apple IIe received a great reception upon its release. Byte magazine described it as “like having an Apple II with all the extras built in … with a variety of exciting new features and capabilities” for little extra cost. The computer produced strong sales numbers, moving 60,000 to 70,000 units per month by May 1983. (This was about twice the average of its predecessor, the Apple II Plus.) And the new computer had legs: The Apple IIe continued as the bestselling Apple II model even after Cupertino released its successor, the Apple IIc, in 1984. At a time when Apple’s other computers, the Lisa (released the same month) and the Apple III, failed to catch on, the Apple IIe stacked up as an undisputed winner. Do you remember the Apple IIe? Did you own one? Let us know in the comments below.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2017/12/Apple_IIe.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-520945\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/apple-history\" title=\"Apple history\" aria-label=\"Apple history articles\"\u003eApple history\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Today in Apple history: Apple IIe becomes a high-profit hit\" src=\"https://www.cultofmac.com/wp-content/uploads/2017/12/Apple_IIe.jpg\" alt=\"Apple IIe\" data-ratio=\"1.6659436008677\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tThe Apple IIe became a top-selling computer for Cupertino. \u003cbr/\u003e\u003cem\u003ePhoto: \u003ca href=\"https://en.wikipedia.org/wiki/Apple_IIe#/media/File:Apple_IIe.jpg\" title=\"\" target=\"_self\"\u003eBilby/Wikipedia CC\u003c/a\u003e\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003e\u003cimg decoding=\"async\" title=\"January 1: Today in Apple history\" src=\"https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan.jpg\" alt=\"January 1: Today in Apple history\" width=\"80\" height=\"80\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan.jpg 80w, https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan-1472x1472.jpg 1472w, https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan-1104x1104.jpg 1104w, https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan-912x912.jpg 912w, https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan-550x550.jpg 550w, https://www.cultofmac.com/wp-content/uploads/2017/12/1Jan-470x470.jpg 470w\" sizes=\"(max-width: 80px) 100vw, 80px\"/\u003e \u003cstrong\u003eJanuary 1, 1983:\u003c/strong\u003e Apple launches the Apple IIe, the third model in the Apple II series — and the last before the \u003ca href=\"https://www.cultofmac.com/463776/tiah-first-mac-ships/\" data-lasso-id=\"195494\"\u003eMacintosh will arrive\u003c/a\u003e a year later.\u003c/p\u003e\u003cspan data-ez-ph-id=\"901\"\u003e\u003c/span\u003e\n\u003cp\u003eIt proves a big seller, and proof positive of the Apple II brand’s sustained value.\u003c/p\u003e\n\n\u003ch2\u003eApple IIe: The unplanned update\u003c/h2\u003e\n\u003cp\u003eThe Apple IIe took over from the Apple II Plus. Originally, Apple planned to abandon the \u003ca href=\"https://www.cultofmac.com/apple-ii\" data-lasso-id=\"1641670324\"\u003eApple II\u003c/a\u003e with that model and replace the product line with the Apple III. However, the continued popularity of the Apple II, and the \u003ca href=\"https://www.cultofmac.com/456432/today-in-apple-history-too-little-too-late-for-apple-iii/\" data-lasso-id=\"1641670325\"\u003efailure of the Apple III\u003c/a\u003e — largely thanks to its high price and some glaring engineering faults — pushed Apple to upgrade its proven hit product for another go-around. (In the end, Apple continued producing some version of the Apple II until the early 1990s.)\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eThe Apple IIe added as standard some of the functionality that Apple II enthusiasts already enjoyed, thanks to the new model’s impressive number of expansion slots. Features included 80-column text-mode support, 64KB of RAM (expandable up to 128KB) and, for the first time, \u003ca href=\"https://www.vintagecomputing.com/index.php/archives/2833/why-the-apple-ii-didnt-support-lowercase-letters\" data-lasso-id=\"195496\" target=\"_blank\"\u003e\u003cem\u003elowercase letters\u003c/em\u003e\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003eIt also dropped the chip count on the motherboard from more than 100 to just 31. That let Apple squeeze out more profit from each machine sold. In fact, the Apple IIe sold for approximately three times more than the computer cost to manufacture.\u003c/p\u003e\u003cspan data-ez-ph-id=\"910\"\u003e\u003c/span\u003e\n\u003ch3\u003eA critical and commercial success\u003c/h3\u003e\n\u003cp\u003eThe Apple IIe received a great reception upon its release. \u003cem\u003eByte\u003c/em\u003e magazine described it as “like having an Apple II with all the extras built in … with a variety of exciting new features and capabilities” for little extra cost.\u003c/p\u003e\n\u003cp\u003eThe computer produced strong sales numbers, moving 60,000 to 70,000 units per month by May 1983. (This was about twice the average of its predecessor, the Apple II Plus.) And the new computer had legs: The Apple IIe continued as the bestselling Apple II model even after Cupertino released its successor, the \u003ca href=\"https://apple2history.org/history/ah08/\" data-lasso-id=\"195497\" target=\"_blank\"\u003eApple IIc\u003c/a\u003e, in 1984.\u003c/p\u003e\u003cspan data-ez-ph-id=\"911\"\u003e\u003c/span\u003e\n\u003cp\u003eAt a time when Apple’s other computers, the \u003ca href=\"https://www.cultofmac.com/520689/lisa-source-code-free-2018/\" data-lasso-id=\"195498\"\u003eLisa\u003c/a\u003e (released the same month) and the Apple III, failed to catch on, the Apple IIe stacked up as an undisputed winner.\u003c/p\u003e\n\u003cp\u003eDo you remember the Apple IIe? Did you own one? Let us know in the comments below.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-01T18:00:38Z",
  "modifiedTime": "2025-01-01T18:00:19Z"
}
