{
  "id": "16d80cf3-3c28-484a-8e11-cf6f0a92ff1e",
  "title": "Apple’s Worldwide Developers Conference kicks off June 9",
  "link": "https://www.apple.com/newsroom/2025/05/apples-worldwide-developers-conference-kicks-off-june-9/",
  "description": "",
  "author": "Apple Newsroom",
  "published": "2025-05-20T14:59:21.694Z",
  "source": "https://www.apple.com/newsroom/rss-feed.rss",
  "categories": [
    "UPDATE"
  ],
  "byline": "",
  "length": 4917,
  "excerpt": "Today, Apple unveiled an exciting lineup for its annual Worldwide Developers Conference, including the Keynote address.",
  "siteName": "Apple Newsroom",
  "favicon": "",
  "text": "opens in new window Apple’s Worldwide Developers Conference kicks off June 9 The annual online conference takes place June 9-13, promising a week of technology, innovation, and creativity Today, Apple unveiled an exciting lineup for its annual Worldwide Developers Conference (WWDC), including the Keynote and Platforms State of the Union. Taking place June 9-13, the free online conference will bring the global Apple developer community together to provide insights into the latest Apple tools, technologies, and features. Throughout the week, developers around the world can connect with Apple engineers, designers, and evangelists, and watch more than 100 sessions that will help them discover the newest enhancements to build platform-differentiating apps and games across Apple products. Apple will also welcome more than 1,000 developers and students to celebrate in person during a special event at Apple Park on June 9. Apple Keynote June 9, 10 a.m. PDT WWDC25 kicks off with a first look at the groundbreaking updates coming to Apple platforms. The Keynote will be available to stream on apple.com, the Apple TV app, and the Apple YouTube channel. On-demand playback will be available after the conclusion of the stream. Platforms State of the Union June 9, 1 p.m. PDT Following the Keynote, the Platforms State of the Union will take a deeper dive into the new tools that will further empower Apple developers, including advances across iOS, iPadOS, macOS, tvOS, visionOS, and watchOS. The Platforms State of the Union will be available to stream on the Apple Developer app, website, and Apple Developer YouTube channel. On-demand playback will be available after the conclusion of the stream. Video Sessions and Guides With over 100 technical sessions, WWDC25 offers developers a chance to dive deep into the latest technologies and frameworks with Apple experts. Sessions will be available on the Apple Developer app, website, and YouTube channel. Developers will also be able to access guides and documentation that can help walk them through the conference’s biggest announcements and highlights. Group and One-on-One Labs Apple Developer Program members and Apple Developer Enterprise Program members will have a chance to connect directly with Apple experts through online group labs and one-on-one appointments. Developers can join group labs to learn about the week’s biggest announcements in real time, or set up online appointments for guidance on topics including Apple Intelligence, design, developer tools, graphics and games, machine learning, Swift, and more. Apple engineers and designers will also be available on the Apple Developer Forums. Swift Student Challenge Apple is proud to support developers through the Swift Student Challenge, one of many Apple programs that seek to uplift the next generation of entrepreneurs, coders, and designers. For the second year, 50 Distinguished Winners have been recognized for outstanding submissions and will visit Apple Park for a special three-day experience. Stay up to date with the latest articles from Apple Newsroom.",
  "image": "https://www.apple.com/newsroom/images/2025/05/apples-worldwide-developers-conference-kicks-off-june-9/tile/Apple-WWDC25-event-details-hero-lp.jpg.og.jpg?202505212014",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\t\n    \n\n\n\n\n\n\n\n \n\u003cnav id=\"ac-localnav\" lang=\"en-US\" role=\"navigation\" aria-label=\"Newsroom\" data-analytics-region=\"local nav\" data-sticky=\"\"\u003e\n\t\n    \n    \n        \n\n\n\n\n    \n    \n    \n\t\n\t\n\n\u003c/nav\u003e\n\n\n\n\n\n\u003cmain id=\"main\" role=\"main\"\u003e \n\n\n\n\n\u003cspan id=\"opens-in-new-window\"\u003eopens in new window\u003c/span\u003e\n\u003csection\u003e\n\u003carticle data-analytics-activitymap-region-id=\"article\"\u003e\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \u003cdiv\u003e\n        \n\t\t\n        \n\n        \u003cdiv\u003e\n                \n                \n                \n                    \u003ch2\u003e\n                        \n    \n        Apple’s Worldwide Developers Conference kicks off June 9\n    \n\n                    \u003c/h2\u003e\n                \n            \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                    The annual online conference takes place June 9-13, promising a week of technology, innovation, and creativity\n                \n            \u003c/div\u003e\n\n        \n            \n    \n    \n    \n    \n    \n\n        \n\n    \u003c/div\u003e\n\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, A graphic shows the WWDC25 logo.\"\u003e\n        \u003cdiv\u003e\n            \n             \n              \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2025/05/apples-worldwide-developers-conference-kicks-off-june-9/article/Apple-WWDC25-event-details-hero.zip\" download=\"\" data-analytics-title=\"download image - Apple-WWDC25-event-details-hero_big\" aria-label=\"Download media, A graphic shows the WWDC25 logo.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003eToday, Apple unveiled an exciting lineup for its annual Worldwide Developers Conference (WWDC), including the Keynote and Platforms State of the Union. Taking place June 9-13, the free online conference will bring the global Apple developer community together to provide insights into the latest Apple tools, technologies, and features. Throughout the week, developers around the world can connect with Apple engineers, designers, and evangelists, and watch more than 100 sessions that will help them discover the newest enhancements to build platform-differentiating apps and games across Apple products. Apple will also welcome more than 1,000 developers and students to celebrate in person during a special event at Apple Park on June 9.\n\u003c/div\u003e\n \n\n    \n    \n    \n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eApple Keynote\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003eJune 9, 10 a.m. PDT\u003c/strong\u003e\u003cbr/\u003e\nWWDC25 kicks off with a first look at the groundbreaking updates coming to Apple platforms. The Keynote will be available to stream on \u003ca href=\"https://www.apple.com/\" target=\"_blank\"\u003eapple.com\u003c/a\u003e, the Apple TV app, and the Apple YouTube channel. On-demand playback will be available after the conclusion of the stream.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003ePlatforms State of the Union\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003eJune 9, 1 p.m. PDT\u003cbr/\u003e\n\u003c/strong\u003eFollowing the Keynote, the Platforms State of the Union will take a deeper dive into the new tools that will further empower Apple developers, including advances across iOS, iPadOS, macOS, tvOS, visionOS, and watchOS. The Platforms State of the Union will be available to stream on the Apple Developer app, website, and Apple Developer YouTube channel. On-demand playback will be available after the conclusion of the stream.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eVideo Sessions and Guides\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eWith over 100 technical sessions, WWDC25 offers developers a chance to dive deep into the latest technologies and frameworks with Apple experts. Sessions will be available on the Apple Developer app, website, and YouTube channel. Developers will also be able to access guides and documentation that can help walk them through the conference’s biggest announcements and highlights.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eGroup and One-on-One Labs\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eApple Developer Program members and Apple Developer Enterprise Program members will have a chance to connect directly with Apple experts through online group labs and one-on-one appointments. Developers can join group labs to learn about the week’s biggest announcements in real time, or set up online appointments for guidance on topics including Apple Intelligence, design, developer tools, graphics and games, machine learning, Swift, and more. Apple engineers and designers will also be available on the Apple Developer Forums.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eSwift Student Challenge\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eApple is proud to support developers through the Swift Student Challenge, one of many Apple programs that seek to uplift the next generation of entrepreneurs, coders, and designers. For the second year, 50 Distinguished Winners have been recognized for outstanding submissions and will visit Apple Park for a special three-day experience.\n\u003c/div\u003e\n                 \n             \n                 \n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n    \n    \n        \n    \n\n\n    \n    \n    \n\n\n\n    \n    \n    \n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\u003c/article\u003e\n\n\n\n\u003c/section\u003e\n\u003c/main\u003e\n\n\n\n\u003cdiv\u003e\n            Stay up to date with the latest articles from Apple Newsroom.\n        \u003c/div\u003e\n\t\n\n\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
