{
  "id": "17785bdd-9b60-4c3f-a8b5-7bf621e45b54",
  "title": "Microsoft to Retire Skype in May",
  "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/02/28/the-next-chapter-moving-from-skype-to-microsoft-teams/",
  "description": "",
  "author": "John Gruber",
  "published": "2025-02-28T23:55:44Z",
  "source": "https://daringfireball.net/feeds/main",
  "categories": null,
  "byline": "Jeff Teper",
  "length": 4008,
  "excerpt": "We will be retiring Skype in May 2025 to focus on Microsoft Teams (free), our modern communications and collaboration hub. Learn more.",
  "siteName": "Microsoft 365 Blog",
  "favicon": "https://www.microsoft.com/en-us/microsoft-365/blog/wp-content/uploads/sites/2/2018/03/cropped-microsoft-favicon-new-192x192.png",
  "text": "We will be retiring Skype in May 2025 to focus on Microsoft Teams (free), our modern communications and collaboration hub.  The way we communicate has evolved significantly over the years. From instant messaging to video calls, technology has continuously transformed how we connect with each other.  In order to streamline our free consumer communications offerings so we can more easily adapt to customer needs, we will be retiring Skype in May 2025 to focus on Microsoft Teams (free), our modern communications and collaboration hub.  With Teams, users have access to many of the same core features they use in Skype, such as one-on-one calls and group calls, messaging, and file sharing. Additionally, Teams offers enhanced features like hosting meetings, managing calendars, and building and joining communities for free. Hundreds of millions of people already use Teams as their hub for teamwork, helping them stay connected and engaged at work, school, and at home. In the past two years, the number of minutes spent in meetings by consumer users of Teams has grown 4X, reflecting the value Teams brings to everyday communication and collaboration.  As we take this next step with Teams, we’re excited about the opportunities ahead. We look forward to continuing to support people’s everyday connections, starting by making it easy to log into Teams with their Skype account. What’s next for Skype users   During this transition period, users have a choice: 1. Move to Microsoft Teams for free. Over the coming days, we will roll out the ability for Skype users to sign into Teams (free) on any supported device using their Skype credentials—starting today with those who are part of both the Teams and Skype Insider programs. By logging in to Teams with a Skype account, chats and contacts will automatically appear in the app so you can quickly pick up where you left off. During the transition period, Teams users can call and chat with Skype users and Skype users can do the same with Teams users. This helps ensure you can stay connected with everyone, regardless of the platform you’re using during this transition. 2. Export your Skype data. If you prefer not to migrate to Teams, you can instead export your data including chats, contacts, and call history. Skype will remain available until May 5, 2025, giving users time to explore Teams and decide on the option that works best for them. How to get started with Teams for free Moving to Teams is simple and doesn’t prevent you from also continuing to use Skype during the transition period.   Here’s how to get started:    Download Teams on your device from the official Microsoft Teams website.   Log in with your Skype credentials.   Start using Teams with all your Skype chats and contacts ready to go.   To assist in this transition, we’ve prepared a step-by-step guide to help get started with Teams and make the most of its features. Changes to Skype paid offerings   Moving forward, we will no longer offer paid Skype features to new customers, including Skype Credit and subscriptions that allow you to make and receive international and domestic calls. Current Skype subscription users can continue to use their Skype Credits and subscriptions until the end of their next renewal period. Skype Credit users can also continue to use their remaining Skype Credit. After May 5, 2025, the Skype Dial Pad will be available to remaining paid users from the Skype web portal and within Teams.    Thank you for being part of Skype  Skype has been an integral part of shaping modern communications and supporting countless meaningful moments, and we are honored to have been part of the journey.  We also understand that change can be challenging and want you to know that we’re here to support you every step of the way. We’re excited about the new opportunities that Teams brings and are committed to helping you stay connected in new and meaningful ways.",
  "image": "https://www.microsoft.com/en-us/microsoft-365/blog/wp-content/uploads/sites/2/2025/03/Hero_Skype-to-Teams_Landscape-1024x581.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-276197\"\u003e\n\n\t\n\t\u003cdiv\u003e\n\t\t\u003cp\u003e\n\t\t\tWe will be retiring Skype in May 2025 to focus on Microsoft Teams (free), our modern communications and collaboration hub. \t\t\u003c/p\u003e\n\t\t\n\t\t\n\u003cp\u003eThe way we communicate has evolved significantly over the years. From instant messaging to video calls, technology has continuously transformed how we connect with each other. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn order to streamline our free consumer communications offerings so we can more easily adapt to customer needs, we will be retiring Skype in May 2025 to focus on Microsoft Teams (free), our modern communications and collaboration hub. \u003c/p\u003e\n\n\n\n\u003cp\u003eWith Teams, users have access to many of the same core features they use in Skype, such as one-on-one calls and group calls, messaging, and file sharing. Additionally, Teams offers enhanced features like hosting meetings, managing calendars, and building and joining communities for free.\u003c/p\u003e\n\n\n\n\u003cp\u003eHundreds of millions of people already use Teams as their hub for teamwork, helping them stay connected and engaged at work, school, and at home. In the past two years, the number of minutes spent in meetings by consumer users of Teams has grown 4X, reflecting the value Teams brings to everyday communication and collaboration. \u003c/p\u003e\n\n\n\n\u003cp\u003eAs we take this next step with Teams, we’re excited about the opportunities ahead. We look forward to continuing to support people’s everyday connections, starting by making it easy to log into Teams with their Skype account.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"The Next Chapter: From Skype to Teams\" width=\"500\" height=\"281\" src=\"https://www.youtube-nocookie.com/embed/FK-WjbsVgB4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"what-s-next-for-skype-users\"\u003eWhat’s next for Skype users  \u003c/h2\u003e\n\n\n\n\u003cp\u003eDuring this transition period, users have a choice: \u003c/p\u003e\n\n\n\n\u003cp\u003e1. \u003cstrong\u003eMove to Microsoft Teams for free\u003c/strong\u003e. Over the coming days, we will roll out the ability for Skype users to sign into Teams (free) on any supported device using their Skype credentials—starting today with those who are part of both the Teams and Skype Insider programs. By logging in to Teams with a Skype account, chats and contacts will automatically appear in the app so you can quickly pick up where you left off.\u003c/p\u003e\n\n\n\n\u003cp\u003eDuring the transition period, Teams users can call and chat with Skype users and Skype users can do the same with Teams users. This helps ensure you can stay connected with everyone, regardless of the platform you’re using during this transition.\u003c/p\u003e\n\n\n\n\u003cp\u003e2. \u003cstrong\u003eExport your Skype data\u003c/strong\u003e. If you prefer not to migrate to Teams, you can instead export your data including chats, contacts, and call history.\u003c/p\u003e\n\n\n\n\u003cp\u003eSkype will remain available until May 5, 2025, giving users time to explore Teams and decide on the option that works best for them.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"how-to-get-started-with-teams-for-free\"\u003eHow to get started with Teams for free\u003c/h2\u003e\n\n\n\n\u003cp\u003eMoving to Teams is simple and doesn’t prevent you from also continuing to use Skype during the transition period.  \u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s how to get started:   \u003c/p\u003e\n\n\n\n\u003col start=\"1\"\u003e\n\u003cli\u003eDownload Teams on your device from the \u003ca href=\"https://www.microsoft.com/microsoft-teams/free\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eofficial Microsoft Teams website\u003c/a\u003e.  \u003c/li\u003e\n\n\n\n\u003cli\u003eLog in with your Skype credentials.  \u003c/li\u003e\n\n\n\n\u003cli\u003eStart using Teams with all your Skype chats and contacts ready to go.  \u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eTo assist in this transition, we’ve prepared a step-by-step guide to help get started with Teams and make the most of its features.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"changes-to-skype-paid-offerings\"\u003eChanges to Skype paid offerings  \u003c/h2\u003e\n\n\n\n\u003cp\u003eMoving forward, we will no longer offer paid Skype features to new customers, including Skype Credit and subscriptions that allow you to make and receive international and domestic calls. Current Skype subscription users can continue to use their Skype Credits and subscriptions until the end of their next renewal period. Skype Credit users can also continue to use their remaining Skype Credit. After May 5, 2025, the Skype Dial Pad will be available to remaining paid users from the Skype web portal and within Teams.   \u003c/p\u003e\n\n\n\n\u003ch2 id=\"thank-you-for-being-part-of-skype\"\u003eThank you for being part of Skype \u003c/h2\u003e\n\n\n\n\u003cp\u003eSkype has been an integral part of shaping modern communications and supporting countless meaningful moments, and we are honored to have been part of the journey. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe also understand that change can be challenging and want you to know that we’re here to support you every step of the way. We’re excited about the new opportunities that Teams brings and are committed to helping you stay connected in new and meaningful ways. \u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-28T14:00:00Z",
  "modifiedTime": "2025-02-28T14:06:17Z"
}
