{
  "id": "195c6282-fc14-46ca-8ca5-1f3562a966e8",
  "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
  "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
  "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
  "author": "Mitchel Broussard",
  "published": "Mon, 13 Sep 2021 06:36:38 PDT",
  "source": "http://feeds.macrumors.com/MacRumors-Mac",
  "categories": [
    "Deals"
  ],
  "byline": "Mitchel Broussard",
  "length": 5826,
  "excerpt": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model...",
  "siteName": "MacRumors",
  "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png",
  "text": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook. Popular Stories18 New Things Your iPhone Can Do in iOS 18.1Monday October 21, 2024 1:44 am PDT by Tim HardwickApple is expected to release iOS 18.1 on Monday, October 28, bringing the first set of Apple Intelligence features to iPhone 15 Pro and iPhone 16 models. This update marks the first significant step forward in Apple's AI integration, offering a new Siri contextually-aware experience and a range of additional capabilities powered by on-device machine learning and large language models. There are a ...Tim Cook Admits Truth About Vision Pro Following Lackluster SalesThe Wall Street Journal's Ben Cohen this summer interviewed Apple CEO Tim Cook about the Vision Pro, innovation, Apple Intelligence, and more. Image Credit: Vanity Fair Cook admitted that the Vision Pro headset is not a mass-market product due to its high price. \"At $3,500, it's not a mass-market product,\" said Cook. \"Right now, it's an early-adopter product. People who want to have...iPhone 16 Users Complain About Excessive iOS 18 Battery DrainThursday October 17, 2024 4:06 pm PDT by Juli CloverSome iPhone 16 and iPhone 16 Pro users have been experiencing excessive and unexplainable battery drain, according to complaints on Reddit, the Apple Support Communities, and the MacRumors forums. While many of the reports are from iPhone 16 users, older iPhones running iOS 18 may also be experiencing battery life issues. There is a long-running iOS 18 battery life complaint thread on MacRumo...iPhone 16 Pro Bug Causing Random Freezing and RestartsFriday October 18, 2024 2:16 pm PDT by Juli CloverThere appears to be a bug with some iPhone 16 models that is causing random restarts, according to complaints on Reddit, the MacRumors forums, and the Apple Support Communities. Affected users are seeing their iPhones freeze unexpectedly and then reboot. Reports about the issue have been ongoing since the iPhone 16 models first launched in September, and have continued to this week. The iOS...Top Stories: New iPad Mini, Upcoming Mac Updates, and MoreThe first of a number of imminent Apple product updates arrived this week with the seventh-generation iPad mini, but what else is still in store and when can we expect to see them? On the software side, the public release of iOS 18.1 and related updates with the first Apple Intelligence features is drawing ever closer, and we can expect more of those features to arrive with iOS 18.2 before...Apple Confirms AirPods Pro 2 Hearing Features Launching in iOS 18.1 Next WeekApple will release iOS 18.1 next week, introducing a suite of advanced hearing health capabilities to the AirPods Pro 2 and the first Apple Intelligence features. The timing of the update was confirmed by reviewers who were given early access to the AirPods Pro 2's new hearing health features, which are now known to be included in the update. The update will include three core features:...Will Apple Release M4 Macs Soon? Here's What the Latest Rumors SayFriday October 18, 2024 1:45 am PDT by Tim HardwickApple often releases new Macs in the fall, but we are still waiting for official confirmation that the company has similar plans this year. We're well into October now, and if Apple plans to announce new Macs before the holidays, recent history suggests it will happen this month. Here's what we know so far. It's been 225+ days since Apple released a new Mac, the last being M3 versions of the ...iPad Mini 7 Has Display Hardware Changes That Likely Fix Jelly ScrollingFriday October 18, 2024 12:45 pm PDT by Juli CloverOne of the main complaints about the prior-generation iPad mini 6 was \"jelly scrolling\" or screen tearing, and it sounds like it's a problem that Apple may have addressed with hardware updates to the iPad mini 7 display. In the most recent episode of the Six Colors Podcast, Jason Snell and Dan Moren discussed the new iPad mini 7, and shared some information about the display. Snell said that ...All-New 'iPhone 17 Air' Rumored to Feature Single 48MP Rear Camera, 8GB of RAM, and MoreFriday October 18, 2024 11:26 am PDT by Joe RossignolIn recent months, several credible sources have claimed that Apple plans to release a redesigned, significantly thinner iPhone 17 model next year. The device's name is not yet known, so we are referring to it as the \"iPhone 17 Air\" for now. There have been conflicting rumors about the design and specifications for the device, but most sources have agreed that it will have around a 6.6-inch...",
  "image": "https://images.macrumors.com/t/9Sa68cMYP1DLwHamGeVb0dRPRMY=/2500x/article-new/2021/04/macbook-air-deals.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv role=\"main\" id=\"maincontent\"\u003e\u003carticle expanded=\"true\"\u003e\u003cdiv data-io-article-url=\"/2021/09/13/deals-amazon-macbook-air-2/\"\u003e\u003cp\u003eAmazon today is offering the 512GB M1 MacBook Air for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5M9XBS%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$1,099.99\u003c/strong\u003e\u003c/a\u003e, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it\u0026#39;s available in Gold and Silver.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy\" srcset=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy 400w,https://images.macrumors.com/t/K0aDXrJhDYmcsM5dsMYhO23MLxo=/800x0/article-new/2021/04/macbook-air-deals.jpg?lossy 800w,https://images.macrumors.com/t/BNjM-RjcmVeGK4nvQG5buw8GXSQ=/1600x0/article-new/2021/04/macbook-air-deals.jpg 1600w,https://images.macrumors.com/t/FP6PIrD5W934MeDN0XePBDH7MWM=/2500x0/filters:no_upscale()/article-new/2021/04/macbook-air-deals.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"macbook air deals\" width=\"2500\" height=\"1406\"/\u003e\u003cem\u003e\u003csmall\u003eNote: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.\u003c/small\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou\u0026#39;ll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order\u003c/strong\u003e. Only the Gold color is available to ship today, while the Silver option won\u0026#39;t be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date.\u003c/p\u003e\n\n\u003cp\u003eThe 256GB model is on sale as well, available for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5LNQCX%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$849.99\u003c/strong\u003e\u003c/a\u003e, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we\u0026#39;ve ever tracked for the 256GB MacBook Air, so if you\u0026#39;re willing to wait a few weeks, it\u0026#39;s worth locking in this price while it\u0026#39;s available.\u003c/p\u003e\n\u003cp\u003eYou can find even more discounts on other MacBooks by visiting our \u003ca href=\"https://www.macrumors.com/guide/macbook-pro-air-deals/\"\u003eBest Deals guide\u003c/a\u003e for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you\u0026#39;re shopping for a new Apple notebook.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003cp\u003e\u003ch2\u003ePopular Stories\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/18-new-things-your-iphone-can-do-ios-18-1/\"\u003e18 New Things Your iPhone Can Do in iOS 18.1\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday October 21, 2024 1:44 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple is expected to release iOS 18.1 on Monday, October 28, bringing the first set of Apple Intelligence features to iPhone 15 Pro and iPhone 16 models. This update marks the first significant step forward in Apple\u0026#39;s AI integration, offering a new Siri contextually-aware experience and a range of additional capabilities powered by on-device machine learning and large language models. There are a ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/tim-cook-admits-truth-about-vision-pro/\"\u003eTim Cook Admits Truth About Vision Pro Following Lackluster Sales\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThe Wall Street Journal\u0026#39;s Ben Cohen this summer interviewed Apple CEO Tim Cook about the Vision Pro, innovation, Apple Intelligence, and more. Image Credit: Vanity Fair Cook admitted that the Vision Pro headset is not a mass-market product due to its high price. \u0026#34;At $3,500, it\u0026#39;s not a mass-market product,\u0026#34; said Cook. \u0026#34;Right now, it\u0026#39;s an early-adopter product. People who want to have...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/17/iphone-16-battery-drain-complaints/\"\u003eiPhone 16 Users Complain About Excessive iOS 18 Battery Drain\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThursday October 17, 2024 4:06 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSome iPhone 16 and iPhone 16 Pro users have been experiencing excessive and unexplainable battery drain, according to complaints on Reddit, the Apple Support Communities, and the MacRumors forums. While many of the reports are from iPhone 16 users, older iPhones running iOS 18 may also be experiencing battery life issues. There is a long-running iOS 18 battery life complaint thread on MacRumo...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/18/iphone-16-pro-restart-bug/\"\u003eiPhone 16 Pro Bug Causing Random Freezing and Restarts\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday October 18, 2024 2:16 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThere appears to be a bug with some iPhone 16 models that is causing random restarts, according to complaints on Reddit, the MacRumors forums, and the Apple Support Communities. Affected users are seeing their iPhones freeze unexpectedly and then reboot. Reports about the issue have been ongoing since the iPhone 16 models first launched in September, and have continued to this week. The iOS...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/19/top-stories-new-ipad-mini-7/\"\u003eTop Stories: New iPad Mini, Upcoming Mac Updates, and More\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThe first of a number of imminent Apple product updates arrived this week with the seventh-generation iPad mini, but what else is still in store and when can we expect to see them? On the software side, the public release of iOS 18.1 and related updates with the first Apple Intelligence features is drawing ever closer, and we can expect more of those features to arrive with iOS 18.2 before...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/airpods-pro-hearing-features-launching-in-ios-18-1/\"\u003eApple Confirms AirPods Pro 2 Hearing Features Launching in iOS 18.1 Next Week\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple will release iOS 18.1 next week, introducing a suite of advanced hearing health capabilities to the AirPods Pro 2 and the first Apple Intelligence features. The timing of the update was confirmed by reviewers who were given early access to the AirPods Pro 2\u0026#39;s new hearing health features, which are now known to be included in the update. The update will include three core features:...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/18/will-apple-release-new-macs-soon-latest-rumors/\"\u003eWill Apple Release M4 Macs Soon? Here\u0026#39;s What the Latest Rumors Say\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday October 18, 2024 1:45 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple often releases new Macs in the fall, but we are still waiting for official confirmation that the company has similar plans this year. We\u0026#39;re well into October now, and if Apple plans to announce new Macs before the holidays, recent history suggests it will happen this month. Here\u0026#39;s what we know so far. It\u0026#39;s been 225+ days since Apple released a new Mac, the last being M3 versions of the ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/18/ipad-mini-7-jelly-scrolling/\"\u003eiPad Mini 7 Has Display Hardware Changes That Likely Fix Jelly Scrolling\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday October 18, 2024 12:45 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOne of the main complaints about the prior-generation iPad mini 6 was \u0026#34;jelly scrolling\u0026#34; or screen tearing, and it sounds like it\u0026#39;s a problem that Apple may have addressed with hardware updates to the iPad mini 7 display. In the most recent episode of the Six Colors Podcast, Jason Snell and Dan Moren discussed the new iPad mini 7, and shared some information about the display. Snell said that ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/18/iphone-17-air-rumored-features/\"\u003eAll-New \u0026#39;iPhone 17 Air\u0026#39; Rumored to Feature Single 48MP Rear Camera, 8GB of RAM, and More\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday October 18, 2024 11:26 am PDT by \u003ca href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\"\u003eJoe Rossignol\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIn recent months, several credible sources have claimed that Apple plans to release a redesigned, significantly thinner iPhone 17 model next year. The device\u0026#39;s name is not yet known, so we are referring to it as the \u0026#34;iPhone 17 Air\u0026#34; for now. There have been conflicting rumors about the design and specifications for the device, but most sources have agreed that it will have around a 6.6-inch...\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2021-09-13T09:36:38Z",
  "modifiedTime": null
}
