{
  "id": "1f2ba1aa-86c4-4881-a2a4-f1141d672b69",
  "title": "Developer successfully runs ‘Doom’ on Apple’s Lightning to HDMI adapter",
  "link": "https://9to5mac.com/2025/02/05/doom-apple-lightning-hdmi-adapter/",
  "description": "You’ve probably heard someone say “but can it run Doom?” That’s because running Doom on the most unexpected platforms and devices has become a fun challenge among developers. Now someone has done something really surprising: they’ve run Doom on an Apple Lightning to HDMI adapter. more…",
  "author": "Filipe Espósito",
  "published": "Thu, 06 Feb 2025 00:29:06 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Filipe Espósito",
  "length": 2270,
  "excerpt": "You’ve probably heard someone say “but can it run Doom?” That’s because running Doom on the most unexpected platforms and...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "You’ve probably heard someone say “but can it run Doom?” That’s because running Doom on the most unexpected platforms and devices has become a fun challenge among developers. Now someone has done something really surprising: they’ve run Doom on an Apple Lightning to HDMI adapter. Running Doom on Apple’s Lightning to HDMI adapter In a video shared on YouTube (via MacRumors), a developer shows the classic game running on Apple’s Lightning to HDMI adapter, which can be used to output video from old iPhones and iPads. However, since the Lightning connector doesn’t have the bandwidth needed to transmit HDMI video, Apple has put a SoC in the adapter to compress the output video. The developer explains that Apple’s Lightning to HDMI adapter runs a stripped-down version of iOS. Essentially, what the developer did was jailbreak the adapter’s SoC, which unsurprisingly has its own security protections. As a result, it was possible to install and run Doom using the chip inside the adapter. The game footage was rendered on an external monitor plugged into the adapter. Although most people probably don’t really want to play Doom using an adapter, it’s nice to see that a piece of hardware as simple as the chip inside a dongle can run old games that used to require a proper computer. In 2016, another developer managed to run Doom on the MacBook Pro’s Touch Bar. You can check out the result in the video below: On a website called “Can It Run Doom,” you can find projects by developers who have run the game on calculators and even digital price tags. It’s worth noting that Apple still sells the Lightning to HDMI adapter for $49, but you can find it for $39 on Amazon – if you still need one for some reason. What other devices would you like to see running Doom? Let us know in the comments section below. Read also Hands on: GAMEBABY Case transforms your iPhone into a retro console with physical buttons Watch Steve Jobs unveil a PS1 emulator for the Mac years before the App Store drama iDOS 3 now available on the App Store after Apple changes its gudelines on PC emulators Best deals on Apple products Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/doom-apple-adapter.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/02/doom-apple-adapter.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"Developer successfully runs ‘Doom\u0026#39; on Apple\u0026#39;s Lightning to HDMI adapter\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/doom-apple-adapter.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/doom-apple-adapter.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/doom-apple-adapter.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/doom-apple-adapter.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eYou’ve probably heard someone say “but can it run Doom?” That’s because running Doom on the most unexpected platforms and devices has become a fun challenge among developers. Now someone has done something really surprising: they’ve run Doom on an Apple Lightning to HDMI adapter.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-running-doom-on-apple-s-lightning-to-hdmi-adapter\"\u003eRunning Doom on Apple’s Lightning to HDMI adapter\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn a \u003ca href=\"https://www.youtube.com/watch?v=4XCkeN0XuqA\" target=\"_blank\" rel=\"noreferrer noopener\"\u003evideo shared on YouTube\u003c/a\u003e (via \u003cem\u003e\u003ca href=\"https://www.macrumors.com/2025/02/04/doom-apple-lightning-hdmi-adapter/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMacRumors\u003c/a\u003e\u003c/em\u003e), a developer shows the classic game running on Apple’s Lightning to HDMI adapter, which can be used to output video from old iPhones and iPads. However, since the Lightning connector doesn’t have the bandwidth needed to transmit HDMI video, Apple has put a SoC in the adapter to compress the output video.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe developer explains that Apple’s Lightning to HDMI adapter runs a stripped-down version of iOS. Essentially, what the developer did was jailbreak the adapter’s SoC, which unsurprisingly has its own security protections. As a result, it was possible to install and run Doom using the chip inside the adapter. The game footage was rendered on an external monitor plugged into the adapter.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlthough most people probably don’t really want to play Doom using an adapter, it’s nice to see that a piece of hardware as simple as the chip inside a dongle can run old games that used to require a proper computer. In 2016, \u003ca href=\"https://9to5mac.com/2016/11/21/doom-macbook-pro-touch-bar/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eanother developer managed to run Doom on the MacBook Pro’s Touch Bar\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can check out the result in the video below:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe id=\"post-youtube-video-1\" title=\"DOOM running on Apple Lightning to HDMI dongle\" width=\"500\" height=\"281\" data-src=\"https://www.youtube.com/embed/4XCkeN0XuqA?feature=oembed\u0026amp;rel=0\u0026amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOn a website called “\u003ca href=\"https://canitrundoom.org\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCan It Run Doom\u003c/a\u003e,” you can find projects by developers who have run the game on calculators and even digital price tags. It’s worth noting that Apple still sells the Lightning to HDMI adapter for $49, \u003ca href=\"https://amzn.to/4jEnbwO\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebut you can find it for $39 on Amazon\u003c/a\u003e – if you still need one for some reason.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat other devices would you like to see running Doom? Let us know in the comments section below.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-read-also\"\u003eRead also\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2025/02/01/hands-on-gamebaby-case-transforms-your-iphone-into-a-retro-console-with-physical-buttons/\"\u003eHands on: GAMEBABY Case transforms your iPhone into a retro console with physical buttons\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/14/steve-jobs-ps1-emulator-mac/\"\u003eWatch Steve Jobs unveil a PS1 emulator for the Mac years before the App Store drama\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/08/12/idos-3-app-store-pc-emulators/\"\u003eiDOS 3 now available on the App Store after Apple changes its gudelines on PC emulators\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/4gtboP6\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBest deals on Apple products\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-06T00:29:06Z",
  "modifiedTime": "2025-02-06T00:29:08Z"
}
