{
  "id": "218750b5-2f6a-4315-a6ce-8feca7535868",
  "title": "Find lost luggage by sharing your AirTag location with your airline",
  "link": "https://www.cultofmac.com/news/airtag-find-lost-luggage-share-item-location",
  "description": "Find out how AirTag and the new Share Item Location feature can help you recover lost luggage securely and (hopefully) easily. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Mon, 11 Nov 2024 22:21:11 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "airlines",
    "AirTag",
    "Find My"
  ],
  "byline": "Ed Hardy",
  "length": 3523,
  "excerpt": "Find out how AirTag and the new Share Item Location feature can help you recover lost luggage securely and (hopefully) easily.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News Now you can temporarily share the location of your lost bag with your airline. Image: Apple/Cult of Mac Share Item Location lets AirTag users securely share the location of their tracking tag with an airline. The goal is to help find and recover lost luggage. “The Find My network and AirTag have proven to be a powerful combination for users while traveling, providing invaluable location information when bags have been misplaced or mishandled,” said Eddy Cue, Apple’s senior vice president of services, in a press release Monday. “With Share Item Location, we’re excited to give users a new way to easily share this information directly with third parties like airlines, all while protecting their privacy.” Share Item Location makes finding lost luggage easier You can attach an AirTag to anything that gets misplaced frequently. Then, if the item goes missing, you can open Apple’s Find My app on your iPhone and receive directions to the tracking tag’s exact location. Not surprisingly, plenty of AirTags wind up attached to luggage. And when a bag goes missing, the owner can see where it is. However, that information is of limited use when the airline insists your bag is in Denver, even though you can clearly see on your iPhone that the AirTag is in Atlanta. That’s where the new Share Item Location comes in. Users can generate a Share Item Location link in the Find My app on their iPhone, iPad or Mac. Recipients of a link can view a website that shows the location of the item on an interactive map. The website automatically updates when a new location becomes available and will show a timestamp of the most recent update. Apple will limit access to each link to a small number of people. Plus, recipients must authenticate through their Apple Account or partner email address to view the link. Apple jumped the gun just a bit with Monday’s announcement of the new feature. Share Item Location requires iOS 18.2, which has not yet been released. It is in public beta, however, so those eager to use an AirTag to find their lost luggage can install the prerelease version. Widespread airline adoption Of course, the feature is useless if airlines don‘t know what to do with the location links flyers want to send them. That’s why Apple worked directly with airlines to put systems in place to support the feature. In the coming months, more than 15 airlines will begin accepting Find My item locations as part of their customer service process for locating mishandled or delayed bags, according to Apple. The list includes: Aer Lingus, Air Canada, Air New Zealand, Austrian Airlines, British Airways, Brussels Airlines, Delta Air Lines, Eurowings, Iberia, KLM Royal Dutch Airlines, Lufthansa, Qantas, Singapore Airlines, Swiss International Air Lines, Turkish Airlines, United, Virgin Atlantic and Vueling. Plus, Apple plans to add more airlines over time. “While more than 99 percent of checked items make it to their destination as planned, we know how stressful it can be for customers when they don’t. That’s why we’re excited to support Share Item Location beginning later this year,” said Erik Snell, a Delta Air Lines’ senior vice president, in Apple’s press release. “It will provide our team with extra visibility to reunite those items with their owners. This cutting-edge solution, developed by Apple and in partnership with Delta Air Lines, will enable us to locate items more efficiently and effectively.” Source: Apple",
  "image": "https://www.cultofmac.com/wp-content/uploads/2024/11/airtag-find-lost-luggage-share-item-location.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-874697\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Find lost luggage by sharing your AirTag location with your airline\" src=\"https://www.cultofmac.com/wp-content/uploads/2024/11/airtag-find-lost-luggage-share-item-location-1536x864.jpg\" alt=\"Find lost luggage by sharing your AirTag location with your airline\" data-ratio=\"1.7777777777778\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tNow you can temporarily share the location of your lost bag with your airline. \u003cbr/\u003e\u003cem\u003eImage: Apple/Cult of Mac\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eShare Item Location lets AirTag users securely share the location of their tracking tag with an airline. The goal is to help find and recover lost luggage.\u003c/p\u003e\n\u003cp\u003e“The Find My network and AirTag have proven to be a powerful combination for users while traveling, providing invaluable location information when bags have been misplaced or mishandled,” said Eddy Cue, Apple’s senior vice president of services, in a press release Monday. “With Share Item Location, we’re excited to give users a new way to easily share this information directly with third parties like airlines, all while protecting their privacy.”\u003cspan id=\"more-874697\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003ch2\u003eShare Item Location makes finding lost luggage easier\u003c/h2\u003e\n\u003cp\u003eYou can attach an AirTag to anything that gets misplaced frequently. Then, if the item goes missing, you can open \u003ca href=\"https://www.cultofmac.com/find-my\" data-lasso-id=\"1641636416\"\u003eApple’s Find My\u003c/a\u003e app on your iPhone and receive \u003ca href=\"https://www.cultofmac.com/how-to/share-location-iphone\" data-lasso-id=\"1641636417\"\u003edirections to the tracking tag’s exact location\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNot surprisingly, plenty of AirTags wind up attached to luggage. And when a bag goes missing, the owner can see where it is. However, that information is of limited use when the airline insists your bag is in Denver, even though you can clearly see on your iPhone that the AirTag is in Atlanta.\u003c/p\u003e\n\u003cp\u003eThat’s where the new Share Item Location comes in. Users can generate a Share Item Location link in the Find My app on their iPhone, iPad or Mac. Recipients of a link can view a website that shows the location of the item on an interactive map. The website automatically updates when a new location becomes available and will show a timestamp of the most recent update.\u003c/p\u003e\n\u003cp\u003eApple will limit access to each link to a small number of people. Plus, recipients must authenticate through their Apple Account or partner email address to view the link.\u003c/p\u003e\n\u003cp\u003eApple jumped the gun just a bit with Monday’s announcement of the new feature. Share Item Location requires \u003ca href=\"https://www.cultofmac.com/news/ios-18-2-beta-features-changes\" data-lasso-id=\"1641636418\"\u003eiOS 18.2\u003c/a\u003e, which has not yet been released. It is in \u003ca href=\"https://www.cultofmac.com/how-to/download-ios-beta\" data-lasso-id=\"1641636590\"\u003epublic beta\u003c/a\u003e, however, so those eager to use an AirTag to find their lost luggage can install the prerelease version.\u003c/p\u003e\n\u003ch3\u003eWidespread airline adoption\u003c/h3\u003e\n\u003cp\u003eOf course, the feature is useless if airlines don‘t know what to do with the location links flyers want to send them. That’s why Apple worked directly with airlines to put systems in place to support the feature. In the coming months, more than 15 airlines will begin accepting Find My item locations as part of their customer service process for locating mishandled or delayed bags, according to Apple.\u003c/p\u003e\u003cspan data-ez-ph-id=\"912\"\u003e\u003c/span\u003e\n\u003cp\u003eThe list includes: Aer Lingus, Air Canada, Air New Zealand, Austrian Airlines, British Airways, Brussels Airlines, Delta Air Lines, Eurowings, Iberia, KLM Royal Dutch Airlines, Lufthansa, Qantas, Singapore Airlines, Swiss International Air Lines, Turkish Airlines, United, Virgin Atlantic and Vueling. Plus, Apple plans to add more airlines over time.\u003c/p\u003e\n\u003cp\u003e“While more than 99 percent of checked items make it to their destination as planned, we know how stressful it can be for customers when they don’t. That’s why we’re excited to support Share Item Location beginning later this year,” said Erik Snell, a Delta Air Lines’ senior vice president, in Apple’s press release. “It will provide our team with extra visibility to reunite those items with their owners. This cutting-edge solution, developed by Apple and in partnership with Delta Air Lines, will enable us to locate items more efficiently and effectively.”\u003c/p\u003e\u003cspan data-ez-ph-id=\"913\"\u003e\u003c/span\u003e\n\u003cp\u003eSource: \u003ca href=\"https://www.apple.com/newsroom/2024/11/apples-find-my-enables-sharing-location-of-lost-items-with-third-parties/\" data-lasso-id=\"1641636419\" target=\"_blank\"\u003eApple\u003c/a\u003e        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-11T22:21:11Z",
  "modifiedTime": "2024-11-11T22:51:20Z"
}
