{
  "id": "30677b2b-4899-46a2-ab10-3787c2ef6d49",
  "title": "Adobe's 'Project Indigo' app will help you take better photos on your iPhone",
  "link": "https://appleinsider.com/articles/25/06/21/adobes-project-indigo-app-will-help-you-take-better-photos-on-your-iphone?utm_medium=rss",
  "description": "A new initiative from Adobe aims to improve smartphone cameras and computational photography in general to give a more natural, SLR-like look to iPhone photography.Project Indigo can help dramatically reduce smartphone-camera deficiences. Image credit: AdobeA new paper from Adobe Fellow Marc Levoy and Senior Scientist Florian Kainz discusses their latest project, which is embodied in a new Project Indigo app available for iPhones. In addition to what the inventors hope is a more \"natural\" look, the project aims for the highest image quality possible on a mobile device.In the new research paper explaining the project, the pair detail their approach to achieving more authentic photo images. The app under-exposes more strongly than most camera apps, but also captures, aligns, and combines \"more frames when producing each photo — up to 32 frames\" in a single exposure. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Charles Martin",
  "published": "Sat, 21 Jun 2025 23:47:07 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Charles Martin",
  "length": 4148,
  "excerpt": "A new initiative from Adobe aims to improve smartphone cameras and computational photography in general to give a more natural, SLR-like look to iPhone photography.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "A new initiative from Adobe aims to improve smartphone cameras and computational photography in general to give a more natural, SLR-like look to iPhone photography. A new paper from Adobe Fellow Marc Levoy and Senior Scientist Florian Kainz discusses their latest project, which is embodied in a new Project Indigo app available for iPhones. In addition to what the inventors hope is a more \"natural\" look, the project aims for the highest image quality possible on a mobile device. In the new research paper explaining the project, the pair detail their approach to achieving more authentic photo images. The app under-exposes more strongly than most camera apps, but also captures, aligns, and combines \"more frames when producing each photo — up to 32 frames\" in a single exposure. \"This means that our photos have fewer blown-out highlights and less noise in the shadows,\" Levoy and Kainz write — but also note that taking a photo with the app \"may require slightly more patience after pressing the shutter button than you're used to ... but after a few seconds, you'll be rewarded with a better picture.\" This approach results in less \"smoothing\" than in most smartphone camera apps, which better preserves natural textures. It also avoids what might be called \"global tone mapping,\" where typically the brightest point in a smartphone photo is used to set the exposure for the entire photo. This often results in very bright objects appearing correctly balanced, while anything darker than the brightest point is underexposed. This makes it more difficult to edit the image later to correct the underexposed portions, especially if the RAW image format wasn't used. Creating super-resolution imagesA further issue is the problem of zooming. Smartphones lack true optical zoom lenses, so when users \"zoom in\" on a subject, the camera now reads only the central portion of the sensor — further reducing image quality. The Indigo camera app overcomes this issue by using a technique called \"multi-frame super-resolution,\" quickly capturing multiple images of the scene at different resolutions and zoom levels in order to reduce noise. An example of super-resolution correction of a distant subject. Image credit: Adobe\"We then combine these images to produce a single photo with more detail than is present in a single image,\" the authors say. \"And because we've captured different viewpoints, the extra detail in our super-resolution photos is real, not [computationally] hallucinated.\" The Indigo app also offers smartphone photographers a wealth of controls, designed specifically for smartphone photography. \"We offer the obvious controls over focus, shutter speed, ISO, exposure compensation, and white balance — the latter with separate control over temperature and tint, like Lightroom,\" the authors point out. \"But since each photo is the result of combining a burst of frames, Indigo also offers control over the number of frames in the burst,\" the developers say. \"This gives photographers a way to trade off total capture time against noise level.\" One additional future feature of the app offers an exciting new possibility for smartphone users. The Indigo developers want to be able to render the final look of the photo in real time in the viewfinder — a genuine \"what you see is what you get\" image. For example, this would allow photographers to make a darker image by lowering the brightness of the preview rather than shortening exposure time. Conversely, you can make a brighter image by raising the shadows rather than increasing the exposure. Indigo can also intelligently remove lighting reflections from lit subjects. Image credit: AdobeLikewise, some advanced photographic techniques — such as removing lighting reflections from a lit subject that is under glass or plastic, for example — would be possible \"in camera\" using Indigo, the developers say. The developers see Project Indigo as a set of technologies, currently used in a same-named app, as a platform of techniques \"that may eventually be deployed in Adobe's flagship products, especially Lightroom.\" The app is available for free in the App Store.",
  "image": "https://photos5.appleinsider.com/gallery/64101-133463-cropped-Exposure-challenges-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eA new initiative from Adobe aims to improve smartphone cameras and computational photography in general to give a more natural, SLR-like look to \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e photography.\n\u003c/p\u003e\u003cp\u003eA new paper from Adobe Fellow Marc Levoy and Senior Scientist Florian Kainz discusses their latest project, which is embodied in a new \u003ca href=\"https://apps.apple.com/us/app/project-indigo/id6742591546\"\u003eProject Indigo app\u003c/a\u003e available for iPhones. In addition to what the inventors hope is a more \u0026#34;natural\u0026#34; look, the project aims for the highest image quality possible on a mobile device.\n\u003c/p\u003e\u003cp\u003eIn the new \u003ca href=\"https://research.adobe.com/articles/indigo/indigo.html\"\u003eresearch paper\u003c/a\u003e explaining the project, the pair detail their approach to achieving more authentic photo images. The app under-exposes more strongly than most camera apps, but also captures, aligns, and combines \u0026#34;more frames when producing each photo —  up to 32 frames\u0026#34; in a single exposure.\n\u003c/p\u003e\u003cp\u003e\u0026#34;This means that our photos have fewer blown-out highlights and less noise in the shadows,\u0026#34; Levoy and Kainz write —  but also note that taking a photo with the app \u0026#34;may require slightly more patience after pressing the shutter button than you\u0026#39;re used to ... but after a few seconds, you\u0026#39;ll be rewarded with a better picture.\u0026#34;\n\u003c/p\u003e\u003cp\u003eThis approach results in less \u0026#34;smoothing\u0026#34; than in most smartphone camera apps, which better preserves natural textures. It also avoids what might be called \u0026#34;global tone mapping,\u0026#34; where typically the brightest point in a smartphone photo is used to set the exposure for the entire photo.\n\u003c/p\u003e\u003cp\u003eThis often results in very bright objects appearing correctly balanced, while anything darker than the brightest point is underexposed. This makes it more difficult to edit the image later to correct the underexposed portions, especially if the RAW image format wasn\u0026#39;t used.\n\u003c/p\u003e\u003ch2 data-anchor=\"creating-superresolution-images\" id=\"creating-superresolution-images\"\u003eCreating super-resolution images\u003c/h2\u003e\u003cp\u003eA further issue is the problem of zooming. Smartphones lack true optical zoom lenses, so when users \u0026#34;zoom in\u0026#34; on a subject, the camera now reads only the central portion of the sensor —   further reducing image quality.\n\u003c/p\u003e\u003cp\u003eThe Indigo camera app overcomes this issue by using a technique called \u0026#34;multi-frame super-resolution,\u0026#34; quickly capturing multiple images of the scene at different resolutions and zoom levels in order to reduce noise.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64101-133464-Distance-challenges-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64101-133464-Distance-challenges-xl.jpg\" alt=\"Two versions of a cityscape featuring tall buildings, with the right version appearing clearer and more detailed than the left.\" height=\"511\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eAn example of super-resolution correction of a distant subject. Image credit: Adobe\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;We then combine these images to produce a single photo with more detail than is present in a single image,\u0026#34; the authors say. \u0026#34;And because we\u0026#39;ve captured different viewpoints, the extra detail in our super-resolution photos is real, not [computationally] hallucinated.\u0026#34;\n\u003c/p\u003e\u003cp\u003eThe Indigo app also offers smartphone photographers a wealth of controls, designed specifically for smartphone photography. \u0026#34;We offer the obvious controls over focus, shutter speed, ISO, exposure compensation, and white balance —  the latter with separate control over temperature and tint, like Lightroom,\u0026#34; the authors point out.\n\u003c/p\u003e\u003cp\u003e\u0026#34;But since each photo is the result of combining a burst of frames, Indigo also offers control over the number of frames in the burst,\u0026#34; the developers say. \u0026#34;This gives photographers a way to trade off total capture time against noise level.\u0026#34;\n\u003c/p\u003e\u003cp\u003eOne additional future feature of the app offers an exciting new possibility for smartphone users. The Indigo developers want to be able to render the final look of the photo in real time in the viewfinder —  a genuine \u0026#34;what you see is what you get\u0026#34; image.\n\u003c/p\u003e\u003cp\u003eFor example, this would allow photographers to make a darker image by lowering the brightness of the preview rather than shortening exposure time. Conversely, you can make a brighter image by raising the shadows rather than increasing the exposure.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64101-133465-Reflection-challenges-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64101-133465-Reflection-challenges-xl.jpg\" alt=\"Two vintage San Francisco maps with detailed grid layout, highlighting streets, parks, and coastline, featuring bold orange and green areas and text boxes for key locations.\" height=\"537\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eIndigo can also intelligently remove lighting reflections from lit subjects. Image credit: Adobe\u003c/span\u003e\u003c/p\u003e\u003cp\u003eLikewise, some advanced photographic techniques —  such as removing lighting reflections from a lit subject that is under glass or plastic, for example —  would be possible \u0026#34;in camera\u0026#34; using Indigo, the developers say.\n\u003c/p\u003e\u003cp\u003eThe developers see Project Indigo as a set of technologies, currently used in a same-named app, as a platform of techniques \u0026#34;that may eventually be deployed in Adobe\u0026#39;s flagship products, especially Lightroom.\u0026#34; The app is \u003ca href=\"https://apps.apple.com/us/app/project-indigo/id6742591546\"\u003eavailable for free\u003c/a\u003e in the App Store.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-21T23:47:07Z",
  "modifiedTime": null
}
