{
  "id": "33b364b3-926b-496d-9628-2dd52fe6e8b9",
  "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
  "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
  "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
  "author": "Mitchel Broussard",
  "published": "Mon, 13 Sep 2021 06:36:38 PDT",
  "source": "http://feeds.macrumors.com/MacRumors-Mac",
  "categories": [
    "Deals"
  ],
  "byline": "Mitchel Broussard",
  "length": 5495,
  "excerpt": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model...",
  "siteName": "MacRumors",
  "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png",
  "text": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook. Popular StoriesNew MacBook With A18 Pro Chip Spotted in Apple CodeApple is developing a MacBook with the A18 Pro chip, according to findings in backend code uncovered by MacRumors. Earlier today, Apple analyst Ming-Chi Kuo reported that Apple is planning to launch a low-cost MacBook powered by an iPhone chip. The machine is expected to feature a 13-inch display, the A18 Pro chip, and color options that include silver, blue, pink, and yellow. MacRumors...iPhone 17 Pro Coming Soon With These 14 New FeaturesApple's next-generation iPhone 17 Pro and iPhone 17 Pro Max are less than three months away, and there are plenty of rumors about the devices. Apple is expected to launch the iPhone 17, iPhone 17 Air, iPhone 17 Pro, and iPhone 17 Pro Max in September this year. Below, we recap key changes rumored for the iPhone 17 Pro models:Aluminum frame: iPhone 17 Pro models are rumored to have an...Apple Announces 13 Automakers Planning to Offer iPhone Car KeysIn 2020, Apple added a digital car key feature to its Wallet app, allowing users to lock, unlock, and start a compatible vehicle with an iPhone or Apple Watch. The feature is currently offered by select automakers, including Audi, BMW, Hyundai, Kia, Genesis, Mercedes-Benz, Volvo, and a handful of others, and it is set to expand further. During its WWDC 2025 keynote, Apple said that 13...Five Features Coming to AirPods Pro 3Friday June 27, 2025 10:52 am PDT by Juli CloverApple hasn't updated the AirPods Pro since 2022, and the earbuds are due for a refresh. We're counting on a new model this year, and we've seen several hints of new AirPods tucked away in Apple's code. Rumors suggest that Apple has some exciting new features planned that will make it worthwhile to upgrade to the latest model. Subscribe to the MacRumors YouTube channel for more videos. Heal...Apple Planning to Launch Low-Cost MacBook Powered By iPhone ChipApple is planning to launch a low-cost MacBook powered by an iPhone chip, according to Apple analyst Ming-Chi Kuo. In an article published on X, Kuo explained that the device will feature a 13-inch display and the A18 Pro chip, making it the first Mac powered by an iPhone chip. The A18 Pro chip debuted in the iPhone 16 Pro last year. To date, all Apple silicon Macs have contained M-series...PSA: Anker Recalls Multiple Power Banks Due to Fire RiskFriday June 27, 2025 4:16 pm PDT by Juli CloverPopular accessory maker Anker this month launched two separate recalls for its power banks, some of which may be a fire risk. The first recall affects Anker PowerCore 10000 Power Banks sold between June 1, 2016 and December 31, 2022 in the United States. Anker says that these power banks have a \"potential issue\" with the battery inside, which can lead to overheating, melting of plastic...Chase Sapphire Reserve Card Introduces New Perk for Apple CustomersChase this week announced a series of new perks for its premium Sapphire Reserve credit card, and one of them is for a pair of Apple services. Specifically, the credit card now offers complimentary annual subscriptions to Apple TV+ and Apple Music, a value of up to $250 per year. If you are already paying for Apple TV+ and/or Apple Music directly through Apple, those subscriptions will...Apple Music Debuts All-New Personalized PlaylistAs part of its 10-year celebrations of Apple Music, Apple today released an all-new personalized playlist that collates your entire listening history. The playlist, called \"Replay All Time,\" expands on Apple Music's existing Replay features. Previously, users could only see their top songs for each individual calendar year that they've been subscribed to Apple Music, but now, Replay All...iPhone 17 Pro Launching in a Few Months With These 12 New FeaturesApple's next-generation iPhone 17 Pro and iPhone 17 Pro Max are around three months away, and there are plenty of rumors about the devices. Apple is expected to launch the iPhone 17, iPhone 17 Air, iPhone 17 Pro, and iPhone 17 Pro Max in September this year. Below, we recap key changes rumored for the iPhone 17 Pro models:Aluminum frame: iPhone 17 Pro models are rumored to have an...",
  "image": "https://images.macrumors.com/t/9Sa68cMYP1DLwHamGeVb0dRPRMY=/2500x/article-new/2021/04/macbook-air-deals.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv role=\"main\" id=\"maincontent\"\u003e\u003carticle expanded=\"true\"\u003e\u003cdiv data-io-article-url=\"/2021/09/13/deals-amazon-macbook-air-2/\"\u003e\u003cp\u003eAmazon today is offering the 512GB M1 MacBook Air for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5M9XBS%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$1,099.99\u003c/strong\u003e\u003c/a\u003e, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it\u0026#39;s available in Gold and Silver.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy\" srcset=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy 400w,https://images.macrumors.com/t/K0aDXrJhDYmcsM5dsMYhO23MLxo=/800x0/article-new/2021/04/macbook-air-deals.jpg?lossy 800w,https://images.macrumors.com/t/BNjM-RjcmVeGK4nvQG5buw8GXSQ=/1600x0/article-new/2021/04/macbook-air-deals.jpg 1600w,https://images.macrumors.com/t/FP6PIrD5W934MeDN0XePBDH7MWM=/2500x0/filters:no_upscale()/article-new/2021/04/macbook-air-deals.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"macbook air deals\" width=\"2500\" height=\"1406\"/\u003e\u003cem\u003e\u003csmall\u003eNote: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.\u003c/small\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou\u0026#39;ll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order\u003c/strong\u003e. Only the Gold color is available to ship today, while the Silver option won\u0026#39;t be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date.\u003c/p\u003e\n\n\u003cp\u003eThe 256GB model is on sale as well, available for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5LNQCX%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$849.99\u003c/strong\u003e\u003c/a\u003e, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we\u0026#39;ve ever tracked for the 256GB MacBook Air, so if you\u0026#39;re willing to wait a few weeks, it\u0026#39;s worth locking in this price while it\u0026#39;s available.\u003c/p\u003e\n\u003cp\u003eYou can find even more discounts on other MacBooks by visiting our \u003ca href=\"https://www.macrumors.com/guide/macbook-pro-air-deals/\"\u003eBest Deals guide\u003c/a\u003e for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you\u0026#39;re shopping for a new Apple notebook.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003cp\u003e\u003ch2\u003ePopular Stories\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/30/new-macbook-with-a18-chip-spotted/\"\u003eNew MacBook With A18 Pro Chip Spotted in Apple Code\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple is developing a MacBook with the A18 Pro chip, according to findings in backend code uncovered by MacRumors.\nEarlier today, Apple analyst Ming-Chi Kuo reported that Apple is planning to launch a low-cost MacBook powered by an iPhone chip. The machine is expected to feature a 13-inch display, the A18 Pro chip, and color options that include silver, blue, pink, and yellow.\nMacRumors...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/30/iphone-17-pro-coming-soon/\"\u003eiPhone 17 Pro Coming Soon With These 14 New Features\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple\u0026#39;s next-generation iPhone 17 Pro and iPhone 17 Pro Max are less than three months away, and there are plenty of rumors about the devices.\nApple is expected to launch the iPhone 17, iPhone 17 Air, iPhone 17 Pro, and iPhone 17 Pro Max in September this year.\nBelow, we recap key changes rumored for the iPhone 17 Pro models:Aluminum frame: iPhone 17 Pro models are rumored to have an...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/27/iphone-car-keys-future-partners/\"\u003eApple Announces 13 Automakers Planning to Offer iPhone Car Keys\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eIn 2020, Apple added a digital car key feature to its Wallet app, allowing users to lock, unlock, and start a compatible vehicle with an iPhone or Apple Watch. The feature is currently offered by select automakers, including Audi, BMW, Hyundai, Kia, Genesis, Mercedes-Benz, Volvo, and a handful of others, and it is set to expand further.\nDuring its WWDC 2025 keynote, Apple said that 13...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/27/airpods-pro-3-five-features/\"\u003eFive Features Coming to AirPods Pro 3\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday June 27, 2025 10:52 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple hasn\u0026#39;t updated the AirPods Pro since 2022, and the earbuds are due for a refresh. We\u0026#39;re counting on a new model this year, and we\u0026#39;ve seen several hints of new AirPods tucked away in Apple\u0026#39;s code. Rumors suggest that Apple has some exciting new features planned that will make it worthwhile to upgrade to the latest model.\nSubscribe to the MacRumors YouTube channel for more videos. \n\n \tHeal...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/30/apple-to-launch-low-cost-macbook/\"\u003eApple Planning to Launch Low-Cost MacBook Powered By iPhone Chip\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple is planning to launch a low-cost MacBook powered by an iPhone chip, according to Apple analyst Ming-Chi Kuo.\nIn an article published on X, Kuo explained that the device will feature a 13-inch display and the A18 Pro chip, making it the first Mac powered by an iPhone chip. The A18 Pro chip debuted in the iPhone 16 Pro last year. To date, all Apple silicon Macs have contained M-series...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/27/anker-power-bank-recall/\"\u003ePSA: Anker Recalls Multiple Power Banks Due to Fire Risk\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday June 27, 2025 4:16 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePopular accessory maker Anker this month launched two separate recalls for its power banks, some of which may be a fire risk.\nThe first recall affects Anker PowerCore 10000 Power Banks sold between June 1, 2016 and December 31, 2022 in the United States. Anker says that these power banks have a \u0026#34;potential issue\u0026#34; with the battery inside, which can lead to overheating, melting of plastic...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/25/chase-sapphire-reserve-apple-perk/\"\u003eChase Sapphire Reserve Card Introduces New Perk for Apple Customers\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eChase this week announced a series of new perks for its premium Sapphire Reserve credit card, and one of them is for a pair of Apple services.\nSpecifically, the credit card now offers complimentary annual subscriptions to Apple TV+ and Apple Music, a value of up to $250 per year. \nIf you are already paying for Apple TV+ and/or Apple Music directly through Apple, those subscriptions will...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/30/apple-music-debuts-all-new-personalized-playlist/\"\u003eApple Music Debuts All-New Personalized Playlist\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eAs part of its 10-year celebrations of Apple Music, Apple today released an all-new personalized playlist that collates your entire listening history. \nThe playlist, called \u0026#34;Replay All Time,\u0026#34; expands on Apple Music\u0026#39;s existing Replay features. Previously, users could only see their top songs for each individual calendar year that they\u0026#39;ve been subscribed to Apple Music, but now, Replay All...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/06/26/iphone-17-pro-rumors-features/\"\u003eiPhone 17 Pro Launching in a Few Months With These 12 New Features\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple\u0026#39;s next-generation iPhone 17 Pro and iPhone 17 Pro Max are around three months away, and there are plenty of rumors about the devices.\nApple is expected to launch the iPhone 17, iPhone 17 Air, iPhone 17 Pro, and iPhone 17 Pro Max in September this year.\nBelow, we recap key changes rumored for the iPhone 17 Pro models:Aluminum frame: iPhone 17 Pro models are rumored to have an...\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2021-09-13T06:36:38-07:00",
  "modifiedTime": null
}
