{
  "id": "363d1dd4-3fc6-4763-b282-11ca6f099a3f",
  "title": "Apple's premature Apple Intelligence ad subject of new lawsuit",
  "link": "https://appleinsider.com/articles/25/03/20/apples-premature-apple-intelligence-ad-subject-of-new-lawsuit?utm_medium=rss",
  "description": "Apple Intelligence was meant to get a feature that relied on contextual data to provide results, but that has been delayed and is now part of a lawsuit seeking class action status.Apple Intelligence ad target of latest lawsuitLawsuits are a dime a dozen in the United States, something Apple is very familiar with. The latest isn't a surprise to those following the Apple Intelligence debacle after a promised feature was delayed into \"the coming year.\"According to a report from Axios, the lawsuit originated with Clarkson Law Firm in San Jose. It specifically highlights a now-pulled ad featuring Bella Ramsey asking for information about a person she had a meeting with. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Wesley Hilliard",
  "published": "Thu, 20 Mar 2025 23:11:11 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Wesley Hilliard",
  "length": 3524,
  "excerpt": "Apple Intelligence was meant to get a feature that relied on contextual data to provide results, but that has been delayed and is now part of a lawsuit seeking class action status.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple Intelligence was meant to get a feature that relied on contextual data to provide results, but that has been delayed and is now part of a lawsuit seeking class action status. Lawsuits are a dime a dozen in the United States, something Apple is very familiar with. The latest isn't a surprise to those following the Apple Intelligence debacle after a promised feature was delayed into \"the coming year.\" According to a report from Axios, the lawsuit originated with Clarkson Law Firm in San Jose. It specifically highlights a now-pulled ad featuring Bella Ramsey asking for information about a person she had a meeting with. Apple's advertisements saturated the internet, television, and other airwaves to cultivate a clear and reasonable consumer expectation that these transformative features would be available upon the iPhone's release.The problem with the entire basis of this lawsuit is that every ad, video, poster, website, or mention of such unreleased features was noted as coming soon. Even the ad in question has a disclaimer in unmissable text stating \"some features and languages will be coming over the next year.\" Arguably, it's still well within \"the next year\" at this point. It's tough to say if the San Jose District Court will take on the case or raise it to class action status, especially since the damages can't be easily measured. Apple did release Apple Intelligence and everything it advertised across iOS 18.1 and iOS 18.2 through December 2024. The only feature that didn't release and has now been delayed is the one shown in the single Bella Ramsey ad. The disclaimer in the ad may render the whole lawsuit unviable. Image source: AppleAnd even then, the disclaimer in the ad has another six months before it is technically incorrect. Apple could release some version of the contextual Apple Intelligence with bare minimum features isolated to Apple apps and render this lawsuit null. There are a lot of rumors going around that Apple has never had a working version of this functionality, however, that is highly unlikely. An angry meeting that leaked suggested the ad was premature, but never said it wasn't functional, just not ready. Apple obviously was on track to release the feature with iOS 18.4 since it laid the groundwork for developer adoption in iOS 18.2. However, it seems what pushed the feature back was the world's, and specifically, the BBC's reaction to poorly summarized headlines. There is no world in which Apple could have released a hallucinating contextual Siri that told people wildly incorrect information 20% of the time. There's already enough hate around Siri and Apple Intelligence without such a disastrous rollout. Thankfully, Apple had the foresight to delay the feature and shuffle some leadership to ensure such a thing won't happen. The short-term media cycle about Apple being further behind in AI is worth it if the public feature release goes off without a hitch. It seems highly unlikely that the lawsuit will go through, but crazier things have happened. A judge sympathetic to the lawsuit may determine that the disclaimer text isn't sufficient in preventing consumers from being \"tricked.\" If this lawsuit does go through, then everyone should get in line and start filing against all the false claims made by all these AI companies. There doesn't seem to be any sentient computers walking around, let alone programs that have upended the economy by stealing jobs. But that's not important when there's a company out there called Apple to sue.",
  "image": "https://photos5.appleinsider.com/gallery/63047-130932-Apple-Intelligence-neon-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003e\u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e was meant to get a feature that relied on contextual data to provide results, but that has been delayed and is now part of a lawsuit seeking class action status.\n\u003c/p\u003e\u003cp\u003eLawsuits are a dime a dozen in the United States, something Apple is \u003ca href=\"https://appleinsider.com/articles/24/02/10/apple-agrees-to-settle-with-rivos-in-chip-trade-secret-theft-lawsuit\"\u003every\u003c/a\u003e \u003ca href=\"https://appleinsider.com/articles/25/01/23/health-focused-apple-watch-has-bands-made-of-harmful-forever-chemicals\"\u003efamiliar\u003c/a\u003e \u003ca href=\"https://appleinsider.com/articles/24/12/02/apple-talks-up-privacy-yet-spies-on-its-own-staff-says-lawsuit\"\u003ewith\u003c/a\u003e. The latest isn\u0026#39;t a surprise to those following the Apple Intelligence debacle after a promised feature was delayed into \u0026#34;\u003ca href=\"https://appleinsider.com/articles/25/03/07/apple-confirms-that-apple-intelligence-siri-features-are-taking-longer-than-expected\"\u003ethe coming year\u003c/a\u003e.\u0026#34;\n\u003c/p\u003e\u003cp\u003eAccording to \u003ca href=\"https://www.axios.com/2025/03/20/apple-suit-false-advertising-ai-intelligence\"\u003ea report\u003c/a\u003e from \u003cem\u003eAxios\u003c/em\u003e, the lawsuit originated with Clarkson Law Firm in San Jose. It specifically highlights a now-pulled ad featuring Bella Ramsey asking for information about a person she had a meeting with.\n\u003c/p\u003e\u003cblockquote\u003eApple\u0026#39;s advertisements saturated the internet, television, and other airwaves to cultivate a clear and reasonable consumer expectation that these transformative features would be available upon the iPhone\u0026#39;s release.\u003c/blockquote\u003e\u003cp\u003eThe problem with the entire basis of this lawsuit is that every ad, video, poster, website, or mention of such unreleased features was noted as coming soon. Even the ad in question has a disclaimer in unmissable text stating \u0026#34;some features and languages will be coming over the next year.\u0026#34;\n\u003c/p\u003e\u003cp\u003eArguably, it\u0026#39;s still well within \u0026#34;the next year\u0026#34; at this point. It\u0026#39;s tough to say if the San Jose District Court will take on the case or raise it to class action status, especially since the damages can\u0026#39;t be easily measured.\n\u003c/p\u003e\u003cp\u003eApple did release Apple Intelligence and everything it advertised across \u003ca href=\"https://appleinsider.com/inside/ios-18\" title=\"iOS 18\" data-kpt=\"1\"\u003eiOS 18.1\u003c/a\u003e and iOS 18.2 through December 2024. The only feature that didn\u0026#39;t release and has now been delayed is the one shown in the single Bella Ramsey ad.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/63047-130931-IMG_1918-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/63047-130931-IMG_1918-xl.jpg\" alt=\"Man holding drink, smiling at a woman in a social gathering setting with blurred people and shelves in the background. Text about Apple Intelligence\u0026#39;s 2024 release at bottom.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eThe disclaimer in the ad may render the whole lawsuit unviable. Image source: Apple\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAnd even then, the disclaimer in the ad has another six months before it is technically incorrect. Apple could release some version of the contextual Apple Intelligence with bare minimum features isolated to Apple apps and render this lawsuit null.\n\u003c/p\u003e\u003cp\u003eThere are a lot of rumors going around that Apple has never had a working version of this functionality, however, that is highly unlikely. An \u003ca href=\"https://appleinsider.com/articles/25/03/14/behind-closed-doors-apple-is-embarrassed-by-its-slow-siri-rollout-too\"\u003eangry meeting\u003c/a\u003e that leaked suggested the ad was premature, but never said it wasn\u0026#39;t functional, just not ready.\n\u003c/p\u003e\u003cp\u003eApple obviously was on track to release the feature with iOS 18.4 since it \u003ca href=\"https://appleinsider.com/articles/24/11/04/developers-can-begin-work-on-an-app-intent-system-that-will-make-siri-smarter-in-2025\"\u003elaid the groundwork\u003c/a\u003e for developer adoption in iOS 18.2. However, it seems what pushed the feature back was the world\u0026#39;s, and specifically, the \u003cem\u003eBBC\u003c/em\u003e\u0026#39;s reaction to \u003ca href=\"https://appleinsider.com/articles/24/12/13/bbc-cries-foul-over-apple-intelligence-headline-notification-summarizations\"\u003epoorly summarized headlines\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003eThere is no world in which Apple could have released a hallucinating contextual \u003ca href=\"https://appleinsider.com/inside/siri\" title=\"Siri\" data-kpt=\"1\"\u003eSiri\u003c/a\u003e that told people wildly incorrect information 20% of the time. There\u0026#39;s already enough hate around Siri and Apple Intelligence without such a disastrous rollout.\n\u003c/p\u003e\u003cp\u003eThankfully, Apple had the foresight to delay the feature and \u003ca href=\"https://appleinsider.com/articles/25/03/20/john-giannandrea-out-as-siri-chief-apple-vision-pro-lead-in\"\u003eshuffle some leadership\u003c/a\u003e to ensure such a thing won\u0026#39;t happen. The short-term media cycle about Apple \u003ca href=\"https://appleinsider.com/articles/25/03/11/everyone-is-a-loser-in-the-apple-intelligence-race\"\u003ebeing further behind in AI\u003c/a\u003e is worth it if the public feature release goes off without a hitch.\n\u003c/p\u003e\u003cp\u003eIt seems highly unlikely that the lawsuit will go through, but crazier things have happened. A judge sympathetic to the lawsuit may determine that the disclaimer text isn\u0026#39;t sufficient in preventing consumers from being \u0026#34;tricked.\u0026#34;\n\u003c/p\u003e\u003cp\u003eIf this lawsuit does go through, then everyone should get in line and start filing against all the \u003ca href=\"https://appleinsider.com/articles/25/03/13/openai-wants-the-us-government-to-legalize-theft-to-reach-the-ai-promised-land\"\u003efalse claims\u003c/a\u003e made by all these AI companies. There doesn\u0026#39;t seem to be any sentient computers walking around, let alone programs that have upended the economy by stealing jobs.\n\u003c/p\u003e\u003cp\u003eBut that\u0026#39;s not important when there\u0026#39;s a company out there called Apple to sue.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-20T23:11:11Z",
  "modifiedTime": null
}
