{
  "id": "551c8940-9caf-421e-8e0e-73120e772dac",
  "title": "Apple again escapes $300M Optis wireless patents verdict on appeal",
  "link": "https://appleinsider.com/articles/25/06/17/apple-again-escapes-300m-optis-wireless-patents-verdict-on-appeal?utm_medium=rss",
  "description": "Apple has again managed to avoid paying a massive fee in its long-running Optis iPhone wireless patents lawsuit, with the U.S. Court of Appeals throwing out a $300 million verdict.4G LTE is still an expensive headache for AppleApple has been embroiled in a lawsuit with Optis Wireless Technology since 2019 over a handful of 4G LTE patents since 2019, and it has seen defeat twice. However, thanks to another favorable appeals court decision, it has managed to dodge the fine for a second time.In a decision from the U.S. Federal Court of Appeals on June 16, the 2022 ruling that resulted in a demand for Apple to pay $300 million in compensation to Optis is to effectively be bounced back to the court in Texas. Reuters reports a new trial is required, due to a procedural issue that affected the result. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Malcolm Owen",
  "published": "Tue, 17 Jun 2025 19:46:22 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Malcolm Owen",
  "length": 3316,
  "excerpt": "Apple has again managed to avoid paying a massive fee in its long-running Optis iPhone wireless patents lawsuit, with the U.S. Court of Appeals throwing out a $300 million verdict.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple has again managed to avoid paying a massive fee in its long-running Optis iPhone wireless patents lawsuit, with the U.S. Court of Appeals throwing out a $300 million verdict. Apple has been embroiled in a lawsuit with Optis Wireless Technology since 2019 over a handful of 4G LTE patents since 2019, and it has seen defeat twice. However, thanks to another favorable appeals court decision, it has managed to dodge the fine for a second time. In a decision from the U.S. Federal Court of Appeals on June 16, the 2022 ruling that resulted in a demand for Apple to pay $300 million in compensation to Optis is to effectively be bounced back to the court in Texas. Reuters reports a new trial is required, due to a procedural issue that affected the result. According to the three-judge panel, the problem was how U.S. District Judge Rodney Gilstrap had set up the form used by the jury to record their verdict. At the time, both Apple and Optis petitioned for the form to be broken up so that the question of whether Apple had infringed the patents was asked on a per-patent basis. However, Gilstrap instead asked a single question on whether Apple infringed on the patents. The Court of Appeals filing explains that the single question form deprived Apple of the right of a verdict on each legal claim against it. The use of a single question meant the answer applied to all claims, not just one. If Apple infringed on any patents at all, the jurors were required to say \"yes,\" applying to all claims. In response, the judges instructed for a vacation of the damages retrial judgment, and for a new trial to take place. A follow up statement from Optis was shared with AppleInsider: We remain highly confident the Court will establish fair compensation for the critical Optis patents that enable high-speed connectivity for millions of Apple devices. Nothing in this decision challenges the fundamental facts, which demonstrate that Apple is infringing Optis patents and permit a new trial on damages. No patents were found to be invalid by the U.S. Court of Appeals for the Federal Circuit.Apple has not yet commented on the matter. Millions and millionsThe lawsuit dates back to 2019, when Optis lodged a complaint against Apple over seven patents connected to LTE cellular standards. One year later, Apple had failed in the trial, and was ordered to pay $506.2 million to Optis. By April 2021, Apple had managed to secure a retrial on the verdict, due to the \"serious doubt\" over the verdict. Again there was a belief that the dispute had been \"tainted\" due to the way the jury was instructed. At the time, the jury was not told what the FRAND terms were, which Gilstram said cast doubt on the reliability of the verdict. However, it was decided that the retrial wouldn't determine whether Apple had infringed on the patents, but more to adjust the level of damages owed. That May 2022 retrial resulted in the reduction to the $300 million figure that has been vacated by the Federal Court of Appeals. A date for the retrial has yet to be set. Even if the Optis lawsuit fails to secure any money, the company still stands to benefit. In May, the UK Court of Appeal declared a payment by Apple to Optis of $56.43 million plus interest was too low, and that Apple should instead pay $502 million.",
  "image": "https://photos5.appleinsider.com/gallery/64053-133314-63479-131942-48478-94615-000-lead-LTE-xl-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eApple has again managed to avoid paying a massive fee in its long-running Optis \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e wireless patents lawsuit, with the U.S. Court of Appeals throwing out a $300 million verdict. \n\u003c/p\u003e\u003cp\u003eApple has been embroiled in a lawsuit with Optis Wireless Technology since 2019 over a handful of 4G LTE patents since 2019, and it has seen defeat twice. However, thanks to another favorable appeals court decision, it has managed to dodge the fine for a second time. \n\u003c/p\u003e\u003cp\u003eIn a decision from the U.S. Federal Court of Appeals on June 16, the \u003ca href=\"https://appleinsider.com/articles/22/05/19/apple-must-pay-panoptis-300-million-for-infringing-wireless-patents\"\u003e2022 ruling\u003c/a\u003e that resulted in a demand for Apple to pay $300 million in compensation to Optis is to  effectively be bounced back to the court in Texas. \u003cem\u003eReuters\u003c/em\u003e \u003ca href=\"https://www.reuters.com/legal/litigation/apple-wins-appeal-overturn-300-mln-us-patent-verdict-2025-06-17/\"\u003ereports\u003c/a\u003e a new trial is required, due to a procedural issue that affected the result. \n\u003c/p\u003e\u003cp\u003eAccording to the three-judge panel, the problem was how U.S. District Judge Rodney Gilstrap had set up the form used by the jury to record their verdict. \n\u003c/p\u003e\u003cp\u003eAt the time, both Apple and Optis petitioned for the form to be broken up so that the question of whether Apple had infringed the patents was asked on a per-patent basis. However, Gilstrap instead asked a single question on whether Apple infringed on the patents. \n\u003c/p\u003e\u003cp\u003eThe Court of Appeals filing explains that the single question form deprived Apple of the right of a verdict on each legal claim against it. The use of a single question meant the answer applied to all claims, not just one. \n\u003c/p\u003e\u003cp\u003eIf Apple infringed on any patents at all, the jurors were required to say \u0026#34;yes,\u0026#34; applying to all claims. \n\u003c/p\u003e\u003cp\u003eIn response, the judges instructed for a vacation of the damages retrial judgment, and for a new trial to take place. \n\u003c/p\u003e\u003cp\u003eA follow up statement from Optis was shared with \u003cem\u003eAppleInsider\u003c/em\u003e:\n\u003c/p\u003e\u003cblockquote\u003eWe remain highly confident the Court will establish fair compensation for the critical Optis patents that enable high-speed connectivity for millions of Apple devices. Nothing in this decision challenges the fundamental facts, which demonstrate that Apple is infringing Optis patents and permit a new trial on damages. No patents were found to be invalid by the U.S. Court of Appeals for the Federal Circuit.\u003c/blockquote\u003e\u003cp\u003eApple has not yet commented on the matter.\n\u003c/p\u003e\u003ch2 data-anchor=\"millions-and-millions\" id=\"millions-and-millions\"\u003eMillions and millions\u003c/h2\u003e\u003cp\u003eThe lawsuit dates back \u003ca href=\"https://appleinsider.com/articles/19/02/26/apples-iphone-ipad-more-targeted-in-new-lawsuit-over-lte-patents\"\u003eto 2019\u003c/a\u003e, when Optis lodged a complaint against Apple over seven patents connected to LTE cellular standards. One year later, Apple had failed in the trial, and was ordered to pay \u003ca href=\"https://appleinsider.com/articles/20/08/11/apple-ordered-to-pay-panoptis-5062m-for-infringing-lte-patents\"\u003e$506.2 million\u003c/a\u003e to Optis. \n\u003c/p\u003e\u003cp\u003eBy April 2021, Apple had managed to \u003ca href=\"https://appleinsider.com/articles/21/04/15/apple-gets-retrial-over-tainted-506-million-panoptis-defeat\"\u003esecure a retrial\u003c/a\u003e on the verdict, due to the \u0026#34;serious doubt\u0026#34; over the verdict. Again there was a belief that the dispute had been \u0026#34;tainted\u0026#34; due to the way the jury was instructed. \n\u003c/p\u003e\u003cp\u003eAt the time, the jury was not told what the FRAND terms were, which Gilstram said cast doubt on the reliability of the verdict. However, it was decided that the retrial wouldn\u0026#39;t determine whether Apple had infringed on the patents, but more to adjust the level of damages owed. \n\u003c/p\u003e\u003cp\u003eThat May 2022 retrial resulted in the reduction to the $300 million figure that has been vacated by the Federal Court of Appeals. \n\u003c/p\u003e\u003cp\u003eA date for the retrial has yet to be set. \n\u003c/p\u003e\u003cp\u003eEven if the Optis lawsuit fails to secure any money, the company still stands to benefit. In May, the UK Court of Appeal declared a payment by Apple to Optis of $56.43 million plus interest \u003ca href=\"https://appleinsider.com/articles/25/05/01/apple-slapped-with-502m-bill-for-uk-cellular-patent-infringement\"\u003ewas too low\u003c/a\u003e, and that Apple should instead pay $502 million. \u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-17T19:46:00Z",
  "modifiedTime": null
}
