{
  "id": "561040ae-1e82-4f30-bb14-c261330bebcd",
  "title": "The Talk Show: ‘Putting a Stink on the Letter X’",
  "link": "https://daringfireball.net/thetalkshow/2025/03/08/ep-418",
  "description": "",
  "author": "John Gruber",
  "published": "2025-03-09T02:41:00Z",
  "source": "https://daringfireball.net/feeds/main",
  "categories": null,
  "byline": "Saturday, 8 March 2025",
  "length": 2063,
  "excerpt": "Craig Hockenberry returns to the show. Topics include Apple’s new hardware this week — M3 iPad Airs, A16 regular iPads, M4 MacBook Airs, and the M4 Max and surprising M3 Ultra Mac Studios. And we go deep on The Iconfactory’s years-in-the-making new app, Tapestry — a universal timeline for the Internet.",
  "siteName": "",
  "favicon": "https://daringfireball.net/graphics/apple-touch-icon.png",
  "text": "The Talk Show ‘Putting a Stink on the Letter X’, With Craig Hockenberry Craig Hockenberry returns to the show. Topics include Apple’s new hardware this week — M3 iPad Airs, A16 regular iPads, M4 MacBook Airs, and the M4 Max and surprising M3 Ultra Mac Studios. And we go deep on The Iconfactory’s years-in-the-making new app, Tapestry — a universal timeline for the Internet. Exclusively sponsored by: Google Gemini: Chat to supercharge your ideas. Unofficial but surprisingly good transcripts. Links: Daring Fireball posts of note: “Apple Updates iPad Air (M2→M3) and Regular iPad (A14→A16), and Revamps Magic Keyboard for iPad Air”. “Apple Announces, With Little Surprise, M4 MacBook Airs”. “Apple Announces, With Much Surprise, Mac Studios With M4 Max and M3 Ultra (!) Chips”. From January: “Openvibe, a Multi-Social-Network App for Bluesky, Mastodon, Threads (Supposedly), and Nostr”. Tapestry: “Weaving your favorite blogs, social media, and more into a unified and chronological timeline.” Craig, on the Iconfactory blog: “Enter Tapestry”. Cheryl Cicha, also on the Iconfactory blog: “Tapestry: Past, Present, and Future”. Tapestry Connectors — an open, easy (documented!) extensions API. Fefes Blog — you’ll have to listen to the show to understand how this is a Tapestry-related link. But trust me, it’s a good story. It starts with this thread on Mastodon, which begins like a great novel: “It’s becoming clear that XML in RSS is the preferred tool of sociopaths.” Molly White: “POSSE” (“Publish [on your] Own Site, Syndicate Elsewhere”). The Iconfactory: Linea Sketch — “a lightweight digital sketchpad for your iPad”. Wallaroo — fun new wallpapers every week, for iOS and Mac. Tot — we didn’t mention this brilliant little notes app on the show, but I use it every day. iPulse — a nerdy system monitor, with Iconfactory fit and finish. Runs in the background even on iOS. Project Tapestry’s year-ago successful Kickstarter campaign. Andre Torrez’s Tyke, the inspiration for Tot. This episode of The Talk Show was edited by Caleb Sexton.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"Box\"\u003e\n\u003ch2\u003e\u003ca href=\"https://daringfireball.net/thetalkshow/\"\u003eThe Talk Show\u003c/a\u003e\u003c/h2\u003e\n\n\u003ch2\u003e‘Putting a Stink on the Letter X’, With Craig Hockenberry\u003c/h2\u003e\n\n\n\n\u003cp\u003eCraig Hockenberry returns to the show. Topics include Apple’s new hardware this week — M3 iPad Airs, A16 regular iPads, M4 MacBook Airs, and the M4 Max and surprising M3 Ultra Mac Studios. And we go deep on The Iconfactory’s years-in-the-making new app, \u003ca href=\"https://usetapestry.com/\"\u003eTapestry\u003c/a\u003e — a universal timeline for the Internet.\u003c/p\u003e\n\n\n\n\u003cp\u003eExclusively sponsored by:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://gemini.google.com/\"\u003eGoogle Gemini\u003c/a\u003e: Chat to supercharge your ideas.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003ca href=\"http://podsearch.david-smith.org/shows/11\"\u003eUnofficial but surprisingly good transcripts\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eLinks:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eDaring Fireball posts of note:\n\u003cul\u003e\u003cli\u003e“\u003ca href=\"https://daringfireball.net/linked/2025/03/04/moren-ipad-air-ipad-updates\"\u003eApple Updates iPad Air (M2→M3) and Regular iPad (A14→A16), and Revamps Magic Keyboard for iPad Air\u003c/a\u003e”.\u003c/li\u003e\n\u003cli\u003e“\u003ca href=\"https://daringfireball.net/linked/2025/03/05/apple-announces-with-little-surprise-m4-macbook-airs\"\u003eApple Announces, With Little Surprise, M4 MacBook Airs\u003c/a\u003e”.\u003c/li\u003e\n\u003cli\u003e“\u003ca href=\"https://daringfireball.net/linked/2025/03/05/apple-announces-with-much-surprise-mac-studios-with-m4-max-and-m3-ultra-chips\"\u003eApple Announces, With Much Surprise, Mac Studios With M4 Max and M3 Ultra (!) Chips\u003c/a\u003e”.\u003c/li\u003e\n\u003cli\u003eFrom January: “\u003ca href=\"https://daringfireball.net/2025/01/openvibe\"\u003eOpenvibe, a Multi-Social-Network App for Bluesky, Mastodon, Threads (Supposedly), and Nostr\u003c/a\u003e”.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://usetapestry.com/\"\u003eTapestry\u003c/a\u003e: “Weaving your favorite blogs, social media, and more into a unified and chronological timeline.”\n\u003cul\u003e\u003cli\u003eCraig, on the Iconfactory blog: “\u003ca href=\"https://blog.iconfactory.com/2025/02/enter-tapestry/\"\u003eEnter Tapestry\u003c/a\u003e”.\u003c/li\u003e\n\u003cli\u003eCheryl Cicha, also on the Iconfactory blog: “\u003ca href=\"https://blog.iconfactory.com/2025/02/tapestry-by-iconfactory-past-present-and-future/\"\u003eTapestry: Past, Present, and Future\u003c/a\u003e”.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://usetapestry.com/connectors/\"\u003eTapestry Connectors\u003c/a\u003e — an open, easy (\u003ca href=\"https://github.com/TheIconfactory/Tapestry/blob/main/Documentation/GettingStarted.md\"\u003edocumented\u003c/a\u003e!) extensions API.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://blog.fefe.de/\"\u003eFefes Blog\u003c/a\u003e — you’ll have to listen to the show to understand how this is a Tapestry-related link. But trust me, it’s a good story. It starts with \u003ca href=\"https://mastodon.social/@chockenberry/114005146021585361\"\u003ethis thread on Mastodon\u003c/a\u003e, which begins like a great novel: “It’s becoming clear that XML in RSS is the preferred tool of sociopaths.”\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.mollywhite.net/micro/entry/202403091817\"\u003eMolly White: “POSSE”\u003c/a\u003e (“Publish [on your] Own Site, Syndicate Elsewhere”).\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://apps.iconfactory.com/\"\u003eThe Iconfactory\u003c/a\u003e:\n\u003cul\u003e\u003cli\u003e\u003ca href=\"https://linea-app.com/\"\u003eLinea Sketch\u003c/a\u003e — “a lightweight digital sketchpad for your iPad”.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://wallaroo.app/\"\u003eWallaroo\u003c/a\u003e — fun new wallpapers every week, for iOS and Mac.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://tot.rocks/\"\u003eTot\u003c/a\u003e — we didn’t mention this brilliant little notes app on the show, but I use it every day.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://ipulseapp.com/\"\u003eiPulse\u003c/a\u003e — a nerdy system monitor, with Iconfactory fit and finish. Runs in the background even on iOS.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://blog.iconfactory.com/2024/02/tapestry-unwoven/\"\u003eProject Tapestry’s year-ago successful Kickstarter campaign\u003c/a\u003e.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://tyke.app\"\u003eAndre Torrez’s Tyke\u003c/a\u003e, the inspiration for Tot.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cem\u003eThis episode of The Talk Show was edited by Caleb Sexton.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
