{
  "id": "661a201f-61c2-4ba8-b61c-973a0c03bbf0",
  "title": "The Strange Case of Apple Intelligence’s iPhone-only Mail Sorting Feature",
  "link": "https://www.macstories.net/linked/the-strange-case-of-apple-intelligences-iphone-only-mail-sorting-feature/",
  "description": "Tim Hardwick, writing for MacRumors, on a strange limitation of the Apple Intelligence rollout earlier this week: Apple’s new Mail sorting features in iOS 18.2 are notably absent from both iPadOS 18.2 and macOS Sequoia 15.2, raising questions about the company’s rollout strategy for the email management system. The new feature automatically sorts emails into […]",
  "author": "Federico Viticci",
  "published": "Fri, 13 Dec 2024 17:14:17 +0000",
  "source": "https://www.macstories.net/feed",
  "categories": [
    "Linked",
    "Apple Intelligence",
    "mail"
  ],
  "byline": "",
  "length": 2083,
  "excerpt": "Tim Hardwick, writing for MacRumors, on a strange limitation of the Apple Intelligence rollout earlier this week: Apple’s new Mail sorting features in iOS 18.2 are notably absent from both iPadOS 18.2 and macOS Sequoia 15.2, raising questions about the company’s rollout strategy for the email management system. The new feature automatically sorts emails into",
  "siteName": "",
  "favicon": "https://www.macstories.net/app/themes/macstories4/images/apple-touch-icon-152x152-precomposed.png",
  "text": "Tim Hardwick, writing for MacRumors, on a strange limitation of the Apple Intelligence rollout earlier this week: Apple’s new Mail sorting features in iOS 18.2 are notably absent from both iPadOS 18.2 and macOS Sequoia 15.2, raising questions about the company’s rollout strategy for the email management system. The new feature automatically sorts emails into four distinct categories: Primary, Transactions, Updates, and Promotions, with the aim of helping iPhone users better organize their inboxes. Devices that support Apple Intelligence also surface priority messages as part of the new system. Users on iPhone who updated to iOS 18.2 have the features. However, iPad and Mac users who updated their devices with the software that Apple released concurrently with iOS 18.2 will have noticed their absence. iPhone users can easily switch between categorized and traditional list views, but iPad and Mac users are limited to the standard chronological inbox layout. This was so odd during the beta cycle, and it continues to be the single decision I find the most perplexing in Apple’s launch strategy for Apple Intelligence. I didn’t cover Mail’s new smart categorization feature in my story about Apple Intelligence for one simple reason: it’s not available on the device where I do most of my work: my iPad Pro. I’ve been able to test the functionality on my iPhone, and it’s good enough: iOS occasionally gets a category wrong, but (surprisingly) you can manually categorize a sender and train the system yourself. (As an aside: can we talk about the fact that a bunch of options, including sender categorization, can only be accessed via Mail’s…Reply button? How did we end up in this situation?) I would very much prefer to use Apple Mail instead of Spark, which offers smart inbox categorization across platforms but is nowhere as nice-looking as Mail and comes with its own set of quirks. However, as long as smart categories are exclusive to the iPhone version of Mail, Apple’s decision prevents me from incorporating the updated Mail app into my daily workflow.",
  "image": "https://56243e3f6f46fe44a301-deabeb5f3878e3553d0b065ea974f9bf.ssl.cf1.rackcdn.com/256px.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"content\"\u003e\n\n    \n\n    \u003cdiv\u003e\n                        \u003cp id=\"p1\"\u003eTim Hardwick, \u003ca href=\"https://www.macrumors.com/2024/12/12/apple-mail-features-missing-mac-ipad/\" rel=\"noopener noreferrer\"\u003ewriting for MacRumors\u003c/a\u003e, on a strange limitation of the Apple Intelligence rollout \u003ca href=\"https://www.macstories.net/stories/apple-intelligence-and-chatgpt-in-18-2/\" rel=\"noopener noreferrer\"\u003eearlier this week\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote id=\"blockquote2\"\u003e\u003cp\u003e\n  Apple’s new Mail sorting features in iOS 18.2 are notably absent from both iPadOS 18.2 and macOS Sequoia 15.2, raising questions about the company’s rollout strategy for the email management system.\u003c/p\u003e\n\u003cp\u003e  The new feature automatically sorts emails into four distinct categories: Primary, Transactions, Updates, and Promotions, with the aim of helping iPhone users better organize their inboxes. Devices that support Apple Intelligence also surface priority messages as part of the new system.\u003c/p\u003e\n\u003cp\u003e  Users on iPhone who updated to iOS 18.2 have the features. However, iPad and Mac users who updated their devices with the software that Apple released concurrently with iOS 18.2 will have noticed their absence. iPhone users can easily \u003ca href=\"https://www.macrumors.com/how-to/ios-disable-apple-mail-categories/\" rel=\"noopener noreferrer\"\u003eswitch between categorized and traditional list views\u003c/a\u003e, but iPad and Mac users are limited to the standard chronological inbox layout.\n\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp id=\"p3\"\u003eThis was so odd during the beta cycle, and it continues to be the single decision I find the most perplexing in Apple’s launch strategy for Apple Intelligence.\u003c/p\u003e\n\u003cp id=\"p4\"\u003eI didn’t cover Mail’s new smart categorization feature in my story about Apple Intelligence for one simple reason: it’s not available on the device where I do most of my work: my iPad Pro. I’ve been able to test the functionality on my iPhone, and it’s good enough: iOS occasionally gets a category wrong, but (surprisingly) you can manually categorize a sender and train the system yourself.\u003c/p\u003e\n\u003cp id=\"p5\"\u003e(As an aside: can we talk about the fact that a bunch of options, including sender categorization, can only be accessed via Mail’s…Reply button? How did we end up in this situation?)\u003c/p\u003e\n\u003cp id=\"p6\"\u003eI would very much prefer to use Apple Mail instead of Spark, which offers smart inbox categorization across platforms but is nowhere as nice-looking as Mail and comes with \u003ca href=\"https://bsky.app/profile/myke.social/post/3ld4yuggutc2x\" rel=\"noopener noreferrer\"\u003eits own set of quirks\u003c/a\u003e. However, as long as smart categories are exclusive to the iPhone version of Mail, Apple’s decision prevents me from incorporating the updated Mail app into my daily workflow.\u003c/p\u003e\n            \u003c/div\u003e\n\n    \n        \n\n    \n    \n    \n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-13T17:14:17-05:00",
  "modifiedTime": null
}
