{
  "id": "667e9b06-1517-420c-aabe-aac842c694bd",
  "title": "Apple is researching smart glasses with an internal study, report claims",
  "link": "https://appleinsider.com/articles/24/11/05/apple-is-researching-smart-glasses-with-an-internal-study-report-claims?utm_medium=rss",
  "description": "Apple is reportedly using an internal study to gauge interest in smart glasses as the company continues to develop its own Apple Glass, an eventual successor to Apple Vision Pro.Apple is reportedly exploring Smart Glasses with an internal study.The aforementioned study was supposedly launched at the end of October and is known under the project codename Atlas, not to be confused with a scrapped iPhone 16 hardware project bearing the same codename. With its internal study, Apple seeks to gather employee feedback on smart glasses currently on the market.The study is reportedly being conducted by the company's Product Systems Quality team, which is part of Apple's hardware engineering division. There are also plans for additional focus groups in the near future. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Marko Zivkovic",
  "published": "Tue, 05 Nov 2024 00:52:39 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Marko Zivkovic",
  "length": 2362,
  "excerpt": "Apple is reportedly using an internal study to gauge interest in smart glasses as the company continues to develop its own Apple Glass, an eventual successor to Apple Vision Pro.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple is reportedly exploring Smart Glasses with an internal study. Apple is reportedly using an internal study to gauge interest in smart glasses as the company continues to develop its own Apple Glass, an eventual successor to Apple Vision Pro. The aforementioned study was supposedly launched at the end of October and is known under the project codename Atlas, not to be confused with a scrapped iPhone 16 hardware project bearing the same codename. With its internal study, Apple seeks to gather employee feedback on smart glasses currently on the market. The study is reportedly being conducted by the company's Product Systems Quality team, which is part of Apple's hardware engineering division. There are also plans for additional focus groups in the near future. According to the Bloomberg report, the company sent out an internal email asking select employees at its Cupertino headquarters to participate in the study. \"Testing and developing products that all can come to love is very important to what we do at Apple,\" the email says. \"This is why we are looking for participants to join us in an upcoming user study with current market smart glasses.\" Previous rumors have indicated that Apple wants to launch its own Smart Glasses in 2027, while an Apple patent application surrounding a potential hinge mechanism has also appeared among years of evidence of work on such a project. Other companies have already expressed interest in smart glasses, with Meta unveiling its Orion prototype in September of 2024. It makes sense that Apple would take into account employee feedback and analyze its potential market competitors. People with knowledge of the Apple Vision Pro's development cycle told AppleInsider that the company conducted an analysis of virtual reality headsets on the market before launching the device, so a similar strategy for smart glasses seems likely. In 2025, the Apple Vision Pro could be updated with an entirely new M5 chip, while a low-cost variant of the device has allegedly been delayed until 2027. Apple's CEO Tim Cook has previously described the current Apple Vision Pro as an early-adopter product, which indicates that the company likely has plans for future augmented reality headsets, possibly even smart glasses.",
  "image": "https://photos5.appleinsider.com/gallery/61644-127416-61378-126796-53946-108526-Apple-Glass-pairing-xl-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-hero\" aria-labelledby=\"hero-cap\" role=\"figure\"\u003e\n                          \u003cp id=\"hero-cap\" title=\"Apple is reportedly exploring Smart Glasses with an internal study.\"\u003eApple is reportedly exploring Smart Glasses with an internal study.\u003c/p\u003e\n                                    \u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61644-127416-61378-126796-53946-108526-Apple-Glass-pairing-xl-xl-xl.jpg\"\u003e\n              \u003cimg fetchpriority=\"high\" src=\"https://photos5.appleinsider.com/gallery/61644-127416-61378-126796-53946-108526-Apple-Glass-pairing-xl-xl-xl.jpg\" alt=\"\"/\u003e\n            \u003c/a\u003e\n                      \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cp\u003eApple is reportedly using an internal study to gauge interest in smart glasses as the company continues to develop its own \u003ca href=\"https://appleinsider.com/inside/apple-glass\" title=\"Apple Glass\" data-kpt=\"1\"\u003eApple Glass\u003c/a\u003e, an eventual successor to Apple Vision Pro.\n\u003c/p\u003e\u003cp\u003eThe aforementioned study was supposedly launched at the end of October and is known under the project codename Atlas, not to be confused with a scrapped \u003ca href=\"https://appleinsider.com/inside/iphone-16\" title=\"iPhone 16\" data-kpt=\"1\"\u003eiPhone 16\u003c/a\u003e hardware \u003ca href=\"https://appleinsider.com/articles/24/09/25/iphone-16-features-and-designs-that-didnt-make-it-out-of-prototyping\"\u003eproject\u003c/a\u003e bearing the same codename. With its internal study, Apple seeks to gather employee feedback on smart glasses currently on the market.\n\u003c/p\u003e\u003cp\u003eThe study is reportedly being conducted by the company\u0026#39;s Product Systems Quality team, which is part of Apple\u0026#39;s hardware engineering division. There are also plans for additional focus groups in the near future.\n\u003c/p\u003e\u003cp\u003eAccording to the \u003cem\u003eBloomberg\u003c/em\u003e \u003ca href=\"https://www.bloomberg.com/news/articles/2024-11-04/apple-explores-push-into-smart-glasses-with-atlas-user-study\"\u003ereport\u003c/a\u003e, the company sent out an internal email asking select employees at its Cupertino headquarters to participate in the study.\n\u003c/p\u003e\u003cp\u003e\u0026#34;Testing and developing products that all can come to love is very important to what we do at Apple,\u0026#34; the email says. \u0026#34;This is why we are looking for participants to join us in an upcoming user study with current market smart glasses.\u0026#34;\n\u003c/p\u003e\u003cp\u003ePrevious \u003ca href=\"https://appleinsider.com/articles/24/10/13/apple-smart-glasses-airpods-with-cameras-could-finally-arrive-in-2027\"\u003erumors\u003c/a\u003e have indicated that Apple wants to launch its own Smart Glasses in 2027, while an Apple \u003ca href=\"https://appleinsider.com/articles/24/06/06/apple-glass-rumors-resurrected-thanks-to-eyeglass-hinge-patent-application\"\u003epatent application\u003c/a\u003e surrounding a potential hinge mechanism has also appeared among years of evidence of work on such a project. Other companies have already expressed interest in smart glasses, with Meta unveiling its \u003ca href=\"https://appleinsider.com/articles/24/09/25/metas-orion-preview-shines-a-light-on-apples-spatial-computing-future\"\u003eOrion prototype\u003c/a\u003e in September of 2024.\n\u003c/p\u003e\u003cp\u003eIt makes sense that Apple would take into account employee feedback and analyze its potential market competitors. People with knowledge of the \u003ca href=\"https://appleinsider.com/inside/apple-vision-pro\" title=\"Apple Vision Pro\" data-kpt=\"1\"\u003eApple Vision Pro\u003c/a\u003e\u0026#39;s development cycle told \u003cem\u003eAppleInsider\u003c/em\u003e that the company conducted an analysis of virtual reality headsets on the market before launching the device, so a similar strategy for smart glasses seems likely.\n\u003c/p\u003e\u003cp\u003eIn 2025, the Apple Vision Pro \u003ca href=\"https://appleinsider.com/articles/24/11/03/apple-vision-pro-to-get-m5-in-2025-but-lower-cost-model-is-delayed\"\u003ecould be updated\u003c/a\u003e with an entirely new M5 chip, while a low-cost variant of the device has allegedly been delayed until 2027. Apple\u0026#39;s CEO \u003ca href=\"https://appleinsider.com/inside/tim-cook\" title=\"Tim Cook\" data-kpt=\"1\"\u003eTim Cook\u003c/a\u003e has previously \u003ca href=\"https://appleinsider.com/articles/24/02/02/apple-vision-pro-is-tomorrows-technology-today-says-tim-cook\"\u003edescribed\u003c/a\u003e the current Apple Vision Pro as an early-adopter product, which indicates that the company likely has plans for future augmented reality headsets, possibly even smart glasses.\n\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-05T00:52:39Z",
  "modifiedTime": null
}
