{
  "id": "700f3165-da6b-4075-b975-f9ea1ae954f2",
  "title": "The Mac’s Space Gray era is officially over",
  "link": "https://www.macworld.com/article/2628147/the-macs-space-gray-era-is-officially-over.html",
  "description": "Macworld As part of the M4 MacBook Air announcement on Wednesday, Apple also revealed a brand new MacBook color: Sky Blue. But it comes with a price: Gone is the MacBook Air’s longstanding Space Gray option, which means that Apple no longer offers any new Mac in Space Gray. Space Gray made its debut on the iPhone 5s in 2013 (which we referred to as “something called ‘space gray'” when it was introduced). The first Mac in Space Gray was the 12-inch MacBook in 2015, which we described as a “serious and sophisticated finish”–we also erroneously wrote it as “grey” and not “gray” as Apple puts it. While Space Gray had only one name during its tenure, it took on different shades over the years. Sometimes it was lighter and nearly silver, other times it was darker and closer to black. Which was an odd thing for Apple, a company that prides itself in its design consistency. Apple has not commented on the end of Space Gray, and just because it’s no longer offered on a Mac right now doesn’t mean it’s one forever. Apple could decide to revive it in the future. Apple’s Mac color choices are bright and colorful (with one darker Midnight option) on the consumer side, metallic shades on the pro side, and silver for the tween-ish Mac mini. If you really want a Space Gray Mac, you have to settle for older models at third-party retailers or in the Apple Certified Refurbished Store. However, Space Gray still lives on the iPad Air and the iPad mini. If you feel like grieving for the loss of Space Gray on the Mac, please enjoy the Space Gray memorial slideshow below. You can even play this song while you’re looking at the pictures.",
  "author": "",
  "published": "Wed, 05 Mar 2025 17:37:48 +0000",
  "source": "https://www.macworld.com/index.rss",
  "categories": [
    "Mac"
  ],
  "byline": "Author: Roman Loyola, Senior Editor, Macworld",
  "length": 2117,
  "excerpt": "It took on many shades over the years, but it's finally faded away.",
  "siteName": "Macworld",
  "favicon": "https://www.macworld.com/wp-content/uploads/2021/03/cropped-macworld-favicon.png?w=192",
  "text": "Image: Apple As part of the M4 MacBook Air announcement on Wednesday, Apple also revealed a brand new MacBook color: Sky Blue. But it comes with a price: Gone is the MacBook Air’s longstanding Space Gray option, which means that Apple no longer offers any new Mac in Space Gray. Space Gray made its debut on the iPhone 5s in 2013 (which we referred to as “something called ‘space gray'” when it was introduced). The first Mac in Space Gray was the 12-inch MacBook in 2015, which we described as a “serious and sophisticated finish”–we also erroneously wrote it as “grey” and not “gray” as Apple puts it. While Space Gray had only one name during its tenure, it took on different shades over the years. Sometimes it was lighter and nearly silver, other times it was darker and closer to black. Which was an odd thing for Apple, a company that prides itself in its design consistency. Apple has not commented on the end of Space Gray, and just because it’s no longer offered on a Mac right now doesn’t mean it’s gone forever. Apple could decide to revive it someday. Apple’s Mac color choices are bright and colorful (with one darker Midnight option) on the consumer side, metallic shades on the pro side, and silver for the tween-ish Mac mini. If you really want a Space Gray Mac, you have to settle for older models at third-party retailers or in the Apple Certified Refurbished Store. However, Space Gray still lives on the iPad Air and the iPad mini. If you feel like grieving for the loss of Space Gray on the Mac, please enjoy the Space Gray memorial slideshow below. You can even play this song while you’re looking at the pictures. Roman is a Macworld Senior Editor with over 30 years of experience covering the tech industry, focusing on the Mac and other products in the Apple ecosystem. He is also the host of the Macworld Podcast. His career started at MacUser, where he received Apple certification as a repair technician (when Apple did that kind of thing). He's also worked for MacAddict, MacLife, and TechTV.",
  "image": "https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?quality=50\u0026strip=all\u0026w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-2628147\"\u003e\n\t\n\n\t\n\n\t\u003cdiv\u003e\n\t\t\t\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg width=\"1024\" height=\"683\" src=\"https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?quality=50\u0026amp;strip=all\u0026amp;w=1024\" alt=\"Mac mini space gray 2022\" data-hero=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?quality=50\u0026amp;strip=all 1500w, https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?resize=300%2C200\u0026amp;quality=50\u0026amp;strip=all 300w, https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?resize=768%2C512\u0026amp;quality=50\u0026amp;strip=all 768w, https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?resize=1200%2C800\u0026amp;quality=50\u0026amp;strip=all 1200w, https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?resize=1240%2C826\u0026amp;quality=50\u0026amp;strip=all 1240w, https://www.macworld.com/wp-content/uploads/2025/03/mac-mini-space-gray-2.jpg?resize=150%2C100\u0026amp;quality=50\u0026amp;strip=all 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eImage: Apple\u003c/span\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\n\t\t\t\t\t\n\u003cdiv id=\"link_wrapped_content\"\u003e\n\n\n\n\n\u003cp\u003eAs part of the \u003ca href=\"https://www.macworld.com/article/2627909/apple-unveils-cheaper-macbook-air-with-m4-chip-and-better-camera.html\"\u003eM4 MacBook Air announcement\u003c/a\u003e on Wednesday, Apple also revealed a brand new MacBook color: Sky Blue. But it comes with a price: Gone is the MacBook Air’s longstanding Space Gray option, which means that Apple no longer offers any new Mac in Space Gray.\u003c/p\u003e\n\n\n\n\u003cp\u003eSpace Gray made its debut on the iPhone 5s in 2013 (which we referred to as “something called ‘space gray\u0026#39;” \u003ca href=\"https://www.macworld.com/article/221839/apple-unveils-powerful-iphone-5s-and-entry-level-5c.html\"\u003ewhen it was introduced\u003c/a\u003e). The first Mac in Space Gray was the \u003ca href=\"https://www.macworld.com/article/667307/1-1-ghz-apple-macbook-early-2015-review.html\"\u003e12-inch MacBook in 2015\u003c/a\u003e, which we described as a “serious and sophisticated finish”–we also erroneously wrote it as “grey” and not “gray” as Apple puts it.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile Space Gray had only one name during its tenure, it took on different shades over the years. Sometimes it was lighter and nearly silver, other times it was darker and closer to black. Which was an odd thing for Apple, a company that prides itself in its design consistency. Apple has not commented on the end of Space Gray, and just because it’s no longer offered on a Mac right now doesn’t mean it’s gone forever. Apple could decide to revive it someday.\u003c/p\u003e\n\n\n\n\u003cp\u003eApple’s Mac color choices are bright and colorful (with one darker Midnight option) on the consumer side, metallic shades on the pro side, and silver for the tween-ish Mac mini. If you really want a Space Gray Mac, you have to settle for older models at third-party retailers or in the \u003ca href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-3-2628147-1-0-0-0-0\u0026amp;u=https://www.apple.com/shop/refurbished\" rel=\"nofollow\" data-subtag=\"1-3-2628147-1-0-0-0-0\" data-domain-name=\"apple\" target=\"_blank\"\u003eApple Certified Refurbished Store\u003c/a\u003e. However, Space Gray still lives on the \u003ca href=\"https://www.macworld.com/article/2626371/really-the-new-ipad-air-has-a-new-chip-and-thats-it.html\"\u003eiPad Air\u003c/a\u003e and the \u003ca href=\"https://www.macworld.com/article/2504744/ipad-mini-a17-pro-review.html\"\u003eiPad mini\u003c/a\u003e.\u003c/p\u003e\n\n\t\t\n\t\t\t\n\t\t\t\n\n\n\u003cp\u003eIf you feel like grieving for the loss of Space Gray on the Mac, please enjoy the Space Gray memorial slideshow below. You can even \u003ca href=\"https://go.skimresources.com?id=111346X1569486\u0026amp;xs=1\u0026amp;url=https://music.apple.com/us/album/i-will-remember-you-theme-from-the-brothers-mcmullen/686780496?i=686781020\u0026amp;xcust=1-3-2628147-1-0-0-0-0\u0026amp;sref=https://www.macworld.com/article/2628147/the-macs-space-gray-era-is-officially-over.html\" rel=\"nofollow\" data-subtag=\"1-3-2628147-1-0-0-0-0\" data-domain-name=\"apple\" target=\"_blank\"\u003eplay this song\u003c/a\u003e while you’re looking at the pictures.\u003c/p\u003e\n\n\n\n\n\n\u003c/div\u003e\n\t\t\u003cdiv data-ga=\"article-footer-author\"\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.macworld.com/wp-content/uploads/2025/03/author_photo_Roman-Loyola_1662683660-35.jpg?quality=50\u0026amp;strip=all\u0026amp;w=150\u0026amp;h=150\u0026amp;crop=1\" height=\"125\" width=\"125\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003eRoman is a Macworld Senior Editor with over 30 years of experience covering the tech industry, focusing on the Mac and other products in the Apple ecosystem. He is also the host of the Macworld Podcast. His career started at MacUser, where he received Apple certification as a repair technician (when Apple did that kind of thing). He\u0026#39;s also worked for MacAddict, MacLife, and TechTV.\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
