{
  "id": "718b6213-3311-4224-b4ad-1fec6726e729",
  "title": "Apple CEO Tim Cook personally invested $1 million in Trump's inauguration",
  "link": "https://appleinsider.com/articles/25/01/03/apple-ceo-tim-cook-personally-invested-1-million-in-trumps-inauguration?utm_medium=rss",
  "description": "In a bid to gain favor with the president-elect, Apple CEO Tim Cook has contributed $1 million of his personal finances to the inauguration fund.CEO Tim Cook is familiar with dealing with president-electPresident-elect Donald Trump will be inaugurated on January 20, 2025, and tech giants want to ensure they are noticed. Companies and their CEOs have been making large contributions to the inauguration, and Apple is no different.However, instead of Apple itself contributing its own funds, its CEO Tim Cook is providing $1 million of his own money to the inauguration fund according to a report from Axios. Apple itself will not be providing funds. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Wesley Hilliard",
  "published": "Fri, 03 Jan 2025 21:47:04 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Wesley Hilliard",
  "length": 1738,
  "excerpt": "In a bid to gain favor with the president-elect, Apple CEO Tim Cook has contributed $1 million of his personal finances to the inauguration fund.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "In a bid to gain favor with the president-elect, Apple CEO Tim Cook has contributed $1 million of his personal finances to the inauguration fund. President-elect Donald Trump will be inaugurated on January 20, 2025, and tech giants want to ensure they are noticed. Companies and their CEOs have been making large contributions to the inauguration, and Apple is no different. However, instead of Apple itself contributing its own funds, its CEO Tim Cook is providing $1 million of his own money to the inauguration fund according to a report from Axios. Apple itself will not be providing funds. While the controversial president may seem like a character Apple would prefer to avoid, it isn't exactly possible given the current climate. This is evidenced by Cook's immediate congratulatory post after the election, followed by a dinner with the president-elect. Cook has a vested interest in keeping Trump on his good side. Between constant pressure from regulators around the world and the potential tariffs could do to profits, Apple needs to find favor and gain exemptions and protection. Every president presents a new set of challenges. Some want to break up big tech while others make enemies of China, Apple's manufacturing nirvana. Regardless of who's in power, it's not a guarantee things will be easy. Tim Cook isn't alone in schmoozing up to the president-elect. Executives from Meta, Amazon, and other big tech companies have been meeting at Mar-a-Lago and donated $1 million or more. Regardless of your political beliefs, everyone can admit that the CEO of one of the world's most profitable companies cannot ignore a leader just because they disagree. It remains to be seen if all of this work will benefit Apple in the end.",
  "image": "https://photos5.appleinsider.com/gallery/62203-128912-IMG_1515-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eIn a bid to gain favor with the president-elect, Apple CEO \u003ca href=\"https://appleinsider.com/inside/tim-cook\" title=\"Tim Cook\" data-kpt=\"1\"\u003eTim Cook\u003c/a\u003e has contributed $1 million of his personal finances to the inauguration fund.\n\u003c/p\u003e\u003cp\u003ePresident-elect Donald Trump will be inaugurated on January 20, 2025, and tech giants want to ensure they are noticed. Companies and their CEOs have been making large contributions to the inauguration, and Apple is no different.\n\u003c/p\u003e\u003cp\u003eHowever, instead of Apple itself contributing its own funds, its CEO Tim Cook is providing $1 million of his own money to the inauguration fund according to \u003ca href=\"https://www.axios.com/2025/01/03/tim-cook-apple-donate-1-million-trump-inauguration\"\u003ea report\u003c/a\u003e from \u003cem\u003eAxios\u003c/em\u003e. Apple itself will not be providing funds.\n\u003c/p\u003e\u003cp\u003eWhile the controversial president may seem like a character Apple would prefer to avoid, it isn\u0026#39;t exactly possible given the current climate. This is evidenced by Cook\u0026#39;s immediate \u003ca href=\"https://appleinsider.com/articles/24/11/06/apple-ceo-tim-cook-congratulates-trump-on-his-second-election-win\"\u003econgratulatory post\u003c/a\u003e after the election, followed by \u003ca href=\"https://appleinsider.com/articles/24/12/14/tim-cook-rumored-to-be-meeting-with-donald-trump-for-dinner-on-friday\"\u003ea dinner\u003c/a\u003e with the president-elect.\n\u003c/p\u003e\u003cp\u003eCook has a vested interest in keeping Trump on \u003ca href=\"https://appleinsider.com/articles/24/11/25/how-tim-cook-gets-trump-to-help-apple\"\u003ehis good side\u003c/a\u003e. Between constant pressure from regulators around the world and the \u003ca href=\"https://appleinsider.com/articles/24/11/11/trump-tariffs-will-raise-prices-but-apple-could-avoid-harsher-taxes\"\u003epotential tariffs\u003c/a\u003e could do to profits, Apple needs to find favor and gain exemptions and protection.\n\u003c/p\u003e\u003cp\u003eEvery president presents a new set of challenges. Some want to break up big tech while others make enemies of China, Apple\u0026#39;s manufacturing nirvana. Regardless of who\u0026#39;s in power, it\u0026#39;s not a guarantee things will be easy.\n\u003c/p\u003e\u003cp\u003eTim Cook isn\u0026#39;t alone in schmoozing up to the president-elect. Executives from Meta, Amazon, and other big tech companies have been meeting at Mar-a-Lago and donated $1 million or more.\n\u003c/p\u003e\u003cp\u003eRegardless of your political beliefs, everyone can admit that the CEO of one of the world\u0026#39;s most profitable companies cannot ignore a leader just because they disagree. It remains to be seen if all of this work will benefit Apple in the end.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-03T21:47:04Z",
  "modifiedTime": null
}
