{
  "id": "7c2361e6-1264-46a0-947b-b34ae1d8d1a9",
  "title": "Belkin Stage PowerGrip makes iPhone into a better camera",
  "link": "https://www.cultofmac.com/news/belkin-stage-powergrip",
  "description": "Make your iPhone easier to hold while taking pictures with Belkin Stage PowerGrip, which is being unveiled at CES 2025. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Sun, 05 Jan 2025 20:32:23 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "Belkin",
    "iPhone accessories"
  ],
  "byline": "Ed Hardy",
  "length": 2586,
  "excerpt": "Make your iPhone easier to hold while taking pictures with Belkin Stage PowerGrip, which is being unveiled at CES 2025.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News Make your iPhone easier to hold while taking pictures with Belkin Stage PowerGrip. Photo: Belkin The Belkin Stage PowerGrip adds the grip DSLR camera users are familiar with to an iPhone. Built into the grip is a battery which sends power to the handset via the MagSafe magnetic charging mat integrated into the device. And his is just one of multiple new accessories Belkin unveiled in time for CES 2025. Belkin Stage PowerGrip adds a grip and battery to iPhone An iPhone replaced a dedicated camera for many people, but handsets have disadvantages. A flat metal rectangle isn’t the easiest object to hold, for example. Magnetically connecting the Belkin Stage PowerGrip to the back of an iPhone reshapes the device into something easier to, well, grip. And the built-in 10,000 mAh battery juices up the iPhone through its MagSafe charging mat. A small screen shows remaining battery charge, and replenish the accessory with a retractable USB-C charging cable when it gets low. While iPhones already have excellent battery life, surely no one will complain about extending it. The accessory comes in a range of colors: powder blue, sandbox, fresh yellow, pepper and lavender. Belkin unveiled the Stage PowerGrip because CES 2025 kicks off Tuesday, January 7, not because the accessory is ready to ship. Actually, it’s not scheduled before May and doesn’t yet have a price. More Belkin charging products at CES 2025 BoostCharge Pro Magnetic Wireless Charging Pad 15W and BoostCharge Power Bank 20K are on Belkin’s 2025 agenda.Photo: Belkin CES 2025 is a major trade show with about 140,000 expected attendees. Belkin is using the event to unveil multiple products set to launch in the first half of the year, not just Stage PowerGrip. On the list is the BoostCharge Pro Magnetic Wireless Charging Pad 15W, which magnetically clings to the back of an iPhone or any Qi2-compatible device to act as both a pop-up kickstand and a charger. It includes an integrated 6.6 foot (2m) USB-C cable. The price will be $19.99 without a power supply or $29.99 with a power supply when the accessory launches in April in white or black. Another highlight of Belkin’s CES 2025 is the BoostCharge Power Bank 20K with Integrated Cable. As its name indicates, the 20,000 mAh external battery sports a short USB-C cable. This can send up to 30W to an iPhone 16 series model. The peripheral also includes additional USB-C and USB-A ports. It’ll debut in April for $49.99 in black, white, blue and pink color options. Source: Belkin",
  "image": "https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-Stage-PowerGrip.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-885989\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Belkin Stage PowerGrip makes iPhone into a better camera\" src=\"https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-Stage-PowerGrip.jpg\" alt=\"Belkin Stage PowerGrip\" data-ratio=\"1.7767653758542\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tMake your iPhone easier to hold while taking pictures with Belkin Stage PowerGrip. \u003cbr/\u003e\u003cem\u003ePhoto: Belkin\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eThe Belkin Stage PowerGrip adds the grip DSLR camera users are familiar with to an iPhone. Built into the grip is a battery which sends power to the handset via the MagSafe magnetic charging mat integrated into the device.\u003c/p\u003e\u003cspan data-ez-ph-id=\"901\"\u003e\u003c/span\u003e\n\u003cp\u003eAnd his is just one of multiple new accessories Belkin unveiled in time for CES 2025.\u003c/p\u003e\n\n\u003ch2\u003eBelkin Stage PowerGrip adds a grip and battery to iPhone\u003c/h2\u003e\n\u003cp\u003eAn iPhone replaced a dedicated camera for many people, but handsets have disadvantages. A flat metal rectangle isn’t the easiest object to hold, for example. Magnetically connecting the Belkin Stage PowerGrip to the back of an iPhone reshapes the device into something easier to, well, grip.\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eAnd the built-in 10,000 mAh battery juices up the iPhone through its MagSafe charging mat. A small screen shows remaining battery charge, and replenish the accessory with a retractable USB-C charging cable when it gets low. While iPhones already have excellent battery life, surely no one will complain about extending it.\u003c/p\u003e\n\u003cp\u003eThe accessory comes in a range of colors: powder blue, sandbox, fresh yellow, pepper and lavender.\u003c/p\u003e\u003cspan data-ez-ph-id=\"910\"\u003e\u003c/span\u003e\n\u003cp\u003eBelkin unveiled the Stage PowerGrip because CES 2025 kicks off Tuesday, January 7, not because the accessory is ready to ship. Actually, it’s not scheduled before May and doesn’t yet have a price.\u003c/p\u003e\n\u003ch3\u003eMore Belkin charging products at CES 2025\u003c/h3\u003e\n\u003cfigure id=\"29\" aria-labelledby=\"figcaption_29\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-BoostCharge-CES-2025-1.jpg\" data-lasso-id=\"1641672392\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" title=\"BoostCharge Pro Magnetic Wireless Charging Pad 15W and BoostCharge Power Bank 20K\" src=\"https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-BoostCharge-CES-2025-1.jpg\" alt=\"BoostCharge Pro Magnetic Wireless Charging Pad 15W and BoostCharge Power Bank 20K\" width=\"780\" height=\"288\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-BoostCharge-CES-2025-1.jpg 780w, https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-BoostCharge-CES-2025-1-400x148.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2025/01/Belkin-BoostCharge-CES-2025-1-350x129.jpg 350w\" sizes=\"(max-width: 780px) 100vw, 780px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_29\"\u003eBoostCharge Pro Magnetic Wireless Charging Pad 15W and BoostCharge Power Bank 20K are on Belkin’s 2025 agenda.\u003cbr/\u003e\u003cspan\u003ePhoto: Belkin\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003ca href=\"https://www.cultofmac.com/ces-2025\" data-lasso-id=\"1641672390\"\u003eCES 2025\u003c/a\u003e is a major trade show with about 140,000 expected attendees. Belkin is using the event to unveil multiple products set to launch in the first half of the year, not just Stage PowerGrip.\u003c/p\u003e\n\u003cp\u003eOn the list is the BoostCharge Pro Magnetic Wireless Charging Pad 15W, which magnetically clings to the back of an iPhone or any Qi2-compatible device to act as both a pop-up kickstand and a charger. It includes an integrated 6.6 foot (2m) USB-C cable. The price will be $19.99 without a power supply or $29.99 with a power supply when the accessory launches in April in white or black.\u003c/p\u003e\n\u003cp\u003eAnother highlight of Belkin’s CES 2025 is the BoostCharge Power Bank 20K with Integrated Cable. As its name indicates, the 20,000 mAh external battery sports a short USB-C cable. This can send up to 30W to an iPhone 16 series model. The peripheral also includes additional USB-C and USB-A ports. It’ll debut in April for $49.99 in black, white, blue and pink color options.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.businesswire.com/news/home/20250105036719/en\" data-lasso-id=\"1641672389\" target=\"_blank\"\u003eBelkin\u003c/a\u003e        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-05T20:32:23Z",
  "modifiedTime": "2025-01-05T21:05:22Z"
}
