{
  "id": "7d041e8c-2756-469a-ac31-713afcde44a3",
  "title": "Cate Blanchett’s thriller Disclaimer becomes most popular series on streaming",
  "link": "https://www.cultofmac.com/news/cate-blanchett-disclaimer-popular",
  "description": "No streaming series is more popular than Apple TV+’s thriller “Disclaimer.” It stars Cate Blanchett on a journey of sex, secrets and suspense. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Sat, 26 Oct 2024 14:50:54 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "Apple TV+",
    "drama series",
    "dramas"
  ],
  "byline": "Ed Hardy",
  "length": 4687,
  "excerpt": "No streaming series is more popular than Apple TV+’s thriller “Disclaimer.” It stars Cate Blanchett on a journey of sex, secrets and suspense.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News Cate Blanchett is only one of the big stars in “Disclaimer,” the latest hit streaming on Apple TV+ Photo: Apple TV+ The Apple TV+ series Disclaimer now sits at the top of two rating’s company’s popularity charts, beating everything else on any streaming service. The thriller about sex and secrets stars Cate Blanchett and Kevin Kline, and was directed by Alfonso Cuarón. And Shrinking, another new Apple TV+ series, is starting to climb the charts. Disclaimer didn’t wait to become a hit Story arcs have become almost de rigueur for streaming TV series. Taken to the extreme, a series can be a 10-hour movie broken into weekly episodes. Apple TV+ does this brilliantly with multiple series, whether a thriller like Severance or a comedy like Shrinking. That’s what Disclaimer delivers, as well. With so many big names involved in the project —Cate Blanchett, Kevin Kline, Alfonso Cuarón and more — there was enormous pressure on the just-launched series to be a success. And it’s clearly delivering. Disclaimer is holds the No. 1 spot on the JustWatch list of popular series for the week of Oct. 14 – 20. And it‘s at No. 1 on the Reelgood list of Top 10 TV shows the week of October 17-23. Disclaimer sits at the top JustWatch’s ratings chart. But don’t miss Shrinking and Slow Horses on there, too.Chart: JustWatch Estimates from companies like JustWatch and Reelgood are necessary because streaming services rarely reveal how many people tune in to their offerings. If this widespread popularity gets piques your interest, the Apple TV+ summary says: “Acclaimed journalist Catherine Ravenscroft (Blanchett) built her reputation revealing the misdeeds and transgressions of others. When she receives a novel from an unknown author, she is horrified to realize she is now the main character in a story that exposes her darkest secrets and threatens to destroy her family. “As Catherine races to uncover the writer’s true identity, she is forced to confront her past before it destroys her life and her relationships with her husband Robert (Baron Cohen) and son Nicholas (Kodi Smit-McPhee). The ensemble cast includes Kline, Lesley Manville, Louis Partridge, Leila George and Hoyeon, and features Indira Varma as the narrator.” The first five episodes of Disclaimer are ready to watch now on Apple TV+. The sixth will hit the streaming service on Friday. Shrinking starts strong Disclaimer isn’t Apple TV+’s only recent hit. Shrinking Season 2 premiered recently on the streaming service and its audience from last year came back immediately. The comedy/drama starring Jason Segel and Harrison Ford holds the No. 5 spot on JustWatch’s popularity chart from last week. It’s at No. 9 on the most recent Reelgood list. Apple’s official description of the series says: “Shrinking follows a grieving therapist (played by Segel) who starts to break the rules and tell his clients exactly what he thinks. Ignoring his training and ethics, he makes huge, tumultuous changes to people’s lives … including his own.” That could be the description for a drama, but the show generally plays with the premise for laughs. It’s a feel-good comedy with a dose of drama. The first three episodes of Shrinking season two can be enjoyed now, while the fourth is coming on Wednesday. Watch to catch up? Season one is ready to be binge-watched. Slow Horses holds on to an audience And those two Apple TV+ series aren’t alone on the popularity charts. Season 4 of Slow Horses stayed on one of the streaming series popularity charts for one more week, even though it wrapped up already. The series starring Gary Oldman has been a fixture of the charts since the debut in September. This week it sits at No. 10 on JustWatch’s list. The Apple TV+ summary says: “Slow Horses is a darkly humorous espionage drama that follows a dysfunctional team of British intelligence agents who serve in a dumping ground department of MI5 known un-affectionately as Slough House. Season four opens with a bombing that detonates personal secrets, rocking the already unstable foundations of Slough House.” The season finale premiered earlier this month so all six episodes are ready to binge watch. Watch these and more on Apple TV+ Streaming Disclaimer, Shrinking and Slow Horses, plus many other series or films comes with a subscription to Apple TV+. The service is $9.99 per month with a seven-day free trial. You can also get it via any tier of the Apple One subscription bundle. And Apple’s streaming video service also includes much more, of course. There’s a library of drama, comedies, musicals, children’s shows, nature documentaries, etc.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2024/10/Disclaimer-Cate-Blanchett-Apple-TV-Plus.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-871657\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Cate Blanchett’s thriller Disclaimer becomes most popular series on streaming\" src=\"https://www.cultofmac.com/wp-content/uploads/2024/10/Disclaimer-Cate-Blanchett-Apple-TV-Plus-1536x864.jpg\" alt=\"Cate Blanchett stars in “Disclaimer” on Apple TV+.\" data-ratio=\"1.7777777777778\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tCate Blanchett is only one of the big stars in “Disclaimer,” the latest hit streaming on Apple TV+ \u003cbr/\u003e\u003cem\u003ePhoto: Apple TV+\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eThe Apple TV+ series \u003ca href=\"https://tv.apple.com/show/disclaimer/umc.cmc.1cbgkx1fenkjtrha0n1a6fkc3?itscg=30200\u0026amp;itsct=tv_box_link\u0026amp;mttnsubad=umc.cmc.1cbgkx1fenkjtrha0n1a6fkc3\u0026amp;at=1010l3a9C\" data-lasso-id=\"1641617810\" target=\"_blank\"\u003e\u003cem\u003eDisclaimer\u003c/em\u003e\u003c/a\u003e now sits at the top of two rating’s company’s popularity charts, beating everything else on any streaming service. The thriller about sex and secrets stars Cate Blanchett and Kevin Kline, and was directed by Alfonso Cuarón.\u003c/p\u003e\n\u003cp\u003eAnd Shrinking, another new Apple TV+ series, is starting to climb the charts.\u003cspan id=\"more-871657\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eDisclaimer\u003c/em\u003e didn’t wait to become a hit\u003c/h2\u003e\n\u003cp\u003eStory arcs have become almost de rigueur for streaming TV series. Taken to the extreme, a series can be a 10-hour movie broken into weekly episodes. Apple TV+ does this brilliantly with multiple series, whether a thriller like \u003ca href=\"https://www.cultofmac.com/severance\" data-lasso-id=\"1641617811\"\u003e\u003cem\u003eSeverance\u003c/em\u003e\u003c/a\u003e or a comedy like \u003ca href=\"https://www.cultofmac.com/shrinking\" data-lasso-id=\"1641617820\"\u003e\u003cem\u003eShrinking\u003c/em\u003e\u003c/a\u003e. That’s what \u003cem\u003eDisclaimer\u003c/em\u003e delivers, as well.\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eWith so many big names involved in the project —\u003ca href=\"https://www.imdb.com/name/nm0000949/\" data-lasso-id=\"1641621656\" target=\"_blank\"\u003eCate Blanchett\u003c/a\u003e, \u003ca href=\"https://www.imdb.com/name/nm0000177/\" data-lasso-id=\"1641621657\" target=\"_blank\"\u003eKevin Kline\u003c/a\u003e, \u003ca href=\"https://www.imdb.com/name/nm0190859/\" data-lasso-id=\"1641621658\" target=\"_blank\"\u003eAlfonso Cuarón\u003c/a\u003e and more — there was enormous pressure on the just-launched series to be a success. And it’s clearly delivering.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDisclaimer\u003c/em\u003e is holds the No. 1 spot on the \u003ca href=\"https://www.justwatch.com\" data-lasso-id=\"1641621659\" target=\"_blank\"\u003eJustWatch\u003c/a\u003e list of popular series for the week of Oct. 14 – 20. And it‘s at No. 1 on the \u003ca href=\"https://blog.reelgood.com/category/top-10\" data-lasso-id=\"1641617812\" target=\"_blank\"\u003eReelgood list of Top 10 TV shows\u003c/a\u003e the week of October 17-23.\u003c/p\u003e\n\u003cfigure id=\"29\" aria-labelledby=\"figcaption_29\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024.jpg\" data-lasso-id=\"1641626767\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" title=\"Most popular streaming series in mid-to-late October 2024\" src=\"https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-1440x814.jpg\" alt=\"Most popular streaming series in mid-to-late October 2024\" width=\"780\" height=\"441\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-1440x814.jpg.webp 1440w, https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-400x226.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-1536x868.jpg 1536w, https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-2048x1157.jpg 2048w, https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-350x198.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-1440x814@2x.jpg 2880w, https://www.cultofmac.com/wp-content/uploads/2024/10/Popular-Streaming-Series-October-26-2024-400x226@2x.jpg 800w\" sizes=\"(max-width: 780px) 100vw, 780px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_29\"\u003e\u003cem\u003eDisclaimer\u003c/em\u003e sits at the top JustWatch’s ratings chart. But don’t miss \u003cem\u003eShrinking\u003c/em\u003e and \u003cem\u003eSlow Horses\u003c/em\u003e on there, too.\u003cbr/\u003e\u003cspan\u003eChart: JustWatch\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eEstimates from companies like JustWatch and Reelgood are necessary because streaming services rarely reveal how many people tune in to their offerings.\u003c/p\u003e\n\u003cp\u003eIf this widespread popularity gets piques your interest, the Apple TV+ summary says:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“Acclaimed journalist Catherine Ravenscroft (Blanchett) built her reputation revealing the misdeeds and transgressions of others. When she receives a novel from an unknown author, she is horrified to realize she is now the main character in a story that exposes her darkest secrets and threatens to destroy her family.\u003c/p\u003e\n\u003cp\u003e“As Catherine races to uncover the writer’s true identity, she is forced to confront her past before it destroys her life and her relationships with her husband Robert (Baron Cohen) and son Nicholas (Kodi Smit-McPhee). The ensemble cast includes Kline, Lesley Manville, Louis Partridge, Leila George and Hoyeon, and features Indira Varma as the narrator.”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThe first five episodes of \u003cem\u003eDisclaimer\u003c/em\u003e are ready to watch now on Apple TV+. The sixth will hit the streaming service on Friday.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://tv.apple.com/show/disclaimer/umc.cmc.1cbgkx1fenkjtrha0n1a6fkc3?itscg=30200\u0026amp;itsct=tv_box_badge\u0026amp;mttnsubad=umc.cmc.1cbgkx1fenkjtrha0n1a6fkc3\u0026amp;at=1010l3a9C\" data-lasso-id=\"1641617814\" target=\"_blank\"\u003e\u003cimg decoding=\"async\" title=\"En us\" src=\"https://toolbox.marketingtools.apple.com/api/v2/badges/watch-on-apple-tv/badge/en-us\" alt=\"Watch on Apple TV\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ciframe title=\"DISCLAIMER* — Official Trailer | Apple TV+\" width=\"780\" height=\"439\" data-ezsrc=\"https://www.youtube.com/embed/so6XoqZgbVM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eShrinking\u003c/em\u003e starts strong\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eDisclaimer\u003c/em\u003e isn’t Apple TV+’s only recent hit. \u003cem\u003eShrinking\u003c/em\u003e Season 2 premiered recently on the streaming service and its audience from last year came back immediately. The comedy/drama starring Jason Segel and Harrison Ford holds the No. 5 spot on JustWatch’s popularity chart from last week. It’s at No. 9 on the most recent Reelgood list.\u003c/p\u003e\u003cspan data-ez-ph-id=\"912\"\u003e\u003c/span\u003e\n\u003cp\u003eApple’s official description of the series says:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“\u003cem\u003eShrinking\u003c/em\u003e follows a grieving therapist (played by Segel) who starts to break the rules and tell his clients exactly what he thinks. Ignoring his training and ethics, he makes huge, tumultuous changes to people’s lives … including his own.”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThat could be the description for a drama, but the show generally plays with the premise for laughs. It’s a feel-good comedy with a dose of drama.\u003c/p\u003e\n\u003cp\u003eThe first three episodes of \u003cem\u003eShrinking\u003c/em\u003e season two can be enjoyed now, while the fourth is coming on Wednesday. Watch to catch up? Season one is \u003ca href=\"https://tv.apple.com/show/shrinking/umc.cmc.apzybj6eqf6pzccd97kev7bs?itsct=tv_box_link\u0026amp;itscg=30200\u0026amp;at=1010l3a9C\" data-lasso-id=\"1641626769\" target=\"_blank\"\u003eready to be binge-watched\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://tv.apple.com/show/shrinking/umc.cmc.apzybj6eqf6pzccd97kev7bs?itsct=tv_box_badge\u0026amp;itscg=30200\u0026amp;at=1010l3a9C\" data-lasso-id=\"1641626768\" target=\"_blank\"\u003e\u003cimg decoding=\"async\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/05/get_apple_tv_badge940x332.jpg\" alt=\"Watch on Apple TV\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eSlow Horses\u003c/em\u003e holds on to an audience\u003c/h2\u003e\n\u003cp\u003eAnd those two Apple TV+ series aren’t alone on the popularity charts. Season 4 of \u003ca href=\"https://tv.apple.com/show/slow-horses/umc.cmc.2szz3fdt71tl1ulnbp8utgq5o?itsct=tv_box_link\u0026amp;itscg=30200\u0026amp;at=1010l3a9C\" data-lasso-id=\"1641617815\" target=\"_blank\"\u003e\u003cem\u003eSlow Horses\u003c/em\u003e\u003c/a\u003e stayed on one of the streaming series popularity charts for one more week, even though it wrapped up already. The series starring Gary Oldman has been a fixture of the charts since the debut in September. This week it sits at No. 10 on JustWatch’s list.\u003c/p\u003e\n\u003cp\u003eThe Apple TV+ summary says:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“\u003cem\u003eSlow Horses\u003c/em\u003e is a darkly humorous espionage drama that follows a dysfunctional team of British intelligence agents who serve in a dumping ground department of MI5 known un-affectionately as Slough House. Season four opens with a bombing that detonates personal secrets, rocking the already unstable foundations of Slough House.”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThe season finale premiered earlier this month so all six episodes are ready to binge watch.\u003c/p\u003e\u003cspan data-ez-ph-id=\"913\"\u003e\u003c/span\u003e\n\u003cp\u003e\u003ca href=\"https://tv.apple.com/show/slow-horses/umc.cmc.2szz3fdt71tl1ulnbp8utgq5o?itsct=tv_box_badge\u0026amp;itscg=30200\u0026amp;at=1010l3a9C\" data-lasso-id=\"1641617816\" target=\"_blank\"\u003e\u003cimg decoding=\"async\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/05/get_apple_tv_badge940x332.jpg\" alt=\"Watch on Apple TV\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003ch3\u003eWatch these and more on Apple TV+\u003c/h3\u003e\n\u003cp\u003eStreaming \u003cem\u003eDisclaimer\u003c/em\u003e, \u003cem\u003eShrinking\u003c/em\u003e and \u003cem\u003eSlow Horses\u003c/em\u003e, plus many other series or films comes with \u003ca href=\"https://tv.apple.com/channel/tvs.sbd.4000?itsct=tv_box_link\u0026amp;itscg=30200\u0026amp;at=1010l3a9C\" target=\"_blank\" rel=\"noopener\" data-lasso-id=\"1641617819\"\u003ea subscription to Apple TV+\u003c/a\u003e. The service is $9.99 per month with a seven-day free trial. You can also get it via any tier of the Apple One subscription bundle.\u003c/p\u003e\n\u003cp\u003eAnd Apple’s streaming video service also includes much more, of course. There’s a library of drama, comedies, musicals, children’s shows, nature documentaries, etc.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-26T14:50:54Z",
  "modifiedTime": "2024-10-26T14:49:53Z"
}
