{
  "id": "91f401ae-07be-4b67-93e2-da630d5770d3",
  "title": "★ As if Anyone Needed Further Proof, Patrick Soon-Shiong’s Los Angeles Times Is Now a Propaganda Rag (and They’re Bad at HTML)",
  "link": "https://daringfireball.net/2025/02/soon-shiong_la_times_propaganda_rag",
  "description": "You can’t see the link or click on it as rendered in a browser, because there’s no content between the opening `` and closing `` tags, but whoever at the LA Times edited Reinhart’s column to pervert its meaning, did so sloppily, leaving behind at least this one acerbic vestigial link from his originally-submitted prose.",
  "author": "John Gruber",
  "published": "2025-02-01T17:18:51Z",
  "source": "https://daringfireball.net/feeds/main",
  "categories": null,
  "byline": "Saturday, 1 February 2025",
  "length": 4700,
  "excerpt": "You can’t see the link or click on it as rendered in a browser, because there’s no content between the opening `\u003ca …\u003e` and closing `\u003c/a\u003e` tags, but whoever at the LA Times edited Reinhart’s column to pervert its meaning, did so sloppily, leaving behind at least this one acerbic vestigial link from his originally-submitted prose.",
  "siteName": "Daring Fireball",
  "favicon": "https://daringfireball.net/graphics/apple-touch-icon.png",
  "text": "Editors note from The New Republic: As The New Republic reported on Friday, The Los Angeles Times — currently in a race to the bottom with The Washington Post to determine which of the two venerable institutions can sell out to Donald Trump the hardest — found itself in a fresh controversy after contributor Eric Reinhart accused the paper of making significant edits to a piece of his that was largely critical of Robert F. Kennedy, Jr. into one that depicted the president’s pick to run the Department of Health and Human Services with an “optimistic tone,” largely “ suggesting that the virulent conspiracy theorist could be an answer and solution to the American public’s bubbling resentment toward the health care industry.” Reinhart exposed the shady goings-on on X (fka Twitter). “Editing out the most urgent point of an OpEd in the minutes before sending to press while then also assigning a title and image that suggest an argument entirely opposite to the author’s clear intent is pretty shitty,” he wrote. In light of this lamentable journalistic malpractice, The New Republic has agreed to run Reinhart’s piece as he intended it to be read. Reinhart’s headline at TNR, encapsulating the intended thrust of his piece: “RFK Jr’s Wrecking Ball Won’t Fix Public Health”, and the closing paragraph of the column: Although RFK, Jr., and Luigi Mangione are both responses to the same underlying problem of US healthcare corruption, there is a major difference between them: one allegedly operated outside the law to kill one person in defense of millions, whereas the other — via his egomaniacal disregard for scientific evidence — seeks to use law itself to inflict preventable death on those millions. The headline the LA Times ran his piece under, after their editing: “Trump’s Healthcare Disruption Could Pay Off — if He Pushes Real Reform”, and its closing paragraphs: Such an approach would shift us away from overreliance on expensive medical treatments and toward public health as it should be: a project by and for the people that makes full use of government resources to empower communities. We should demand fundamental transformations in how we approach health in America, but a wrecking ball alone won’t deliver what we need. After all the shenanigans Soon-Shiong began pulling pre- and post-election, my only question here is whether Reinhart really believed the LA Times op-ed page was going to run his piece as written. Super-Nerdy Bonus Material My original intention for this post ended above. I wanted to quote the TNR editors note that explained the situation, quote Reinhart’s intended headline and closing paragraph, and contrast those with the benign gibberish headline and closing that the LA Times actually published. Done. But I’ve got more. Turns out, the LA Times itself effectively published proof of its “editing” that completely perverted Reinhart’s intended thrust. I have a small arsenal of homegrown tools I use to automate the work of writing DF. Markdown itself is the crown jewel of them. But over the now many years I’ve been doing this I’ve created a whole toolbox of smalls scripts and macros that help me do what I do faster and with fewer errors. (And I still commit plenty of errors.) One of the smaller ones that I’ve never shared publicly (but probably should) is a Keyboard Maestro macro that lets me select a range of text in Safari and copy that selection as Markdown-formatted text. It picks up spans of italics and boldfacing, but most importantly, it picks up hyperlinks in the original text and converts them to the Markdown link style I prefer (defined reference links). You will note in my blockquote above of Reinhart’s intended closing paragraph, as published at The New Republic, he linked the word “disregard” to this January 28 report from The Washington Post: “RFK Jr. Disparaged Vaccines Dozens of Times in Recent Years and Made Baseless Claims on Race”. No link to that Washington Post report appears, visually, in the butchered version of Reinhart’s piece that ran in the LA Times. But, my “Copy Markdown Blockquote” macro picked up an effectively invisible-to-the-user link to that article, in the HTML markup between their closing paragraph and Reinhart’s author bio beneath it. You can view source at the LA Times website and see for yourself, but here’s a screenshot: You can’t see the link or click on it as rendered in a browser, because there’s no content between the opening \u003ca …\u003e and closing \u003c/a\u003e tags, but whoever at the LA Times edited Reinhart’s column to pervert its meaning, did so sloppily, leaving behind at least this one acerbic vestigial link from his originally-submitted prose.",
  "image": "https://daringfireball.net/graphics/df-wide-card.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"Box\"\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://newrepublic.com/article/191030/rfk-jr-op-ed-los-angeles-times\"\u003eEditors note from The New Republic\u003c/a\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eAs The New Republic \u003ca href=\"https://newrepublic.com/post/191007/la-times-robert-f-kennedy-jr-donald-trump\"\u003ereported on Friday\u003c/a\u003e, The Los Angeles\nTimes — currently in a race to the bottom \u003ca href=\"https://newrepublic.com/post/188445/washington-post-bezos-trump-failure\"\u003ewith The Washington\nPost\u003c/a\u003e to determine which of the two venerable institutions\ncan sell out to Donald Trump the hardest — found itself in a\nfresh controversy after contributor Eric Reinhart accused the\npaper of \u003ca href=\"https://www.latimes.com/opinion/story/2025-01-29/rfk-jr-trump-health-reform\"\u003emaking significant edits\u003c/a\u003e to a piece of his that\nwas largely critical of Robert F. Kennedy, Jr. into one that\ndepicted the president’s pick to run the Department of Health and\nHuman Services with an “optimistic tone,” largely “ suggesting\nthat the virulent conspiracy theorist could be an answer and\nsolution to the American public’s bubbling resentment toward the\nhealth care industry.”\u003c/p\u003e\n\n\u003cp\u003eReinhart exposed the shady goings-on on X (fka Twitter). “Editing\nout the most urgent point of an OpEd in the minutes before sending\nto press while then also assigning a title and image that suggest\nan argument entirely opposite to the author’s clear intent is\npretty shitty,” \u003ca href=\"https://bsky.app/profile/ericreinhart.bsky.social/post/3lh2ell45722u\"\u003ehe wrote\u003c/a\u003e. In light of this lamentable\njournalistic malpractice, The New Republic has agreed to run\nReinhart’s piece as he intended it to be read.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eReinhart’s headline at TNR, encapsulating the intended thrust of his piece: “\u003ca href=\"https://newrepublic.com/article/191030/rfk-jr-op-ed-los-angeles-times\"\u003eRFK Jr’s Wrecking Ball Won’t Fix Public Health\u003c/a\u003e”, and the closing paragraph of the column:\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eAlthough RFK, Jr., and Luigi Mangione are both responses to the\nsame underlying problem of US healthcare corruption, there is a\nmajor difference between them: one allegedly operated outside the\nlaw to kill one person in defense of millions, whereas the other — via his egomaniacal \u003ca href=\"https://www.washingtonpost.com/health/2025/01/28/rfk-jr-disparaged-vaccines-dozens-times-recent-years-misled-race/\"\u003edisregard\u003c/a\u003e for scientific evidence — seeks to use law itself to inflict preventable death on those\nmillions.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eThe headline the LA Times ran his piece under, after their editing: “\u003ca href=\"https://www.latimes.com/opinion/story/2025-01-29/rfk-jr-trump-health-reform\"\u003eTrump’s Healthcare Disruption Could Pay Off — if He Pushes Real Reform\u003c/a\u003e”, and its closing paragraphs:\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eSuch an approach would shift us away from overreliance on\nexpensive medical treatments and toward public health as it should\nbe: a project by and for \u003ca href=\"https://direct.mit.edu/daed/article/152/4/245/118232/Empowering-the-Extra-Ordinary\"\u003ethe people\u003c/a\u003e that makes full use\nof government resources to \u003ca href=\"https://www.statnews.com/2023/02/24/fixing-public-health-systems-revolution-physicians-take-backseat/\"\u003eempower communities\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eWe should demand fundamental transformations in how we approach\nhealth in America, but a wrecking ball alone won’t deliver what\nwe need.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eAfter all the \u003ca href=\"https://daringfireball.net/2024/10/profiles_in_cowardice_bezos_lewis_washington_post\"\u003eshenanigans\u003c/a\u003e \u003ca href=\"https://daringfireball.net/linked/2024/12/05/owner-patrick-soon-shiong-is-tanking-the-la-times\"\u003eSoon-Shiong began pulling\u003c/a\u003e pre- \u003ca href=\"https://daringfireball.net/linked/2024/12/13/soon-shiong-la-times\"\u003eand post-election\u003c/a\u003e, my only question here is whether Reinhart really believed the LA Times op-ed page was going to run his piece as written.\u003c/p\u003e\n\n\u003ch2\u003eSuper-Nerdy Bonus Material\u003c/h2\u003e\n\n\u003cp\u003eMy original intention for this post ended above. I wanted to quote the TNR editors note that explained the situation, quote Reinhart’s intended headline and closing paragraph, and contrast those with the benign gibberish headline and closing that the LA Times actually published. Done. But I’ve got more. Turns out, the LA Times itself effectively published \u003cem\u003eproof\u003c/em\u003e of its “editing” that completely perverted Reinhart’s intended thrust. \u003c/p\u003e\n\n\u003cp\u003eI have a small arsenal of homegrown tools I use to automate the work of writing DF. \u003ca href=\"https://daringfireball.net/projects/markdown/\"\u003eMarkdown\u003c/a\u003e itself is the crown jewel of them. But over the now many years I’ve been doing this I’ve created a whole toolbox of smalls scripts and macros that help me do what I do faster and with fewer errors. (And I still commit plenty of errors.) One of the smaller ones that I’ve never shared publicly (but probably \u003ca href=\"https://daringfireball.net/projects/\"\u003eshould\u003c/a\u003e) is a Keyboard Maestro macro that lets me select a range of text in Safari and copy that selection as Markdown-formatted text. It picks up spans of italics and boldfacing, but most importantly, it picks up hyperlinks in the original text and converts them to the Markdown link style I prefer (\u003ca href=\"https://daringfireball.net/projects/markdown/syntax#link\"\u003edefined reference links\u003c/a\u003e).\u003c/p\u003e\n\n\u003cp\u003eYou will note in my blockquote above of Reinhart’s intended closing paragraph, as published at The New Republic, he linked the word “disregard” to \u003ca href=\"https://www.washingtonpost.com/health/2025/01/28/rfk-jr-disparaged-vaccines-dozens-times-recent-years-misled-race/\"\u003ethis January 28 report from The Washington Post\u003c/a\u003e: “RFK Jr. Disparaged Vaccines Dozens of Times in Recent Years and Made Baseless Claims on Race”. No link to that Washington Post report appears, visually, in the butchered version of Reinhart’s piece that ran in the LA Times.\u003c/p\u003e\n\n\u003cp\u003eBut, my “Copy Markdown Blockquote” macro picked up an effectively invisible-to-the-user link to that article, in the HTML markup between their closing paragraph and Reinhart’s author bio beneath it. You can view source at the LA Times website and see for yourself, but here’s a screenshot:\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://daringfireball.net/misc/2025/02/la-times-reinhart-html-screenshot.png\"\u003e\n  \u003cimg src=\"https://daringfireball.net/misc/2025/02/la-times-reinhart-html-screenshot.png\" alt=\"Screenshot of the HTML source code from latimes.com, showing an empty anchor tag whose ‘href’ attribute links to the Washington Post.\" width=\"525\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eYou can’t see the link or click on it as rendered in a browser, because there’s no content between the opening \u003ccode\u003e\u0026lt;a …\u0026gt;\u003c/code\u003e and closing \u003ccode\u003e\u0026lt;/a\u0026gt;\u003c/code\u003e tags, but whoever at the LA Times edited Reinhart’s column to pervert its meaning, did so sloppily, leaving behind at least this one acerbic vestigial link from his originally-submitted prose.\u003c/p\u003e\n\n\n\n \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
