{
  "id": "a980948a-c240-4b5e-8141-0012d00f8d89",
  "title": "Netgear Orbi RBK973 review: Premium Wi-Fi 7 for when money is no object",
  "link": "https://appleinsider.com/articles/25/03/26/netgear-orbi-rbk973-review-premium-wi-fi-7-for-when-money-is-no-object?utm_medium=rss",
  "description": "The more people you have in your home, the more iPhones and other devices connect to your network. Netgear's premium Wi-Fi 7 mesh system offers everything you could need and more but for an eye-watering price.Netgear Orbi RBK973 review: This is one good-looking router, that's for sure.My home network is a busy one, and before the Netgear RBK973 system arrived it was problematic. Too many connections and constant use had it creaking at the seams so I was intrigued by this new setup.I had high hopes, as well I should given the specs of this range-topping gear. I've now been testing the system, powered by three access points, for a few weeks. And the results are in. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Oliver Haslam",
  "published": "Wed, 26 Mar 2025 00:07:40 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "{{ author }} | {{ dateFormatted }}",
  "length": 12110,
  "excerpt": "The more people you have in your home, the more iPhones and other devices connect to your network. Netgear's premium Wi-Fi 7 mesh system offers everything you could need and more but for an eye-watering price.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "The more people you have in your home, the more iPhones and other devices connect to your network. Netgear's premium Wi-Fi 7 mesh system offers everything you could need and more but for an eye-watering price. My home network is a busy one, and before the Netgear RBK973 system arrived it was problematic. Too many connections and constant use had it creaking at the seams so I was intrigued by this new setup. I had high hopes, as well I should given the specs of this range-topping gear. I've now been testing the system, powered by three access points, for a few weeks. And the results are in. Spoiler: it's been a revelation. It's fast, it's reliable, and it even manages to look good as well. To be clear, most people don't need this setup and Netgear has cheaper Wi-Fi 7 alternatives. The Orbi 770 series has similar features at a more reasonable price. But if money is no object and you want to future-proof your network, this system is for you. Netgear Orbi RBK973 review: My home network and expectationsI feel it's important to give you an idea of what any Wi-Fi system is expected to do in my home. Because without it, it's impossible to understand how the Orbi was tested. My home is powered by a gigabit-ish fiber connection (Virgin Media, in the UK) which provides around 1,200Mbps downstream and 100Mbps up. It's fast, and it's fair to say that wired-in devices don't often wait long for downloads to finish. Virgin Media provides a router and while it's rated for Wi-Fi 7 - and blazing fast when you're near it - I need a mesh setup. Why? Because of the way our home is laid out and the devices we use. It isn't a huge home, but many of the important devices aren't near where the router lives. To ensure fast speeds and low latency, a mesh system is needed. The fiber connection enters my office which houses my desk, including a Thunderbolt 4 hub with a 2.5Gbps Ethernet port. There's also an aging Sonology NAS that I use for Time Machine and nothing else. Then, there is the master bedroom where I often play games late at night. They're played from my iPhone 15 Pro Max via services like Nvidia's GeForce Now - so low latency is king. Next, there's the kids' bedroom with an iPhone, an iPad, and an Xbox all using data. The Xbox downloads big files, so needs fast internet, and there's the same latency consideration as well. Downstairs, there are HomePod and HomePod mini smart speakers dotted around not to mention an Apple TV 4K. And then there are all the mobile devices that find their way down there, too - a Steam Deck, a couple of laptops, and tablets amongst other things. To complicate matters somewhat, all of our TV viewing is done via the internet using the Apple TV and a smattering of Fire TV sticks. And YouTube. On everything, everywhere. Rounding things out we have the usual array of smart bulbs, cameras, and plugs that all need a stable connection. Nobody wants to try to turn a light on only for nothing to happen. It's a busy network. Netgear Orbi RBK973 Review: Specs and pricingWith all of that said, I expected that the Orbi would be more than capable of handling everything my family needs and then some. And with specs like those on offer here, I can't imagine most people needing anything more. Netgear Orbi RBK973 review: You won't be short of connections with this setup.The system comes with a router and two satellite units with that router connecting to my ISP's router in modem mode. The three-piece setup bathes homes of up to 8,200 sq.ft. in fast Wi-Fi 7. That Wi-Fi comes in at a combined speed of up to 27Gbps, broken up across the 2.4Ghz, 5GHz, and 6GHz bands. An additional band handles the backhaul from router to router, ensuring super-fast speeds. Breaking things down, Netgear says this system offers up to 11,530Mbps at 6GHz and 8,647Mbps for the dedicated 5GHz backhaul connection. The standard 5GHz band offers 5,765Mbps while the slower 2.4GHz band manages 1,147Mbps. In terms of wired connectivity, the main router has a 10Gbps WAN port and a 10Gbps LAN port. It's then backed up by four 2.5Gbps ports for speedy file transfers. As for the other two access points, they have a single 10Gbps LAN port and a pair of 2.5Gbps ports each. That's a lot of good stuff, and you can choose between black and silver finishes to match your decor. Me? I chose the black units because they're stunning, but it's your money. All that's left to discuss now, is the price. And in case it hasn't become clear yet, this kit isn't cheap. The version with three access points retails for a cool $2,299 while the one with two sells for $1,699. If you just need the single router you'll pay $799.99 and each extra satellite unit costs the same, too. Those are big numbers, there's no doubt about that. But is the Netgear Orbi RBK973 mesh system worth it? Well, it might just be. Netgear Orbi RBK973 Review: My setup and experienceBecause I had experience with other Orbi systems, getting the RBK973 up and running was a cinch. It would have been easier if my modem didn't suck. Netgear Orbi RBK973 review: You can get the Orbi in black or white, but the former is my favorite.When up and running, I had the main router in my office with one of the access points in the kids' room. They then had the Xbox hardwired in and everything else connected via Wi-Fi. The final access point went downstairs with the Xbox Series X and PS5 both hardwired in there, too. Everything else is connected via Wi-Fi, including the Apple TV. The result? Everything's fast, very fast. Everything that's wired into either the router or the access point can max out my gigabit fiber as if it were wired straight into the modem. As for Wi-Fi, that depends on how close you are to any of the access points. What device you're using also has a great impact, too. Just about every Wi-Fi protocol you can imagine is used across our many devices. But most things run on Wi-Fi 6 or Wi-Fi 6E and they're all incredibly speedy. They don't necessarily max out the gigabit connection unless relatively close to the nearest access point. But I generally get speeds that are so fast the system will outstrip most people's broadband. As an example, I just ran a speed test using my iPhone 15 Pro Max on WiFi 6E connected to the 6GHz band. It managed a speed of almost 700Mbps in a room between two access points, so passing through at least one wall. All of this is to say, it's difficult to fault this setup. Unless you've unusually fast broadband, you'll be limited by that rather than your Wi-Fi. Netgear Orbi RBK973 Review: Features and appLike all modern Wi-Fi setups, the Orbi RBK973 comes with plenty of features. The first that springs to mind is the option to run a guest network as has become the norm these days. It keeps other people's devices sandboxed and away from your main network for security purposes. Netgear Orbi RBK973 review: The Orbi app offers router management features.This setup goes a step further by offering another network just for your smart devices, like bulbs and whatnot. The idea is that you limit those to the 2.4GHz band to avoid slowing everything else down. Beyond that, Netgear offers parental controls via an optional $7.99 per month subscription. You can set up profiles for each person and link their devices to it, offering controls per profile. Netgear Armor, powered by Bitdefender, is a security feature that scans each device for vulnerabilities and reports back. It's free for the first year, but you'll have to pay after that. Elsewhere, all the usual features are present including VPN support, port forwarding, VLAN configuration options, and more. Everything can be managed via the web interface, including remotely. Prefer to use your phone? The Orbi app offers many of the same features in a different package with some of the more advanced options out of the way. Netgear Orbi RBK973 Review: Not all Wi-Fi 7 routers are created equalAt this point, I think it's important to address the elephant in the room — the price. I said earlier that this Orbi setup, as tested, can retail for up to $2,299, and that's a lot of money. You might be looking at that figure and then comparing it with another Wi-Fi- 7-badged router on Amazon that costs two-thirds less. You aren't the first person to fall into that trap, and you won't be the last. But it's important to remember that not all Wi-Fi 7 systems are created equal. Let's use the TP-Link Deco BE5000 system we recently reviewed as an example. Like this Netgear kit, that comes with a router and two access points for extra coverage. And TP-Link's kit also has the flashy Wi-Fi 7 badge on the box, too. And then, there's the price. The TP-Link Deco BE5000 sells for around $300 in this configuration, considerably less than the Orbi. But there are reasons with the most obvious being the band situation. The BE5000 uses a dual-band setup; 2.4GHz capable of 688Mbps and 5GHz that tops out at 4,324Mbps. Netgear Orbi RBK973 Review: TP-Link makes an affordable mesh Wi-Fi 7 product.I already outlined what the Orbi offers, but it bears repeating. Its quad-band radios offer 11,530Mbps at 6GHz and 8,647Mbps for a dedicated 5GHz backhaul between access points. The standard 5GHz band offers 5,765Mbps while the slower 2.4GHz band manages 1,147Mbps. Now yes, technically, both of these mesh systems are specced for Wi-Fi 7; the spec doesn't demand a 6GHz band, for example. But one is considerably faster than the other. The Orbi is faster when using modern devices on the 5Ghz and 6GHz bands. It's also faster when using legacy devices on the 2.4GHz band, important if you have a lot of smart home devices. The lack of a dedicated backhaul for the DECO BE5000 is also a bigger problem than some might realize. Without it, every device in your home fights for bandwidth with the mesh system that's supposed to make things better. With Netgear's solution, the access points talk to each other via a dedicated connection. All of the data between your devices and the internet is unaffected, no matter what. In busy homes with a lot of data-hungry devices, that soon starts to make a difference. There are, of course, other options, too. Some people might not like the idea of all their internet traffic running through hardware built by a Chinese company. The Deco doesn't have as many wired ports for you to use. And none of them match the Orbi's 10Gbps, either. I'm sure there are more differences, but this review isn't about a direct comparison between these two options. Regardless, the point stands — don't expect a $300 Wi-Fi 7 setup to match one costing almost $2,000 more. With that being said, not everyone needs what the Orbi offers — and that's why mesh systems like TP-Link's are great. Options are good, but it's important to know how they differ from one another. Netgear Orbi RBK973 Review: The best Wi-Fi setup that you probably don't needIt should be no surprise to anyone who got this far that I'm a huge fan of the Orbi RBK973 system, but it isn't perfect. It's simply too expensive to recommend to most people. Most people don't need it, and they definitely shouldn't spend this kind of money on a Wi-Fi setup. Thankfully, Netgear does have other Wi-Fi 7 systems for you to buy at more reasonable prices. But, all of that being said, if you want super-fast wired and wireless networking and money isn't a consideration, you can't go far wrong here. If you can find this line of mesh routers at the right price, buy it. You won't regret it. Gorgeous to look at Incredibly-fast wireless connectivity Incredibly fast wired connectivity, too Plenty of management and parental control features Single router and full mesh system options Netgear Orbi RBK973 Review: Cons Did you see the price? Overkill for most people Some of the management controls are behind a subscription Rating: 4 out of 5Where to buy the Netgear Orbi RBK973Netgear sells the RBK973 for around $2,000 on Amazon, depending on whether a deal is running. That's less than you'd spend if you bought directly from Netgear itself. However, at the time of writing only the silver version is available at Amazon.",
  "image": "https://photos5.appleinsider.com/gallery/62997-130929-IMG_0916-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eThe more people you have in your home, the more \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhones\u003c/a\u003e and other devices connect to your network. Netgear\u0026#39;s premium Wi-Fi 7 mesh system offers everything you could need and more but for an eye-watering price.\n\u003c/p\u003e\u003cp\u003eMy home network is a busy one, and before the Netgear RBK973 system arrived it was problematic. Too many connections and constant use had it creaking at the seams so I was intrigued by this new setup.\n\u003c/p\u003e\u003cp\u003eI had high hopes, as well I should given the specs of this range-topping gear. I\u0026#39;ve now been testing the system, powered by three access points, for a few weeks. And the results are in.\n\u003c/p\u003e\u003cp\u003eSpoiler: it\u0026#39;s been a revelation. It\u0026#39;s fast, it\u0026#39;s reliable, and it even manages to look good as well.\n\u003c/p\u003e\u003cp\u003eTo be clear, most people don\u0026#39;t need this setup and Netgear has cheaper Wi-Fi 7 alternatives. The \u003ca href=\"https://www.netgear.com/home/wifi/mesh/rbe773/\"\u003eOrbi 770 series\u003c/a\u003e has similar features at a more reasonable price.\n\u003c/p\u003e\u003cp\u003eBut if money is no object and you want to future-proof your network, this system is for you.\n\u003c/p\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-my-home-network-and-expectations\" id=\"netgear-orbi-rbk973-review-my-home-network-and-expectations\"\u003eNetgear Orbi RBK973 review: My home network and expectations\u003c/h2\u003e\u003cp\u003eI feel it\u0026#39;s important to give you an idea of what any Wi-Fi system is expected to do in my home. Because without it, it\u0026#39;s impossible to understand how the Orbi was tested.\n\u003c/p\u003e\u003cp\u003eMy home is powered by a gigabit-ish fiber connection (Virgin Media, in the UK) which provides around 1,200Mbps downstream and 100Mbps up. It\u0026#39;s fast, and it\u0026#39;s fair to say that wired-in devices don\u0026#39;t often wait long for downloads to finish.\n\u003c/p\u003e\u003cp\u003eVirgin Media provides a router and while it\u0026#39;s rated for Wi-Fi 7 - and blazing fast when you\u0026#39;re near it - I need a mesh setup. Why? Because of the way our home is laid out and the devices we use.\n\u003c/p\u003e\u003cp\u003eIt isn\u0026#39;t a huge home, but many of the important devices aren\u0026#39;t near where the router lives. To ensure fast speeds and low latency, a mesh system is needed.\n\u003c/p\u003e\u003cp\u003eThe fiber connection enters my office which houses my desk, including a Thunderbolt 4 hub with a 2.5Gbps Ethernet port. There\u0026#39;s also an aging Sonology NAS that I use for Time Machine and nothing else.\n\u003c/p\u003e\u003cp\u003eThen, there is the master bedroom where I often play games late at night. They\u0026#39;re played from my iPhone 15 Pro Max via services like Nvidia\u0026#39;s GeForce Now - so low latency is king.\n\u003c/p\u003e\u003cp\u003eNext, there\u0026#39;s the kids\u0026#39; bedroom with an iPhone, an \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPad\u003c/a\u003e, and an Xbox all using data. The Xbox downloads big files, so needs fast internet, and there\u0026#39;s the same latency consideration as well.\n\u003c/p\u003e\u003cp\u003eDownstairs, there are \u003ca href=\"https://appleinsider.com/inside/homepod\" title=\"HomePod\" data-kpt=\"1\"\u003eHomePod\u003c/a\u003e and \u003ca href=\"https://appleinsider.com/inside/homepod-mini\" title=\"HomePod mini\" data-kpt=\"1\"\u003eHomePod mini\u003c/a\u003e smart speakers dotted around not to mention an \u003ca href=\"https://appleinsider.com/inside/apple-tv-4k\" title=\"Apple TV 4K\" data-kpt=\"1\"\u003eApple TV 4K\u003c/a\u003e. And then there are all the mobile devices that find their way down there, too - a Steam Deck, a couple of laptops, and tablets amongst other things.\n\u003c/p\u003e\u003cp\u003eTo complicate matters somewhat, \u003cem\u003eall\u003c/em\u003e of our TV viewing is done via the internet using the \u003ca href=\"https://appleinsider.com/inside/apple-tv\" title=\"Apple TV\" data-kpt=\"1\"\u003eApple TV\u003c/a\u003e and a smattering of Fire TV sticks. And YouTube. On everything, everywhere.\n\u003c/p\u003e\u003cp\u003eRounding things out we have the usual array of smart bulbs, cameras, and plugs that all need a stable connection. Nobody wants to try to turn a light on only for nothing to happen.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s a busy network.\n\u003c/p\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-specs-and-pricing\" id=\"netgear-orbi-rbk973-review-specs-and-pricing\"\u003eNetgear Orbi RBK973 Review: Specs and pricing\u003c/h2\u003e\u003cp\u003eWith all of that said, I expected that the Orbi would be more than capable of handling everything my family needs and then some. And with specs like those on offer here, I can\u0026#39;t imagine most people needing anything more.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62997-130768-Netgear-Orbi-970-ports-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62997-130768-Netgear-Orbi-970-ports-xl.jpg\" alt=\"Images showing the rear of Orbi access points.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNetgear Orbi RBK973 review: You won\u0026#39;t be short of connections with this setup.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe system comes with a router and two satellite units with that router connecting to my ISP\u0026#39;s router in modem mode. The three-piece setup bathes homes of up to 8,200 sq.ft. in fast Wi-Fi 7.\n\u003c/p\u003e\u003cp\u003eThat Wi-Fi comes in at a combined speed of up to 27Gbps, broken up across the 2.4Ghz, 5GHz, and 6GHz bands. An additional band handles the backhaul from router to router, ensuring super-fast speeds.\n\u003c/p\u003e\u003cp\u003eBreaking things down, Netgear says this system offers up to 11,530Mbps at 6GHz and 8,647Mbps for the dedicated 5GHz backhaul connection. The standard 5GHz band offers 5,765Mbps while the slower 2.4GHz band manages 1,147Mbps.\n\u003c/p\u003e\u003cp\u003eIn terms of wired connectivity, the main router has a 10Gbps WAN port and a 10Gbps LAN port. It\u0026#39;s then backed up by four 2.5Gbps ports for speedy file transfers.\n\u003c/p\u003e\u003cp\u003eAs for the other two access points, they have a single 10Gbps LAN port and a pair of 2.5Gbps ports each.\n\u003c/p\u003e\u003cp\u003eThat\u0026#39;s a lot of good stuff, and you can choose between black and silver finishes to match your decor. Me? I chose the black units because they\u0026#39;re stunning, but it\u0026#39;s your money.\n\u003c/p\u003e\u003cp\u003eAll that\u0026#39;s left to discuss now, is the price. And in case it hasn\u0026#39;t become clear yet, this kit isn\u0026#39;t cheap.\n\u003c/p\u003e\u003cp\u003eThe version with three access points retails for a cool $2,299 while the one with two sells for $1,699. If you just need the single router you\u0026#39;ll pay $799.99 and each extra satellite unit costs the same, too.\n\u003c/p\u003e\u003cp\u003eThose are big numbers, there\u0026#39;s no doubt about that. But is the Netgear Orbi RBK973 mesh system worth it?\n\u003c/p\u003e\u003cp\u003eWell, it might just be.\n\u003c/p\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-my-setup-and-experience\" id=\"netgear-orbi-rbk973-review-my-setup-and-experience\"\u003eNetgear Orbi RBK973 Review: My setup and experience\u003c/h2\u003e\u003cp\u003eBecause I had experience with other Orbi systems, getting the RBK973 up and running was a cinch. It would have been easier if my modem didn\u0026#39;t suck.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62997-130926-IMG_0919-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62997-130926-IMG_0919-xl.jpg\" alt=\"A sleek black router on a desk with a colorful monitor, gaming controller, keyboard, and mouse.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNetgear Orbi RBK973 review: You can get the Orbi in black or white, but the former is my favorite.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWhen up and running, I had the main router in my office with one of the access points in the kids\u0026#39; room. They then had the Xbox hardwired in and everything else connected via Wi-Fi.\n\u003c/p\u003e\u003cp\u003eThe final access point went downstairs with the Xbox Series X and PS5 both hardwired in there, too. Everything else is connected via Wi-Fi, including the Apple TV.\n\u003c/p\u003e\u003cp\u003eThe result? Everything\u0026#39;s fast, very fast.\n\u003c/p\u003e\u003cp\u003eEverything that\u0026#39;s wired into either the router or the access point can max out my gigabit fiber as if it were wired straight into the modem.\n\u003c/p\u003e\u003cp\u003eAs for Wi-Fi, that depends on how close you are to any of the access points. What device you\u0026#39;re using also has a great impact, too.\n\u003c/p\u003e\u003cp\u003eJust about every Wi-Fi protocol you can imagine is used across our many devices. But most things run on Wi-Fi 6 or Wi-Fi 6E and they\u0026#39;re all incredibly speedy.\n\u003c/p\u003e\u003cp\u003eThey don\u0026#39;t necessarily max out the gigabit connection unless relatively close to the nearest access point. But I generally get speeds that are so fast the system will outstrip most people\u0026#39;s broadband.\n\u003c/p\u003e\u003cp\u003eAs an example, I just ran a speed test using my iPhone 15 Pro Max on WiFi 6E connected to the 6GHz band. It managed a speed of almost 700Mbps in a room between two access points, so passing through at least one wall.\n\u003c/p\u003e\u003cp\u003eAll of this is to say, it\u0026#39;s difficult to fault this setup. Unless you\u0026#39;ve unusually fast broadband, you\u0026#39;ll be limited by that rather than your Wi-Fi.\n\u003c/p\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-features-and-app\" id=\"netgear-orbi-rbk973-review-features-and-app\"\u003eNetgear Orbi RBK973 Review: Features and app\u003c/h2\u003e\u003cp\u003eLike all modern Wi-Fi setups, the Orbi RBK973 comes with plenty of features.\n\u003c/p\u003e\u003cp\u003eThe first that springs to mind is the option to run a guest network as has become the norm these days. It keeps other people\u0026#39;s devices sandboxed and away from your main network for security purposes.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62997-130930-Netgear-Orbi-app-on-iPhone-15-Pro-Max-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62997-130930-Netgear-Orbi-app-on-iPhone-15-Pro-Max-xl.jpg\" alt=\"Two smartphones display the Orbi management app interface with a network map and options for device manager, security, internet speed, and parental controls. Background is a gradient of blue and pink.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNetgear Orbi RBK973 review: The Orbi app offers router management features.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThis setup goes a step further by offering another network just for your smart devices, like bulbs and whatnot. The idea is that you limit those to the 2.4GHz band to avoid slowing everything else down.\n\u003c/p\u003e\u003cp\u003eBeyond that, Netgear offers parental controls via an optional $7.99 per month subscription. You can set up profiles for each person and link their devices to it, offering controls per profile.\n\u003c/p\u003e\u003cp\u003eNetgear Armor, powered by Bitdefender, is a security feature that scans each device for vulnerabilities and reports back. It\u0026#39;s free for the first year, but you\u0026#39;ll have to pay after that.\n\u003c/p\u003e\u003cp\u003eElsewhere, all the usual features are present including VPN support, port forwarding, VLAN configuration options, and more. Everything can be managed via the web interface, including remotely.\n\u003c/p\u003e\u003cp\u003ePrefer to use your phone? The Orbi app offers many of the same features in a different package with some of the more advanced options out of the way.\n\u003c/p\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-not-all-wifi-7-routers-are-created-equal\" id=\"netgear-orbi-rbk973-review-not-all-wifi-7-routers-are-created-equal\"\u003eNetgear Orbi RBK973 Review: Not all Wi-Fi 7 routers are created equal\u003c/h2\u003e\u003cp\u003eAt this point, I think it\u0026#39;s important to address the elephant in the room —  the price. I said earlier that this Orbi setup, as tested, can retail for up to $2,299, and that\u0026#39;s a lot of money.\n\u003c/p\u003e\u003cp\u003eYou might be looking at that figure and then comparing it with another Wi-Fi- 7-badged router on Amazon that costs two-thirds less. You aren\u0026#39;t the first person to fall into that trap, and you won\u0026#39;t be the last.\n\u003c/p\u003e\u003cp\u003eBut it\u0026#39;s important to remember that not all Wi-Fi 7 systems are created equal. Let\u0026#39;s use the \u003ca href=\"https://appleinsider.com/articles/25/03/11/tp-link-deco-be5000-review-whole-home-mesh-wi-fi-7-on-a-budget\"\u003eTP-Link Deco BE5000 system we recently reviewed\u003c/a\u003e as an example.\n\u003c/p\u003e\u003cp\u003eLike this Netgear kit, that comes with a router and two access points for extra coverage. And TP-Link\u0026#39;s kit also has the flashy Wi-Fi 7 badge on the box, too.\n\u003c/p\u003e\u003cp\u003eAnd then, there\u0026#39;s the price. The TP-Link Deco BE5000 sells for around $300 in this configuration, \u003cem\u003econsiderably\u003c/em\u003e less than the Orbi.\n\u003c/p\u003e\u003cp\u003eBut there are reasons with the most obvious being the band situation. The BE5000 uses a dual-band setup; 2.4GHz capable of 688Mbps and 5GHz that tops out at 4,324Mbps.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62781-130508-Deco-4-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62781-130508-Deco-4-xl.jpg\" alt=\"Three white, round electronic devices with subtle branding rest on a black surface, evenly spaced in a row.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNetgear Orbi RBK973 Review: TP-Link makes an affordable mesh Wi-Fi 7 product.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eI already outlined what the Orbi offers, but it bears repeating.\n\u003c/p\u003e\u003cp\u003eIts quad-band radios offer 11,530Mbps at 6GHz and 8,647Mbps for a dedicated 5GHz backhaul between access points. The standard 5GHz band offers 5,765Mbps while the slower 2.4GHz band manages 1,147Mbps.\n\u003c/p\u003e\u003cp\u003eNow yes, technically, both of these mesh systems are specced for Wi-Fi 7; the spec doesn\u0026#39;t \u003cem\u003edemand\u003c/em\u003e a 6GHz band, for example. But one is considerably faster than the other.\n\u003c/p\u003e\u003cp\u003eThe Orbi is faster when using modern devices on the 5Ghz and 6GHz bands. It\u0026#39;s also faster when using legacy devices on the 2.4GHz band, important if you have a lot of smart home devices.\n\u003c/p\u003e\u003cp\u003eThe lack of a dedicated backhaul for the DECO BE5000 is also a bigger problem than some might realize. Without it, every device in your home fights for bandwidth with the mesh system that\u0026#39;s supposed to make things better.\n\u003c/p\u003e\u003cp\u003eWith Netgear\u0026#39;s solution, the access points talk to each other via a dedicated connection. All of the data between your devices and the internet is unaffected, no matter what.\n\u003c/p\u003e\u003cp\u003eIn busy homes with a lot of data-hungry devices, that soon starts to make a difference.\n\u003c/p\u003e\u003cp\u003eThere are, of course, other options, too. Some people might not like the idea of all their internet traffic running through hardware built by a Chinese company.\n\u003c/p\u003e\u003cp\u003eThe Deco doesn\u0026#39;t have as many wired ports for you to use. And none of them match the Orbi\u0026#39;s 10Gbps, either.\n\u003c/p\u003e\u003cp\u003eI\u0026#39;m sure there are more differences, but this review isn\u0026#39;t about a direct comparison between these two options. Regardless, the point stands —  don\u0026#39;t expect a $300 Wi-Fi 7 setup to match one costing almost $2,000 more.\n\u003c/p\u003e\u003cp\u003eWith that being said, not everyone needs what the Orbi offers —  and that\u0026#39;s why mesh systems like TP-Link\u0026#39;s are great. Options are good, but it\u0026#39;s important to know how they differ from one another.\n\u003c/p\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-the-best-wifi-setup-that-you-probably-dont-need\" id=\"netgear-orbi-rbk973-review-the-best-wifi-setup-that-you-probably-dont-need\"\u003eNetgear Orbi RBK973 Review: The best Wi-Fi setup that you probably don\u0026#39;t need\u003c/h2\u003e\u003cp\u003eIt should be no surprise to anyone who got this far that I\u0026#39;m a huge fan of the Orbi RBK973 system, but it isn\u0026#39;t perfect. It\u0026#39;s simply too expensive to recommend to \u003cem\u003emost\u003c/em\u003e people.\n\u003c/p\u003e\u003cp\u003e\u003cem\u003eMost\u003c/em\u003e people don\u0026#39;t need it, and they definitely shouldn\u0026#39;t spend this kind of money on a Wi-Fi setup. Thankfully, Netgear does have other Wi-Fi 7 systems for you to buy at more reasonable prices.\n\u003c/p\u003e\u003cp\u003eBut, all of that being said, if you want super-fast wired and wireless networking and money isn\u0026#39;t a consideration, you can\u0026#39;t go far wrong here. If you can find this line of mesh routers at the right price, buy it. You won\u0026#39;t regret it.\n\u003c/p\u003e\u003cul\u003e\n\u003cli\u003eGorgeous to look at\u003c/li\u003e\n\u003cli\u003eIncredibly-fast wireless connectivity\u003c/li\u003e\n\u003cli\u003eIncredibly fast wired connectivity, too\u003c/li\u003e\n\u003cli\u003ePlenty of management and parental control features\u003c/li\u003e\n\u003cli\u003eSingle router and full mesh system options\u003c/li\u003e\n\u003c/ul\u003e\u003ch2 data-anchor=\"netgear-orbi-rbk973-review-cons\" id=\"netgear-orbi-rbk973-review-cons\"\u003eNetgear Orbi RBK973 Review: Cons\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eDid you see the price?\u003c/li\u003e\n\u003cli\u003eOverkill for most people\u003c/li\u003e\n\u003cli\u003eSome of the management controls are behind a subscription\u003c/li\u003e\n\u003c/ul\u003e\u003ch2 data-anchor=\"rating-4-out-of-5\" id=\"rating-4-out-of-5\"\u003eRating: 4 out of 5\u003c/h2\u003e\u003ch2 data-anchor=\"where-to-buy-the-netgear-orbi-rbk973\" id=\"where-to-buy-the-netgear-orbi-rbk973\"\u003eWhere to buy the Netgear Orbi RBK973\u003c/h2\u003e\u003cp\u003eNetgear sells the RBK973 for \u003ca href=\"https://www.amazon.com/dp/B0CGJGXFCS/?tag=aireviews-20\"\u003earound $2,000 on Amazon\u003c/a\u003e, depending on whether a deal is running. That\u0026#39;s less than you\u0026#39;d spend if you bought directly from Netgear itself. However, at the time of writing only the silver version is available at Amazon.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": null,
  "modifiedTime": null
}
