{
  "id": "b2f48608-4f59-41ba-a4e6-8341f024d67b",
  "title": "Third-party iPad smart connector accessories not working with iPadOS 18.3 beta",
  "link": "https://appleinsider.com/articles/25/01/02/third-party-ipad-smart-connector-accessories-not-working-with-ipados-183-beta?utm_medium=rss",
  "description": "Owners of the Kuxiu magnetic charging stands made for recent iPad models complain that their devices are no longer charging after updating to iPadOS 18.3. It is unclear if it is a beta bug.Kuxiu charging stands aren't charging with iPadOS 18.3 betaSome accessory makers rely on workarounds that aren't officially supported by Apple, but work due to the technology allowing it. Generally, these workarounds slide by without an issue, but not always.Kuxiu offers a range of magnetic charging stands for iPad that AppleInsider has covered with praise for the products. However, owners that updated to the iPadOS 18.3 beta are reporting that the chargers no longer work. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Wesley Hilliard",
  "published": "Thu, 02 Jan 2025 21:06:07 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Wesley Hilliard",
  "length": 2169,
  "excerpt": "Owners of the Kuxiu magnetic charging stands made for recent iPad models complain that their devices are no longer charging after updating to iPadOS 18.3. It is unclear if it is a beta bug.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Owners of the Kuxiu magnetic charging stands made for recent iPad models complain that their devices are no longer charging after updating to iPadOS 18.3. It is unclear if it is a beta bug. Some accessory makers rely on workarounds that aren't officially supported by Apple, but work due to the technology allowing it. Generally, these workarounds slide by without an issue, but not always. Kuxiu offers a range of magnetic charging stands for iPad that AppleInsider has covered with praise for the products. However, owners that updated to the iPadOS 18.3 beta are reporting that the chargers no longer work. It could be a simple bug, in which case, just wait until Apple patches the problem. As usual, betas are going to beta, so install at your own risk. Or, if Apple has decided this use of the smart connector isn't allowed, it could be patching out the functionality in iPadOS 18.3. Apple's MFi programApple has a third-party accessory maker program called MFi, or Made For iPhone, that lets companies build certified accessories using proprietary technologies. Despite the name, the program applies to a range of Apple products. Magnetic charging stands help get cables out of the wayThe iPad Smart Connector isn't listed on the MFi website, but Apple does have partners like Logitech that use the proprietary connector. Kuxiu hasn't been shy about admitting it had to reverse engineer the feature, so it clearly didn't go through Apple's program. This is further evidenced by a prompt that appears when connecting an iPad to the charging stand stating a Chinese language keyboard has been attached. That means these stands are telling the iPad they are a keyboard, which can also lead to annoyances with getting the on-screen keyboard to appear while connected. The devices appear harmless, but they do circumvent a possible revenue source for Apple, so there is a chance Apple could stop them from working. There's also the impending \"Home Hub\" that would compete with stand-mounted iPads. Let's hope Apple doesn't stop these chargers from working, as they do bring an interesting use case to the iPad. AppleInsider has reached out to Kuxiu about the issue.",
  "image": "https://photos5.appleinsider.com/gallery/62193-128891-Charging-Stand-roundup1-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eOwners of the Kuxiu magnetic charging stands made for recent \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPad\u003c/a\u003e models complain that their devices are no longer charging after updating to iPadOS 18.3. It is unclear if it is a beta bug.\n\u003c/p\u003e\u003cp\u003eSome accessory makers rely on workarounds that aren\u0026#39;t officially supported by Apple, but work due to the technology allowing it. Generally, these workarounds slide by without an issue, but not always.\n\u003c/p\u003e\u003cp\u003eKuxiu offers a range of magnetic charging stands for iPad that \u003cem\u003eAppleInsider\u003c/em\u003e \u003ca href=\"https://appleinsider.com/inside/ipad-pro/best/best-magnetic-ipad-stand\"\u003ehas covered\u003c/a\u003e with praise for the products. However, owners that updated to the \u003ca href=\"https://appleinsider.com/inside/ipados-18\" title=\"iPadOS 18\" data-kpt=\"1\"\u003eiPadOS 18.3\u003c/a\u003e beta \u003ca href=\"https://old.reddit.com/r/iPadPro/comments/1hrrokf/ios_183_beta_not_charging_via_back_pins_smart/\"\u003eare reporting\u003c/a\u003e that the chargers no longer work.\n\u003c/p\u003e\u003cp\u003eIt could be a simple bug, in which case, just wait until Apple patches the problem.   As usual, betas are going to beta, so install at your own risk.\n\u003c/p\u003e\u003cp\u003eOr, if Apple has decided this use of the smart connector isn\u0026#39;t allowed, it could be patching out the functionality in iPadOS 18.3.\n\u003c/p\u003e\u003ch2 data-anchor=\"apples-mfi-program\" id=\"apples-mfi-program\"\u003eApple\u0026#39;s MFi program\u003c/h2\u003e\u003cp\u003eApple has a third-party accessory maker program called MFi, or Made For iPhone, that lets companies build certified accessories using proprietary technologies. Despite the name, the program applies to a range of Apple products.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62193-128892-Charging-Stand-Roundup4-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62193-128892-Charging-Stand-Roundup4-xl.jpg\" alt=\"Tablet on a stand with a charging cable attached, placed on a wooden surface, against a light wooden panel background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eMagnetic charging stands help get cables out of the way\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe iPad Smart Connector isn\u0026#39;t listed on the \u003ca href=\"https://mfi.apple.com/\"\u003eMFi website\u003c/a\u003e, but Apple does have partners like Logitech that use the proprietary connector. Kuxiu hasn\u0026#39;t been shy about admitting it had to reverse engineer the feature, so it clearly didn\u0026#39;t go through Apple\u0026#39;s program.\n\u003c/p\u003e\u003cp\u003eThis is further evidenced by a prompt that appears when connecting an iPad to the charging stand stating a Chinese language keyboard has been attached. That means these stands are telling the iPad they are a keyboard, which can also lead to annoyances with getting the on-screen keyboard to appear while connected.\n\u003c/p\u003e\u003cp\u003eThe devices appear harmless, but they do circumvent a possible revenue source for Apple, so there is a chance Apple could stop them from working. There\u0026#39;s also the impending \u0026#34;\u003ca href=\"https://appleinsider.com/articles/24/12/04/homepod-with-built-in-screen-now-expected-in-late-2025\"\u003eHome Hub\u003c/a\u003e\u0026#34; that would compete with stand-mounted iPads.\n\u003c/p\u003e\u003cp\u003eLet\u0026#39;s hope Apple doesn\u0026#39;t stop these chargers from working, as they do bring an interesting use case to the iPad. \u003cem\u003eAppleInsider\u003c/em\u003e has reached out to Kuxiu about the issue.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-02T21:06:07Z",
  "modifiedTime": null
}
