{
  "id": "b35a8e40-7370-4e68-8e6e-70aec6287f2b",
  "title": "Baseus Nomos MagSafe Battery review: A great 'just in case' daily carry battery",
  "link": "https://appleinsider.com/articles/25/03/27/baseus-nomos-magsafe-battery-review-a-great-just-in-case-daily-carry-battery?utm_medium=rss",
  "description": "Baseus' new power bank combines the convenience of MagSafe and the power of fast charging with a built-in USB-C cable.Baseus Nomos MagSafe Battery reviewA MagSafe charger can be a lifesaver when it comes to bringing your phone from the brink of 0% without being tethered to a cable or outlet. Still, there are times when fast charging might be crucial to help your devices get through the day.The Nomos combines both of these ideas in a portable, yet high-milliamp package. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Thomas Sibilly",
  "published": "Thu, 27 Mar 2025 00:28:22 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "{{ author }} | {{ dateFormatted }}",
  "length": 3467,
  "excerpt": "Baseus' new power bank combines the convenience of MagSafe and the power of fast charging with a built-in USB-C cable.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Baseus' new power bank combines the convenience of MagSafe and the power of fast charging with a built-in USB-C cable. A MagSafe charger can be a lifesaver when it comes to bringing your phone from the brink of 0% without being tethered to a cable or outlet. Still, there are times when fast charging might be crucial to help your devices get through the day. The Nomos combines both of these ideas in a portable, yet high-milliamp package. Baseus has been making consumer tech since 2008, making battery banks, USB-C hubs, and earbuds. The Nomos comes in simple black or grey colors, complimenting your phone without standing out. The rounded edges and glossy finish creates a clean and minimal aesthetic. With up to 10,000mAh of capacity in a pocketable form factor, it's easy to store the Nomos away on your person for charging later. Wireless is Qi2 with up to 15W output, and the wired fast charging is up to 45W. Baseus Nomos MagSafe Battery review: iPhone 16 Pro in Standby Mode with the Nomos as a stand.The Nomos has a 3-in-1 design with the USB-C cable, port, and wireless charging, where you can use all three to charge. The USB-C port on the side also supports passthrough charging for those moments the battery is low. The maximum input for charging the Nomos is 30W, making recharging not much of an issue for most charging bricks. Baseus Nomos MagSafe Battery - Specs Product Detail Spec Capacity 10000mAH Colors Black, Grey Wired Fast Charging Up to 45W Wireless Charging Qi2 15W Max Input 30W Weight 230 g Size 4.25 in x 2.67 in x 0.77 in Baseus Nomos MagSafe Battery review: The Nomos shows both output wattage and battery percentage on the screen.Baseus Nomos MagSafe Battery - UseIt fares well in most charging situations, too. The fast-charging cable is reliable, bringing my iPhone 16 Pro from 0 to 30% within 20 minutes. To make the most of the battery, I'd use the USB-C cable for my iPhone and charge my AirPods with wireless charging. Of course, it also has the convenience of most MagSafe batteries by being a great nightstand and pocket charger. The glossy back of the Nomos is appealing when you first get it but also tends to track a ton of fingerprints over time, which is expected. The kickstand is nicely functional for portrait and landscape modes, and the cable has a good amount of durability throughout several weeks of use. Baseus Nomos MagSafe Battery review: The Nomos charging AirPods Pro 2 and iPhone 16 Pro.Baseus Nomos MagSafe Battery - A capable hybrid battery to goFor the price, it delivers on both capacity and variety of charging methods. I noticed its size is consistent in comparison to other 10,000mAh batteries as well. Of course, there's the caveat that if the USB-C cable gets damaged or severed, then you lose the fast charging forever, so handle it with care. Overall, it delivers on its selling points without deviating from the norm. For something so compact, you can only add so many features without detracting from the experience. Baseus Nomos MagSafe Battery review: Charging two devices two ways can be convenient!Baseus Nomos MagSafe Battery Pros Combines wireless and fast charging Pleasing design High capacity Baseus Nomos MagSafe Battery Cons Built in wire is a liability Potentially bulky, depending on pockets Rating: 3.5 out of 5Where to buy the Baseus Nomos MagSafe Battery The Baseus Nomos MagSafe Battery is currently available on Amazon and the Baseus store for $69.59.",
  "image": "https://photos5.appleinsider.com/gallery/62637-130924-IMG_4323-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eBaseus\u0026#39; new power bank combines the convenience of MagSafe and the power of fast charging with a built-in USB-C cable.\n\u003c/p\u003e\u003cp\u003eA MagSafe charger can be a lifesaver when it comes to bringing your phone from the brink of 0% without being tethered to a cable or outlet. Still, there are times when fast charging might be crucial to help your devices get through the day.\n\u003c/p\u003e\u003cp\u003eThe Nomos combines both of these ideas in a portable, yet high-milliamp package.\n\u003c/p\u003e\u003cp\u003eBaseus has been making consumer tech since 2008, making battery \u003ca href=\"https://appleinsider.com/articles/23/06/03/baseus-blade-laptop-power-bank-review-empower-your-mobile-workstation\"\u003ebanks\u003c/a\u003e, USB-C \u003ca href=\"https://appleinsider.com/articles/23/06/17/baseus-usb-c-hub-9-in-1-review-maybe-too-much-usb-a\"\u003ehubs\u003c/a\u003e, and \u003ca href=\"https://appleinsider.com/articles/23/03/22/baseus-bowie-m2-plus-review-small-wireless-earbuds-mighty-sounds\"\u003eearbuds\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003eThe Nomos comes in simple black or grey colors, complimenting your phone without standing out. The rounded edges and glossy finish creates a clean and minimal aesthetic.\n\u003c/p\u003e\u003cp\u003eWith up to 10,000mAh of capacity in a pocketable form factor, it\u0026#39;s easy to store the Nomos away on your person for charging later. Wireless is Qi2 with up to 15W output, and the wired fast charging is up to 45W.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62637-130916-IMG_4311-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62637-130916-IMG_4311-xl.jpg\" alt=\"Baseus Nomos MagSafe Battery review: iPhone 16 Pro in Standby Mode with the Nomos as a stand.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eBaseus Nomos MagSafe Battery review: iPhone 16 Pro in Standby Mode with the Nomos as a stand.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe Nomos has a 3-in-1 design with the USB-C cable, port, and wireless charging, where you can use all three to charge. The USB-C port on the side also supports passthrough charging for those moments the battery is low.\n\u003c/p\u003e\u003cp\u003eThe maximum input for charging the Nomos is 30W, making recharging not much of an issue for most charging bricks.\n\u003c/p\u003e\u003ch3 data-anchor=\"baseus-nomos-magsafe-battery--specs\" id=\"baseus-nomos-magsafe-battery--specs\"\u003eBaseus Nomos MagSafe Battery - Specs\u003c/h3\u003e\u003ctable id=\"table-0\"\u003e\u003cthead\u003e\n\u003ctr\u003e\n\u003cth\u003eProduct Detail\u003c/th\u003e\n\u003cth\u003eSpec\u003c/th\u003e\n\u003c/tr\u003e\u003c/thead\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003eCapacity\u003c/td\u003e\n\u003ctd\u003e10000mAH\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eColors\u003c/td\u003e\n\u003ctd\u003eBlack, Grey\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eWired Fast Charging\u003c/td\u003e\n\u003ctd\u003eUp to 45W\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eWireless Charging\u003c/td\u003e\n\u003ctd\u003eQi2 15W\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eMax Input\u003c/td\u003e\n\u003ctd\u003e30W\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eWeight\u003c/td\u003e\n\u003ctd\u003e230 g\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eSize\u003c/td\u003e\n\u003ctd\u003e4.25 in x 2.67 in x 0.77 in\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62637-130913-IMG_2098-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62637-130913-IMG_2098-xl.jpg\" alt=\"Baseus Nomos MagSafe Battery review: The Nomos shows both output wattage and battery percentage on the screen.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eBaseus Nomos MagSafe Battery review: The Nomos shows both output wattage and battery percentage on the screen.\u003c/span\u003e\u003c/p\u003e\u003ch2 data-anchor=\"baseus-nomos-magsafe-battery--use\" id=\"baseus-nomos-magsafe-battery--use\"\u003eBaseus Nomos MagSafe Battery - Use\u003c/h2\u003e\u003cp\u003eIt fares well in most charging situations, too. The fast-charging cable is reliable, bringing my iPhone 16 Pro from 0 to 30% within 20 minutes.\n\u003c/p\u003e\u003cp\u003eTo make the most of the battery, I\u0026#39;d use the USB-C cable for my iPhone and charge my AirPods with wireless charging. Of course, it also has the convenience of most MagSafe batteries by being a great nightstand and pocket charger.\n\u003c/p\u003e\u003cp\u003eThe glossy back of the Nomos is appealing when you first get it but also tends to track a ton of fingerprints over time, which is expected. The kickstand is nicely functional for portrait and landscape modes, and the cable has a good amount of durability throughout several weeks of use.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62637-130920-IMG_4314-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62637-130920-IMG_4314-xl.jpg\" alt=\"Baseus Nomos MagSafe Battery review: The Nomos charging AirPods Pro 2 and iPhone 16 Pro.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eBaseus Nomos MagSafe Battery review: The Nomos charging AirPods Pro 2 and iPhone 16 Pro.\u003c/span\u003e\u003c/p\u003e\u003ch2 data-anchor=\"baseus-nomos-magsafe-battery--a-capable-hybrid-battery-to-go\" id=\"baseus-nomos-magsafe-battery--a-capable-hybrid-battery-to-go\"\u003eBaseus Nomos MagSafe Battery - A capable hybrid battery to go\u003c/h2\u003e\u003cp\u003eFor the price, it delivers on both capacity and variety of charging methods. I noticed its size is consistent in comparison to other 10,000mAh batteries as well.\n\u003c/p\u003e\u003cp\u003eOf course, there\u0026#39;s the caveat that if the USB-C cable gets damaged or severed, then you lose the fast charging forever, so handle it with care.\n\u003c/p\u003e\u003cp\u003eOverall, it delivers on its selling points without deviating from the norm. For something so compact, you can only add so many features without detracting from the experience.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62637-130923-IMG_4318-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62637-130923-IMG_4318-xl.jpg\" alt=\"Baseus Nomos MagSafe Battery review: Charging two devices two ways can be convenient!\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eBaseus Nomos MagSafe Battery review: Charging two devices two ways can be convenient!\u003c/span\u003e\u003c/p\u003e\u003ch2 data-anchor=\"baseus-nomos-magsafe-battery-pros\" id=\"baseus-nomos-magsafe-battery-pros\"\u003eBaseus Nomos MagSafe Battery Pros\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eCombines wireless and fast charging\u003c/li\u003e\n\u003cli\u003ePleasing design\u003c/li\u003e\n\u003cli\u003eHigh capacity\u003c/li\u003e\n\u003c/ul\u003e\u003ch2 data-anchor=\"baseus-nomos-magsafe-battery-cons\" id=\"baseus-nomos-magsafe-battery-cons\"\u003eBaseus Nomos MagSafe Battery Cons\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eBuilt in wire is a liability\u003c/li\u003e\n\u003cli\u003ePotentially bulky, depending on pockets\u003c/li\u003e\n\u003c/ul\u003e\u003ch2 data-anchor=\"rating-35-out-of-5\" id=\"rating-35-out-of-5\"\u003eRating: 3.5 out of 5\u003c/h2\u003e\u003ch2 data-anchor=\"where-to-buy-the-baseus-nomos-magsafe-battery-\" id=\"where-to-buy-the-baseus-nomos-magsafe-battery-\"\u003eWhere to buy the Baseus Nomos MagSafe Battery \u003c/h2\u003e\u003cp\u003eThe Baseus Nomos MagSafe Battery is currently available on \u003ca href=\"https://www.amazon.com/dp/B0DDPVW89G/?tag=aireviews-20\" rel=\"nofollow\"\u003eAmazon\u003c/a\u003e and the Baseus \u003ca href=\"https://www.baseus.com/products/nomos-magnetic-power-bank-qi2-45w-10000mah\"\u003estore\u003c/a\u003e for $69.59.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
