{
  "id": "c767b914-39ae-49e9-af27-aa5ff15288ae",
  "title": "PSA: There’s another update available for users running the latest iOS 18.2 RC build",
  "link": "https://9to5mac.com/2024/12/11/ios-18-2-rc-build-update/",
  "description": "As we recently reported, Apple released a second RC build of iOS 18.2 to developers and beta testers before releasing the update to everyone earlier today. Although the RC build is often the same as the one that becomes available to the public, this time beta users have another update to install on their devices. more…",
  "author": "Filipe Espósito",
  "published": "Thu, 12 Dec 2024 00:20:32 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Filipe Espósito",
  "length": 2196,
  "excerpt": "As we recently reported, Apple released a second RC build of iOS 18.2 to developers and beta testers before releasing...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "As we recently reported, Apple released a second RC build of iOS 18.2 to developers and beta testers before releasing the update to everyone earlier today. Although the RC build is often the same as the one that becomes available to the public, this time beta users have another update to install on their devices. New iOS 18.2 build available That’s because Apple has released a new build of iOS 18.2 to the public, and this build is different from the iOS 18.2 RC 2 that was released to beta users on Monday. For comparison, here are the different build numbers: iOS 18.2 RC: 22C150 iOS 18.2 RC 2: 22C151 iOS 18.2 Official Release: 22C152 Similar to iOS, Apple’s other operating systems have also been updated with new builds different from the previous one available to beta users. For instance, macOS 15.2 went from 24C100 (RC 2) to 24C101 in the final release. The final build of watchOS 11.2 (22S101) is also different from the RC. Although nothing significant has changed from one build to another except for bug fixes, it’s always important to keep all your devices updated with the latest software available. Both iOS 18.2 and macOS 15.2 add more Apple Intelligence features for compatible iPhones, iPads and Macs, including Image Playground and Genmoji. As for watchOS 11.2, the update brings improvements to the Camera Remote app. iPhone and iPad users can update the software by going to Settings \u003e General \u003e Software Update. On Mac, open the System Settings app, then go to General \u003e Software Update. The process is similar on Apple Watch (the update can also be installed via the Watch app on the paired iPhone). Read also iOS 18.2 launching today with most compelling Apple Intelligence features yet macOS Sequoia 15.2 now available, here’s everything that’s new watchOS 11.2 now available for Apple Watch users with updated Camera Remote app Apple Vision Pro just got way more useful following visionOS 2.2 release iOS 18.2 adds natural language search to Apple Music and Apple TV app Buy Apple products at a discount Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/ios-18.2-banner.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/11/ios-18.2-banner.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"iOS 18.2\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/ios-18.2-banner.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/ios-18.2-banner.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/ios-18.2-banner.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/ios-18.2-banner.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eAs we recently reported, \u003ca href=\"https://9to5mac.com/2024/12/09/ios-182-public-beta-rc-now-available-as-major-update-nears-release/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple released a second RC build of iOS 18.2\u003c/a\u003e to developers and beta testers before releasing the update to everyone earlier today. Although the RC build is often the same as the one that becomes available to the public, this time beta users have another update to install on their devices.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-new-ios-18-2-build-available\"\u003eNew iOS 18.2 build available\u003c/h2\u003e\n\n\n\n\u003cp\u003eThat’s because Apple has released a new build of iOS 18.2 to the public, and this build is different from the iOS 18.2 RC 2 that was released to beta users on Monday. For comparison, here are the different build numbers:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eiOS 18.2 RC: 22C150\u003c/li\u003e\n\n\n\n\u003cli\u003eiOS 18.2 RC 2: 22C151\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eiOS 18.2 Official Release: 22C152\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eSimilar to iOS, Apple’s other operating systems have also been updated with new builds different from the previous one available to beta users. For instance, \u003cstrong\u003emacOS 15.2\u003c/strong\u003e went from 24C100 (RC 2) to \u003cstrong\u003e24C101\u003c/strong\u003e in the final release. The final build of \u003cstrong\u003ewatchOS 11.2\u003c/strong\u003e \u003cstrong\u003e(22S101)\u003c/strong\u003e is also different from the RC.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlthough nothing significant has changed from one build to another except for bug fixes, it’s always important to keep all your devices updated with the latest software available.\u003c/p\u003e\n\n\n\n\u003cp\u003eBoth iOS 18.2 and macOS 15.2 add more Apple Intelligence features for compatible iPhones, iPads and Macs, including Image Playground and Genmoji. As for watchOS 11.2, the update brings improvements to the Camera Remote app.\u003c/p\u003e\n\n\n\n\u003cp\u003eiPhone and iPad users can update the software by going to Settings \u0026gt; General \u0026gt; Software Update. On Mac, open the System Settings app, then go to General \u0026gt; Software Update. The process is similar on Apple Watch (the update can also be installed via the Watch app on the paired iPhone).\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-read-also\"\u003eRead also\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/12/11/ios-18-2-release-date-new-features/\"\u003eiOS 18.2 launching today with most compelling Apple Intelligence features yet\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/12/11/whats-new-in-macos-15-2-here-are-apples-full-release-notes/\"\u003emacOS Sequoia 15.2 now available, here’s everything that’s new\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/12/11/watchos-11-2-update/\"\u003ewatchOS 11.2 now available for Apple Watch users with updated Camera Remote app\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/12/11/apple-vision-pro-just-got-way-more-useful-following-visionos-2-2-release/\"\u003eApple Vision Pro just got way more useful following visionOS 2.2 release\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/12/05/ios-18-2-natural-language-search-apple-music-tv/\"\u003eiOS 18.2 adds natural language search to Apple Music and Apple TV app\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/41u0Z1W\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBuy Apple products at a discount\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/3Vv6mtJ\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/12/DREAME-750_150.jpg?quality=82\u0026amp;strip=all\" alt=\"\" width=\"750\" height=\"150\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-12T00:20:32Z",
  "modifiedTime": "2024-12-12T00:21:08Z"
}
