{
  "id": "f23467a7-f296-4edd-a4df-99e0a95ff4ce",
  "title": "macOS 26 rumored to be called 'Tahoe'",
  "link": "https://appleinsider.com/articles/25/06/01/macos-26-rumored-to-be-called-tahoe?utm_medium=rss",
  "description": "Like its previous OS versions that denoted significant changes, Apple is rumored to give the upcoming macOS 26 the name of a particularly notable California location.The next macOS is rumored to be called 'Tahoe'Apple is reportedly overhauling the look of its various OSes with its next set of releases, expected to arrive in the fall of this year. Adopting the nomenclature of vehicle models, the company is set to jump from version numbers to reflecting the year ahead of release.According to a new report from Bloomberg, macOS 26 will adopt the name Tahoe, after California's Lake Tahoe resort area. Rumor Score: 🤔 Possible Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Charles Martin",
  "published": "Sun, 01 Jun 2025 12:54:12 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Charles Martin",
  "length": 1754,
  "excerpt": "Like its previous OS versions that denoted significant changes, Apple is rumored to give the upcoming macOS 26 the name of a particularly notable California location.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Like its previous OS versions that denoted significant changes, Apple is rumored to give the upcoming macOS 26 the name of a particularly notable California location. Apple is reportedly overhauling the look of its various OSes with its next set of releases, expected to arrive in the fall of this year. Adopting the nomenclature of vehicle models, the company is set to jump from version numbers to reflecting the year ahead of release. According to a new report from Bloomberg, macOS 26 will adopt the name Tahoe, after California's Lake Tahoe resort area. The name is said to signal the significance of the update. Alongside new features, macOS Tahoe will feature a refreshed look to its interface. The name was chosen to reflect the significance of the changes. The last major overhaul of the look of the OS came in 2014 and was named Yosemite after the imposing rock formations of the national park. The macOS release accompanying the shift to Apple's own chips was named Big Sur, after the rugged mountainous region in central California. MacOS Tahoe has apparently been chosen to reflect the fresh look coming to the interface elements of the next release. Lake Tahoe is a popular resort location for Apple employees — image credit: ForbesLake Tahoe is a large freshwater lake straddling the border of California and Nevada, known for its natural beauty, high altitude, and various resorts. It is said to be a frequent vacation and second-home location for a number of Apple employees. The lake is also known for its deep blue water, reflecting the surrounding mountains and sky. Given the reports of updated icons and other interface elements, the name seems appropriate for a refreshed look coming to Apple's operating systems later this year.",
  "image": "https://photos5.appleinsider.com/gallery/63812-132762-macOS-26-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eLike its previous OS versions that denoted significant changes, Apple is rumored to give the upcoming \u003ca href=\"https://appleinsider.com/inside/macos-26\" title=\"macOS 26\" data-kpt=\"1\"\u003emacOS 26\u003c/a\u003e the name of a particularly notable California location.\n\u003c/p\u003e\u003cp\u003eApple is reportedly overhauling the look of its various OSes with its next set of releases, expected to arrive in the fall of this year. Adopting the nomenclature of vehicle models, the company is set to jump from version numbers to reflecting the \u003ca href=\"https://appleinsider.com/articles/25/05/28/apple-rumored-to-release-ios-26-at-wwdc-instead-of-ios-19\"\u003eyear ahead\u003c/a\u003e of release.\n\u003c/p\u003e\u003cp\u003eAccording to a new report from \u003cem\u003eBloomberg\u003c/em\u003e, macOS 26 will adopt the name Tahoe, after California\u0026#39;s \u003ca href=\"https://www.bloomberg.com/news/newsletters/2025-06-01/apple-s-wwdc-2025-plan-macos-tahoe-apple-intelligence-ai-ios-26-games-app-mbdlzqpz\"\u003eLake Tahoe\u003c/a\u003e resort area.\n\u003c/p\u003e\u003cp\u003eThe name is said to signal the significance of the update. Alongside new features, macOS Tahoe will feature a refreshed look to its interface.\n\u003c/p\u003e\u003cp\u003eThe name was chosen to reflect the significance of the changes. The last major overhaul of the look of the OS came in 2014 and was \u003ca href=\"https://appleinsider.com/articles/23/08/24/apple-celebrates-national-parks-and-the-work-of-restoring-el-capitan-meadow\"\u003enamed Yosemite\u003c/a\u003e after the imposing rock formations of the national park.\n\u003c/p\u003e\u003cp\u003eThe macOS release accompanying the shift to Apple\u0026#39;s own chips was named \u003ca href=\"https://appleinsider.com/articles/21/02/09/upgrading-to-macos-big-sur-without-ample-hard-drive-storage-might-result-in-failure-and-lost-data\"\u003eBig Sur\u003c/a\u003e, after the rugged mountainous region in central California. MacOS Tahoe has apparently been chosen to reflect the fresh look coming to the interface elements of the next release.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/63812-132761-lake-tahoe-2-1200x675-3541709200-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/63812-132761-lake-tahoe-2-1200x675-3541709200-xl.jpg\" alt=\"Lake Tahoe is a popular resort location for Apple employees \u0026amp;mdash;  image credit: Forbes\" height=\"675\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eLake Tahoe is a popular resort location for Apple employees —  image credit: Forbes\u003c/span\u003e\u003c/p\u003e\u003cp\u003eLake Tahoe is a large freshwater lake straddling the border of California and Nevada, known for its natural beauty, high altitude, and various resorts. It is said to be a frequent vacation and second-home location for a number of Apple employees.\n\u003c/p\u003e\u003cp\u003eThe lake is also known for its deep blue water, reflecting the surrounding mountains and sky. Given the reports of updated icons and other interface elements, the name seems appropriate for \u003ca href=\"https://appleinsider.com/articles/25/05/25/apple-prepares-ios-19-macos-16-solarium-ui-overhaul-for-wwdc\"\u003ea refreshed look\u003c/a\u003e coming to Apple\u0026#39;s operating systems later this year.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-01T12:53:00Z",
  "modifiedTime": null
}
