{
  "id": "f27d7663-5a2d-48f3-afea-86c39fd67afc",
  "title": "Rename multiple files on Mac the easy way",
  "link": "https://www.cultofmac.com/how-to/batch-rename-files",
  "description": "If you have a batch of pictures, videos, screenshots or documents, you can use this Mac feature to rename them all in a similar format and sequence. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "D. Griffin Jones",
  "published": "Wed, 16 Oct 2024 21:45:20 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "How-To",
    "Finder",
    "Mac",
    "Top stories"
  ],
  "byline": "D. Griffin Jones",
  "length": 3582,
  "excerpt": "If you have a batch of pictures, videos, screenshots or documents, you can use this Mac feature to rename them all in a similar format and sequence.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "How-To Restore order to your file system. Image: D. Griffin Jones/Cult of Mac It’s easy to rename multiple files at once on a Mac using the Finder’s batch rename tool. If you have a big series of pictures, videos, screenshots or documents in a series, you can use this feature to rename them all in a similar format and sequence. You don’t have to take on such a tedious task by hand. How to batch rename multiple files on the Mac Renaming a group of files is easy on Mac. This feature is available on every Mac, in the Finder. Table of contents: Open the Finder and select your files Open the Rename tool Pick a format and give the files a new name 1. Select a bunch of files at once Rename a group of files at once.Screenshot: D. Griffin Jones/Cult of Mac Open the Finder and browse to the folder you want. You can type Command-A (⌘A) to select all. If you want to select a specific range, but not everything in the folder, click one file, hold shift, and then click another. It’ll select the whole range between them inclusively. If you want to add or remove a couple of items from the selection, hold Command and click on them. 2. Open the Rename tool Go to File \u003e Rename… or right-click on one of the selected items and hit Rename… to open the Rename panel. 3. Rename the group of files using one of three formats Give the series of files some new names.Screenshot: D. Griffin Jones/Cult of Mac You have three options for renaming all the files. Pick one using the dropdown box in the upper right. Here’s what they do: Replace Text will replace any part of the file name with something new. For example, to rename “IMG_9034.HEIC” to “Vacation Picture 9034.HEIC” put in “HEIC_” in the Find box and “Vacation Picture ” into the Replace With box. Add Text will add a bit of text to the beginning or the end of all the files. This is useful if you want to keep the original name while adding an extra detail like “- Final Project” to make the files easier to find later. Format will replace the entire filename with a new one. You have a few options here: Name and Index lets you rename the files “Picture 1,” “Picture 2,” “Picture 3,” etc., in a series. Set whether you want the number at the beginning or end. Give it a name in the Custom Format field. You can set whether it starts counting on 1 or any other number (0 if you’re a programmer). Name and Counter works the same as Name and Index, except it gives the numbers a leading zero — it displays number 5 as “00005” instead of “5,” for instance. macOS already does a good job of sorting numbers properly, but if you’re accessing these same files on Windows, it’s best to use Counter so that, for example, 11 appears after 2. Name and Date will rename the files with a name you give them followed by the last time they’ve been modified. This way, it doesn’t matter if the file browser is sorting by name or by date — they’ll appear in the same order since they’ll all gave a name like “Screenshot 2023-08-21 at 1.13.45 PM.png.” Why batch rename files on Mac? Personally, I use this feature all the time. For instance, when managing my Plex library of TV shows that I … found … I can give whole series of files easy-to-read names like “Doctor Who Season 16 Episode 1” with just a few clicks and keystrokes. The next time you’re putting together a bunch of pictures for a presentation, or sorting a giant folder of receipts and document scans for your accountant, do yourself a favor — use the rename multiple feature to clean up the folder first.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2023/08/Bring-Method-to-Madness.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-827827\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/how-to\" title=\"How-To\" aria-label=\"How-To articles\"\u003eHow-To\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Rename multiple files on Mac the easy way\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Bring-Method-to-Madness-1536x1152.jpg\" alt=\"Bring Method to Madness\" data-ratio=\"1.3333333333333\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tRestore order to your file system. \u003cbr/\u003e\u003cem\u003eImage: D. Griffin Jones/Cult of Mac\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eIt’s easy to rename multiple files at once on a Mac using the Finder’s batch rename tool. If you have a big series of pictures, videos, screenshots or documents in a series, you can use this feature to rename them all in a similar format and sequence.\u003c/p\u003e\n\u003cp\u003eYou don’t have to take on such a tedious task by hand.\u003c/p\u003e\n\n\u003ch2\u003eHow to batch rename multiple files on the Mac\u003c/h2\u003e\n\u003cp\u003eRenaming a group of files is easy on Mac. This feature is available on every Mac, in the Finder.\u003c/p\u003e\n\u003ch3\u003eTable of contents:\u003c/h3\u003e\n\u003col\u003e\n\u003cli\u003e\u003ca href=\"#step-one\"\u003eOpen the Finder and select your files\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#step-two\"\u003eOpen the Rename tool\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#step-three\"\u003ePick a format and give the files a new name\u003c/a\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3 id=\"step-one\"\u003e1. Select a bunch of files at once\u003c/h3\u003e\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2.jpg\" data-lasso-id=\"1641332515\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" title=\"Screenshot 2\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2.jpg\" alt=\"Mouse hovering over \u0026#34;Rename…\u0026#34; option in the Finder on a Mac.\" width=\"1940\" height=\"956\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2.jpg 1940w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2-400x197.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2-780x384.jpg 780w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2-1536x757.jpg 1536w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2-350x172.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2-400x197@2x.jpg 800w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-2-780x384@2x.jpg 1560w\" sizes=\"(max-width: 1940px) 100vw, 1940px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eRename a group of files at once.\u003cbr/\u003e\u003cspan\u003eScreenshot: D. Griffin Jones/Cult of Mac\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eOpen the \u003cstrong\u003eFinder\u003c/strong\u003e and browse to the folder you want.\u003c/p\u003e\n\u003cp\u003eYou can type \u003ca href=\"https://www.cultofmac.com/825461/mac-keyboard-shortcut-guide/\" data-lasso-id=\"1641332516\"\u003eCommand-A (\u003cstrong\u003e⌘A\u003c/strong\u003e) to select all\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIf you want to select a specific range, but not everything in the folder, click one file, hold shift, and then click another. It’ll select the whole range between them inclusively.\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eIf you want to add or remove a couple of items from the selection, hold Command and click on them.\u003c/p\u003e\n\u003ch3 id=\"step-two\"\u003e2. Open the Rename tool\u003c/h3\u003e\n\u003cp\u003eGo to \u003cstrong\u003eFile \u0026gt; Rename…\u003c/strong\u003e or right-click on one of the selected items and hit \u003cstrong\u003eRename…\u003c/strong\u003e to open the Rename panel.\u003c/p\u003e\n\u003ch3 id=\"step-three\"\u003e3. Rename the group of files using one of three formats\u003c/h3\u003e\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3.jpg\" data-lasso-id=\"1641332517\"\u003e\u003cimg decoding=\"async\" title=\"Screenshot 3\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3.jpg\" alt=\"A screenshot of the Mac\u0026#39;s batch rename files modal dialog box.\" width=\"1940\" height=\"972\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3.jpg 1940w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3-400x200.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3-780x391.jpg 780w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3-1536x770.jpg 1536w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3-350x175.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3-400x200@2x.jpg 800w, https://www.cultofmac.com/wp-content/uploads/2023/08/Screenshot-3-780x391@2x.jpg 1560w\" sizes=\"(max-width: 1940px) 100vw, 1940px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eGive the series of files some new names.\u003cbr/\u003e\u003cspan\u003eScreenshot: D. Griffin Jones/Cult of Mac\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eYou have three options for renaming all the files. Pick one using the dropdown box in the upper right.\u003c/p\u003e\n\u003cp\u003eHere’s what they do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eReplace Text\u003c/strong\u003e will replace any part of the file name with something new. For example, to rename “IMG_9034.HEIC” to “Vacation Picture 9034.HEIC” put in “HEIC_” in the Find box and “Vacation Picture ” into the Replace With box.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eAdd Text\u003c/strong\u003e will add a bit of text to the beginning or the end of all the files. This is useful if you want to keep the original name while adding an extra detail like “- Final Project” to make the files easier to find later.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eFormat\u003c/strong\u003e will replace the entire filename with a new one. You have a few options here:\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eName and Index\u003c/strong\u003e lets you rename the files “Picture 1,” “Picture 2,” “Picture 3,” etc., in a series. Set whether you want the number at the beginning or end. Give it a name in the Custom Format field. You can set whether it starts counting on 1 or any other number (0 if you’re a programmer).\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eName and Counter\u003c/strong\u003e works the same as Name and Index, except it gives the numbers a leading zero — it displays number 5 as “00005” instead of “5,” for instance. macOS already does a good job of sorting numbers properly, but if you’re accessing these same files on Windows, it’s best to use Counter so that, for example, 11 appears after 2.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eName and Date\u003c/strong\u003e will rename the files with a name you give them followed by the last time they’ve been modified. This way, it doesn’t matter if the file browser is sorting by name or by date — they’ll appear in the same order since they’ll all gave a name like “Screenshot 2023-08-21 at 1.13.45 PM.png.”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWhy batch rename files on Mac?\u003c/h3\u003e\n\u003cp\u003ePersonally, I use this feature all the time. For instance, when managing \u003ca href=\"https://www.plex.tv/your-media/\" data-lasso-id=\"1641332518\" target=\"_blank\"\u003emy Plex library\u003c/a\u003e of TV shows that I … found … I can give whole series of files easy-to-read names like “Doctor Who Season 16 Episode 1” with just a few clicks and keystrokes.\u003c/p\u003e\n\u003cp\u003eThe next time you’re putting together a bunch of pictures for a presentation, or sorting a giant folder of receipts and document scans for your accountant, do yourself a favor — use the rename multiple feature to clean up the folder first.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-16T21:45:20Z",
  "modifiedTime": "2024-10-16T21:31:41Z"
}
