{
  "id": "f5e15867-a0d4-448b-b951-847c488c54ed",
  "title": "Apple Music expands live global radio offering with three brand-new stations",
  "link": "https://www.apple.com/newsroom/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/",
  "description": "",
  "author": "Apple Newsroom",
  "published": "2024-12-10T13:59:42.119Z",
  "source": "https://www.apple.com/newsroom/rss-feed.rss",
  "categories": [
    "PRESS RELEASE"
  ],
  "byline": "",
  "length": 15968,
  "excerpt": "Apple today launched three new live global radio stations on Apple Music.",
  "siteName": "Apple Newsroom",
  "favicon": "",
  "text": "opens in new window PRESS RELEASE December 10, 2024 Apple Music expands live global radio offering with three brand-new stations The new Apple Música Uno, Apple Music Club, and Apple Music Chill live-hosted radio stations offer listeners more exclusive shows from some of the world’s most vital artists, including Becky G, Rauw Alejandro, Grupo Frontera, Honey Dijon, Jamie xx, FKA twigs, Nia Archives, Brian Eno, Stephan Moccio, and more Apple Music introduces three new radio stations: Apple Música Uno, Apple Music Club, and Apple Music Chill. CUPERTINO, CALIFORNIA Apple today launched three new live global radio stations on Apple Music. Music fans around the world can now tune in to Apple Música Uno, Apple Music Club, and Apple Music Chill — in addition to Apple Music 1, Apple Music Hits, and Apple Music Country — and listen to live-hosted radio for free, without a subscription, on Apple Music Radio. “Apple Music Radio is the beating heart of our service, representing the intersection of exceptional human voices and curation with cutting-edge technology that shapes and influences culture,” said Oliver Schusser, Apple’s vice president of Music, Sports, and Beats. “We put a lot of time and care into making sure these new radio stations are really bespoke, highly curated, and hosted by some of the world’s best music commentators with unique programming that we know our listeners will love.” Since launching in 2015, the award-winning Apple Music Radio has become the home for exclusive programming by top global music experts and content that music lovers can’t find anywhere else — from interviews with the biggest artists on the planet across genres, to shows hosted and shaped by the artists themselves. “Music is crucial to our health and happiness, and what Apple Music Radio brings is a sense that your music is always there for you, always on, and waiting for you to just tap in,” said Zane Lowe, Apple Music’s global creative director and lead anchor for Apple Music 1. “In a world of AI and algorithms, Apple Music Radio is live. It’s real people, it’s a shared event, and I’m so excited to be broadening that experience to listeners worldwide with three new stations.” Introducing Apple Música Uno Apple Música Uno speaks directly to the wealth of stylistic diversity in Latin music around the world. The focus will always be on music, specifically what’s new, current, and moving culture — from Música Mexicana and reggaetón, to tropical, Latin pop, and more. Latin superstar Becky G is the station’s official launch host, and fellow luminaries Rauw Alejandro and Grupo Frontera will host special shows of their own. On a daily basis, listeners will be welcomed by Evelyn Sicairos and Lechero, two prominent radio personalities whose passion for music and drawing cross-cultural connections will set the tone and energy for the station as a whole. They will each host their own flagship playlist show five days a week, with Sicairos helming La Oficial Radio, and Lechero taking over ¡Dale Play! Radio. Additional programming will include Puro Pop Radio, informed by the beloved playlist of the same name, while weekend programming will take cues from Cumbia Pa’ La Fiesta, Canciones Caras, and Por Siempre Hits. The first song to air on Apple Música Uno will be Bad Bunny’s new release, “EL CLúB.” Artists will frequently provide track-by-track breakdowns of their own albums, as well as a look into the songs that have most recently inspired them. On-air talent will speak Spanish and English. Becky G. Rauw Alejandro. Evelyn Sicairos. Lechero. Latin superstar Becky G is the official launch host for Apple Música Uno. Rauw Alejandro will host a special show on Apple Música Uno. Five days a week, Evelyn Sicairos (pictured) and Lechero will host their own flagship playlist shows on Apple Música Uno. Five days a week, Evelyn Sicairos and Lechero (pictured) will host their own flagship playlist shows on Apple Música Uno. “I feel incredibly honored to have my own Apple Music radio show and be the voice of Apple Música Uno, where I can curate some of my favorite tracks and share my experiences with my fans,” said Becky G. “Growing up, I used to watch and listen to music programs that inspired me so much, and I was always in awe of the artists before me. Now, years later, I can’t believe I get to have my own show and hopefully inspire others in the same way. I hope fans will tune in, laugh with us, enjoy some great music, discover new tracks they haven’t heard before, and leave feeling inspired.” Introducing Apple Music Club Apple Music Club is home to anyone who loves dance and electronic music, as well as club culture. But it’s also more ambitious than that. Whether in Berlin or Brooklyn, London or Tokyo, every party or club night must end at some point. It won’t on Apple Music Club, where mixes from the globe’s most important and forward-thinking DJs and dance floors will be thoughtfully curated into a set that is fully alive, and happening around the clock, every day of the year. Tim Sweeney and NAINA will act as guides, providing context around each mix, which will cover a full spectrum of sounds, from the festival circuit to the underground — all of them also available at any time as DJ Mixes on Apple Music. FKA twigs. Honey Dijon. Jamie xx. New and exclusive mixes from premiere dance and electronic artists and DJs including FKA twigs will launch on Apple Music Club. New and exclusive mixes from premiere dance and electronic artists and DJs including Honey Dijon will launch on Apple Music Club. New and exclusive mixes from premiere dance and electronic artists and DJs including Jamie xx will launch on Apple Music Club. To kick off the never-ending party, Sweeney will play the iconic club track “Big Fun” by the pivotal electronic dance music band Inner City. New and exclusive mixes from Honey Dijon, Jamie xx, FKA twigs, and Nia Archives have also been confirmed, in addition to sets from Apple Music curators Circoloco, Tomorrowland, The Warehouse Project, fabric, Hï Ibiza, Stone Island Sound, and many more. “My show is a series of recordings taken from The Floor, a club that I opened for 10 days in London in May 2024,” said Jamie xx. “I invited all my friends and collaborators down to play sets alongside me. Some of my favorite DJs and artists appear in these sets, so I’m very grateful to them, and I’m so glad to be able to have all these sets here in one place for listeners on Apple Music.” Introducing Apple Music Chill Apple Music Chill is an escape, a refuge, a sanctuary in sound — a place listeners can turn to throughout their day. It’s a radio station committed to a mood. Programming will be a continuous flow of chill highlights across genres, interspersed with mindful moments meant to remind listeners to make the time to find center and calm. The aim is to offer respite through expert curation, a place where listeners can feel at ease at any time. Apple Music Chill will kick off with the exclusive premiere of Beck’s new recording of George Harrison’s “Be Here Now,” the first song to air on the station. Listeners will also find the velvety tones of discerning tastemakers like Brian Eno, Stephan Moccio, and Zane Lowe expertly taking them through stories of calm and wellbeing in their own hosted shows, while Apple Music’s Sabi will act as station guide throughout the week. On Apple Music Chill, listeners will hear stories of calm and wellbeing from tastemaker Stephan Moccio and others during their own hosted shows. “All my listening life I’ve been drawn to the slower, quieter, more mysterious end of the musical spectrum,” said Eno. “My radio show gives me the chance to share with others some of the things I’ve found there.” Radio has a dedicated destination across all of the Apple Music ecosystem. Apple Music listeners can find a newly updated Radio tab, which will make interviews and shows hosted by artists across all stations easier than ever to discover. Over the past decade, Apple Music Radio’s state-of-the-art studios in Los Angeles, New York, Nashville, London, Paris, and Berlin have become a welcome and key destination for both established and emerging artists from around the world to release new music, break news, and speak directly to their fans. Fans can enjoy Apple Music Radio wherever they listen to Apple Music, including iPhone, iPad, CarPlay, Apple Watch, Apple TV, Mac, HomePod, and on the web at music.apple.com. They can also ask Siri to play Apple Música Uno, Apple Music Club, and Apple Music Chill, in addition to Apple Music 1, Apple Music Hits, and Apple Music Country.",
  "image": "https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/tile/Apple-Music-Radio-lp.jpg.og.jpg?202412101401",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\t\n    \n\n\n\n\n\n\n\n \n\u003cnav id=\"ac-localnav\" lang=\"en-US\" role=\"navigation\" aria-label=\"Newsroom\" data-analytics-region=\"local nav\" data-sticky=\"\"\u003e\n\t\n    \n    \n        \n\n\n\n\n    \n    \n    \n\t\n\t\n\n\u003c/nav\u003e\n\n\n\n\n\n\u003cmain id=\"main\" role=\"main\"\u003e \n\n\n\n\n\u003cspan id=\"opens-in-new-window\"\u003eopens in new window\u003c/span\u003e\n\u003csection\u003e\n\u003carticle data-analytics-activitymap-region-id=\"article\"\u003e\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \u003cdiv\u003e\n        \n\t\t\n        \u003cdiv\u003e\n                    \n                    \n                        \u003cspan\u003ePRESS RELEASE\u003c/span\u003e\n                    \n                    \n                        \u003cspan\u003eDecember 10, 2024\u003c/span\u003e\n                    \n                    \n                \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                \n                    \u003ch2\u003e\n                        \n    \n        Apple Music expands live global radio offering with three brand-new stations\n    \n\n                    \u003c/h2\u003e\n                \n            \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                    The new Apple Música Uno, Apple Music Club, and Apple Music Chill live-hosted radio stations offer listeners more exclusive shows from some of the world’s most vital artists, including Becky G, Rauw Alejandro, Grupo Frontera, Honey Dijon, Jamie xx, FKA twigs, Nia Archives, Brian Eno, Stephan Moccio, and more\n                \n            \u003c/div\u003e\n\n        \n            \n    \n    \n    \n    \n    \n\n        \n\n    \u003c/div\u003e\n\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, The branding for Apple Music’s new radio stations.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                Apple Music introduces three new radio stations: Apple Música Uno, Apple Music Club, and Apple Music Chill.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Radio.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Radio_big\" aria-label=\"Download media, The branding for Apple Music’s new radio stations.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cspan\u003eCUPERTINO, CALIFORNIA\u003c/span\u003e \u003c/strong\u003eApple today launched three new live global radio stations on Apple Music. Music fans around the world can now tune in to Apple Música Uno, Apple Music Club, and Apple Music Chill — in addition to Apple Music 1, Apple Music Hits, and Apple Music Country — and listen to live-hosted radio for free, without a subscription, on \u003ca href=\"https://music.apple.com/us/radio/\" target=\"_blank\"\u003eApple Music Radio\u003c/a\u003e.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e“Apple Music Radio is the beating heart of our service, representing the intersection of exceptional human voices and curation with cutting-edge technology that shapes and influences culture,” said Oliver Schusser, Apple’s vice president of Music, Sports, and Beats. “We put a lot of time and care into making sure these new radio stations are really bespoke, highly curated, and hosted by some of the world’s best music commentators with unique programming that we know our listeners will love.”\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eSince launching in 2015, the award-winning Apple Music Radio has become the home for exclusive programming by top global music experts and content that music lovers can’t find anywhere else — from interviews with the biggest artists on the planet across genres, to shows hosted and shaped by the artists themselves.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e“Music is crucial to our health and happiness, and what Apple Music Radio brings is a sense that your music is always there for you, always on, and waiting for you to just tap in,” said Zane Lowe, Apple Music’s global creative director and lead anchor for Apple Music 1. “In a world of AI and algorithms, Apple Music Radio is live. It’s real people, it’s a shared event, and I’m so excited to be broadening that experience to listeners worldwide with three new stations.”\n\u003c/div\u003e\n                 \n             \n                 \u003ch2\u003e\u003cstrong\u003eIntroducing Apple Música Uno\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003e\u003ca href=\"https://music.apple.com/us/station/ra.1740613864/\" target=\"_blank\"\u003eApple Música Uno\u003c/a\u003e speaks directly to the wealth of stylistic diversity in Latin music around the world. The focus will always be on music, specifically what’s new, current, and moving culture — from Música Mexicana and reggaetón, to tropical, Latin pop, and more. Latin superstar Becky G is the station’s official launch host, and fellow luminaries Rauw Alejandro and Grupo Frontera will host special shows of their own. On a daily basis, listeners will be welcomed by Evelyn Sicairos and Lechero, two prominent radio personalities whose passion for music and drawing cross-cultural connections will set the tone and energy for the station as a whole. They will each host their own flagship playlist show five days a week, with Sicairos helming La Oficial Radio, and Lechero taking over ¡Dale Play! Radio. Additional programming will include Puro Pop Radio, informed by the beloved playlist of the same name, while weekend programming will take cues from Cumbia Pa’ La Fiesta, Canciones Caras, and Por Siempre Hits.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eThe first song to air on Apple Música Uno will be Bad Bunny’s new release, “EL CLúB.” Artists will frequently provide track-by-track breakdowns of their own albums, as well as a look into the songs that have most recently inspired them. On-air talent will speak Spanish and English.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n    \n        \n        \n        \n            \u003cdiv role=\"group\" aria-label=\"gallery\" data-component-list=\"MixinGallery\" id=\"apple-musica-uno-radio-hosts\"\u003e\n            \u003cnav role=\"presentation\"\u003e\n                \u003cul role=\"tablist\"\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-cb2c18224e424106d9108fd2aed1de9d\" href=\"#gallery-cb2c18224e424106d9108fd2aed1de9d\" data-ac-gallery-trigger=\"gallery-cb2c18224e424106d9108fd2aed1de9d\"\u003e\u003cspan\u003eBecky G.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-55964ec4cf1fd9eec9d2272a41551403\" href=\"#gallery-55964ec4cf1fd9eec9d2272a41551403\" data-ac-gallery-trigger=\"gallery-55964ec4cf1fd9eec9d2272a41551403\"\u003e\u003cspan\u003eRauw Alejandro.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-43ab5d5abe6f433fbfddd52be06b4871\" href=\"#gallery-43ab5d5abe6f433fbfddd52be06b4871\" data-ac-gallery-trigger=\"gallery-43ab5d5abe6f433fbfddd52be06b4871\"\u003e\u003cspan\u003eEvelyn Sicairos.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-ccca1aeb1cd338b665bd2f471f2150ec\" href=\"#gallery-ccca1aeb1cd338b665bd2f471f2150ec\" data-ac-gallery-trigger=\"gallery-ccca1aeb1cd338b665bd2f471f2150ec\"\u003e\u003cspan\u003eLechero.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                \u003c/ul\u003e\n            \u003c/nav\u003e\n            \u003cdiv\u003e\n                \n                    \n                        \n                        \u003cdiv id=\"gallery-cb2c18224e424106d9108fd2aed1de9d\" aria-labelledby=\"gallery-dotnav-cb2c18224e424106d9108fd2aed1de9d\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:becky-g\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eLatin superstar Becky G is the official launch host for Apple Música Uno.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Becky-G.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Becky-G_big\" aria-label=\"Download media, Becky G.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-55964ec4cf1fd9eec9d2272a41551403\" aria-labelledby=\"gallery-dotnav-55964ec4cf1fd9eec9d2272a41551403\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:rauw-alejandro\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eRauw Alejandro will host a special show on Apple Música Uno.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Rauw-Alejandro.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Rauw-Alejandro_big\" aria-label=\"Download media, Rauw Alejandro.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-43ab5d5abe6f433fbfddd52be06b4871\" aria-labelledby=\"gallery-dotnav-43ab5d5abe6f433fbfddd52be06b4871\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:evelyn-sicairos\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eFive days a week, Evelyn Sicairos (pictured) and Lechero will host their own flagship playlist shows on Apple Música Uno. \u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Evelyn-Sicairos.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Evelyn-Sicairos_big\" aria-label=\"Download media, Evelyn Sicairos.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-ccca1aeb1cd338b665bd2f471f2150ec\" aria-labelledby=\"gallery-dotnav-ccca1aeb1cd338b665bd2f471f2150ec\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:lechero\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eFive days a week, Evelyn Sicairos and Lechero (pictured) will host their own flagship playlist shows on Apple Música Uno.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Lechero.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Lechero_big\" aria-label=\"Download media, Lechero.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n            \u003c/div\u003e\n            \n                \n                \n                \u003cnav role=\"presentation\"\u003e\n                    \n                        \u003cul\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                        \u003c/ul\u003e\n                    \n                \u003c/nav\u003e\n            \n        \u003c/div\u003e\n    \n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003e“I feel incredibly honored to have my own Apple Music radio show and be the voice of Apple Música Uno, where I can curate some of my favorite tracks and share my experiences with my fans,” said Becky G. “Growing up, I used to watch and listen to music programs that inspired me so much, and I was always in awe of the artists before me. Now, years later, I can’t believe I get to have my own show and hopefully inspire others in the same way. I hope fans will tune in, laugh with us, enjoy some great music, discover new tracks they haven’t heard before, and leave feeling inspired.”\n\u003c/div\u003e\n                 \n             \n                 \u003ch2\u003e\u003cstrong\u003eIntroducing Apple Music Club\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003e\u003ca href=\"https://music.apple.com/us/station/ra.1740613859/\" target=\"_blank\"\u003eApple Music Club\u003c/a\u003e is home to anyone who loves dance and electronic music, as well as club culture. But it’s also more ambitious than that. Whether in Berlin or Brooklyn, London or Tokyo, every party or club night must end at some point. It won’t on Apple Music Club, where mixes from the globe’s most important and forward-thinking DJs and dance floors will be thoughtfully curated into a set that is fully alive, and happening around the clock, every day of the year. Tim Sweeney and NAINA will act as guides, providing context around each mix, which will cover a full spectrum of sounds, from the festival circuit to the underground — all of them also available at any time as DJ Mixes on Apple Music.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n    \n        \n        \n        \n            \u003cdiv role=\"group\" aria-label=\"gallery\" data-component-list=\"MixinGallery\" id=\"apple-music-club-hosts\"\u003e\n            \u003cnav role=\"presentation\"\u003e\n                \u003cul role=\"tablist\"\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-a4a47324a288a88f8e70b3cecebc3c3f\" href=\"#gallery-a4a47324a288a88f8e70b3cecebc3c3f\" data-ac-gallery-trigger=\"gallery-a4a47324a288a88f8e70b3cecebc3c3f\"\u003e\u003cspan\u003eFKA twigs.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-c9bb4339290053b465bfda975c11d802\" href=\"#gallery-c9bb4339290053b465bfda975c11d802\" data-ac-gallery-trigger=\"gallery-c9bb4339290053b465bfda975c11d802\"\u003e\u003cspan\u003eHoney Dijon.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-d756c241b52a165493bd2c316da82122\" href=\"#gallery-d756c241b52a165493bd2c316da82122\" data-ac-gallery-trigger=\"gallery-d756c241b52a165493bd2c316da82122\"\u003e\u003cspan\u003eJamie xx.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                \u003c/ul\u003e\n            \u003c/nav\u003e\n            \u003cdiv\u003e\n                \n                    \n                        \n                        \u003cdiv id=\"gallery-a4a47324a288a88f8e70b3cecebc3c3f\" aria-labelledby=\"gallery-dotnav-a4a47324a288a88f8e70b3cecebc3c3f\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:fka-twigs\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eNew and exclusive mixes from premiere dance and electronic artists and DJs including FKA twigs will launch on Apple Music Club.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-FKA-twigs.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-FKA-twigs_big\" aria-label=\"Download media, FKA twigs.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-c9bb4339290053b465bfda975c11d802\" aria-labelledby=\"gallery-dotnav-c9bb4339290053b465bfda975c11d802\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:honey-dijon\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eNew and exclusive mixes from premiere dance and electronic artists and DJs including Honey Dijon will launch on Apple Music Club.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Honey-Dijon.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Honey-Dijon_big\" aria-label=\"Download media, Honey Dijon.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-d756c241b52a165493bd2c316da82122\" aria-labelledby=\"gallery-dotnav-d756c241b52a165493bd2c316da82122\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:jamie-xx\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eNew and exclusive mixes from premiere dance and electronic artists and DJs including Jamie xx will launch on Apple Music Club.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Jamie-xx.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Jamie-xx_big\" aria-label=\"Download media, Jamie xx.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n            \u003c/div\u003e\n            \n                \n                \n                \u003cnav role=\"presentation\"\u003e\n                    \n                        \u003cul\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                        \u003c/ul\u003e\n                    \n                \u003c/nav\u003e\n            \n        \u003c/div\u003e\n    \n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003eTo kick off the never-ending party, Sweeney will play the iconic club track “Big Fun” by the pivotal electronic dance music band Inner City. New and exclusive mixes from Honey Dijon, Jamie xx, FKA twigs, and Nia Archives have also been confirmed, in addition to sets from Apple Music curators Circoloco, Tomorrowland, The Warehouse Project, fabric, Hï Ibiza, Stone Island Sound, and many more.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e“My show is a series of recordings taken from The Floor, a club that I opened for 10 days in London in May 2024,” said Jamie xx. “I invited all my friends and collaborators down to play sets alongside me. Some of my favorite DJs and artists appear in these sets, so I’m very grateful to them, and I’m so glad to be able to have all these sets here in one place for listeners on Apple Music.”\n\u003c/div\u003e\n                 \n             \n                 \u003ch2\u003e\u003cstrong\u003eIntroducing Apple Music Chill\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003e\u003ca href=\"https://music.apple.com/us/station/ra.1740614260/\" target=\"_blank\"\u003eApple Music Chill\u003c/a\u003e is an escape, a refuge, a sanctuary in sound — a place listeners can turn to throughout their day. It’s a radio station committed to a mood. Programming will be a continuous flow of chill highlights across genres, interspersed with mindful moments meant to remind listeners to make the time to find center and calm. The aim is to offer respite through expert curation, a place where listeners can feel at ease at any time.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApple Music Chill will kick off with the exclusive premiere of Beck’s new recording of George Harrison’s “Be Here Now,” the first song to air on the station. Listeners will also find the velvety tones of discerning tastemakers like Brian Eno, Stephan Moccio, and Zane Lowe expertly taking them through stories of calm and wellbeing in their own hosted shows, while Apple Music’s Sabi will act as station guide throughout the week.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, Stephan Moccio.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                On Apple Music Chill, listeners will hear stories of calm and wellbeing from tastemaker Stephan Moccio and others during their own hosted shows.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/12/apple-music-expands-live-global-radio-offering-with-three-brand-new-stations/article/Apple-Music-Stephan-Moccio.zip\" download=\"\" data-analytics-title=\"download image - Apple-Music-Stephan-Moccio_big\" aria-label=\"Download media, Stephan Moccio.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003e“All my listening life I’ve been drawn to the slower, quieter, more mysterious end of the musical spectrum,” said Eno. “My radio show gives me the chance to share with others some of the things I’ve found there.”\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eRadio has a dedicated destination across all of the Apple Music ecosystem. Apple Music listeners can find a newly updated Radio tab, which will make interviews and shows hosted by artists across all stations easier than ever to discover.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eOver the past decade, Apple Music Radio’s state-of-the-art studios in Los Angeles, New York, Nashville, London, Paris, and Berlin have become a welcome and key destination for both established and emerging artists from around the world to release new music, break news, and speak directly to their fans.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eFans can enjoy \u003ca href=\"https://music.apple.com/us/radio/\" target=\"_blank\"\u003eApple Music Radio\u003c/a\u003e wherever they listen to Apple Music, including iPhone, iPad, CarPlay, Apple Watch, Apple TV, Mac, HomePod, and on the web at \u003ca href=\"https://music.apple.com/\" target=\"_blank\"\u003emusic.apple.com\u003c/a\u003e. They can also ask Siri to play Apple Música Uno, Apple Music Club, and Apple Music Chill, in addition to Apple Music 1, Apple Music Hits, and Apple Music Country.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n    \n    \n        \n    \n\n\n    \n    \n    \n\n\n\n    \n    \n    \n\n\n\n\n    \n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\u003c/article\u003e\n\n\n\n\u003c/section\u003e\n\u003c/main\u003e\n\n\n\t\n\n\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": null,
  "modifiedTime": null
}
