{
  "id": "f6553182-1464-4c52-9a68-dad0b7f8fba1",
  "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
  "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
  "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
  "author": "Mitchel Broussard",
  "published": "Mon, 13 Sep 2021 06:36:38 PDT",
  "source": "http://feeds.macrumors.com/MacRumors-Mac",
  "categories": [
    "Deals"
  ],
  "byline": "Mitchel Broussard",
  "length": 4866,
  "excerpt": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model...",
  "siteName": "MacRumors",
  "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png",
  "text": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook. Popular StoriesiOS 19 Expected to Run on These iPhonesMonday March 31, 2025 5:28 pm PDT by Juli CloveriOS 19 will not be available on the iPhone XR, iPhone XS, or the iPhone XS Max, according a private account on social media site X that has accurately provided information on device compatibility in the past. The iPhone XR, iPhone XS, and iPhone XS Max all have an A12 Bionic chip, so it looks like iOS 19 will discontinue support for that chip. All other iPhones that run iOS 18 are expected...Apple Releases iOS 18.4 With Priority Notifications, Ambient Music, New Emoji and MoreMonday March 31, 2025 10:03 am PDT by Juli CloverApple today released iOS 18.4 and iPadOS 18.4, the fourth major updates to the iOS 18 and iPadOS 18 operating system updates that came out last year. iOS 18.4 and iPadOS 18.4 come two months after Apple released iOS 18.3 and iPadOS 18.3. Subscribe to the MacRumors YouTube channel for more videos. The new software can be downloaded on eligible iPhones and iPads over-the-air by going to...Apple Releases New Firmware for AirPods Pro 2 and AirPods 4Monday March 31, 2025 11:27 am PDT by Juli CloverApple today released new firmware updates for all AirPods 4 and AirPods Pro 2 models. The new firmware is version 7E93, up from the 7B21 firmware that was installed on the AirPods Pro 2 and the 7B20 firmware available on the AirPods 4 and AirPods 4 with ANC. It is not immediately clear what new features or changes are included in the new firmware, but we'll update this article should we find ...Apple Releases watchOS 11.4 With Sleep Alarm UpdateTuesday April 1, 2025 10:34 am PDT by Juli CloverApple today released watchOS 11.4, the fourth major update to the operating system that runs on the Apple Watch. watchOS 11.4 is compatible with the Apple Watch Series 6 and later, all Apple Watch Ultra models, and the Apple Watch SE 2. watchOS 11.4 can be downloaded on a connected iPhone by opening up the Apple Watch app and going to General \u003e Software Update. To install the new software,...Apple Releases macOS Sequoia 15.4 With Mail Categorization and MoreMonday March 31, 2025 10:04 am PDT by Juli CloverApple today released macOS Sequoia 15.4, the fourth major update to the macOS Sequoia operating system that launched in September. macOS Sequoia 15.4 comes two months after the launch of macOS Sequoia 15.3. Mac users can download the ‌‌macOS Sequoia‌‌ update through the Software Update section of System Settings. It is available for free on all Macs able to run macOS 15. With...iPhone 17 Pro Launching Later This Year With These 10 New FeaturesWhile the iPhone 17 Pro and iPhone 17 Pro Max are not expected to launch until September, there are already plenty of rumors about the devices. Below, we recap key changes rumored for the iPhone 17 Pro models as of March 2025: Aluminum frame: iPhone 17 Pro models are rumored to have an aluminum frame, whereas the iPhone 15 Pro and iPhone 16 Pro models have a titanium frame, and the iPhone ...Apple Releases New AirPods Max Firmware With Lossless and Low-Latency Audio Support [Updated]Monday March 31, 2025 3:49 pm PDT by Juli CloverUpdate 4/2/25: Apple has updated an AirPods support page to indicate that the AirPods Max (USB-C) firmware update version 7E99 is now \"coming soon.\" The original article continues below. Apple today released a new firmware update for the USB-C version of the AirPods Max headphones. The new firmware is version 7E99, up from the prior 7A291 firmware the device was previously running....",
  "image": "https://images.macrumors.com/t/9Sa68cMYP1DLwHamGeVb0dRPRMY=/2500x/article-new/2021/04/macbook-air-deals.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv role=\"main\" id=\"maincontent\"\u003e\u003carticle expanded=\"true\"\u003e\u003cdiv data-io-article-url=\"/2021/09/13/deals-amazon-macbook-air-2/\"\u003e\u003cp\u003eAmazon today is offering the 512GB M1 MacBook Air for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5M9XBS%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$1,099.99\u003c/strong\u003e\u003c/a\u003e, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it\u0026#39;s available in Gold and Silver.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy\" srcset=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy 400w,https://images.macrumors.com/t/K0aDXrJhDYmcsM5dsMYhO23MLxo=/800x0/article-new/2021/04/macbook-air-deals.jpg?lossy 800w,https://images.macrumors.com/t/BNjM-RjcmVeGK4nvQG5buw8GXSQ=/1600x0/article-new/2021/04/macbook-air-deals.jpg 1600w,https://images.macrumors.com/t/FP6PIrD5W934MeDN0XePBDH7MWM=/2500x0/filters:no_upscale()/article-new/2021/04/macbook-air-deals.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"macbook air deals\" width=\"2500\" height=\"1406\"/\u003e\u003cem\u003e\u003csmall\u003eNote: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.\u003c/small\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou\u0026#39;ll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order\u003c/strong\u003e. Only the Gold color is available to ship today, while the Silver option won\u0026#39;t be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date.\u003c/p\u003e\n\n\u003cp\u003eThe 256GB model is on sale as well, available for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5LNQCX%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$849.99\u003c/strong\u003e\u003c/a\u003e, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we\u0026#39;ve ever tracked for the 256GB MacBook Air, so if you\u0026#39;re willing to wait a few weeks, it\u0026#39;s worth locking in this price while it\u0026#39;s available.\u003c/p\u003e\n\u003cp\u003eYou can find even more discounts on other MacBooks by visiting our \u003ca href=\"https://www.macrumors.com/guide/macbook-pro-air-deals/\"\u003eBest Deals guide\u003c/a\u003e for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you\u0026#39;re shopping for a new Apple notebook.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003cp\u003e\u003ch2\u003ePopular Stories\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/03/31/ios-19-expected-to-run-on-these-iphones/\"\u003eiOS 19 Expected to Run on These iPhones\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday March 31, 2025 5:28 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eiOS 19 will not be available on the iPhone XR, iPhone XS, or the iPhone XS Max, according a private account on social media site X that has accurately provided information on device compatibility in the past.\nThe iPhone XR, iPhone XS, and iPhone XS Max all have an A12 Bionic chip, so it looks like iOS 19 will discontinue support for that chip. All other iPhones that run iOS 18 are expected...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/03/31/apple-releases-ios-18-4/\"\u003eApple Releases iOS 18.4 With Priority Notifications, Ambient Music, New Emoji and More\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday March 31, 2025 10:03 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple today released iOS 18.4 and iPadOS 18.4, the fourth major updates to the iOS 18 and iPadOS 18 operating system updates that came out last year. iOS 18.4 and iPadOS 18.4 come two months after Apple released iOS 18.3 and iPadOS 18.3.\nSubscribe to the MacRumors YouTube channel for more videos. \nThe new software can be downloaded on eligible iPhones and iPads over-the-air by going to...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/03/31/apple-releases-airpods-firmware-7e93/\"\u003eApple Releases New Firmware for AirPods Pro 2 and AirPods 4\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday March 31, 2025 11:27 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple today released new firmware updates for all AirPods 4 and AirPods Pro 2 models. The new firmware is version 7E93, up from the 7B21 firmware that was installed on the AirPods Pro 2 and the 7B20 firmware available on the AirPods 4 and AirPods 4 with ANC.\nIt is not immediately clear what new features or changes are included in the new firmware, but we\u0026#39;ll update this article should we find ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/01/apple-releases-watchos-11-update/\"\u003eApple Releases watchOS 11.4 With Sleep Alarm Update\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eTuesday April 1, 2025 10:34 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple today released watchOS 11.4, the fourth major update to the operating system that runs on the Apple Watch. watchOS 11.4 is compatible with the Apple Watch Series 6 and later, all Apple Watch Ultra models, and the Apple Watch SE 2.\nwatchOS 11.4 can be downloaded on a connected iPhone by opening up the Apple Watch app and going to General \u0026gt; Software Update. To install the new software,...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/03/31/apple-releases-macos-sequoia-15-4/\"\u003eApple Releases macOS Sequoia 15.4 With Mail Categorization and More\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday March 31, 2025 10:04 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple today released macOS Sequoia 15.4, the fourth major update to the macOS Sequoia operating system that launched in September. macOS Sequoia 15.4 comes two months after the launch of macOS Sequoia 15.3.\nMac users can download the ‌‌macOS Sequoia‌‌ update through the Software Update section of System Settings. It is available for free on all Macs able to run macOS 15.\nWith...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/03/23/iphone-17-pro-10-rumored-features/\"\u003eiPhone 17 Pro Launching Later This Year With These 10 New Features\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eWhile the iPhone 17 Pro and iPhone 17 Pro Max are not expected to launch until September, there are already plenty of rumors about the devices.\nBelow, we recap key changes rumored for the iPhone 17 Pro models as of March 2025:\nAluminum frame: iPhone 17 Pro models are rumored to have an aluminum frame, whereas the iPhone 15 Pro and iPhone 16 Pro models have a titanium frame, and the iPhone ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/03/31/apple-airpods-max-firmware-7e99/\"\u003eApple Releases New AirPods Max Firmware With Lossless and Low-Latency Audio Support [Updated]\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday March 31, 2025 3:49 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUpdate 4/2/25: Apple has updated an AirPods support page to indicate that the AirPods Max (USB-C) firmware update version 7E99 is now \u0026#34;coming soon.\u0026#34; The original article continues below.\n\nApple today released a new firmware update for the USB-C version of the AirPods Max headphones. The new firmware is version 7E99, up from the prior 7A291 firmware the device was previously running....\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2021-09-13T06:36:38-07:00",
  "modifiedTime": null
}
