{
  "id": "f774888a-5d68-4c59-9bec-a509bb609796",
  "title": "iPhone 17 - Eight upgrade-worthy features rumored for fall 2025",
  "link": "https://appleinsider.com/articles/25/02/09/iphone-17---eight-upgrade-worthy-features-rumored-for-fall-2025?utm_medium=rss",
  "description": "We're halfway to the launch of the iPhone 17 lineup. Here are the most compelling rumors so far that may push you to upgrade.An iPhone 17 Pro concept. Source: @asherdippsSeptember is iPhone season. This year, rumors say we'll see iPhone 17, iPhone 17 \"Air,\" iPhone 17 Pro, and iPhone 17 Pro Max.Rumors have been swirling fast this year about the upcoming models. With many pro-level features trickling down and redesigns in the works, it's going to be an interesting cycle. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Andrew O'Hara",
  "published": "Sun, 09 Feb 2025 19:35:20 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Andrew O'Hara",
  "length": 8044,
  "excerpt": "We're halfway to the launch of the iPhone 17 lineup. Here are the most compelling rumors so far that may push you to upgrade.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "We're halfway to the launch of the iPhone 17 lineup. Here are the most compelling rumors so far that may push you to upgrade. September is iPhone season. This year, rumors say we'll see iPhone 17, iPhone 17 \"Air,\" iPhone 17 Pro, and iPhone 17 Pro Max. Rumors have been swirling fast this year about the upcoming models. With many pro-level features trickling down and redesigns in the works, it's going to be an interesting cycle. Of everything we've heard, these are the rumors that been most compelling. This new change may finally put an end to the constant feedback Apple faces every year. The base model phones will no longer be capped at 60Hz. Subscribe to AppleInsider on YouTubeSubscribe to AppleInsider on YouTubeApple will be bringing ProMotion to all iPhone 17 models with the ability to adjust the refresh rate on the fly, up to 120Hz. The comments come every time we talk about or review base models. Many are indignant that a phone would ship with 60Hz in modern times. We've long maintained your average user does not care about this. They don't know their refresh rate, let alone get fired up at how low it is. We still stand by that sentiment. But what this does, is allow those who do care about this to get on a more affordable device. And that's certainly a win. 48MP telephotoApple is finally getting around to upgrading that third camera on iPhone 17 Pro and iPhone 17 Pro Max. Completing the trio of shooters. The new pro-level phones will have three 48MP camerasAll three rear-facing cameras will be 48MP. Right now, only the ultra wide and wide lenses are 48MP while the tele lens is 12MP. This means not only will we get higher resolution zoom shots, but we could get more digital zoom at the same time. You'll be able to crop in and still have a usable image. It's not going to be 100X zoom that are on some Android devices, but this will be more practical and increase the look of all telephoto shots. All-new Air modelOne of the biggest ways Apple will spur upgrades is with a whole new device. Speculatively named the iPhone 17 \"Air\" or iPhone 17 \"Slim.\" This phone will replace the existing Plus model, as it's the lowest performing model of the lineup with reportedly only 8% of iPhone 16 sales. A mockup of the iPhone 17 AirApple will hope to woo customers with a more affordable price point than the Pro duo in a new super-slim design. Recently, Samsung revealed its prototype Galaxy S25 Edge. While not official, it seems to be roughly 5.8mm thick. The iPhone 16 Pro (left) and the rumored thickness of the iPhone 17 Air (right)There's been plenty of speculation on how thick the iPhone 17 Air will be, but the latest say Apple may be targeting a thickness of 5.5mm. Comparably, the iPhone 16 Pro is 8.25mm. 5.5mm would shave off more than a third of this. Before everyone assumes \"Bendgate 2.0\" is coming, Apple tests these things. It knows what people are saying and will be amply prepared. Sure, it will be guaranteed to bend with enough force, but the new design and middle-of-the-road price tag will probably make it incredibly popular. Upgraded cooling systemBefore you skip past the new cooling system, hear us out. It's much more important than its boring name implies. It's no secret that iPhones get very warm, which impacts everything from performance to battery life. Apple finally got serious about this with the iPhone 16 lineup, which does stay cooler than previous models. But the iPhone 17 will go even further with a vapor cooling chamber. These are liquid-filled blocks inside the device that replace a traditional heatsink How vapor cooling chambers work. Source: Celsia Inc.When heated, the liquid evaporates and moves around the chamber as vapor, spreading the heat around. That vapor condenses down to a cooler liquid, which returns to a wick structure to be heated again at the source. If your phone runs cooler, it will charge faster, battery will last longer, it will keep higher sustained performance, and high-end games will maintaining better performance and higher frame rates. A new thermal system doesn't sound like something fun, but — holy smokes — does it have a lot of implications in use. A19 chipsetSpeaking of performance, we'll also have Apple's latest silicon - the A19 and A19 Pro. By the sounds of it, the iPhone 17 and 17 Air will use the A19 while the A19 Pro will be yet again reserved for the iPhone 17 Pro and iPhone 17 Pro Max. Playing Assassin's Creed on iPhone 16 ProEarly on, it seemed the A19 chips would rely on a new 2nm process. But yields aren't up to snuff yet, meaning it may not yet be feasible for Apple to use. Even if Apple doesn't move to 2nm in 2025, the new processors are always one of the reasons to upgrade. They include so many crucial elements of the phone from the Thunderbolt controller for the Pro phones, to the Neural Engine for Apple Intelligence, to the ISP for picture quality. It includes the memory too, which will increase to 12GB on the iPhone 17 Pro Max, sticking with 8GB for the others. Rest assured, Apple will make a big deal about the upgraded performance of the whole iPhone 17 lineup. If you have an older phone, faster may be what you're looking for. Always-on displayBacktracking, we need to revisit that new universal ProMotion display. Everyone talks about the higher 120Hz refresh rate, but equally important is the lower frame rates. This is what enables your phone to save battery life and to even support the always-on display. You'll finally be able to see your battery, widgets, and more while your phone is in its \"off\" state, just like the Pro phones. StandBy mode can be always on for all phonesEven better - StandBy mode will now always be on. Right now, users put their phones in StandBy mode only to have it automatically shut off after a few moments. The only way for it to stay on is for the phone to have an always-on display. And the iPhone 17 and iPhone 17 air will get that. Redesigned Pro modelsEarly on, the purported iPhone 17 Air gave us pause. It was going to have this big redesign, but would be priced below the Pro phones. We'd be surprised if Apple reinvigorated the budget models without also giving some sort of new design to the Pro phones too. Majin Bu shares a rumored redesign coming to the iPhone 17 and iPhone 17 ProAccording to Ming Chi Kuo, and the sometimes reliable Majin Bu, Apple may be doing just that. The two pro-level phones will get a new aesthetic that has a primarily glass back with a metal camera bump on the top. That camera bump will also run the full width of the phone, rather than be left-aligned. This will help visually distinguish them from older models and will be the first change to the back of the iPhone since the iPhone X era. There's been much debate on how this will look, how the cameras will be oriented, but the rumor seems to be catching on as we inch towards release. New front-facing cameraFinally, Apple is also finally ready to upgrade the front-facing camera on all four models. Apple used to use a 7MP camera until the iPhone 11 when it finally moved to a 12MP sensor. But that was the last real upgrade. Now they will all reportedly have 24MP sensors, doubling the resolution. The selfie camera will be getting a long-awaited upgradeSelfies are really important for users. We have many treasured photos ourselves of our partners and kids that while heartwarming, are technically bad photos. They always suffer in low light and 12MP isn't much when the other cameras are all going to be at 48MP. We also love how this won't be gatekept behind the Pro models. More \"Pro\" for lessWe're going to have vapor cooling, promotion, A19 chip, better front-facing camera, and an always-on display for the non-pro phones. That is going to make them a lot more compelling to users. While many will still be excited for the iPhone 17 Pro and iPhone 17 Air, the inclusion of all these \"pro\" features and the iPhone 17 Air, we may see more people upgrade than usual for the lower-cost devices. Stay tuned to find out how things come together.",
  "image": "https://photos5.appleinsider.com/gallery/62570-129756-iPhone-17-Pro-and-Pro-Max-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eWe\u0026#39;re halfway to the launch of the \u003ca href=\"https://appleinsider.com/inside/iphone-17\" title=\"iPhone 17\" data-kpt=\"1\"\u003eiPhone 17\u003c/a\u003e lineup. Here are the most compelling rumors so far that may push you to upgrade.\n\u003c/p\u003e\u003cp\u003eSeptember is \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e season. This year, rumors say we\u0026#39;ll see iPhone 17, iPhone 17 \u0026#34;Air,\u0026#34; iPhone 17 Pro, and iPhone 17 Pro Max.\n\u003c/p\u003e\u003cp\u003eRumors have been swirling fast this year about the upcoming models. With many pro-level features trickling down and redesigns in the works, it\u0026#39;s going to be an interesting cycle.\n\u003c/p\u003e\u003cp\u003eOf everything we\u0026#39;ve heard, these are the rumors that been most compelling.\n\u003c/p\u003e\u003cp\u003eThis new change may finally put an end to the constant feedback Apple faces every year. The base model phones will no longer be capped at 60Hz.\n\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ciframe src=\"https://www.youtube.com/embed/_qtvEBZDxSk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" loading=\"lazy\"\u003e\u003c/iframe\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eApple will be bringing ProMotion to all iPhone 17 models with the ability to adjust the refresh rate on the fly, up to 120Hz.\n\u003c/p\u003e\u003cp\u003eThe comments come every time we talk about or review base models. Many are indignant that a phone would ship with 60Hz in modern times.\n\u003c/p\u003e\u003cp\u003eWe\u0026#39;ve long maintained your average user does not care about this. They don\u0026#39;t know their refresh rate, let alone get fired up at how low it is.\n\u003c/p\u003e\u003cp\u003eWe still stand by that sentiment.\n\u003c/p\u003e\u003cp\u003eBut what this does, is allow those who do care about this to get on a more affordable device. And that\u0026#39;s certainly a win.\n\u003c/p\u003e\u003ch2 data-anchor=\"48mp-telephoto\" id=\"48mp-telephoto\"\u003e48MP telephoto\u003c/h2\u003e\u003cp\u003eApple is finally getting around \u003ca href=\"https://appleinsider.com/articles/25/01/10/rear-iphone-17-pro-cameras-could-all-have-the-same-48mp-resolution\"\u003eto upgrading\u003c/a\u003e that third camera on iPhone 17 Pro and iPhone 17 Pro Max. Completing the trio of shooters.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129753-iPhone-16-Pro-Cameras-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129753-iPhone-16-Pro-Cameras-xl.jpg\" alt=\"A hand holds a smartphone with three camera lenses and a flash, pointing at the rear cameras.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eThe new pro-level phones will have three 48MP cameras\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll three rear-facing cameras will be 48MP. Right now, only the ultra wide and wide lenses are 48MP while the tele lens is 12MP.\n\u003c/p\u003e\u003cp\u003eThis means not only will we get higher resolution zoom shots, but we could get more digital zoom at the same time. You\u0026#39;ll be able to crop in and still have a usable image.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s not going to be 100X zoom that are on some Android devices, but this will be more practical and increase the look of all telephoto shots.\n\u003c/p\u003e\u003ch2 data-anchor=\"allnew-air-model\" id=\"allnew-air-model\"\u003eAll-new Air model\u003c/h2\u003e\u003cp\u003eOne of the biggest ways Apple will spur upgrades is with a whole new device. Speculatively named the iPhone 17 \u0026#34;Air\u0026#34; or iPhone 17 \u0026#34;Slim.\u0026#34;\n\u003c/p\u003e\u003cp\u003eThis phone \u003ca href=\"https://appleinsider.com/articles/25/01/25/apples-2025-iphone-17-slim-may-be-the-first-big-redesign-in-years\"\u003ewill replace\u003c/a\u003e the existing Plus model, as it\u0026#39;s the lowest performing model of the lineup with reportedly only 8% of \u003ca href=\"https://appleinsider.com/inside/iphone-16\" title=\"iPhone 16\" data-kpt=\"1\"\u003eiPhone 16\u003c/a\u003e sales.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129755-iPhone-17-Air-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129755-iPhone-17-Air-xl.jpg\" alt=\"Three modern smartphones in gold, silver, and green, displayed at various angles, showcasing rear cameras and sleek design on a gradient blue background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eA mockup of the iPhone 17 Air\u003c/span\u003e\u003c/p\u003e\u003cp\u003eApple will hope to woo customers with a more affordable price point than the Pro duo in a new super-slim design.\n\u003c/p\u003e\u003cp\u003eRecently, Samsung revealed its prototype Galaxy S25 Edge. While not official, it seems to be roughly 5.8mm thick.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129754-iPhone-16-Pro-vs-iPhone-17-Air-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129754-iPhone-16-Pro-vs-iPhone-17-Air-xl.jpg\" alt=\"Two metallic rectangular objects shown sideways, one thicker at 8.26 mm and one thinner at 5.5 mm, each with a button on the side.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eThe iPhone 16 Pro (left) and the rumored thickness of the iPhone 17 Air (right)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThere\u0026#39;s been plenty of speculation on how thick the iPhone 17 Air will be, but the latest say Apple may be targeting a thickness of 5.5mm.\n\u003c/p\u003e\u003cp\u003eComparably, the iPhone 16 Pro is 8.25mm. 5.5mm would shave off more than a third of this.\n\u003c/p\u003e\u003cp\u003eBefore everyone assumes \u0026#34;Bendgate 2.0\u0026#34; is coming, Apple tests these things. It knows what people are saying and will be amply prepared.\n\u003c/p\u003e\u003cp\u003eSure, it will be guaranteed to bend with enough force, but the new design and middle-of-the-road price tag will probably make it incredibly popular.\n\u003c/p\u003e\u003ch2 data-anchor=\"upgraded-cooling-system\" id=\"upgraded-cooling-system\"\u003eUpgraded cooling system\u003c/h2\u003e\u003cp\u003eBefore you skip past the new cooling system, hear us out. It\u0026#39;s much more important than its boring name implies.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s no secret that iPhones get very warm, which impacts everything from performance to battery life. Apple finally got serious about this with the iPhone 16 lineup, which does stay cooler than previous models.\n\u003c/p\u003e\u003cp\u003eBut the iPhone 17 will go even further with a \u003ca href=\"https://appleinsider.com/articles/25/01/17/iphone-17-rumored-to-get-much-more-powerful-cooling-system\"\u003evapor cooling chamber\u003c/a\u003e. These are liquid-filled blocks inside the device that replace a traditional heatsink\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129760-Vapor-Chambor-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129760-Vapor-Chambor-xl.jpg\" alt=\"Cross-section of a heat pipe showing labeled sections: condenser (heat out), evaporator (heat in), liquid return, and liquid turning to vapor, with arrows indicating flow directions.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eHow vapor cooling chambers work. Source: Celsia Inc.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWhen heated, the liquid evaporates and moves around the chamber as vapor, spreading the heat around. That vapor condenses down to a cooler liquid, which returns to a wick structure to be heated again at the source.\n\u003c/p\u003e\u003cp\u003eIf your phone runs cooler, it will charge faster, battery will last longer, it will keep higher sustained performance, and high-end games will maintaining better performance and higher frame rates.\n\u003c/p\u003e\u003cp\u003eA new thermal system doesn\u0026#39;t sound like something fun, but —  holy smokes —  does it have a lot of implications in use.\n\u003c/p\u003e\u003ch2 data-anchor=\"a19-chipset\" id=\"a19-chipset\"\u003eA19 chipset\u003c/h2\u003e\u003cp\u003eSpeaking of performance, we\u0026#39;ll also have Apple\u0026#39;s latest silicon - the A19 and A19 Pro.\n\u003c/p\u003e\u003cp\u003eBy the sounds of it, the iPhone 17 and 17 Air will use the A19 while the A19 Pro will be yet again reserved for the iPhone 17 Pro and iPhone 17 Pro Max.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129752-Assassins-Creed-on-iPhone-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129752-Assassins-Creed-on-iPhone-xl.jpg\" alt=\"Person holding a smartphone, playing a video game featuring a character navigating a sunlit outdoor marketplace, with text and icons displayed on screen.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003ePlaying Assassin\u0026#39;s Creed on iPhone 16 Pro\u003c/span\u003e\u003c/p\u003e\u003cp\u003eEarly on, it seemed the A19 chips would rely on a new 2nm process. But yields aren\u0026#39;t up to snuff yet, meaning it may not yet be feasible for Apple to use.\n\u003c/p\u003e\u003cp\u003eEven if Apple doesn\u0026#39;t move to 2nm in 2025, the new processors are always one of the reasons to upgrade.\n\u003c/p\u003e\u003cp\u003eThey include so many crucial elements of the phone from the Thunderbolt controller for the Pro phones, to the Neural Engine for \u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e, to the ISP for picture quality.\n\u003c/p\u003e\u003cp\u003eIt includes the memory too, which will increase to 12GB on the iPhone 17 Pro Max, sticking with 8GB for the others.\n\u003c/p\u003e\u003cp\u003eRest assured, Apple will make a big deal about the upgraded performance of the whole iPhone 17 lineup. If you have an older phone, faster may be what you\u0026#39;re looking for.\n\u003c/p\u003e\u003ch2 data-anchor=\"alwayson-display\" id=\"alwayson-display\"\u003eAlways-on display\u003c/h2\u003e\u003cp\u003eBacktracking, we need to revisit that new universal ProMotion display. Everyone talks about the higher 120Hz refresh rate, but equally important is the lower frame rates.\n\u003c/p\u003e\u003cp\u003eThis is what enables your phone to save battery life and to even support the always-on display. You\u0026#39;ll finally be able to see your battery, widgets, and more while your phone is in its \u0026#34;off\u0026#34; state, just like the Pro phones.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129759-StandBy-Mode-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129759-StandBy-Mode-xl.jpg\" alt=\"Smartphone displaying 9:33 with a purple background, surrounded by plants and decor, including playing card art.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eStandBy mode can be always on for all phones\u003c/span\u003e\u003c/p\u003e\u003cp\u003eEven better - StandBy mode will now always be on. Right now, users put their phones in StandBy mode only to have it automatically shut off after a few moments.\n\u003c/p\u003e\u003cp\u003eThe only way for it to stay on is for the phone to have an always-on display. And the iPhone 17 and iPhone 17 air will get that.\n\u003c/p\u003e\u003ch2 data-anchor=\"redesigned-pro-models\" id=\"redesigned-pro-models\"\u003eRedesigned Pro models\u003c/h2\u003e\u003cp\u003eEarly on, the purported iPhone 17 Air gave us pause. It was going to have this big redesign, but would be priced below the Pro phones.\n\u003c/p\u003e\u003cp\u003eWe\u0026#39;d be surprised if Apple reinvigorated the budget models without also giving some sort of new design to the Pro phones too.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129757-Majin-Bu-Redesign-CAD-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129757-Majin-Bu-Redesign-CAD-xl.jpg\" alt=\"Smartphone CAD rendering with a large camera and button layout on a black background. Tweet text and details visible on the left.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eMajin Bu shares a rumored redesign coming to the iPhone 17 and iPhone 17 Pro\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAccording to Ming Chi Kuo, and the sometimes reliable Majin Bu, Apple may be doing just that.\n\u003c/p\u003e\u003cp\u003eThe two pro-level phones will get a new aesthetic that has a primarily glass back with a metal camera bump on the top. That camera bump will also run the full width of the phone, rather than be left-aligned.\n\u003c/p\u003e\u003cp\u003eThis will help visually distinguish them from older models and will be the first change to the back of the iPhone since the iPhone X era.\n\u003c/p\u003e\u003cp\u003eThere\u0026#39;s been much debate on how this will look, how the cameras will be oriented, but the rumor seems to be catching on as we inch towards release.\n\u003c/p\u003e\u003ch2 data-anchor=\"new-frontfacing-camera\" id=\"new-frontfacing-camera\"\u003eNew front-facing camera\u003c/h2\u003e\u003cp\u003eFinally, Apple is also finally ready to upgrade the front-facing camera on all four models. Apple used to use a 7MP camera until the \u003ca href=\"https://appleinsider.com/inside/iphone-11\" title=\"iPhone 11\" data-kpt=\"1\"\u003eiPhone 11\u003c/a\u003e when it finally moved to a 12MP sensor.\n\u003c/p\u003e\u003cp\u003eBut that was the last real upgrade. Now they will all reportedly have 24MP sensors, doubling the resolution. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62570-129758-Selfie-Camera-on-iPhone-16-Pro-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62570-129758-Selfie-Camera-on-iPhone-16-Pro-xl.jpg\" alt=\"Person holding a smartphone capturing a selfie; reflection shows a camera on a tripod beside them.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eThe selfie camera will be getting a long-awaited upgrade\u003c/span\u003e\u003c/p\u003e\u003cp\u003eSelfies are really important for users. We have many treasured photos ourselves of our partners and kids that while heartwarming, are technically bad photos.\n\u003c/p\u003e\u003cp\u003eThey always suffer in low light and 12MP isn\u0026#39;t much when the other cameras are all going to be at 48MP. We also love how this won\u0026#39;t be gatekept behind the Pro models.\n\u003c/p\u003e\u003ch2 data-anchor=\"more-pro-for-less\" id=\"more-pro-for-less\"\u003eMore \u0026#34;Pro\u0026#34; for less\u003c/h2\u003e\u003cp\u003eWe\u0026#39;re going to have vapor cooling, promotion, A19 chip, better front-facing camera, and an always-on display for the non-pro phones. That is going to make them a lot more compelling to users.\n\u003c/p\u003e\u003cp\u003eWhile many will still be excited for the iPhone 17 Pro and iPhone 17 Air, the inclusion of all these \u0026#34;pro\u0026#34; features and the iPhone 17 Air, we may see more people upgrade than usual for the lower-cost devices.\n\u003c/p\u003e\u003cp\u003eStay tuned to find out how things come together.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-02-09T19:35:20Z",
  "modifiedTime": null
}
