{
  "id": "f9191bc5-4b00-4a1e-8404-3ffd591ac9d3",
  "title": "Beta 1 of iOS 18.6 \u0026 MacOS Sequoia 15.6 Released for Testing",
  "link": "https://osxdaily.com/2025/06/16/beta-1-of-ios-18-6-macos-sequoia-15-6-released-for-testing/",
  "description": "Apple has issued the first beta versions of iOS 18.6 for iPhone, iPadOS 18.6 for iPad, and MacOS Sequoia 15.6 for Mac. These beta versions of system software are now concurrent with the next-gen iOS 26, iPadOS 26, and MacOS Tahoe 26 betas, which are also on the first beta. The new beta versions of ... Read More",
  "author": "Jamie Cuevas",
  "published": "Mon, 16 Jun 2025 20:35:05 +0000",
  "source": "http://feeds.feedburner.com/osxdaily",
  "categories": [
    "News",
    "beta",
    "iOS 18 beta",
    "iOS 18.6",
    "iPadOS 18 beta",
    "ipadOS 18.6",
    "MacOS Sequoia 15.6",
    "MacOS Sequoia beta"
  ],
  "byline": "",
  "length": 2057,
  "excerpt": "Apple has issued the first beta versions of iOS 18.6 for iPhone, iPadOS 18.6 for iPad, and MacOS Sequoia 15.6 for Mac. These beta versions of system software are now concurrent with the next-gen iO…",
  "siteName": "OS X Daily",
  "favicon": "https://cdn.osxdaily.com/wp-content/uploads/2019/09/cropped-apple-touch-icon-104-192x192.png",
  "text": "Apple has issued the first beta versions of iOS 18.6 for iPhone, iPadOS 18.6 for iPad, and MacOS Sequoia 15.6 for Mac. These beta versions of system software are now concurrent with the next-gen iOS 26, iPadOS 26, and MacOS Tahoe 26 betas, which are also on the first beta. The new beta versions of system software are intended as point release updates to the current generations of system software, meaning they’ll likely focus on bug fixes and security enhancements, over major new features. It’s possible some minor new features or changes will be included in iOS 18.6 and MacOS Sequoia 15.6, but the majority of new feature efforts are being put towards the iOS 26 and MacOS Tahoe 26 betas instead. If you’re actively enrolled in the beta testing programs for iOS 18 and MacOS Sequoia, you can download the first betas of 18.6 and 15.6 through the standard software update mechanisms. For iPhone and iPad, go to Settings \u003e General \u003e Software Update \u003e Beta Updates \u003e Select ‘iOS 18 Developer Beta’ and then return to Software Update to find the 18.6 beta 1 build. For Mac, go to  Apple menu \u003e System Settings \u003e General \u003e Software Update \u003e Beta Updates \u003e Select “MacOS Sequoia Developer Beta”, and then return to the standard Software Update screen to find MacOS Sequoia 15.6 beta 1 available to download. If you are running iOS 26 beta, iPadOS 26 beta, or macOS Tahoe 26 beta, you will not be able to access or download the iOS 18.6 beta, iPadOS 18.6 beta, or MacOS Seqouia 15.6 beta, at least without downgrading the device first. The majority of beta testers will not find that desirable, since beta interest beyond developers of apps tends to be on testing out new features. Apple usually goes through several releases of beta system software before issuing a final version to the general public. With this in mind, it’s reasonable to expect iOS 18.6, iPadOS 18.6, and MacOS Sequoia 15.6, to be available as final stable builds, sometime next month. Meanwhile, the final versions of iOS 26, iPadOS 26, and MacOS Tahoe 26, will be released this fall.",
  "image": "https://cdn.osxdaily.com/wp-content/uploads/2024/06/betas-ios-18-ipados-18-macos-sequoia-tvos-18-watchos-11.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-610x265.jpg\" alt=\"iOS 18 and MacOS Sequoia public betas\" width=\"610\" height=\"265\" srcset=\"https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-610x265.jpg 610w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-300x130.jpg 300w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-768x333.jpg 768w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-1536x666.jpg 1536w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas.jpg 1618w\" sizes=\"(max-width: 610px) 100vw, 610px\" data-old-src=\"https://cdn.osxdaily.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif\" data-src=\"https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-610x265.jpg\" data-srcset=\"https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-610x265.jpg 610w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-300x130.jpg 300w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-768x333.jpg 768w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas-1536x666.jpg 1536w, https://cdn.osxdaily.com/wp-content/uploads/2024/07/ios-18-macos-sequoia-ipados-18-public-betas.jpg 1618w\"/\u003e\u003c/p\u003e\n\u003cp\u003eApple has issued the first beta versions of iOS 18.6 for iPhone, iPadOS 18.6 for iPad, and MacOS Sequoia 15.6 for Mac. These beta versions of system software are now concurrent with the next-gen \u003ca href=\"https://osxdaily.com/2025/06/10/ios-26-beta-1-download-available-now-for-iphone-ipad/\"\u003eiOS 26, iPadOS 26\u003c/a\u003e, and \u003ca href=\"https://osxdaily.com/2025/06/10/macos-tahoe-26-beta-1-available-to-download-now/\"\u003eMacOS Tahoe 26 beta\u003c/a\u003es, which are also on the first beta.\u003c/p\u003e\n\u003cp\u003eThe new beta versions of system software are intended as point release updates to the current generations of system software, meaning they’ll likely focus on bug fixes and security enhancements, over major new features. It’s possible some minor new features or changes will be included in iOS 18.6 and MacOS Sequoia 15.6, but the majority of new feature efforts are being put towards the iOS 26 and MacOS Tahoe 26 betas instead.\u003c/p\u003e\n\n\u003cp\u003eIf you’re actively enrolled in the beta testing programs for iOS 18 and MacOS Sequoia, you can download the first betas of 18.6 and 15.6 through the standard software update mechanisms.\u003c/p\u003e\n\u003cp\u003eFor iPhone and iPad, go to Settings \u0026gt; General \u0026gt; Software Update \u0026gt; Beta Updates \u0026gt; Select ‘iOS 18 Developer Beta’ and then return to Software Update to find the 18.6 beta 1 build.\u003c/p\u003e\n\u003cp\u003eFor Mac, go to  Apple menu \u0026gt; System Settings \u0026gt; General \u0026gt; Software Update \u0026gt; Beta Updates \u0026gt; Select “MacOS Sequoia Developer Beta”, and then return to the standard Software Update screen to find MacOS Sequoia 15.6 beta 1 available to download.\u003c/p\u003e\n\u003cp\u003eIf you are running iOS 26 beta, iPadOS 26 beta, or macOS Tahoe 26 beta, you will not be able to access or download the iOS 18.6 beta, iPadOS 18.6 beta, or MacOS Seqouia 15.6 beta, at least without downgrading the device first. The majority of beta testers will not find that desirable, since beta interest beyond developers of apps tends to be on testing out new features.\u003c/p\u003e\n\u003cp\u003eApple usually goes through several releases of beta system software before issuing a final version to the general public. With this in mind, it’s reasonable to expect iOS 18.6, iPadOS 18.6, and MacOS Sequoia 15.6, to be available as final stable builds, sometime next month.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the final versions of iOS 26, iPadOS 26, and MacOS Tahoe 26, will be released this fall.\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-16T20:35:05Z",
  "modifiedTime": "2025-06-16T20:35:05Z"
}
