{
  "id": "19be476f-e9f4-4db2-983b-b6e7bc402783",
  "title": "20 Funny Food-Thieving Cattos Who Wouldn’t Last a Day Working at a Pâwtisserie",
  "link": "https://cheezburger.com/40463109/20-funny-food-thieving-cattos-who-wouldnt-last-a-day-working-at-a-pwtisserie",
  "description": "Cats, as we already know would make terrible workers in the hooman world. To begin with they have no boundaries or social awareness, making them poor team players and even worse when they receive negative feedback. Then you have the whole lack of impulse control, which as any factory worker will tell you is a one way ticket to living a short life. And then you add on top of all of this their terribly lacking persistence with regard to their jobs, and you get probably the worst workers on the planet.Especially when you consider that they can be petulantly persistent when it comes to food. So it should come as little surprise that working in a Pâwtisserie would be a poor hiring decision on the part of the owner.",
  "author": "Laurent Shinar",
  "published": "Thu, 08 May 2025 09:00:00 -0700",
  "source": "http://feeds.feedburner.com/icanhascheezburger",
  "categories": [
    "thieves",
    "funny cat pictures",
    "working",
    "cute cats",
    "food",
    "last",
    "wouldnt"
  ],
  "byline": "Laurent Shinar",
  "length": 638,
  "excerpt": "20 Funny Food-Thieving Cattos Who Wouldn’t Last a Day Working at a Pâwtisserie - World's largest collection of cat memes and other animals",
  "siteName": "I Can Has Cheezburger?",
  "favicon": "https://i.chzbgr.com/blob/1/ICHCnew.png",
  "text": "If you have ever tried to stop a cat from stealing your food, you will already know that it is like trying to stop a toddler from grabbing random things, except the toddler is somehow slippery as a seal and can more incredibly quickly. Wack a mole ain’t got nothing on this crazy carnival game. Just look at this lazy thief. For a cat to be caught red-handed rummaging through a plate of food is borderline brain-dead. After all, cats are capable of reacting so fast that they can easily avoid the strike of a snake. So one must question how few brain cells this chonker was born with to be completely unaware that he has been had.",
  "image": "https://i.chzbgr.com/original/40463109/h7BEAC5ED/nugget-in-its-mouth-the-other-image-shows-a-cat-looking-at-a-batch-of-freshly-baked-cupcakes",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eIf you have ever tried to stop a cat from stealing your food, you will already know that it is like trying to stop a toddler from grabbing random things, except the toddler is somehow slippery as a seal and can more incredibly quickly. Wack a mole ain’t got nothing on this crazy carnival game.\u003c/p\u003e\n\n    \u003c/div\u003e\u003cdiv\u003e\n\n\u003cp\u003eJust look at this lazy thief. For a cat to be caught red-handed rummaging through a plate of food is borderline brain-dead. After all, cats are capable of reacting so fast that they can easily avoid the strike of a snake. So one must question how few brain cells this chonker was born with to be completely unaware that he has been had.\u003c/p\u003e\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-05-08T09:00:00-07:00",
  "modifiedTime": null
}
