{
  "id": "1d6da0a6-e84b-461c-ac7d-98b5ff8fe84f",
  "title": "The Most Calming Song in the World Isn’t Great",
  "link": "https://www.cracked.com/article_44309_the-most-calming-song-in-the-world-isnt-great.html?newsletter-cat=science-history",
  "description": "By Eli Yudin Published: November 10th, 2024",
  "author": "",
  "published": "Sun, 10 Nov 2024 11:00:00 -0800",
  "source": "http://feeds.feedburner.com/CrackedRSS",
  "categories": null,
  "byline": "Eli Yudin",
  "length": 3087,
  "excerpt": "It’s kind of annoying, actually",
  "siteName": "Cracked.com",
  "favicon": "https://ui-seo-5.crackedcdn.com/images/favicon/apple-touch-icon.png?v=f15f646631b9bdcc7e4170607034cb9c",
  "text": "It’s kind of annoying, actually I would say that this week has caused a moderate to high amount of stress. As a man taunted by anxiety even when stuff is going pretty swell, I have my methods of dealing with it. One of them is to listen to calming music, as if I was putting on a playlist for an nervous dog, except in this scenario, my brain is the dog. But these past few days in particular, the usual ambient soundscapes and weird hippie handpan music weren’t cutting it.So I wondered if science had put time into this pursuit, and went to find out what the most calming song in the world is supposed to be.  Don't Miss Sure enough, a study popped up, with an almost too definitive answer. Among their top calming songs were a couple of the artists I expected to see, like Mozart and Enya. The runaway number one calming song, though, was something I’d never heard of. When I listened, I realized that was probably for a good reason. It’s called “Weightless,” and it’s by a British ambient band called Marconi Union. It's supposed to reduce anxiety by 65 percent, apparently specifically in people who aren’t me.It was developed by the band in concert (pun intended) with scientists, and to me, that sounds like a recipe for bias. Supported by the fact that this song isn’t only not calming to me, but vaguely stressful. Right away, you hear a thumping kick drum, and we’re off to a bad start. It sounds like a slightly fast heartbeat, which isn’t generally soothing. If a sound has ever driven a character in an Edgar Allen Poe story insane? Off the “soothing list.” The rest is pretty much par for the course for any music meant to calm the mind — cat-standing-on-a-keyboard extended synth tones, a sporadic tinkling of different bells. Then, just as the bass drum fades out, and you think, “Oh good, they told him to stop,” suddenly, whether it’s coming from the bells or something else, little grinding cymbal sounds pop up. By the time you get halfway through, there are what I would definitely call “too many bells,” and the song seems to be increasing in volume, making me turn it down a little, instead of drifting blissfully through the soundscape.At the 3:52 mark, there’s an isolated sort of high-pitched whistle, and this song is officially stressing me out. By 5:35, they are whatever the ambient version of wailing on their instruments is. I’d describe what I’m hearing as the world’s quietest cacophony, like a monk carrying a bunch of prayer bowls just tripped and fell next to a lake. The cherry on top? The music video for the song features a fleet of drones, which just mostly makes me think about both the surveillance state and/or modern war. The last shot is one drone hovering and staring directly into camera, because nothing is more peaceful than “being watched.”In summation, if you’re stressed out and need a song to center you, don’t listen to scientists or their stupid anxiety-curing songs, just stick with Willie Nelson. Now that’s the good stuff. Scroll down for the next article SIGN UP FORA WEEKLYNEWSLETTER OF JOKES + TRIVIA",
  "image": "https://s3.crackedcdn.com/phpimages/article/1/9/4/1183194.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"content-wrapper\" data-content-index=\"1\" data-content-id=\"44309\" data-content-type=\"article\" data-content-form=\"short\" data-content-rating=\"pg\"\u003e\n\u003cdiv\u003e\n\u003csection\u003e\n\n\u003cp\u003e\nIt’s kind of annoying, actually\n\u003c/p\u003e\n\u003cfigure\u003e \u003cpicture\u003e \u003csource media=\"(min-width: 700px)\" srcset=\"https://s3.crackedcdn.com/phpimages/article/1/9/4/1183194_800x450.jpg\"/\u003e \u003csource media=\"(min-width: 320px)\" srcset=\"https://s3.crackedcdn.com/phpimages/article/1/9/4/1183194_320x180.jpg\"/\u003e \u003cimg src=\"https://s3.crackedcdn.com/phpimages/article/1/9/4/1183194_320x180.jpg\" alt=\"The Most Calming Song in the World Isn’t Great\"/\u003e \u003c/picture\u003e \u003c/figure\u003e  \u003c/section\u003e \u003carticle\u003e\u003cp\u003eI would say that this week has caused a moderate to high amount of stress. As a man taunted by anxiety even when stuff is going pretty swell, I have my methods of dealing with it. One of them is to listen to calming music, as if I was putting on a playlist for an nervous dog, except in this scenario, my brain is the dog. But these past few days in particular, the usual ambient soundscapes and weird hippie handpan music weren\u003cspan\u003e’\u003c/span\u003et cutting it.\u003c/p\u003e\u003cp\u003eSo I wondered if science had put time into this pursuit, and went to find out what the most calming song in the world is supposed to be. \u003c/p\u003e\u003csection\u003e \u003cheader\u003e \u003ch2\u003eDon\u0026#39;t Miss\u003c/h2\u003e \u003c/header\u003e  \u003c/section\u003e\u003cp\u003eSure enough, a study popped up, with an almost \u003ci\u003etoo \u003c/i\u003edefinitive answer. Among their top calming songs were a couple of the artists I expected to see, \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.wnycstudios.org/podcasts/takeaway/articles/199541-scientists-identify-most-relaxing-song-ever-produced\"\u003elike Mozart and Enya\u003c/a\u003e. The runaway number one calming song, though, was something I\u003cspan\u003e’\u003c/span\u003ed never heard of. When I listened, I realized that was probably for a good reason. It\u003cspan\u003e’\u003c/span\u003es called “Weightless,” and it\u003cspan\u003e’\u003c/span\u003es by a British ambient band called Marconi Union. \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.upworthy.com/neuroscientists-say-this-is-the-most-relaxing-song-in-the-world-rp4\"\u003eIt\u0026#39;s supposed to reduce anxiety by 65 percent\u003c/a\u003e, apparently specifically in people who aren\u003cspan\u003e’\u003c/span\u003et me.\u003c/p\u003e\u003cfigure\u003e\u003ciframe data-src=\"https://www.youtube.com/embed/UfcAVejslrU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/figure\u003e\u003cp\u003eIt was developed by the band in concert (pun intended) with scientists, and to me, that sounds like a recipe for bias. Supported by the fact that this song isn\u003cspan\u003e’\u003c/span\u003et only not calming to me, but vaguely stressful. Right away, you hear a thumping kick drum, and we\u003cspan\u003e’\u003c/span\u003ere off to a bad start. It sounds like a slightly fast heartbeat, which isn\u003cspan\u003e’\u003c/span\u003et generally soothing. If a sound has ever driven a character in an Edgar Allen Poe story insane? Off the “soothing list.”\u003c/p\u003e  \u003cp\u003eThe rest is pretty much par for the course for any music meant to calm the mind — cat-standing-on-a-keyboard extended synth tones, a sporadic tinkling of different bells. Then, just as the bass drum fades out, and you think, “Oh good, they told him to stop,” suddenly, whether it\u003cspan\u003e’\u003c/span\u003es coming from the bells or something else, little grinding cymbal sounds pop up. By the time you get halfway through, there are what I would definitely call \u003ci\u003e“\u003c/i\u003etoo many bells,” and the song seems to be increasing in volume, making me turn it down a little, instead of drifting blissfully through the soundscape.\u003c/p\u003e\u003cp\u003eAt the 3:52 mark, there\u003cspan\u003e’\u003c/span\u003es an isolated sort of high-pitched whistle, and this song is officially stressing me out. By 5:35, they are whatever the ambient version of wailing on their instruments is. I\u003cspan\u003e’\u003c/span\u003ed describe what I\u003cspan\u003e’\u003c/span\u003em hearing as the world\u003cspan\u003e’\u003c/span\u003es quietest cacophony, like a monk carrying a bunch of prayer bowls just tripped and fell next to a lake. \u003c/p\u003e\u003cp\u003eThe cherry on top? The music video for the song features a fleet of drones, which just mostly makes me think about both the surveillance state and/or modern war. The last shot is one drone hovering and staring directly into camera, because nothing is more peaceful than “being watched.”\u003c/p\u003e\u003cp\u003eIn summation, if you\u003cspan\u003e’\u003c/span\u003ere stressed out and need a song to center you, don\u003cspan\u003e’\u003c/span\u003et listen to scientists or their stupid anxiety-curing songs, just stick with Willie Nelson. Now that\u003cspan\u003e’\u003c/span\u003es the good stuff.\u003c/p\u003e\u003cfigure\u003e\u003ciframe data-src=\"https://www.youtube.com/embed/Vc6NKCrje04\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/figure\u003e\n\u003c/article\u003e   \u003cp\u003e\u003cspan\u003eScroll down for the next article\u003c/span\u003e \u003c/p\u003e \u003c/div\u003e \u003cdiv\u003e   \u003cdiv\u003e  \u003cdiv\u003e \u003cp\u003e\u003clabel\u003eSIGN UP FOR\u003c/label\u003e\u003c/p\u003e\u003ch3\u003eA WEEKLY\u003cbr/\u003eNEWSLETTER OF\u003cbr/\u003e JOKES + TRIVIA\u003c/h3\u003e  \u003c/div\u003e \u003c/div\u003e \u003c/div\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-10T11:00:00-08:00",
  "modifiedTime": null
}
