{
  "id": "37fb6d52-bd71-495b-8af6-472172d3604d",
  "title": "What To Know About Breast Reduction Surgery",
  "link": "https://theonion.com/what-to-know-about-breast-reduction-surgery/",
  "description": "According to the American Society of Plastic Surgeons, breast reduction surgery has surged, growing 64% from 2019 to 2023. Here is what you need to know about the increasingly common elective procedure. Q: Who is a good candidate for breast reduction surgery?  A: Anyone whose breasts are medically designated as honkers.  Q: Why do women […] The post What To Know About Breast Reduction Surgery appeared first on The Onion.",
  "author": "The Onion Staff",
  "published": "Tue, 22 Oct 2024 19:35:14 +0000",
  "source": "https://www.theonion.com/rss",
  "categories": [
    "News",
    "Vol 60: Issue 43"
  ],
  "byline": "The Onion Staff",
  "length": 1367,
  "excerpt": "According to the American Society of Plastic Surgeons, breast reduction surgery has surged, growing 64% from 2019 to 2023. Here is what you need to know about the increasingly common elective procedure. Q: Who is a good candidate for breast reduction surgery? A: Anyone whose breasts are medically designated as honkers. Q: Why do women […]",
  "siteName": "The Onion",
  "favicon": "https://theonion.com/wp-content/uploads/2024/07/cropped-site-icon.png?w=192",
  "text": "According to the American Society of Plastic Surgeons, breast reduction surgery has surged, growing 64% from 2019 to 2023. Here is what you need to know about the increasingly common elective procedure. Q: Who is a good candidate for breast reduction surgery?  A: Anyone whose breasts are medically designated as honkers.  Q: Why do women choose breast reduction surgery? A: As a personal attack on men. Q: Can you still breastfeed after a reduction? A: Yes, but the milk will be 2%. Q: What should I look for in a surgeon? A: Anyone who’s board certified and doesn’t say, “aw, what a shame” when you say you want it done. Q: Can men get a breast reduction? A: Plastic surgeons are more than happy to take money from anybody for any reason. Q: How does a reduction affect nipple sensation? A: Most things are more pleasurable when you’re no longer drowning in your own tits. Q: How will I be able to identify the women in my life if they choose to change their breast size? A: You can start by familiarizing yourself with their heads and faces, many of which can be just as distinctive.  Q: What’s a well-known consequence of the surgery? A: Losing acting roles to Sydney Sweeney.  Q: Are people going to be weird about it? A: The world is going to be really weird about your body whether you have surgery or not.",
  "image": "https://theonion.com/wp-content/uploads/2024/10/Breast_Reduction_INFO-G-PH.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eAccording to the American Society of Plastic Surgeons, breast reduction surgery has surged, growing 64% from 2019 to 2023. Here is what you need to know about the increasingly common elective procedure.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: Who is a good candidate for breast reduction surgery? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: Anyone whose breasts are medically designated as honkers. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: Why do women choose breast reduction surgery?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: As a personal attack on men.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: Can you still breastfeed after a reduction?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: Yes, but the milk will be 2%.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: What should I look for in a surgeon?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: Anyone who’s board certified and doesn’t say, “aw, what a shame” when you say you want it done.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: Can men get a breast reduction?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: Plastic surgeons are more than happy to take money from anybody for any reason.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: How does a reduction affect nipple sensation?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: Most things are more pleasurable when you’re no longer drowning in your own tits.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: How will I be able to identify the women in my life if they choose to change their breast size?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: You can start by familiarizing yourself with their heads and faces, many of which can be just as distinctive. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: What’s a well-known consequence of the surgery?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: Losing acting roles to Sydney Sweeney. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQ: Are people going to be weird about it?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA: The world is going to be really weird about your body whether you have surgery or not.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-22T19:35:14Z",
  "modifiedTime": "2024-10-22T19:35:15Z"
}
