{
  "id": "4183529d-0235-475e-9d85-787d0a4fd155",
  "title": "Secret And Safe",
  "link": "https://www.penny-arcade.com/comic/2024/09/27/secret-and-safe",
  "description": "New Comic: Secret And Safe",
  "author": "",
  "published": "Fri, 27 Sep 2024 07:01:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 2100,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "Mormons used to call the house all the time, because my dad - and his nine brothers and sisters - grew up Mormon. Mormonism has always been very normalized for me, very ordinary stuff, but I just happened to come up in a place that has a unique relationship with the faith. Until you really get into the lore, it's essentially a Christian sect that shares a lot of what you might call \"class features\" with Bible Classic. But in one of the most incredible flexes of all time, their founder Joseph Smith literally wrote what is essentially a sequel to The Bible. And, well, yeah. You know what they say about sequels. I am not that atheist firebrand occasionally seen in strips of a more ancient vintage here on the site, at least, not anymore. I try to make observations about the world at the highest level of utility, and I might wish it weren't the case, but there are hard limits on what an exclusively material world can offer. My modern inclination about religion generally is what I call the Civ model, as in Sid Meier's Civilization, where religion exists as an item on a tech tree that offers certain advantages and disadvantages. Maybe that's rude, I don't know. It's way less rude than I was.  I'm conscious of the externalities just because of my own upbringing, but yeah.  It's an organizing principle and I get it.     Now we have Mormon Influencers and MomTok and reality shows which project some of their more novel social rituals into the broader place, such as borderline heretical Soda Worship, but they don't really get into the fundamentally fantasy and sci-fi aspects which are a really novel part of the Mormon Cinematic Universe. Again, I have precisely no hate - and less than zero hate, and perhaps even affection, for the young people trying to pull a fast one on their Omnipotent Creator by way of various enterprising techniques. As someone who was young myself at one point, the sneaking around was probably the best part. Trying to pull a fast one, some kind of erotic heist, on an entity with absolute knowledge must be electric. (CW)TB out.",
  "image": "https://assets.penny-arcade.com/comics/20240927-KCDZrzhy.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection\u003e\n                            \u003cp\u003eMormons used to call the house all the time, because my dad - and his nine brothers and sisters - grew up Mormon. Mormonism has always been very normalized for me, very ordinary stuff, but I just happened to come up in a place that has \u003ca href=\"https://en.wikipedia.org/wiki/Mormonism_in_the_Pacific_Northwest\"\u003ea unique relationship with the faith\u003c/a\u003e. Until you really get into the lore, it\u0026#39;s essentially a Christian sect that shares a lot of what you might call \u0026#34;class features\u0026#34; with Bible Classic. But in one of the most incredible flexes of all time, their founder Joseph Smith literally wrote what is essentially a sequel to The Bible. And, well, yeah. You know what they say about sequels.\u003c/p\u003e                            \u003cp\u003eI am not that atheist firebrand occasionally seen in strips of a more ancient vintage here on the site, at least, not anymore. I try to make observations about the world at the highest level of utility, and I might wish it weren\u0026#39;t the case, but there are hard limits on what an exclusively material world can offer. My modern inclination about religion generally is what I call the Civ model, as in Sid Meier\u0026#39;s Civilization, where religion exists as an item on a tech tree that offers certain advantages and disadvantages. Maybe that\u0026#39;s rude, I don\u0026#39;t know. It\u0026#39;s way less rude than I was.  I\u0026#39;m conscious of the externalities just because of my own upbringing, but yeah.  It\u0026#39;s an organizing principle and I get it.    \u003c/p\u003e\n\u003cp\u003eNow we have Mormon Influencers and MomTok and reality shows which project some of their more novel social rituals into the broader place, such as borderline heretical \u003ca href=\"https://www.yahoo.com/lifestyle/very-mormon-origin-dirty-soda-140512625.html\"\u003eSoda Worship\u003c/a\u003e, but they don\u0026#39;t really get into the fundamentally \u003ca href=\"https://en.wikipedia.org/wiki/Kolob\"\u003efantasy and sci-fi aspects\u003c/a\u003e which are a really novel part of the Mormon Cinematic Universe. Again, I have precisely no hate - and less than zero hate, and perhaps even affection, for the young people trying to pull a fast one \u003ca href=\"https://www.penny-arcade.com/comic/2024/09/27/secret-and-safe\"\u003eon their Omnipotent Creator\u003c/a\u003e by way of various enterprising techniques. As someone who was young myself at one point, the sneaking around was probably the best part. Trying to pull a fast one, some kind of erotic heist, on an entity with absolute knowledge must be electric.\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
