{
  "id": "4f427c7b-2be6-4af4-aaed-0f41421fcce6",
  "title": "25-year-old man insists on traveling solo after GF forgets her passport: 'I wasn't going to miss out on a trip just because she planned poorly'",
  "link": "https://cheezburger.com/38523909/25-year-old-man-insists-on-traveling-solo-after-gf-forgets-her-passport-i-wasnt-going-to-miss-out-on",
  "description": "The trip was planned, the flight was soon, but there was one thing missing. That's right, this woman did it: she forgot to pack her passport. It's the kind of thing that gives many of us nightmares. Imagine spending weeks planning the perfect trip, only to stymie yourself before you even get to your destination! Travel isn't cheap, and flying to Japan from the USA must cost a small fortune. As a few commenters noted, I can't imagine forgetting such an important document. Before I go to the airport, I check to make sure I have the proper ID or passport like, 40 times. Even just when leaving the house, it's good to check for your wallet, keys, and cell phone, just to make sure you never get locked out of your house. I know things happen, and not everyone is that vigilant (or anxious). It seems somewhat common to leave your passport somewhere you're sure you'll remember it, like the kitchen table or the living room couch, only to realize while you're en route to the airport that that passport is still sitting at home. Cue the mad dash to get it before your plane takes off! After you read this couple's travel story, read about these employees who got swiftly fired for some good reasons, like one dude who \"pick[ed] up his car with a forklift.\"",
  "author": "Remy Millisky",
  "published": "Thu, 02 Jan 2025 12:00:00 -0800",
  "source": "http://feeds.feedburner.com/failblog",
  "categories": [
    "Dating-Relationships",
    "boyfriend",
    "passport",
    "relationships",
    "girlfriend",
    "Japan",
    "Travel"
  ],
  "byline": "Remy Millisky",
  "length": 702,
  "excerpt": "25-year-old man insists on traveling solo after GF forgets her passport: 'I wasn't going to miss out on a trip just because she planned poorly' - The internet has generated a huge amount of laughs from cats and FAILS. And we all out of cats.",
  "siteName": "FAIL Blog",
  "favicon": "https://i.chzbgr.com/s/unversioned/images/square_logos/FailBlog.png",
  "text": "The whole situation is strange, and it's also odd that she realized she forgot her passport during the first flight, yet still kept on going. I know it's inconvenient and convoluted, but shouldn't she have just turned around and booked a flight home to get it? One commenter thought that the relationship might be over in the aftermath of this whole debacle. Some friends are wonderful people, but you'd never want to travel with them because they're so scatterbrained. Maybe it's worth traveling with someone before committing to a long-term relationship, just to make sure they're not the kind of person who leaves for the airport an hour before the plane leaves or who packs the morning of the trip.",
  "image": "https://i.chzbgr.com/original/38523909/h30ED09F1/dating-relationships-boyfriend-passport-relationships-girlfriend-japan-travel",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe whole situation is strange, and it\u0026#39;s also odd that she realized she forgot her passport during the first flight, yet still kept on going. I know it\u0026#39;s inconvenient and convoluted, but shouldn\u0026#39;t she have just turned around and booked a flight home to get it? \u003c/p\u003e\u003cp\u003eOne commenter thought that the relationship might be over in the aftermath of this whole debacle. Some friends are wonderful people, but you\u0026#39;d never want to travel with them because they\u0026#39;re so scatterbrained. Maybe it\u0026#39;s worth traveling with someone before committing to a long-term relationship, just to make sure they\u0026#39;re not the kind of person who leaves for the airport an hour before the plane leaves or who packs the morning of the trip. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-01-02T12:00:00-08:00",
  "modifiedTime": null
}
