{
  "id": "5d88e8c9-a6a3-47dc-8e31-744f26257688",
  "title": "21 Famished Foodie Feline Memes Eating Away the Meownday Mellows All the Way to the Weekend",
  "link": "https://cheezburger.com/38036229/21-famished-foodie-feline-memes-eating-away-the-meownday-mellows-all-the-way-to-the-weekend",
  "description": "The way from a Monday to the weekend might be long, but it's never as long as a cat who has to wait 3 hours between meals. It is known that the time it takes a cat to wait between their feeding times is the longest waiting time in existence. Just as the laws of physics do not apply to cats (hence cats are liquid, actually), so does the concept of time. The time it takes any of us, humble hoomans, to wait between meals, is nothing like the passage of time for the same thing to a cat. That's why cats think they're famished 5 minutes after their meal is done - time doesn't act for them the same way it does for us. Yes, that must be the reason for it…Since this is why cats have this huge hunger, the concepts of cats and food are inseparable when it comes to cat memes. There are so many foodie feline memes out there, we just had to gather some to demonstrate it all.",
  "author": "Ayala Sorotsky",
  "published": "Mon, 02 Dec 2024 10:00:00 -0800",
  "source": "http://feeds.feedburner.com/icanhascheezburger",
  "categories": [
    "funny cat memes",
    "food memes",
    "funny memes",
    "Memes",
    "funny cats",
    "food",
    "Cats",
    "foodie",
    "cat memes",
    "foodies"
  ],
  "byline": "Ayala Sorotsky",
  "length": 356,
  "excerpt": "21 Famished Foodie Feline Memes Eating Away the Meownday Mellows All the Way to the Weekend - World's largest collection of cat memes and other animals",
  "siteName": "I Can Has Cheezburger?",
  "favicon": "https://i.chzbgr.com/blob/1/ICHCnew.png",
  "text": "Shhhh, little hobbit cat, wait until your stomach feels full. You don't actually need the second breakfast, blissful branch, splendid snack, first lunch, second lunch, afternoon aperitif, sundown snack, second sundown snack, dinner, dessert, second dinner, midnight snack, post 3 am zoomies meal, and dawn dinner which is the pre-breakfast. You just don't.",
  "image": "https://i.chzbgr.com/original/38036229/h9ABE939A/breakfast-and-one-meme-including-how-my-cat-sees-herself-when-she-hasnt-eaten-in-almost-an-hour",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eShhhh, little hobbit cat, wait until your stomach feels full. You don\u0026#39;t actually need the second breakfast, blissful branch, splendid snack, first lunch, second lunch, afternoon aperitif, sundown snack, second sundown snack, dinner, dessert, second dinner, midnight snack, post 3 am zoomies meal, and dawn dinner which is the pre-breakfast. You just don\u0026#39;t.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2024-12-02T10:00:00-08:00",
  "modifiedTime": null
}
