{
  "id": "65f5922d-c2e7-4f30-90a4-4921135105ac",
  "title": "Haunted dollhouse continued…",
  "link": "https://thebloggess.com/2024/10/25/haunted-dollhouse-continued/",
  "description": "It’s almost Halloween so I’m giving an updated video walk-through of my witch’s dollhouse on instagram. I can’t believe I’ve been building it for almost two decades. Feel free to stay awhile. It’s filled with over 100 references to my favorite horror and fantasy books and movies. (Pictures below if you don’t do instagram.) HowContinue reading \"Haunted dollhouse continued…\"",
  "author": "thebloggess",
  "published": "Fri, 25 Oct 2024 19:18:42 +0000",
  "source": "https://thebloggess.com/feed/",
  "categories": [
    "Random Crap"
  ],
  "byline": "mjsteinhagengmailcom says:",
  "length": 4884,
  "excerpt": "It’s almost Halloween so I’m giving an updated video walk-through of my witch’s dollhouse on instagram. I can’t believe I’ve been building it for almost two decades. F…",
  "siteName": "The Bloggess",
  "favicon": "",
  "text": "Post navigation 20 thoughts on “Haunted dollhouse continued…” Read comments below or add one. Do you keep yours under/behind glass? I have two under renovation, and I’ve had that question asked a lot – if they’ll be glassed in when done. (Yep. It’s in a big glass cabinet. Before that the cats would crawl inside and nest. ~ Jenny) Awesome haunted and magical things house! It’s been a rough week, here at The House With No Livestock. Your Haunted Dollhouse posts have brought me joy. Thank you. Oh my God Jenny – it’s absolutely fabulous!! How on earth did you find all of those incredible miniatures? You truly are a genius!!!🖤 You have so much talent in so many ways. Love the new sign BTW. I quite enjoy Rosemary and Rosemary’s Baby. Is that a miniature Iron Maiden (copper colored item second to last photo)???! So spooky and fun! What does the exterior look like? omg thats wonderful! where on earth did you find the miniature dragons in the tarot room? (and all the other wonderful miniature oddities?) This is amazing! I love your imagination. It’s hard to believe these are all miniatures. Rider 21: snakes on a doll house plane Alice khaleesi and her little dragon No one puts Dumbledore’s Phoenix in a corner I give up. You are too talented. I’m picturing Hailey’s grandchildren enamored with and playing with this and asking about what made Great-Grandma Jenny tick. Thank God they’ll have your books to explain their ancestry. I’m also picturing YOU finding all kinds of neat new finds along the way, knowing each item will be PERFECT for a particular room in the Haunted Doll House. Happy Halloween, Jenny! Wow! I’m a dollhouse hobbiest and this is an impressive collection of creepy miniatures. It must have taken years to find all the items. Great job creating the various rooms! I couldn’t love this any more! My favorite things are the tiny books. I can’t imagine how you made those! Make a date for next year to come to St. Helens, Oregon. https://www.spiritofhalloweentown.co/ Haunted hotel, seances, Halloweentown the movies, B\u0026Bs from Halloweentown and Twilight, witches, ghouls, you name it. See you next year! I see you there possessed taxidermized (yes, it’s a word) deer head from Evil Dead 2 – very nice touch. Leave a Reply ALL THE COOL KIDS ADVERTISE HERE: I fucking love these people \u0026 not just because they support my wine-slushee habit: Flourish in Progress: (T)hug Life: Part hood. Part good. Pregnancy Calendar at Alpha Mom: Amalah’s week-by-week guide to the miracle of pregnancy and all the various indignities that come with it. The Mack Files: Digesting life in bite-sized pieces through the lens of clichés, quotes \u0026 “truisms”.  Often irreverent, always honest. Barking at the Moon: If your dog is your furry child, you will laugh out loud at Tracy Beckerman’s book about her family \u0026 a one-dog wrecking ball named Riley. Welcome to xanaru: A mostly funny blog about my quest for happiness through stories, friendship, Great Danes and indiscriminate swearing. How the Hell Did I Not Know That?: Humorist Lucie Frost shares daily Instagram reels with learnings of the day—words, music, whatever–with plenty of laughs and all the curse words. Beautiful Writers book: Writers! This coming-of-career memoir (w/ the BEST advice from celeb authors, real shit you haven’t heard) is life. A page-turning beach read doubling as how-to. #Magic Ruminating: Life is weird. Let’s laugh about it together. Here you’ll find random musings on life’s strange trajectory, personal stories from an overthinker, and other fun little tidbits. His Lies Did Not Erase Me: Plagued by nightmares, Stacie Ann Leininger turned to writing to help her cope with the horrors of being forced into silence for several decades after the death and cover-up of her boyfriend when they were just 15. This important collection of poetry is the result. Hyperbole and a Half by Allie Brosh: SO GOOD. No Pithy Phrase: Between cancer, creatures, and the horde, there’s always something weird going on over here. The witchy writing freak flags are flying.",
  "image": "https://thebloggess.com/wp-content/uploads/2024/10/Snapseed-20.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"content\"\u003e\n\n\t\t\u003cmain id=\"main\"\u003e\n\n\t\t\t\n\u003carticle id=\"post-41992\"\u003e\n\n\t\u003cheader\u003e\n\t\t\t\t\t\t\n\t\t\t\u003c/header\u003e\n\n\t\n\t\n\n\t\n\n\t\t\t\t\n\u003c/article\u003e\n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\n\u003cdiv id=\"comments\"\u003e\n\n\t\t\t\u003ch2\u003e\n\t\t\t20 thoughts on “\u003cspan\u003eHaunted dollhouse continued…\u003c/span\u003e”\t\t\u003c/h2\u003e\n\t\t\u003cp\u003eRead comments below or \u003ca href=\"#commentform\"\u003eadd one\u003c/a\u003e.\u003c/p\u003e\n\n\t\t\n\t\t\u003col\u003e\n\t\t\t\t\t\u003cli id=\"comment-1750513\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750513\"\u003e\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750514\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750514\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eDo you keep yours under/behind glass? I have two under renovation, and I’ve had that question asked a lot – if they’ll be glassed in when done.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e(Yep.  It’s in a big glass cabinet.  Before that the cats would crawl inside and nest.  ~ Jenny)\u003c/strong\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750515\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750515\"\u003e\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750516\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750516\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eAwesome haunted and magical things house!\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750518\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750518\"\u003e\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750519\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750519\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eIt’s been a rough week, here at The House With No Livestock.\u003cbr/\u003e\nYour Haunted Dollhouse posts have brought me joy.\u003cbr/\u003e\nThank you.\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750520\"\u003e\n\t\t\t\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750521\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750521\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eOh my God Jenny – it’s absolutely fabulous!! How on earth did you find all of those incredible miniatures? You truly are a genius!!!🖤\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750522\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750522\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eYou have so much talent in so many ways. Love the new sign BTW.\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750523\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750523\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eI quite enjoy Rosemary and Rosemary’s Baby.\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750525\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750525\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eIs that a miniature Iron Maiden (copper colored item second to last photo)???!\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750526\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750526\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eSo spooky and fun! What does the exterior look like?\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750527\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750527\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eomg thats wonderful! where on earth did you find the miniature dragons in the tarot room? (and all the other wonderful miniature oddities?)\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750529\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750529\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eThis is amazing! I love your imagination. It’s hard to believe these are all miniatures.\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750531\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750531\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eRider 21: snakes on a doll house plane\u003cbr/\u003e\nAlice khaleesi and her little dragon\u003cbr/\u003e\nNo one puts Dumbledore’s Phoenix in a corner\u003cbr/\u003e\nI give up. You are too talented.\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750534\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750534\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eI’m picturing Hailey’s grandchildren enamored with and playing with this and asking about what made Great-Grandma Jenny tick. Thank God they’ll have your books to explain their ancestry.\u003cbr/\u003e\nI’m also picturing YOU finding all kinds of neat new finds along the way, knowing each item will be PERFECT for a particular room in the Haunted Doll House.\u003cbr/\u003e\nHappy Halloween, Jenny!\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750542\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750542\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eWow! I’m a dollhouse hobbiest and this is an impressive collection of creepy miniatures. It must have taken years to find all the items. Great job creating the various rooms!\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750548\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750548\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eI couldn’t love this any more! My favorite things are the tiny books. I can’t imagine how you made those!\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750554\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750554\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eMake a date for next year to come to St. Helens, Oregon. \u003ca href=\"https://www.spiritofhalloweentown.co/\" rel=\"nofollow ugc\"\u003ehttps://www.spiritofhalloweentown.co/\u003c/a\u003e\u003cbr/\u003e\nHaunted hotel, seances, Halloweentown the movies, B\u0026amp;Bs from Halloweentown and Twilight, witches, ghouls, you name it. See you next year!\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003cli id=\"comment-1750566\"\u003e\n\t\t\t\u003carticle id=\"div-comment-1750566\"\u003e\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eI see you there possessed taxidermized (yes, it’s a word) deer head from Evil Dead 2 – very nice touch.\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/article\u003e\n\t\t\u003c/li\u003e\n\t\t\u003c/ol\u003e\n\n\t\t\n\t\t\u003cp id=\"respond\"\u003e\n\t\t\t\u003ch3 id=\"reply-title\"\u003eLeave a Reply\u003csmall\u003e\u003c/small\u003e\u003c/h3\u003e\t\t\t\n\t\t\u003c/p\u003e\n\n\t\t\n\t\t\u003c/div\u003e\n\n\t\t\u003c/main\u003e\n\n\t\t\n\n\u003cdiv\u003e\n\n\t\u003ch3\u003eALL THE COOL KIDS ADVERTISE HERE:\u003c/h3\u003e\t\t\t\n\t\t\u003ch3\u003eI fucking love these people \u0026amp; not just because they support my wine-slushee habit:\u003c/h3\u003e\t\t\t\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.elizabethjayneliu.com\"\u003eFlourish in Progress:\u003c/a\u003e (T)hug Life: Part hood. Part good.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://alphamom.com/pregnancy-calendar-overview/\"\u003ePregnancy Calendar at Alpha Mom:\u003c/a\u003e Amalah’s week-by-week guide to the miracle of pregnancy and all the various indignities that come with it.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.mackfiles.com/\"\u003eThe Mack Files:\u003c/a\u003e Digesting life in bite-sized pieces through the lens of clichés, quotes \u0026amp; “truisms”.  Often irreverent, always honest.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/Barking-at-Moon-Tracy-Beckerman/dp/1632993937/\"\u003eBarking at the Moon:\u003c/a\u003e If your dog is your furry child, you will laugh out loud at Tracy Beckerman’s book about her family \u0026amp; a one-dog wrecking ball named Riley.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.xanaru.com/\"\u003eWelcome to xanaru:\u003c/a\u003e A mostly funny blog about my quest for happiness through stories, friendship, Great Danes and indiscriminate swearing.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.instagram.com/luciehfrost/\"\u003eHow the Hell Did I Not Know That?:\u003c/a\u003e Humorist Lucie Frost shares daily Instagram reels with learnings of the day—words, music, whatever–with plenty of laughs and all the curse words.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/Beautiful-Writers-Journey-Manuscripts-Bestselling/dp/1637741030/\"\u003eBeautiful Writers book\u003c/a\u003e: Writers! This coming-of-career memoir (w/ the BEST advice from celeb authors, real shit you haven’t heard) is life. A page-turning beach read doubling as how-to. #Magic\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://charitykilbourn.substack.com/\"\u003eRuminating:\u003c/a\u003e Life is weird. Let’s laugh about it together. Here you’ll find random musings on life’s strange trajectory, personal stories from an overthinker, and other fun little tidbits.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/dp/B0D7YPC88X?ref_=pe_93986420_774957520\"\u003eHis Lies Did Not Erase Me:\u003c/a\u003e Plagued by nightmares, Stacie Ann Leininger turned to writing to help her cope with the horrors of being forced into silence for several decades after the death and cover-up of her boyfriend when they were just 15. This important collection of poetry is the result.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nowherebookshop.com/book/9781451666175\"\u003eHyperbole and a Half by Allie Brosh:\u003c/a\u003e SO GOOD.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.jessicasettergren.com\"\u003eNo Pithy Phrase:\u003c/a\u003e Between cancer, creatures, and the horde, there’s always something weird going on over here. The witchy writing freak flags are flying.\u003c/p\u003e\n\u003c/div\u003e\n\t\t\t\t\t\n\t\t\n\u003c/div\u003e\n\n\t\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-25T19:18:42Z",
  "modifiedTime": "2024-10-25T19:18:42Z"
}
