{
  "id": "715e6510-61cf-47a7-9ad9-4235d1dbbc23",
  "title": "Fraternization",
  "link": "https://www.penny-arcade.com/news/post/2024/10/06/fraternization",
  "description": "Josef Fares has carved out a crazy history in game dev - he was a filmmaker before, which makes sense I guess if you look at his work. He started with Brothers: A Tale of Two Sons back at Starbreeze, who is making a D\u0026D game now I guess? Brothers has a weird trick it pulls that I still think about ten years later, and I'm confident that it has the power to heal the rift.",
  "author": "",
  "published": "Sun, 06 Oct 2024 19:19:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 1560,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "Josef Fares has carved out a crazy history in game dev - he was a filmmaker before, which makes sense I guess if you look at his work. He started with Brothers: A Tale of Two Sons back at Starbreeze, who is making a D\u0026D game now I guess? Brothers has a weird trick it pulls that I still think about ten years later, and I'm confident that it has the power to heal the rift. I don't know if it's a rift, exactly. It's mostly fine. Part of it is that the youngest - Noah, no relation - is competitive in a way that I think is probably very traditional for young men which lends \"intensity.\" I often watch Twitch streams with tens of thousands of viewers, and even though I'm one of them as a purely statistical matter, I don't know who they're for. They're for Noah! These streams are for Noah. These are streams where grown men scream and yell when they lose at videogames. I don't care how people make their money really but when some ghost of it projects into my leisure hours now we gotta have takes. Today is the Very Last Day for a Clank! Legacy 2: Acquisitions Incorporated - Darkest Magic Pre-Order, so \"lock in.\" And consider working some core strength exercises into your routine so you will be able to life the box with all of its cards and stickers and stories with ease and impress everybody at your table: A pallet jack or a forklift would also work. Alright! I gotta catch a plane. I got some stuff to do down there. Eldritch stuff. Know what I mean? (CW)TB out.",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003csection\u003e\n                            \u003cp\u003eJosef Fares has carved out a \u003ca href=\"https://en.wikipedia.org/wiki/Josef_Fares\"\u003ecrazy history\u003c/a\u003e in game dev - he was a filmmaker before, which makes sense I guess if you look at his work. He started with Brothers: A Tale of Two Sons back at Starbreeze, who is making a \u003ca href=\"https://www.starbreeze.com/our-work/project-baxter/\"\u003eD\u0026amp;D game\u003c/a\u003e now I guess? Brothers has a weird trick it pulls that I still think about ten years later, and I\u0026#39;m confident that it has the power to \u003ca href=\"https://www.penny-arcade.com/comic/2024/10/07/\"\u003eheal the rift\u003c/a\u003e.\u003c/p\u003e                        \u003c/section\u003e\n\t\t\t\t\t\t\n                        \u003csection\u003e\n                            \u003cp\u003eI don\u0026#39;t know if it\u0026#39;s a rift, exactly. It\u0026#39;s mostly fine. Part of it is that the youngest - Noah, no relation - is competitive in a way that I think is probably very traditional for young men which lends \u0026#34;intensity.\u0026#34; I often watch Twitch streams with tens of thousands of viewers, and even though I\u0026#39;m one of them as a purely statistical matter, I don\u0026#39;t know who they\u0026#39;re for. They\u0026#39;re for Noah! These streams are for Noah. These are streams where grown men scream and yell when they lose at videogames. I don\u0026#39;t care how people make their money really but when some ghost of it projects into my leisure hours now we gotta have takes.\u003c/p\u003e\n\u003cp\u003eToday is the Very Last Day for a \u003ca href=\"https://shop.direwolfdigital.com/collections/clank-legacy-2-pre-order\"\u003eClank! Legacy 2: Acquisitions Incorporated - Darkest Magic Pre-Order\u003c/a\u003e, so \u0026#34;lock in.\u0026#34; And consider working some core strength exercises into your routine so you will be able to life the box with all of its cards and stickers and stories with ease and impress everybody at your table:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://shop.direwolfdigital.com/collections/clank-legacy-2-pre-order\"\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/CLAI2_PreOrder_LIVE_Facebook_Post_750x425.W7H3QZ5P.jpg\" alt=\"null\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eA pallet jack or a forklift would also work. Alright! I gotta catch a plane. I got \u003ca href=\"https://www.penny-arcade.com/news/post/2024/10/04/acquisitions-incorporated-returns-to-aus-with-the-brand-new-arkham-horror-rpg\"\u003esome stuff to do down there\u003c/a\u003e. \u003cem\u003eEldritch\u003c/em\u003e stuff. Know what I mean?\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
