{
  "id": "c00d2ae3-8a84-4439-9e40-e1e413331f32",
  "title": "Error'd: Killing Time",
  "link": "https://thedailywtf.com/articles/killing-time",
  "description": "The Hatter was framed! He didn't even do it! Nil Corpus Delecti, et cetera. Yet Yitz O. , up to some kind of skullduggery, observed a spacetime oddity. \"When trying to compare some results from a GetOrders call via the ebay api, I noticed something weird was happening with the DateTimes in the response. The attached is 3 calls to get the same order, made in quick succession. The millisecond part of all the DateTimes matched the millisecond part of the *current* time (which you can see in the TimeStamp field. I assume it's because they rolled their own DateTime functionality and are Getting a UTC time by subtracting the difference between the local time and the UTC time, and one of those values doesn't have the millisecond value in it, but it's the ebay api so who knows.\" Undoubtedly a bug that nobody ever noticed because they probably just ignore the millis altogether.   An anonymous smartie wrote that \"Concerned about the possibility of creeping senesence, I've been looking for some way to benchmark and track cognitive performance over time. This site purported to offer an online version of a common medical assessment, so I figured I'd give it a try. But what's that first field asking about?   Naturally, I filled it in:   Apparently that was the wrong answer, but the error message here is singularly unhelpful. A trick question? Or proof that I'm already too far gone?   (The answer is on the page but it is a bit subtle.) A first-time submission, I think, from Bill S. \"The Explore DDD Conference site wants you to join their mailing list; it would help if their submit button did something other than a silent 404 error.\"   \"Yes, we have no listings,\" explained Peter G. fruitlessly. Check back next week.   In a more fruitful vein, Jeremy P. decided he \"Needed to look up a word from NYT connections. The Apple built in dictionary seems to have an unusual language built in called 'Apple'. 'Pilled' means 'inappropriately inserted advert' in Apple.\"   Check back next week as we bring you more seedy sites. [Advertisement] ProGet’s got you covered with security and access controls on your NuGet feeds. Learn more.",
  "author": "Lyle Seaman",
  "published": "Fri, 27 Dec 2024 06:30:00 GMT",
  "source": "http://syndication.thedailywtf.com/TheDailyWtf",
  "categories": [
    "Error'd"
  ],
  "byline": "Lyle Seaman",
  "length": 2514,
  "excerpt": "The Hatter was framed! He didn't even do it! Nil Corpus Delecti, et cetera. Yet Yitz O. , up to some kind of skullduggery, observed a spacetime oddity. \"When trying to compare some results from a GetOrders call via the ebay api, I noticed something weird was happening with the DateTimes in the response. The attached is 3 calls to get the same order, made in quick succession. The millisecond part of all the DateTimes matched the millisecond part of the *current* time (which you can see in the TimeStamp field. I assume it's because they rolled their own DateTime functionality and are Getting a UTC time by subtracting the difference between the local time and the UTC time, and one of those values doesn't have the millisecond value in it, but it's the ebay api so who knows.\" Undoubtedly a bug that nobody ever noticed because they probably just ignore the millis altogether.",
  "siteName": "The Daily WTF",
  "favicon": "",
  "text": "by in Error'd on 2024-12-27 Edit Lyle Seamannetworking, security infra and filesystems kernel hacker turned application programmer, SRE and engineering manager, Lyle traded tilting at windmills for viking at Vikings but couldn't catch any. The Hatter was framed! He didn't even do it! Nil Corpus Delecti, et cetera. Yet Yitz O. , up to some kind of skullduggery, observed a spacetime oddity. \"When trying to compare some results from a GetOrders call via the ebay api, I noticed something weird was happening with the DateTimes in the response. The attached is 3 calls to get the same order, made in quick succession. The millisecond part of all the DateTimes matched the millisecond part of the *current* time (which you can see in the TimeStamp field. I assume it's because they rolled their own DateTime functionality and are Getting a UTC time by subtracting the difference between the local time and the UTC time, and one of those values doesn't have the millisecond value in it, but it's the ebay api so who knows.\" Undoubtedly a bug that nobody ever noticed because they probably just ignore the millis altogether. An anonymous smartie wrote that \"Concerned about the possibility of creeping senesence, I've been looking for some way to benchmark and track cognitive performance over time. This site purported to offer an online version of a common medical assessment, so I figured I'd give it a try. But what's that first field asking about? Naturally, I filled it in: Apparently that was the wrong answer, but the error message here is singularly unhelpful. A trick question? Or proof that I'm already too far gone? (The answer is on the page but it is a bit subtle.) A first-time submission, I think, from Bill S. \"The Explore DDD Conference site wants you to join their mailing list; it would help if their submit button did something other than a silent 404 error.\" \"Yes, we have no listings,\" explained Peter G. fruitlessly. Check back next week. In a more fruitful vein, Jeremy P. decided he \"Needed to look up a word from NYT connections. The Apple built in dictionary seems to have an unusual language built in called 'Apple'. 'Pilled' means 'inappropriately inserted advert' in Apple.\" Check back next week as we bring you more seedy sites. [Advertisement] ProGet’s got you covered with security and access controls on your NuGet feeds. Learn more.",
  "image": "https://thedailywtf.com/images/imageslws/viking.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv itemscope=\"\" itemtype=\"http://schema.org/Article\" id=\"article-page\"\u003e\n\n        \n        \u003cp\u003e\u003cspan\u003eby \n            in \u003ca itemprop=\"articleSection\" href=\"https://thedailywtf.com/series/errord\"\u003eError\u0026#39;d\u003c/a\u003e\n            on \u003cspan itemprop=\"datePublished\" content=\"2024-12-27\"\u003e2024-12-27\u003c/span\u003e\n            \u003ca href=\"https://thedailywtf.com/admin/article/edit/10813\" rel=\"nofollow\"\u003eEdit\u003c/a\u003e\n        \u003c/span\u003e\u003c/p\u003e\n        \u003cdiv itemprop=\"author\" itemscope=\"\" itemtype=\"http://schema.org/Person\"\u003e\n            \u003cp\u003e\u003cimg itemprop=\"image\" src=\"https://thedailywtf.com/images/imageslws/viking.jpg\"/\u003e\n            \u003ca itemprop=\"name\" href=\"https://thedailywtf.com/authors/lyle-seaman\"\u003eLyle Seaman\u003c/a\u003e\u003c/p\u003e\u003cp itemprop=\"description\"\u003enetworking, security infra and filesystems kernel hacker turned application programmer, SRE and engineering manager, Lyle traded tilting at windmills for viking at Vikings but couldn\u0026#39;t catch any.\u003c/p\u003e\n        \u003c/div\u003e\n        \u003cdiv itemprop=\"articleBody\"\u003e\n            \u003cp\u003e\nThe Hatter was framed! He didn\u0026#39;t even do it! Nil Corpus Delecti, et cetera.\n\u003c/p\u003e\n\n\u003cp\u003eYet \n\u003cstrong\u003eYitz O.\n\u003c/strong\u003e, up to some kind of skullduggery, observed a spacetime oddity.\n\u0026#34;When trying to compare some results from a GetOrders call via the ebay\napi, I noticed something weird was happening with the DateTimes in the response.\nThe attached is 3 calls to get the same order, made in quick succession.\nThe millisecond part of all the DateTimes matched the millisecond\npart of the *current* time (which you can see in the TimeStamp field.\nI assume it\u0026#39;s because they rolled their own DateTime functionality\nand are Getting a UTC time by subtracting the difference between\nthe local time and the UTC time, and one of those values doesn\u0026#39;t have\nthe millisecond value in it, but it\u0026#39;s the ebay api so who knows.\u0026#34;\nUndoubtedly a bug that nobody ever noticed because they probably\njust ignore the millis altogether.\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#3\"\u003e\u003cimg itemprop=\"image\" alt=\"3\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/screenshot20230424174004.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003e\nAn anonymous smartie wrote that \u0026#34;Concerned about the possibility of creeping senesence, I\u0026#39;ve\nbeen looking for some way to benchmark and track cognitive performance over time. This site\npurported to offer an online version of a common medical assessment, so I figured I\u0026#39;d give\nit a try.  But what\u0026#39;s that first field asking about?\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#4\"\u003e\u003cimg itemprop=\"image\" alt=\"4\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/screenshot20241226at4.51.58pm.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\n\nNaturally, I filled it in:\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#5\"\u003e\u003cimg itemprop=\"image\" alt=\"5\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/screenshot20241226at4.52.44pm.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\n\nApparently that was the wrong answer, but the error message here is singularly unhelpful. \nA trick question? Or proof that I\u0026#39;m already too far gone?\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#6\"\u003e\u003cimg itemprop=\"image\" alt=\"6\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/screenshot20241226at4.53.33pm.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e (The answer is on the page but it is a bit subtle.)\n\u003c/p\u003e\n\u003cp\u003eA first-time submission, I think, from \n\u003cstrong\u003eBill S.\n\u003c/strong\u003e\u003cbr/\u003e\n\u0026#34;The \u003ca href=\"https://exploreddd.com/\"\u003eExplore DDD Conference site\u003c/a\u003e wants you to join\ntheir mailing list; it would help if their submit button did something other than a\nsilent 404 error.\u0026#34;\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#1\"\u003e\u003cimg itemprop=\"image\" alt=\"1\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/20241120_105633.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003e\u0026#34;Yes, we have no listings,\u0026#34; explained\n\u003cstrong\u003ePeter G.\n\u003c/strong\u003e fruitlessly. Check back next week.\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#2\"\u003e\u003cimg itemprop=\"image\" alt=\"2\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/listings.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003eIn a more fruitful vein, \n\u003cstrong\u003eJeremy P.\n\u003c/strong\u003e decided he \n\u0026#34;Needed to look up a word from NYT connections. The Apple\nbuilt in dictionary seems to have an unusual language\nbuilt in called \u0026#39;Apple\u0026#39;.  \u0026#39;Pilled\u0026#39; means \u0026#39;inappropriately\ninserted advert\u0026#39; in Apple.\u0026#34;\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#0\"\u003e\u003cimg itemprop=\"image\" alt=\"0\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/252/screenshot20241207at13.25.28.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\nCheck back next week as we bring you more seedy sites.\n\n\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://thedailywtf.com/images/inedo/proget-icon.png\"/\u003e [Advertisement] \n\tProGet’s got you covered with security and access controls on your NuGet feeds. \u003ca href=\"https://inedo.com/proget/private-nuget-server?utm_source=tdwtf\u0026amp;utm_medium=footer\u0026amp;utm_content=GotYouCoveredFooter\u0026amp;utm_campaign=Cyclops2020\"\u003eLearn more.\u003c/a\u003e\n\u003c/p\u003e\n\n\n        \u003c/div\u003e\n\n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-27T06:30:00Z",
  "modifiedTime": null
}
