{
  "id": "c05bafd3-dd17-4df3-8e8d-9bf12dff1c65",
  "title": "40k Key Learnings",
  "link": "https://www.penny-arcade.com/news/post/2024/09/30/40k-key-learnings",
  "description": "The boys and I decided to try and learn how to play 40K 10th edition. There’s a lot to learn and I figured we’d start with the basics. In order to learn the core rules we avoided playing with objective markers we decided to keep it simple and just try to kill each other's army in a straight up fight. Jerry, Kiko and Eric came over yesterday to play some 40k and teach us the rules. What they told us is that the game is not really balanced for the way we were playing and actually needed the objectives to work. This made sense because I have to say it was damn near impossible to beat Noah’s Death Guard army in a fist fight.",
  "author": "",
  "published": "Mon, 30 Sep 2024 17:02:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Gabe",
  "length": 2400,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "The boys and I decided to try and learn how to play 40K 10th edition. There’s a lot to learn and I figured we’d start with the basics. In order to learn the core rules we avoided playing with objective markers we decided to keep it simple and just try to kill each other's army in a straight up fight. Jerry, Kiko and Eric came over yesterday to play some 40k and teach us the rules. What they told us is that the game is not really balanced for the way we were playing and actually needed the objectives to work. This made sense because I have to say it was damn near impossible to beat Noah’s Death Guard army in a fist fight.  We spent something like seven hours yesterday playing 40k and learned a ton. The guys came over and brought their respective armies. The day consisted of Kiko’s Raven Guard vs. Gabe’s Tau, Jerry’s Tyranids vs. Noah’s Death Guard and Eric’s Adeptus Custodes vs. my Black Templars. The boys and I learned how to play objectives and it really makes the game a lot more interesting. We also learned that we were playing a bunch of individual rules wrong! 40k is a big game with a ton of stuff to learn. Beyond the core rules everyone needs to know, each faction has its own rules and abilities to learn. I discovered I tend to do much better when I have someone helping me remember all the stuff I can do. I’ve decided to spend some time this afternoon making tokens that I can use to keep track of things like Oath of the Moment, Templar Vows, Combat Doctrines, Stratagems as well as various auras and bonuses. I can use stickers for this! Speaking of stickers, we are packing up the October ones right now and should be delivering them to the office soon. Here’s a sneak peek at what Club PA members can expect in their october sticker packs: PA Halloween Sticker Sheet Thomas Jack-O'-Lantern In other news I’ll be opening up my October commissions tomorrow. I’ve been having a lot of fun doing these the past few months. One of the commissions I did last month was to redraw the old Strawberry Shortcake comic that got us into so much legal trouble back in the day. I don’t share the final commissions here because I think of them as belonging to the people who ordered them, but here’s a little peek of it during the coloring process.  So if you’re looking to get something drawn by me, keep an eye on the site tomorrow morning.  -Gabe Out",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection\u003e\n                            \u003cp\u003eThe boys and I decided to try and learn how to play 40K 10th edition. There’s a lot to learn and I figured we’d start with the basics. In order to learn the core rules we avoided playing with objective markers we decided to keep it simple and just try to kill each other\u0026#39;s army in a straight up fight. Jerry, Kiko and Eric came over yesterday to play some 40k and teach us the rules. What they told us is that the game is not really balanced for the way we were playing and actually needed the objectives to work. This made sense because I have to say it was damn near impossible to beat Noah’s Death Guard army in a fist fight. \u003c/p\u003e\n\n                            \u003cp\u003e\u003cbr/\u003eWe spent something like seven hours yesterday playing 40k and learned a ton. The guys came over and brought their respective armies. The day consisted of Kiko’s Raven Guard vs. Gabe’s Tau, Jerry’s Tyranids vs. Noah’s Death Guard and Eric’s Adeptus Custodes vs. my Black Templars. The boys and I learned how to play objectives and it really makes the game a lot more interesting. We also learned that we were playing a bunch of individual rules wrong! 40k is a big game with a ton of stuff to learn. Beyond the core rules everyone needs to know, each faction has its own rules and abilities to learn. I discovered I tend to do much better when I have someone helping me remember all the stuff I can do. I’ve decided to spend some time this afternoon making tokens that I can use to keep track of things like Oath of the Moment, Templar Vows, Combat Doctrines, Stratagems as well as various auras and bonuses. I can use stickers for this!\u003c/p\u003e\n\u003cp\u003eSpeaking of stickers, we are packing up the October ones right now and should be delivering them to the office soon. Here’s a sneak peek at what \u003ca href=\"https://www.patreon.com/ClubPA\" target=\"_blank\" rel=\"noopener\"\u003eClub PA members\u003c/a\u003e can expect in their october sticker packs:\u003c/p\u003e\n\u003cp\u003ePA Halloween Sticker Sheet\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4237.wxpj1qNk.jpg\" alt=\"\" width=\"525\" height=\"700\"/\u003e\u003c/p\u003e\n\u003cp\u003eThomas Jack-O\u0026#39;-Lantern\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4248.qg6Cx61o.jpg\" alt=\"\" width=\"525\" height=\"700\"/\u003e\u003c/p\u003e\n\u003cp\u003eIn other news I’ll be opening up my October \u003ca href=\"https://www.penny-arcade.com/news/post/2024/09/06/my-commissions-are-open\" target=\"_blank\" rel=\"noopener\"\u003ecommissions\u003c/a\u003e tomorrow. I’ve been having a lot of fun doing these the past few months. One of the commissions I did last month was to redraw \u003ca href=\"https://whatever.scalzi.com/2003/04/25/strawberry-shortcake-and-penny-arcade/\" target=\"_blank\" rel=\"noopener\"\u003ethe old Strawberry Shortcake comic\u003c/a\u003e that got us into so much legal trouble back in the day. I don’t share the final commissions here because I think of them as belonging to the people who ordered them, but here’s a little peek of it during the coloring process. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4238.Gdxk9g-F.jpg\" alt=\"\" width=\"561\" height=\"700\"/\u003e\u003cbr/\u003eSo if you’re looking to get something drawn by me, keep an eye on the site tomorrow morning. \u003c/p\u003e\n\u003cp\u003e\u003cbr/\u003e-Gabe Out\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
