{
  "id": "da6106bb-6025-4f7e-83a6-fc514597a4d1",
  "title": "Is It Ninja Guyden Or Ninja Gayden",
  "link": "https://www.penny-arcade.com/news/post/2025/01/29/is-it-ninja-guyden-or-ninja-gayden",
  "description": "The war over whether it was Guy or Gay raged in the schoolyards and cafeterias of Ridgeview Elementary School. We did not live in an age where such things could be resolved immediately. No, we lived in an age where such things were casus belli even though nobody actually had any grounding for their positions. We had not yet arrived at the era of a Resident Evil, where the game Resident Evil begins by literally saying the words \"Resident Evil\" out loud. We could agree that it was hard as fuck and that the ninja dude looked hellafied running in the intro. This allowed our congregation of youthful, callus-thumbed warriors to unite against the true threat: Jacquio, and his demon-cult.",
  "author": "",
  "published": "Wed, 29 Jan 2025 20:46:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 2170,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "The war over whether it was Guy or Gay raged in the schoolyards and cafeterias of Ridgeview Elementary School. We did not live in an age where such things could be resolved immediately. No, we lived in an age where such things were casus belli even though nobody actually had any grounding for their positions. We had not yet arrived at the era of a Resident Evil, where the game Resident Evil begins by literally saying the words \"Resident Evil\" out loud. We could agree that it was hard as fuck and that the ninja dude looked hellafied running in the intro. This allowed our congregation of youthful, callus-thumbed warriors to unite against the true threat: Jacquio, and his demon-cult. You would think having ready access to information of all kinds would resolve conflicts but that didn't end up happening, did it. It's like when I was young, and now it would appear Quite Dumb, when I thought that if we could just put this pesky Yahweh stuff on the back burner shit would be tight. Then I saw a schism inside this wizened cadre, bolstered by various Mind Professionals and Public Thinkers, about what we were supposed to do in the world now that we all agreed there was no God. That was fun! Hoo, boy. I've mentioned it before. For a long time, I really enjoyed threshing these things out and understanding the various forces and counter-forces that arise in a given context. I could put little labels on them and observe the movements, like the inside of a watch. What I do now is just imagine whatever the most opposite thing could be, even if it's opposition to something tested or broadly known, something to which opposition would almost certainly be characterized as a form of madness, and lo it emerges as though from the Deep. I might be wrong, but I seem to recall a portion where the pendulum actual swung between its endpoints on either side. My guess is that it's a function of overall communication volume itself. Now, apparently it just… warps, to the next extremity. Anyway, Gabe says the camera in Ninja Gaiden II Black is pretty bad. Just a heads up! (CW)TB out.",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003csection\u003e\n                            \u003cp\u003eThe war over whether it was Guy or Gay raged in the schoolyards and cafeterias of Ridgeview Elementary School. We did not live in an age where such things could be resolved immediately. No, we lived in an age where such things were \u003cem\u003ecasus belli\u003c/em\u003e even though nobody actually had any grounding for their positions. We had not yet arrived at the era of a Resident Evil, where the game Resident Evil begins by literally saying the words \u0026#34;Resident Evil\u0026#34; out loud. We could agree that it was hard as fuck and that the ninja dude looked hellafied running in the intro. This allowed our congregation of youthful, callus-thumbed warriors to unite against the true threat: Jacquio, and his demon-cult.\u003c/p\u003e                        \u003c/section\u003e\n\t\t\t\t\t\t\n                        \u003csection\u003e\n                            \u003cp\u003eYou would think having ready access to information of all kinds would \u003cem\u003eresolve\u003c/em\u003e conflicts but that didn\u0026#39;t end up happening, did it. It\u0026#39;s like when I was young, and now it would appear Quite Dumb, when I thought that if we could just put this pesky Yahweh stuff on the back burner shit would be tight. Then I saw a schism \u003cem\u003einside\u003c/em\u003e this wizened cadre, bolstered by various Mind Professionals and Public Thinkers, about what we were supposed to do in the world now that we all agreed there was no God. That was fun! Hoo, boy.\u003c/p\u003e\n\u003cp\u003eI\u0026#39;ve mentioned it before. For a long time, I really enjoyed threshing these things out and understanding the various forces and counter-forces that arise in a given context. I could put little labels on them and observe the movements, like the inside of a watch. What I do now is just imagine whatever the most opposite thing could be, even if it\u0026#39;s opposition to something tested or broadly known, something to which opposition would almost certainly be characterized as a form of madness, and lo it emerges as though from the Deep. I might be wrong, but I seem to recall a portion where the pendulum actual \u003cem\u003eswung\u003c/em\u003e between its endpoints on either side. My guess is that it\u0026#39;s a function of overall communication volume itself. Now, apparently it just… warps, to the next extremity.\u003c/p\u003e\n\u003cp\u003eAnyway, Gabe says the camera in Ninja Gaiden II Black \u003ca href=\"https://www.penny-arcade.com/comic/2025/01/29/is-it-ninja-guyden-or-ninja-gayden\"\u003eis pretty bad\u003c/a\u003e. Just a heads up!\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
