{
  "id": "ebe0afeb-6da7-4418-9a20-067e04482970",
  "title": "Error'd: Tangled Up In Blue",
  "link": "https://thedailywtf.com/articles/tangled-up-in-blue",
  "description": "...Screens of Death. Photos of failures in kiosk-mode always strike me as akin to the wizard being exposed behind his curtain. Yeah, that shiny thing is after all just some Windows PC on a stick. Here are a few that aren't particularly recent, but they're real. Jared S. augurs ill: \"Seen in downtown Mountain View, CA: In Silicon Valley AI has taken over. There is no past, there is no future, and strangely, even the present is totally buggered. However, you're free to restore the present if you wish.\"   Windows crashed Maurizio De Cecco's party and he is vexé. \"Some OS just doesn’t belong in the parisian nightlife,\" he grumbled. But neither does pulled pork barbecue and yet there it is.   Máté cut Windows down cold. \"Looks like the glaciers are not the only thing frozen at Matterhorn Glacier Paradise...\"   Thomas found an installer trying to apply updates \"in the Northwestern University's visitor welcome center, right smack in the middle of a nine-screen video display. I can only imagine why they might have iTunes or iCloud installed on their massive embedded display.\" I certainly can't.   Finally, Charles T. found a fast-food failure and was left entirely wordless. And hungry.   [Advertisement] Picking up NuGet is easy. Getting good at it takes time. Download our guide to learn the best practice of NuGet for the Enterprise.",
  "author": "Lyle Seaman",
  "published": "Fri, 15 Nov 2024 06:30:00 GMT",
  "source": "http://syndication.thedailywtf.com/TheDailyWtf",
  "categories": [
    "Error'd"
  ],
  "byline": "Lyle Seaman",
  "length": 1566,
  "excerpt": "...Screens of Death. Photos of failures in kiosk-mode always strike me as akin to the wizard being exposed behind his curtain. Yeah, that shiny thing is after all just some Windows PC on a stick. Here are a few that aren't particularly recent, but they're real. Jared S. augurs ill: \"Seen in downtown Mountain View, CA: In Silicon Valley AI has taken over. There is no past, there is no future, and strangely, even the present is totally buggered. However, you're free to restore the present if you wish.\"",
  "siteName": "The Daily WTF",
  "favicon": "",
  "text": "by in Error'd on 2024-11-15 Edit Lyle Seamannetworking, security infra and filesystems kernel hacker turned application programmer, SRE and engineering manager, Lyle traded tilting at windmills for viking at Vikings but couldn't catch any. ...Screens of Death. Photos of failures in kiosk-mode always strike me as akin to the wizard being exposed behind his curtain. Yeah, that shiny thing is after all just some Windows PC on a stick. Here are a few that aren't particularly recent, but they're real. Jared S. augurs ill: \"Seen in downtown Mountain View, CA: In Silicon Valley AI has taken over. There is no past, there is no future, and strangely, even the present is totally buggered. However, you're free to restore the present if you wish.\" Windows crashed Maurizio De Cecco's party and he is vexé. \"Some OS just doesn’t belong in the parisian nightlife,\" he grumbled. But neither does pulled pork barbecue and yet there it is. Máté cut Windows down cold. \"Looks like the glaciers are not the only thing frozen at Matterhorn Glacier Paradise...\" Thomas found an installer trying to apply updates \"in the Northwestern University's visitor welcome center, right smack in the middle of a nine-screen video display. I can only imagine why they might have iTunes or iCloud installed on their massive embedded display.\" I certainly can't. Finally, Charles T. found a fast-food failure and was left entirely wordless. And hungry.",
  "image": "https://thedailywtf.com/images/imageslws/viking.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv itemscope=\"\" itemtype=\"http://schema.org/Article\" id=\"article-page\"\u003e\n\n        \n        \u003cp\u003e\u003cspan\u003eby \n            in \u003ca itemprop=\"articleSection\" href=\"https://thedailywtf.com/series/errord\"\u003eError\u0026#39;d\u003c/a\u003e\n            on \u003cspan itemprop=\"datePublished\" content=\"2024-11-15\"\u003e2024-11-15\u003c/span\u003e\n            \u003ca href=\"https://thedailywtf.com/admin/article/edit/10782\" rel=\"nofollow\"\u003eEdit\u003c/a\u003e\n        \u003c/span\u003e\u003c/p\u003e\n        \u003cdiv itemprop=\"author\" itemscope=\"\" itemtype=\"http://schema.org/Person\"\u003e\n            \u003cp\u003e\u003cimg itemprop=\"image\" src=\"https://thedailywtf.com/images/imageslws/viking.jpg\"/\u003e\n            \u003ca itemprop=\"name\" href=\"https://thedailywtf.com/authors/lyle-seaman\"\u003eLyle Seaman\u003c/a\u003e\u003c/p\u003e\u003cp itemprop=\"description\"\u003enetworking, security infra and filesystems kernel hacker turned application programmer, SRE and engineering manager, Lyle traded tilting at windmills for viking at Vikings but couldn\u0026#39;t catch any.\u003c/p\u003e\n        \u003c/div\u003e\n        \u003cdiv itemprop=\"articleBody\"\u003e\n            \u003cp\u003e...Screens of Death.  Photos of failures in kiosk-mode always strike me as akin to the wizard being exposed behind his curtain. Yeah, that shiny thing is after all just some Windows PC on a stick. Here are a few that aren\u0026#39;t particularly recent, but they\u0026#39;re real.\n\u003c/p\u003e\n\n\u003cp\u003e\n\u003cstrong\u003eJared S.\n\u003c/strong\u003e augurs ill: \n\u0026#34;Seen in downtown Mountain View, CA: In Silicon Valley\nAI has taken over.  There is no past, there is no future,\nand strangely, even the present is totally buggered. \nHowever, you\u0026#39;re free to restore the present if you wish.\u0026#34;\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#0\"\u003e\u003cimg itemprop=\"image\" alt=\"0\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/246/img_2411sm.jpeg\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003eWindows crashed \n\u003cstrong\u003e\nMaurizio De Cecco\u0026#39;s\n\u003c/strong\u003e party and he is vexé.\n\u0026#34;Some OS just doesn’t belong in the parisian nightlife,\u0026#34; he grumbled. But neither does pulled pork barbecue and yet there it is.\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#1\"\u003e\u003cimg itemprop=\"image\" alt=\"1\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/246/img_4360.jpeg\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003e\n\u003cstrong\u003e\nMáté\n\u003c/strong\u003ecut Windows down \u003cem\u003ecold\u003c/em\u003e.\n\u0026#34;Looks like the glaciers are not the only thing frozen at Matterhorn Glacier Paradise...\u0026#34;\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#2\"\u003e\u003cimg itemprop=\"image\" alt=\"2\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/246/zermattbsod.jpeg\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003e\n\u003cstrong\u003eThomas\n\u003c/strong\u003e\nfound an installer trying to apply updates\n\u0026#34;in the Northwestern University\u0026#39;s visitor\nwelcome center, right smack in the middle of a nine-screen\nvideo display. I can only imagine why they might have\niTunes or iCloud installed on their massive embedded display.\u0026#34; I certainly can\u0026#39;t.\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#3\"\u003e\u003cimg itemprop=\"image\" alt=\"3\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/246/errord20221121.jpeg\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003eFinally, \n\u003cstrong\u003eCharles T.\n\u003c/strong\u003e found a fast-food failure and was left entirely wordless. And hungry.\n\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca href=\"#4\"\u003e\u003cimg itemprop=\"image\" alt=\"4\" src=\"https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/246/4c84fe8013874954858ce632474fe5b1.jpeg\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\n\n        \u003c/div\u003e\n\n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-15T06:30:00Z",
  "modifiedTime": null
}
