{
  "id": "fb10b072-43c8-4f86-ae94-ebd6ff07e45d",
  "title": "'Someone is listing it on eBay for $20,000': Millennial discovers a ‘rare' Princess Dianna Beanie Baby in their mom's attic, then get a hilarious reality check when they realize it's nearly worthless",
  "link": "https://cheezburger.com/38554117/someone-is-listing-it-on-ebay-for-20000-millennial-discovers-a-rare-princess-dianna-beanie-baby-in",
  "description": "If you're as chronically online as we all are, you've probably seen that viral picture of the couple dividing their Beanie Baby collection on the courtroom floor during their divorce. Back in the 90s, Beanie Babies were all the rage and rubes everywhere lined up to buy these collectible children's toys under the guise that they'd one day be valuable enough to pay for their kid's college education. Welp, I'm a millennial and grew up with a box full of Beanies and while I played with a select few toys, my parents kept the 'valuable' ones up in a plastic box on the highest shelf in my room. As the Princess Diana bear looked down at me from the highest throne in my bedroom, I imagined the glorious things I'd do with my paid-for college education–because one day, this Beanie would be sold to pay for it all!Here we are, two decades later, and that purple bear is nearly worthless, I'm up to my ears in student loans, and I'm starting to wonder what sort of Ty-brand hypnosis fooled an entire generation of boomers… It must be the same Kool-aid all of the crypto bros are drinking.",
  "author": "Jesse Kessenheimer",
  "published": "Fri, 03 Jan 2025 13:00:00 -0800",
  "source": "http://feeds.feedburner.com/failblog",
  "categories": [
    "millennial",
    "millennial humor",
    "elder millennial",
    "boomer",
    "millennials",
    "lol",
    "beanie baby",
    "baby boomers",
    "boomers",
    "Reddit",
    "funny",
    "beanies",
    "princess diana",
    "Reality Check",
    "millennial-nostalgia"
  ],
  "byline": "Jesse Kessenheimer",
  "length": 773,
  "excerpt": "'Someone is listing it on eBay for $20,000': Millennial discovers a ‘rare' Princess Dianna Beanie Baby in their mom's attic, then get a hilarious reality check when they realize it's nearly worthless - The internet has generated a huge amount of laughs from cats and FAILS. And we all out of cats.",
  "siteName": "FAIL Blog",
  "favicon": "https://i.chzbgr.com/s/unversioned/images/square_logos/FailBlog.png",
  "text": "While any millennial can appreciate a crisp-looking Beanie Baby tag, we all know that one crease in that paper means this toy is no longer mint. A strange concept to introduce to an entire generation of young children, but this idea of keeping things pristine certainly followed every millennial into adulthood. When did your rebelliousness first take flight? Was it when you took the plastic cover off of your Beanie Baby's tags?  Keep scrolling to read about this millennial who discovered a ‘rare’ Diana bear in their parent's attic and got a hilariously entertaining wake-up call about the Beanie's real value. Because when you're looking for a straight answer about something, best head to the Internet before listing a children's stuffed animal on eBay for $250,000.",
  "image": "https://i.chzbgr.com/original/38554117/h3E08321B/beanies-beanie-baby-princess-diana-rare-funny-humor-lol-reality-check-reddit-value-price-worth",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWhile any millennial can appreciate a crisp-looking Beanie Baby tag, we all know that one crease in that paper means this toy is no longer mint. A strange concept to introduce to an entire generation of young children, but this idea of keeping things pristine certainly followed every millennial into adulthood. \u003c/p\u003e\u003cp\u003eWhen did your rebelliousness first take flight? Was it when you took \u003ca href=\"https://cheezburger.com/38526213/my-new-favorite-customer-contractor-in-awe-after-a-determined-homeowner-pays-35-to-put-a-stop\"\u003ethe plastic cover \u003c/a\u003eoff of your Beanie Baby\u0026#39;s tags? \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\n\u003cp\u003eKeep scrolling to read about this millennial who discovered a ‘rare’ Diana bear in their parent\u0026#39;s attic and got a hilariously entertaining wake-up call about the Beanie\u0026#39;s real value. Because when you\u0026#39;re looking for a straight answer about something, best head to the Internet before listing a children\u0026#39;s stuffed animal on eBay for $250,000.\u003c/p\u003e\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-01-03T13:00:00-08:00",
  "modifiedTime": null
}
