{
  "id": "0eb6c592-6f83-4fd1-81aa-9da43dbd6c82",
  "title": "Google Adds Two Features to Android to Fight Unwanted Bluetooth Tracking",
  "link": "https://www.droid-life.com/2024/12/11/google-adds-two-features-to-android-to-fight-unwanted-bluetooth-tracking/",
  "description": "Google already had some protections in place for when an unknown or unwanted Bluetooth tracker is hanging around you for too long. To further strengthen those protections, Google announced two new features today that both make a lot of sense and are welcomed. For those not familiar with the topic, we’re talking about Bluetooth trackers … Continued Read the original post: Google Adds Two Features to Android to Fight Unwanted Bluetooth Tracking",
  "author": "Kellen",
  "published": "Wed, 11 Dec 2024 21:39:47 +0000",
  "source": "https://www.droid-life.com/feed",
  "categories": [
    "News",
    "Android",
    "Find My Device",
    "Google"
  ],
  "byline": "Kellen",
  "length": 1887,
  "excerpt": "Google already had some protections in place for when an unknown or unwanted Bluetooth tracker is hanging around you for too long. To further strengthen those protections, Google announced two new features today that both make a lot of sense and are welcomed. For those not familiar with the...",
  "siteName": "Droid Life",
  "favicon": "https://www.droid-life.com/favicon-512x512.png",
  "text": "December 11, 2024 We may earn a commission when you click links to retailers and purchase goods. More info. Google already had some protections in place for when an unknown or unwanted Bluetooth tracker is hanging around you for too long. To further strengthen those protections, Google announced two new features today that both make a lot of sense and are welcomed. For those not familiar with the topic, we’re talking about Bluetooth trackers like an AirTag or Pebblebee that you might use to track luggage or your keys. Unfortunately, weirdos use them to track people too. While that would be OK if you were keeping an eye on your child, it’s not exactly OK when someone uses them to track someone who might not want to be tracked. You know, like a stalker stalking a victim using a tracking tag. Make sense? The first of the two new features of a way for you to temporarily pause your phone’s location updates that could send info to a tracking device. You can do this for up to 24 hours as a way to give you time to locate the tracker. The other is a feature that lets you “Find Nearby” trackers after receiving an unknown tracking alert and then pinpointing its exact location. Here’s how Google describes these two: Temporarily Pause Location: You can now temporarily pause location updates from your phone to prevent your device’s location from being used by a detected unknown tag for up to 24 hours. This provides an extra layer of privacy and control, allowing you to take a first action quickly while you locate and physically disable the tag. Find Nearby: If you receive an unknown tracker alert, you can now use the “Find Nearby” feature to pinpoint the tag’s location. Your Android device will guide you to the tag, to help you find it if it’s hidden. These two features are “rolling out” as you read this. // Google",
  "image": "https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-1200x628-cropped.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \u003cmain\u003e\n                      \n            \n                       \u003carticle\u003e\n  \u003cheader\u003e\n    \n    \u003cp\u003e\n  \u003ctime datetime=\"2024-12-11T21:39:47+00:00\"\u003eDecember 11, 2024\u003c/time\u003e\n        \n  \u003c/p\u003e\n    \n\n\n  \u003c/header\u003e\n\t\n      \u003cp\u003e\u003cimg width=\"980\" height=\"611\" src=\"https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-980x611.jpg\" alt=\"Android Unknown Tracker Alert\" decoding=\"async\" data-object-fit=\"cover\" fetchpriority=\"high\" srcset=\"https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-980x611.jpg 980w, https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-270x168.jpg 270w, https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-768x479.jpg 768w, https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-1536x957.jpg 1536w, https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-1366x851.jpg 1366w, https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert-1920x1196.jpg 1920w, https://www.droid-life.com/wp-content/uploads/2024/12/Android-Unknown-Tracker-Alert.jpg 1926w\" sizes=\"(max-width: 980px) 100vw, 980px\" data-wp-pid=\"305764\"/\u003e\n\u003c/p\u003e\n    \n\u003cp\u003eWe may earn a commission when you click links to retailers and purchase goods. \u003ca href=\"https://www.droid-life.com/privacy-policy/\" target=\"_blank\"\u003eMore info.\u003c/a\u003e\u003c/p\u003e\n  \n    \u003cdiv data-sticky-container=\"\"\u003e\n        \u003cp\u003eGoogle already had \u003ca href=\"https://www.droid-life.com/2023/07/27/google-rolls-out-androids-unknown-tracker-alerts-from-airtags/\"\u003esome protections\u003c/a\u003e in place for when an unknown or unwanted Bluetooth tracker is hanging around you for too long. To further strengthen those protections, Google announced two new features today that both make a lot of sense and are welcomed.\u003c/p\u003e\n\u003cp\u003eFor those not familiar with the topic, we’re talking about Bluetooth trackers like an AirTag or \u003ca href=\"https://www.droid-life.com/tag/pebblebee\"\u003ePebblebee\u003c/a\u003e that you might use to track luggage or your keys. Unfortunately, weirdos use them to track people too. While that would be OK if you were keeping an eye on your child, it’s not exactly OK when someone uses them to track someone who might not want to be tracked. You know, like a stalker \u003cem\u003estalking\u003c/em\u003e a victim using a tracking tag. Make sense?\u003c/p\u003e\n\u003cp\u003eThe first of the two new features of a way for you to temporarily pause your phone’s location updates that could send info to a tracking device. You can do this for up to 24 hours as a way to give you time to locate the tracker. The other is a feature that lets you “Find Nearby” trackers after receiving an unknown tracking alert and then pinpointing its exact location.\u003c/p\u003e\n\u003cp\u003eHere’s how Google describes these two:\u003c/p\u003e\n\u003cul\u003e\n\u003cli data-block-key=\"189f7\"\u003e\u003cb\u003eTemporarily Pause Location:\u003c/b\u003e You can now temporarily pause location updates from your phone to prevent your device’s location from being used by a detected unknown tag for up to 24 hours. This provides an extra layer of privacy and control, allowing you to take a first action quickly while you locate and physically disable the tag.\u003c/li\u003e\n\u003cli data-block-key=\"87beu\"\u003e\u003cb\u003eFind Nearby:\u003c/b\u003e If you receive an unknown tracker alert, you can now use the “Find Nearby” feature to pinpoint the tag’s location. Your Android device will guide you to the tag, to help you find it if it’s hidden.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThese two features are “rolling out” as you read this.\u003c/p\u003e\n\u003cp\u003e// \u003ca href=\"https://blog.google/feed/android-unknown-tracker-alerts/\"\u003eGoogle\u003c/a\u003e\u003c/p\u003e\n      \u003c/div\u003e\n\u003c/article\u003e\n\n\n  \n\n\t\n\n\n        \n                    \n          \n          \n        \u003c/main\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-11T21:39:47Z",
  "modifiedTime": "2024-12-11T21:39:47Z"
}
