{
  "id": "22e5f926-7cf9-4c63-82a2-17899e866fbf",
  "title": "Nintendo's past partnership with Philips could have turned it into a very different, very weird company",
  "link": "https://www.xda-developers.com/nintendos-past-partnership-philips/",
  "description": "The partnership with Nintendo and Philips could have been a very different beast.",
  "author": "Jakejames Lugo",
  "published": "Thu, 19 Jun 2025 01:00:19 GMT",
  "source": "https://www.xda-developers.com/feed/",
  "categories": [
    "Gaming",
    "Nintendo",
    "Philips",
    "Retro Gaming"
  ],
  "byline": "Jakejames Lugo",
  "length": 18820,
  "excerpt": "The partnership with Nintendo and Philips could have been a very different beast.",
  "siteName": "XDA",
  "favicon": "https://static0.xdaimages.com/assets/images/favicon-240x240.43161a66.png",
  "text": "In the early 1990s, Nintendo and tech company Philips collaborated for game releases on an interactive CD player known as the CD-i. This business partnership came in the wake of a failed collaboration between Sony and Nintendo, which historically was the catalyst that led to the creation of the first PlayStation console. But while that was going on, Nintendo licensed some of their franchises to Philips in order to release games for the CD-i. Unfortunately, the reception of the games and the CD-i was less than stellar, which eventually culminated in the unit being discontinued by 1998. Following that, Nintendo would go on to make their own disc-based console with the Nintendo GameCube, but only after years of sticking with cartridge-based releases while their competition moved forward with putting games onto compact discs. All of these events were tied together because of the business decisions made by Nintendo at that time, but things could have turned out very differently. If the success of the Philips CD-i were different and the games were well-received by players, it would have been Nintendo leading the charge with CD technology for video games, and being unrecognizable from what we know today. This means that the landscape of gaming, and ultimately the console wars throughout the decades, would have unfolded very differently from what we know now. But maybe we're all better off with how things ultimately happen. Here's why Nintendo's past partnership with Philips could have turned it into a very different, and very weird company. Related 4 80's game consoles you totally forgot existed Here are some video game consoles from the 1980s that you completely forgot about, but were a big deal! CD technology pioneers Nintendo before Sony with CD games Source: Philips Interactive One of the main reasons why Nintendo was looking to partner with another company back in the late 80s and early 90s was the rise of Compact Disc technology. The application of CDs to multimedia was intriguing to many companies looking for the next big trend, and Nintendo was no exception. It's the main reason why Sony and Nintendo had discussions, and eventually a prototype console, that would have seen Nintendo games released on CDs in the early 90s. But as that partnership broke down, Nintendo got together with Philips for what would eventually be the release of CD-i games with Nintendo properties. There were four officially released games that were based on The Legend of Zelda and the Super Mario series. Two more Mario-related games were planned, but were canceled before they were completed. Ultimately, these games were critically panned and a commercial failure. But what if they weren't, and the partnership with Nintendo and Philips was a big success? Chances are, we would've seen more big Nintendo franchises released on the CD-i beyond Super Mario and The Legend of Zelda. In 1990, when the CD-i was first released, Nintendo released games for the NES, such as Super Mario Bros. 3, Punch-Out, and Dr. Mario. It's reasonable to think that the company would have tried to develop, or even find ways to port over, games like those to work with the CD-i. Being that the collaboration with Philips was Nintendo licensing their franchises out to another company, it's also reasonable to think that Nintendo may have been more open to doing the same thing with other companies. This would be very different from how the company operates nowadays. Nintendo is notorious for being fiercely protective of its franchises, since in the past, allowing others to control its characters has led to terrible results, like what ultimately happened with the CD-i. A looser Nintendo might also mean that the industry could've seen a variety of interpretations of their characters, far removed from the image that the company has maintained for so long now. Maybe a dark interpretation of games like Super Mario Bros. or Kid Icarus could have been intriguing in another universe. A different kind of '90s console war Less about games, more about tech One of the big components of the console war between Sega and Nintendo in the 90s was the kinds of software people were playing. Sonic the Hedgehog on Genesis had a different attitude and vibe than Super Mario did on the SNES. However, the consoles competed with one another on various fronts that involved different software releases, but not as much when it came to hardware. Super Nintendo had the edge with the Super FX chip release, which led to games like Star Fox coming out. On the other hand, the Sega Genesis had the edge in marketing and was very different aesthetically, aiming towards a more mature audience. But the games were still the focal point of debates and big moments between the two consoles. All of this could have been very different if Nintendo had still been partnered with Philips and had become the front-runner in the changes to technology of that era. CD technology became a bigger factor in games in the mid-90s, following the release of the PlayStation and Sega-CD add-on. Nintendo didn't focus on this too much with the Super Nintendo, nor the Nintendo 64 years later. However, their approach to being an industry leader could've very much involved CD technology more if their partnership with Philips had been more successful with the CD-i. That unit being a hit would have let them become a major player with Philips in games that were being brought to the new format, which would have also prompted the competition to change their strategies as well. This includes not only Sega but also other companies like 3DO, SNK, and others who saw CD-based console releases around that time. The console wars could have been a race of hardware, where the company that had the best games on CDs would have been the console that garnered the most attention from players. A result of that could have been Nintendo becoming a company with a greater emphasis on hardware advancement, as opposed to just focusing on good game releases. Instead of the company having the Nintendo Optical Discs that were on the GameCube in the early 2000s, we may have gotten actual CDs for Nintendo games at a much earlier time, which might've had both the Nintendo and Philips logos on them. Would these have been games to compete with the size of those that were on the PlayStation? Possibly, but there's no way to tell now. Source: Frédéric BISSON A completely different future Nintendo is a unique company within the gaming industry, which has a long and storied history for many people. A lot of their success has come from the business decisions they've made that have impacted a variety of things, not just the kinds of games we saw released. In the end, the partnership with Philips was never going to work out, especially with the games' poor reception resulting from the two companies working together. Nintendo just has a different outlook on quality and levels of success for its own business. But it's fun to speculate on how weird and different the company would have been with that small change to history. Today's Nintendo would have been a very different kind of entity within an industry that would've taken many different turns. Does this mean that Philips' past partnership with Nintendo was entirely bad? Not really, given the after-effects of their working relationship. We can believe that many of the great and iconic games that came after that were partially due to what the company decided to avoid from that collaboration. The delay of Nintendo putting their games on CDs might've given the competition a lead at the time, but events unfolded that ended up seeing most of them fade away, while Nintendo eventually made the leap in the years that followed. The Nintendo we know now is a direct result of that, and we're all better off because of it. But things could have been very different in significant ways, yet we'll never truly know. Related The 5 rarest Super Nintendo games you may never own Even if you're a huge fan of the Super Nintendo, you may never get to own these games. Here's why these Super Nintendo games are so valuable!",
  "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/nintendoandphilipseditorial_featuredimage.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\u003cp\u003eIn the early 1990s, Nintendo and tech company Philips collaborated for game releases on an interactive CD player known as the CD-i. This business partnership came in the wake of a failed collaboration between Sony and Nintendo, which historically was the catalyst that led to the creation of the first PlayStation console. But while that was going on, Nintendo licensed some of their franchises to Philips in order to release games for the CD-i. Unfortunately, the reception of the games and the CD-i was less than stellar, which eventually culminated in the unit being discontinued by 1998. Following that, Nintendo would go on to make their own disc-based console with the Nintendo GameCube, but only after years of sticking with cartridge-based releases while their competition moved forward with putting games onto compact discs.\u003c/p\u003e    \u003cp\u003eAll of these events were tied together because of the business decisions made by Nintendo at that time, but things could have turned out very differently. If the success of the Philips CD-i were different and the games were well-received by players, it would have been \u003ca href=\"https://www.xda-developers.com/rare-pieces-nintendo-history-youll-never-own/\" target=\"_blank\"\u003eNintendo leading the charge\u003c/a\u003e with CD technology for video games, and being unrecognizable from what we know today. This means that the landscape of gaming, and ultimately the console wars throughout the decades, would have unfolded very differently from what we know now. But maybe we\u0026#39;re all better off with how things ultimately happen. Here\u0026#39;s why Nintendo\u0026#39;s past partnership with Philips could have turned it into a very different, and very weird company.\u003c/p\u003e            \n    \n                    \n                        \n    \n    \n                                        \n    \n        \n    \n        \n                \n        \n    \u003cdiv data-include-community-rating=\"false\" id=\"fb31-4c2d-b3692595f0ec\" data-nosnippet=\"\"\u003e\n        \n        \n                        \t                \n\t\t\u003ca href=\"https://www.xda-developers.com/80s-game-consoles-you-totally-forgot-existed/\"\u003e\n\t\n\t\u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"A picture of the Sega SG-1000 next to a Famicom.\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/05/80sconsolesyouforgotexisted_newfeaturedimage.jpg\"/\u003e\n        \n    \u003c/picture\u003e\n                \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\t\t\u003c/a\u003e\n\t\n\n        \n                    \u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\n\n                \n                 \n                \t\n\u003ch5\u003e\n\t\n\n\t\t\t\t\t        \t\t\t\t\n\t\t\u003ca href=\"https://www.xda-developers.com/80s-game-consoles-you-totally-forgot-existed/\" title=\"4 80\u0026#39;s game consoles you totally forgot existed\" target=\"_blank\"\u003e\n\t\t\t4 80\u0026#39;s game consoles you totally forgot existed\n\t\t\u003c/a\u003e\n\t\u003c/h5\u003e\n\n                                                    \n                \t\t\t\t\t\t\t\t\t\u003cp\u003eHere are some video game consoles from the 1980s that you completely forgot about, but were a big deal!\u003c/p\u003e\n\t\t\t\n\n                    \n\n\n                \n                \n                \n                \n\n                \n                \n                \n                \t\n\n\n                \n\n                \n                \n                \n            \u003c/div\u003e\n                \n        \n        \n        \n            \u003c/div\u003e\n\u003ch2 id=\"cd-technology-pioneers\"\u003e\n                        CD technology pioneers\n               \u003c/h2\u003e\u003ch3 id=\"nintendo-before-sony-with-cd-games\"\u003e\n            Nintendo before Sony with CD games\n    \u003c/h3\u003e\n\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv\u003e\n        \u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg\" data-img-desc=\"\u0026#34;Source: Philips Interactive\u0026#34;\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"A screenshot of gameplay from The Legend of Zelda: The Wand of Ganon\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/zeldawandofganon_nintendoandphilipseditorial_pic01.jpg\"/\u003e\n        \n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n                                    \u003cp\u003eSource: Philips Interactive\u003c/p\u003e\n                        \u003c/div\u003e\n\u003cp\u003e One of the main reasons why Nintendo was looking to partner with another company back in the late 80s and early 90s was the rise of Compact Disc technology. The application of CDs to multimedia was intriguing to many companies looking for the next big trend, and Nintendo was no exception. It\u0026#39;s the main reason why Sony and Nintendo had discussions, and eventually a prototype console, that would have seen Nintendo games released on CDs in the early 90s. But as that partnership broke down, Nintendo got together with Philips for what would eventually be the release of CD-i games with Nintendo properties. There were four officially released games that were based on \u003ca href=\"https://www.xda-developers.com/how-zelda-evolved-since-8-bit-nes-era/\" target=\"_blank\"\u003e\u003cem\u003eThe Legend of Zelda\u003c/em\u003e\u003c/a\u003e and the \u003cem\u003eSuper Mario\u003c/em\u003e series. Two more Mario-related games were planned, but were canceled before they were completed.\u003c/p\u003e    \u003cp\u003eUltimately, these games were critically panned and a commercial failure. But what if they weren\u0026#39;t, and the partnership with Nintendo and Philips was a big success? Chances are, we would\u0026#39;ve seen more big Nintendo franchises released on the CD-i beyond \u003cem\u003eSuper Mario\u003c/em\u003e and \u003cem\u003eThe Legend of Zelda\u003c/em\u003e. In 1990, when the CD-i was first released, Nintendo released games for the NES, such as \u003cem\u003eSuper Mario Bros. 3\u003c/em\u003e, \u003cem\u003ePunch-Out\u003c/em\u003e, and \u003cem\u003eDr. Mario\u003c/em\u003e. It\u0026#39;s reasonable to think that the company would have tried to develop, or even find ways to port over, games like those to work with the CD-i.\u003c/p\u003e    \u003cp\u003eBeing that the collaboration with Philips was Nintendo licensing their franchises out to another company, it\u0026#39;s also reasonable to think that Nintendo may have been more open to doing the same thing with other companies. This would be very different from how the company operates nowadays. Nintendo is notorious for being fiercely protective of its franchises, since in the past, allowing others to control its characters has led to terrible results, like what ultimately happened with the CD-i. A looser Nintendo might also mean that the industry could\u0026#39;ve seen a variety of interpretations of their characters, far removed from the image that the company has maintained for so long now. Maybe a dark interpretation of games like \u003cem\u003eSuper Mario Bros.\u003c/em\u003e or \u003cem\u003eKid Icarus\u003c/em\u003e could have been intriguing in another universe.\u003c/p\u003e    \u003ch2 id=\"a-different-kind-of-39-90s-console-war\"\u003e\n                        A different kind of \u0026#39;90s console war\n               \u003c/h2\u003e\u003ch3 id=\"less-about-games-more-about-tech\"\u003e\n            Less about games, more about tech\n    \u003c/h3\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n    \n\u003cp\u003eOne of the big components of the console war between Sega and Nintendo in the 90s was the kinds of software people were playing. Sonic the Hedgehog on Genesis had a different attitude and vibe than Super Mario did on the SNES. \u003cspan\u003eHowever, the \u003ca href=\"https://www.xda-developers.com/80s-game-consoles-you-totally-forgot-existed/\" target=\"_blank\"\u003econsoles competed\u003c/a\u003e\u003c/span\u003e with one another on various fronts that involved different software releases, but not as much when it came to hardware. Super Nintendo had the edge with the Super FX chip release, which led to games like \u003cem\u003eStar Fox\u003c/em\u003e coming out. On the other hand, the Sega Genesis had the edge in marketing and was very different aesthetically, aiming towards a more mature audience. But the games were still the focal point of debates and big moments between the two consoles. All of this could have been very different if Nintendo had still been partnered with Philips and had become the front-runner in the changes to technology of that era.\u003c/p\u003e    \u003cp\u003eCD technology became a bigger factor in games in the mid-90s, following the release of \u003ca href=\"https://www.xda-developers.com/rarest-playstation-1-games-you-may-never-own/\" target=\"_blank\"\u003ethe PlayStation\u003c/a\u003e and Sega-CD add-on. Nintendo didn\u0026#39;t focus on this too much with the Super Nintendo, nor the Nintendo 64 years later. However, their approach to being an industry leader could\u0026#39;ve very much involved CD technology more if their partnership with Philips had been more successful with the CD-i. That unit being a hit would have let them become a major player with Philips in games that were being brought to the new format, which would have also prompted the competition to change their strategies as well.\u003c/p\u003e    \u003cp\u003eThis includes not only Sega but also other companies like 3DO, SNK, and others who saw CD-based console releases around that time. The console wars could have been a race of hardware, where the company that had the best games on CDs would have been the console that garnered the most attention from players. A result of that could have been Nintendo becoming a company with a greater emphasis on hardware advancement, as opposed to just focusing on good game releases. Instead of the company having the Nintendo Optical Discs that were on the GameCube in the early 2000s, we may have gotten actual CDs for Nintendo games at a much earlier time, which might\u0026#39;ve had both the Nintendo and Philips logos on them. Would these have been games to compete with the size of those that were on the PlayStation? Possibly, but there\u0026#39;s no way to tell now.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv\u003e\n        \u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg\" data-img-desc=\"\u0026#34;Source:\u0026amp;nbsp;Fr\u0026amp;eacute;d\u0026amp;eacute;ric BISSON\u0026#34;\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"A picture of a Philips CD-i running Hotel Mario at an event\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/philipscdi_nintendoandphilipseditorial_pic01.jpg\"/\u003e\n        \n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n                                    \u003cp\u003eSource: Frédéric BISSON\u003c/p\u003e\n                        \u003c/div\u003e\n\u003ch3 id=\"a-completely-different-future\"\u003e\n            A completely different future\n    \u003c/h3\u003e\n\u003cp\u003eNintendo is \u003ca href=\"https://www.xda-developers.com/the-3-best-things-about-the-nintendo-64-that-everyone-forgets/\" target=\"_blank\"\u003ea unique company\u003c/a\u003e within the gaming industry, which has a long and storied history for many people. A lot of their success has come from the business decisions they\u0026#39;ve made that have impacted a variety of things, not just the kinds of games we saw released. In the end, the partnership with Philips was never going to work out, especially with the games\u0026#39; poor reception resulting from the two companies working together. Nintendo just has a different outlook on quality and levels of success for its own business. But it\u0026#39;s fun to speculate on how weird and different the company would have been with that small change to history. Today\u0026#39;s Nintendo would have been a very different kind of entity within an industry that would\u0026#39;ve taken many different turns.\u003c/p\u003e    \u003cp\u003eDoes this mean that Philips\u0026#39; past partnership with Nintendo was entirely bad? Not really, given the after-effects of their working relationship. We can believe that many of the great and iconic games that came after that were partially due to what the company decided to avoid from that collaboration. The delay of Nintendo putting their games on CDs might\u0026#39;ve given the competition a lead at the time, but events unfolded that ended up seeing most of them fade away, while Nintendo eventually made the leap in the years that followed. The Nintendo we know now is a direct result of that, and we\u0026#39;re all better off because of it. But things could have been very different in significant ways, yet we\u0026#39;ll never truly know.\u003c/p\u003e            \n    \n                    \n                        \n    \n    \n                                        \n    \n        \n    \n        \n                \n        \n    \u003cdiv data-include-community-rating=\"false\" id=\"eae1-4c6e-93457be62931\" data-nosnippet=\"\"\u003e\n        \n        \n                        \t                \n\t\t\u003ca href=\"https://www.xda-developers.com/5-rarest-super-nintendo-games-you-may-never-own/\"\u003e\n\t\n\t\u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\n                    \n                    \u003cimg width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\" alt=\"A combination of Super Nintendo games\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/06/rarestsupernintendogameseditorial_featuredimage.jpg\"/\u003e\n        \n    \u003c/picture\u003e\n                \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\t\t\u003c/a\u003e\n\t\n\n        \n                    \u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\n\n                \n                 \n                \t\n\u003ch5\u003e\n\t\n\n\t\t\t\t\t        \t\t\t\t\n\t\t\u003ca href=\"https://www.xda-developers.com/5-rarest-super-nintendo-games-you-may-never-own/\" title=\"The 5 rarest Super Nintendo games you may never own\" target=\"_blank\"\u003e\n\t\t\tThe 5 rarest Super Nintendo games you may never own\n\t\t\u003c/a\u003e\n\t\u003c/h5\u003e\n\n                                                    \n                \t\t\t\t\t\t\t\t\t\u003cp\u003eEven if you\u0026#39;re a huge fan of the Super Nintendo, you may never get to own these games. Here\u0026#39;s why these Super Nintendo games are so valuable!\u003c/p\u003e\n\t\t\t\n\n                    \n\n\n                \n                \n                \n                \n\n                \n                \n                \n                \t\n\n\n                \n\n                \n                \n                \n            \u003c/div\u003e\n                \n        \n        \n        \n            \u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "20 min read",
  "publishedTime": "2025-06-19T01:00:19Z",
  "modifiedTime": "2025-06-19T01:00:19Z"
}
