{
  "id": "39ad6729-027a-4ef4-902b-f174b533cc76",
  "title": "Realme GT 7 and 7T go global, first Nothing Phone (3) teaser, Week 22 in review",
  "link": "https://www.gsmarena.com/realme_gt_7_and_7t_go_global_first_nothing_phone_3_teaser_week_22_in_review-news-68038.php",
  "description": "The Galaxy A57, which is expected in Q1 of 2026, will likely use a new Exynos 1680 chipset. The Exynos 1680 allegedly has the model designation S5E8865 and the codename Terra. No other details are known about it yet, but it is probably safe to assume that it will use an Xclipse GPU just like its predecessor. We saw the first glimpse of the Nothing Phone (3). More specifically, a macro shot of a part of the phone. Not much we can get from it, but perfectly in line with Nothing's style. Motorola's Moto G family is soon going to get another member, the Moto G96. It will be powered by...",
  "author": "",
  "published": "Sun, 01 Jun 2025 21:21:02 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Ivan",
  "length": 2939,
  "excerpt": "The Samsung Galaxy A57 will bring a new Exynos 1680 SoC. The Galaxy A57, which is expected in Q1 of 2026, will likely use a new Exynos 1680 chipset. The...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "The Galaxy A57, which is expected in Q1 of 2026, will likely use a new Exynos 1680 chipset. The Exynos 1680 allegedly has the model designation S5E8865 and the codename Terra. No other details are known about it yet, but it is probably safe to assume that it will use an Xclipse GPU just like its predecessor. We saw the first glimpse of the Nothing Phone (3). More specifically, a macro shot of a part of the phone. Not much we can get from it, but perfectly in line with Nothing's style. Motorola's Moto G family is soon going to get another member, the Moto G96. It will be powered by Qualcomm's Snapdragon 7s Gen 2 SoC and we saw images of it. The phone will boast 12 GB of RAM and 256 GB of storage. It will have a 6.67-inch pOLED curved screen with a 144 Hz refresh rate, and a 5,500 mAh battery. On the rear, there's a 50 MP main camera using Sony's Lytia LYT-700C sensor, and an 8 MP macro camera. For selfies, you'll get a 32 MP snapper on the front. The device will be offered in Cattleya Orchid, Dresden Blue, Greener Pastures, and Ashleigh Blue colorways. It's expected to cost around INR 22,990 when it lands in India, which right now translates into approximately $270. It's unclear what other markets it might launch in. The Realme GT 7 and GT 7T made their global debut. The GT 7 uses the Dimensity 9400e chipset and features a 6.8-inch 120Hz AMOLED display, 50 MP main and 2x telephoto cameras and an 8 MP ultrawide shooter. It's powered by a 7,000mAh battery with 120W charging. The GT 7T uses the Dimensity 8400-Max, and lacks a zoom camera, but has the same 7,000mAh battery. The Pixel 10 Pro (or Pixel 10 Pro XL) was spotted on a public beach in Vancouver, Canada, where it was filmed for a TV ad. The video crew wasn't working hard on keeping the phone a mystery, and the person who stumbled upon the set even got a glance at the storyboard (a visual script of all scenes that make up the video clip). Google will launch the Pixel 10 with a new camera feature that will allow users to add multiple people to the same shot. The Pixel 10 series could come in August. OnePlus announced a slew of AI features, which will debut alongside the OnePlus 13s. The phone has a dedicated Plus Key on the side, replacing the iconic Alert slider. The new key will summon the AI Mind Space, a place that collects and catalogs information that it can recall later for you. The RedMagic 10S Pro launched in China with the Snapdragon 8 Elite Leading Edition SoC and up to 24GB of RAM. Keeping the temperatures in check is what is known as the ICE-X Cooling System, which uses liquid metal and active air cooling. The company claims it has 250% enhanced thermal conductivity and a 30% larger heat dissipation area that lowers CPU temperatures by an additional 5°C. The Red Magic 10S Pro has a massive 7,500mAh battery with 120W charging, a 6.85-inch 144Hz OLED, and is now on sale.",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/05/week-22-in-review/-952x498w6/gsmarena_111.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eThe Galaxy A57, which is expected in Q1 of 2026, will likely use a new Exynos 1680 chipset. The Exynos 1680 allegedly has the model designation S5E8865 and the codename Terra. No other details are known about it yet, but it is probably safe to assume that it will use an Xclipse GPU just like its predecessor.\u003c/p\u003e\n\n\n\u003cp\u003eWe saw the first glimpse of the Nothing Phone (3). More specifically, a macro shot of a part of the phone. Not much we can get from it, but perfectly in line with Nothing\u0026#39;s style. \u003c/p\u003e\n\n\u003cp\u003eMotorola\u0026#39;s Moto G family is soon going to get another member, the Moto G96. It will be powered by Qualcomm\u0026#39;s Snapdragon 7s Gen 2 SoC and we saw images of it. The phone will boast 12 GB of RAM and 256 GB of storage. It will have a 6.67-inch pOLED curved screen with a 144 Hz refresh rate, and a 5,500 mAh battery. On the rear, there\u0026#39;s a 50 MP main camera using Sony\u0026#39;s Lytia LYT-700C sensor, and an 8 MP macro camera. For selfies, you\u0026#39;ll get a 32 MP snapper on the front. The device will be offered in Cattleya Orchid, Dresden Blue, Greener Pastures, and Ashleigh Blue colorways.\u003c/p\u003e\n\n\u003cp\u003eIt\u0026#39;s expected to cost around INR 22,990 when it lands in India, which right now translates into approximately $270. It\u0026#39;s unclear what other markets it might launch in.\n\n\u003c/p\u003e\n\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\u003cp\u003eThe Realme GT 7 and GT 7T made their global debut. The GT 7 uses the Dimensity 9400e chipset and features a 6.8-inch 120Hz AMOLED display, 50 MP main and 2x telephoto cameras  and an 8 MP ultrawide shooter. It\u0026#39;s powered by a 7,000mAh battery with 120W charging. The GT 7T uses the Dimensity 8400-Max, and lacks a zoom camera, but has the same 7,000mAh battery.\u003c/p\u003e\n\n\u003cp\u003eThe Pixel 10 Pro (or Pixel 10 Pro XL) was spotted on a public beach in Vancouver, Canada, where it was filmed for a TV ad. The video crew wasn\u0026#39;t working hard on keeping the phone a mystery, and the person who stumbled upon the set even got a glance at the storyboard (a visual script of all scenes that make up the video clip). Google will launch the Pixel 10 with a new camera feature that will allow users to add multiple people to the same shot. The Pixel 10 series could come in August.\u003c/p\u003e\n\n\n\n\n\n\t\t\n\t\t\n\t\t\n\n\n\n\n\n\n\n\u003cp\u003eOnePlus announced a slew of AI features, which will debut alongside the OnePlus 13s. The phone has a dedicated Plus Key on the side, replacing the iconic Alert slider. The new key will summon the AI Mind Space, a place that collects and catalogs information that it can recall later for you.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eThe RedMagic 10S Pro launched in China with the Snapdragon 8 Elite Leading Edition SoC and up to 24GB of RAM. Keeping the temperatures in check is what is known as the ICE-X Cooling System, which uses liquid metal and active air cooling. The company claims it has 250% enhanced thermal conductivity and a 30% larger heat dissipation area that lowers CPU temperatures by an additional 5°C.\u003c/p\u003e\n\n\n\u003cp\u003eThe Red Magic 10S Pro has a massive 7,500mAh battery with 120W charging, a 6.85-inch 144Hz OLED, and is now on sale.\u003c/p\u003e\n\n\n\t\t\n\t\t\n\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-01T21:21:02+02:00",
  "modifiedTime": null
}
