{
  "id": "80a02548-57de-480e-9ebc-6a206cfd2d06",
  "title": "Pixel 9’s Awesome New Setup Process is Coming to Other Android Phones",
  "link": "https://www.droid-life.com/2024/11/20/pixel-9s-awesome-new-setup-process-is-coming-to-other-android-phones/",
  "description": "When you setup a new phone, that process isn’t something you are likely to think about ever again because you (hopefully) only have to make your way through it a single time. The thing is, that one time through shouldn’t bring anxiety to new levels or make you want to throw your new phone at … Continued Read the original post: Pixel 9’s Awesome New Setup Process is Coming to Other Android Phones",
  "author": "Kellen",
  "published": "Wed, 20 Nov 2024 20:40:59 +0000",
  "source": "https://www.droid-life.com/feed",
  "categories": [
    "Apps",
    "News",
    "Android",
    "Pixel 9",
    "Pixel 9 Pro",
    "Pixel 9 Pro Fold",
    "Pixel 9 Pro XL"
  ],
  "byline": "Kellen",
  "length": 2619,
  "excerpt": "When you setup a new phone, that process isn’t something you are likely to think about ever again because you (hopefully) only have to make your way through it a single time. The thing is, that one time through shouldn’t bring anxiety to new levels or make you want to throw your new phone at a...",
  "siteName": "Droid Life",
  "favicon": "https://www.droid-life.com/favicon-512x512.png",
  "text": "We may earn a commission when you click links to retailers and purchase goods. More info. When you setup a new phone, that process isn’t something you are likely to think about ever again because you (hopefully) only have to make your way through it a single time. The thing is, that one time through shouldn’t bring anxiety to new levels or make you want to throw your new phone at a wall because it fails or takes hours to complete. With the Pixel 9 series, Google launched a much-improved setup process that probably hasn’t seen enough love for as good as it is. For the rest of the Android world, we have great news to share – Google is bringing it to more phones. Shortly after the Pixel 9 series was announced in August, a Googler shared several of the improvements they made to the setup process on the new Pixel line. There were at least 7 areas that they brought big changes to and two of them are a quicker initial setup followed by a data transfer later on from your old device. These are the pieces that Google is bringing to more Android phones in 2025. Google’s Android Switch app powers this process, for those wanting to know. The app can now allow you to start the setup process and let you choose to setup with an “express” option or make it more “custom.” If you choose the express route, the Android Switch app will grab a bunch of stuff that you have backed up from the cloud and then look to your old device to bring over other items that remain on the device that aren’t in the cloud. Or better put, it skips moving stuff over that’s in the cloud because it can bring that later to make the process quicker out of the gate. The other big item is a data transfer that can be done later, even after you’ve already started using your new phone. The idea here is that you don’t want to walk through the lengthy setup process and would rather start playing with your new phone right away. Within your new phone’s settings, there should be an area to “Bring data from another device,” which you can initiate long after you’ve started using your phone. This feature uses the phone you initiated setup with, so make sure you still have it handy. You’ll connect the two again via QR code and then select which pieces of data you want to bring over. It’s incredibly handy, especially if you either skipped setup right away or ran into any issues during setup. Google says you can bring data over as many times as you like from that old phone. In a short announcement today, Google said these setup features are “coming to more Android phone makers in 2025.” Google Play Link: Android Switch",
  "image": "https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-1200x628-cropped.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \u003cmain\u003e\n                      \n            \n                       \u003carticle\u003e\n  \u003cheader\u003e\n    \n    \n    \n\n\n  \u003c/header\u003e\n\t\n      \u003cp\u003e\u003cimg width=\"980\" height=\"653\" src=\"https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-980x653.jpg\" alt=\"Pixel 9 Pro XL\" decoding=\"async\" data-object-fit=\"cover\" fetchpriority=\"high\" srcset=\"https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-980x653.jpg 980w, https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-270x180.jpg 270w, https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-768x512.jpg 768w, https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-1536x1024.jpg 1536w, https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3-1366x911.jpg 1366w, https://www.droid-life.com/wp-content/uploads/2024/11/Pixel-9-Pro-XL-3.jpg 1800w\" sizes=\"(max-width: 980px) 100vw, 980px\" data-wp-pid=\"305379\"/\u003e\n\u003c/p\u003e\n    \n\u003cp\u003eWe may earn a commission when you click links to retailers and purchase goods. \u003ca href=\"https://www.droid-life.com/privacy-policy/\" target=\"_blank\"\u003eMore info.\u003c/a\u003e\u003c/p\u003e\n  \n    \u003cdiv data-sticky-container=\"\"\u003e\n        \u003cp\u003eWhen you setup a new phone, that process isn’t something you are likely to think about ever again because you (hopefully) only have to make your way through it a single time. The thing is, that one time through shouldn’t bring anxiety to new levels or make you want to throw your new phone at a wall because it fails or takes hours to complete. With the Pixel 9 series, Google launched a much-improved setup process that probably hasn’t seen enough love for as good as it is. For the rest of the Android world, we have great news to share – Google is bringing it to more phones.\u003c/p\u003e\n\u003cp\u003eShortly after the Pixel 9 series was announced in August, a \u003ca href=\"https://www.droid-life.com/2024/08/23/pixel-9-setup-process-gets-several-big-upgrades/\"\u003eGoogler shared several of the improvements\u003c/a\u003e they made to the setup process on the new Pixel line. There were at least 7 areas that they brought big changes to and two of them are a quicker initial setup followed by a data transfer later on from your old device. These are the pieces that Google is bringing to more Android phones in 2025.\u003c/p\u003e\n\u003cp\u003eGoogle’s Android Switch app powers this process, for those wanting to know. The app can now allow you to start the setup process and let you choose to \u003cstrong\u003esetup with an “express” option\u003c/strong\u003e or make it more “custom.” If you choose the express route, the Android Switch app will grab a bunch of stuff that you have backed up from the cloud and then look to your old device to bring over \u003cem\u003eother\u003c/em\u003e items that remain on the device that aren’t in the cloud. Or better put, it skips moving stuff over that’s in the cloud because it can bring that later to make the process quicker out of the gate.\u003c/p\u003e\n\u003cp\u003eThe other big item is a \u003cstrong\u003edata transfer that can be done later\u003c/strong\u003e, even after you’ve already started using your new phone. The idea here is that you don’t want to walk through the lengthy setup process and would rather start playing with your new phone right away. Within your new phone’s settings, there should be an area to “Bring data from another device,” which you can initiate long after you’ve started using your phone.\u003c/p\u003e\n\u003cp\u003eThis feature uses the phone you initiated setup with, so make sure you still have it handy. You’ll connect the two again via QR code and then select which pieces of data you want to bring over. It’s incredibly handy, especially if you either skipped setup right away or ran into any issues during setup. Google says you can bring data over as many times as you like from that old phone.\u003c/p\u003e\n\u003cp\u003eIn a short \u003ca href=\"https://blog.google/products/android/android-switching-updates/\"\u003eannouncement\u003c/a\u003e today, Google said these setup features are “coming to more Android phone makers in 2025.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGoogle Play Lin\u003c/strong\u003ek: \u003ca href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.restore\"\u003eAndroid Switch\u003c/a\u003e\u003c/p\u003e\n      \u003c/div\u003e\n\u003c/article\u003e\n\n\n  \n\n\t\n\n\n        \n                    \n          \n          \n        \u003c/main\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-20T20:40:59Z",
  "modifiedTime": "2024-11-20T20:40:59Z"
}
