{
  "id": "8e3374a4-0644-4696-b88b-3179da18f772",
  "title": "ByteDance board member believes there’s a possibility to retain TikTok ownership without divesting",
  "link": "https://www.gsmarena.com/bytedance_board_member_believes_theres_a_possibility_to_retain_tiktok_ownership_without_divesting-news-66233.php",
  "description": "ByteDance currently has until April 5, 2025 to divest its stake in TikTok to a US-based company as per US President Donald Trump’s executive order from earlier this week. While the app is still available to use freely in the US, it’s been removed from the App Store and Google Play. There are plenty of suitors ready to buy TikTok but one ByteDance board member believes there’s still a chance for a solution that does not involve selling the social media app. Bill Ford, who serves as chairman and CEO of General Atlantic equity firm and is also a member of ByteDance's board of directors,...",
  "author": "",
  "published": "Thu, 23 Jan 2025 23:53:01 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Michail",
  "length": 1222,
  "excerpt": "The deal would involve a change of control on a local level. ByteDance currently has until April 5, 2025 to divest its stake in TikTok to a US-based...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "ByteDance currently has until April 5, 2025 to divest its stake in TikTok to a US-based company as per US President Donald Trump’s executive order from earlier this week. While the app is still available to use freely in the US, it’s been removed from the App Store and Google Play. There are plenty of suitors ready to buy TikTok but one ByteDance board member believes there’s still a chance for a solution that does not involve selling the social media app. Bill Ford, who serves as chairman and CEO of General Atlantic equity firm and is also a member of ByteDance's board of directors, is optimistic that the Chinese tech giant could reach a compromise solution to keep control of TikTok without divesting to a US entity. Ford’s optimism stems from reported talks between the newly elected US President Donald Trump and his Chinese colleague Xi Jinping. The executive suggests that a “change of control of some kind” is not out of the question for TikTok, but ByteDance is actively looking to ensure it can continue to operate in the US without selling. It remains to be seen how ByteDance can pull this off given that the law which passed earlier this year mandates a sale to a US-based company. Source (paywall)",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/01/bytedance-tiktok-ownership-without-divesting/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                \t\n\n\n\n\n\n\n\n\u003cp\u003eByteDance currently has until April 5, 2025 to divest its stake in TikTok to a US-based company as per US President Donald Trump’s \u003ca href=\"https://www.gsmarena.com/tiktoks_us_ban_delayed_for_75_days-news-66180.php\"\u003eexecutive order\u003c/a\u003e from earlier this week. While the app is still available to use freely in the US, it’s been removed from the App Store and Google Play. There are plenty of suitors ready to buy TikTok but one ByteDance board member believes there’s still a chance for a solution that does not involve selling the social media app.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"800\" src=\"https://fdn.gsmarena.com/imgroot/news/25/01/bytedance-tiktok-ownership-without-divesting/-1200/gsmarena_002.jpg\" alt=\"ByteDance board member believes there’s a possibility to retain TikTok ownership without divesting\"/\u003e\u003c/p\u003e\u003cp\u003eBill Ford, who serves as chairman and CEO of General Atlantic equity firm and is also a member of ByteDance\u0026#39;s board of directors, is optimistic that the Chinese tech giant could reach a compromise solution to keep control of TikTok without divesting to a US entity. Ford’s optimism stems from reported talks between the newly elected US President Donald Trump and his Chinese colleague Xi Jinping.\u003c/p\u003e\n\n\u003cp\u003eThe executive suggests that a “change of control of some kind” is not out of the question for TikTok, but ByteDance is actively looking to ensure it can continue to operate in the US without selling. It remains to be seen how ByteDance can pull this off given that \u003ca href=\"https://www.gsmarena.com/us_supreme_court_upholds_tiktok_ban-news-66153.php\"\u003ethe law which passed earlier this year\u003c/a\u003e mandates a sale to a US-based company.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-23/tiktok-deal-could-stop-short-of-full-us-sale-shareholder-says\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e (\u003ci\u003epaywall\u003c/i\u003e)\u003c/p\u003e\n\t\t\t\t\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-23T23:53:01+01:00",
  "modifiedTime": null
}
