{
  "id": "adffbf70-d596-4353-af56-684593293ad0",
  "title": "Apple Watch Ultra 3 to have satellite messaging abilities",
  "link": "https://www.gsmarena.com/apple_watch_ultra_3_to_have_satellite_messaging_abilities-news-65688.php",
  "description": "The Apple Watch Ultra 3 will come with support for satellite messaging, a new report from Bloomberg's always-in-the-Apple-loop Mark Gurman states. This will let you send texts even without a cellular or Wi-Fi connection, using satellites only. The Ultra 3 could also bring blood pressure monitoring, but this has been delayed before, so apparently it's less of a safe bet at the moment. This feature was initially supposed to be released in 2023, for what it's worth. This wouldn't give you an exact reading, but instead will inform you when you may be in a state of hypertension. A non-invasive...",
  "author": "",
  "published": "Wed, 11 Dec 2024 00:59:01 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1750,
  "excerpt": "Blood pressure monitoring might also finally appear. The Apple Watch Ultra 3 will come with support for satellite messaging, a new report from Bloomberg's...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "The Apple Watch Ultra 3 will come with support for satellite messaging, a new report from Bloomberg's always-in-the-Apple-loop Mark Gurman states. This will let you send texts even without a cellular or Wi-Fi connection, using satellites only. The Ultra 3 could also bring blood pressure monitoring, but this has been delayed before, so apparently it's less of a safe bet at the moment. This feature was initially supposed to be released in 2023, for what it's worth. This wouldn't give you an exact reading, but instead will inform you when you may be in a state of hypertension. A non-invasive blood glucose tracker is also still in the works, but that's definitely not coming next year. Satellite communication first arrived on the iPhone 14 in 2022, and last year it was expanded to contact with roadside assistance providers. This year, Apple added the ability to text anyone via iMessage. Of course, you have so far needed an iPhone for all this, but with the Apple Watch Ultra 3 you'll be able to leave your iPhone at home. These new features apparently are Apple's way to reinvigorate smartwatch sales which have gone through \"a slow stretch\" recently. Revenue from the unit that includes watches has declined over the past two years, as people have had less reason to upgrade. And Apple is betting that satellite messaging and (perhaps) blood pressure monitoring will be convincing enough. Next year, some Apple Watch models will see another change: the use of MediaTek modems instead of Intel's. If it pans out, this would be the first time Apple has bought a major component from MediaTek. The new modems will support 5G Redcap, a 5G service aimed specifically at wearables and devices that don't require fast data connections. Source",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/12/apple-watch-ultra-3-satellite-messaging/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eThe Apple Watch Ultra 3 will come with support for satellite messaging, a new report from Bloomberg\u0026#39;s always-in-the-Apple-loop Mark Gurman states. This will let you send texts even without a cellular or Wi-Fi connection, using satellites only.\u003c/p\u003e\n\n\u003cp\u003eThe Ultra 3 could also bring blood pressure monitoring, but this has been delayed before, so apparently it\u0026#39;s less of a safe bet at the moment. This feature was initially supposed to be released in 2023, for what it\u0026#39;s worth. This wouldn\u0026#39;t give you an exact reading, but instead will inform you when you may be in a state of hypertension. A non-invasive blood glucose tracker is also still in the works, but that\u0026#39;s definitely not coming next year.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"682\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/apple-watch-ultra-3-satellite-messaging/inline/-1200/gsmarena_001.jpg\" alt=\"Apple Watch Ultra 3 to have satellite messaging abilities\"/\u003e\u003c/p\u003e\u003cp\u003eSatellite communication first arrived on the \u003ca href=\"https://www.gsmarena.com/apple_iphone_14-11861.php\"\u003eiPhone 14\u003c/a\u003e in 2022, and last year it was expanded to contact with roadside assistance providers. This year, Apple added the ability to text anyone via iMessage. Of course, you have so far needed an iPhone for all this, but with the Apple Watch Ultra 3 you\u0026#39;ll be able to leave your iPhone at home.\u003c/p\u003e\n\n\u003cp\u003eThese new features apparently are Apple\u0026#39;s way to reinvigorate smartwatch sales which have gone through \u0026#34;a slow stretch\u0026#34; recently. Revenue from the unit that includes watches has declined over the past two years, as people have had less reason to upgrade. And Apple is betting that satellite messaging and (perhaps) blood pressure monitoring will be convincing enough.\u003c/p\u003e\n\n\u003cp\u003eNext year, some Apple Watch models will see another change: the use of MediaTek modems instead of Intel\u0026#39;s. If it pans out, this would be the first time Apple has bought a major component from MediaTek. The new modems will support 5G Redcap, a 5G service aimed specifically at wearables and devices that don\u0026#39;t require fast data connections.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/articles/2024-12-10/apple-plans-apple-watch-ultra-3-next-year-with-satellite-texting-and-5g\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-11T00:59:01+01:00",
  "modifiedTime": null
}
