{
  "id": "b5e877fb-b8fb-4c33-9d3f-dba279548dda",
  "title": "Oppo X8 Pad gaming tablet is on the way with a flagship chipset",
  "link": "https://www.gsmarena.com/oppo_x8_pad_gaming_tablet_is_on_the_way_with_a_flagship_chipset-news-65651.php",
  "description": "Oppo is reportedly working on a gaming tablet which will be called X8 Pad (or maybe Find X8 Pad, the \"Find\" bit could have been lost in machine translation from Chinese). This has an 8.8-inch top-spec LCD touchscreen with rounded corners, a slim all-metal body, and it's powered by MediaTek's Dimensity 9400 SoC just like the Find X8 and Find X8 Pro smartphones, which are already official. Oppo Pad 3 Pro So it's looking to be a very interesting offering, this. A small-screened tablet with a flagship SoC could be intriguing to some people. Keep in mind that this is just an unconfirmed...",
  "author": "",
  "published": "Fri, 06 Dec 2024 21:51:27 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 900,
  "excerpt": "It has a smaller screen than you might expect. Oppo is reportedly working on a gaming tablet which will be called X8 Pad (or maybe Find X8 Pad, the \"Find\"...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Oppo is reportedly working on a gaming tablet which will be called X8 Pad (or maybe Find X8 Pad, the \"Find\" bit could have been lost in machine translation from Chinese). This has an 8.8-inch top-spec LCD touchscreen with rounded corners, a slim all-metal body, and it's powered by MediaTek's Dimensity 9400 SoC just like the Find X8 and Find X8 Pro smartphones, which are already official. Oppo Pad 3 ProSo it's looking to be a very interesting offering, this. A small-screened tablet with a flagship SoC could be intriguing to some people. Keep in mind that this is just an unconfirmed rumor at this point, but it does come from the usually reliable Digital Chat Station on Weibo for what it's worth. If the Oppo X8 Pad does become reality, we're curious to see whether it will launch internationally or remain confined to China as the upcoming Find X8 Ultra is rumored to. Source (in Chinese)",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/12/oppo-x8-pad-rumor/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eOppo is reportedly working on a gaming tablet which will be called X8 Pad (or maybe Find X8 Pad, the \u0026#34;Find\u0026#34; bit could have been lost in machine translation from Chinese).\u003c/p\u003e\n\n\u003cp\u003eThis has an 8.8-inch top-spec LCD touchscreen with rounded corners, a slim all-metal body, and it\u0026#39;s powered by MediaTek\u0026#39;s Dimensity 9400 SoC just like the \u003ca href=\"https://www.gsmarena.com/oppo_find_x8-13407.php\"\u003eFind X8\u003c/a\u003e and \u003ca href=\"https://www.gsmarena.com/oppo_find_x8_pro-13467.php\"\u003eFind X8 Pro\u003c/a\u003e smartphones, which are already official.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"570\" alt=\"Oppo Pad 3 Pro\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/oppo-x8-pad-rumor/inline/-1200/gsmarena_001.jpg\"/\u003e\n\u003cspan\u003e\u003cstrong\u003eOppo Pad 3 Pro\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eSo it\u0026#39;s looking to be a very interesting offering, this. A small-screened tablet with a flagship SoC could be intriguing to some people. Keep in mind that this is just an unconfirmed rumor at this point, but it does come from the usually reliable Digital Chat Station on Weibo for what it\u0026#39;s worth.\u003c/p\u003e\n\n\u003cp\u003eIf the Oppo X8 Pad does become reality, we\u0026#39;re curious to see whether it will launch internationally or remain \u003ca href=\"https://www.gsmarena.com/oppo_find_x8_ultra_and_vivo_x200_ultra_wont_officially_be_sold_outside_of_china_rumor_says-news-65609.php\"\u003econfined to China as the upcoming Find X8 Ultra\u003c/a\u003e is rumored to.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://weibo.com/6048569942/P3Bue7Tfc?pagetype=profilefeed\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e (in Chinese)\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-06T21:51:27+01:00",
  "modifiedTime": null
}
