{
  "id": "f1014bef-79b7-4ff5-9913-6a84ebf915c3",
  "title": "4 reasons you need to run a Git server on your NAS (even if you're not a developer)",
  "link": "https://www.xda-developers.com/reasons-run-git-server-nas/",
  "description": "If you're looking for your next NAS project, you need to set up a Git server.",
  "author": "Adam Conway",
  "published": "Thu, 20 Mar 2025 01:00:10 GMT",
  "source": "https://www.xda-developers.com/feed/",
  "categories": [
    "Productivity",
    "GitHub"
  ],
  "byline": "Adam Conway",
  "length": 12477,
  "excerpt": "If you\u0026#039;re looking for your next NAS project, you need to set up a Git server.",
  "siteName": "XDA",
  "favicon": "https://www.xda-developers.com/public/build/images/favicon-240x240.43161a66.png",
  "text": "Despite the fact that Git is considered to be a developer-only tool, it has a lot of uses for non-developers too. It's also not just restricted to the likes of GitHub and GitLab, as you can run your own Git server through the likes of Gitea on your NAS. As for why you would, there are a few reasons to. Some are for developers, and some just make your life easier, especially when it comes to productivity thanks to version control. 4 Enhanced security, privacy, and code ownership You own everything First and foremost, as is the case with anything you self-host, you control it. The data is yours, and you decide what to do with it. A company can't process your data for marketing purposes, and your data is only at risk if you insecurely store it. That might seem like a lot of pressure, but for anyone who's up to the task, it can be an educational project with massive benefits at the end of it. Especially for developers, trusting platforms like GitHub can be difficult. GitHub's Copilot (an AI-powered pair programmer) was trained on public repositories on the platform, which led some developers to leave the platform following its announcement. While the company maintains that it was only trained on those public repositories, some developers no longer trust it. If you have concerns about GitHub training its models on your private repositories in the future, or you simply don't want to use the company's services anymore, then self-hosting your own Git server is a great way to continue using version control in your projects. 3 Track changes as you make them You can go back to older versions with ease While developers are used to using Git so that they can keep on top of their code changes and revert changes if they need to, the same concept can be applied to anything you work on that might take time. For local documents, as an example, you can use version control systems like Git to keep on top of the changes you make. This can be great if you want to go back to an older version of a document, especially if you're working in something that doesn't keep previous versions. Even for an Obsidian Vault, you can track changes as you make them so you can go back to older versions of your notes. And, if your notes are sensitive, you don't need to worry about them being stored somewhere in the cloud. You control your data. This can be useful for all kinds of projects. From video editing projects, music production projects, to documents, Git is a great way to keep on top of changes and track them, giving you the ability to revert to an older version if you need to. 2 Integrate with your existing services Obsidian with Nextcloud is a great example If you wanted, you could integrate your Git server with your other services. For example, imagine a Gitea server on your NAS that stores your files in a folder that Nextcloud can access. You push your updated Obsidian Vault with Git to Gitea, and you can then access that vault on your NAS for later retrieval to other devices. These kinds of systems are pretty easy to set up, especially with the likes of TrueNAS. You don't even need to pay for an Obsidian Sync subscription, as Obisidian's architecture allows you to simply back up its files and move them elsewhere if you need to. Git can automate portions of it for you, and Nextcloud can allow you to access it later on. These systems take some time to set up, but they're relatively trivial. The same goes for any other kind of service you can imagine might be worth syncing with Git; you get the benefits of version control with the ability to see what you've changed over time, and you can access your files from anywhere. 1 Easily collaborate Easily see where changes were made If you're working on a group project and want to collaborate on it, your own Git repository can simplify things significantly. It may not be perfect for documents, but it can work, and you can also manage other projects with it, too. Between all the kinds of projects we've mentioned previously, and more, Git simply works with anything that stores project progress in files. For simple projects that I want to collaborate with others on, I'd use Git for most things given my familiarity with it. Building an Obsidian Vault with someone else is a great example of that, but really, anything that requires project files will work perfectly. Git will handle the versioning for you, and you can add messages to your commits that clearly outlined what you changed when you synchronize your files. Git is great for collaboration in a development sense, but the benefits it provides to users for collaborating on all kinds of things is simply unmatched. Git may be for developers, but it has other uses too If you're a tech enthusiast with a NAS, then you probably have at least heard of Git. It's not just something developers can use, but it has real uses for anyone who wants to collaborate on projects or keep track of changes that they make to their files and documents. Give it a try, and you'll wonder why you didn't use it sooner.",
  "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/11/nas-devices-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eDespite the fact that Git is considered to be a developer-only tool, it has a lot of uses for non-developers too. It\u0026#39;s also not just restricted to the likes of GitHub and GitLab, as you can run your own Git server through the likes of Gitea on your NAS. As for why you would, there are a few reasons to. Some are for developers, and some just make your life easier, \u003ca href=\"https://www.xda-developers.com/reasons-should-use-git-productivity/\" target=\"_blank\"\u003eespecially when it comes to productivity\u003c/a\u003e thanks to version control.\u003c/p\u003e    \u003ch2 id=\"enhanced-security-privacy-and-code-ownership\"\u003e\n            \u003cspan\u003e4 \u003c/span\u003e\n        \u003cspan\u003e\n                            Enhanced security, privacy, and code ownership\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003ch3 id=\"you-own-everything\"\u003e\n            You own everything\n    \u003c/h3\u003e\n\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                        \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2240\" height=\"1260\" loading=\"lazy\" decoding=\"async\" alt=\"Running Gitea on the Raspberry Pi\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/10/gitea-raspberry-pi.jpg\"/\u003e\n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e First and foremost, as is the case with anything you self-host, \u003cem\u003eyou control it\u003c/em\u003e. The data is yours, and you decide what to do with it. A company can\u0026#39;t process your data for marketing purposes, and your data is only at risk if you insecurely store it. That might seem like a lot of pressure, but for anyone who\u0026#39;s up to the task, it can be an educational project with massive benefits at the end of it.\u003c/p\u003e    \n\u003cp\u003eEspecially for developers, trusting platforms like GitHub can be difficult. GitHub\u0026#39;s Copilot (an AI-powered pair programmer) was trained on public repositories on the platform, which led some developers to leave the platform following its announcement. While the company maintains that it was only trained on those public repositories, some developers no longer trust it.\u003c/p\u003e    \n\u003cp\u003eIf you have concerns about GitHub training its models on your private repositories in the future, or you simply don\u0026#39;t want to use the company\u0026#39;s services anymore, then self-hosting your own Git server is a great way to continue using version control in your projects.\u003c/p\u003e    \u003ch2 id=\"track-changes-as-you-make-them\"\u003e\n            \u003cspan\u003e3 \u003c/span\u003e\n        \u003cspan\u003e\n                            Track changes as you make them\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003ch3 id=\"you-can-go-back-to-older-versions-with-ease\"\u003e\n            You can go back to older versions with ease\n    \u003c/h3\u003e\n\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2505\" height=\"1267\" loading=\"lazy\" decoding=\"async\" alt=\"gitea-tutorial-10\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2025/01/gitea-tutorial-10.jpg\"/\u003e\n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e While developers are used to using Git so that they can keep on top of their code changes and revert changes if they need to, the same concept can be applied to anything you work on that might take time. For local documents, as an example, you can use version control systems like Git to keep on top of the changes you make.\u003c/p\u003e    \n\u003cp\u003eThis can be great if you want to go back to an older version of a document, especially if you\u0026#39;re working in something that doesn\u0026#39;t keep previous versions. Even for an Obsidian Vault, you can track changes as you make them so you can go back to older versions of your notes. And, if your notes are sensitive, you don\u0026#39;t need to worry about them being stored somewhere in the cloud. You control your data.\u003c/p\u003e    \n\u003cp\u003eThis can be useful for all kinds of projects. From video editing projects, music production projects, to documents, Git is a great way to keep on top of changes and track them, giving you the ability to revert to an older version if you need to.\u003c/p\u003e    \u003ch2 id=\"integrate-with-your-existing-services\"\u003e\n            \u003cspan\u003e2 \u003c/span\u003e\n        \u003cspan\u003e\n                            Integrate with your existing services\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003ch3 id=\"obsidian-with-nextcloud-is-a-great-example\"\u003e\n            Obsidian with Nextcloud is a great example\n    \u003c/h3\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \n    \n\n\u003cp\u003eIf you wanted, you could integrate your Git server with your other services. For example, imagine a Gitea server on your NAS that \u003ca href=\"https://www.xda-developers.com/how-build-google-drive-alternative-nextcloud/\" target=\"_blank\"\u003estores your files in a folder that Nextcloud\u003c/a\u003e can access. You push your updated Obsidian Vault with Git to Gitea, and you can then access that vault on your NAS for later retrieval to other devices.\u003c/p\u003e    \n\u003cp\u003eThese kinds of systems are pretty easy to set up, especially with the likes of TrueNAS. You \u003ca href=\"https://www.xda-developers.com/free-ways-sync-obsidian-notes-cloud/\" target=\"_blank\"\u003edon\u0026#39;t even need to pay for an Obsidian Sync subscription\u003c/a\u003e, as Obisidian\u0026#39;s architecture allows you to simply back up its files and move them elsewhere if you need to. Git can automate portions of it for you, and Nextcloud can allow you to access it later on.\u003c/p\u003e    \n\u003cp\u003eThese systems take some time to set up, but they\u0026#39;re relatively trivial. The same goes for any other kind of service you can imagine might be worth syncing with Git; you get the benefits of version control with the ability to see what you\u0026#39;ve changed over time, and you can access your files from anywhere.\u003c/p\u003e    \u003ch2 id=\"easily-collaborate\"\u003e\n            \u003cspan\u003e1 \u003c/span\u003e\n        \u003cspan\u003e\n                            Easily collaborate\n                    \u003c/span\u003e\n       \u003c/h2\u003e\u003ch3 id=\"easily-see-where-changes-were-made\"\u003e\n            Easily see where changes were made\n    \u003c/h3\u003e\n\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                            \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=1\" srcset=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg?q=70\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=1\"/\u003e\n                \u003cimg width=\"888\" height=\"592\" loading=\"lazy\" decoding=\"async\" alt=\"CLI after having cloned the Magic Mero repo from GitHub\" data-img-url=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg\" src=\"https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/06/after-clining-magic-mirror-repo.jpg\"/\u003e\n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e If you\u0026#39;re working on a group project and want to collaborate on it, your own Git repository can simplify things significantly. It may not be perfect for documents, but it \u003cem\u003ecan\u003c/em\u003e work, and you can also manage other projects with it, too. Between all the kinds of projects we\u0026#39;ve mentioned previously, and more, Git simply works with anything that stores project progress in files.\u003c/p\u003e    \n\u003cp\u003eFor simple projects that I want to collaborate with others on, I\u0026#39;d use Git for most things given my familiarity with it. Building an Obsidian Vault with someone else is a great example of that, but really, anything that requires project files will work perfectly. Git will handle the versioning for you, and you can add messages to your commits that clearly outlined what you changed when you synchronize your files.\u003c/p\u003e    \n\u003cp\u003eGit is great for collaboration in a development sense, but the benefits it provides to users for collaborating on all kinds of things is simply unmatched.\u003c/p\u003e    \u003ch3 id=\"git-may-be-for-developers-but-it-has-other-uses-too\"\u003e\n            Git may be for developers, but it has other uses too\n    \u003c/h3\u003e\n\n\u003cp\u003eIf you\u0026#39;re a tech enthusiast with a NAS, then you probably have at least \u003cem\u003eheard\u003c/em\u003e of Git. It\u0026#39;s not just something developers can use, but it has real uses for anyone who wants to collaborate on projects or keep track of changes that they make to their files and documents. Give it a try, and you\u0026#39;ll wonder why you didn\u0026#39;t use it sooner.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-03-20T01:00:10Z",
  "modifiedTime": "2025-03-20T01:00:10Z"
}
