{
  "id": "ffc95e08-7aeb-4abb-950f-fb7296480a3b",
  "title": "2024 Winners and losers: Xiaomi",
  "link": "https://www.gsmarena.com/2024_winners_and_losers_xiaomi-news-65728.php",
  "description": "Xiaomi had a relatively uneventful 2024, but not in the negative sense. Most of what Xiaomi released this year was expected evolution of its previous-gen devices, but not necessarily boring. Maybe the only thing that shook up the scene was the release of its first-ever EV - the Xiaomi SU7. So, let's begin with this one. Winner: Xiaomi SU7 If we just look at the stats, the Xiaomi SU7 is a hit. The company's brand-new factory is working overtime to meet the demand and was able to surpass its initial goal for 2024 by a large margin. Subjectively speaking, Xiaomi did very well with...",
  "author": "",
  "published": "Fri, 27 Dec 2024 23:34:01 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Ro",
  "length": 4741,
  "excerpt": "Xiaomi's 2024 was defined not just by smartphones. Xiaomi had a relatively uneventful 2024, but not in the negative sense. Most of what Xiaomi released...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Xiaomi had a relatively uneventful 2024, but not in the negative sense. Most of what Xiaomi released this year was expected evolution of its previous-gen devices, but not necessarily boring. Maybe the only thing that shook up the scene was the release of its first-ever EV - the Xiaomi SU7. So, let's begin with this one. Winner: Xiaomi SU7 If we just look at the stats, the Xiaomi SU7 is a hit. The company's brand-new factory is working overtime to meet the demand and was able to surpass its initial goal for 2024 by a large margin. Subjectively speaking, Xiaomi did very well with its first car. We even had the chance to take it for a spin and are impressed by the build quality, features and ergonomics. It's as if Xiaomi has previous experience with building vehicles. Losers: HyperOS and battery life It feels like HyperOS is lagging behind the competition in some aspects. That's not to say Xiaomi's overlay is bad overall as it certainly has its strong aspects. Our experience with HyperOS is very smooth and reliable. However, the feature segregation between the Chinese ROM, the global one, and the Poco launcher is mind-boggling at this point. A handful of features remain exclusive to the Chinese version of the OS. One example is the notification history. Another difference, but hard to wrap our heads around, is the missing double-tap-to-lock function, which can be found on Pocos but not on standard Xiaomis and Redmis. Go figure! And our last complaint is about battery life. Judging by our tests, Xiaomi's phones have struggled to deliver competitive battery life across its entire range of phones, so it's easy to conclude that HyperOS is the main culprit. We are probably the last ones to complain about AI, but HyperOS feels behind the curve when it comes to AI-powered features. We hope 2025 will be for the better. Winner: Xiaomi 14 Ultra Another year, another great flagship phone from Xiaomi. Despite the unimpressive battery life, the phone excels in pretty much every other aspect. And perhaps more importantly, it's one of the best cameraphones on the market. We are particularly impressed by the video recording capabilities and the versatile camera setup with various focal lengths. Loser: Poco lineup Remember when people were eagerly waiting for the next Poco-branded flagship killer? Seemingly, those days are gone. The Poco lineup expanded and still has a couple of competitive models like the Poco X6 Pro and maybe even the Poco M6 Pro. Both devices are pretty good all-rounders in their respective classes, but we feel like most handsets under the Poco branding are just fillers. Even the Poco F6 Pro this year didn't excite. Sure, you get a top-tier chipset at a relatively low price, but smartphones have never been about just chipsets, especially in 2024. The camera experience is lackluster, the battery life isn't great, and the display is just about what you'd expect from a phone in this price bracket. And at the end of the day, you are getting a mid-range phone with a flagship chipset at best. Xiaomi needs to work more on its Poco lineup to bring back its former glory. Winners: Redmi and Xiaomi 14T series As is usually the case, Xiaomi's Redmi lineup is one of the best sellers in 2024. One could argue that the lineup became a bit overcrowded and sometimes confusing, but it's just Xiaomi's way of appealing to the masses. There's a suitable Redmi phone for every user. The Redmi Note 13 Pro 5G, the vanilla Redmi Note 13 5G and the Pro+ stand out the most with excellent value for money. The Xiaomi 14T is another favorite lineup of ours. The new 14T and 14T Pro offer substantial upgrades over their predecessors without resorting to price increases. Although Xiaomi isn't advertising them as flagship killers, we believe they are as close as you can get to a flagship phone without breaking the bank. Moreover, the 14T and 14T Pro offer one of the best camera experiences in their respective price brackets. Losers: Xiaomi Watch S4 The Xiaomi Watch S4 is a decent smartwatch for what it is. But it's behind the curve compared to proper smartwatches, not glorified fitness trackers. Sadly, the Watch S4 didn't bring any meaningful improvements over its predecessor. Xiaomi's top-tier watches are still running on proprietary HyperOS instead of Wear OS, which deprives them of deeper Android integration and a handful of useful Play Store apps. Watch face selection isn't as rich either. The Mi Fitness companion app needs more work too. Xiaomi released a handful of cool new products this year and we can't wait to see their successors in the next one. However, we wish they would focus more on the software side as it would benefit their devices across all lineups.",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eXiaomi had a relatively uneventful 2024, but not in the negative sense. Most of what Xiaomi released this year was expected evolution of its previous-gen devices, but not necessarily boring. Maybe the only thing that shook up the scene was the release of its first-ever EV - the Xiaomi SU7. So, let\u0026#39;s begin with this one.\u003c/p\u003e\n\n\u003ch3\u003eWinner: Xiaomi SU7\u003c/h3\u003e\n\n\u003cp\u003eIf we just look at the stats, the Xiaomi SU7 is a hit. The company\u0026#39;s brand-new factory is working overtime to meet the demand and was able to surpass its initial goal for 2024 by a large margin.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"900\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200w5/gsmarena_004.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003cp\u003eSubjectively speaking, Xiaomi did very well with its first car. We even had the \u003ca href=\"https://www.arenaev.com/xiaomi_su7_max_ride_along_and_inside_look-news-3738.php\"\u003echance to take it for a spin\u003c/a\u003e and are impressed by the build quality, features and ergonomics. It\u0026#39;s as if Xiaomi has previous experience with building vehicles.\u003c/p\u003e\n\n\u003ch3\u003eLosers: HyperOS and battery life\u003c/h3\u003e\n\n\u003cp\u003eIt feels like HyperOS is lagging behind the competition in some aspects. That\u0026#39;s not to say Xiaomi\u0026#39;s overlay is bad overall as it certainly has its strong aspects. Our experience with HyperOS is very smooth and reliable. However, the feature segregation between the Chinese ROM, the global one, and the Poco launcher is mind-boggling at this point.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"750\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200/gsmarena_006.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003cp\u003eA handful of features remain exclusive to the Chinese version of the OS. One example is the notification history. Another difference, but hard to wrap our heads around, is the missing double-tap-to-lock function, which can be found on Pocos but not on standard Xiaomis and Redmis. Go figure!\u003c/p\u003e\n\n\u003cp\u003eAnd our last complaint is about battery life. Judging by our tests, Xiaomi\u0026#39;s phones have struggled to deliver competitive battery life across its entire range of phones, so it\u0026#39;s easy to conclude that HyperOS is the main culprit.\u003c/p\u003e\n\n\u003cp\u003eWe are probably the last ones to complain about AI, but HyperOS feels behind the curve when it comes to AI-powered features. We hope 2025 will be for the better.\u003c/p\u003e\n\n\u003ch3\u003eWinner: Xiaomi 14 Ultra\u003c/h3\u003e\n\n\u003cp\u003eAnother year, another great flagship phone from Xiaomi. Despite the unimpressive battery life, the phone excels in pretty much every other aspect. And perhaps more importantly, it\u0026#39;s one of the best cameraphones on the market.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200w5/gsmarena_005.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003cp\u003eWe are particularly impressed by the video recording capabilities and the versatile camera setup with various focal lengths.\u003c/p\u003e\n\n\u003ch3\u003eLoser: Poco lineup\u003c/h3\u003e\n\n\u003cp\u003eRemember when people were eagerly waiting for the next Poco-branded flagship killer? Seemingly, those days are gone. The Poco lineup expanded and still has a couple of competitive models like the Poco X6 Pro and maybe even the Poco M6 Pro. Both devices are pretty good all-rounders in their respective classes, but we feel like most handsets under the Poco branding are just fillers.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200w5/gsmarena_001.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003cp\u003eEven the Poco F6 Pro this year didn\u0026#39;t excite. Sure, you get a top-tier chipset at a relatively low price, but smartphones have never been about just chipsets, especially in 2024. The camera experience is lackluster, the battery life isn\u0026#39;t great, and the display is just about what you\u0026#39;d expect from a phone in this price bracket. And at the end of the day, you are getting a mid-range phone with a flagship chipset at best. Xiaomi needs to work more on its Poco lineup to bring back its former glory.\u003c/p\u003e\n\n\u003ch3\u003eWinners: Redmi and Xiaomi 14T series\u003c/h3\u003e\n\n\u003cp\u003eAs is usually the case, Xiaomi\u0026#39;s Redmi lineup is one of the best sellers in 2024. One could argue that the lineup became a bit overcrowded and sometimes confusing, but it\u0026#39;s just Xiaomi\u0026#39;s way of appealing to the masses. There\u0026#39;s a suitable Redmi phone for every user. The Redmi Note 13 Pro 5G, the vanilla Redmi Note 13 5G and the Pro+ stand out the most with excellent value for money.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200w5/gsmarena_002.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003cp\u003eThe Xiaomi 14T is another favorite lineup of ours. The new 14T and 14T Pro offer substantial upgrades over their predecessors without resorting to price increases. Although Xiaomi isn\u0026#39;t advertising them as flagship killers, we believe they are as close as you can get to a flagship phone without breaking the bank. Moreover, the 14T and 14T Pro offer one of the best camera experiences in their respective price brackets.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200w5/gsmarena_003.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003ch3\u003eLosers: Xiaomi Watch S4\u003c/h3\u003e\n\n\u003cp\u003eThe Xiaomi Watch S4 is a decent smartwatch for what it is. But it\u0026#39;s behind the curve compared to proper smartwatches, not glorified fitness trackers. Sadly, the Watch S4 didn\u0026#39;t bring any meaningful improvements over its predecessor.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"653\" src=\"https://fdn.gsmarena.com/imgroot/news/24/12/winners-losers-xiaomi-2024/gallery/-1200/gsmarena_007.jpg\" alt=\"2024 Winners and losers: Xiaomi\"/\u003e\u003c/p\u003e\u003cp\u003eXiaomi\u0026#39;s top-tier watches are still running on proprietary HyperOS instead of Wear OS, which deprives them of deeper Android integration and a handful of useful Play Store apps. Watch face selection isn\u0026#39;t as rich either. The Mi Fitness companion app needs more work too.\u003c/p\u003e\n\n\u003cp\u003eXiaomi released a handful of cool new products this year and we can\u0026#39;t wait to see their successors in the next one. However, we wish they would focus more on the software side as it would benefit their devices across all lineups.\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-27T23:34:01+01:00",
  "modifiedTime": null
}
