[
  {
    "id": "cead52d2-5648-4c75-b959-4a9315143bcd",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "c9646e02-e7b5-445e-b1f0-92c268e1d0e8",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "6368f194-57a9-4f5c-99de-6527b248f6fb",
    "title": "Book of the month: Baqytgul Sarmekova",
    "link": "https://ayearofreadingtheworld.com/2025/01/30/book-of-the-month-baqytgul-sarmekova/",
    "description": "I love small presses. They are the heroes of the international-literature world, taking risks and bringing into Englishes stories that would never win the backing of the more conservative and commercially driven big houses. Tilted Axis Press is one of several that I particularly admire. The essay collection Violent Phenomena that it published in 2022, […]",
    "author": "Ann Morgan",
    "published": "Thu, 30 Jan 2025 14:04:41 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/01/IMG_7570-1.jpg?resize=550%2C607\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Asia",
      "Book of the month",
      "The stories",
      "Baqytgul Sarmekova",
      "book review",
      "books",
      "culture",
      "Kazakhstan",
      "short story",
      "Tilted Axis Press",
      "translation"
    ]
  },
  {
    "id": "fdd4b085-e6c9-44fa-a280-57c263cfa073",
    "title": "Book of the month: Kim Leine",
    "link": "https://ayearofreadingtheworld.com/2024/12/23/book-of-the-month-kim-leine/",
    "description": "This novel was a recommendation from leading English-Danish translator Signe Lyng. After we met at the Dublin Book Festival in November, she generously sent me a list of recent Danish-language novels that she admires, including Niviaq Korneliussen’s Last Night in Nuuk and Solvej Balle’s On the Calculation of Volume. One of Lyng’s suggestions stood out […]",
    "author": "Ann Morgan",
    "published": "Mon, 23 Dec 2024 12:40:26 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/12/52695486065_e6dfcd5dc2_b.jpg?resize=550%2C413\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Book of the month",
      "Europe",
      "Post-world",
      "The stories",
      "book review",
      "books",
      "colonialism",
      "culture",
      "Danish",
      "Greenland",
      "history",
      "Kim Leine",
      "Martin Aitken",
      "translation"
    ]
  },
  {
    "id": "1027ca55-b523-49d7-8a16-41365a8d6669",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "ee3c7891-c5fe-4f47-b763-c6410a92a141",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "a6a7bae6-9356-451b-bcb8-27a3e76a1cb5",
    "title": "The Book Trends of 2025, According to Goodreads",
    "link": "https://bookriot.com/the-book-trends-of-2025-according-to-goodreads/",
    "description": "As the announcements of new book releases out in 2025 roll in, Goodreads has spotted a few trends—things like paint ...",
    "author": "Danika Ellis",
    "published": "Mon, 03 Feb 2025 18:48:52 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/02/paint-drips.png.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "News",
      "breaking in books"
    ]
  },
  {
    "id": "d11ef362-c4f3-430e-96f3-1ad6019deeea",
    "title": "Libraries are Good in Ways You Might Not Expect",
    "link": "https://bookriot.com/libraries-are-good-in-ways-you-might-not-expect/",
    "description": "Libraries are good for you in ways you might not have thought of, an overdue translation comes to English, dystopian novels pop (again). All in today's book news.",
    "author": "Jeff O'Neal",
    "published": "Mon, 03 Feb 2025 17:25:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2024/12/library-image.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "833394b8-d514-4b8b-99f0-7a07307a31e6",
    "title": "STOMP OFF, LET'S GO",
    "link": "https://www.kirkusreviews.com/book-reviews/ricky-riccardi/stomp-off-lets-go/",
    "description": "Riccardi, director of research collections at the Louis Armstrong House Museum and author of two books on the great jazz trumpeter, explores Armstrong’s formative years. With the assistance of new primary sources, he takes on numerous rumors and biographical discrepancies about Armstrong and others in his life. Written in an easygoing, detail-laden, conversational style and relying extensively on Armstrong’s own writings, Riccardi portrays a boy from New Orleans “abandoned by his father, working two jobs, going to school, no shoes on his feet, sometimes with nothing to eat, living in a single-room flat, smack in the post-Reconstruction Jim Crow South.” It was at an orphanage (his parents, still alive, were separated) that the 12-year-old fell in love with music and learned to play the cornet. After hauling coal all day, he played in honky-tonks, eventually putting a band together and getting paid. In 1917 he found a steady gig in a band and began using his signature white handkerchief. He also pimped a little, got stabbed, got arrested, and was gifted a good cornet. Riccardi captures Armstrong’s youthful excitement after joining Kid Ory’s band. He loved playing with the Marable band before crowds on excursion boats and with King Oliver and His Creole Jazz Band in Chicago, playing alongside pianist Lillian Hardin, his future wife. Armstrong would make his first recordings with them in 1923. Riccardi nicely chronicles Armstrong’s rise to stardom as he becomes an exceptional trumpet player, joining one great band after another while mastering his “garbling up and scatting,” blending jive and polishing his witty, outgoing personality. He also provides insightful information about how the music itself and bands were evolving over these years.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/e8667b0be99749c6bbb7532aba05af5d/adc478c089854556bc759d29bda72e15.jpg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "cb0f4882-ca3c-4c27-bf5e-4c772996f5a0",
    "title": "WHEN WE WERE HARDCORE",
    "link": "https://www.kirkusreviews.com/book-reviews/linda-michel-cassidy/when-we-were-hardcore/",
    "description": "The 11 stories in this collection share a common trajectory—they all center around engaging moments, swinging between humorous and dramatic, that shift the characters’ lives. In “As Happy As I Could Remember,” an unnamed narrator is ditched by her cousin during a road trip and befriends an eccentric group who adopt her into their off-grid lifestyle. As she struggles to figure out her future, another member of the party searches for her missing brother. The arguably funniest entry, “Lesson Plan,” acts as a parody of Donald Barthelme’s “The School”; instead of classroom animals with short lifespans, teacher Eliza deals with pets that just won’t die. The problem is, the principal wants her to give her kindergarteners the “death talk,” and she has no dead rodent to help. On the opposite end of the spectrum, the two strongest stories are more sentimental: “Like Salmon on Their Way Home” is a beautiful and moving tale about siblings Luanne and her younger brother Fred connecting after their father dies; “Soon It Will Be Summer,” which acts as the book’s conclusion, takes place in a small ski town and focuses on Ezra, a genius student and lift-operator who was raised by his older sister in a run-down trailer. (“I measured my childhood by the difference in color between what was under the poster and the rest of the wall.”) His situation is complicated when his sister becomes pregnant, thwarting his plans of going to college and making something of himself. The prose shines throughout, but some of the stories can feel flat in comparison to others. Even so, the collection is full of heart, and every character feels vibrantly alive and relatable.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/518cc329c21149e08ab80ba038165940/53c4d95ac76f4487bfc26ed2120302a5.jpeg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "c7b81f9f-e0e3-436c-a062-34bbef84ef43",
    "title": "New Mystery \u0026 Thriller Novels for Fans of The Instigators",
    "link": "https://www.newinbooks.com/new-mystery-thriller-novels-for-fans-of-the-instigators/",
    "description": "New Mystery \u0026 Thriller Novels for Fans of The Instigators If The Instigators kept you on the edge of your seat, you won’t want to miss these new mystery and thriller novels. Packed with high-stakes twists, electrifying tension, and unforgettable characters, these books deliver the same pulse-pounding excitement. Whether you... Read More The post New Mystery \u0026 Thriller Novels for Fans of The Instigators appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 31 Jan 2025 15:51:49 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "Mystery",
      "News",
      "Thriller"
    ]
  },
  {
    "id": "6083e9d5-9a42-4834-b639-7de6e31d54d5",
    "title": "6 New Romance Novels for Fans of Find Me Falling",
    "link": "https://www.newinbooks.com/6-new-romance-novels-for-fans-of-find-me-falling/",
    "description": "6 New Romance Novels for Fans of Find Me Falling If you loved Find Me Falling and crave more heartfelt, atmospheric romances, you’re in for a treat. These six new romance novels capture the same blend of deep emotions, second chances, and the magic of unexpected connections. From sun-soaked settings... Read More The post 6 New Romance Novels for Fans of Find Me Falling appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 31 Jan 2025 15:47:39 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "News",
      "Romance"
    ]
  }
]
