[
  {
    "id": "a8ce4b2b-f0c1-452d-ac33-e5e63da4d4ce",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "93d50ab1-3f2f-4719-a8ea-b0882035ab2b",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "76fcecf3-5724-4074-b07a-53a7605678d0",
    "title": "Dublin Book Festival",
    "link": "https://ayearofreadingtheworld.com/2024/11/11/dublin-book-festival/",
    "description": "Last weekend, I had the privilege of being part of the line-up at Dublin Book Festival, an annual celebration of all things literary in Ireland’s capital. My event was a discussion of reading the world with Literature Ireland director Sinéad Mac Aodha (pictured with me above), who helped launch Crossing Over at Hodges Figgis last […]",
    "author": "Ann Morgan",
    "published": "Mon, 11 Nov 2024 15:39:24 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/11/PHOTO-2024-11-10-09-09-31.jpg?resize=550%2C413\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Events",
      "Post-world",
      "Reading the World (book)",
      "books",
      "Dublin Book Festival",
      "Ireland",
      "literature",
      "translation",
      "travel",
      "writing"
    ]
  },
  {
    "id": "6558a047-15bd-4c50-987d-e4b578773e80",
    "title": "Book of the month: Hugo Claus",
    "link": "https://ayearofreadingtheworld.com/2024/10/31/book-of-the-month-hugo-claus/",
    "description": "A few weeks ago, I found myself having lunch next to the Belgian author David Van Reybrouck. We were in the writers’ room at the Cheltenham Literature Festival, where he had just taken part in a panel discussion on the end of empire, drawing on his Baillie Gifford Prize-shortlisted book Revolusi: Indonesia and the Birth […]",
    "author": "Ann Morgan",
    "published": "Thu, 31 Oct 2024 15:40:49 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/10/image.png?resize=550%2C628\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Book of the month",
      "Europe",
      "Post-world",
      "The stories",
      "Belgium",
      "book review",
      "books",
      "culture",
      "David Van Reybrouck",
      "Dutch",
      "Flemish",
      "Hugo Claus",
      "translation"
    ]
  },
  {
    "id": "4c641f3d-85e6-42d5-86bc-26eed72c8696",
    "title": "The Buzziest Books of November | 2024",
    "link": "https://www.newinbooks.com/the-buzziest-books-of-november-2024/",
    "description": "The Buzziest Books of November | 2024 Get ready to cozy up with a literary feast this November! As the crisp autumn air settles in, our curated selection of must-read titles is here to keep you warm and inspired. From heartwarming tales of gratitude to thrilling stories that echo the... Read More The post The Buzziest Books of November | 2024 appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 22 Nov 2024 15:52:24 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "eBook",
      "News"
    ]
  },
  {
    "id": "e5990902-2518-4868-ac28-99b9612425d4",
    "title": "6 New Business Books for Fans of Tom Peters",
    "link": "https://www.newinbooks.com/6-new-business-books-for-fans-of-tom-peters/",
    "description": "6 New Business Books for Fans of Tom Peters If you’re a fan of Tom Peters and his groundbreaking insights into business innovation, leadership, and customer obsession, you’re always on the lookout for books that challenge conventional thinking and inspire action. From bold takes on organizational culture to fresh perspectives... Read More The post 6 New Business Books for Fans of Tom Peters appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 22 Nov 2024 14:44:55 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "Business \u0026 Finance",
      "eBook",
      "News"
    ]
  },
  {
    "id": "9adb21f9-5b41-46ca-a318-da70673eb4e8",
    "title": "The Biggest Book World News of the Week",
    "link": "https://bookriot.com/today-in-books-november-24-2024/",
    "description": "Cormac McCarthy's secret relationship with an underage girl, the winners of the 2024 National Book Awards, and more.",
    "author": "Rebecca Joines Schinsky",
    "published": "Sun, 24 Nov 2024 16:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2024/10/national-book-award-logo.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "e769a0a0-e25d-432a-b6c1-b9be1581f640",
    "title": "Book Riot’s Deals of the Day for November 24, 2024",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-november-24-2024/",
    "description": "A Chicano Coming-of-Age Classic, the Women of Ovid's METAMORPHOSES, a Holly Jackson Mystery, and More of the Best Deals of the Day",
    "author": "Deals",
    "published": "Sun, 24 Nov 2024 13:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2024/11/deals-112424.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  },
  {
    "id": "68e8aeb6-4e62-4b8f-b771-5b440de66a3d",
    "title": "SHOOTING THE BREEZE",
    "link": "https://www.kirkusreviews.com/book-reviews/christopher-little/shooting-the-breeze/",
    "description": "Little received his first camera from his father when he was 9 years old. With that serendipitous gift, he embarked on an impressive career as a photojournalist that spanned 40 years. He largely worked for Time, Incorporated and was given the opportunity to photograph everything and everyone—Cary Grant, the Rolling Stones, presidents, and Playboy bunnies. His favorite genre was portraiture, with his preferred subjects being writers. This is unsurprising since his father was a newspaper columnist and his mother a playwright: “Authors are my favorite subjects. Before an assignment, if I haven’t already, I try to read at least one of their books. It makes for more interesting conversation. And, let’s face it, photographers aren’t always held in the highest esteem. Writers often find it challenging to conceal their surprise that I am one of their readers.” This insightfully candid and self-effacing observation typifies the intriguing memoir, one brimming with beautiful photographs. Little didn’t only shoot celebrities—he also captured wildlife in Africa and the war-torn streets of Belfast at the height of the Troubles. Nothing about Little’s career was pedestrian; even the nuptials he worked—for instance, Arnold Schwarzenegger and Maria Shriver’s wedding—were momentous.The author shares two parallel stories: the arc of his professional life as well as his personal one, told in a nonlinear fashion. He breaks his life into thematic packets of photos—for example, some organized around smoking subjects and others around pets. Little reflects briefly but profoundly on the era itself—he largely worked during the 1970s, ’80s, and ’90s, a time he considers a “golden age for freelance photojournalists,” when they were given generous budgets and “treated like little gods.” Eventually, this era was superseded by one considerably less hospitable to the industry—tightened budgets, the rise of the internet, and other factors led to this gilded age’s demise (The “magical, jolly ride was over”). The author conveys this vivid reflection without a hint of resentment. In fact, he is relentlessly grateful for his “front seat to history”: “With all that said, am I bitter? Quite the opposite. Mostly, I feel lucky that the accident of my birth date put me in the midst of the let-the-good-times-roll era of photojournalism.” This is not an edgy exposé digging up dirt on luminaries—Little is a professional of an older variety, a consummate gentleman who admiringly describes all of his subjects. Even David Letterman, who suddenly turned sour on the author for reasons unknown, is largely portrayed favorably. Nonetheless, this does not mean Little’s account is banal; quite the contrary, this is a compelling rendering of celebrities, a vanished age, and a career that, as the author acknowledges, couldn’t possibly occur today. Even if Little did not provide such a charmingly thoughtful commentary, the striking photos he reproduces here would make the book extremely worthwhile.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/4ebd242f42f747f287fe2a7d3f441115/b4cf82ec78f740be88fa6d8782a06efe.jpeg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "43e11f15-5338-40dd-b5a9-aa6cbcc5f694",
    "title": "BUILDING A LIGHT",
    "link": "https://www.kirkusreviews.com/book-reviews/derek-tao/building-a-light/",
    "description": "Following an injuryas a competitive runner during his senior year of high school, Tao learned about the field of physical therapy and found it to be a “profound, eye-opening experience.” By 2020, he’d taken the most difficult, but potentially most rewarding first step in his career: residency at a health clinic in San Francisco. As Tao’s first mentor at the residency explained, “The first trimester, we break the resident down. The second trimester, we break down the residents even more,” before building them back up in the third. Tao found plenty of challenges, as the already rigorous program took place during the Covid-19 pandemic. Patients challenged him, due to his youthful looks, or gave only vague information about their symptoms. This created difficult scenarios for the young PT, but offered a wealth of experience, which he relates in detail. Tao quickly appreciated a fundamental question as a healthcare provider: “To what extent do I as a physical therapist support patients with needs outside of what’s written on the referral?” That question becomes a main driver of Tao’s memoir as his second trimester coincided with the 2020 presidential election and Jan. 6 insurrection, leading to constant, heightened anxiety in the clinic and among patients. Tao also writes extensively about rising hate crimes against Asian Americans and their impact on him as the child of first-generation Taiwanese immigrants. He faced his biggest challenge going into the third trimester without having successfully passed his LPE (Live Patient Examination). The stress forced the author to dig deep to find the strength to persevere without burning out. Over the course of this memoir, Tao narrates his experiences with an approachable, personable tone, offering plenty of concise descriptions that bring lighthearted humor to the proceedings. The frustration he feels, for example, trying to steer a patient away from ramblings about vitamins and ethnic backgrounds to describe their symptoms will speak to anyone who’s starting out in the healthcare industry. He also does not shy away from revealing his own emotional struggles, including the panic that he experienced before some difficult cases and the feeling of “slowly drowning, sinking under the standard expected of the residency.” His accounts of trying to perform at his best despite the grim national political situation is relatable, as are his broader reflections on healthcare being “one of the great intersections of humanity.” However, Tao’s book is clearly intended for an audience of readers who are already on the path to becoming physical therapists or those possessing enough medical knowledge to appreciate his very specific, point-by-point breakdowns of consultations. Nonexperts may find it difficult to connect with these passages, but those readers who may be seeking a friendly voice to offer advice on his chosen field will be happy to learn it from him.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/21a6cff2797841709f03560bcf62e2f0/83298bbdc8ba44ab8632816098a592f8.jpeg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "2468c4c8-fee8-4764-9ed2-0f68ac5de533",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "c384533b-ef4c-4956-b93d-56fc3ddc0825",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  }
]
