[
  {
    "id": "5681c9ef-82bb-4a0e-90be-067e6f0d8ed6",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "6a468dec-641f-473e-9ba9-6e9f26e48cc0",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "6daeb9eb-3963-4876-b1c9-b3840f64e4d5",
    "title": "Book of the month: Susana Sanches Arins",
    "link": "https://ayearofreadingtheworld.com/2025/02/27/book-of-the-month-susana-sanches-arins/",
    "description": "I heard about this title from María Reimóndez, a brilliant Galician writer, translator, interpreter, academic and feminist campaigner who I met at Dibrugarh University International Literature Festival earlier this month. Moved by what she had to say about the erasure the Galician language and culture has battled, I asked for her recommendations. She mentioned several […]",
    "author": "Ann Morgan",
    "published": "Thu, 27 Feb 2025 14:28:32 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/02/IMG_7768.jpg?resize=550%2C452\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Book of the month",
      "Europe",
      "The stories",
      "book review",
      "books",
      "culture",
      "Galicia",
      "history",
      "memory",
      "Spanish Civil War",
      "Susana Sanches Arins",
      "translation"
    ]
  },
  {
    "id": "9c53902f-6f75-428f-b818-8f9a2e2e2b81",
    "title": "Dibrugarh University International Literature Festival 2025",
    "link": "https://ayearofreadingtheworld.com/2025/02/13/dibrugarh-university-international-literature-festival-2025/",
    "description": "Last week, I got to chair my dream literary festival event panel. It featured Togolese explorer Tété-Michel Kpomassie (my Togolese pick for my original year of reading the world), Bhutanese author and publisher Kunzang Choden (whose The Circle of Karma I also read in 2012), and Bissau-Guinean writer, publisher and engineer Abdulai Silá, whose The […]",
    "author": "Ann Morgan",
    "published": "Thu, 13 Feb 2025 15:03:40 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/02/PHOTO-2025-02-05-10-23-11.jpg?resize=550%2C457\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Literature festivals",
      "Post-world",
      "authors",
      "books",
      "culture",
      "Dibrugarh University International Literature Festival",
      "events",
      "India",
      "literature",
      "translation",
      "travel",
      "writing"
    ]
  },
  {
    "id": "1f692c7f-3b47-4108-858a-85595827ed89",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "6189c753-213f-4fd9-bc2c-7d68f643c90c",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "6105cbf8-92b5-4f6e-ac79-0b29559ae463",
    "title": "THE GOLDBERG MUTILATIONS",
    "link": "https://www.kirkusreviews.com/book-reviews/pablo-dstair/the-goldberg-mutilations/",
    "description": "Glenn Gould wakes up in a hotel room he has no memory of checking into, alarmingly separated from the potpourri of pills that permit him to navigate life. The scene he discovers in his room is as bizarre as it is macabre—a woman has been hacked to death with a hatchet, and a record player that is not his own is playing a recording of him (he doesn’t own that either) performing the Goldberg Variations on repeat. Stuffed in the victim’s mouth is a crumpled piece of paper on which is printed a hostile review of one of his performances, written by the critic Paul Henry Lang. Later, Gould learns the dead woman is a housekeeper who thought ill of him. Detective Inspector Dziurzynski interviews Gould and points out plainly how incriminating the scene is. Gould protests he is not only innocent but bewildered, lost in a “placid, medicinal haze,” his “nervous system in a state of fray”; the musician’s relentlessly neurotic condition is vividly and humorously depicted by the author in this enchantingly peculiar novel. Lang turns up dead next—he is killed within a day of the housekeeper’s demise—but Gould insists, despite mounting evidence to the contrary, that his hands are clean. The possibilities are many; maybe Gould is being framed? Of course, if he is not the killer, surely his life is in grave danger. As Dziurzynski notes: “If what I believe is correct, Mister Gould, there is someone very dangerous standing behind you, in the dark, breathing down your neck. They’ve proven themselves not only vicious, but calculating. Patient. In one way or another, however unwittingly, you are their link to whichever macabre impulse fuels this blood-thirsty endeavor.”D’Stair has composed a grippingly deconstructed version of the classic crime drama—not only is it never entirely obvious who the killer is, it’s never certain Gould can rule himself out. It might even be the case there is another Glenn Gould somewhere, a doppelgänger of sorts. The reader will never solve the crime or predict the novel’s defiantly strange ending—that is a decisive neatness the author seems intent on undermining. D’Stair paints a dizzying picture that is deliciously complex; apparently, there is nothing as philosophically intractable as murder. As Dziurzynski declaims: “Murder is gonna be the most convoluted kerfuffle imaginable. Not even imaginable! A happenstance so outside typical human experience the truth of any instance would sound farcical if laid out by barristers to jury-folk.” The dialogue between Dziurzynski and Gould can be a touch cute—snappy one-liners are exchanged with a manufactured alacrity and a contrived rhetorical refinement. But even this literary hyperbole seems appropriate if understood as an ironic comment on the detective genre, a reinvention of a style that must be as much commandeered as it is renovated. Either way, the prose is never a fatal distraction, and one can’t help but be fascinated by Gould’s compelling amalgam of genius and mental disability. This is a thrillingly unconventional novel, one that successfully reinvents an old literary convention from the inside.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/32bbe537c44b4e4ab0991f206276e6c8/21834908d4b24dcb8795ad9e37ab2331.jpg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "f396c1da-2e6f-4ba8-8420-eb689011a55d",
    "title": "PINE CONE REGROWN",
    "link": "https://www.kirkusreviews.com/book-reviews/elisa-boxer/pine-cone-regrown/",
    "description": "“Peering down / on the beings below,” Boxer writes anthropomorphically, a pine cone hangs for 40 years out of harm’s way, until a wildfire’s heat melts the resin that glues it together, and seeds are released to shower down to the ash-covered ground. “It wasn’t an end,” she concludes. “From the fire, / life / unfolds. / Green / and new / and ready / to begin.” As she explains in a reflective afterword, lodgepole pines are just one of several fire-dependent types of flora and fauna, reminding readers that we find our strength through adversity; like that pine cone, “we might find we were made for this very moment.” In the illustrations, small woodland creatures nest in branches or browse beneath them until a red tide of flames sweeps in. A season or so later, the ground is green again, and in a final scene, the smiling animals are back, going about their business amid piney seedlings. As a very basic introduction to serotinous trees (that is, those that can delay reproducing until certain specified conditions are met), this will do. But she uses the term serotinous without fully defining it; to judge from that rather oblique closing note, the author seems to have something more metaphorical in mind anyway. Even older audiences may be left wondering just what “moment” she means, though.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/897a1f8ebd834915a6e980c23d9fcb7d/9640be41947a42a5ad5195db10062789.jpg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "ce288bd4-b547-41ed-921d-3acd153a27e0",
    "title": "The Biggest Bookish News of the Week",
    "link": "https://bookriot.com/today-in-books-march-16-2025/",
    "description": "The author of THE HELP has no regrets, Moms For Liberty shuts down BookLooks, a celebrated Canadian author skips U.S. tours, and more.",
    "author": "S. Zainab Williams",
    "published": "Sun, 16 Mar 2025 15:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/red-eyeglasses-on-a-stack-of-newspapers.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "1ae74b4c-134e-470c-a24d-a8d8128ce97e",
    "title": "Book Riot’s Deals of the Day for March 16, 2025",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-march-16-2025/",
    "description": "A tender and queer grumpy/sunshine romance, a princess with a dark secret, Sicily amid the Peloponnesian War, and more of the best book deals of the day",
    "author": "Deals",
    "published": "Sun, 16 Mar 2025 11:30:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/03/daily-deals-2.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  },
  {
    "id": "695f9153-9714-4fbc-8355-a6864d7cc2c7",
    "title": "Brand New Business Books to Wake Up Leaders Everywhere",
    "link": "https://www.newinbooks.com/brand-new-business-books-to-wake-up-leaders-everywhere/",
    "description": "Brand New Business Books to Wake Up Leaders Everywhere Great leaders never stop learning. These fresh business books are packed with game-changing insights, bold ideas, and strategies to help you stay ahead. Whether you’re leading a team, launching a vision, or just looking for inspiration, these reads will challenge your... Read More The post Brand New Business Books to Wake Up Leaders Everywhere appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 14 Mar 2025 14:00:48 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "Business \u0026 Finance",
      "eBook",
      "News"
    ]
  },
  {
    "id": "099f4944-f86b-437b-8413-62ecb2ad979b",
    "title": "6 New Futuristic \u0026 Sci-Fi Infused YA Books to Read",
    "link": "https://www.newinbooks.com/6-new-futuristic-sci-fi-infused-ya-books-to-read/",
    "description": "6 New Futuristic \u0026 Sci-Fi Infused YA Books to Read From high-tech worlds to mind-bending adventures, these new YA books blend sci-fi with thrilling futures. Whether you love dystopian rebellions, space-faring heroes, or tech-driven mysteries, these reads will transport you to the unknown. Get ready for action, heart, and a... Read More The post 6 New Futuristic \u0026 Sci-Fi Infused YA Books to Read appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 14 Mar 2025 14:00:42 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "News",
      "Young Adult"
    ]
  }
]
