[
  {
    "id": "b0f3cc32-9507-4d35-8f18-32f37401339b",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "3a1ec59e-3de7-40fd-8955-c8f001186dfe",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "965dcbb2-cf4f-4975-bb67-8c4b1529e93f",
    "title": "Sherborne Travel Writing Festival",
    "link": "https://ayearofreadingtheworld.com/2025/04/22/sherborne-travel-writing-festival/",
    "description": "I’m not a travel writer. At least, that’s what I’ve always thought. This year, however, I do seem to be spending quite a lot of time speaking, writing and thinking about travel. Not only am I preparing to cover the literary trip of a lifetime for a national newspaper later this summer (watch this space), […]",
    "author": "Ann Morgan",
    "published": "Tue, 22 Apr 2025 10:09:51 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/04/PHOTO-2025-04-12-23-43-26.jpg?resize=550%2C482\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Events",
      "Literature festivals",
      "My books",
      "books",
      "culture",
      "literary award",
      "literary festivals",
      "reading",
      "Sherborne",
      "travel"
    ]
  },
  {
    "id": "febd2830-91ed-4227-912a-44b1c710e614",
    "title": "Book of the month: Hemley Boum",
    "link": "https://ayearofreadingtheworld.com/2025/03/31/book-of-the-month-hemley-boum/",
    "description": "This book was given to me by the Cameroonian writer Ernis, who I was lucky to meet in Assam last month. Conscious that I had not read any Cameroonian literature since Peter Green’s translation of Mongo Beti’s 1956 classic Mission to Kala, I asked her what contemporary writing from the country (in addition to her […]",
    "author": "Ann Morgan",
    "published": "Mon, 31 Mar 2025 13:36:12 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/03/IMG_7835.jpg?resize=550%2C733\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Africa",
      "Book of the month",
      "The stories",
      "book review",
      "books",
      "Cameroon",
      "culture",
      "Hemley Boum",
      "translation"
    ]
  },
  {
    "id": "4cc5561b-3da6-4c88-bb77-68d3f6e8dc94",
    "title": "All the News We Covered This Week",
    "link": "https://bookriot.com/today-in-books-april-26-2025/",
    "description": "the finalists for the 2025 Young Lions Fiction Award, this week's new releases and bestselling books, big library news, and more.",
    "author": "S. Zainab Williams",
    "published": "Sat, 26 Apr 2025 15:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/red-eyeglasses-on-a-stack-of-newspapers.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "cb9da63f-81d7-4895-964f-6d4401797a97",
    "title": "Book Riot’s Deals of the Day for April 26, 2025",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-april-26-2025/",
    "description": "A cozy, cat-centric Japanese novel, a Nigerian girl finds her voice, a twisty dark thriller, and more of the best book deals of the day",
    "author": "Deals",
    "published": "Sat, 26 Apr 2025 11:30:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/04/deals-042625.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  },
  {
    "id": "80fc2af2-00e1-49cb-86f2-f453fedaf1aa",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "a923d09b-32bb-412f-8acc-5466d3ac7880",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "35a1465c-254c-44b8-bbbf-c348a55b38ae",
    "title": "BUILD A SANDCASTLE",
    "link": "https://www.kirkusreviews.com/book-reviews/eileen-rajala-meyer/build-a-sandcastle/",
    "description": "A young child spends the day on the beach and receives advice on how to build the perfect sandcastle. The child is first encouraged to ask a friend to help. The pair then builds a solid base by forming a crater in a sand hill and packing it down. The book offers different options for building, such as two different methods to form castle towers (“stack soupy pancakes” or use “buckets and forms”). Once the castle is complete, the author suggests various tips for landscaping, decorating, and moat-building. The main text is written in verse with an AABB rhyme scheme. (The text occasionally visually reflects its own meaning—each word of the phrase “hip hip hooray” is bigger than the last, for example). Each page features a box with (nonrhyming) tips from a starfish, like first testing the sand to determine whether it’s a suitable spot for building: “Scoop up a handful of damp sand, squeeze it tightly, and then open your hand. If the sand ball stays together, you’ve found a good place. If it falls apart, keep hunting.” A helpful checklist ensures readers will have everything they need for their own beach day. Musil’s artwork features adorable, brightly colored fabric pieces arranged to depict the two children interacting with both their surroundings and various little sea creatures (including a crab taking a picture of their completed sandcastle). The story itself is fun in its musical rhythm (“Grab a pail. A tube works, too. / (Any hollow form will do.)”) and informative—in addition to building suggestions, the starfish tips provide further relevant information, like facts about sand and advice about avoiding damaging sea turtles’ nests while creating castles). Meyer has crafted a charming and joyous celebration of friendship, artistry, and nature in a surprisingly small package that is a true delight to read.",
    "author": "",
    "published": "",
    "image": "https://d2i1eo516w03f2.cloudfront.net/180/default.png",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "5aa067f7-883d-43ce-b69f-7baeaf34be8f",
    "title": "GEODE",
    "link": "https://www.kirkusreviews.com/book-reviews/corliss-corazza/geode/",
    "description": "Every town should have a place like the Geode Cafe and Bookshop, where the citizens of Umbra River, California, can gather to chat, read, and sip espresso drinks. Geode—its name a nod to the town’s Goldrush past—is owned by retired schoolteacher and empty-nester Olivia, a cheerful woman plagued by occasional migraines. She loves that her two best friends are close by; Anna is an animal psychic and the owner of Besties, the pet supply store and animal shelter next door to the cafe, and Emmaline is an aspiring writer who uses the store’s storage closet as an office. Since her husband was killed by a drunk driver, the young Emmaline has been on her own with her 4-year-old son, Charlie—who, like Anna, displays some psychic gifts. The three friends meet for weekly dinner and gossip, where they get into the secrets—good and bad—of their private lives, as well as those of Umbra River’s history. When Charlie starts having visions of a ghostly boy on a horse, it leads the women into an investigation of the town’s darkest chapter. Corazza’s prose casts a comforting spell on the reader, in part because so much of it is dedicated to praising the atmosphere of Olivia’s shop: “Geode’s old plank floors gave Emmaline the feeling of being pulled into Geode’s warm, calmly lit space, and if the appearance didn’t do it, the aroma of dough baking and fresh coffee did.” The plot, such as it is, moves at a snail’s pace as the town and its characters are introduced from various perspectives, with much information repeated and many cute businesses described in great detail. Despite some exceptions—cafe manager Lucy is a stock Irishwoman out of a bad 1950s comedy—the characters are well rendered, and the reader is mostly content to listen in on their conversations as they navigate the sometimes strange but more often mundane twists in their personal lives.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/7640259efeb94ec3b6bf45659dcb5829/a27f42b8b1e24d5d8368dc788b5cd475.jpeg.180x0_q85_autocrop.webp",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "a11467df-0dd1-4d1f-9c3d-1487fa8b002e",
    "title": "The Buzziest Books of April | 2025",
    "link": "https://www.newinbooks.com/the-buzziest-books-of-april-2025/",
    "description": "The Buzziest Books of April | 2025 April brought the heat 🔥 with a wave of books that readers can’t stop raving about. From twisty thrillers to powerful memoirs and dazzling debuts, these titles are lighting up book clubs, social feeds, and bestseller charts 📚✨. Whether you’re craving a page-turner... Read More The post The Buzziest Books of April | 2025 appeared first on NewInBooks.",
    "author": "kali",
    "published": "Fri, 25 Apr 2025 15:30:36 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "eBook",
      "News"
    ]
  },
  {
    "id": "f80de274-d26d-471b-bf69-287ab5d5fce1",
    "title": "New Literary Fiction Reads to Add to Your TBR List",
    "link": "https://www.newinbooks.com/new-literary-fiction-reads-to-add-to-your-tbr-list/",
    "description": "New Literary Fiction Reads to Add to Your TBR List Looking to refresh your reading list with some captivating new literary fiction? From hauntingly beautiful prose to thought-provoking narratives, these recent releases are must-adds to your TBR list. Here are the standout titles that deserve a spot on your shelf.... Read More The post New Literary Fiction Reads to Add to Your TBR List appeared first on NewInBooks.",
    "author": "kali",
    "published": "Fri, 25 Apr 2025 13:18:48 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "Literary Fiction",
      "News"
    ]
  }
]
