[
  {
    "id": "dfc21e03-8137-4c68-ba8b-569e8de2c59d",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "9d4e963b-312b-44be-9a5a-357c072a019b",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "c6798f5f-4c2e-4d80-aeba-36ba3c8c4474",
    "title": "Book of the month: Angèle Rawiri",
    "link": "https://ayearofreadingtheworld.com/2024/11/26/book-of-the-month-angele-rawiri/",
    "description": "This was a recommendation from Suroor Alikhan, who kindly invited me to be part of the Hyderabad Literature Festival Online series earlier this year and wrote about our event on her blog. Suroor is an extremely widely read person, so I knew when she suggested Gabonese author Angèle Rawiri’s The Fury and Cries of Women, […]",
    "author": "Ann Morgan",
    "published": "Tue, 26 Nov 2024 16:30:12 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/11/image.png?resize=300%2C464\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Africa",
      "Book of the month",
      "Angèle Rawiri",
      "book review",
      "books",
      "culture",
      "feminism",
      "Gabon",
      "infertility",
      "novel",
      "politics",
      "translation"
    ]
  },
  {
    "id": "8b1f613e-e3d7-4548-bf3e-0da061ec75e4",
    "title": "Dublin Book Festival",
    "link": "https://ayearofreadingtheworld.com/2024/11/11/dublin-book-festival/",
    "description": "Last weekend, I had the privilege of being part of the line-up at Dublin Book Festival, an annual celebration of all things literary in Ireland’s capital. My event was a discussion of reading the world with Literature Ireland director Sinéad Mac Aodha (pictured with me above), who helped launch Crossing Over at Hodges Figgis last […]",
    "author": "Ann Morgan",
    "published": "Mon, 11 Nov 2024 15:39:24 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/11/PHOTO-2024-11-10-09-09-31.jpg?resize=550%2C413\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Events",
      "Post-world",
      "Reading the World (book)",
      "books",
      "Dublin Book Festival",
      "Ireland",
      "literature",
      "translation",
      "travel",
      "writing"
    ]
  },
  {
    "id": "a6292b57-47e4-4ccf-a34e-45fa1d81c7ac",
    "title": "WHO DREW THE SHORT STRAW?",
    "link": "https://www.kirkusreviews.com/book-reviews/sam-sumac/who-drew-the-short-straw/",
    "description": "Each group is seeking an ancient gem-encrusted ceremonial dagger while a new Stonehenge is constructed, as both instruments are needed to reconnect with the Mkultrans, who first visited Earth 4,500 years ago. The extraterrestrials are intrigued by humans’ biological similarities to them (“Except that a Mkultran has a third nostril and a giant cephalopod-looking creature sitting atop his head”), but the would-be colonizers find humanity insufficiently advanced. They meet Haggur, a powerful psychic, who’s tasked with contacting them once humankind is ready for them. Haggur created the aforementioned dagger and taught witchcraft to Morgen an Spyrys and Pythia, who have an ongoing rivalry. Morgen is the novel’s narrator, whose “quasi-omniscient” asides detail a disastrous chain of events involving various characters; she currently inhabits the body of Harvey Ferguson, assistant to the world’s richest man, Buchanan Sanderborn. Elsewhere, Shaniqua Bishop, a young researcher, becomes a willing host for Pythia after the latter is unleashed from a cookbook in which Morgen imprisoned her 50 years ago. In a parallel storyline, Morton Richardson, a Midwestern insurance company president, eavesdrops on his wife, resulting in sexual insecurity and “psychic-emotional angst” that acts as a beacon to “predators circling around in the mystical Fourth Dimension.” Sumac’s outlandish work of speculative fiction presents readers with a sprawling, mystical battle across the ages. Over the course of the novel, the author weaves together a number of complex plotlines, which collectively result in a humorous alternate-history tale. The ongoing references to taxonomy and to the evolutionary behavior of alien races offer darkly comic observations on the dangerous dog-eat-dog mentality that earthly, spiritual, and alien species all seem to share. However, characters’ ongoing concerns about sexual prowess somewhat detract from the otherwise slick storytelling.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/e49ff143106745939c89cbd6093896c5/e2ba41ba6f684760a01d721af9338e3d.png.180x0_q85_autocrop.png",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "75f85c0f-3a55-4886-b1be-be25e6dd917b",
    "title": "THE BACK DOOR TO HEAVEN",
    "link": "https://www.kirkusreviews.com/book-reviews/bob-allen/the-back-door-to-heaven/",
    "description": "One more election—that’s all Pat Sullivan, precinct captain of Chicago’s 51st Ward, has to make it through. For 32 years, he’s been in charge of curb repair, potholes, snow removal, and turning out votes in his working-class South Side neighborhood. Pat is preparing a final push to re-elect alderman Eddie Byrne, after which he plans to finally retire and move with his wife, Mary, out of the city. Pat’s plans are shattered when he learns that his daughter-in-law Janice has been murdered, and that her husband—Pat’s son Tom—has been arrested as the primary suspect. Pat puts up his house and savings in order to bail Tom out of jail, only for his son to immediately go on the lam. If Pat can’t get Tom into court within 30 days, his life’s earnings will be forfeited—and to top it all off, Mary reveals to him that she’s dying of breast cancer. To save what’s left of his family, Pat must track down Tom and figure out what really happened to Janice. Along the way, he will have to contend with a dogged police detective who’s sure of Tom’s guilt, a reformed drug dealer turned major political donor, and a colorful assortment of lowlifes who could only come from the Windy City. Allen’s conversational prose captures his milieu, particularly the relatively underexplored world of political machine turnout operations. (“The energized crowd started to file out of the hall, milling about in front, most holding literature and flyers to be passed out during the evening to each house in the ward.”) Less a traditional crime yarn than a literary novel with some genre elements, the book will please readers with its strong sense of place and culture.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/e1a55c55ff224004aa4fd1b35d94bb1a/69f09d631b3f4b8aa520f08bbd273338.jpeg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "a19d3495-0fe8-4825-ad78-9c613f0cc0c8",
    "title": "New Anti-Terrorism Thriller Novels for Fans of Homeland",
    "link": "https://www.newinbooks.com/new-anti-terrorism-thriller-novels-for-fans-of-homeland/",
    "description": "New Anti-Terrorism Thriller Novels for Fans of Homeland Love the suspense and intrigue of Homeland? These new anti-terrorism thrillers deliver intense plots, high-stakes drama, and unforgettable characters—perfect for your next heart-pounding read. Forecast by Aaron Ryan Release Date: October 31 2024 From the bestselling author of the alien invasion military... Read More The post New Anti-Terrorism Thriller Novels for Fans of Homeland appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 29 Nov 2024 15:08:17 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "Mystery",
      "News",
      "Thriller"
    ]
  },
  {
    "id": "5c14556e-58cf-4ad7-8db1-dd307f41db6e",
    "title": "Tempting New Romance Novels to Fall for this Week",
    "link": "https://www.newinbooks.com/tempting-new-romance-novels-to-fall-for-this-week/",
    "description": "Tempting New Romance Novels to Fall for this Week Looking for your next great love story? This week’s lineup of new romance novels is filled with swoon-worthy moments, unforgettable characters, and heartwarming plots that will sweep you off your feet. Whether you’re in the mood for fiery passion, sweet connections,... Read More The post Tempting New Romance Novels to Fall for this Week appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 29 Nov 2024 15:08:01 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "News",
      "Romance"
    ]
  },
  {
    "id": "08a4b93b-20e1-4276-a317-cf995d935b8f",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "dda04e25-bc18-4fae-b6be-c189daa1fb0f",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "bb97636e-2788-4ba7-b103-76e9fc9812d8",
    "title": "Book Riot’s Deals of the Day for November 30, 2024",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-november-20-2024-2/",
    "description": "A Book of Delights, Mexican Recipes, a Revenge-Filled Thriller, yhe History of Cannibalism, and More of Today's Best Book Deals",
    "author": "Deals",
    "published": "Sat, 30 Nov 2024 13:30:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2024/11/deals-113024.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  },
  {
    "id": "16d25cda-0160-4c64-9d9d-e3a38407ac87",
    "title": "11 Queer Books to Vote for in the Final Round of the Goodreads Choice Awards",
    "link": "https://bookriot.com/queer-books-goodreads-choice-awards-2024-final-round/",
    "description": "Did your favorite queer book of 2024 make it to the final round?",
    "author": "Danika Ellis",
    "published": "Sat, 30 Nov 2024 12:30:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2023/05/rainbow-bookstore.png.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Our Queerest Shelves"
    ]
  }
]
