{
  "id": "27e91e21-cbbb-448e-8a1a-c719c79451e4",
  "title": "'It's everything I've dreamed of' - Bethell eager for more after Test taste",
  "link": "https://www.espncricinfo.com/ci/content/story/1463121.html?ex_cid=OTC-RSS",
  "description": "Jacob Bethell continued his serene start to life in an England shirt by hitting the winning runs in Christchurch",
  "author": "",
  "published": "Mon, 02 Dec 2024 18:55:09 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Vithushan Ehantharajah",
  "length": 6884,
  "excerpt": "Jacob Bethell continued his serene start to life in an England shirt by hitting the winning runs in Christchurch",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Hitting the winning run in a Test match that takes you to a half-century on debut. Walking off alongside England's all-time leading run-scorer, Joe Root. Sunday was just another of a series of bucket-list moments for Jacob Bethell.Since September, the 21-year-old has enjoyed life in England's priority lane, ticking off T20I and ODI caps against Australia and West Indies, registering three white-ball half-centuries against the latter. This first against the red was right out of his limited-overs playbook, taking just 37 deliveries, as the tourists chased 104 inside 13 overs to beat New Zealand by eight wickets in Christchurch. They take a 1-0 lead to Wellington.\"[It was] a hell of a lot of fun yeah,\" Bethell said. \"And to walk off with Rooty [who made 23 off 15] at the end there was pretty special.\"To come out in the second innings and have a chance to walk off with an England win was at the forefront of my mind and luckily I was able to do that.\"Stokes' brotherly helping hand gets the best out of Carse'Not something that requires work' - Latham not worried about NZ catchingBethell debut fifty, Carse ten-for seal England victoryStokes plays down injury scare after aborting over due to back sorenessThe second-innings speed run was in keeping with how England attack smaller targets. Barring a thick inside edge to get him off the mark, the other eight boundaries were real statements shots. Especially a pull for six on to the grass banks of the Hagley Oval off fellow debutant Nathan Smith.Smith did not take kindly to Bethell's onslaught, having copped four boundaries off the left-hander in his first over, and went to bouncers. Bethell, however, is no stranger to short-pitched bowling. He was reared on it as a kid born in Barbados and later raised the UK - a scholarship to Rugby School brought him over aged 12 - as a regular target of the intimidatory tactics of bigger kids.\"I was very small growing up so I didn't really get a lot in my half up until I was about 16 or 17 when I got a bit bigger,\" he said. \"I never had as much power on it but I could still play it well. And now it's just a decision on whether to hit it on the ground or hit it for six.\"Such confidence, delivered with a mixed Bajan and Brummie accent that has a distinctly Welsh feel - which almost makes sense as the crow flies - is why England had no qualms placing him at No. 3. Even his first innings was met with something of a shrug.Conditions were tough, New Zealand's seamers up and at them. Bethell backed himself, but managed just 10 from 34 balls - only getting off the mark with his 13th, still on one after 26 - before Smith snicked him off. Root's dismissal then had England reeling on 45 for 3 at lunch on day two.\"That's part of the game, isn't it?\" Bethell said, like he'd been here before. \"I saw it [as] if I got through to lunch, it looked like a different pitch after lunch. It does help when you've got Harry Brook batting, he makes it look quite easy.\"Since I was a little kid I've always dreamed of playing Test cricket, I remember watching the Ashes, and just any England Tests on TV and wanting to be a part of it\"\"I think it could have been a different story, I battled hard and unluckily didn't make it through to lunch but another day you get through and go on to make a big one.\"Ben Stokes singled out those 34 deliveries after the match rather than the half-century, clearly buoyed by the way someone so young owned his space during those first 49 minutes as a Test batter. \"If he sticks to having that attitude, that swagger about him, I'm pretty sure he's going to be alright,\" Stokes said.Bethell's selection for the tour outright was a huge show of faith, picked as the spare batter despite a first class average of 25.44 from 30 innings - none of which had come higher than No. 5. Not that he was worried.\"Pretty much every time I've played against better people, I've played better,\" he said. \"Step up to the Hundred, played better. Straight into internationals, played better. I didn't really have a doubt in my mind that coming into Test cricket that I'd have done well.\"The strut, the talk, the arrogance, reinforced by what was only his sixth first-class fifty, could see Bethell retain this new spot for the series. It would require Ollie Pope to keep the gloves and stay at No. 6, meaning Durham wicketkeeper Ollie Robinson, who arrived on Saturday as Jordan Cox's injury replacement, waiting his turn.England still regard Pope as their No. 3, and the man himself spoke forcefully that he still wants to make the position his own after his innings-saving 77 on day two. It is clear Pope wants that spot back for series against India and Australia next year.Bethell, however, is hopeful he gets a chance to show he can thrive up top, something he wants to do at Warwickshire but has not yet been able to make a solid case for.\"I like batting up the order so, yeah, I was really happy that opportunity arose,\" he said. \"I've always wanted to bat in the top four so three is perfect.\"I think my game is fit to play any style. On Sunday we saw a bit more of an attacking style. I can also absorb a bit of pressure, so I'm sure at times in my career there will be times to do that as well.\"As a multi-format batter already, inevitably there will come a time when Bethell is pulled a few different ways. It may already be happening.Following the conclusion of this Test series, he will head to Australia to fulfill his overseas commitments with Melbourne Renegades. And just last week, he was one of 12 English players picked up in the IPL mega auction, earning a maiden gig with Royal Challengers Bengaluru for a tidy sum of £245,000. It will also see him miss the first seven rounds of Warwickshire's County Championship campaign.He will join England team-mates Phil Salt and Liam Livingstone at RCB. No surprises, though, for guessing who he is most looking forward to rubbing shoulders with.\"It's a bit of a given, isn't it?\" Bethell said, with a wry smile. \"Virat! He's a great of the game so… King Kohli.\"Like all young players at the premier franchise competition, he wants to be a sponge. \"Any kind of overseas player that's gone over there has come back with a wealth of experience.\"But this first taste of the longest format has him craving more. With an Ashes tour on the horizon - England's successful 2010-11 tour was his formative series - this format, and this team, are where he wants to truly establish himself.\"It's everything I've dreamed of to be honest,\" Bethell said of Test cricket. \"Since I was a little kid I've always dreamed of playing Test cricket, I remember watching the Ashes, and just any England Tests on TV and wanting to be a part of it.\"And then since Baz [Brendon McCullum] took over with Stokesy, I've always watched it on TV and gone 'how fun that does that look' and it lived up to expectation. It was so fun.\"",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/392100/392142.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eHitting the winning run in a Test match that takes you to a half-century on debut. Walking off alongside England\u0026#39;s all-time leading run-scorer, Joe Root. Sunday was just another of a series of bucket-list moments for \u003ca href=\"https://www.espncricinfo.com/cricketers/jacob-bethell-1194959\"\u003eJacob Bethell\u003c/a\u003e.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSince September, the 21-year-old has enjoyed life in England\u0026#39;s priority lane, ticking off T20I and ODI caps against Australia and West Indies, registering three white-ball half-centuries against the latter. This first against the red was right out of his limited-overs playbook, taking just 37 deliveries, as the tourists chased 104 inside 13 overs to \u003ca href=\"https://www.espncricinfo.com/series/england-in-new-zealand-2024-25-1428550/new-zealand-vs-england-1st-test-1428554/full-scorecard\"\u003ebeat New Zealand by eight wickets in Christchurch\u003c/a\u003e. They take a 1-0 lead to Wellington.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;[It was] a hell of a lot of fun yeah,\u0026#34; Bethell said. \u0026#34;And to walk off with Rooty [who made 23 off 15] at the end there was pretty special.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;To come out in the second innings and have a chance to walk off with an England win was at the forefront of my mind and luckily I was able to do that.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/nz-vs-eng-ben-stokes-brotherly-helping-hand-gets-the-best-out-of-brydon-carse-1462958\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStokes\u0026#39; brotherly helping hand gets the best out of Carse\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/nz-vs-eng-tom-latham-not-worried-about-new-zealand-s-catching-1462984\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003e\u0026#39;Not something that requires work\u0026#39; - Latham not worried about NZ catching\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/england-in-new-zealand-2024-25-1428550/new-zealand-vs-england-1st-test-1428554/match-report-4\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eBethell debut fifty, Carse ten-for seal England victory\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/ben-stokes-injury-back-stiffness-gives-england-scare-1462794\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStokes plays down injury scare after aborting over due to back soreness\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe second-innings speed run was in keeping with how England attack smaller targets. Barring a thick inside edge to get him off the mark, the other eight boundaries were real statements shots. Especially a pull for six on to the grass banks of the Hagley Oval off fellow debutant Nathan Smith.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSmith did not take kindly to Bethell\u0026#39;s onslaught, having copped four boundaries off the left-hander in his first over, and went to bouncers. Bethell, however, is no stranger to short-pitched bowling. He was reared on it as a kid born in Barbados and later raised the UK - a scholarship to Rugby School brought him over aged 12 - as a regular target of the intimidatory tactics of bigger kids.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I was very small growing up so I didn\u0026#39;t really get a lot in my half up until I was about 16 or 17 when I got a bit bigger,\u0026#34; he said. \u0026#34;I never had as much power on it but I could still play it well. And now it\u0026#39;s just a decision on whether to hit it on the ground or hit it for six.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSuch confidence, delivered with a mixed Bajan and Brummie accent that has a distinctly Welsh feel - which almost makes sense as the crow flies - is why England had no qualms placing him at No. 3. Even his first innings was met with something of a shrug.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eConditions were tough, New Zealand\u0026#39;s seamers up and at them. Bethell backed himself, but managed just 10 from 34 balls - only getting off the mark with his 13th, still on one after 26 - before Smith snicked him off. Root\u0026#39;s dismissal then had England reeling on 45 for 3 at lunch on day two.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;That\u0026#39;s part of the game, isn\u0026#39;t it?\u0026#34; Bethell said, like he\u0026#39;d been here before. \u0026#34;I saw it [as] if I got through to lunch, it looked like a different pitch after lunch. It does help when you\u0026#39;ve got Harry Brook batting, he makes it look quite easy.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u0026#34;Since I was a little kid I\u0026#39;ve always dreamed of playing Test cricket, I remember watching the Ashes, and just any England Tests on TV and wanting to be a part of it\u0026#34;\u003c/p\u003e\u003ccite\u003e\u003c/cite\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think it could have been a different story, I battled hard and unluckily didn\u0026#39;t make it through to lunch but another day you get through and go on to make a big one.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBen Stokes singled out those 34 deliveries after the match rather than the half-century, clearly buoyed by the way someone so young owned his space during those first 49 minutes as a Test batter. \u0026#34;If he sticks to having that attitude, that swagger about him, I\u0026#39;m pretty sure he\u0026#39;s going to be alright,\u0026#34; Stokes said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBethell\u0026#39;s selection for the tour outright was a huge show of faith, picked as the spare batter despite a first class average of 25.44 from 30 innings - none of which had come higher than No. 5. Not that he was worried.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Pretty much every time I\u0026#39;ve played against better people, I\u0026#39;ve played better,\u0026#34; he said. \u0026#34;Step up to the Hundred, played better. Straight into internationals, played better. I didn\u0026#39;t really have a doubt in my mind that coming into Test cricket that I\u0026#39;d have done well.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe strut, the talk, the arrogance, reinforced by what was only his sixth first-class fifty, could see Bethell retain this new spot for the series. It would require \u003ca href=\"https://www.espncricinfo.com/cricketers/ollie-pope-887207\"\u003eOllie Pope\u003c/a\u003e to keep the gloves and stay at No. 6, meaning Durham wicketkeeper \u003ca href=\"https://www.espncricinfo.com/cricketers/ollie-robinson-893955\"\u003eOllie Robinson\u003c/a\u003e, who arrived on Saturday as Jordan Cox\u0026#39;s injury replacement, waiting his turn.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eEngland still regard Pope as their No. 3, and the man himself spoke forcefully that\u003ca href=\"https://www.espncricinfo.com/story/nz-vs-england-1st-test-ollie-pope-channels-the-jitters-to-reframe-discussions-around-his-spot-1462509\"\u003e he still wants to make the position his own\u003c/a\u003e after his innings-saving 77 on day two. It is clear Pope wants that spot back for series against India and Australia next year.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBethell, however, is hopeful he gets a chance to show he can thrive up top, something he wants to do at Warwickshire but has not yet been able to make a solid case for.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I like batting up the order so, yeah, I was really happy that opportunity arose,\u0026#34; he said. \u0026#34;I\u0026#39;ve always wanted to bat in the top four so three is perfect.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think my game is fit to play any style. On Sunday we saw a bit more of an attacking style. I can also absorb a bit of pressure, so I\u0026#39;m sure at times in my career there will be times to do that as well.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAs a multi-format batter already, inevitably there will come a time when Bethell is pulled a few different ways. It may already be happening.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eFollowing the conclusion of this Test series, he will head to Australia to fulfill his overseas commitments with Melbourne Renegades. And just last week, he was one of 12 English players picked up in the IPL mega auction, earning a maiden gig with Royal Challengers Bengaluru for a tidy sum of £245,000. It will also see him miss the first seven rounds of Warwickshire\u0026#39;s County Championship campaign.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eHe will join England team-mates Phil Salt and Liam Livingstone at RCB. No surprises, though, for guessing who he is most looking forward to rubbing shoulders with.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a bit of a given, isn\u0026#39;t it?\u0026#34; Bethell said, with a wry smile. \u0026#34;Virat! He\u0026#39;s a great of the game so… King Kohli.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eLike all young players at the premier franchise competition, he wants to be a sponge. \u0026#34;Any kind of overseas player that\u0026#39;s gone over there has come back with a wealth of experience.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBut this first taste of the longest format has him craving more. With an Ashes tour on the horizon - England\u0026#39;s successful 2010-11 tour was his formative series - this format, and this team, are where he wants to truly establish himself.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s everything I\u0026#39;ve dreamed of to be honest,\u0026#34; Bethell said of Test cricket. \u0026#34;Since I was a little kid I\u0026#39;ve always dreamed of playing Test cricket, I remember watching the Ashes, and just any England Tests on TV and wanting to be a part of it.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;And then since Baz [Brendon McCullum] took over with Stokesy, I\u0026#39;ve always watched it on TV and gone \u0026#39;how fun that does that look\u0026#39; and it lived up to expectation. It was so fun.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-02T09:59:00Z",
  "modifiedTime": null
}
