{
  "id": "34920f70-2ff0-4ba7-9c10-ccc9761ce1c7",
  "title": "'Heartbreaking' and 'embarrassing' - Chase laments West Indies batting woes",
  "link": "https://www.espncricinfo.com/ci/content/story/1495252.html?ex_cid=OTC-RSS",
  "description": "West Indies captain ponders where his batters go from here after being bowled out for 27",
  "author": "",
  "published": "Tue, 15 Jul 2025 01:18:46 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Alex Malcolm",
  "length": 4709,
  "excerpt": "West Indies captain ponders where his batters go from here after being bowled out for 27",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "West Indies captain Roston Chase has described his side's capitulation against Australia in Jamaica as \"heartbreaking\" and \"embarrassing\".West Indies were bowled out for the second-lowest total in Test history at Sabina Park to lose the third Test and concede the series 3-0 in the process.Chasing 204 to win on the third day, West Indies were bowled out for 27 in 14.3 overs to set a host of new and unwanted records. The total was just one run better than New Zealand's Test-record low of 26 in 1955 but it was 20 runs short of West Indies' previous worst total of 47. It was the first time in Test history a team recorded seven ducks in an innings and the six runs made collectively by West Indies top-six batters was the lowest in any innings in Test history.Starc six-for, Boland hat-trick consign WIs to 27 all outStats - West Indies post second-lowest Test totalStarc and Boland amaze each other with stunning featsStarc takes the fastest five-wicket haul in men's Test historyMitchell Starc also took the fastest Test five-for ever, claiming the first five wickets of the innings in just 15 balls after picking up three wickets in the first over.Speaking after - at both the post-match presentation and the press conference - Chase was despondent.\"It's disappointing,\" Chase said. \"We've been putting ourselves in positions to win games, and then we just lay down and not put up a fight in the last batting innings. It's quite heartbreaking, because I think we did it in all three Tests, and we're not really learning from our mistakes. So that's something we have to really look at.\"Obviously being bowled out for less than 30 is quite embarrassing.\"\"I think the pitches were very tough. I don't want to say they were too in favour of the bowlers, but they were very tough because, as you can see, this is probably the first series I've ever played [where] no batter got a hundred for each side\"Roston ChaseChase thought the target of 204 was achievable and did not offer any excuses in regards to the surface, despite no batter in the match reaching 50. It was only the seventh time since 1900 and the third time since 1981 that no player had scored a half-century in a Test with at least two completed innings.\"I thought it was realistic,\" Chase said. \"I mean, the wicket was a good wicket, still a good batting wicket. I didn't think there was too many devils in the wicket, like the last two games where the ball was rolling or bouncing inconsistently. So yeah, we thought 204 was quite gettable. But then, obviously, with the start and stuff being [11 for 6] or something like that, it's very difficult to really get those runs from there.\"It capped off a horror series with the bat for West Indies' new-look line-up. They posted scores of 190, 141, 253, 143, 143 and 27 across the series. Brandon King was the only West Indies batter to score a half-century, posting the highest individual score on either side with 75 in Grenada. He was also the only West Indies batter to average more than 20 for the series with 21.50, discounting Anderson Phillip making 10 and 11 not out in his only Test in the series in Grenada. Australia had four batters average more than 30, but Travis Head was the only one to score more than 200 runs and average more than 32 thanks to his twin half-centuries in Barbados. Head, Cameron Green and Usman Khawaja were the only players in the series to face more than 300 balls across six innings.Chase did note that the pitches were tough overall for the batters but he did not want to take away too much from the performance of his bowlers.\"I think the pitches were very tough,\" he said. \"I don't want to say they were too in favour of the bowlers, but they were very tough because, as you can see, this is probably the first series I've ever played [where] no batter got a hundred for each side. So that's something that I've never really seen in a Test series. So that just goes to show how dominant the bowlers were.\"Chase conceded that West Indies faced a huge challenge to rebuild from here. They do not play Test cricket again until October and face entirely different conditions in India when they do.\"We need to really take a deep look at ourselves as batters,\" Chase said. \"The next series from here is quite a while. So we have time on our side. So I think that's what we need to really do, really have a look at our batting this series and see where we can improve and how we can put 300 run totals on the board.\"Obviously India is going to be different conditions, probably more spinner-friendly. So I think if you can have some batting camps around playing spin bowling and stuff like that, I think that will be ideal for us going into those conditions.\"",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/403700/403776.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eWest Indies captain \u003ca href=\"https://www.espncricinfo.com/cricketers/roston-chase-391832\"\u003eRoston Chase\u003c/a\u003e has described his side\u0026#39;s capitulation against Australia in Jamaica as \u0026#34;heartbreaking\u0026#34; and \u0026#34;embarrassing\u0026#34;.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWest Indies were bowled out for the second-lowest total in Test history at Sabina Park to \u003ca href=\"https://www.espncricinfo.com/series/australia-in-west-indies-2025-1472501/west-indies-vs-australia-3rd-test-1472519/full-scorecard\"\u003elose the third Test\u003c/a\u003e and concede the series 3-0 in the process.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eChasing 204 to win on the third day, West Indies were bowled out for 27 in 14.3 overs to set a host of \u003ca href=\"https://www.espncricinfo.com/story/wi-vs-aus-3rd-test-stats-west-indies-post-second-lowest-test-total-mitchell-starc-takes-five-for-in-15-balls-1495248\"\u003enew and unwanted records\u003c/a\u003e. The total was just one run better than New Zealand\u0026#39;s Test-record low of 26 in 1955 but it was 20 runs short of West Indies\u0026#39; previous worst total of 47. It was the first time in Test history a team recorded seven ducks in an innings and the six runs made collectively by West Indies top-six batters was the lowest in any innings in Test history.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/australia-in-west-indies-2025-1472501/west-indies-vs-australia-3rd-test-1472519/match-report-3\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eStarc six-for, Boland hat-trick consign WIs to 27 all out\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/wi-vs-aus-3rd-test-stats-west-indies-post-second-lowest-test-total-mitchell-starc-takes-five-for-in-15-balls-1495248\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eStats - West Indies post second-lowest Test total\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/mitchell-starc-and-scott-boland-each-other-with-stunning-feats-1495239\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eStarc and Boland amaze each other with stunning feats\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/mitchell-starc-takes-the-fastest-five-wicket-haul-in-test-history-1495233\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eStarc takes the fastest five-wicket haul in men\u0026#39;s Test history\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/mitchell-starc-311592\"\u003eMitchell Starc\u003c/a\u003e also took the fastest Test five-for ever, claiming the first five wickets of the innings in just 15 balls after picking up three wickets in the first over.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSpeaking after - at both the post-match presentation and the press conference - Chase was despondent.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s disappointing,\u0026#34; Chase said. \u0026#34;We\u0026#39;ve been putting ourselves in positions to win games, and then we just lay down and not put up a fight in the last batting innings. It\u0026#39;s quite heartbreaking, because I think we did it in all three Tests, and we\u0026#39;re not really learning from our mistakes. So that\u0026#39;s something we have to really look at.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Obviously being bowled out for less than 30 is quite embarrassing.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u0026#34;I think the pitches were very tough. I don\u0026#39;t want to say they were too in favour of the bowlers, but they were very tough because, as you can see, this is probably the first series I\u0026#39;ve ever played [where] no batter got a hundred for each side\u0026#34;\u003c/p\u003e\u003ccite\u003e\u003cp\u003eRoston Chase\u003c/p\u003e\u003c/cite\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eChase thought the target of 204 was achievable and did not offer any excuses in regards to the surface, despite no batter in the match reaching 50. It was only the seventh time since 1900 and the third time since 1981 that no player had scored a half-century in a Test with at least two completed innings.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I thought it was realistic,\u0026#34; Chase said. \u0026#34;I mean, the wicket was a good wicket, still a good batting wicket. I didn\u0026#39;t think there was too many devils in the wicket, like the last two games where the ball was rolling or bouncing inconsistently. So yeah, we thought 204 was quite gettable. But then, obviously, with the start and stuff being [11 for 6] or something like that, it\u0026#39;s very difficult to really get those runs from there.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIt capped off a horror series with the bat for West Indies\u0026#39; new-look line-up. They posted scores of 190, 141, 253, 143, 143 and 27 across the series. \u003ca href=\"https://www.espncricinfo.com/cricketers/brandon-king-670035\"\u003eBrandon King\u003c/a\u003e was the only West Indies batter to score a half-century, posting the highest individual score on either side with 75 in Grenada. He was also the only West Indies batter to average more than 20 for the series with 21.50, discounting Anderson Phillip making 10 and 11 not out in his only Test in the series in Grenada. Australia had four batters average more than 30, but Travis Head was the only one to score more than 200 runs and average more than 32 thanks to his twin half-centuries in Barbados. Head, Cameron Green and Usman Khawaja were the only players in the series to face more than 300 balls across six innings.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eChase did note that the pitches were tough overall for the batters but he did not want to take away too much from the performance of his bowlers.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think the pitches were very tough,\u0026#34; he said. \u0026#34;I don\u0026#39;t want to say they were too in favour of the bowlers, but they were very tough because, as you can see, this is probably the first series I\u0026#39;ve ever played [where] no batter got a hundred for each side. So that\u0026#39;s something that I\u0026#39;ve never really seen in a Test series. So that just goes to show how dominant the bowlers were.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eChase conceded that West Indies faced a huge challenge to rebuild from here. They do not play Test cricket again until October and face entirely different conditions in India when they do.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We need to really take a deep look at ourselves as batters,\u0026#34; Chase said. \u0026#34;The next series from here is quite a while. So we have time on our side. So I think that\u0026#39;s what we need to really do, really have a look at our batting this series and see where we can improve and how we can put 300 run totals on the board.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Obviously India is going to be different conditions, probably more spinner-friendly. So I think if you can have some batting camps around playing spin bowling and stuff like that, I think that will be ideal for us going into those conditions.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-15T00:48:00Z",
  "modifiedTime": null
}
