{
  "id": "48657b4b-baa7-4105-b49f-4203ab4c2812",
  "title": "England to be 'accountable' for fitness - Edwards",
  "link": "https://www.bbc.com/sport/cricket/articles/c2kv0vqn01lo",
  "description": "New head coach Charlotte Edwards will make England players “accountable” for their fitness following criticism during a dismal winter.",
  "author": "",
  "published": "Wed, 02 Apr 2025 17:29:49 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Stephan Shemilt",
  "length": 4357,
  "excerpt": "New head coach Charlotte Edwards will make England players “accountable” for their fitness following criticism during a dismal winter.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "New head coach Charlotte Edwards will make England players \"accountable\" for their fitness following criticism during a dismal winter.England were eliminated in the group stage at the T20 World Cup, then humiliated 16-0 in the Ashes in Australia.Head coach Jon Lewis and captain Heather Knight were both sacked last month, with legendary former skipper Edwards confirmed as Lewis' replacement on Tuesday.\"There is fitness testing next week and I'll judge for myself where they are at,\" Edwards told BBC Sport. \"I don't want people talking about the fitness of the England women's cricket team. Fitness is a non-negotiable. We should be fit.\"After England's early exit from the T20 World Cup in October, former spinner Alex Hartley said some players were \"letting the team down\" in terms of fitness.Athleticism again came into focus during the Ashes clean sweep, but Lewis attributed that to a cultural difference between the UK and Australia.The Lewis regime was also characterised by a more relaxed approach. During the World Cup, some England players attended boat parties in Dubai.\"Honesty and hard work are key to any culture,\" said Edwards, England's all-time leading run-scorer.\"If we've got that in place we will move pretty quickly in the right direction. We've got to work hard. That's for me to implement in training. We will talk to our science and medicine teams in terms of what we have to do with our fitness standards.\"Edwards won the Ashes and both World Cups as England captain only to be sacked in 2016 and replaced by Knight.Now Knight has been sacked but has indicated her desire to continue as a player. Edwards, 45, said she was not consulted in the decision to remove Knight.\"She sets such high standards, she's the ultimate professional and what we need around the England team right now,\" said Edwards. \"She's playing as well as I've ever seen her play. It was hard to watch the Ashes, because of the toll it was taking on her. Without the captaincy, hopefully she'll be able to go on to bigger and better things as a player.\"In order to take the England job, Edwards has left all of her roles in domestic cricket, including her post as Mumbai Indians head coach in the Women's Premier League. While he was England coach, Lewis was in charge of UP Warriorz in the same competition.England will appoint a new national selector, as well as a new captain, which Edwards said will be in place for the series against West Indies in May.Knight's vice-captain Nat Sciver-Brunt has previously said she would be interested in the job, while off-spinner Charlie Dean admitted she would not turn it down if approached.Edwards, who captained England on more than 200 occasions, said she is looking for \"someone who leads from the front in everything they do, someone who has the respect of the current playing group\". Edwards also said England will have one captain, rather than splitting the role across formats.Edwards has been appointed after a review into the Ashes led by England director of women's cricket Clare Connor and performance director Jonathan Finch.Connor, herself an Ashes-winning England captain, confirmed Edwards was given the job without a formal process.In 2018, the England and Wales Cricket Board pledged to adopt the Rooney Rule - interviewing at least one applicant from black, Asian or minority ethic backgrounds for all coaching roles in its national teams. It was not used for the appointment of Edwards.\"In these particular circumstances, with the criteria in front of me, I did not believe an open recruitment process was needed or would have benefited anyone,\" said Connor.\"I was very, very clear there was one person in the world of coaching who could have filled this role. Charlotte Edwards is the only person on the planet that can tick every box to the degree that she can.\"Connor also opted against bringing in internal or independent leadership for the review. When asked if that was tantamount to Connor and Finch \"marking their own homework\", Connor said: \"I understand that perspective.\"I'm accountable to the board for England women's cricket. I'm very confident in the steps we are taking and the way we are setting the team up for success. That is the job I'm paid to do.\"I'm under no illusion the buck does stop with me and I'm accountable for the England women's cricket team and how we perform.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfb0/live/27062ee0-0fd6-11f0-94e9-65dc0da473ff.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eNew head coach Charlotte Edwards will make England players \u0026#34;accountable\u0026#34; for their fitness following criticism during a dismal winter.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eEngland were eliminated in the group stage at the T20 World Cup, then humiliated 16-0 in the Ashes in Australia.\u003c/p\u003e\u003cp\u003eHead coach Jon Lewis and captain Heather Knight were both sacked last month, with legendary former skipper Edwards confirmed as Lewis\u0026#39; replacement on Tuesday.\u003c/p\u003e\u003cp\u003e\u0026#34;There is fitness testing next week and I\u0026#39;ll judge for myself where they are at,\u0026#34; Edwards told BBC Sport. \u0026#34;I don\u0026#39;t want people talking about the fitness of the England women\u0026#39;s cricket team. Fitness is a non-negotiable. We should be fit.\u0026#34;\u003c/p\u003e\u003cp\u003eAfter England\u0026#39;s early exit from the T20 World Cup in October, former spinner Alex Hartley said some players were \u0026#34;letting the team down\u0026#34; in terms of fitness.\u003c/p\u003e\u003cp\u003eAthleticism again came into focus during the Ashes clean sweep, but Lewis attributed that to a cultural difference between the UK and Australia.\u003c/p\u003e\u003cp\u003eThe Lewis regime was also characterised by a more relaxed approach. During the World Cup, some England players attended boat parties in Dubai.\u003c/p\u003e\u003cp\u003e\u0026#34;Honesty and hard work are key to any culture,\u0026#34; said Edwards, England\u0026#39;s all-time leading run-scorer.\u003c/p\u003e\u003cp\u003e\u0026#34;If we\u0026#39;ve got that in place we will move pretty quickly in the right direction. We\u0026#39;ve got to work hard. That\u0026#39;s for me to implement in training. We will talk to our science and medicine teams in terms of what we have to do with our fitness standards.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEdwards won the Ashes and both World Cups as England captain only to be sacked in 2016 and replaced by Knight.\u003c/p\u003e\u003cp\u003eNow Knight has been sacked but has indicated her desire to continue as a player. Edwards, 45, said she was not consulted in the decision to remove Knight.\u003c/p\u003e\u003cp\u003e\u0026#34;She sets such high standards, she\u0026#39;s the ultimate professional and what we need around the England team right now,\u0026#34; said Edwards. \u003c/p\u003e\u003cp\u003e\u0026#34;She\u0026#39;s playing as well as I\u0026#39;ve ever seen her play. It was hard to watch the Ashes, because of the toll it was taking on her. Without the captaincy, hopefully she\u0026#39;ll be able to go on to bigger and better things as a player.\u0026#34;\u003c/p\u003e\u003cp\u003eIn order to take the England job, Edwards has left all of her roles in domestic cricket, including her post as Mumbai Indians head coach in the Women\u0026#39;s Premier League. While he was England coach, Lewis was in charge of UP Warriorz in the same competition.\u003c/p\u003e\u003cp\u003eEngland will appoint a new national selector, as well as a new captain, which Edwards said will be in place for the series against West Indies in May.\u003c/p\u003e\u003cp\u003eKnight\u0026#39;s vice-captain Nat Sciver-Brunt has previously said she would be interested in the job, while off-spinner Charlie Dean admitted she would not turn it down if approached.\u003c/p\u003e\u003cp\u003eEdwards, who captained England on more than 200 occasions, said she is looking for \u0026#34;someone who leads from the front in everything they do, someone who has the respect of the current playing group\u0026#34;. Edwards also said England will have one captain, rather than splitting the role across formats.\u003c/p\u003e\u003cp\u003eEdwards has been appointed after a review into the Ashes led by England director of women\u0026#39;s cricket Clare Connor and performance director Jonathan Finch.\u003c/p\u003e\u003cp\u003eConnor, herself an Ashes-winning England captain, confirmed Edwards was given the job without a formal process.\u003c/p\u003e\u003cp\u003eIn 2018, the England and Wales Cricket Board pledged to adopt the Rooney Rule - interviewing at least one applicant from black, Asian or minority ethic backgrounds for all coaching roles in its national teams. It was not used for the appointment of Edwards.\u003c/p\u003e\u003cp\u003e\u0026#34;In these particular circumstances, with the criteria in front of me, I did not believe an open recruitment process was needed or would have benefited anyone,\u0026#34; said Connor.\u003c/p\u003e\u003cp\u003e\u0026#34;I was very, very clear there was one person in the world of coaching who could have filled this role. Charlotte Edwards is the only person on the planet that can tick every box to the degree that she can.\u0026#34;\u003c/p\u003e\u003cp\u003eConnor also opted against bringing in internal or independent leadership for the review. When asked if that was tantamount to Connor and Finch \u0026#34;marking their own homework\u0026#34;, Connor said: \u0026#34;I understand that perspective.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m accountable to the board for England women\u0026#39;s cricket. I\u0026#39;m very confident in the steps we are taking and the way we are setting the team up for success. That is the job I\u0026#39;m paid to do.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m under no illusion the buck does stop with me and I\u0026#39;m accountable for the England women\u0026#39;s cricket team and how we perform.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-02T17:29:49.365Z",
  "modifiedTime": null
}
