{
  "id": "53b7f6fa-9e8e-43de-b0f9-73051648ae6f",
  "title": "Lauren Filer adds nuance to the menace to show she can be England's trump card",
  "link": "https://www.wisden.com/series/south-africa-vs-england-w-2024/cricket-news/lauren-filer-adds-nuance-to-the-menace-to-show-she-can-be-englands-trump-card",
  "description": "Lauren Filer found the pace and bounce her much anticipated return to the Test format promised to leave South Africa blasted out for a big first innings deficit on day two in Bloemfontein.",
  "author": "Katya Witney",
  "published": "Mon, 16 Dec 2024 17:46:00 +0000",
  "source": "https://www.wisden.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Katya Witney",
  "length": 3972,
  "excerpt": "Lauren Filer found the pace and bounce her much anticipated return to the Test format promised to leave South Africa blasted out for a big first innings deficit on day two in Bloemfontein.",
  "siteName": "Wisden",
  "favicon": "https://www.wisden.com/static-assets/favicons/apple-touch-icon.png?v=23.07",
  "text": "The passage of play which separated Filer from every other England bowler was the largely one-sided battle that led up to Annerie Dercksen’s dismissal in the morning session. Troubled by Lauren Bell with a new ball early in her innings, she quickly found her feet against the lesser threat of Nat Sciver-Brunt, driving her for two fours in the space of two balls before picking up another boundary off the England vice-captain’s next over. As Dercksen found her feet, no matter how hard she flashed at what England threw at her, or how many times a thick edge went behind square for runs rather than catches, that breakthrough was still elusive. Her partnership with Laura Wolvaardt soon stretched well past 50 and, with plenty still to come, there was danger to the quick runs Dercksen was putting on as Wolvaardt blocked away at the other end. In the 32nd over of the innings, Filer was brought back on for another short burst, having hit Derckson in the head earlier in the day. There was no speed gun available for this Test, but to the eye Filer looked quick, and was probably pushing into the mid 70mphs. Three balls into her next spell, and a heavy bouncer cramped Derckson as she attempted to duck out of the way, but she couldn’t resist her hands trying to flick the ball into the leg side. As the ball fell towards long leg, Bell shelled a catch diving forward. In her next over, Filer pushed her length fuller and drew Dercksen into playing at a ball she was millimeters away from nicking to Amy Jones. The fifth ball that Filer bowled to Dercksen after that near-miss brought the breakthrough. Another heavy ball into the pitch, Dercksen unable to resist trying to cut it away and getting a top edge to the slips for Sophie Ecclestone to take a rebounded catch. There’s mitigation for Dercksen, who’s playing her second Test match after breaking into the South Africa side this year, with no other red-ball experience and moved up from No.8 to No.3 from her last red-ball outing. Being ruffled by the pace and lengths Filer was bowling fits the script. However, she evidenced perfectly the different game South Africa were faced with during each Filer burst. — Wisden (@WisdenCricket) December 15, 2024 Wolvaardt, Chloe Tryon and Sinalo Jafta were all troubled by not only the bouncers Filer banged into the pitch well into the evening session, but the way she mixed up her lengths with more control than previously shown and the movement she was able to get off the surface. Adjusting from short-pitched stuff after Tea, Filer got Luus nicking off on the drive with good movement off the seam of the new ball, having persisted amidst the boundaries South Africa found off her when she pushed her length up, throwing the odd short ball in. Following on from her first two Test appearances, when she burst onto the scene by shocking Australia in 2023 before struggling in India late last year, Filer’s growth in a short space of time has been evident across this South Africa tour. In the two ODIs she played, particularly the second in Durban, the increase in movement which she was able to get on the ball compared to her earlier outings was just as notable as the increased control she had in the Test format. When she wasn’t included in England’s T20 World Cup squad two months ago, Jon Lewis stressed that she was “unlucky” to miss out, and Filer’s next steps were to work on both her skills at the back-end of white-ball innings’ and the movement she could generate both through the air and off the pitch. Of all the pacers England have tried over the last two years, Filer has been the one to find that consistency and make the next step up to become a bowler it’s getting increasingly hard for them to leave out in any format. Follow Wisden for all cricket updates, including live scores, match stats, quizzes and more. Stay up to date with the latest cricket news, player updates, team standings, match highlights, video analysis and live match odds.",
  "image": "https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e \u003cfigure\u003e\u003cimg src=\"https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=1200\" width=\"1200px\" height=\"675px\" sizes=\"(min-width: 1200px) 1200px\" data-src=\"https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=1200\" data-srcset=\"https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=300 300w, https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=500 500w, https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=750 750w, https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=1200 1200w, https://www.wisden.com/static-assets/waf-images/e1/24/18/16-9/mf0ZzUXgzy.jpg?v=23.07\u0026amp;w=1920 1920w\" alt=\"Lauren Filer celebrates after getting Sune Luus out in South Africa\" importance=\"low\"/\u003e \u003c/figure\u003e\u003c/div\u003e   \u003cp\u003eThe passage of play which separated Filer from every other England bowler was the largely one-sided battle that led up to \u003ca href=\"https://www.wisden.com/players/annerie-dercksen-82713/cricket-news\"\u003eAnnerie Dercksen’s\u003c/a\u003e dismissal in the morning session. Troubled by Lauren Bell with a new ball early in her innings, she quickly found her feet against the lesser threat of Nat Sciver-Brunt, driving her for two fours in the space of two balls before picking up another boundary off the England vice-captain’s next over.\u003c/p\u003e \u003cp\u003eAs Dercksen found her feet, no matter how hard she flashed at what England threw at her, or how many times a thick edge went behind square for runs rather than catches, that breakthrough was still elusive. Her partnership with \u003ca href=\"https://www.wisden.com/players/laura-wolvaardt-66176\"\u003eLaura Wolvaardt\u003c/a\u003e soon stretched well past 50 and, with plenty still to come, there was danger to the quick runs Dercksen was putting on as Wolvaardt blocked away at the other end.\u003c/p\u003e \u003cp\u003eIn the 32nd over of the innings, Filer was brought back on for another short burst, having hit Derckson in the head earlier in the day. There was no speed gun available for this Test, but to the eye Filer looked quick, and was probably pushing into the mid 70mphs. Three balls into her next spell, and a heavy bouncer cramped Derckson as she attempted to duck out of the way, but she couldn’t resist her hands trying to flick the ball into the leg side. As the ball fell towards long leg, Bell shelled a catch diving forward. In her next over, Filer pushed her length fuller and drew Dercksen into playing at a ball she was millimeters away from nicking to Amy Jones. The fifth ball that Filer bowled to Dercksen after that near-miss brought the breakthrough. Another heavy ball into the pitch, Dercksen unable to resist trying to cut it away and getting a top edge to the slips for \u003ca href=\"https://www.wisden.com/players/sophie-ecclestone-66391\"\u003eSophie Ecclestone\u003c/a\u003e to take a rebounded catch.\u003c/p\u003e \u003cp\u003eThere’s mitigation for Dercksen, who’s playing her second Test match after breaking into the South Africa side this year, with no other red-ball experience and moved up from No.8 to No.3 from her last red-ball outing. Being ruffled by the pace and lengths Filer was bowling fits the script. However, she evidenced perfectly the different game South Africa were faced with during each Filer burst.\u003c/p\u003e \u003cblockquote\u003e\n— Wisden (@WisdenCricket) \u003ca href=\"https://twitter.com/WisdenCricket/status/1868298509100687544?ref_src=twsrc%5Etfw\"\u003eDecember 15, 2024\u003c/a\u003e\u003c/blockquote\u003e  \u003cp\u003eWolvaardt, Chloe Tryon and \u003ca href=\"https://www.wisden.com/players/sinalo-jafta-66614\"\u003eSinalo Jafta\u003c/a\u003e were all troubled by not only the bouncers Filer banged into the pitch well into the evening session, but the way she mixed up her lengths with more control than previously shown and the movement she was able to get off the surface. Adjusting from short-pitched stuff after Tea, Filer got Luus nicking off on the drive with good movement off the seam of the new ball, having persisted amidst the boundaries South Africa found off her when she pushed her length up, throwing the odd short ball in.\u003c/p\u003e \u003cp\u003eFollowing on from her first two Test appearances, when she burst onto the scene by shocking Australia in 2023 before struggling in India late last year, Filer’s growth in a short space of time has been evident across this South Africa tour. In the two ODIs she played, particularly the second in Durban, the increase in movement which she was able to get on the ball compared to her earlier outings was just as notable as the increased control she had in the Test format.\u003c/p\u003e \u003cp\u003eWhen she wasn’t included in England’s T20 World Cup squad two months ago, \u003ca href=\"https://www.wisden.com/series/icc-womens-t20-world-cup-2024/cricket-news/englands-spin-gamble-must-pay-off-to-justify-lack-of-pace-in-t20-world-cup-squad\"\u003eJon Lewis stressed that she was “unlucky” to miss out\u003c/a\u003e, and Filer’s next steps were to work on both her skills at the back-end of white-ball innings’ and the movement she could generate both through the air and off the pitch. Of all the pacers England have tried over the last two years, Filer has been the one to find that consistency and make the next step up to become a bowler it’s getting increasingly hard for them to leave out in any format.\u003c/p\u003e \u003cp\u003e\u003cstrong data-stringify-type=\"bold\"\u003eFollow Wisden for all cricket updates, including \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/live-cricket-scores\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/live-cricket-scores\" data-sk=\"tooltip_parent\"\u003elive scores\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e, match stats, \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/quizzes/daily-quiz\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/quizzes/daily-quiz\" data-sk=\"tooltip_parent\"\u003equizzes\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e and more. Stay up to date with the \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/cricket-news\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/cricket-news\" data-sk=\"tooltip_parent\"\u003elatest cricket news\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e, player updates, team \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/series/icc-mens-t20-world-cup-2024/points-table-standings\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/series/icc-mens-t20-world-cup-2024/points-table-standings\" data-sk=\"tooltip_parent\"\u003estandings,\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e match highlights, \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.youtube.com/@WisdenCricket\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.youtube.com/@WisdenCricket\" data-sk=\"tooltip_parent\"\u003evideo analysis\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e and \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/cricket-betting?utm_source=outro\u0026amp;utm_medium=interlink\u0026amp;utm_campaign=cricketbet_hub\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/cricket-betting?utm_source=outro\u0026amp;utm_medium=interlink\u0026amp;utm_campaign=cricketbet_hub\" data-sk=\"tooltip_parent\"\u003elive match odds\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e     \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-16T17:46:00Z",
  "modifiedTime": "2024-12-16T18:37:01Z"
}
