{
  "id": "5b4458a3-0ba2-439e-abde-54e8a872cc16",
  "title": "Hina Munawar Appointed 1st Female Manager For Pakistan Men's Cricket Team",
  "link": "https://sports.ndtv.com/cricket/hina-munawar-appointed-first-female-manager-for-pakistan-mens-cricket-team-7613200",
  "description": "Hina Munawar, a police officer with a strong background in security and operations, has been named as the first female team manager for the Pakistan men's cricket team ahead of the Champions Trophy.",
  "author": "",
  "published": "Sat, 01 Feb 2025 23:03:01 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 1907,
  "excerpt": "Hina Munawar, a police officer with a strong background in security and operations, has been named as the first female team manager for the Pakistan men's cricket team ahead of the Champions Trophy.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "File photo of Hina Munawar.© X/@CricJerry Hina Munawar, a police officer with a strong background in security and operations, has been named as the first female team manager for the Pakistan men's cricket team ahead of the Champions Trophy. Munawar, who has served in the Frontier Constabulary in the high-risk Swat area, has been appointed as the Operations Manager for Pakistan's Tri-Nation series and the Champions Trophy which begins on February 19 in Karachi. While senior retired bureaucrat Naveed Akram Cheema will continue as team manager, Munawar's appointment has sparked curiosity among cricket fans, experts, and media. After passing the Civil Superior Services exam, Munawar transitioned into various law enforcement and security roles.\"Perhaps her appointment is aimed at streamlining operations within the team and between players and the board, as she has worked in strategic and leadership roles, helping to streamline various operations,\" said a source close to the Pakistan Cricket Board (PCB).Munawar, who joined the PCB last year, was also appointed manager of the Pakistan women's under-19 team for the Asia Cup.\"She made history as the first female district officer in the Frontier Constabulary in Swat, breaking gender barriers in a traditionally male-dominated field,\" the source added.It is understood that PCB Chairman Mohsin Naqvi brought Munawar into the board on deputation, as she remains part of the Police Service of Pakistan.The PCB aims to streamline team management and create a more organized and efficient environment, with her appointment bringing fresh perspectives to the traditionally coaching-focused and male-dominated setup.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2025-02/nluiad8o_hina-munawar-x-cricjerry_625x300_01_February_25.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2025-02/nluiad8o_hina-munawar-x-cricjerry_625x300_01_February_25.jpg?im=FitAndFill,algorithm=dnn,width=806,height=605\" title=\"Hina Munawar Appointed First Female Manager For Pakistan Men\u0026#39;s Cricket Team\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eFile photo of Hina Munawar.\u003cspan\u003e© X/@CricJerry\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eHina Munawar, a police officer with a strong background in security and operations, has been named as the first female team manager for the Pakistan men\u0026#39;s cricket team ahead of the Champions Trophy. Munawar, who has served in the Frontier Constabulary in the high-risk Swat area, has been appointed as the Operations Manager for Pakistan\u0026#39;s Tri-Nation series and the Champions Trophy which begins on February 19 in Karachi. While senior retired bureaucrat Naveed Akram Cheema will continue as team manager, Munawar\u0026#39;s appointment has sparked curiosity among cricket fans, experts, and media.\u003c/p\u003e\n\n\u003cp\u003eAfter passing the Civil Superior Services exam, Munawar transitioned into various law enforcement and security roles.\u003c/p\u003e\u003cp\u003e\u0026#34;Perhaps her appointment is aimed at streamlining operations within the team and between players and the board, as she has worked in strategic and leadership roles, helping to streamline various operations,\u0026#34; said a source close to the Pakistan Cricket Board (PCB).\u003c/p\u003e\u003cp\u003eMunawar, who joined the PCB last year, was also appointed manager of the Pakistan women\u0026#39;s under-19 team for the Asia Cup.\u003c/p\u003e\u003cp\u003e\u0026#34;She made history as the first female district officer in the Frontier Constabulary in Swat, breaking gender barriers in a traditionally male-dominated field,\u0026#34; the source added.\u003c/p\u003e\u003cp\u003eIt is understood that PCB Chairman Mohsin Naqvi brought Munawar into the board on deputation, as she remains part of the Police Service of Pakistan.\u003c/p\u003e\u003cp\u003eThe PCB aims to streamline team management and create a more organized and efficient environment, with her appointment bringing fresh perspectives to the traditionally coaching-focused and male-dominated setup.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-01T23:03:01+05:30",
  "modifiedTime": null
}
