{
  "id": "a984341a-82d3-4d3f-9f9e-0f20a4142b0d",
  "title": "Ex-India Star Points Out 'Real Problem' In Rohit's Batting: \"Not Trusting...\"",
  "link": "https://sports.ndtv.com/cricket/ex-india-star-points-out-real-problem-in-rohit-sharmas-batting-not-trusting-6939598",
  "description": "It has been a tough year for Rohit Sharma when it comes to Test cricket.",
  "author": "",
  "published": "Wed, 06 Nov 2024 22:44:33 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "",
  "length": 2710,
  "excerpt": "It has been a tough year for Rohit Sharma when it comes to Test cricket.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "Indian cricket team captain Rohit Sharma© AFP It has been a tough year for Rohit Sharma when it comes to Test cricket. The Indian cricket team skipper once again failed to impress as his side slumped to a humiliating 0-3 Test series defeat in Mumbai on Sunday. Rohit scored 18 off 18 balls in the first innings before he was dismissed by Matt Henry while his stay at the crease ended in 11 balls during the second innings. The star batter has struggled massively to score runs in red-ball cricket and former Indian cricket team star Sanjay Manjrekar pointed out the 'real problem'. In an interaction with ESPNCricinfo, Manjrekar dissected Rohit's batting and said that instead of making the proper connection, he has been trying to clear the boundary with pure strength. \"I will never say that he is reckless because he is finding his own way to ensure that he gets runs, to get the team to win. He clearly doesn't trust his defence anymore, you could see that, there was a LBW appeal and that must have just made him feel unsettled ever more. So the next thing that he looks to do is counter-attack and he did that because the target wasn't a huge one, and who knows a couple of shots here and there and he would have maybe replicated that Bangladesh run chase,\" he said.\"But the shot that he played to get out was where he was trying to hit the ball into the stands rather than just make the connection. He is missing a few of his big hits. There was one in the first Test match as well, where he stepped out and tried to hit the ball out of the ground, so he is mis-hitting a lot of his attacking shots and he is not trusting his defence enough. So that is a real problem for Rohit Sharma currently,\" he added.Rohit had a disappointing series against New Zealand in the Tests. He scored 91 runs at a strike rate of 68.42 after playing all three matches of the Test series against the Kiwis.Following the 3-0 series loss against New Zealand, Rohit became the first India captain to concede a 3-0 Test series defeat on home soil. Meanwhile, Tom Latham's New Zealand showcased a stupendous performance in the Tests against India and became the first team to win a long format series by 0-3 in India.Rohit Sharma has led Team India in 21 matches in Test cricket and won 12 games. Meanwhile, he lost seven matches.(With ANI inputs) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2024-11/cvs5nlvg_xa_625x300_04_November_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                            \u003cp\u003e\u003cimg width=\"330\" height=\"246\" src=\"https://c.ndtvimg.com/2024-11/cvs5nlvg_xa_625x300_04_November_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"Ex-India Star Points Out \u0026#39;Real Problem\u0026#39; In Rohit Sharma\u0026#39;s Batting: \u0026#34;Not Trusting...\u0026#34;\"/\u003e\n                                                            \u003c/p\u003e\n                                                            \u003cp\u003eIndian cricket team captain Rohit Sharma\u003cspan\u003e© AFP\u003c/span\u003e\u003c/p\u003e\n                                \u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n                                        \n                                                \u003cp\u003eIt has been a tough year for \u003ca href=\"https://sports.ndtv.com/cricket/players/857-rohit-sharma-playerprofile\" title=\"Rohit Sharma\"\u003eRohit Sharma\u003c/a\u003e when it comes to Test cricket. The Indian cricket team skipper once again failed to impress as his side slumped to a humiliating 0-3 Test series defeat in Mumbai on Sunday. Rohit scored 18 off 18 balls in the first innings before he was dismissed by \u003ca href=\"https://sports.ndtv.com/cricket/players/61011-matthew-james-henry-playerprofile\" title=\"Matt Henry\"\u003eMatt Henry\u003c/a\u003e while his stay at the crease ended in 11 balls during the second innings. The star batter has struggled massively to score runs in red-ball cricket and former Indian cricket team star \u003ca href=\"https://sports.ndtv.com/cricket/players/41124-sanjay-vijay-manjrekar-playerprofile\" title=\"Sanjay Manjrekar\"\u003eSanjay Manjrekar\u003c/a\u003e pointed out the \u0026#39;real problem\u0026#39;. In an interaction with \u003ca href=\"https://www.espncricinfo.com/cricket-videos/manjrekar-first-six-wickets-were-painful-to-watch-1458256\"\u003eESPNCricinfo\u003c/a\u003e, Manjrekar dissected Rohit\u0026#39;s batting and said that instead of making the proper connection, he has been trying to clear the boundary with pure strength.\u003c/p\u003e\n\n\u003cp\u003e\u0026#34;I will never say that he is reckless because he is finding his own way to ensure that he gets runs, to get the team to win. He clearly doesn\u0026#39;t trust his defence anymore, you could see that, there was a LBW appeal and that must have just made him feel unsettled ever more. So the next thing that he looks to do is counter-attack and he did that because the target wasn\u0026#39;t a huge one, and who knows a couple of shots here and there and he would have maybe replicated that Bangladesh run chase,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;But the shot that he played to get out was where he was trying to hit the ball into the stands rather than just make the connection. He is missing a few of his big hits. There was one in the first Test match as well, where he stepped out and tried to hit the ball out of the ground, so he is mis-hitting a lot of his attacking shots and he is not trusting his defence enough. So that is a real problem for Rohit Sharma currently,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eRohit had a disappointing series against New Zealand in the Tests. He scored 91 runs at a strike rate of 68.42 after playing all three matches of the Test series against the Kiwis.\u003c/p\u003e\u003cp\u003eFollowing the 3-0 series loss against New Zealand, Rohit became the first India captain to concede a 3-0 Test series defeat on home soil. Meanwhile, \u003ca href=\"https://sports.ndtv.com/cricket/players/1439-tom-latham-playerprofile\" title=\"Tom Latham\"\u003eTom Latham\u003c/a\u003e\u0026#39;s New Zealand showcased a stupendous performance in the Tests against India and became the first team to win a long format series by 0-3 in India.\u003c/p\u003e\u003cp\u003eRohit Sharma has led Team India in 21 matches in Test cricket and won 12 games. Meanwhile, he lost seven matches.\u003c/p\u003e\u003cp\u003e(With ANI inputs)\u003c/p\u003e\n\n                                            \n                                            \n                                        \n                                            \u003cdiv\u003e\n                                                \u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n                                                \n                                            \u003c/div\u003e\n                                        \n\n                                        \n                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-06T22:44:33+05:30",
  "modifiedTime": null
}
