{
  "id": "bc6c5968-4485-41de-8a73-4fccf524059e",
  "title": "Wounded RCB look to keep MI from top-of-the-table finish",
  "link": "https://www.espncricinfo.com/ci/content/story/1476652.html?ex_cid=OTC-RSS",
  "description": "MI are currently placed second and a win will get them a direct final berth",
  "author": "",
  "published": "Mon, 10 Mar 2025 19:35:51 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Sruthi Ravindranath",
  "length": 4055,
  "excerpt": "MI are currently placed second and a win will get them a direct final berth",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Who's playingMumbai Indians (MI) vs Royal Challengers Bengaluru (RCB) Brabourne Stadium, Mumbai, March 11, 2025What to expect: RCB look to end on highMumbai Indians almost secured a direct spot in the final on Monday. They needed to keep Gujarat Giants to 156 or fewer but a spirited Bharti Fulmali innings did not allow that. The chance was missed but they will not be worrying too much: they not only won the match against Gujarat Giants and kept their perfect record at the Brabourne Stadium intact but also have one more shot at finishing on top of the table. They are on par with table-toppers Delhi Capitals on points. The only point of concern, if at all any, would be that they will have to be back within 24 hours to achieve that.Though the move to make Amelia Kerr open hasn't made much of a difference with the allrounder falling cheaply in both games, MI will be happy Nat Sciver-Brunt did not have to do the heavy lifting once again. Captain Harmanpreet Kaur made a fifty and there were handy contributions from the middle order. Their bowlers were excellent up front and even though they lost the plot in the second half of the chase, they kept their cool to defend 179 on a batting-friendly surface.RCB meanwhile will rue what could have been. The defending champions were unlucky with the toss in all four games at the M Chinnaswamy Stadium which meant they had to do the difficult task of batting first on a ground where seven out of eight matches were won by the chasing team. They still had a tiny chance of making the playoffs which they let go of in a high-scoring thriller against UP Warriorz and are now coming into this contest on the back of five consecutive losses.RCB also had similar issues from start to finish, including playing this season with a weakened bowling attack and depending on a couple of players to shoulder the bulk of the responsibility. In their previous match, it was the out-of-contention Warriorz who took RCB down with them, and now RCB will look to ruin MI's chances of wanting to finish on top.Form GuideMI WWLWW (last five matches, most recent first) RCB LLLLLTeam newsMI are unlikely to change their winning combination.Mumbai Indians (probable XI): 1 Hayley Matthews, 2 Amelia Kerr, 3 Nat Sciver-Brunt, 4 Harmanpreet Kaur (capt), 5 Amanjot Kaur, 6 Yastika Bhatia (wk), 7 G Kamalini, 8 S Sajana, 9 Sanskriti Gupta, 10 Shabnim Ismail, 11 Parunika SisodiaRCB made two changes for the previous match, bringing in Charlie Dean for Danni Wyatt-Hodge and opener S Meghana for left-arm spinner Ekta Bisht. While Dean had a tough outing, conceding 47 in her four overs of offspin, Meghana got off to a rapid start.Royal Challengers Bengaluru (probable XI): 1 Smriti Mandhana (capt), 2 S Meghana, 3 Ellyse Perry, 4 Raghvi Bisht, 5 Richa Ghosh (wk), 6 Kanika Ahuja, 7 Georgia Wareham, 8 Sneh Rana, 9 Charlie Dean, 10 Kim Garth, 11 Renuka SinghPlayers to watch: Harmanpreet Kaur and Sneh RanaHarmanpreet Kaur returning to form is great news for MI. Coming into the game against Giants with scores of 4, 22 and 4*, she scored a crucial 54 to power her side to 179. She has three fifties in four innings at the Brabourne Stadium in WPL and will want to make the most of the home advantage to secure a second title for her team.Performances like the one she put up against UP Warriorz make one wonder why Sneh Rana isn't in the T20 scheme of things for India. Rana plundered Deepti Sharma for 25 off five balls, giving RCB a strong chance to hunt down 226 but she ran out of partners at the other end with three balls left in the chase. In her first game for RCB this WPL, Rana returned with 3 for 27 but she has been underutilised with the ball in this edition. She has bowled her full quota only once in the four games. Rana last played a T20I for India in 2023.Stats that matterThis is the second time in the WPL that RCB have lost five matches in a row, the last time being in the 2023 seasonNat Sciver-Brunt and Amelia Kerr, both from MI, occupy the top of the run-getters and wicket-takers charts respectively",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/396900/396976.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eWho\u0026#39;s playing\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cb\u003eMumbai Indians (MI) vs Royal Challengers Bengaluru (RCB)\u003c/b\u003e\u003cbr/\u003e\nBrabourne Stadium, Mumbai, March 11, 2025\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eWhat to expect: RCB look to end on high\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMumbai Indians almost secured a direct spot in the final \u003ca href=\"https://www.espncricinfo.com/series/wpl-2024-25-1463356/gujarat-giants-women-vs-mumbai-indians-women-19th-match-1469316/full-scorecard\"\u003eon Monday\u003c/a\u003e. They needed to keep Gujarat Giants to 156 or fewer but a spirited Bharti Fulmali innings did not allow that. The chance was missed but they will not be worrying too much: they not only won the match against Gujarat Giants and kept their perfect record at the Brabourne Stadium intact but also have one more shot at finishing on top of the table. They are on par with table-toppers Delhi Capitals on points. The only point of concern, if at all any, would be that they will have to be back within 24 hours to achieve that.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThough the move to make Amelia Kerr open hasn\u0026#39;t made much of a difference with the allrounder falling cheaply in both games, MI will be happy Nat Sciver-Brunt did not have to do the heavy lifting once again. Captain Harmanpreet Kaur made a fifty and there were handy contributions from the middle order. Their bowlers were excellent up front and even though they lost the plot in the second half of the chase, they kept their cool to defend 179 on a batting-friendly surface.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eRCB meanwhile will rue what could have been. The defending champions were unlucky with the toss in all four games at the M Chinnaswamy Stadium which meant they had to do the difficult task of batting first on a ground where seven out of eight matches were won by the chasing team. They still had a tiny chance of making the playoffs which they let go of in a \u003ca href=\"https://www.espncricinfo.com/series/wpl-2024-25-1463356/royal-challengers-bengaluru-women-vs-up-warriorz-women-18th-match-1469315/full-scorecard\"\u003ehigh-scoring thriller against UP Warriorz\u003c/a\u003e and are now coming into this contest on the back of five consecutive losses.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRCB also had similar issues from start to finish, including playing this season with a weakened bowling attack and depending on a couple of players to shoulder the bulk of the responsibility. In their previous match, it was the out-of-contention Warriorz who took RCB down with them, and now RCB will look to ruin MI\u0026#39;s chances of wanting to finish on top.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eForm Guide\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cb\u003eMI\u003c/b\u003e WWLWW (last five matches, most recent first)\u003cbr/\u003e\n\u003cb\u003eRCB\u003c/b\u003e LLLLL\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eTeam news\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMI are unlikely to change their winning combination.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cb\u003eMumbai Indians (probable XI)\u003c/b\u003e: 1 Hayley Matthews, 2 Amelia Kerr, 3 Nat Sciver-Brunt, 4 Harmanpreet Kaur (capt), 5 Amanjot Kaur, 6 Yastika Bhatia (wk), 7 G Kamalini, 8 S Sajana, 9 Sanskriti Gupta, 10 Shabnim Ismail, 11 Parunika Sisodia\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRCB made two changes for the previous match, bringing in Charlie Dean for Danni Wyatt-Hodge and opener S Meghana for left-arm spinner Ekta Bisht. While Dean had a tough outing, conceding 47 in her four overs of offspin, Meghana got off to a rapid start.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cb\u003eRoyal Challengers Bengaluru (probable XI)\u003c/b\u003e: 1 Smriti Mandhana (capt), 2 S Meghana, 3 Ellyse Perry, 4 Raghvi Bisht, 5 Richa Ghosh (wk), 6 Kanika Ahuja, 7 Georgia Wareham, 8 Sneh Rana, 9 Charlie Dean, 10 Kim Garth, 11 Renuka Singh\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003ePlayers to watch: Harmanpreet Kaur and Sneh Rana\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/harmanpreet-kaur-372317\"\u003eHarmanpreet Kaur\u003c/a\u003e returning to form is great news for MI. Coming into the game against Giants with scores of 4, 22 and 4*, she scored a crucial 54 to power her side to 179. She has three fifties in four innings at the Brabourne Stadium in WPL and will want to make the most of the home advantage to secure a second title for her team.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003ePerformances like the one she put up \u003ca href=\"https://www.espncricinfo.com/series/wpl-2024-25-1463356/royal-challengers-bengaluru-women-vs-up-warriorz-women-18th-match-1469315/full-scorecard\"\u003eagainst UP Warriorz\u003c/a\u003e make one wonder why \u003ca href=\"https://www.espncricinfo.com/cricketers/sneh-rana-556537\"\u003eSneh Rana\u003c/a\u003e isn\u0026#39;t in the T20 scheme of things for India. Rana plundered Deepti Sharma for 25 off five balls, giving RCB a strong chance to hunt down 226 but she ran out of partners at the other end with three balls left in the chase. In her first game for RCB this WPL, Rana returned with 3 for 27 but she has been underutilised with the ball in this edition. She has bowled her full quota only once in the four games. Rana last played a T20I for India in 2023.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eStats that matter\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cli\u003eThis is the second time in the WPL that RCB have lost five matches in a row, the last time being in the 2023 season\u003c/li\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cli\u003eNat Sciver-Brunt and Amelia Kerr, both from MI, occupy the top of the \u003ca href=\"https://www.espncricinfo.com/records/tournament/batting-most-runs-career/women-s-premier-league-2024-25-16889\"\u003erun-getters\u003c/a\u003e and \u003ca href=\"https://www.espncricinfo.com/records/tournament/bowling-most-wickets-career/women-s-premier-league-2024-25-16889\"\u003ewicket-takers\u003c/a\u003e charts respectively\u003c/li\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-10T19:16:00Z",
  "modifiedTime": null
}
