{
  "id": "c3b14544-d7db-477b-9475-98bb76429c28",
  "title": "Phil Salt confirmed as wicketkeeper for West Indies T20Is",
  "link": "https://www.espncricinfo.com/ci/content/story/1458467.html?ex_cid=OTC-RSS",
  "description": "England opener hoping to build on ODI form after Antigua half-century",
  "author": "",
  "published": "Mon, 04 Nov 2024 20:57:51 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Cameron Ponsonby",
  "length": 4110,
  "excerpt": "England opener hoping to build on ODI form after Antigua half-century",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsEngland opener hoping to build on ODI form after Antigua half-centuryPhil Salt will take the wicketkeeper's gloves from Jos Buttler in the T20Is against West Indies  •  Getty ImagesPhil Salt will keep wicket for England's T20I series against the West Indies, despite the return of Jos Buttler to the team.White-ball captain Buttler has kept in 106 of his past 108 T20 internationals, fielding only in the two matches that took place in Trinidad during England's previous tour of the Caribbean in December 2023.\"It's not something I've done a lot for England recently,\" Salt said in Barbados ahead of the third ODI. \"But I enjoy keeping. I feel like that's where I offer most to the side.\"Salt has kept in 13 of his 59 games for England across formats and has been given the gloves in this current ODI series ahead of Jordan Cox, who will fill in for Test keeper Jamie Smith for the upcoming series in New Zealand.Livingstone shows there's more to him than hitting sixesJohn Turner keen to prove he's the real dealLivingstone trumps Hope in battle of captain's hundredsButtler has been out for several months with a calf strain. Had he been fit to play the T20 series against Australia in September, Salt would have kept wicket with Buttler keen to experiment with captaining from different positions on the field.At the time, Buttler said: \"I was going to give up the gloves and commit to being at mid-off and see how that felt. If it will help me with my captaincy it is something I am open to.\"Buttler arrived in the Caribbean on Sunday and trained at Kensington Oval on Monday. He is not available for selection for the deciding ODI on Wednesday and will resume captaincy duties ahead of the five-match T20I series that starts on Saturday, making his first appearance since England's defeat in the T20 World Cup semi-final in June. Essex wicketkeeper-batter Michael Pepper, originally only selected for the ODI squad, has been added to the T20 squad and will remain with the group for the rest of the tour.Of whether his move to keep is a long-term decision, Salt said: \"We've not had that chat about anything going forward. I'm just glad to be doing it at the moment.\"Salt made scores of 18 and 59 in the first two ODIs, with his half-century helping to set up England's chase of 329 to tie the series in the second Antigua game.After England had been bowled out for 209 in the first match, captain Liam Livingstone had criticised the performance, saying that the team needed to \"bat smarter\".Whereas Salt has found his feet in T20 cricket, his ODI returns haven't been as consistent. In his last ten ODIs, he averages 24.30 with only one half-century. A habit of being dismissed in the powerplay limited his output - remarkably, his innings in Antigua on Saturday was the first time he had batted past the tenth over since June 2022.\"When anybody's at their best they're aggressive and smart,\" he said. \"They go hand in hand - they have to if you're going to have any success in white-ball cricket.\"I know I could have got more runs. I think for myself it's how do I drop the strike rate and pump the average… prolonging my innings and extending partnerships. Those are two of the most important things in 50-over cricket.\"The ODI series against Australia in September was Salt's first experience of 50-over cricket since the tour of the Caribbean in December last year. With the Hundred being played at the same time as the One-Day Cup during the English summer, many of England's new white-ball generation have little List A experience, with Salt explaining the difficulty of re-adapting to the tempo required.\"I don't think there's many players in this team that you could go through and go 'oh they're doing a great job right now'. That's the reality of it because we've not played a lot of 50-over cricket.\"I'd love something like a domestic 50-over competition. I'd love the opportunity to play in that so you can get the rhythm and it's not always stop-start. But that's what we've got. As a player you've got to adapt.\"Cameron Ponsonby is a freelance cricket writer in London. @cameronponsonby",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/383600/383620.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle data-id=\"1458467\" data-src=\"/story/phil-salt-confirmed-england-wicketkeeper-west-indies-t20is-1458467\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eEngland opener hoping to build on ODI form after Antigua half-century\u003c/p\u003e\u003c/header\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/383600/383620.6.jpg\" alt=\"Phil Salt and Jos Buttler finished off the chase of 116 themselves, England vs USA, T20 World Cup 2024, Super Eight, Bridgetown, Barbados, June 23, 2024\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003ePhil Salt will take the wicketkeeper\u0026#39;s gloves from Jos Buttler in the T20Is against West Indies  •  \u003cspan\u003eGetty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/phil-salt-669365\"\u003ePhil Salt\u003c/a\u003e will keep wicket for England\u0026#39;s T20I series against the West Indies, despite the return of \u003ca href=\"https://www.espncricinfo.com/cricketers/jos-buttler-308967\"\u003eJos Buttler\u003c/a\u003e to the team.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWhite-ball captain Buttler has kept in 106 of his past 108 T20 internationals, fielding only in the two matches that took place in Trinidad during England\u0026#39;s previous tour of the Caribbean in December 2023.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s not something I\u0026#39;ve done a lot for England recently,\u0026#34; Salt said in Barbados ahead of the third ODI. \u0026#34;But I enjoy keeping. I feel like that\u0026#39;s where I offer most to the side.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSalt has kept in 13 of his 59 games for England across formats and has been given the gloves in this current ODI series ahead of Jordan Cox, who will fill in for Test keeper Jamie Smith for the upcoming series in New Zealand.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/wi-vs-eng-liam-livingstone-produces-remarkable-one-man-show-1458205\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eLivingstone shows there\u0026#39;s more to him than hitting sixes\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/wi-vs-eng-john-turner-keen-to-prove-he-s-the-real-deal-1458264\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eJohn Turner keen to prove he\u0026#39;s the real deal\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/west-indies-vs-england-2024-25-1433354/west-indies-vs-england-2nd-odi-1433371/match-report\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eLivingstone trumps Hope in battle of captain\u0026#39;s hundreds\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eButtler has been out for\u003ca href=\"https://www.espncricinfo.com/story/wi-vs-eng-jos-buttler-to-miss-odi-series-in-caribbean-after-setback-in-calf-injury-1456427\"\u003e several months with a calf strain\u003c/a\u003e. Had he been fit to play the T20 series against Australia in September, Salt would have kept wicket with Buttler keen to experiment with captaining from different positions on the field.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAt the time, Buttler said: \u0026#34;I was going to give up the gloves and commit to being at mid-off and see how that felt. If it will help me with my captaincy it is something I am open to.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eButtler arrived in the Caribbean on Sunday and trained at Kensington Oval on Monday. He is not available for selection for the deciding ODI on Wednesday and will resume captaincy duties ahead of the five-match T20I series that starts on Saturday, making his first appearance since England\u0026#39;s defeat in the T20 World Cup semi-final in June. Essex wicketkeeper-batter \u003ca href=\"https://www.espncricinfo.com/cricketers/michael-pepper-772293\"\u003eMichael Pepper\u003c/a\u003e, originally only selected for the ODI squad, has been added to the T20 squad and will remain with the group for the rest of the tour.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eOf whether his move to keep is a long-term decision, Salt said: \u0026#34;We\u0026#39;ve not had that chat about anything going forward. I\u0026#39;m just glad to be doing it at the moment.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSalt made scores of 18 and 59 in the first two ODIs, with his half-century helping to set up England\u0026#39;s chase of 329 to tie the series in the second Antigua game.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAfter England had been bowled out for 209 in the first match, captain Liam Livingstone \u003ca href=\"https://www.espncricinfo.com/story/wi-vs-eng-1st-odi-too-many-new-faces-not-a-good-thing-for-england-1457970\"\u003ehad criticised the performance\u003c/a\u003e, saying that the team needed to \u0026#34;bat smarter\u0026#34;.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eWhereas Salt has found his feet in T20 cricket, his ODI returns haven\u0026#39;t been as consistent. In his last ten ODIs, \u003ca href=\"https://stats.espncricinfo.com/ci/engine/player/669365.html?class=2;orderby=start;orderbyad=reverse;spanmin1=01+Dec+2023;spanval1=span;template=results;type=batting;view=innings\"\u003ehe averages 24.30 with only one half-century\u003c/a\u003e. A habit of being dismissed in the powerplay limited his output - remarkably, his innings in Antigua on Saturday was the first time he had batted past the tenth over since June 2022.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;When anybody\u0026#39;s at their best they\u0026#39;re aggressive and smart,\u0026#34; he said. \u0026#34;They go hand in hand - they have to if you\u0026#39;re going to have any success in white-ball cricket.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I know I could have got more runs. I think for myself it\u0026#39;s how do I drop the strike rate and pump the average… prolonging my innings and extending partnerships. Those are two of the most important things in 50-over cricket.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe ODI series against Australia in September was Salt\u0026#39;s first experience of 50-over cricket since the tour of the Caribbean in December last year. With the Hundred being played at the same time as the One-Day Cup during the English summer, many of England\u0026#39;s new white-ball generation have little List A experience, with Salt explaining the difficulty of re-adapting to the tempo required.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t think there\u0026#39;s many players in this team that you could go through and go \u0026#39;oh they\u0026#39;re doing a great job right now\u0026#39;. That\u0026#39;s the reality of it because we\u0026#39;ve not played a lot of 50-over cricket.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I\u0026#39;d love something like a domestic 50-over competition. I\u0026#39;d love the opportunity to play in that so you can get the rhythm and it\u0026#39;s not always stop-start. But that\u0026#39;s what we\u0026#39;ve got. As a player you\u0026#39;ve got to adapt.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eCameron Ponsonby is a freelance cricket writer in London. @cameronponsonby\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-04T20:46:00Z",
  "modifiedTime": null
}
