{
  "id": "f27b065b-406e-4752-89fb-38d0e86cee11",
  "title": "Stokes considered as England white-ball captain",
  "link": "https://www.bbc.com/sport/cricket/articles/cjw267p2v0xo",
  "description": "England would be \"stupid\" not to consider Ben Stokes as a white-ball captain, says director of men's cricket Rob Key.",
  "author": "",
  "published": "Thu, 06 Mar 2025 14:30:46 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Stephan Shemilt",
  "length": 4170,
  "excerpt": "England would be \"stupid\" not to consider Ben Stokes as a white-ball captain, says director of men's cricket Rob Key.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "England would be \"stupid\" not to consider Ben Stokes as a white-ball captain, says director of men's cricket Rob Key.England are looking for new leaders of the one-day and T20 sides after Jos Buttler resigned following their early exit at the Champions Trophy.Stokes, 33, has been Test captain since 2022 but has not played white-ball cricket for England since the 2023 50-over World Cup.\"Nothing is off the table,\" said Key. \"You look at every single option and think, 'What is the best thing to do?'\"Ben Stokes is one of the best captains I've ever seen. It would be stupid not to look at him. It's just the knock-on effect of what that means.\"All-rounder Stokes is currently recovering from a hamstring operation and has been training with a group of England Lions players in Abu Dhabi.Key said Stokes is \"flying\" and \"on track to start the summer in a full role, bowling and batting\".On Saturday, in the aftermath of England's defeat against South Africa in their final match at the Champions Trophy, head coach Brendon McCullum did not rule out having different captains in each of the three formats.On Thursday at Lord's, Key said England will not rush the decision and have \"plenty of options\", but he sees a greater alignment between Test and 50-over cricket, when compared to the T20 format.It could be a possibility that Stokes combines the 50-over leadership with the Test side, working alongside a different T20 captain.\"I believe that Test cricket and 50-over cricket are probably closer than T20s, which is the outlier now,\" said Key.Key also mentioned current white-ball vice-captain Harry Brook and limited-overs specialists Phil Salt and Liam Livingstone, who have both led England in the past year.If Stokes or Brook take a white-ball leadership role, their workload would come into consideration, particularly in a year when England face marquee Test series at home to India and away to Australia.A home white-ball series against West Indies begins only four days after a one-off Test against Zimbabwe in May, while the summer ends with limited-overs matches against South Africa and Ireland.England play a white-ball series in New Zealand prior to the Ashes, which is then followed by a T20 World Cup in India and Sri Lanka early next year. Stokes was man of the match when England won the 50-over World Cup in 2019 and played a major role when they were crowned T20 world champions in 2022.He retired from 50-over cricket in the summer of 2022 and reversed the decision to play in the 2023 World Cup.\"We've got to get the most out of our best players,\" said Key. \"We want them playing for England.\"That's important and that's going to take some work because you're also throwing franchise cricket into that.\"But I believe our players are committed to playing for England as much as they can.\"Key said he expects pace bowler Brydon Carse to be fit for the start of the summer after a foot injury cut short his Champions Trophy and ruled him out of the Indian Premier League.Mark Wood will see a specialist this week about a knee injury picked up at the Champions Trophy.England's performance in Pakistan was their third successive disappointing global white-ball event. They suffered narrowed defeats by Australia and Afghanistan, then were hammered by South Africa.Key admitted England were \"very poor\" and said they could have chosen a different bowling attack after coming under fire for being too reliant on high pace.But the former Kent and England player pointed towards the performance of the batting, which he said has \"fallen off a cliff\".He rejected allegations England do not train enough, though did concede some of their statements in the media \"do not help\" the public perception of the team.\"There's no doubt that we've got to get better,\" said Key. \"When we're doing interviews, when players are doing their post-match press conferences, whatever it is, we speak a lot of rubbish a lot of the time.\"They're trying so hard not to upset players in the dressing room, not try and give away something that they don't think they should.\"Then they end up creating headlines for that, but I don't kill people for really the things they say.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/506e/live/fa538e00-fa8c-11ef-a24f-f97f794e18ea.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEngland would be \u0026#34;stupid\u0026#34; not to consider Ben Stokes as a white-ball captain, says director of men\u0026#39;s cricket Rob Key.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eEngland are looking for new leaders of the one-day and T20 sides after Jos Buttler resigned following their early exit at the Champions Trophy.\u003c/p\u003e\u003cp\u003eStokes, 33, has been Test captain since 2022 but has not played white-ball cricket for England since the 2023 50-over World Cup.\u003c/p\u003e\u003cp\u003e\u0026#34;Nothing is off the table,\u0026#34; said Key. \u0026#34;You look at every single option and think, \u0026#39;What is the best thing to do?\u0026#39;\u003c/p\u003e\u003cp\u003e\u0026#34;Ben Stokes is one of the best captains I\u0026#39;ve ever seen. It would be stupid not to look at him. It\u0026#39;s just the knock-on effect of what that means.\u0026#34;\u003c/p\u003e\u003cp\u003eAll-rounder Stokes is currently recovering from a hamstring operation and has been training with a group of England Lions players in Abu Dhabi.\u003c/p\u003e\u003cp\u003eKey said Stokes is \u0026#34;flying\u0026#34; and \u0026#34;on track to start the summer in a full role, bowling and batting\u0026#34;.\u003c/p\u003e\u003cp\u003eOn Saturday, in the aftermath of England\u0026#39;s defeat against South Africa in their final match at the Champions Trophy, head coach Brendon McCullum did not rule out having different captains in each of the three formats.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOn Thursday at Lord\u0026#39;s, Key said England will not rush the decision and have \u0026#34;plenty of options\u0026#34;, but he sees a greater alignment between Test and 50-over cricket, when compared to the T20 format.\u003c/p\u003e\u003cp\u003eIt could be a possibility that Stokes combines the 50-over leadership with the Test side, working alongside a different T20 captain.\u003c/p\u003e\u003cp\u003e\u0026#34;I believe that Test cricket and 50-over cricket are probably closer than T20s, which is the outlier now,\u0026#34; said Key.\u003c/p\u003e\u003cp\u003eKey also mentioned current white-ball vice-captain Harry Brook and limited-overs specialists Phil Salt and Liam Livingstone, who have both led England in the past year.\u003c/p\u003e\u003cp\u003eIf Stokes or Brook take a white-ball leadership role, their workload would come into consideration, particularly in a year when England face marquee Test series at home to India and away to Australia.\u003c/p\u003e\u003cp\u003eA home white-ball series against West Indies begins only four days after a one-off Test against Zimbabwe in May, while the summer ends with limited-overs matches against South Africa and Ireland.\u003c/p\u003e\u003cp\u003eEngland play a white-ball series in New Zealand prior to the Ashes, which is then followed by a T20 World Cup in India and Sri Lanka early next year. \u003c/p\u003e\u003cp\u003eStokes was man of the match when England won the 50-over World Cup in 2019 and played a major role when they were crowned T20 world champions in 2022.\u003c/p\u003e\u003cp\u003eHe retired from 50-over cricket in the summer of 2022 and reversed the decision to play in the 2023 World Cup.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve got to get the most out of our best players,\u0026#34; said Key. \u0026#34;We want them playing for England.\u003c/p\u003e\u003cp\u003e\u0026#34;That\u0026#39;s important and that\u0026#39;s going to take some work because you\u0026#39;re also throwing franchise cricket into that.\u003c/p\u003e\u003cp\u003e\u0026#34;But I believe our players are committed to playing for England as much as they can.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eKey said he expects pace bowler Brydon Carse to be fit for the start of the summer after a foot injury cut short his Champions Trophy and ruled him out of the Indian Premier League.\u003c/p\u003e\u003cp\u003eMark Wood will see a specialist this week about a knee injury picked up at the Champions Trophy.\u003c/p\u003e\u003cp\u003eEngland\u0026#39;s performance in Pakistan was their third successive disappointing global white-ball event. They suffered narrowed defeats by Australia and Afghanistan, then were hammered by South Africa.\u003c/p\u003e\u003cp\u003eKey admitted England were \u0026#34;very poor\u0026#34; and said they could have chosen a different bowling attack after coming under fire for being too reliant on high pace.\u003c/p\u003e\u003cp\u003eBut the former Kent and England player pointed towards the performance of the batting, which he said has \u0026#34;fallen off a cliff\u0026#34;.\u003c/p\u003e\u003cp\u003eHe rejected allegations England do not train enough, though did concede some of their statements in the media \u0026#34;do not help\u0026#34; the public perception of the team.\u003c/p\u003e\u003cp\u003e\u0026#34;There\u0026#39;s no doubt that we\u0026#39;ve got to get better,\u0026#34; said Key. \u0026#34;When we\u0026#39;re doing interviews, when players are doing their post-match press conferences, whatever it is, we speak a lot of rubbish a lot of the time.\u003c/p\u003e\u003cp\u003e\u0026#34;They\u0026#39;re trying so hard not to upset players in the dressing room, not try and give away something that they don\u0026#39;t think they should.\u003c/p\u003e\u003cp\u003e\u0026#34;Then they end up creating headlines for that, but I don\u0026#39;t kill people for really the things they say.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-06T14:30:46.908Z",
  "modifiedTime": null
}
