{
  "id": "02fdddb1-2fe1-4d9e-9dda-9331cb5223d7",
  "title": "Geometries of Gathering: Architecture That Blurs the Line Between Civic Scales and Commercial Programs",
  "link": "https://architizer.com/blog/inspiration/collections/geometries-gathering-civic-commerical/",
  "description": "Multipurpose design meets monumental clarity in masterful examples of how architectural identity can unify divergent uses. The post Geometries of Gathering: Architecture That Blurs the Line Between Civic Scales and Commercial Programs appeared first on Journal.",
  "author": "Ifeoma Nduka",
  "published": "Thu, 17 Jul 2025 12:01:31 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Collections",
    "Inspiration",
    "A+Spotlight"
  ],
  "byline": "Ifeoma Nduka",
  "length": 7584,
  "excerpt": "Multipurpose design meets monumental clarity in masterful examples of how architectural identity can unify divergent uses.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "The winners of the 13th Architizer A+Awards have been announced! Looking ahead to next season? Stay up to date by subscribing to our A+Awards Newsletter. Aside from accommodating crowds, event spaces are spectacular opportunities for architecture to perform. Whether designed for sports, culture or general entertainment gatherings, these buildings make a public claim through scale, material and spatial rhythm. The six projects featured in this article are winners of the 13th Architizer A+Awards, recognized by the votes of a jury of AEC leaders from around the world, as well as the votes of the global public. Across different programs, these venues are united by a desire to call attention to themselves. Some are civic in scale, and some others are compact and sculptural. But all of them place visual presence and spatial performance at the core of their design. They manage crowd flow, activate the senses, and define the tone of the event and functions they host. Spanning sports arenas, cultural hubs and public gathering spaces, these six projects demonstrate how bold architecture can enhance the experience of coming together. OPEN ARENA | National Athletics Center By NAPUR Architect, Budapest, Hungary Popular Choice Winner, Stadium and Arena, 13th Architizer A+Awards The Open Arena in Budapest is a stadium designed to stand out. Its most defining feature is its form. A circular plan is wrapped in a structural frame of angled steel columns that rise and tilt outward in a clear, repetitive rhythm. This gives the building a bold edge and a constant sense of motion. During the day, the exposed structure frames the open interior. At night, a lighting system transforms the stadium into a glowing ring, sometimes with red, white, and green lights pulsing across the façade in reference to the colors of the Hungarian flag. The combination of steel, structure and light gives the building a civic presence that is both architectural and symbolic. From a distance, it reads as a continuous ring positioned along the Danube. It anchors the riverbank and becomes part of the city’s skyline. It is a bold venue that excels in form and leaves a strong impression, day or night. Portland International Airport Main Terminal Expansion By ZGF Architects, Portland, Oregon Jury Winner, Transport Interiors, 13th Architizer A+Awards The Portland International Airport terminal expansion is led by its structure and scale. Its most defining feature is a massive timber roof that spans the entire terminal in one sweeping gesture. The roof’s curved form and exposed wood construction make it feel like a single sculptural surface, setting the tone before passengers even check in. It’s not subtle. The structure asserts itself as the primary design element, bringing weight and presence to what is usually a transitional space. A dense grid of skylights also breaks up the mass and pulls in natural light, creating a soft surface. As a public venue, the terminal is designed to accommodate both movement and stillness simultaneously. The roof defines the space, but the layout stays open and adaptable. From below, the warm materiality is dramatic at scale and impossible to ignore. It is a civic space that elevates the everyday travel experience through bold, deliberate form. Multifunctional Landmark on the Riverbank By Studio 9, Tbilisi, Georgia Jury Winner \u0026 Popular Choice Winner, Mixed Use (S \u003c25,000 sq ft.), 13th Architizer A+Awards  The Multifunctional Landmark on the Riverbank is small in size but hard to miss. The building rises as a solid, sculpted mass at the edge of the water. Its concrete form is clean and compact, shaped by sharp angles and deep cuts that catch the light throughout the day. The exterior is minimal, but the geometry gives it weight and presence. From across the river, it stands out as a bold venue that defines its surroundings rather than blending in. The building is designed to be flexible. It can accommodate exhibitions, events or public gatherings, depending on the space’s intended use. Large openings on the façade pull in light and connect the interior to its setting. Inside, the layout is simple and open. The design lets the form speak for itself. This is a small venue that achieves a great deal with very little by utilizing shape, scale and material to make a clear architectural statement. Virunga Mountain Spirits Distillery By BE_Design, Northern Province, Rwanda Jury Winner \u0026 Popular Choice Winner, Architecture +Low‑Cost Design, 13th Architizer A+Awards The Virunga Mountain Spirits Distillery is more than a place of production. It is a bold, form-driven building that acts as a public venue and a symbol of local identity. The building is located at the base of the Virunga volcanoes in northern Rwanda. It uses strong geometry and raw materials to make an immediate visual impact. The central prismoid glass pavilion features a see-through apex, showcasing the machinery on display. The distillery welcomes visitors with a tasting room, gift shop, kitchen and reception area. These public spaces turn the building into a cultural and educational destination. The architects used material choices — glass, copper and stone — to reinforce the building’s presence and purpose. Paper Island By COBE, Copenhagen, Denmark Jury Winner, Mixed Use (L \u003e25,000 sq ft.), 13th Architizer A+Awards  Paper Island in Copenhagen turns a former industrial site into a new public landmark. Designed by COBE, the project replaces low warehouses with a bold cluster of pitched-roof volumes arranged across the island’s edge. Each block reads clearly on its own, but together they form a unified massing that gives the project a strong and recognizable silhouette. The gabled shapes draw from the city’s historic rooflines, but scale and repetition make them feel contemporary and assertive. Seen from across the harbor, the geometry is clean and consistent, anchoring the island in the city’s skyline. The project combines cultural, commercial and public programs, transforming the site into a destination for both locals and visitors. It includes a large public hall, food market, swimming areas and event spaces — all connected by generous walkways and outdoor terraces. The architecture leads with rhythm and form, but supports a wide range of activity. With this project, COBE transforms a previously closed site into a bold civic venue that is open, visible and designed to host life at every scale. SAP Garden By 3XN, Munich, Germany Jury Winner, 13th Architizer A+Awards, Stadium and Arena SAP Garden’s architecture is immediately striking. It has an oval form that is asymmetrical in both height and plan. This gives it an organic presence that softens its scale within the larger Olympic Park context. Instead of asserting itself through aggressive volume, the building folds gently into the surrounding landscape. This presence is aided by a green roof and a park-like artificial hill that conceals the training rinks beneath. This allows the arena to feel like a continuation of the terrain rather than a separate object. However, what immediately communicates a bold presence and asserts the visual weight of the building is the facade. The 260 geometrically unique vertical pilasters have a deliberate rhythm that makes the building appear to shift and ripple as you move around it. It’s a form-driven structure that sets the tone before anything begins inside. The winners of the 13th Architizer A+Awards have been announced! Looking ahead to next season? Stay up to date by subscribing to our A+Awards Newsletter.",
  "image": "https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-1-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003e\u003ci\u003eThe winners of the \u003c/i\u003e\u003ca href=\"https://winners.architizer.com/\"\u003e\u003cspan\u003e\u003ci\u003e13th Architizer A+Awards\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003cem\u003e have been announced!\u003c/em\u003e\u003ci\u003e Looking ahead to next season? Stay up to date by subscribing to our \u003c/i\u003e\u003ca href=\"https://awards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\"\u003e\u003cspan\u003e\u003ci\u003eA+Awards Newsletter.\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAside from accommodating crowds, event spaces are spectacular opportunities for architecture to perform. Whether designed for sports, culture or general entertainment gatherings, these buildings make a public claim through scale, material and spatial rhythm. The six projects featured in this article are winners of the \u003ca href=\"https://awards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e13th Architizer A+Awards\u003c/a\u003e, recognized by the votes of a jury of AEC leaders from around the world, as well as the votes of the global public.\u003c/p\u003e\n\u003cp\u003eAcross different programs, these venues are united by a desire to call attention to themselves. Some are civic in scale, and some others are compact and sculptural. But all of them place visual presence and spatial performance at the core of their design. They manage crowd flow, activate the senses, and define the tone of the event and functions they host. Spanning sports arenas, cultural hubs and public gathering spaces, these six projects demonstrate how bold architecture can enhance the experience of coming together.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/open-arena-national-athletics-center-budapest/\" target=\"_blank\" rel=\"noopener\"\u003eOPEN ARENA | National Athletics Center\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/napur-architect/\" target=\"_blank\" rel=\"noopener\"\u003eNAPUR Architect\u003c/a\u003e, Budapest, Hungary\u003c/h4\u003e\n\u003ch5\u003e\u003cstrong\u003ePopular Choice Winner, Stadium and Arena, 13th Architizer A+Awards\u003c/strong\u003e\u003c/h5\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2.jpg\" alt=\"\" width=\"2500\" height=\"1872\" srcset=\"https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2.jpg 2500w, https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2-300x225.jpg 300w, https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2-1024x767.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2-768x575.jpg 768w, https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2-1536x1150.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2-2048x1534.jpg 2048w, https://blog.architizer.com/wp-content/uploads/1745750890306Open_arena_WA2023_photo_credit_Zsolt_HLINKA_2-66x50.jpg 66w\" sizes=\"(max-width: 2500px) 100vw, 2500px\"/\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16.jpg\" alt=\"\" width=\"2500\" height=\"1561\" srcset=\"https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16.jpg 2500w, https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16-300x187.jpg 300w, https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16-1024x639.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16-768x480.jpg 768w, https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16-1536x959.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1745750505610Open_arena_Legacy_2024_photo_credit_Jozef_MOLNAR_16-2048x1279.jpg 2048w\" sizes=\"(max-width: 2500px) 100vw, 2500px\"/\u003eThe Open Arena in Budapest is a stadium designed to stand out. Its most defining feature is its form. A circular plan is wrapped in a structural frame of angled steel columns that rise and tilt outward in a clear, repetitive rhythm. This gives the building a bold edge and a constant sense of motion. During the day, the exposed structure frames the open interior. At night, a lighting system transforms the stadium into a glowing ring, sometimes with red, white, and green lights pulsing across the façade in reference to the colors of the Hungarian flag.\u003c/p\u003e\n\u003cp\u003eThe combination of steel, structure and light gives the building a civic presence that is both architectural and symbolic. From a distance, it reads as a continuous ring positioned along the Danube. It anchors the riverbank and becomes part of the city’s skyline. It is a bold venue that excels in form and leaves a strong impression, day or night.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/portland-international-airport-main-terminal-expansion/\" target=\"_blank\" rel=\"noopener\"\u003ePortland International Airport Main Terminal Expansion\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/zgf-architects-llp/\" target=\"_blank\" rel=\"noopener\"\u003eZGF Architects\u003c/a\u003e, Portland, Oregon\u003c/h4\u003e\n\u003ch5\u003eJury Winner, Transport Interiors, 13th Architizer A+Awards\u003c/h5\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-scaled.jpg\" alt=\"\" width=\"2560\" height=\"2234\" srcset=\"https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-scaled.jpg 2560w, https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-300x262.jpg 300w, https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-1024x894.jpg 1024w, https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-768x670.jpg 768w, https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-1536x1340.jpg 1536w, https://blog.architizer.com/wp-content/uploads/172495691696801_PDX_Airport_Main_Terminal_Ema_Peter_Photography-1-2048x1787.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-scaled.jpg\" alt=\"\" width=\"1708\" height=\"2560\" srcset=\"https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-scaled.jpg 1708w, https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-200x300.jpg 200w, https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-683x1024.jpg 683w, https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-768x1151.jpg 768w, https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-1025x1536.jpg 1025w, https://blog.architizer.com/wp-content/uploads/172495698178204_PDX_Airport_Main_Terminal_Ema_Peter_Photography_-1366x2048.jpg 1366w\" sizes=\"auto, (max-width: 1708px) 100vw, 1708px\"/\u003eThe Portland International Airport terminal expansion is led by its structure and scale. Its most defining feature is a massive timber roof that spans the entire terminal in one sweeping gesture. The roof’s curved form and exposed wood construction make it feel like a single sculptural surface, setting the tone before passengers even check in. It’s not subtle. The structure asserts itself as the primary design element, bringing weight and presence to what is usually a transitional space.\u003c/p\u003e\n\u003cp\u003eA dense grid of skylights also breaks up the mass and pulls in natural light, creating a soft surface. As a public venue, the terminal is designed to accommodate both movement and stillness simultaneously. The roof defines the space, but the layout stays open and adaptable. From below, the warm materiality is dramatic at scale and impossible to ignore. It is a civic space that elevates the everyday travel experience through bold, deliberate form.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/multifunctional-landmark-on-the-riverbank-1/\" target=\"_blank\" rel=\"noopener\"\u003eMultifunctional Landmark on the Riverbank\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/studio-9/\" target=\"_blank\" rel=\"noopener\"\u003eStudio 9\u003c/a\u003e, Tbilisi, Georgia\u003c/h4\u003e\n\u003ch5\u003e\u003cstrong\u003eJury Winner \u0026amp; Popular Choice Winner, Mixed Use (S \u0026lt;25,000 sq ft.), 13th Architizer A+Awards \u003c/strong\u003e\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1920\" srcset=\"https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-scaled.jpg 2560w, https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-300x225.jpg 300w, https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-1024x768.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-768x576.jpg 768w, https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-1536x1152.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-2048x1536.jpg 2048w, https://blog.architizer.com/wp-content/uploads/1746016447975Multifunctional-Landmark-1-66x50.jpg 66w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-scaled.jpg\" alt=\"\" width=\"2048\" height=\"2560\" srcset=\"https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-scaled.jpg 2048w, https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-240x300.jpg 240w, https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-819x1024.jpg 819w, https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-768x960.jpg 768w, https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-1229x1536.jpg 1229w, https://blog.architizer.com/wp-content/uploads/1746016448047Multifunctional-Landmark-2-1638x2048.jpg 1638w\" sizes=\"auto, (max-width: 2048px) 100vw, 2048px\"/\u003eThe Multifunctional Landmark on the Riverbank is small in size but hard to miss. The building rises as a solid, sculpted mass at the edge of the water. Its concrete form is clean and compact, shaped by sharp angles and deep cuts that catch the light throughout the day. The exterior is minimal, but the geometry gives it weight and presence. From across the river, it stands out as a bold venue that defines its surroundings rather than blending in.\u003c/p\u003e\n\u003cp\u003eThe building is designed to be flexible. It can accommodate exhibitions, events or public gatherings, depending on the space’s intended use. Large openings on the façade pull in light and connect the interior to its setting. Inside, the layout is simple and open. The design lets the form speak for itself. This is a small venue that achieves a great deal with very little by utilizing shape, scale and material to make a clear architectural statement.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/virunga-mountain-spirits-distillery/\" target=\"_blank\" rel=\"noopener\"\u003eVirunga Mountain Spirits Distillery\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/be_design/\" target=\"_blank\" rel=\"noopener\"\u003eBE_Design\u003c/a\u003e, Northern Province, Rwanda\u003c/h4\u003e\n\u003ch5\u003eJury Winner \u0026amp; Popular Choice Winner, Architecture +Low‑Cost Design, 13th Architizer A+Awards\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5.jpg\" alt=\"\" width=\"2500\" height=\"1466\" srcset=\"https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5.jpg 2500w, https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5-300x176.jpg 300w, https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5-1024x600.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5-768x450.jpg 768w, https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5-1536x901.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1745267640013BE_Design-Virunga_Mountain_Spirits-5-2048x1201.jpg 2048w\" sizes=\"auto, (max-width: 2500px) 100vw, 2500px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8.jpg\" alt=\"\" width=\"2500\" height=\"1667\" srcset=\"https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8.jpg 2500w, https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8-300x200.jpg 300w, https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8-1024x683.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8-768x512.jpg 768w, https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8-1536x1024.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1745267646566BE_Design-Virunga_Mountain_Spirits-8-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 2500px) 100vw, 2500px\"/\u003eThe Virunga Mountain Spirits Distillery is more than a place of production. It is a bold, form-driven building that acts as a public venue and a symbol of local identity. The building is located at the base of the Virunga volcanoes in northern Rwanda. It uses strong geometry and raw materials to make an immediate visual impact. The central prismoid glass pavilion features a see-through apex, showcasing the machinery on display.\u003c/p\u003e\n\u003cp\u003eThe distillery welcomes visitors with a tasting room, gift shop, kitchen and reception area. These public spaces turn the building into a cultural and educational destination. The architects used material choices — glass, copper and stone — to reinforce the building’s presence and purpose.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/paper-island/\" target=\"_blank\" rel=\"noopener\"\u003ePaper Island\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/cobe/\" target=\"_blank\" rel=\"noopener\"\u003eCOBE\u003c/a\u003e, Copenhagen, Denmark\u003c/h4\u003e\n\u003ch5\u003e\u003cstrong\u003eJury Winner, Mixed Use (L \u0026gt;25,000 sq ft.), 13th Architizer A+Awards \u003c/strong\u003e\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Paper-Island.png\" alt=\"\" width=\"1261\" height=\"885\" srcset=\"https://blog.architizer.com/wp-content/uploads/Paper-Island.png 1261w, https://blog.architizer.com/wp-content/uploads/Paper-Island-300x211.png 300w, https://blog.architizer.com/wp-content/uploads/Paper-Island-1024x719.png 1024w, https://blog.architizer.com/wp-content/uploads/Paper-Island-768x539.png 768w\" sizes=\"auto, (max-width: 1261px) 100vw, 1261px\"/\u003ePaper Island in Copenhagen turns a former industrial site into a new public landmark. Designed by COBE, the project replaces low warehouses with a bold cluster of pitched-roof volumes arranged across the island’s edge. Each block reads clearly on its own, but together they form a unified massing that gives the project a strong and recognizable silhouette. The gabled shapes draw from the city’s historic rooflines, but scale and repetition make them feel contemporary and assertive. Seen from across the harbor, the geometry is clean and consistent, anchoring the island in the city’s skyline.\u003c/p\u003e\n\u003cp\u003eThe project combines cultural, commercial and public programs, transforming the site into a destination for both locals and visitors. It includes a large public hall, food market, swimming areas and event spaces — all connected by generous walkways and outdoor terraces. The architecture leads with rhythm and form, but supports a wide range of activity. With this project, COBE transforms a previously closed site into a bold civic venue that is open, visible and designed to host life at every scale.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/sap-garden/\" target=\"_blank\" rel=\"noopener\"\u003eSAP Garden\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/projects/sap-garden/\" target=\"_blank\" rel=\"noopener\"\u003e3XN\u003c/a\u003e, Munich, Germany\u003c/h4\u003e\n\u003ch5\u003eJury Winner, 13th Architizer A+Awards, Stadium and Arena\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1918\" srcset=\"https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-scaled.jpg 2560w, https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-300x225.jpg 300w, https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-1024x767.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-768x575.jpg 768w, https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-1536x1151.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-2048x1535.jpg 2048w, https://blog.architizer.com/wp-content/uploads/1745311704033Rasmus_Hjortshoj__SAP_Garden_WEB-15-66x50.jpg 66w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1707\" srcset=\"https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-scaled.jpg 2560w, https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-300x200.jpg 300w, https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-1024x683.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-768x512.jpg 768w, https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-1536x1024.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1745311677195Rasmus_Hjortshoj__SAP_Garden_WEB-200-2048x1365.jpg 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003eSAP Garden’s architecture is immediately striking. It has an oval form that is asymmetrical in both height and plan. This gives it an organic presence that softens its scale within the larger Olympic Park context. Instead of asserting itself through aggressive volume, the building folds gently into the surrounding landscape. This presence is aided by a green roof and a park-like artificial hill that conceals the training rinks beneath. This allows the arena to feel like a continuation of the terrain rather than a separate object.\u003c/p\u003e\n\u003cp\u003eHowever, what immediately communicates a bold presence and asserts the visual weight of the building is the facade. The 260 geometrically unique vertical pilasters have a deliberate rhythm that makes the building appear to shift and ripple as you move around it. It’s a form-driven structure that sets the tone before anything begins inside.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eThe winners of the \u003c/i\u003e\u003ca href=\"https://winners.architizer.com/\"\u003e\u003cspan\u003e\u003ci\u003e13th Architizer A+Awards\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003cem\u003e have been announced!\u003c/em\u003e\u003ci\u003e Looking ahead to next season? Stay up to date by subscribing to our \u003c/i\u003e\u003ca href=\"https://awards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\"\u003e\u003cspan\u003e\u003ci\u003eA+Awards Newsletter.\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-17T12:01:31Z",
  "modifiedTime": "2025-07-08T07:07:10Z"
}
