{
  "id": "174fab95-6efd-4449-bd26-81d31f0c92b6",
  "title": "Angular concrete buildings surround Domino Square plaza",
  "link": "https://www.dezeen.com/2025/01/10/domino-square-plaza-field-operations-studio-cadena/",
  "description": "Architecture firms Field Operations and Studio Cadena have completed a plaza hemmed by angular concrete enclosures at the Domino Sugar development in Brooklyn, New York. With a central rink area covered by a shade structure, Domino Square sits between Selldorf Architects' porcelain-clad skyscrapers and PAU's office in the shell of the historic Domino Sugar Factory. The post Angular concrete buildings surround Domino Square plaza appeared first on Dezeen.",
  "author": "Ben Dreith",
  "published": "Fri, 10 Jan 2025 20:00:08 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "USA",
    "Brooklyn",
    "Plazas, piazzas and squares",
    "Field Operations",
    "Studio Cadena",
    "New York City",
    "Landscape and urbanism",
    "New York",
    "Landscape architecture"
  ],
  "byline": "Ben Dreith",
  "length": 8566,
  "excerpt": "Field Operations and Studio Cadena have completed a plaza as one of the final elements of the Domino Sugar development in Brooklyn.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Architecture firms Field Operations and Studio Cadena have completed a plaza hemmed by angular concrete enclosures at the Domino Sugar development in Brooklyn, New York. With a central rink area covered by a shade structure, Domino Square sits between Selldorf Architects' porcelain-clad skyscrapers and PAU's office in the shell of the historic Domino Sugar Factory. Field Operations and Studio Cadena have completed a plaza at the Domino Sugar development. Photo by Daniel LevinThe team oriented the park to maximize views of the Manhattan skyline with the Statue of Liberty visible from the top of the tiered seating that lines the east side. The design of the park utilises the change in grade from the waterfront to Kent Street, allowing for a series of concrete enclosures designed by Studio Cardena to be at ground level facing the street. The tops of these blocks were landscaped and stepped down to the park. It is one of the final steps of the development, which was masterplanned by SHoP Architects and Field Operations. Photo by Daniel LevinBetween the artificial berm created by the landscaped enclosures is an entryway lined with weathering-steel retaining walls, which provides access to the park and the greater development. According to Field Operations partner Lisa Switkin, this acts as a gateway to the plaza. \"Its design is carefully orientated to respond to movement flows and sightlines, creating a sense of openness with multiple entry points, as well as moments of compression and expansion,\" she told Dezeen. Studio Cadena designed an enclosure that lines one side of the parkThe plaza is one of the last elements of the Domino Sugar development, driven by New York developer Two Trees Management, and masterplanned by SHoP Architects and Field Operations. Skyscrapers by SHoP Arhchitects and by CookFox have also been completed at the site in the last decade. Studio Cadena was responsible for the structures that line the street. Fronted by glass, the structures have fanned forms that rise from the concrete. The enclosure mitigates the slope from the waterfrontAccording to studio founder Benjamin Cadena, the structures responded to the site's gradient while orienting the landscaping above. While the enclosures were designed to provide space for four different retail operations, the spaces have been combined, and soon a restaurant will fill the structure on each side of the entryway. Though part of the overall development, Cadena said that he wanted to differentiate the park and create a sense of \"enclosure\" while relating the materials to the infrastructure. The walls of the enclosure were designed to extend from the concrete from below, yet the aggregate was slightly changed to make it distinct. Concrete aggregate was chosen for the enclosures that merges it with the street while keeping the park distinct\"We wanted to create a sense of enclosure in the bowl-like shape of the square and on the street side to create a very distinct figure, so it could be recognizable and also would be flexible to start to accommodate different things,\" Cadena told Dezeen. \"Essentially, it's like a loggia that can be occupied in different ways.\" Elevated seating steps down from the lip of the enclosureBecause of the dense urban environment and the size of infrastructure adjacent and below, the project had to integrate a variety of technical elements, including a series of ventilation and intake ducts for a water treatment facility below. Studio Cadena worked with Field Operations to conceive of bronze-coloured pipes that poke out through the landscape. \"The idea was to express these, rather to hide them, because it is kind of part of the ethos of the site,\" said Cadena, noting the industrial history of the site. \"I wanted these aspects to be integrated and expressed in the context of a city, because I think it's a project that really integrates things that operate at multiple levels.\" A shading structure covers the rink seating in the middleA final skyscraper is still underway as part of the development. Field Operations (formerly called James Corner Field Operations) has executed some of the most high-profile landscape projects in the city in the last decade, including the iconic High Line project. Studio Cadena operates out of New York and Bogotá and earned attention in 2018 for a sculptural pavilion in Flat Iron Plaza. The photography is by Michael Vahrenwald unless otherwise stated. Read more: USA Brooklyn Plazas, piazzas and squares Field Operations Studio Cadena New York City Landscape and urbanism New York Landscape architecture Architecture Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_hero-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2159165\" data-article-id=\"2159165\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_hero-852x479.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_hero-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eArchitecture firms \u003ca href=\"https://www.dezeen.com/tag/james-corner-field-operations/\"\u003eField Operations\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/tag/studio-cadena/\"\u003eStudio Cadena\u003c/a\u003e have completed a plaza hemmed by angular concrete enclosures at the \u003ca href=\"https://www.dezeen.com/tag/domino-sugar-refinery/\"\u003eDomino Sugar\u003c/a\u003e development in \u003ca href=\"https://www.dezeen.com/tag/brooklyn/\"\u003eBrooklyn\u003c/a\u003e, New York.\u003cspan id=\"more-2159165\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWith a central rink area covered by a shade structure, Domino Square sits between \u003ca href=\"https://www.dezeen.com/2024/10/07/selldorf-architectsc-completes-brooklyn-skyscrapers-clad-with-porcelain-panels/\"\u003eSelldorf Architects\u0026#39; porcelain-clad skyscrapers\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2023/10/02/pau-domino-sugar-refinery-glass-vault/\"\u003ePAU\u0026#39;s office\u003c/a\u003e in the shell of the historic Domino Sugar Factory.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2159236\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_14.jpg\" data-orientation=\"square\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_14-852x852.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"2364\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_14-852x852.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_14-1704x1704.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159236\"\u003eField Operations and Studio Cadena have completed a plaza at the Domino Sugar development. Photo by Daniel Levin\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe team oriented the park to maximize views of the Manhattan skyline with the Statue of Liberty visible from the top of the tiered seating that lines the east side.\u003c/p\u003e\n\u003cp\u003eThe design of the park utilises the change in grade from the waterfront to Kent Street, allowing for a series of concrete enclosures designed by \u003ca href=\"https://www.studiocardenas.it/index.php/en/\"\u003eStudio Cardena\u003c/a\u003e to be at ground level facing the street. The tops of these blocks were landscaped and stepped down to the park.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2159239\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_sq2.jpg\" data-orientation=\"square\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_sq2-852x852.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"2364\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_sq2-852x852.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_sq2-1704x1704.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159239\"\u003eIt is one of the final steps of the development, which was masterplanned by SHoP Architects and Field Operations. Photo by Daniel Levin\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBetween the artificial berm created by the landscaped enclosures is an entryway lined with weathering-steel retaining walls, which provides access to the park and the greater development.\u003c/p\u003e\n\n\n\u003cp\u003eAccording to \u003ca href=\"https://fieldoperations.net/\"\u003eField Operations\u003c/a\u003e partner Lisa Switkin, this acts as a gateway to the plaza.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Its design is carefully orientated to respond to movement flows and sightlines, creating a sense of openness with multiple entry points, as well as moments of compression and expansion,\u0026#34; she told Dezeen.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2159226\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_4.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_4-852x568.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_4-852x568.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_4-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159226\"\u003eStudio Cadena designed an enclosure that lines one side of the park\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe plaza is one of the last elements of the Domino Sugar development, driven by New York developer \u003ca href=\"https://www.twotreesny.com/\"\u003eTwo Trees Management\u003c/a\u003e, and masterplanned by \u003ca href=\"https://www.shoparc.com/\"\u003eSHoP Architects\u003c/a\u003e and Field Operations. Skyscrapers by \u003ca href=\"https://www.dezeen.com/2018/02/09/shop-architects-completes-325-kent-first-building-domino-sugar-factory-site-brooklyn/\"\u003eSHoP Arhchitects\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2022/04/19/cookfox-linked-towers-domino-sugar-refinery-brooklyn/\"\u003eby CookFox\u003c/a\u003e have also been completed at the site in the last decade.\u003c/p\u003e\n\u003cp\u003eStudio Cadena was responsible for the structures that line the street. Fronted by glass, the structures have fanned forms that rise from the concrete.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2159228\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_6-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_6-852x1028.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"1960\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_6-852x1028.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_6-1704x2056.jpg 2x\" sizes=\"(max-width: 1960px) 100vw, 1960px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159228\"\u003eThe enclosure mitigates the slope from the waterfront\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAccording to studio founder Benjamin Cadena, the structures responded to the site\u0026#39;s gradient while orienting the landscaping above.\u003c/p\u003e\n\u003cp\u003eWhile the enclosures were designed to provide space for four different retail operations, the spaces have been combined, and soon a restaurant will fill the structure on each side of the entryway.\u003c/p\u003e\n\u003cp\u003eThough part of the overall development, Cadena said that he wanted to differentiate the park and create a sense of \u0026#34;enclosure\u0026#34; while relating the materials to the infrastructure. The walls of the enclosure were designed to extend from the concrete from below, yet the aggregate was slightly changed to make it distinct.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2159230\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_8.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_8-852x633.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"2364\" height=\"1756\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_8-852x633.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_8-1704x1266.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159230\"\u003eConcrete aggregate was chosen for the enclosures that merges it with the street while keeping the park distinct\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;We wanted to create a sense of enclosure in the bowl-like shape of the square and on the street side to create a very distinct figure, so it could be recognizable and also would be flexible to start to accommodate different things,\u0026#34; Cadena told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Essentially, it\u0026#39;s like a loggia that can be occupied in different ways.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2159227\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_5.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_5-852x701.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"2364\" height=\"1946\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_5-852x701.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_5-1704x1403.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159227\"\u003eElevated seating steps down from the lip of the enclosure\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBecause of the dense urban environment and the size of infrastructure adjacent and below, the project had to integrate a variety of technical elements, including a series of ventilation and intake ducts for a water treatment facility below.\u003c/p\u003e\n\u003cp\u003eStudio Cadena worked with Field Operations to conceive of bronze-coloured pipes that poke out through the landscape.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;The idea was to express these, rather to hide them, because it is kind of part of the ethos of the site,\u0026#34; said Cadena, noting the industrial history of the site.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I wanted these aspects to be integrated and expressed in the context of a city, because I think it\u0026#39;s a project that really integrates things that operate at multiple levels.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2159235\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_13.jpg\" data-orientation=\"square\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_13-852x852.jpg\" alt=\"Field Operations and Studio Cadena Domino Plaza\" width=\"2364\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_13-852x852.jpg 1x, https://static.dezeen.com/uploads/2025/01/domino-square-field-operations-cadena_dezeen_2364_col_13-1704x1704.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159235\"\u003eA shading structure covers the rink seating in the middle\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eA final skyscraper is still underway as part of the development.\u003c/p\u003e\n\u003cp\u003eField Operations (formerly called James Corner Field Operations) has executed some of the most high-profile landscape projects in the city in the last decade, including the iconic \u003ca href=\"https://www.dezeen.com/tag/high-line/\"\u003eHigh Line\u003c/a\u003e project.\u003c/p\u003e\n\u003cp\u003eStudio Cadena operates out of New York and Bogotá\u003cspan\u003e and earned attention in 2018 for a \u003ca href=\"https://www.dezeen.com/2018/11/23/happy-installation-studio-cadena-flatiron-new-york/\" target=\"_blank\" rel=\"noopener\"\u003esculptural pavilion in Flat Iron Plaza\u003c/a\u003e\u003c/span\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by Michael Vahrenwald unless otherwise stated.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"76\" href=\"https://www.dezeen.com/tag/usa/\"\u003eUSA\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3521\" href=\"https://www.dezeen.com/tag/brooklyn/\"\u003eBrooklyn\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6127\" href=\"https://www.dezeen.com/tag/plazas/\"\u003ePlazas, piazzas and squares\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6193\" href=\"https://www.dezeen.com/tag/field-operations/\"\u003eField Operations\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"8569\" href=\"https://www.dezeen.com/tag/studio-cadena/\"\u003eStudio Cadena\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"9095\" href=\"https://www.dezeen.com/tag/new-york-city/\"\u003eNew York City\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"10130\" href=\"https://www.dezeen.com/tag/landscape-and-urbanism/\"\u003eLandscape and urbanism\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"17654\" href=\"https://www.dezeen.com/tag/new-york/\"\u003eNew York\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"828\" href=\"https://www.dezeen.com/tag/landscape-architecture/\"\u003eLandscape architecture\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#88f8fae1fee9ebf1c8ecedf2edede6a6ebe7e5\"\u003e\u003cspan data-cfemail=\"eb9b99829d8a8892ab8f8e918e8e85c5888486\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-10T20:00:08Z",
  "modifiedTime": "2025-01-10T15:59:26Z"
}
