{
  "id": "2142ddc5-d0c7-4a7a-aa1c-d72072584789",
  "title": "OFIS Arhitekti creates timber-framed interior for home on Croatian island",
  "link": "https://www.dezeen.com/2024/11/27/ofis-arhitekti-light-house-croatia/",
  "description": "Slovenian studio OFIS Arhitekti has renovated a stone home on the Croatian island of Cres, inserting a slatted timber framework that allows daylight to filter through the interior while doubling \"multifunctional furniture\". Aptly named Light House, the project involved gutting the three-storey home, which has a floor area of just three by three metres and The post OFIS Arhitekti creates timber-framed interior for home on Croatian island appeared first on Dezeen.",
  "author": "Jon Astbury",
  "published": "Wed, 27 Nov 2024 11:30:06 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Residential",
    "Architecture",
    "Croatia",
    "Residential architecture and interiors",
    "Stone",
    "Houses",
    "OFIS Arhitekti",
    "Renovations"
  ],
  "byline": "Jon Astbury",
  "length": 6525,
  "excerpt": "OFIS Arhitekti has renovated a home on a Croatian island, inserting a slatted timber framework that allows daylight to filter through the interiors.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Slovenian studio OFIS Arhitekti has renovated a stone home on the Croatian island of Cres, inserting a slatted timber framework that allows daylight to filter through the interior while doubling \"multifunctional furniture\". Aptly named Light House, the project involved gutting the three-storey home, which has a floor area of just three by three metres and occupies a portion of a historic stone building. OFIS Arhitekti focused on the verticality of the home, creating a singular structure that could unite its three floors and attic while preventing it from becoming too dark and compartmentalised. OFIS Arhitekti has renovated a stone home in Croatia\"Inside a small volume you cannot create Piranesian spaces, so there were two core ideas: an impressive vertical 'lighthouse' space, and a basic wooden structure like the piers on the docks,\" OFIS Arhitekti founder Rok Oman told Dezeen. \"A light wooden structure was inserted into the empty perimeter, which makes the house usable, and at the same time, the inserted volume functions as a single piece of multifunctional furniture,\" he added. A core frame of timber beams and columns supports the interior structure while containing the home's electrical services. A timber framework has been slotted insideThis framework supports a series of floor plates formed entirely by wooden slats, which allow light from both the windows in the perimeter walls and a new skylight to filter through the entire home. Light House's layout is informed by traditional homes in the area, with a kitchen and dining area on the ground floor, a living room that can be converted to a guest bedroom on the first floor and the main bedroom on the second floor. To create moments of privacy, each floor features a private niche containing a seating area or bed that can be closed off with curtains. In the kitchen, areas of built-in storage surround a central island. The existing walls of the home were left as-found and painted, providing a rough contrast to the new timber elements in the home's pale-toned interiors. Built-in storage features in the kitchen\"The basic decision was to preserve the existing house, as it is as part of historical urban tissue, and also to prevent any unnecessary external interventions in order to retain sustainability in all senses; from ecological to social and sound pollution,\" Oman told Dezeen. During the construction of the project, an \"improvised workshop\" was set up in front of the home, which became a social space where locals could engage with the carpenters. Curtains enable privacy in the home's spacesOFIS Arhitekti is led by Oman and Spela Videcnik. Its other recent projects include a home finished with exposed concrete and black brickwork and a looping extension to a modernist villa, both in Ljubljana. The photography is by Tomaz Gregoric. Read more: Croatia Residential architecture and interiors Stone Houses OFIS Arhitekti Renovations Residential Architecture Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia-hero_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2118978\" data-article-id=\"2118978\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia-hero_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia-hero_dezeen_2364_col_0-852x479.jpg\" alt=\"Light House by OFIS Arhitekti\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia-hero_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia-hero_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eSlovenian studio \u003ca href=\"https://www.dezeen.com/tag/ofis-arhitekti/\"\u003eOFIS Arhitekti\u003c/a\u003e has renovated a \u003ca href=\"https://www.dezeen.com/tag/stone/\"\u003estone\u003c/a\u003e home on the Croatian island of Cres, inserting a slatted \u003ca href=\"https://www.dezeen.com/tag/wood/\"\u003etimber\u003c/a\u003e framework that allows daylight to filter through the interior while doubling \u0026#34;multifunctional furniture\u0026#34;.\u003cspan id=\"more-2118978\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eAptly named Light House, the project involved gutting the three-storey \u003ca href=\"https://www.dezeen.com/tag/houses/\"\u003ehome\u003c/a\u003e, which has a floor area of just three by three metres and occupies a portion of a historic stone building.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://ofis.si/\"\u003eOFIS Arhitekti\u003c/a\u003e focused on the verticality of the home, creating a singular structure that could unite its three floors and attic while preventing it from becoming too dark and compartmentalised.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2146751\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_17.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_17-852x639.jpg\" alt=\"Exterior view of Light House on the Croatian island of Cres\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_17-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_17-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2146751\"\u003eOFIS Arhitekti has renovated a stone home in Croatia\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Inside a small volume you cannot create Piranesian spaces, so there were two core ideas: an impressive vertical \u0026#39;lighthouse\u0026#39; space, and a basic wooden structure like the piers on the docks,\u0026#34; OFIS Arhitekti founder Rok Oman told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;A light wooden structure was inserted into the empty perimeter, which makes the house usable, and at the same time, the inserted volume functions as a single piece of multifunctional furniture,\u0026#34; he added.\u003c/p\u003e\n\n\n\u003cp\u003eA core frame of timber beams and columns supports the interior structure while containing the home\u0026#39;s electrical services.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2146735\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_2-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_2-852x1136.jpg\" alt=\"Hallway interior within stone home by OFIS Arhitekti\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_2-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_2-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2146735\"\u003eA timber framework has been slotted inside\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis framework supports a series of floor plates formed entirely by wooden slats, which allow light from both the windows in the perimeter walls and a new skylight to filter through the entire home.\u003c/p\u003e\n\u003cp\u003eLight House\u0026#39;s layout is informed by traditional homes in the area, with a kitchen and dining area on the ground floor, a living room that can be converted to a guest bedroom on the first floor and the main bedroom on the second floor.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eTo create moments of privacy, each floor features a private niche containing a seating area or bed that can be closed off with curtains. In the kitchen, areas of built-in storage surround a central island.\u003c/p\u003e\n\u003cp\u003eThe existing walls of the home were left as-found and painted, providing a rough contrast to the new timber elements in the home\u0026#39;s pale-toned interiors.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2146736\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_3-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_3-852x1136.jpg\" alt=\"Kitchen interior within stone home by OFIS Arhitekti\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_3-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_3-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2146736\"\u003eBuilt-in storage features in the kitchen\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The basic decision was to preserve the existing house, as it is as part of historical urban tissue, and also to prevent any unnecessary external interventions in order to retain sustainability in all senses; from ecological to social and sound pollution,\u0026#34; Oman told Dezeen.\u003c/p\u003e\n\u003cp\u003eDuring the construction of the project, an \u0026#34;improvised workshop\u0026#34; was set up in front of the home, which became a social space where locals could engage with the carpenters.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2146748\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_14-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_14-852x1136.jpg\" alt=\"Bedroom interiors within Light House by OFIS Arhitekti\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_14-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/09/ofis-arhitekti-light-house-croatia_dezeen_2364_col_14-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2146748\"\u003eCurtains enable privacy in the home\u0026#39;s spaces\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOFIS Arhitekti is led by Oman and Spela Videcnik. Its other recent projects include a \u003ca href=\"https://www.dezeen.com/2024/06/05/ofis-arhitekti-villa-eternal-way-slovenia/\"\u003ehome finished with exposed concrete and black brickwork\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/05/12/ofis-arhitekti-ring-house-extension/\"\u003ea looping extension to a modernist villa\u003c/a\u003e, both in Ljubljana.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by Tomaz Gregoric.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"268\" href=\"https://www.dezeen.com/tag/croatia/\"\u003eCroatia\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"273\" href=\"https://www.dezeen.com/tag/residential/\"\u003eResidential architecture and interiors\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"1927\" href=\"https://www.dezeen.com/tag/stone/\"\u003eStone\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3353\" href=\"https://www.dezeen.com/tag/houses/\"\u003eHouses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4303\" href=\"https://www.dezeen.com/tag/ofis-arhitekti/\"\u003eOFIS Arhitekti\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"5133\" href=\"https://www.dezeen.com/tag/renovations/\"\u003eRenovations\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"5119\" href=\"https://www.dezeen.com/architecture/residential-architecture/\"\u003eResidential\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#83f3f1eaf5e2e0fac3e7e6f9e6e6edade0ecee\"\u003e\u003cspan data-cfemail=\"e393918a9582809aa387869986868dcd808c8e\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-27T11:30:06Z",
  "modifiedTime": "2024-11-27T11:51:25Z"
}
