{
  "id": "2b59239e-cb0e-41e2-868d-daa8e030f0bd",
  "title": "Fake it Till You Build it? The Pitfalls and Possibilities of Architectural Representation",
  "link": "https://architizer.com/blog/inspiration/stories/fake-it-till-you-build-it-the-pitfalls-of-architectural-representation/",
  "description": "In an AI-driven era, how can architects balance imagination with honest representation? The post Fake it Till You Build it? The Pitfalls and Possibilities of Architectural Representation appeared first on Journal.",
  "author": "Eirini Makarouni",
  "published": "Mon, 24 Mar 2025 15:01:32 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Inspiration",
    "Stories"
  ],
  "byline": "Eirini Makarouni",
  "length": 5772,
  "excerpt": "As AI blurs the line between fiction and reality, is it time for a new code of ethics in architectural visualization?",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "Architects: Want to have your project featured? Showcase your work by uploading projects to Architizer and sign up for our inspirational newsletters. At first, there were drawings, then photomontages and hand sketches, followed by renders, and now AI-generated visuals. The power of image in architectural representation has played an immense role in its dissemination, especially when it comes to addressing a non-architectural audience. From intricately detailed sections of cathedrals to comic-like imagery serving as critical statements and now with digital tools have become a game-changer in architectural visualization, and the perception of “unbuilt” buildings has evolved throughout time. Idealized renderings have long served as a powerful marketing tool, generating excitement for future projects but often leading to disappointment when the final built reality fails to live up to its visual promise. Especially with the emergence of AI, the distinction between truth versus fiction is now more pressing than ever, posing the ethical question of where is the line between inspiration and deception? Projects such as London’s Walkie-Talkie building or the Hamburg’s Elbphilharmonie for instance, both fell short of their visuals, facing immense criticism in terms of their environmental impact, cost overruns and contextual disassociation. Additionally, there have been various unfinished or abandoned mega-projects such as the Kingdom Tower in Saudi Arabia or the Ryugyong Hotel (or the Hotel of Doom) in North Korea that have caught the public eye through their stunning visualization but were never realized due to an array of economic, political and social factors. This inability for proper implementation, reveals how architectural representation can create unrealistic expectations, influencing public perception as well as investor confidence, thus raising ethical concerns about transparency in visualization. Still, what is acceptable in terms of embellishment? By tweaking light settings and adding greenery and people, renders immediately become more appealing. In parallel, by manipulating context, for example omitting surrounding building and removing real-world urban clutter or even providing misleading scale and proportions to spaces, can greatly influence the real-world expectation. Who should take responsibility for such misleading practices: The architect? The developer? The visual artist? What happens when renders do not align with cultural or environmental realities? And finally, if we take it a step further, could AI be used to fabricate entirely fictional projects, which are then presented as scams or speculative ventures? Even through digital visualization has been around for at least three decades, its ethical implications are somewhat covertly addressed. Due to its immense popularity and usefulness, digital imagery has become the bread and butter for architectural communication as well as its most powerful marketing tool. Nevertheless, there are possible strategies that can help untangle the confusion and perplexity of the CGI versus reality dilemma. Prod. Library by By Ferras Coulibaly / Rensselaer Polytechnic Institute, Vision Awards, 2023, Photorealistic Visualization, Student Winner For instance, an “honesty rating” system could be introduced, using phrases such as “conceptual,” “approved design” or “finalized construction phase”, thus providing a “metric” against the likely building outcome. Furthermore, mandatory disclaimers like “the added lighting effects, greenery and public activity are purely illustrative” as well as respecting and accurately representing the surrounding context, can help clarify what is real and what is fictional. Finally, by providing multiple levels of visualization and including not only idealized marketing images but also technical diagrams, material references as well as disclosing when AI tools are used to generate visuals, can offer a clearer understanding regarding the amount of automation involved in the production process. As technology continues to evolve, so does the need for greater ethical responsibility. Specifically, through clearer communications, architects can manage expectations and alleviate any disappointment that arises between what people expect and what is ultimately built. In fact, by utilizing other emerging technologies such as augmented reality (AR) or virtual reality (VR), people can experience a project in real-time rather than relying on static, stylized images. Cloud Peak Hotel above the Rainforest Mist by FTG Studio / Zhiwei Liu, Xianfang Liu, Vision Awards, 2023, AI Assisted Visualization, Special Mention Personally, I believe that the AI boom provides a unique opportunity to revisit the ethical implications of technology, creative expression and marketing. It challenges architects and designers to establish strong foundations of practices and a mindset that prioritizes transparency, accountability, and honesty in architectural representation. But perhaps this also leads to a broader question: should AI-enhanced renderings prompt us to rethink not only how we present architecture but also how we perceive and engage with the built environment? More broadly, has architecture become way too reliant on images, which in turn obstruct reality rather than enhancing our understanding of it? Are we prioritizing aesthetics over functionality, or spectacle over substance, leading to a built environment that often fails to live up to its visual promises? Architects: Want to have your project featured? Showcase your work by uploading projects to Architizer and sign up for our inspirational newsletters. Featured Image: Fusion of Eras by Drew Gilbert, Vision Awards, 2023, AI Assisted Visualization, Special Mention",
  "image": "https://blog.architizer.com/wp-content/uploads/LOMEXRendering_of_streetscape.tiff-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003e\u003cem\u003eArchitects: Want to have your project featured? Showcase your work by uploading projects to \u003ca href=\"http://architizer.com/register/\" target=\"_blank\" rel=\"noopener\"\u003eArchitizer\u003c/a\u003e and sign up for our \u003ca href=\"https://join.architizer.com/architizer-newsletter/\" target=\"_blank\" rel=\"noopener\"\u003einspirational newsletters\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAt first, there were drawings, then photomontages and hand sketches, followed by renders, and now AI-generated visuals. The power of image in architectural representation has played an immense role in its dissemination, especially when it comes to addressing a non-architectural audience.\u003c/p\u003e\n\u003cp\u003eFrom intricately detailed sections of cathedrals to comic-like imagery serving as critical statements and now with digital tools have become a game-changer in architectural visualization, and the perception of “unbuilt” buildings has evolved throughout time. Idealized renderings have long served as a powerful marketing tool, generating excitement for future projects but often leading to disappointment when the final built reality fails to live up to its visual promise. Especially with the emergence of AI, the distinction between truth versus fiction is now more pressing than ever, posing the ethical question of where is the line between inspiration and deception?\u003c/p\u003e\n\n\u003cp\u003eProjects such as London’s Walkie-Talkie building or the Hamburg’s Elbphilharmonie for instance, both fell short of their visuals, facing immense criticism in terms of their environmental impact, cost overruns and contextual disassociation. Additionally, there have been various unfinished or abandoned mega-projects such as the Kingdom Tower in Saudi Arabia or the Ryugyong Hotel (or the Hotel of Doom) in North Korea that have caught the public eye through their stunning visualization but were never realized due to an array of economic, political and social factors. This inability for proper implementation, reveals how architectural representation can create unrealistic expectations, influencing public perception as well as investor confidence, thus raising ethical concerns about transparency in visualization.\u003c/p\u003e\n\n\u003cp\u003eStill, what is acceptable in terms of embellishment? By tweaking light settings and adding greenery and people, renders immediately become more appealing. In parallel, by manipulating context, for example omitting surrounding building and removing real-world urban clutter or even providing misleading scale and proportions to spaces, can greatly influence the real-world expectation. Who should take responsibility for such misleading practices: The architect? The developer? The visual artist? What happens when renders do not align with cultural or environmental realities? And finally, if we take it a step further, could AI be used to fabricate entirely fictional projects, which are then presented as scams or speculative ventures?\u003c/p\u003e\n\u003cp\u003eEven through digital visualization has been around for at least three decades, its ethical implications are somewhat covertly addressed. Due to its immense popularity and usefulness, digital imagery has become the bread and butter for architectural communication as well as its most powerful marketing tool. Nevertheless, there are possible strategies that can help untangle the confusion and perplexity of the CGI versus reality dilemma.\u003c/p\u003e\n\u003cdiv id=\"attachment_200208\"\u003e\u003cp\u003e\u003cimg decoding=\"async\" aria-describedby=\"caption-attachment-200208\" src=\"https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg.png\" alt=\"CGI vs. Reality - article - architizer\" width=\"1680\" height=\"2520\" srcset=\"https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg.png 1680w, https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg-200x300.png 200w, https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg-683x1024.png 683w, https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg-768x1152.png 768w, https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg-1024x1536.png 1024w, https://blog.architizer.com/wp-content/uploads/55736-dWJDmuRGTP5UsSxv3VTXmD.jpg-1365x2048.png 1365w\" sizes=\"(max-width: 1680px) 100vw, 1680px\"/\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-200208\"\u003e\u003cem\u003eProd. Library by By Ferras Coulibaly / Rensselaer Polytechnic Institute, Vision Awards, 2023, Photorealistic Visualization, Student Winner\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eFor instance, an “honesty rating” system could be introduced, using phrases such as “conceptual,” “approved design” or “finalized construction phase”, thus providing a “metric” against the likely building outcome. Furthermore, mandatory disclaimers like “the added lighting effects, greenery and public activity are purely illustrative” as well as respecting and accurately representing the surrounding context, can help clarify what is real and what is fictional. Finally, by providing multiple levels of visualization and including not only idealized marketing images but also technical diagrams, material references as well as disclosing when AI tools are used to generate visuals, can offer a clearer understanding regarding the amount of automation involved in the production process.\u003c/p\u003e\n\u003cp\u003eAs technology continues to evolve, so does the need for greater ethical responsibility. Specifically, through clearer communications, architects can manage expectations and alleviate any disappointment that arises between what people expect and what is ultimately built. In fact, by utilizing other emerging technologies such as augmented reality (AR) or virtual reality (VR), people can experience a project in real-time rather than relying on static, stylized images.\u003c/p\u003e\n\u003cdiv id=\"attachment_200207\"\u003e\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-200207\" src=\"https://blog.architizer.com/wp-content/uploads/54801-WcxTa4zid3Urm98EcmCoQt.jpg\" alt=\"CGI vs. Reality - article - architizer\" width=\"777\" height=\"500\" srcset=\"https://blog.architizer.com/wp-content/uploads/54801-WcxTa4zid3Urm98EcmCoQt.jpg 777w, https://blog.architizer.com/wp-content/uploads/54801-WcxTa4zid3Urm98EcmCoQt-300x193.jpg 300w, https://blog.architizer.com/wp-content/uploads/54801-WcxTa4zid3Urm98EcmCoQt-768x494.jpg 768w, https://blog.architizer.com/wp-content/uploads/54801-WcxTa4zid3Urm98EcmCoQt-400x257.jpg 400w\" sizes=\"auto, (max-width: 777px) 100vw, 777px\"/\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-200207\"\u003e\u003cem\u003eCloud Peak Hotel above the Rainforest Mist by FTG Studio / Zhiwei Liu, Xianfang Liu, Vision Awards, 2023, AI Assisted Visualization, Special Mention\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003ePersonally, I believe that the AI boom provides a unique opportunity to revisit the ethical implications of technology, creative expression and marketing. It challenges architects and designers to establish strong foundations of practices and a mindset that prioritizes transparency, accountability, and honesty in architectural representation. But perhaps this also leads to a broader question: should AI-enhanced renderings prompt us to rethink not only how we present architecture but also how we perceive and engage with the built environment? More broadly, has architecture become way too reliant on images, which in turn obstruct reality rather than enhancing our understanding of it? Are we prioritizing aesthetics over functionality, or spectacle over substance, leading to a built environment that often fails to live up to its visual promises?\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eArchitects: Want to have your project featured? Showcase your work by uploading projects to \u003ca href=\"http://architizer.com/register/\" target=\"_blank\" rel=\"noopener\"\u003eArchitizer\u003c/a\u003e and sign up for our \u003ca href=\"https://join.architizer.com/architizer-newsletter/\" target=\"_blank\" rel=\"noopener\"\u003einspirational newsletters\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eFeatured Image: Fusion of Eras by Drew Gilbert, Vision Awards, 2023, AI Assisted Visualization, Special Mention\u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-24T15:01:32Z",
  "modifiedTime": "2025-03-24T19:44:00Z"
}
