{
  "id": "3a5d0b01-e214-4d88-9b29-fdbe254ce81e",
  "title": "Ten notable projects by 2025 Royal Gold Medal-winner SANAA",
  "link": "https://www.dezeen.com/2025/02/06/notable-projects-sanaa-riba-gold-medal/",
  "description": "Following the Royal Institute of British Architects' announcement that the founders of Japanese studio SANAA have won the 2025 Royal Gold Medal, we spotlight 10 of the duo's most interesting projects. Kazuyo Sejima and Ryue Nishizawa were named winners of this year's prestigious award for their extensive portfolio of work, which was praised by RIBA president The post Ten notable projects by 2025 Royal Gold Medal-winner SANAA appeared first on Dezeen.",
  "author": "Starr Charles",
  "published": "Thu, 06 Feb 2025 00:02:45 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "SANAA",
    "RIBA",
    "Ryue Nishizawa",
    "Royal Gold Medal",
    "Roundups",
    "Kazuyo Sejima"
  ],
  "byline": "Starr Charles",
  "length": 10271,
  "excerpt": "Following the announcement of SANAA as the 2025 RIBA Royal Gold Medal winner, we spotlight 10 of the studio's most interesting projects.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Following the Royal Institute of British Architects' announcement that the founders of Japanese studio SANAA have won the 2025 Royal Gold Medal, we spotlight 10 of the duo's most interesting projects. Kazuyo Sejima and Ryue Nishizawa were named winners of this year's prestigious award for their extensive portfolio of work, which was praised by RIBA president Muyiwa Oki for balancing \"functionality with profound elegance\". Since its establishment in 1995, Tokyo-based studio SANAA has become well-known for its cultural buildings around the world, often completed with white and transparent surfaces. Among the studio's key projects are the New Museum of Contemporary Art in New York, which is composed of a low-lying circular structure wrapped with glass, and the stepped Sydney Modern gallery in Australia. The award is the latest addition to the duo's collection of prestigious accolades, which also includes the 2010 Pritzker Architecture Prize, the 2022 Praemium Imperiale for architecture and the 2025 Le Prix Charlotte Perriand. \"We have always believed that architecture can transform and repair environments, helping us to relate to our surroundings, nature and each other,\" said SANAA. \"Throughout our careers we have tried to make spaces that bring people together, inviting them to imagine new ways of living and learning collectively.\" Read on for 10 notable projects by SANAA: Photo courtesy of SANAA21st Century Museum of Contemporary Art, Japan, 2004 Completed in 2004, the 21st Century Museum of Contemporary Art in Ishikawa Prefecture, Japan, consists of a low-lying circular structure wrapped with glass. Alongside its central art galleries, it hosts public spaces including a library, lecture hall and children's workshop. Photo by Dean KaufmanNew Museum of Contemporary Art, US, 2007 Composed of a set of stacked blocks, the eight-storey New Museum of Contemporary Art was completed in 2007 by SANAA alongside Gensler on a compact site in downtown Manhattan. Its shifting white volumes, which are wrapped in a layer of aluminium mesh, are designed to ensure each gallery receives natural daylight. Terraces run around the building's east and south facades. \"The New Museum is a combination of elegant and urban,\" SANAA said. \"We were determined to make a building that felt like that.\" Find out more about New Museum of Contemporary Art › Photo by Nick GuttridgeSerpentine Gallery Pavilion, UK, 2009 Sejima and Nishizawa used aluminium to construct the Serpentine Gallery Pavilion in 2009, which featured a reflective canopy intended to \"melt into the surroundings\". Raised by a network of thin columns, the sinuous canopy flowed across the site to create a sheltered space for visitors that wrapped around the neighbouring trees. \"The pavilion is floating aluminium, drifting freely between the trees like smoke,\" the duo said. \"It is a sheltered extension of the park where people can read, relax and enjoy lovely summer days.\" Find out more about the 2009 Serpentine Gallery Pavilion › Photo by Alain HerzogRolex Learning Center, Switzerland, 2010 The Rolex Learning Center, a university building for the Ecole Polytechnique Fédérale de Lausanne, was completed by the studio in 2010 in Switzerland. Open to both students and the public, the 20,000-square-metre centre houses social and study spaces, libraries, cafes and restaurants sheltered beneath an undulating roof. Find out more about Rolex Learning Center › Photo courtesy of SANAALouvre-Lens, France, 2012 An outpost of the Musée du Louvre, the Louvre-Lens was completed by SANAA alongside New York-based studio Imrey Culbert in northern France after the studios won a competition to design it in 2006. Completed in 2012, the 360-metre-long building comprises a series of rectangular volumes that transition from glazed to brushed aluminium exteriors and feature subtle curves. \"The project avoids the strict, rectilinear shapes that would have conflicted with the subtle character of the site, as well as of free shapes that would have been overly restrictive from the perspective of the museum’s internal operations,\" Kazuyo Sejima and Ryue Nishizawa said. Find out more about Louvre-Lens › Photo by Iwan BaanThe River, US, 2015 This sinuous structure built from glass, concrete, steel and wood was designed to frame public facilities, such as a library and youth centre, for Grace Farms – a 32-hectare nature reserve in New Canaan, Connecticut. Named The River, the structure's organic form was designed by Sejima and Nishizawa to fit into its natural surroundings, with its slender roof supported by thin, regularly spaced columns. Find out more about The River › Photo courtesy of SANAATsuruoka Cultural Center, Japan, 2018 Located in Tsuruoka, a city on Japan's northwest coast, this cultural centre is defined by its sweeping metal roofs designed to harmonise with a neighbouring historic building. The venue is designed as a civic hub, hosting a multipurpose hall for both cultural and artistic activities in the region. Photo courtesy of SANAABocconi School of Management, Italy, 2019 Perforated metal screens were used to cloak this curved cluster of volumes, designed by SANAA for Bocconi University in Milan. Interspersed by courtyards informed by Milanese palazzi, the project was designed to accommodate the Bocconi School of Management as well as a sports centre for the university. Find out more about Bocconi School of Management › Photo courtesy of SANAALa Samaritaine, France, 2021 The studio led the extensive renovation of the historic La Samaritaine department store in Paris in 2021, following the store's closure in 2005 over safety concerns. Commissioned by the owners, French luxury goods company LVMH, the renovation involved the addition of a new undulating glass facade as well as the restoration of many original art nouveau and art deco details. Find out more about La Samaritaine › Photo by Iwan BaanSydney Modern, Australia, 2022 A series of stepped pavilions make up Sydney Modern, an extension to the Art Gallery of New South Wales that SANAA opened in 2022. Situated on a hillside overlooking Sydney Harbour's Woolloomooloo Bay, the museum is arranged around a glass-walled atrium and was designed to contrast with the existing art gallery's neo-classical style. Find out more about Sydney Modern › Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2167518\" data-article-id=\"2167518\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-852x479.jpg\" alt=\"Aerial view of Sydney Modern by SANAA\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eFollowing the \u003ca href=\"https://www.dezeen.com/tag/riba/\"\u003eRoyal Institute of British Architects\u003c/a\u003e\u0026#39; announcement that the founders of Japanese studio \u003ca href=\"https://www.dezeen.com/tag/sanaa/\"\u003eSANAA\u003c/a\u003e have won the 2025 \u003ca href=\"https://www.dezeen.com/tag/royal-gold-medal/\"\u003eRoyal Gold Medal\u003c/a\u003e, we spotlight 10 of the duo\u0026#39;s most interesting projects.\u003cspan id=\"more-2167518\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/tag/kazuyo-sejima/\"\u003eKazuyo Sejima\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/tag/ryue-nishizawa/\"\u003eRyue Nishizawa\u003c/a\u003e were named winners of this year\u0026#39;s prestigious award for their extensive portfolio of work, which was praised by RIBA president \u003ca href=\"https://www.dezeen.com/tag/muyiwa-oki/\"\u003eMuyiwa Oki\u003c/a\u003e for balancing \u0026#34;functionality with profound elegance\u0026#34;.\u003c/p\u003e\n\u003cp\u003eSince its establishment in 1995, Tokyo-based studio SANAA has become well-known for its cultural buildings around the world, often completed with white and transparent surfaces.\u003c/p\u003e\n\u003cp\u003eAmong the studio\u0026#39;s key projects are the New Museum of Contemporary Art in New York, which is composed of a low-lying circular structure wrapped with glass, and the stepped Sydney Modern gallery in Australia.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eThe award is the latest addition to the duo\u0026#39;s collection of prestigious accolades, which also includes the \u003ca href=\"https://www.dezeen.com/2010/03/28/sanaa-win-pritzker-prize-2/\"\u003e2010 Pritzker Architecture Prize\u003c/a\u003e, the \u003ca href=\"https://www.dezeen.com/2022/09/15/sanaa-2022-praemium-imperiale-architecture-award/\"\u003e2022 Praemium Imperiale for architecture\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/09/09/kazuyo-sejima-ryue-nishizawa-sanaa-le-prix-charlotte-perriand-2025/\"\u003ethe 2025 Le Prix Charlotte Perriand\u003c/a\u003e.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;We have always believed that architecture can transform and repair environments, helping us to relate to our surroundings, nature and each other,\u0026#34; said \u003ca href=\"http://www.sanaa.co.jp/\"\u003eSANAA\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Throughout our careers we have tried to make spaces that bring people together, inviting them to imagine new ways of living and learning collectively.\u0026#34;\u003c/p\u003e\n\u003cp\u003eRead on for 10 notable projects by SANAA:\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2167594\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_0-852x587.jpg\" alt=\"21st Century Museum of Art\" width=\"2364\" height=\"1628\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_0-852x587.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_0-1704x1173.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2167594\"\u003ePhoto courtesy of SANAA\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003e21st Century Museum of Contemporary Art, Japan, 2004\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCompleted in 2004, the 21st Century Museum of Contemporary Art in Ishikawa Prefecture, Japan, consists of a low-lying circular structure wrapped with glass.\u003c/p\u003e\n\u003cp\u003eAlongside its central art galleries, it hosts public spaces including a library, lecture hall and children\u0026#39;s workshop.\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2167629\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-2_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2007/11/22/new-museum-of-contemporary-art-in-new-york-by-kazuyo-sejima-ryue-nishizawasanaa/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-2_dezeen_2364_col_0-852x644.jpg\" alt=\"New Museum by SANAA\" width=\"2364\" height=\"1786\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-2_dezeen_2364_col_0-852x644.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-2_dezeen_2364_col_0-1704x1287.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167629\"\u003ePhoto by Dean Kaufman\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2007/11/22/new-museum-of-contemporary-art-in-new-york-by-kazuyo-sejima-ryue-nishizawasanaa/\"\u003e\u003cstrong\u003eNew Museum of Contemporary Art, US, 2007\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eComposed of a set of stacked blocks, the eight-storey New Museum of Contemporary Art was completed in 2007 by SANAA alongside Gensler on a compact site in downtown Manhattan.\u003c/p\u003e\n\u003cp\u003eIts shifting white volumes, which are wrapped in a layer of aluminium mesh, are designed to ensure each gallery receives natural daylight. Terraces run around the building\u0026#39;s east and south facades.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The New Museum is a combination of elegant and urban,\u0026#34; SANAA said. \u0026#34;We were determined to make a building that felt like that.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2007/11/22/new-museum-of-contemporary-art-in-new-york-by-kazuyo-sejima-ryue-nishizawasanaa/\"\u003e\u003cem\u003eFind out more about New Museum of Contemporary Art ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2167854\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-serpentine-pavilion-2009_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2016/02/06/video-interview-serpentine-gallery-pavilion-2009-sanaa-kazuyo-sejima-ryue-nishizawa-movie/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-serpentine-pavilion-2009_dezeen_2364_col_0-852x479.jpg\" alt=\"Serpentine Pavilion 2009\" width=\"2364\" height=\"1328\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-serpentine-pavilion-2009_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-serpentine-pavilion-2009_dezeen_2364_col_0-1704x957.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167854\"\u003ePhoto by Nick Guttridge\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2016/02/06/video-interview-serpentine-gallery-pavilion-2009-sanaa-kazuyo-sejima-ryue-nishizawa-movie/\"\u003e\u003cstrong\u003eSerpentine Gallery Pavilion, UK, 2009\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSejima and Nishizawa used aluminium to construct the Serpentine Gallery Pavilion in 2009, which featured a reflective canopy intended to \u0026#34;melt into the surroundings\u0026#34;.\u003c/p\u003e\n\u003cp\u003eRaised by a network of thin columns, the sinuous canopy flowed across the site to create a sheltered space for visitors that wrapped around the neighbouring trees.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The pavilion is floating aluminium, drifting freely between the trees like smoke,\u0026#34; the duo said. \u0026#34;It is a sheltered extension of the park where people can read, relax and enjoy lovely summer days.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2016/02/06/video-interview-serpentine-gallery-pavilion-2009-sanaa-kazuyo-sejima-ryue-nishizawa-movie/\"\u003e\u003cem\u003eFind out more about the 2009 Serpentine Gallery Pavilion ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2167600\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_6.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2010/02/17/rolex-learning-center-by-sanaa/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_6-852x553.jpg\" alt=\"Rolex Learning Center by SANAA\" width=\"2364\" height=\"1534\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_6-852x553.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_6-1704x1106.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167600\"\u003ePhoto by Alain Herzog\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2010/02/17/rolex-learning-center-by-sanaa/\"\u003e\u003cstrong\u003eRolex Learning Center, Switzerland, 2010\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Rolex Learning Center, a university building for the Ecole Polytechnique Fédérale de Lausanne, was completed by the studio in 2010 in Switzerland.\u003c/p\u003e\n\u003cp\u003eOpen to both students and the public, the 20,000-square-metre centre houses social and study spaces, libraries, cafes and restaurants sheltered beneath an undulating roof.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2010/02/17/rolex-learning-center-by-sanaa/\"\u003e\u003cem\u003eFind out more about Rolex Learning Center ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2167630\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-3_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2010/02/17/rolex-learning-center-by-sanaa/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-3_dezeen_2364_col_0-852x479.jpg\" alt=\"Louvre Lens\" width=\"2364\" height=\"1330\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-3_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup-3_dezeen_2364_col_0-1704x959.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167630\"\u003ePhoto courtesy of SANAA\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2012/12/04/louvre-lens-by-sanaa-and-imrey-culbert/\"\u003e\u003cstrong\u003eLouvre-Lens, France, 2012\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAn outpost of the Musée du Louvre, the Louvre-Lens was completed by SANAA alongside New York-based studio Imrey Culbert in northern France after the studios won a competition to design it in 2006.\u003c/p\u003e\n\u003cp\u003eCompleted in 2012, the 360-metre-long building comprises a series of rectangular volumes that transition from glazed to brushed aluminium exteriors and feature subtle curves.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The project avoids the strict, rectilinear shapes that would have conflicted with the subtle character of the site, as well as of free shapes that would have been overly restrictive from the perspective of the museum’s internal operations,\u0026#34; Kazuyo Sejima and Ryue Nishizawa said.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2012/12/04/louvre-lens-by-sanaa-and-imrey-culbert/\"\u003e\u003cem\u003eFind out more about Louvre-Lens ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2167596\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_2.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2015/09/23/sanaa-river-inspired-building-grace-farms-nature-reserve-new-canaan-connecticut-usa/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_2-852x568.jpg\" alt=\"Grace Farms\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_2-852x568.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_2-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167596\"\u003ePhoto by Iwan Baan\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2015/09/23/sanaa-river-inspired-building-grace-farms-nature-reserve-new-canaan-connecticut-usa/\"\u003e\u003cstrong\u003eThe River, US, 2015\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThis sinuous structure built from glass, concrete, steel and wood was designed to frame public facilities, such as a library and youth centre, for Grace Farms – a 32-hectare nature reserve in New Canaan, Connecticut.\u003c/p\u003e\n\u003cp\u003eNamed The River, the structure\u0026#39;s organic form was designed by Sejima and Nishizawa to fit into its natural surroundings, with its slender roof supported by thin, regularly spaced columns.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2015/09/23/sanaa-river-inspired-building-grace-farms-nature-reserve-new-canaan-connecticut-usa/\"\u003e\u003cem\u003eFind out more about The River ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2167603\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_9.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_9-852x563.jpg\" alt=\"Tsuruoka Cultural Center by SANAA\" width=\"2364\" height=\"1561\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_9-852x563.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_9-1704x1125.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2167603\"\u003ePhoto courtesy of SANAA\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eTsuruoka Cultural Center, Japan, 2018\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLocated in Tsuruoka, a city on Japan\u0026#39;s northwest coast, this cultural centre is defined by its sweeping metal roofs designed to harmonise with a neighbouring historic building.\u003c/p\u003e\n\u003cp\u003eThe venue is designed as a civic hub, hosting a multipurpose hall for both cultural and artistic activities in the region.\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-7\" aria-describedby=\"caption-attachment-2167595\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_1.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2021/12/29/sanaa-bocconi-university-milan/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_1-852x524.jpg\" alt=\"Bocconi University Campus by SANAA\" width=\"2364\" height=\"1453\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_1-852x524.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_1-1704x1047.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167595\"\u003ePhoto courtesy of SANAA\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2021/12/29/sanaa-bocconi-university-milan/\"\u003e\u003cstrong\u003eBocconi School of Management, Italy, 2019\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePerforated metal screens were used to cloak this curved cluster of volumes, designed by SANAA for Bocconi University in Milan.\u003c/p\u003e\n\u003cp\u003eInterspersed by courtyards informed by Milanese palazzi, the project was designed to accommodate the Bocconi School of Management as well as a sports centre for the university.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2021/12/29/sanaa-bocconi-university-milan/\"\u003e\u003cem\u003eFind out more about Bocconi School of Management ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-8\" aria-describedby=\"caption-attachment-2167601\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_7.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2021/06/22/la-samaritaine-department-store-sanaa-opens-paris/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_7-852x564.jpg\" alt=\"La Samaritaine\" width=\"2364\" height=\"1566\" srcset=\"https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_7-852x564.jpg 1x, https://static.dezeen.com/uploads/2025/02/sanaa-project-roundup_dezeen_2364_col_7-1704x1129.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167601\"\u003ePhoto courtesy of SANAA\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2021/06/22/la-samaritaine-department-store-sanaa-opens-paris/\"\u003e\u003cstrong\u003eLa Samaritaine, France, 2021\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe studio led the extensive renovation of the historic La Samaritaine department store in Paris in 2021, following the store\u0026#39;s closure in 2005 over safety concerns.\u003c/p\u003e\n\u003cp\u003eCommissioned by the owners, French luxury goods company LVMH, the renovation involved the addition of a new undulating glass facade as well as the restoration of many original art nouveau and art deco details.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2021/06/22/la-samaritaine-department-store-sanaa-opens-paris/\"\u003e\u003cem\u003eFind out more about La Samaritaine ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-9\" aria-describedby=\"caption-attachment-1872155\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero.jpg\" data-orientation=\"landscape\"\u003e\u003ca href=\"https://www.dezeen.com/2022/11/29/sydney-modern-art-gallery-sanaa/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-852x479.jpg\" alt=\"Aerial view of Sydney Modern by SANAA\" width=\"2364\" height=\"1330\" srcset=\"https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2022/11/sydney-modern-sanaa-australia-architecture_dezeen_2364_hero-1704x959.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1872155\"\u003ePhoto by Iwan Baan\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/11/29/sydney-modern-art-gallery-sanaa/\"\u003e\u003cstrong\u003eSydney Modern, Australia, 2022\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eA series of stepped pavilions make up Sydney Modern, an extension to the Art Gallery of New South Wales that SANAA opened in 2022.\u003c/p\u003e\n\u003cp\u003eSituated on a hillside overlooking Sydney Harbour\u0026#39;s Woolloomooloo Bay, the museum is arranged around a glass-walled atrium and was designed to contrast with the existing art gallery\u0026#39;s neo-classical style.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/11/29/sydney-modern-art-gallery-sanaa/\"\u003e\u003cem\u003eFind out more about Sydney Modern ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#0a7a78637c6b69734a6e6f706f6f6424696567\"\u003e\u003cspan data-cfemail=\"e8989a819e898b91a88c8d928d8d86c68b8785\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-02-06T00:02:45Z",
  "modifiedTime": "2025-02-05T17:27:27Z"
}
