{
  "id": "477c4a3c-2ef7-4195-a099-eae786b45575",
  "title": "Inside a Highly Minimalist Spanish House",
  "link": "https://www.architecturaldigest.com/story/inside-a-highly-minimalist-spanish-house",
  "description": "While it may appear externally nondescript, Bea Aiguabella and Paul Antón’s home studio is anything but",
  "author": "Marina P. Asins",
  "published": "Sat, 22 Feb 2025 13:00:00 +0000",
  "source": "https://www.architecturaldigest.com/feed/rss",
  "categories": [
    "Architecture + Design / Architecture"
  ],
  "byline": "Marina P. Asins, Paco Marín",
  "length": 4557,
  "excerpt": "While it may appear externally nondescript, Bea Aiguabella and Paul Antón’s home studio is anything but",
  "siteName": "Architectural Digest",
  "favicon": "",
  "text": "In 2011, Marie Kondo’s The Life-Changing Magic of Tidying Up was published—and the world found a new guru. Kondo recommended that we keep only items that “spark joy.” With this approach, she wandered through her clients’ homes in her Netflix series, organizing their lives by guiding them through how to choose what to keep and what to discard. On a visit to the Spanish home of architects and artists Paul Antón and Bea Aiguabella, Kondo might not find much to work with—the couple already follows her precepts. “This probably comes to us from our academic training,” Antón says, and then he refers back to a much older advocate of restraint. “Adolf Loos already said it in his book when he equated ornament with crime, and we agree with him.”Paul Antón’s concrete Arkitekton 8 is to the right in this view of the living area. Four years ago, the couple, who have three children, decided to leave Madrid in search of a simpler lifestyle. “We wanted to get back to a way of life like we had in London where, after working, we’d return to our quiet neighborhood and enjoy its calm atmosphere,” they explain. They have now created their own sanctuary where they can disconnect in a smaller city outside of Madrid in a home that is typical of those in the region of Castille-La Mancha, with a tiled gable roof. “The house is so discreet that you don’t even notice it from the street,” they say about their minimalist home. The explain that the first time they saw it, it was clearly in need of some restoration, but at the same time they wanted to maintain its “humble and austere charm.”In the living room, a BKF chair, sofa and rug by Kave Home, and the TMM floor lamp is by Miguel Milá for Santa \u0026 Cole. On the wall, the collage 1 TON (2024) is by Bea Aiguabella. On a shelf above the staircase, a sculpture by Faustino Aizkorbe. Plaster, pale continuous flooring, and raw steel are elements in the palette of materials and textures of this house with a monastic air. The 4,300-square-foot plot includes a swimming pool and a lush sunken courtyard, where nature appears to have been given free rein. At the back of the house, the architects created an open-air kitchen and dining area, with the house itself to one side. It runs through the garden and has several large windows overlooking the green space. “The search for a house with outdoor space was motivated by our children. We learned that there are studies that conclude that the architecture of the home where you grow up shapes your character,” they say. Inside, a compact living room opens onto a large kitchen with an island, a principal bedroom with an en suite bathroom, a children’s bedroom, and a toilet.“The main idea of the project was for the kitchen to be the heart of the house, so we placed it in the center of the floor plan, inspired by the layout of a txoko [a large room traditionally used for dinners and celebrations],” explains Antón. The home’s circulation revolves around this space; in fact, to reach any room in the house you have to pass through it. “Everything happens around this part of the house. In Rodrigo Muñoz Avia’s memoir, La Casa de los Pintores, the author explains that his parents were constantly receiving guests. We wanted something similar and that our children would be involved in our social life as well.”The kitchen with a work by José Luis Sánchez on the wall and lighting by Prado. Art: José Luis SánchezThe principal bedroom with two photographs curated by Rosa Park. On the second floor, reached via staircase from the living room, there is another bedroom and a bathroom. “We preserved everything we could: The wooden beams have been restored and we reused the same tiles that were already there. The project has been a task of conservation and restoration,” they say. The house exudes the same sobriety as the works that the artists create in their studio (Anton+Aiguabella). Throughout the home, there are number of their own pieces, as well as others acquired over the years by artists José Luis Sánchez, Faustino Aizkorbe, and Ian Monroe, as well as from the gallerist Rosa Park. None of these works, not even the couple’s own, distract from with the restrained and simple architecture: “Beautiful works always have their place, no matter how small a house. They’ll always improve the aesthetics of a home, wherever you put them.”A view of the pool. “John Pawson, a master at creating courtyards and patios, was a large influence on this project,” Antón and Aiguabella say. This Spanish house was originally published in issue 202 of AD Spain.",
  "image": "https://media.architecturaldigest.com/photos/67aa6a92e263b031015f26c7/16:9/w_1280,c_limit/fachada%20ritmo%202.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn 2011, \u003ca href=\"https://www.architecturaldigest.com/story/how-to-marie-kondo-your-wfh-space-if-its-taken-over-your-living-room\" target=\"_blank\"\u003eMarie Kondo\u003c/a\u003e’s \u003cem\u003eThe Life-Changing Magic of Tidying Up\u003c/em\u003e was published—and the world found a new guru. Kondo recommended that we keep only items that “spark joy.” With this approach, she wandered through her clients’ homes in her Netflix series, organizing their lives by guiding them through how to choose what to keep and what to discard. On a visit to the Spanish home of architects and artists Paul Antón and Bea Aiguabella, Kondo might not find much to work with—the couple already follows her precepts. “This probably comes to us from our academic training,” Antón says, and then he refers back to a much older advocate of restraint. “Adolf Loos already said it in his book when he equated ornament with crime, and we agree with him.”\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003ePaul Antón’s concrete Arkitekton 8 is to the right in this view of the living area.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eFour years ago, the couple, who have three children, decided to leave \u003ca href=\"https://www.architecturaldigest.com/story/madrid-travel-guide\" target=\"_blank\"\u003eMadrid\u003c/a\u003e in search of a simpler lifestyle. “We wanted to get back to a way of life like we had in London where, after working, we’d return to our quiet neighborhood and enjoy its calm atmosphere,” they explain. They have now created their own sanctuary where they can disconnect in a smaller city outside of Madrid in a home that is typical of those in the region of Castille-La Mancha, with a tiled gable roof. “The house is so discreet that you don’t even notice it from the street,” they say about their minimalist home. The explain that the first time they saw it, it was clearly in need of some restoration, but at the same time they wanted to maintain its “humble and austere charm.”\u003c/p\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIn the living room, a BKF chair, sofa and rug by Kave Home, and the TMM floor lamp is by Miguel Milá for Santa \u0026amp; Cole. On the wall, the collage \u003cem\u003e1 TON\u003c/em\u003e (2024) is by Bea Aiguabella.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eOn a shelf above the staircase, a sculpture by Faustino Aizkorbe. Plaster, pale continuous flooring, and raw steel are elements in the palette of materials and textures of this house with a monastic air.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe 4,300-square-foot plot includes a swimming pool and a lush sunken courtyard, where nature appears to have been given free rein. At the back of the house, the architects created an open-air kitchen and dining area, with the house itself to one side. It runs through the garden and has several large windows overlooking the green space. “The search for a house with outdoor space was motivated by our children. We learned that there are studies that conclude that the architecture of the home where you grow up shapes your character,” they say. Inside, a compact living room opens onto a large kitchen with an island, a principal bedroom with an en suite bathroom, a children’s bedroom, and a toilet.\u003c/p\u003e\u003cp\u003e“The main idea of the project was for the kitchen to be the heart of the house, so we placed it in the center of the floor plan, inspired by the layout of a \u003cem\u003etxoko\u003c/em\u003e [a large room traditionally used for dinners and celebrations],” explains Antón. The home’s circulation revolves around this space; in fact, to reach any room in the house you have to pass through it. “Everything happens around this part of the house. In Rodrigo Muñoz Avia’s memoir, \u003cem\u003eLa Casa de los Pintores\u003c/em\u003e, the author explains that his parents were constantly receiving guests. We wanted something similar and that our children would be involved in our social life as well.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe kitchen with a work by José Luis Sánchez on the wall and lighting by Prado.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003eArt: José Luis Sánchez\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe principal bedroom with two photographs curated by Rosa Park.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eOn the second floor, reached via staircase from the living room, there is another bedroom and a bathroom. “We preserved everything we could: The wooden beams have been restored and we reused the same tiles that were already there. The project has been a task of conservation and restoration,” they say. The house exudes the same sobriety as the works that the artists create in their studio (\u003ca data-offer-url=\"https://www.antonaiguabella.com/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.antonaiguabella.com/\u0026#34;}\" href=\"https://www.antonaiguabella.com/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eAnton+Aiguabella\u003c/a\u003e). Throughout the home, there are number of their own pieces, as well as others acquired over the years by artists José Luis Sánchez, Faustino Aizkorbe, and Ian Monroe, as well as from the gallerist Rosa Park. None of these works, not even the couple’s own, distract from with the restrained and simple architecture: “Beautiful works always have their place, no matter how small a house. They’ll always improve the aesthetics of a home, wherever you put them.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA view of the pool. “John Pawson, a master at creating courtyards and patios, was a large influence on this project,” Antón and Aiguabella say.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003e\u003cem\u003eThis Spanish house was originally published in issue 202 of\u003c/em\u003e AD \u003cem\u003eSpain.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-22T08:00:00-05:00",
  "modifiedTime": "2025-02-22T13:00:00Z"
}
