{
  "id": "78bad4ab-634c-4eac-8eb1-e1e26123ac36",
  "title": "Will Gamble Architects adds \"unashamedly contemporary\" extension to English farmhouse",
  "link": "https://www.dezeen.com/2024/12/26/flint-farm-will-gamble-architects-extension/",
  "description": "British studio Will Gamble Architects has completed Flint Farm, a glass-lined extension to a farmhouse in North Hertfordshire that links to a renovated black barn. Named after its knapped flint plinth, the extension replaces low-quality structures that had been added over time to the Grade II-listed farmhouse near the village of Therfield. Will Gamble Architects The post Will Gamble Architects adds \"unashamedly contemporary\" extension to English farmhouse appeared first on Dezeen.",
  "author": "Ella Jessel",
  "published": "Thu, 26 Dec 2024 11:00:17 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "British houses",
    "Flint",
    "Barns",
    "Farmhouses",
    "Residential architecture and interiors",
    "Will Gamble Architects",
    "UK",
    "England",
    "Extensions",
    "Houses",
    "Renovations",
    "Residential extensions"
  ],
  "byline": "Ella Jessel",
  "length": 8494,
  "excerpt": "Will Gamble Architects has completed Flint Farm, a glass-lined extension to a farmhouse in North Hertfordshire that links to a renovated black barn.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "British studio Will Gamble Architects has completed Flint Farm, a glass-lined extension to a farmhouse in North Hertfordshire that links to a renovated black barn. Named after its knapped flint plinth, the extension replaces low-quality structures that had been added over time to the Grade II-listed farmhouse near the village of Therfield. Will Gamble Architects designed the low-lying side addition to provide more space for a growing young family while improving the house's \"maze\" of entrance rooms. Will Gamble Architects has extended a farmhouse in North HertfordshireThe Flint Farm extension contains a kitchen and dining area wrapped by floor-to-ceiling glass, lending it a contemporary look that contrasts with the existing architecture. However, a flint base that corresponds with the walls protecting the surrounding agricultural barns helps tie it in. Similarly, its roof, which is topped with a crown of dark angular steel, is formed of shallow peaks and troughs referencing the black timber-clad gables on the late 16th-century farmhouse. The extension has a flint base that nods to its surrounding walls\"The addition is unashamedly contemporary in appearance, to ensure that the farmhouse and the neighbouring outbuildings remain clearly legible,\" said project architect Miles Kelsey. While maximising space for the owner, the Flint Farm extension also improves the connection to an 18th-century agricultural barn next door. According to the studio, the barn had previously been \"crudely\" knocked through, undergone a number of haphazard repairs and used as a boiler room and clothes drying area. It contains a kitchen and dining roomSpotting the potential in the barn structure, Will Gamble Architects revamped it with a new entrance and informal living area, exposing its historic timber framing. A contemporary picture window has also been added to frame a view of the garden. Outside, the black timber cladding and clay tiles of the barn were removed, refurbished and reinstalled to help thermally upgrade the building, while its irregular roof pitch and uneven eaves were restored to retain its character. With pink-painted lime render walls, the main farmhouse dates back to the late 16th century but had been altered over time with additions such as a single-storey extension and an unplasticised polyvinyl chloride (UPVC) conservatory on its northern flank. Will Gamble Architects was originally hired by the current owner to replace the dated conservatory and create an extension of a similar size, but the studio encouraged the client to focus on better integrating the black barn by replacing the old single-storey extension on its eastern side instead. Will Gamble Architects aimed to simplify the home's layout\"We were able to convince them of the underlying potential of the barn and to locate the new extension on the side of the property, replacing the 20th-century element, and creating a more meaningful link between the barn and main house to allow it become part of the primary living spaces of the home,\" said Kelsey. Positioning the extension at this location also allowed the studio to design a new double-height entrance to the home with an oak staircase that has slender steel spindles. It sits beside an existing reception room in the original farmhouse, with links to the more private areas including a snug, study, kid's bedrooms and main bedroom. An existing barn was restored and linked to the extensionWill Gamble Architects sought to create \"tactile\" interiors for Flint Farm, defined by texture and pattern that echo the old farmyard. This includes polished concrete, blackened timber, natural oak and exposed structural elements, as well as touches of marble and terracotta. Given the farmhouse's heritage status, the project had a lengthy planning process, but Kelsey said it also threw up a few interesting surprises such as a historic well that the studio turned into a patio feature. \"We were spoilt for choice on areas that could be revealed,\" he said. The barn was originally built in the 18th centuryWill Gamble Architects was founded by architect Will Gamble in London in 2018. Its other residential projects include The Parchment Works, a house extension built inside ruined stone walls, and Palm Springs, a home in London that draws on desert modernism. The photography is by Johan Dehlin. Read more: British houses Flint Barns Farmhouses Residential architecture and interiors Will Gamble Architects UK England Extensions Houses Renovations Residential extensions Architecture Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/12/hero-flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2153616\" data-article-id=\"2153616\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/hero-flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_10.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/12/hero-flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_10-852x479.jpg\" alt=\"Flint Farm extension by Will Gamble Architects\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/12/hero-flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_10-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/12/hero-flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_10-1704x959.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/hero-flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_10-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eBritish studio \u003ca href=\"https://www.dezeen.com/tag/will-gamble-architects/\"\u003eWill Gamble Architects\u003c/a\u003e has completed Flint Farm, a glass-lined \u003ca href=\"https://www.dezeen.com/tag/extensions/\"\u003eextension\u003c/a\u003e to a \u003ca href=\"https://www.dezeen.com/tag/farmhouses/\"\u003efarmhouse\u003c/a\u003e in North Hertfordshire that links to a renovated black \u003ca href=\"https://www.dezeen.com/tag/barns/\"\u003ebarn\u003c/a\u003e.\u003cspan id=\"more-2153616\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNamed after its knapped flint plinth, the extension replaces low-quality structures that had been added over time to the Grade II-listed farmhouse near the village of Therfield.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.willgamblearchitects.com/\"\u003eWill Gamble Architects\u003c/a\u003e designed the low-lying side addition to provide more space for a growing young family while improving the house\u0026#39;s \u0026#34;maze\u0026#34; of entrance rooms.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2153949\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_2.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_2-852x682.jpg\" alt=\"Flint Farm by Will Gamble Architects\" width=\"2364\" height=\"1891\" srcset=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_2-852x682.jpg 1x, https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_2-1704x1363.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_2-852x682.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2153949\"\u003eWill Gamble Architects has extended a farmhouse in North Hertfordshire\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe Flint Farm extension contains a kitchen and dining area wrapped by floor-to-ceiling glass, lending it a contemporary look that contrasts with the existing architecture.\u003c/p\u003e\n\u003cp\u003eHowever, a flint base that corresponds with the walls protecting the surrounding agricultural barns helps tie it in.\u003c/p\u003e\n\n\n\u003cp\u003eSimilarly, its roof, which is topped with a crown of dark angular steel, is formed of shallow peaks and troughs referencing the black timber-clad gables on the late 16th-century farmhouse.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2153960\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_12-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_12-852x1065.jpg\" alt=\"Flint-lined extension\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_12-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_12-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_12-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2153960\"\u003eThe extension has a flint base that nods to its surrounding walls\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The addition is unashamedly contemporary in appearance, to ensure that the farmhouse and the neighbouring outbuildings remain clearly legible,\u0026#34; said project architect Miles Kelsey.\u003c/p\u003e\n\u003cp\u003eWhile maximising space for the owner, the Flint Farm extension also improves the connection to an 18th-century agricultural barn next door.\u003c/p\u003e\n\u003cp\u003eAccording to the studio, the barn had previously been \u0026#34;crudely\u0026#34; knocked through, undergone a number of haphazard repairs and used as a boiler room and clothes drying area.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2153953\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_5.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_5-852x682.jpg\" alt=\"Kitchen at Flint Farm extension by Will Gamble Architects\" width=\"2364\" height=\"1891\" srcset=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_5-852x682.jpg 1x, https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_5-1704x1363.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_5-852x682.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2153953\"\u003eIt contains a kitchen and dining room\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSpotting the potential in the barn structure, Will Gamble Architects revamped it with a new entrance and informal living area, exposing its historic timber framing. A contemporary picture window has also been added to frame a view of the garden.\u003c/p\u003e\n\u003cp\u003eOutside, the black timber cladding and clay tiles of the barn were removed, refurbished and reinstalled to help thermally upgrade the building, while its irregular roof pitch and uneven eaves were restored to retain its character.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eWith pink-painted lime render walls, the main farmhouse dates back to the late 16th century but had been altered over time with additions such as a single-storey extension and an unplasticised polyvinyl chloride (UPVC) conservatory on its northern flank.\u003c/p\u003e\n\u003cp\u003eWill Gamble Architects was originally hired by the current owner to replace the dated conservatory and create an extension of a similar size, but the studio encouraged the client to focus on better integrating the black barn by replacing the old single-storey extension on its eastern side instead.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2153954\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_6-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_6-852x1065.jpg\" alt=\"Interior of residential extension by Will Gamble Architects\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_6-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_6-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_6-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2153954\"\u003eWill Gamble Architects aimed to simplify the home\u0026#39;s layout\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;We were able to convince them of the underlying potential of the barn and to locate the new extension on the side of the property, replacing the 20th-century element, and creating a more meaningful link between the barn and main house to allow it become part of the primary living spaces of the home,\u0026#34; said Kelsey.\u003c/p\u003e\n\u003cp\u003ePositioning the extension at this location also allowed the studio to design a new double-height entrance to the home with an oak staircase that has slender steel spindles.\u003c/p\u003e\n\u003cp\u003eIt sits beside an existing reception room in the original farmhouse, with links to the more private areas including a snug, study, kid\u0026#39;s bedrooms and main bedroom.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2153957\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_8-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_8-852x1065.jpg\" alt=\"Interior of a farmhouse renovation\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_8-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_8-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_8-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2153957\"\u003eAn existing barn was restored and linked to the extension\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWill Gamble Architects sought to create \u0026#34;tactile\u0026#34; interiors for Flint Farm, defined by texture and pattern that echo the old farmyard. This includes polished concrete, blackened timber, natural oak and exposed structural elements, as well as touches of marble and terracotta.\u003c/p\u003e\n\u003cp\u003eGiven the farmhouse\u0026#39;s heritage status, the project had a lengthy planning process, but Kelsey said it also threw up a few interesting surprises such as a historic well that the studio turned into a patio feature.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We were spoilt for choice on areas that could be revealed,\u0026#34; he said.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2153967\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_18-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_18-852x1193.jpg\" alt=\"Barn renovation by Will Gamble Architects\" width=\"1688\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_18-852x1193.jpg 1x, https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_18-1704x2386.jpg 2x\" sizes=\"(max-width: 1688px) 100vw, 1688px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/flint-farm-will-gamble-architects-england-farmhouse-extension_dezeen_2364_col_18-852x1193.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2153967\"\u003eThe barn was originally built in the 18th century\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWill Gamble Architects was founded by architect Will Gamble in London in 2018.\u003c/p\u003e\n\u003cp\u003eIts other residential projects include The Parchment Works, \u003ca href=\"https://www.dezeen.com/2020/03/31/the-parchment-works-house-extension-will-gamble-architects/\"\u003ea house extension built inside ruined stone walls\u003c/a\u003e, and Palm Springs, \u003ca href=\"https://www.dezeen.com/2023/12/12/will-gamble-architects-palm-springs-extension/\"\u003ea home in London that draws on desert modernism\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.johandehlin.com/\"\u003eJohan Dehlin\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"8404\" href=\"https://www.dezeen.com/tag/british-houses/\"\u003eBritish houses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"12164\" href=\"https://www.dezeen.com/tag/flint/\"\u003eFlint\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"13158\" href=\"https://www.dezeen.com/tag/barns/\"\u003eBarns\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"13371\" href=\"https://www.dezeen.com/tag/farmhouses/\"\u003eFarmhouses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"273\" href=\"https://www.dezeen.com/tag/residential/\"\u003eResidential architecture and interiors\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"17166\" href=\"https://www.dezeen.com/tag/will-gamble-architects/\"\u003eWill Gamble Architects\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"80\" href=\"https://www.dezeen.com/tag/uk/\"\u003eUK\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3210\" href=\"https://www.dezeen.com/tag/england/\"\u003eEngland\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3348\" href=\"https://www.dezeen.com/tag/extensions/\"\u003eExtensions\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3353\" href=\"https://www.dezeen.com/tag/houses/\"\u003eHouses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"5133\" href=\"https://www.dezeen.com/tag/renovations/\"\u003eRenovations\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"5432\" href=\"https://www.dezeen.com/tag/residential-extensions/\"\u003eResidential extensions\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#4e3e3c27382f2d370e2a2b342b2b20602d2123\"\u003e\u003cspan data-cfemail=\"79090b100f181a00391d1c031c1c17571a1614\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-26T11:00:17Z",
  "modifiedTime": "2024-12-19T16:40:24Z"
}
