{
  "id": "8b0192e1-9844-4b93-a46a-1ca123f7663d",
  "title": "Dezeen Debate features \"extraordinarily thoughtful solution to multifamily housing\"",
  "link": "https://www.dezeen.com/2024/12/03/peris-toral-riba-international-prize-2024-dezeen-debate/",
  "description": "The latest edition of our Dezeen Debate newsletter features the winner of this year's RIBA International Prize. Subscribe to Dezeen Debate now. A social housing project in Barcelona, designed by Peris + Toral Arquitectes, has been awarded this year's RIBA International Prize. The announcement sparked debate among readers, with one saying it \"demonstrates an extraordinarily The post Dezeen Debate features \"extraordinarily thoughtful solution to multifamily housing\" appeared first on Dezeen.",
  "author": "Saudatu Bah",
  "published": "Tue, 03 Dec 2024 19:00:22 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "Peris + Toral Arquitectes",
    "Spain",
    "Barcelona",
    "RIBA",
    "Dezeen Debate",
    "Social housing"
  ],
  "byline": "Saudatu Bah",
  "length": 5006,
  "excerpt": "The latest edition of our Dezeen Debate newsletter features the winner of this year's RIBA International Prize. Subscribe to Dezeen Debate now.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "The latest edition of our Dezeen Debate newsletter features the winner of this year's RIBA International Prize. Subscribe to Dezeen Debate now. A social housing project in Barcelona, designed by Peris + Toral Arquitectes, has been awarded this year's RIBA International Prize. The announcement sparked debate among readers, with one saying it \"demonstrates an extraordinarily thoughtful solution to multifamily housing\".  Another argued that it \"only won the award solely because of its social housing\". Audi ditches four-ring logo for Chinese electric car rangeOther stories in this week's newsletter that fired up the comments section included Audi's visual identity for its new Chinese EV brand, a mobile child's bedroom made of construction waste by Spanish studio Takk and a pair of Christmas trees made from timber furniture components by Kengo Kuma. Dezeen Debate Dezeen Debate is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Read the latest edition of Dezeen Debate or subscribe here. You can also subscribe to our other newsletters; Dezeen Agenda is sent every Tuesday containing a selection of the most important news highlights from the week, Dezeen Daily is our daily bulletin that contains every story published in the preceding 24 hours and Dezeen In Depth is sent on the last Friday of every month and delves deeper into the major stories shaping architecture and design. Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/12/modulus-matrix-riba-international-prize-2024_dezeen_2364_hero_1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2148892\" data-article-id=\"2148892\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/modulus-matrix-riba-international-prize-2024_dezeen_2364_hero_1.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"480\" src=\"https://static.dezeen.com/uploads/2024/12/modulus-matrix-riba-international-prize-2024_dezeen_2364_hero_1-852x480.jpg\" alt=\"Social housing in Barcelona\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/12/modulus-matrix-riba-international-prize-2024_dezeen_2364_hero_1-852x480.jpg 1x, https://static.dezeen.com/uploads/2024/12/modulus-matrix-riba-international-prize-2024_dezeen_2364_hero_1.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/modulus-matrix-riba-international-prize-2024_dezeen_2364_hero_1-852x480.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eThe \u003ca href=\"https://newsletter.dezeen.com/t/r-B97F4F7084B99B972540EF23F30FEDED\"\u003elatest edition of our Dezeen Debate newsletter\u003c/a\u003e features the \u003ca href=\"https://www.dezeen.com/2024/11/27/peris-toral-riba-international-prize-2024/\"\u003ewinner of this year\u0026#39;s RIBA International Prize\u003c/a\u003e. \u003ca href=\"https://www.dezeen.com/newsletters/\"\u003eSubscribe to Dezeen Debate now\u003c/a\u003e.\u003cspan id=\"more-2148892\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eA \u003ca href=\"https://www.dezeen.com/tag/social-housing/\"\u003esocial housing\u003c/a\u003e project in \u003ca href=\"https://www.dezeen.com/tag/barcelona/\"\u003eBarcelona\u003c/a\u003e, designed by \u003ca href=\"https://www.dezeen.com/tag/peris-toral-arquitectes/\"\u003ePeris + Toral Arquitectes\u003c/a\u003e, has been awarded this year\u0026#39;s \u003ca href=\"https://www.dezeen.com/tag/riba-international-prize/\"\u003eRIBA International Prize\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe announcement sparked debate among readers, with one saying it \u0026#34;demonstrates an extraordinarily thoughtful solution to multifamily housing\u0026#34;.  Another argued that it \u0026#34;only won the award solely because of its social housing\u0026#34;.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2147000\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/audi-audi-e-concept-branding_dezeen_2364_col_4-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/audi-audi-e-concept-branding_dezeen_2364_col_4-852x1136.jpg\" alt=\"Audi concept branding\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/audi-audi-e-concept-branding_dezeen_2364_col_4-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/11/audi-audi-e-concept-branding_dezeen_2364_col_4-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/audi-audi-e-concept-branding_dezeen_2364_col_4-852x1136.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2147000\"\u003e\u003ca href=\"https://www.dezeen.com/2024/11/28/audi-saic-electric-car-brand-china/\"\u003eAudi ditches four-ring logo for Chinese electric car range\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOther stories in this week\u0026#39;s newsletter that fired up the comments section included \u003ca href=\"https://www.dezeen.com/2024/11/28/audi-saic-electric-car-brand-china/\"\u003eAudi\u0026#39;s visual identity for its new Chinese EV brand\u003c/a\u003e, a \u003ca href=\"https://www.dezeen.com/2024/11/29/takk-mobile-childs-bedroom-construction-waste/\"\u003emobile child\u0026#39;s bedroom made of construction waste by Spanish studio Takk\u003c/a\u003e and a \u003ca href=\"https://www.dezeen.com/2024/11/28/kengo-kuma-christmas-trees/\"\u003epair of Christmas trees made from timber furniture components by Kengo Kuma\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eDezeen Debate\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.dezeen.com/tag/dezeen-debate/\"\u003eDezeen Debate\u003c/a\u003e is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. \u003ca href=\"https://newsletter.dezeen.com/t/r-B97F4F7084B99B972540EF23F30FEDED\"\u003eRead the latest edition of Dezeen Debate\u003c/a\u003e or \u003ca href=\"https://www.dezeen.com/newsletters/\"\u003esubscribe here\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eYou can also subscribe to our other newsletters; \u003ca href=\"https://www.dezeen.com/dezeenagenda/\"\u003eDezeen Agenda\u003c/a\u003e is sent every Tuesday containing a selection of the most important news highlights from the week, \u003ca href=\"https://www.dezeen.com/dezeendaily/\"\u003eDezeen Daily\u003c/a\u003e is our daily bulletin that contains every story published in the preceding 24 hours and \u003ca href=\"https://www.dezeen.com/dezeenindepth/\"\u003eDezeen In Depth\u003c/a\u003e is sent on the last Friday of every month and delves deeper into the major stories shaping architecture and design.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#0b7b79627d6a68724b6f6e716e6e6525686466\"\u003e\u003cspan data-cfemail=\"e595978c9384869ca581809f80808bcb868a88\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-03T19:00:22Z",
  "modifiedTime": "2024-12-03T15:39:41Z"
}
