{
  "id": "8c74203b-0f03-4cae-9cb5-6f4d739c38ae",
  "title": "Vessel reopens in Hudson Yards with steel mesh netting",
  "link": "https://www.archpaper.com/2024/10/vessel-reopens-steel-mesh-netting/",
  "description": "Psychologists have said that, in order to move past tragedy, “closure requires opening up.” After years of openings and tragic closings, the Vessel at Hudson Yards has done just that. The post Vessel reopens in Hudson Yards with steel mesh netting appeared first on The Architect’s Newspaper.",
  "author": "Kristine Klein",
  "published": "Mon, 21 Oct 2024 20:55:29 +0000",
  "source": "https://archpaper.com/feed",
  "categories": [
    "Architecture",
    "East",
    "News",
    "Heatherwick Studio",
    "Hudson Yards",
    "Manhattan"
  ],
  "byline": "Kristine Klein",
  "length": 3343,
  "excerpt": "The Vessel designed by Heatherwick Studio reopened to the public this week after it closed in 2021 because of four suicides. Steel mesh netting has been installed across the upper levels of the structure.",
  "siteName": "The Architect’s Newspaper",
  "favicon": "https://www.archpaper.com/images/AN_favicon_64.png",
  "text": "“Closure requires opening up” By •October 21, 2024 • Architecture, East, News Psychologists have said that, in order to move past tragedy, “closure requires opening up.” After years of openings and tragic closings, the Vessel at Hudson Yards has done just that. The 150-foot-tall lookout spot by Heatherwick Studio reopened to the public this week equipped with new suicide-prevention apparatus. Public access to the 15 stories of staircase has been limited since 2021, following four incidents that saw individuals jump over the railings and fall to their deaths. It had previously closed temporarily in early 2021 after a third death. In a statement this week, Jeff T. Blau, the Related CEO said, “Not a day goes by that we don’t have visitors walking up to our staff asking where they can buy tickets and when it will reopen. That interest hasn’t diminished during the time we’ve been closed and we’re excited to welcome guests from all around the world back to Vessel with additional safety measures in place.” Since the Vessel opened in 2019, the ziggurat of steps and landings has been a social media sensation, and a viral talking point. It’s drawn headlines in the architecture press; critics from all over have drawn their  own comparisons for its distinctive design—some say it looks like a shawarma, others a stairs to nowhere, and an egg crate, just to name a few favorites. But the Vessel repeatedly returned to the news cycle under tragic and unfortunate headlines. Related Companies, the Vessel’s developer, and the larger Hudson Yards site it occupies, first announced in April it planned to reopen the structure later this year with new safety measures. These new installments take the form of floor-to-ceiling steel mesh barriers at several of the upper levels. The top floor of the Vessel remains off limits to the public. A video shared on X by New York City Kopp, a local photographer, shows what the netting looks like up-close. Similar to the honeycomb-like cells that form the Vessel’s distinctive pattern and massing, the shape of the installed netting is also hexagonal. The new mesh is wide enough to allow visitors to see views of adjacent buildings at Hudson Yards with minimal disruption, as well as the arguably more underwhelming, unmemorable view of the Weehaken, New Jersey skyline directly across the Hudson River. A long-awaited return for a New York City attraction: the Vessel at Hudson Yards reopens TODAY after more than three years. pic.twitter.com/gOiPI7Sl4N — NewYorkCityKopp (@newyorkcitykopp) October 21, 2024 These new architectural adaptations follow prior suicide prevention measures taken on the site that banned visitors from climbing up solo. Previous measures also included a $10 entrance fee to be used for “safety enhancements including tripling our staff and security and increased staff training” as well as signage displaying positive messaging and information from the National Suicide Prevention Lifeline. A ticketing system remains in place. If you are having thoughts of suicide, the National Suicide Prevention Lifeline can be reached 24/7 at 800-273-8255, or go to SpeakingOfSuicide.com/resources.",
  "image": "https://www.archpaper.com/wp-content/uploads/2024/10/bernd-dittrich-vessel-unsplash.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                    \u003ch2\u003e“Closure requires opening up”\u003c/h2\u003e\n        \n          \u003cdiv\u003e\n                  \u003cp\u003e\u003cspan\u003eBy\u003c/span\u003e\n                      \u003cspan\u003e•\u003c/span\u003e\u003c/p\u003e\u003cdate\u003e\u003ctime datetime=\"2024-10-21T16:55:29-04:00\"\u003eOctober 21, 2024\u003c/time\u003e\u003c/date\u003e\n          \u003cp\u003e\u003cspan\u003e•\u003c/span\u003e\n          \n          \n                      \u003cspan\u003e\n                    \u003ca href=\"https://www.archpaper.com/category/subject/architecture/\"\u003eArchitecture\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/category/region/east/\"\u003eEast\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/category/type/news/\"\u003eNews\u003c/a\u003e                \u003c/span\u003e\n            \u003c/p\u003e\u003c/div\u003e\n  \u003c/div\u003e\u003cdiv\u003e\n            \u003cp\u003ePsychologists have said that, in order to move past tragedy, “\u003ca href=\"https://www.psychologytoday.com/intl/blog/passion/202408/the-truth-about-getting-closure#:~:text=Closure%20requires%20opening%20up.,suffering%20once%20and%20for%20all.\"\u003eclosure requires opening up\u003c/a\u003e.” After years of openings and tragic closings, the Vessel at \u003ca href=\"https://www.archpaper.com/tag/hudson-yards/\"\u003eHudson Yards\u003c/a\u003e has done just that. The 150-foot-tall lookout spot by \u003ca href=\"https://www.archpaper.com/tag/heatherwick-studio/\"\u003eHeatherwick Studio\u003c/a\u003e reopened to the public this week equipped with new suicide-prevention apparatus.\u003c/p\u003e\n\n\u003cp\u003ePublic access to the 15 stories of staircase has been limited since 2021, following four \u003ca href=\"https://www.archpaper.com/2020/12/woman-jumps-to-her-death-from-the-vessel-at-hudson-yards/\"\u003eincidents that saw individuals jump over the railings and fall to their deaths\u003c/a\u003e. It had \u003ca href=\"https://www.archpaper.com/2021/01/vessel-at-hudson-yards-shuttered-indefinitely-following-third-suicide/\"\u003epreviously closed temporarily\u003c/a\u003e in early 2021 after a third death.\u003c/p\u003e\n\u003cp\u003eIn a statement this week, Jeff T. Blau, the Related CEO \u003ca href=\"https://apnews.com/article/vessel-hudson-yards-new-york-ab9b02282754db2d3d308fd87df54ecd\"\u003esaid\u003c/a\u003e, “Not a day goes by that we don’t have visitors walking up to our staff asking where they can buy tickets and when it will reopen. That interest hasn’t diminished during the time we’ve been closed and we’re excited to welcome guests from all around the world back to Vessel with additional safety measures in place.”\u003c/p\u003e\n\u003cp\u003eSince the Vessel opened in 2019, the ziggurat of steps and landings has been a social media sensation, and a viral talking point. It’s drawn headlines in the architecture press; critics from all over have drawn their  \u003ca href=\"https://www.archpaper.com/2019/03/vessel-critics/\"\u003eown comparisons\u003c/a\u003e for its distinctive design—some say it looks like a shawarma, others a stairs to nowhere, and an egg crate, just to name a few favorites. But the Vessel repeatedly returned to the news cycle \u003ca href=\"https://www.archpaper.com/2021/07/a-fourth-person-has-jumped-from-vessel-at-hudson-yards/\"\u003eunder tragic and unfortunate headlines\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eRelated Companies, the Vessel’s developer, and the larger Hudson Yards site it occupies, first \u003ca href=\"https://www.archpaper.com/2024/04/the-vessel-reopen-hudson-yards-safety-nets/\"\u003eannounced in April\u003c/a\u003e it planned to reopen the structure later this year with new safety measures. These new installments take the form of floor-to-ceiling steel mesh barriers at several of the upper levels. The top floor of the Vessel remains off limits to the public.\u003c/p\u003e\n\u003cp\u003eA \u003ca href=\"https://x.com/newyorkcitykopp/status/1848375207586595141\"\u003evideo shared on X\u003c/a\u003e by \u003ca href=\"https://x.com/newyorkcitykopp\"\u003eNew York City Kopp\u003c/a\u003e, a local photographer, shows what the netting looks like up-close. Similar to the honeycomb-like cells that form the Vessel’s distinctive pattern and massing, the shape of the installed netting is also hexagonal.\u003c/p\u003e\n\u003cp\u003eThe new mesh is wide enough to allow visitors to see views of adjacent buildings at Hudson Yards with minimal disruption, as well as the arguably more underwhelming, unmemorable view of the Weehaken, New Jersey skyline directly across the Hudson River.\u003c/p\u003e\n\u003cblockquote data-media-max-width=\"560\"\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eA long-awaited return for a New York City attraction: the Vessel at Hudson Yards reopens TODAY after more than three years. \u003ca href=\"https://t.co/gOiPI7Sl4N\"\u003epic.twitter.com/gOiPI7Sl4N\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— NewYorkCityKopp (@newyorkcitykopp) \u003ca href=\"https://twitter.com/newyorkcitykopp/status/1848375207586595141?ref_src=twsrc%5Etfw\"\u003eOctober 21, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cbr/\u003e\nThese new \u003ca href=\"https://www.archpaper.com/2021/07/a-fourth-person-has-jumped-from-vessel-at-hudson-yards/\"\u003earchitectural adaptations follow prior suicide prevention measures\u003c/a\u003e taken on the site that banned visitors from climbing up solo. Previous measures also included a $10 entrance fee to be used for “safety enhancements including tripling our staff and security and increased staff training” as well as signage displaying positive messaging and information from the National Suicide Prevention Lifeline. A ticketing system remains in place.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIf you are having thoughts of suicide, the National Suicide Prevention Lifeline can be reached 24/7 at 800-273-8255, or go to \u003ca title=\"\" href=\"http://speakingofsuicide.com/resources\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cem\u003eSpeakingOfSuicide.com/resources\u003c/em\u003e\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-21T20:55:29Z",
  "modifiedTime": null
}
