{
  "id": "8c87f40f-7c42-41c4-9e9b-165896a67fa8",
  "title": "Studio Gang places mass-timber buildings around concrete terrace in California",
  "link": "https://www.dezeen.com/2024/11/08/studio-gang-california-college-arts-university-extension-eccentric-mass-timber-structure/",
  "description": "Architecture studio Studio Gang has completed an expansive extension at the California College of the Arts San Francisco campus, which includes exposed bracing and a concrete terrace. The 82,305 square foot (7,646 square metre) addition extends outwards from the college's main academic building and consists of buildings and courtyards encased in a large, elevated concrete The post Studio Gang places mass-timber buildings around concrete terrace in California appeared first on Dezeen.",
  "author": "Ellen Eberhardt",
  "published": "Fri, 08 Nov 2024 18:00:53 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "Education",
    "California",
    "Mass timber",
    "San Francisco",
    "Studio Gang",
    "USA"
  ],
  "byline": "Ellen Eberhardt",
  "length": 7951,
  "excerpt": "Studio Gang has completed an expansive extension at the CCA San Francisco campus, which includes exposed bracing and a large elevated concrete terrace",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Architecture studio Studio Gang has completed an expansive extension at the California College of the Arts San Francisco campus, which includes exposed bracing and a concrete terrace. The 82,305 square foot (7,646 square metre) addition extends outwards from the college's main academic building and consists of buildings and courtyards encased in a large, elevated concrete terrace. Studio Gang has completed an extension at the California College of ArtsThis terrace acts as a ceiling to the building's ground-level program while providing an expansive outdoor space for three mass-timber \"pavilions\" that extend upwards at the sides of the plan, one of which remains unbuilt. Two \"maker yards\" were \"carved\" out of the terrace and reach down towards ground-level, where the entrance to the neighbouring building also lies. The extensions consists of buildings and courtyards that are encased in a large concrete terraceThe complex hosts a variety of art-making classrooms and studios for the California College of the Arts (CCA) campus, such as spaces for finishing and sandblasting, lithography and etching and a metal shop. Its many studios and spaces are meant to create a \"dynamic environment\", while incorporating green spaces for the campus. The addition sits next to the campus' main academic building\"The design intends to create a dynamic environment for art and design education, while also inspiring new forms of making through unexpected interactions between disciplines,\" said Studio Gang founding partner Jeanne Gang. The building is square in form, and in plan, organised around the two rectangular courtyards, which are offset from each other at the complex's centre. An outdoor stair leads to the upper concrete deckThree, multi-storey mass-timber buildings – the Irwin Pavilion, Hooper Pavilion and the future Seventh Street Pavilion – are tucked around the terrace's perimeter and extend upwards through its concrete deck. The mass-timber buildings showcase an exposed, eccentric black-toned bracing system, which encircles the buildings in a cage-like skin. Two \"maker courtyards\" sit at ground-level\"Their structures, which are among the first exposed mass timber structures in California and include a one-of-a-kind eccentric braced frame system, allow their natural materiality and lateral and gravity loads to be visible,\" said the studio. Behind the frame, the buildings are clad in diagonal wood panels and are fronted with loggias, which face the interior of the expansion. At ground level, below the terrace, the courtyard and interstitial spaces were clad in glass, and an exposed staircase across from campus's main building leads to the upper deck. Rectangular green spaces are distributed across the top of the terrace, while small gardens populate the interior courtyards. The interior hosts studios and classrooms for a variety of makingSustainable strategies were incorporated into the design, such as \"self-shading façades and night-flush ventilation\" according to the studio, while infrastructure is in place for a future \"net-positive\" system. The mass-timber structure also reduces the building's impact to almost half of a \"typical\" building, according to the studio. A third building in the complex remains unbuilt\"The hybrid mass timber structure and minimal finishes reduce the building's embodied carbon footprint by almost half that of a typical baseline building,\" said the studio. \"I'm excited to see how our addition to CCA's campus shapes the future of art and design, and adds to San Francisco's storied creative community,\" added Gang. Other recent projects by Studio Gang include a residential tower in San Francisco's Mission Rock neighborhood and a hotel in Denver with a facade informed by tree bark. The photography is by Jason O'Rear Project credits: Owner's representative: Dovetail Construction Project Management,Associate architect: TEF DesignSustainability consultant: Atelier TenStructural engineering and acoustics engineer: ArupMEP/FP engineer: MEYERS+Landscape architect: Surfacedesign IncCivil engineer: Lotus WaterLighting designer: Pritchard Peck,Wayfinding and signage: Public designCode, fire, and life safety consultant: Coffman EngineersThermal and waterproofing consultant: Thornton TomasettDry utility consultant: Urban Design Consulting EngineersGeneral contractor: Hathaway Dinwiddie Construction Company Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_hero-2-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2140135\" data-article-id=\"2140135\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_hero-2.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_hero-2-852x479.jpg\" alt=\"CCA campus\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_hero-2-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_hero-2-1704x958.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_hero-2-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eArchitecture studio \u003ca href=\"https://www.dezeen.com/tag/studio-gang/\"\u003eStudio Gang\u003c/a\u003e has completed an expansive \u003ca href=\"https://www.dezeen.com/tag/extensions/\"\u003eextension\u003c/a\u003e at the California College of the Arts \u003ca href=\"https://www.dezeen.com/tag/san-francisco/\"\u003eSan Francisco\u003c/a\u003e campus, which includes exposed bracing and a concrete terrace.\u003cspan id=\"more-2140135\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe 82,305 square foot (7,646 square metre) addition extends outwards from the college\u0026#39;s main academic building and consists of buildings and courtyards encased in a large, elevated concrete terrace.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2140152\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_15.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_15-852x599.jpg\" alt=\"Wooden clad building\" width=\"2364\" height=\"1661\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_15-852x599.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_15-1704x1197.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_15-852x599.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140152\"\u003eStudio Gang has completed an extension at the California College of Arts\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis terrace acts as a ceiling to the building\u0026#39;s ground-level program while providing an expansive outdoor space for three mass-timber \u0026#34;pavilions\u0026#34; that extend upwards at the sides of the plan, one of which remains unbuilt.\u003c/p\u003e\n\u003cp\u003eTwo \u0026#34;maker yards\u0026#34; were \u0026#34;carved\u0026#34; out of the terrace and reach down towards ground-level, where the entrance to the neighbouring building also lies.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2140151\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_14.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_14-852x631.jpg\" alt=\"Wooden clad building\" width=\"2364\" height=\"1750\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_14-852x631.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_14-1704x1261.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_14-852x631.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140151\"\u003eThe extensions consists of buildings and courtyards that are encased in a large concrete terrace\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe complex hosts a variety of art-making classrooms and studios for the \u003ca href=\"https://www.cca.edu/\"\u003eCalifornia College of the Arts\u003c/a\u003e (CCA) campus, such as spaces for finishing and sandblasting, lithography and etching and a metal shop.\u003c/p\u003e\n\n\n\u003cp\u003eIts many studios and spaces are meant to create a \u0026#34;dynamic environment\u0026#34;, while incorporating green spaces for the campus.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2140144\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_7.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_7-852x590.jpg\" alt=\"California College of the Arts by Studio Gang\" width=\"2364\" height=\"1636\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_7-852x590.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_7-1704x1179.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_7-852x590.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140144\"\u003eThe addition sits next to the campus\u0026#39; main academic building\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The design intends to create a dynamic environment for art and design education, while also inspiring new forms of making through unexpected interactions between disciplines,\u0026#34; said \u003ca href=\"https://studiogang.com/\"\u003eStudio Gang\u003c/a\u003e founding partner \u003ca href=\"https://www.dezeen.com/tag/jeanne-gang/\"\u003eJeanne Gang\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe building is square in form, and in plan, organised around the two rectangular courtyards, which are offset from each other at the complex\u0026#39;s centre.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2140150\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_13.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_13-852x551.jpg\" alt=\"Wooden clad building\" width=\"2364\" height=\"1528\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_13-852x551.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_13-1704x1101.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_13-852x551.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140150\"\u003eAn outdoor stair leads to the upper concrete deck\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThree, multi-storey mass-timber buildings – the Irwin Pavilion, Hooper Pavilion and the future Seventh Street Pavilion – are tucked around the terrace\u0026#39;s perimeter and extend upwards through its concrete deck.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.dezeen.com/tag/mass-timber/\"\u003emass-timber\u003c/a\u003e buildings showcase an exposed, eccentric black-toned bracing system, which encircles the buildings in a cage-like skin.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2140145\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_8-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_8-852x1052.jpg\" alt=\"California College of the Arts by Studio Gang\" width=\"1915\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_8-852x1052.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_8-1704x2104.jpg 2x\" sizes=\"(max-width: 1915px) 100vw, 1915px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_8-852x1052.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140145\"\u003eTwo \u0026#34;maker courtyards\u0026#34; sit at ground-level\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Their structures, which are among the first exposed mass timber structures in California and include a one-of-a-kind eccentric braced frame system, allow their natural materiality and lateral and gravity loads to be visible,\u0026#34; said the studio.\u003c/p\u003e\n\u003cp\u003eBehind the frame, the buildings are clad in diagonal wood panels and are fronted with loggias, which face the interior of the expansion.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eAt ground level, below the terrace, the courtyard and interstitial spaces were clad in glass, and an exposed staircase across from campus\u0026#39;s main building leads to the upper deck.\u003c/p\u003e\n\u003cp\u003eRectangular green spaces are distributed across the top of the terrace, while small gardens populate the interior courtyards.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2140141\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_4.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_4-852x524.jpg\" alt=\"California College of the Arts by Studio Gang\" width=\"2364\" height=\"1454\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_4-852x524.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_4-1704x1048.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_4-852x524.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140141\"\u003eThe interior hosts studios and classrooms for a variety of making\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSustainable strategies were incorporated into the design, such as \u0026#34;self-shading façades and night-flush ventilation\u0026#34; according to the studio, while infrastructure is in place for a future \u0026#34;net-positive\u0026#34; system.\u003c/p\u003e\n\u003cp\u003eThe mass-timber structure also reduces the building\u0026#39;s impact to almost half of a \u0026#34;typical\u0026#34; building, according to the studio.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2140137\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_0-852x479.jpg\" alt=\"California College of the Arts by Studio Gang\" width=\"2364\" height=\"1328\" srcset=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_0-1704x957.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/studio-gang-san-francisco-california-college-of-the-arts_dezeen_2364_col_0-852x479.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2140137\"\u003eA third building in the complex remains unbuilt\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The hybrid mass timber structure and minimal finishes reduce the building\u0026#39;s embodied carbon footprint by almost half that of a typical baseline building,\u0026#34; said the studio.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;m excited to see how our addition to CCA\u0026#39;s campus shapes the future of art and design, and adds to San Francisco\u0026#39;s storied creative community,\u0026#34; added Gang.\u003c/p\u003e\n\u003cp\u003eOther recent projects by Studio Gang include \u003ca href=\"https://www.dezeen.com/2024/09/09/studio-gang-san-francisco-mission-rock-skyscraper/\"\u003ea residential tower in San Francisco\u0026#39;s Mission Rock neighborhood\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/10/17/populus-carbon-positive-hotel-denver-studio-gang/\"\u003ea hotel in Denver with a facade informed by tree bark\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.jasonorear.com/\"\u003eJason O\u0026#39;Rear\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eProject credits:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOwner\u0026#39;s representative:\u003c/strong\u003e Dovetail Construction Project Management,\u003cbr/\u003e\u003cstrong\u003eAssociate architect:\u003c/strong\u003e TEF Design\u003cbr/\u003e\u003cstrong\u003eSustainability consultant:\u003c/strong\u003e Atelier Ten\u003cbr/\u003e\u003cstrong\u003eStructural engineering and acoustics engineer\u003c/strong\u003e: Arup\u003cbr/\u003e\u003cstrong\u003eMEP/FP engineer:\u003c/strong\u003e MEYERS+\u003cbr/\u003e\u003cstrong\u003eLandscape architect:\u003c/strong\u003e Surfacedesign Inc\u003cbr/\u003e\u003cstrong\u003eCivil engineer:\u003c/strong\u003e Lotus Water\u003cbr/\u003e\u003cstrong\u003eLighting designer:\u003c/strong\u003e Pritchard Peck,\u003cbr/\u003e\u003cstrong\u003eWayfinding and signage:\u003c/strong\u003e Public design\u003cbr/\u003e\u003cstrong\u003eCode, fire, and life safety consultant:\u003c/strong\u003e Coffman Engineers\u003cbr/\u003e\u003cstrong\u003eThermal and waterproofing consultant:\u003c/strong\u003e Thornton Tomasett\u003cbr/\u003e\u003cstrong\u003eDry utility consultant:\u003c/strong\u003e Urban Design Consulting Engineers\u003cbr/\u003e\u003cstrong\u003eGeneral contractor:\u003c/strong\u003e Hathaway Dinwiddie Construction Company\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#dbaba9b2adbab8a29bbfbea1bebeb5f5b8b4b6\"\u003e\u003cspan data-cfemail=\"ff8f8d96899e9c86bf9b9a859a9a91d19c9092\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-08T18:00:53Z",
  "modifiedTime": "2024-11-08T21:40:10Z"
}
