{
  "id": "90501257-3938-45d2-bf51-19b0b6dfa58e",
  "title": "Robert A M Stern Architects designs pair of performance halls for Ohio State",
  "link": "https://www.dezeen.com/2024/10/16/robert-a-m-stern-ohio-state/",
  "description": "Architecture studios Robert A M Stern Architects and DLR Group have unveiled a pair of higher education buildings for performing arts at The Ohio State University in Columbus, Ohio, USA. New York City-based Robert A M Stern Architects (RAMSA) collaborated with architect of record and performance venue designer DLR Group to create the Timashev Family Music Building The post Robert A M Stern Architects designs pair of performance halls for Ohio State appeared first on Dezeen.",
  "author": "Kate Mazade",
  "published": "Wed, 16 Oct 2024 19:00:43 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "Education",
    "Ohio",
    "Robert A M Stern",
    "Universities",
    "USA"
  ],
  "byline": "Kate Mazade",
  "length": 6226,
  "excerpt": "(RAMSA) teamed up with DLR Group to construct a pair of buildings for higher education in the performing arts for The Ohio State University.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Architecture studios Robert A M Stern Architects and DLR Group have unveiled a pair of higher education buildings for performing arts at The Ohio State University in Columbus, Ohio, USA. New York City-based Robert A M Stern Architects (RAMSA) collaborated with architect of record and performance venue designer DLR Group to create the Timashev Family Music Building and the Department of Theatre, Film, and Media Arts Building, completed in 2022 and 2023, respectively. RAMSA has designed the Timashev Family Music BuildingThe buildings comprise 200,000 square feet (18,580 square metres) on The Ohio State University's campus and \"share an architectural identity grounded in openness, visibility, and connectivity that make arts activities within these buildings visible to passersby\". \"Designed and developed for performing arts education, the buildings' state-of-the-art performance and practice spaces serve Ohio State faculty and students and are equipped to host world-class performers and members of the Columbus community,\" the team told Dezeen. The firm also completed the Department of Theatre, Film, and Media Arts BuildingClad in the university's standard red brick and slate grey metal detailing, both buildings were designed to respect the neighbouring buildings in scale, but depart from the immediate context with continuously glazed facades along the western edge. Inside, double-height lobbies – clad in light wood paneling – serve as light-filled community spaces and large corridors that allow circulation between multiple performance venues. According to the studios, the spaces have also become popular on-campus locations for study and social gatherings. Lobbies were clad in light wood panellingThe Timashev Family Music Building features a 190-seat recital hall that is acoustically tunable for chamber music, classrooms, offices, a recording studio, a 3,775-square foot (350 square metre) rehearsal hall, and piano repair shop. It also incorporates the renovated 700-seat Weigel Auditorium. The Department of Theater, Film and Media Arts Building is centered around a 444-seat proscenium theatre and a 202-seat multi-form thrust theatre. Theatres feature in the Department of Theatre, Film, and Media Arts BuildingThe building also includes a scene shop, studios, editing suites, lighting lab, ticket office and a 4,500-square foot (420 square metre) new media sound stage. \"Careful consideration of acoustics – both sound transmission and reverberation – was essential to the success of both [buildings],\" the team said. \"Construction detailing, combined with mechanical systems design were studied intensively to achieve exceptional acoustic performance.\" Additionally, a double-window system with high-performance glazing brings light into the performance spaces while reducing acoustic transmission and helping with building performance. Windows recess into the brick facade to shade the interior spaces and reduce solar heat gain, while a highly reflective roof membrane reduces indoor temperature. \"Both buildings have become important campus pathways bringing members of the Ohio State community into and through the building as they move across the campus,\" the team said, referencing the transformation of the central-campus site that connects its northern academic district with its expansion areas. Immediately to the east of the Timashev Family Music Building is the Wexner Center for the ArtsImmediately to the east of the Timashev Family Music Building is the Wexner Center for the Arts, a wedge-shaped building designed by Peter Eisenman in 1989. Its partial brick-clad towers that reference a medieval armory and white space-frame scaffolding are elements of deconstructivism. The photography is by Francis Dzikowski. Project credits: Architect of record, performance venue design, acoustics and theatre technology, MEP, fire protection \u0026 structural engineering: DLR GroupDesign architect: RAMSALandscape architect: OlinCivil: Konda Nemeth EngineersSignage: Swath Design Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa-hero-1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003carticle id=\"post-2113539\" data-article-id=\"2113539\"\u003e\n\u003cheader\u003e\n\n\u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa-hero.jpg\" id=\"preload-hero\"\u003e\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa-hero-852x479.jpg\" alt=\"Ohio state buildings by RAMSA\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa-hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa-hero-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e \u003c/figure\u003e\n\n\n\n\u003c/header\u003e\n\u003csection\u003e\n\n\u003cp\u003eArchitecture studios \u003ca href=\"https://www.dezeen.com/tag/robert-a-m-stern/\"\u003eRobert A M Stern Architects\u003c/a\u003e and DLR Group have unveiled a pair of higher education buildings for performing arts at The Ohio State University in Columbus, \u003ca href=\"https://www.dezeen.com/tag/ohio/\" target=\"_blank\" rel=\"noopener\"\u003eOhio\u003c/a\u003e, USA.\u003cspan id=\"more-2113539\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003cp\u003eNew York City-based \u003ca href=\"https://www.ramsa.com/\"\u003eRobert A M Stern Architects\u003c/a\u003e (RAMSA) collaborated with architect of record and performance venue designer \u003ca href=\"https://www.dlrgroup.com/\" target=\"_blank\" rel=\"noopener\"\u003eDLR Group\u003c/a\u003e to create the Timashev Family Music Building and the Department of Theatre, Film, and Media Arts Building, completed in 2022 and 2023, respectively.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2131066\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_1.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_1-852x764.jpg\" alt=\"Timashev Family Music Building\" width=\"2364\" height=\"2121\" srcset=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_1-852x764.jpg 1x, https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_1-1704x1529.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2131066\"\u003eRAMSA has designed the Timashev Family Music Building\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe buildings comprise 200,000 square feet (18,580 square metres) on \u003ca href=\"https://www.osu.edu/\" target=\"_blank\" rel=\"noopener\"\u003eThe Ohio State University\u0026#39;s campus\u003c/a\u003e and \u0026#34;share an architectural identity grounded in openness, visibility, and connectivity that make arts activities within these buildings visible to passersby\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Designed and developed for performing arts education, the buildings\u0026#39; state-of-the-art performance and practice spaces serve Ohio State faculty and students and are equipped to host world-class performers and members of the Columbus community,\u0026#34; the team told Dezeen.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2131056\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_9.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_9-852x563.jpg\" alt=\"Department of Theatre, Film, and Media Arts Building\" width=\"2364\" height=\"1561\" srcset=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_9-852x563.jpg 1x, https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_9-1704x1125.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2131056\"\u003eThe firm also completed the Department of Theatre, Film, and Media Arts Building\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eClad in the university\u0026#39;s standard red brick and slate grey metal detailing, both buildings were designed to respect the neighbouring buildings in scale, but depart from the immediate context with continuously glazed facades along the western edge.\u003c/p\u003e\n\n\u003cp\u003eInside, double-height lobbies – clad in light wood paneling – serve as light-filled community spaces and large corridors that allow circulation between multiple performance venues.\u003c/p\u003e\n\u003cp\u003eAccording to the studios, the spaces have also become popular on-campus locations for study and social gatherings.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2131051\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_14.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_14-852x514.jpg\" alt=\"Light wood panelled lobbies\" width=\"2364\" height=\"1426\" srcset=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_14-852x514.jpg 1x, https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_14-1704x1028.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2131051\"\u003eLobbies were clad in light wood panelling\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe Timashev Family Music Building features a 190-seat recital hall that is acoustically tunable for chamber music, classrooms, offices, a recording studio, a 3,775-square foot (350 square metre) rehearsal hall, and piano repair shop. It also incorporates the renovated 700-seat Weigel Auditorium.\u003c/p\u003e\n\u003cp\u003eThe Department of Theater, Film and Media Arts Building is centered around a 444-seat proscenium theatre and a 202-seat multi-form thrust theatre.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2131057\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_10.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_10-852x568.jpg\" alt=\"Theatre\" width=\"2364\" height=\"1577\" srcset=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_10-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_10-1704x1137.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2131057\"\u003eTheatres feature in the Department of Theatre, Film, and Media Arts Building\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe building also includes a scene shop, studios, editing suites, lighting lab, ticket office and a 4,500-square foot (420 square metre) new media sound stage.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Careful consideration of acoustics – both sound transmission and reverberation – was essential to the success of both [buildings],\u0026#34; the team said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Construction detailing, combined with mechanical systems design were studied intensively to achieve exceptional acoustic performance.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdditionally, a double-window system with high-performance glazing brings light into the performance spaces while reducing acoustic transmission and helping with building performance.\u003c/p\u003e\n\u003cp\u003eWindows recess into the brick facade to shade the interior spaces and reduce solar heat gain, while a highly reflective roof membrane reduces indoor temperature.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Both buildings have become important campus pathways bringing members of the Ohio State community into and through the building as they move across the campus,\u0026#34; the team said, referencing the transformation of the central-campus site that connects its northern academic district with its expansion areas.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2131046\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_2.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_2-852x637.jpg\" alt=\"Wexner Center for the Arts\" width=\"2364\" height=\"1768\" srcset=\"https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_2-852x637.jpg 1x, https://static.dezeen.com/uploads/2024/10/ohio-state-buildings-ramsa_dezeen_2364_col_2-1704x1274.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2131046\"\u003eImmediately to the east of the Timashev Family Music Building is the Wexner Center for the Arts\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eImmediately to the east of the Timashev Family Music Building is the \u003ca href=\"https://eisenmanarchitects.com/Wexner-Center-for-the-Visual-Arts-and-Fine-Arts-Library-1989\" target=\"_blank\" rel=\"noopener\"\u003eWexner Center for the Arts\u003c/a\u003e, a wedge-shaped building designed by Peter Eisenman in 1989. Its partial brick-clad towers that reference a medieval armory and white space-frame scaffolding are \u003ca href=\"https://www.dezeen.com/2022/05/16/peter-eisenman-wexner-center-for-the-arts-deconstructivism-architecture/\" target=\"_blank\" rel=\"noopener\"\u003eelements of deconstructivism\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.fdphoto.biz/\" target=\"_blank\" rel=\"noopener\"\u003eFrancis Dzikowski\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eProject credits:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eArchitect of record, performance venue design, acoustics and theatre technology, MEP, fire protection \u0026amp; structural engineering:\u003c/strong\u003e DLR Group\u003cbr/\u003e\u003cstrong\u003eDesign architect:\u003c/strong\u003e RAMSA\u003cbr/\u003e\u003cstrong\u003eLandscape architect:\u003c/strong\u003e Olin\u003cbr/\u003e\u003cstrong\u003eCivil:\u003c/strong\u003e Konda Nemeth Engineers\u003cbr/\u003e\u003cstrong\u003eSignage:\u003c/strong\u003e Swath Design\u003c/p\u003e\n\n\u003c/section\u003e\n\u003cdiv id=\"newsletter-form\"\u003e\n\u003cform action=\"\" method=\"POST\"\u003e\n\u003cdiv id=\"newsletter-step-1\"\u003e\n\u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n\u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n\n\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv id=\"newsletter-step-2\"\u003e\n\u003cp\u003e\u003clabel\u003e\n\u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n\u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n\u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n\u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n\u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003c/p\u003e\n\u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#5b2b29322d3a38221b3f3e213e3e3575383436\"\u003e\u003cspan data-cfemail=\"0e7e7c67786f6d774e6a6b746b6b60206d6163\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\n\u003cdiv id=\"newsletter-step-3\"\u003e\n\u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/form\u003e\n\u003c/div\u003e\n\n\n\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-16T19:00:43Z",
  "modifiedTime": "2024-10-16T21:05:06Z"
}
