{
  "id": "b43a83dd-ac27-475d-90c5-93ba37ac73dd",
  "title": "NYCxDESIGN 2025: A Curated Schedule of What To See and When To Go",
  "link": "https://architizer.com/blog/inspiration/industry/nycxdesign-2025-schedule-what-to-see/",
  "description": "The intentional intimacy expressed by this year's exhibitors brings architects and designers closer to the action than ever. The post NYCxDESIGN 2025: A Curated Schedule of What To See and When To Go appeared first on Journal.",
  "author": "Samantha Frew",
  "published": "Tue, 13 May 2025 15:01:14 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Industry",
    "Inspiration"
  ],
  "byline": "Samantha Frew",
  "length": 11080,
  "excerpt": "The intentional intimacy expressed by this year's exhibitors brings architects and designers closer to the action than ever. Architizer's guide tells you where you should be — and when — to get in on the action. #NYCxDesign",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "The Extended Entry Deadline for Architizer's 2025 A+Product Awards is Friday, February 21st. Get your brand in front of the AEC industry’s most renowned designers by submitting today. NYCxDESIGN returns this year, running from May 15 to 23. As ever, the schedule is broad and ambitious. More than 280 events, exhibitions, product launches, gallery shows, open studios, guided tours and more will unfold across the city over the course of the week. Usually, NYCxDESIGN is an event revered for spectacle and scale; however, this year, the exhibitors have taken a considered approach. Among the ambitious schedule, brands, designers, artists and studios are opening their spaces and sharing work in a way that is far less ostentatious display and more inhabitation of design. Some exhibits invite visitors into studios, kitchens, or furnished interiors. Others walk guests through the production and process of their pieces. In many cases, the materials and mechanisms are on show to be used and experienced. The idea has become not to simply view design, but to step inside it. Ilene Shaw, Executive Director of NYCxDESIGN said of the 2025 production, “This year’s NYCxDESIGN Festival feels especially energetic — full of new ways to connect, learn, and meet first-time participants. We’ll experience parks, revitalization and new infrastructure projects, and connect with the great minds that actually shaped them. You can walk through MADE’s Building A with nARCHITECTS and see adaptive reuse in action. Go behind the scenes at the transformed Davis Center at Harlem Meer in Central Park. Tour the stunning public art program at the new Grand Central Madison Terminal — 17 stories below ground. One of the most meaningful experiences we have organized is a high school student tour to the end-of-year design school exhibitions at a number of NYC design schools.  Throughout the city, the festival opens doors — quite literally— inviting you into studios, exhibitions, tours and installations that celebrate the full spectrum of New York’s creative energy. It’s design up close, in context, and in conversation.” The shift feels timely. While design culture and discourse are dominated by hyper-realistic rendered imagery and immaculately staged press photography, the type of intimate encounter offered at NYCxDESIGN is something tangible and explicitly needed. It prioritizes access over image and tactility over narrative. For architects and designers, it provides the chance to experience work as it is intended to be used, alongside the opportunity to speak directly with the minds behind the work. Architizer is proud to celebrate the creative forces shaping this year’s festival, and the following selection highlights just a few of the many events we think are worth taking the time to visit. Each invites a kind of closeness and intimacy, not as a concept, nor as a curated atmosphere, but as a way to showcase something real and meaningful. Tour of Building A at the MADE Bush Terminal Campus MADE Bush Terminal, 13 42nd Street, Brooklyn, NY 11232 Saturday, May 17, 2025, 10:30 AM – 12:00 PM Free with registration via Eventbrite Hosted by nArchitects and the NYC Economic Development Corporation (NYCEDC), this exclusive tour explores the newly completed Building A and sections of the public campus at the adaptive-reuse MADE Bush Terminal waterfront site in Sunset Park. The tour highlights modern manufacturing, artisan workshops and entrepreneurial spaces within one of New York City’s most ambitious industrial transformations. Espasso presents: Take A Seat by Carlos Motta Espasso New York, 38 N Moore Street Opening: Thursday, May 15, 2025, 6:00 – 9:00 PM (cocktail and book launch) Exhibition: May 15 – June 9, Monday–Friday, 10:00 AM – 6:00 PM Espasso hosts a major retrospective on Brazilian designer and master woodworker Carlos Motta, tracing four decades of his work in furniture and architecture. The show centres on Motta’s celebrated seating designs — including the Rio Manso, CJ and Asturias collections — and launches a new edition of the Asturias chair, now with armrests. Grand Central Madison – A New Landmark and Cultural Corridor Grand Central Madison LIRR Terminal,Madison Avenue from 42nd to 48th Streets,New York, Tour date and time: May 18, 1:00 – 3:00 PM Spanning five city blocks beneath Midtown, Grand Central Madison is the largest transit terminal built in the U.S. in decades. Beyond its scale, it serves as a cultural corridor featuring permanent works by Yayoi Kusama and Kiki Smith, large-scale digital commissions, and public poetry displays. This guided tour with MTA Arts \u0026 Design offers insight into how art and architecture converge in one of the city’s most complex public spaces. Design Pavilion by Lexus at Hudson Yards Hudson Yards Public Square and Gardens, 11th Avenue and Hudson Blvd East May 10–19, 10:00 AM – 8:00 PM daily Returning to NYCxDesign for the first time in years, Design Pavilion presents “Lexus Ambiance,” an interactive installation by artist Nick Thomm. Set beside the Vessel, the piece invites visitors to shape a personalized light environment through movement and presence, offering a glimpse into future modes of responsive, experience-led design. Davis Center at the Harlem Meer Tour Central Park, enter at 110th Street and Lenox Avenue Tour date and time: May 16, 3:00 – 4:30 PM Designed by the Central Park Conservancy with Susan T. Rodriguez Architecture · Design and Mitchell Giurgola, the Davis Center redefines the northern edge of Central Park as both civic landmark and ecological restoration. This guided tour offers an early look at the new year-round facility, green roof, and reconnected watercourse, exploring how architecture and landscape come together to support access, biodiversity and public use. Design Legacy: The Poul Kjærholm Collection Fritz Hansen New York Showroom, 22 Wooster Street, New York, NY 10013 May 15–21, 2025, Monday–Friday, 10:00 AM – 6:00 PM Free, open to the public Fritz Hansen presents a focused survey of Poul Kjærholm’s work, marking the first exhibition in the Americas dedicated to the Danish modernist’s legacy. Known for refining cabinetmaking traditions through steel and precision joinery, Kjærholm’s designs are positioned here not just as furniture, but as studies in proportion, restraint, and material structure. HUNDŌ by Emily Thurman Studio 86 Walker Street, 2nd Floor, New York, NY 10013 Opening Reception: May 14, 2025, 7:00 – 10:00 PM On view May 15–21, by appointment, 11:00 AM – 6:00 PM Salt Lake City–based Emily Thurman presents HUNDŌ, her debut furniture and lighting collection, in a multi-sensory installation at 86 Walker Street. The show features works made in collaboration with StudioDanielK, Alexis Mazin, and Camille Tan, using cast bronze, glass, stone, and salvaged wood, all framed within an environment of scenography and sound. TM Italia NYC Showroom First Look 20 West 20th Street, Floor 5, Suite 502, New York, NY 10011 Open Hours: May 17–18, 10:00 AM – 6:00 PM TM Italia’s first New York showroom invites guests into a fully realized domestic interior, where each zone is designed around a different style of kitchen use. From a compact working setup to a larger family configuration, the layout reflects the brand’s approach to bespoke cabinetry as both spatial system and crafted object. Materials, finishes and functional elements are on full display, offering an unusually tactile insight into how the Italian atelier works at 1:1 scale. Known Work Multiple locations including Love House, ZAROLAT, Host on Howard, Luisaviaroma, and Simple Flair Apartment May 9–30, 2025 (dates vary by venue) Design studio Known Work presents new and site-specific pieces across five exhibitions citywide, from Dimes Square to Dumbo. With new editions from its Perceptions Collection, designed by Parts and Labour founders Danu Kennedy and Jeremy Levitt. At Love House, the studio debuts The Mother, a dramatic metal mesh pendant that reframes the domestic light fixture as an heirloom. Other showings include sculptural seating at Host on Howard, a capsule at Luisaviaroma, and immersive staging at Simple Flair Apartment. Each show places collectable furniture and lighting in context-rich, spatially intimate settings. Oui Design! Festival 2025 Various locations across New York City Pop-up at Payne Whitney Mansion May 15, 11 AM – 5 PM  (Registration via villa-albertine.org) Similarly, Villa Albertine’s annual festival of French craftsmanship returns with open studios, exhibitions, and talks across the city. The programme begins with a daylong pop-up at the Payne Whitney Mansion, featuring live craft demonstrations and immersive scenography by Aurore Vullierme. Visitors can engage directly with master artisans working in ceramics, featherwork, jewellery and painted marble. This year’s edition expands spatial access across dozens of venues, from heritage galleries to contemporary showrooms. Birth of the Polar at Royère Gallery 315 Spring Street, New York, NY 10013 On view: May 7–30, 2025 Open House: Friday, May 16, 2:00 – 5:00 PM (as part of Oui Design!) Jean Royère’s Ours Polaire sofa is so familiar that it’s easy to forget how strange it once must have been when it first launched— all curves and no corners. This exhibition puts the piece back in context, not as an icon but as an object. The original frame, shaped like a boat hull and built in solid beech, is still assembled by hand in Lyon using the same layered construction Royère specified in the 1940s. Visitors are invited into the process to witness the immense craftsmanship of the famous piece. Cornell Tech and FDR Four Freedoms State Park Bloomberg Center Lobby, Cornell Tech, 2 West Loop Road, Roosevelt Island Tour date and time: May 20, 4:00 – 6:00 PM Cornell Tech, photograph by Max Touhey. This two-part walking tour explores the architectural and civic ambitions of Roosevelt Island, beginning with Cornell Tech’s high-performance campus and concluding at Louis Kahn’s Four Freedoms Park. Highlights include the Bloomberg Center, the Tata Innovation Hub and The House — one of the world’s largest Passive House residential buildings — followed by a guided discussion of Kahn’s axial granite memorial and its role as a site of political reflection and urban poise. School of Constructed Environments: End of Year Exhibition 2025 Parsons, The New School, Starr Foundation Hall, 63 Fifth Avenue, New York, NY 10011 Opening: Wednesday, May 14, 2025, 6:00 – 9:00 PM On view through May 19, 2025 Parsons’ School of Constructed Environments presents its annual graduate showcase across architecture, interior, lighting and product design. The exhibition offers a direct look at how the next generation is responding to contemporary spatial challenges through new formats, tools and ways of thinking — all displayed in one collective environment. The Extended Entry Deadline for Architizer's 2025 A+Product Awards is Friday, February 21st. Get your brand in front of the AEC industry’s most renowned designers by submitting today.",
  "image": "https://blog.architizer.com/wp-content/uploads/Central-Park-x-NYCxDESIGN_Harlem-Meer_Image-1-1024x683.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003e\u003ci\u003eThe Extended Entry Deadline for Architizer\u0026#39;s 2025 \u003c/i\u003e\u003ca href=\"https://enter.architizerproductawards.com/?utm_source=mailchimp\u0026amp;utm_medium=newsletter\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003e\u003ci\u003eA+Product Awards\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003ci\u003e is \u003cstrong\u003eFriday, February 21st\u003c/strong\u003e.\u003c/i\u003e\u003ci\u003e Get your brand in front of the AEC industry’s most renowned designers by \u003c/i\u003e\u003ca href=\"https://www.architizerproductawards.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003e\u003ci\u003esubmitting today\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eNYCxDESIGN returns this year, running from May 15 to 23. As ever, the schedule is broad and ambitious. More than 280 events, exhibitions, product launches, gallery shows, open studios, guided tours and more will unfold across the city over the course of the week.\u003c/p\u003e\n\u003cp\u003eUsually, \u003ca href=\"https://nycxdesign.org/\"\u003eNYCxDESIGN\u003c/a\u003e is an event revered for spectacle and scale; however, this year, the exhibitors have taken a considered approach. Among the ambitious schedule, brands, designers, artists and studios are opening their spaces and sharing work in a way that is far less ostentatious display and more inhabitation of design. Some exhibits invite visitors into studios, kitchens, or furnished interiors. Others walk guests through the production and process of their pieces. In many cases, the materials and mechanisms are on show to be used and experienced. The idea has become not to simply view design, but to step inside it.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eIlene Shaw, Executive Director of NYCxDESIGN said of the 2025 production, \u003cem\u003e“This year’s NYCxDESIGN Festival feels especially energetic — full of new ways to connect, learn, and meet first-time participants. We’ll experience parks, revitalization and new infrastructure projects, and connect with the great minds that actually shaped them.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eYou can walk through MADE’s Building A with \u003ca href=\"https://architizer.com/firms/narchitects/\" target=\"_blank\" rel=\"noopener\"\u003enARCHITECTS\u003c/a\u003e and see adaptive reuse in action. Go behind the scenes at the transformed Davis Center at Harlem Meer in Central Park. Tour the stunning public art program at the new Grand Central Madison Terminal — 17 stories below ground.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eOne of the most meaningful experiences we have organized is a high school student tour to the end-of-year design school exhibitions at a number of NYC design schools.  Throughout the city, the festival opens doors — quite literally— inviting you into studios, exhibitions, tours and installations that celebrate the full spectrum of New York’s creative energy. It’s design up close, in context, and in conversation.”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThe shift feels timely. While design culture and discourse are dominated by hyper-realistic rendered imagery and immaculately staged press photography, the type of intimate encounter offered at NYCxDESIGN is something tangible and explicitly needed. It prioritizes access over image and tactility over narrative. For architects and designers, it provides the chance to experience work as it is intended to be used, alongside the opportunity to speak directly with the minds behind the work.\u003c/p\u003e\n\u003cp\u003eArchitizer is proud to celebrate the creative forces shaping this year’s festival, and the following selection highlights just a few of the many events we think are worth taking the time to visit. Each invites a kind of closeness and intimacy, not as a concept, nor as a curated atmosphere, but as a way to showcase something real and meaningful.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/tour-of-building-a-at-the-made-bush-terminal-campus/\"\u003eTour of Building A at the MADE Bush Terminal Campus\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eMADE Bush Terminal, 13 42nd Street, Brooklyn, NY 11232\u003c/h4\u003e\n\u003ch5\u003eSaturday, May 17, 2025, 10:30 AM – 12:00 PM\u003cbr/\u003e\nFree with registration via \u003ca href=\"https://www.eventbrite.com/e/tour-of-building-a-at-the-made-bush-terminal-campus-tickets-1308519871159?aff=oddtdtcreator\"\u003eEventbrite\u003c/a\u003e\u003c/h5\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/MADE-Photo.png\" alt=\"\" width=\"1880\" height=\"944\" srcset=\"https://blog.architizer.com/wp-content/uploads/MADE-Photo.png 1880w, https://blog.architizer.com/wp-content/uploads/MADE-Photo-300x151.png 300w, https://blog.architizer.com/wp-content/uploads/MADE-Photo-1024x514.png 1024w, https://blog.architizer.com/wp-content/uploads/MADE-Photo-768x386.png 768w, https://blog.architizer.com/wp-content/uploads/MADE-Photo-1536x771.png 1536w, https://blog.architizer.com/wp-content/uploads/MADE-Photo-368x184.png 368w, https://blog.architizer.com/wp-content/uploads/MADE-Photo-400x201.png 400w\" sizes=\"(max-width: 1880px) 100vw, 1880px\"/\u003e\u003c/p\u003e\n\u003cp\u003eHosted by nArchitects and the NYC Economic Development Corporation (NYCEDC), this exclusive tour explores the newly completed Building A and sections of the public campus at the adaptive-reuse MADE Bush Terminal waterfront site in Sunset Park. The tour highlights modern manufacturing, artisan workshops and entrepreneurial spaces within one of New York City’s most ambitious industrial transformations.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/take-a-seat/\"\u003eEspasso presents: Take A Seat by Carlos Motta\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eEspasso New York, 38 N Moore Street\u003c/h4\u003e\n\u003ch5\u003eOpening: Thursday, May 15, 2025, 6:00 – 9:00 PM (cocktail and book launch)\u003cbr/\u003e\nExhibition: May 15 – June 9, Monday–Friday, 10:00 AM – 6:00 PM\u003c/h5\u003e\n\u003cp\u003e\u003ca href=\"https://www.espasso.com/take-a-seat\"\u003eEspasso\u003c/a\u003e hosts a major retrospective on Brazilian designer and master woodworker Carlos Motta, tracing four decades of his work in furniture and architecture. The show centres on Motta’s celebrated seating designs — including the Rio Manso, CJ and Asturias collections — and launches a new edition of the Asturias chair, now with armrests.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/grand-central-madison-a-new-landmark-and-cultural-corridor/\"\u003eGrand Central Madison – A New Landmark and Cultural Corridor\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eGrand Central Madison LIRR Terminal,Madison Avenue from 42nd to 48th Streets,New York,\u003c/h4\u003e\n\u003ch5\u003eTour date and time: May 18, 1:00 – 3:00 PM\u003c/h5\u003e\n\u003cp\u003eSpanning five city blocks beneath Midtown, Grand Central Madison is the largest transit terminal built in the U.S. in decades. Beyond its scale, it serves as a cultural corridor featuring permanent works by Yayoi Kusama and Kiki Smith, large-scale digital commissions, and public poetry displays. This guided tour with MTA Arts \u0026amp; Design offers insight into how art and architecture converge in one of the city’s most complex public spaces.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/design-pavilion-by-lexus-at-hudson-yards/\"\u003eDesign Pavilion by Lexus at Hudson Yards\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eHudson Yards Public Square and Gardens, 11th Avenue and Hudson Blvd East\u003c/h4\u003e\n\u003ch5\u003eMay 10–19, 10:00 AM – 8:00 PM daily\u003c/h5\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1.png\" alt=\"\" width=\"2048\" height=\"1365\" srcset=\"https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1.png 2048w, https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1-300x200.png 300w, https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1-1024x683.png 1024w, https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1-768x512.png 768w, https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1-1536x1024.png 1536w, https://blog.architizer.com/wp-content/uploads/DESIGN-PAVILION-RENDERING-TO-USE-5.6.25-2048x1365-1-400x267.png 400w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/p\u003e\n\u003cp\u003eReturning to NYCxDesign for the first time in years, Design Pavilion presents “Lexus Ambiance,” an interactive installation by artist Nick Thomm. Set beside the Vessel, the piece invites visitors to shape a personalized light environment through movement and presence, offering a glimpse into future modes of responsive, experience-led design.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/davis-center-at-the-harlem-meer-tour/\"\u003eDavis Center at the Harlem Meer Tour\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eCentral Park, enter at 110th Street and Lenox Avenue\u003c/h4\u003e\n\u003ch5\u003eTour date and time: May 16, 3:00 – 4:30 PM\u003c/h5\u003e\n\u003cp\u003eDesigned by the Central Park Conservancy with Susan T. Rodriguez Architecture · Design and Mitchell Giurgola, the Davis Center redefines the northern edge of Central Park as both civic landmark and ecological restoration. This guided tour offers an early look at the new year-round facility, green roof, and reconnected watercourse, exploring how architecture and landscape come together to support access, biodiversity and public use.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/the-kjaerholm-exhibition-by-fritz-hansen/\"\u003eDesign Legacy: The Poul Kjærholm Collection\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eFritz Hansen New York Showroom, 22 Wooster Street, New York, NY 10013\u003c/h4\u003e\n\u003ch5\u003eMay 15–21, 2025, Monday–Friday, 10:00 AM – 6:00 PM\u003cbr/\u003e\nFree, open to the public\u003c/h5\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/FH_Invitation_NYCxDesign.png\" alt=\"\" width=\"952\" height=\"643\" srcset=\"https://blog.architizer.com/wp-content/uploads/FH_Invitation_NYCxDesign.png 900w, https://blog.architizer.com/wp-content/uploads/FH_Invitation_NYCxDesign-300x203.png 300w, https://blog.architizer.com/wp-content/uploads/FH_Invitation_NYCxDesign-768x519.png 768w, https://blog.architizer.com/wp-content/uploads/FH_Invitation_NYCxDesign-400x270.png 400w\" sizes=\"(max-width: 952px) 100vw, 952px\"/\u003e\u003c/p\u003e\n\u003cp\u003eFritz Hansen presents a focused survey of Poul Kjærholm’s work, marking the first exhibition in the Americas dedicated to the Danish modernist’s legacy. Known for refining cabinetmaking traditions through steel and precision joinery, Kjærholm’s designs are positioned here not just as furniture, but as studies in proportion, restraint, and material structure.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/hundo/\"\u003eHUNDŌ by Emily Thurman Studio\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003e86 Walker Street, 2nd Floor, New York, NY 10013\u003c/h4\u003e\n\u003ch5\u003eOpening Reception: May 14, 2025, 7:00 – 10:00 PM\u003cbr/\u003e\nOn view May 15–21, by appointment, 11:00 AM – 6:00 PM\u003c/h5\u003e\n\u003cp\u003eSalt Lake City–based Emily Thurman presents HUNDŌ, her debut furniture and lighting collection, in a multi-sensory installation at 86 Walker Street. The show features works made in collaboration with StudioDanielK, Alexis Mazin, and Camille Tan, using cast bronze, glass, stone, and salvaged wood, all framed within an environment of scenography and sound.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/tm-italia-grand-opening/\"\u003eTM Italia NYC Showroom First Look\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003e20 West 20th Street, Floor 5, Suite 502, New York, NY 10011\u003c/h4\u003e\n\u003ch5\u003eOpen Hours: May 17–18, 10:00 AM – 6:00 PM\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002.jpg\" alt=\"\" width=\"2362\" height=\"1575\" srcset=\"https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002.jpg 2362w, https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002-300x200.jpg 300w, https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002-1024x683.jpg 1024w, https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002-768x512.jpg 768w, https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002-1536x1024.jpg 1536w, https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002-2048x1366.jpg 2048w, https://blog.architizer.com/wp-content/uploads/TM_ITALIA25_NY_Atelier_002-400x267.jpg 400w\" sizes=\"auto, (max-width: 2362px) 100vw, 2362px\"/\u003e\u003c/p\u003e\n\u003cp\u003eTM Italia’s first New York showroom invites guests into a fully realized domestic interior, where each zone is designed around a different style of kitchen use. From a compact working setup to a larger family configuration, the layout reflects the brand’s approach to bespoke cabinetry as both spatial system and crafted object. Materials, finishes and functional elements are on full display, offering an unusually tactile insight into how the Italian atelier works at 1:1 scale.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003eKnown Work\u003c/h3\u003e\n\u003ch4\u003eMultiple locations including \u003ca href=\"https://nycxdesign.org/event/the-family-show-by-love-house/\"\u003eLove House,\u003c/a\u003e ZAROLAT, Host on Howard, Luisaviaroma, and Simple Flair Apartment\u003c/h4\u003e\n\u003ch5\u003eMay 9–30, 2025 (dates vary by venue)\u003c/h5\u003e\n\u003cp\u003eDesign studio Known Work presents new and site-specific pieces across five exhibitions citywide, from Dimes Square to Dumbo. With new editions from its Perceptions Collection, designed by Parts and Labour founders Danu Kennedy and Jeremy Levitt. At Love House, the studio debuts The Mother, a dramatic metal mesh pendant that reframes the domestic light fixture as an heirloom. Other showings include sculptural seating at Host on Howard, a capsule at Luisaviaroma, and immersive staging at Simple Flair Apartment. Each show places collectable furniture and lighting in context-rich, spatially intimate settings.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/pop-up-exhibition-at-the-payne-whitney-mansion/\"\u003eOui Design! Festival 2025\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eVarious locations across New York City\u003c/h4\u003e\n\u003ch5\u003ePop-up at Payne Whitney Mansion\u003cbr/\u003e\nMay 15, 11 AM – 5 PM  (Registration via \u003ca href=\"https://villa-albertine.org/\"\u003evilla-albertine.org\u003c/a\u003e)\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1175\" srcset=\"https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-scaled.jpg 2560w, https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-300x138.jpg 300w, https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-1024x470.jpg 1024w, https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-768x352.jpg 768w, https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-1536x705.jpg 1536w, https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-2048x940.jpg 2048w, https://blog.architizer.com/wp-content/uploads/graphic_Studio-Des-Signes-Paris-400x184.jpg 400w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003e\u003c/p\u003e\n\u003cp\u003eSimilarly, Villa Albertine’s annual festival of French craftsmanship returns with open studios, exhibitions, and talks across the city. The programme begins with a daylong pop-up at the Payne Whitney Mansion, featuring live craft demonstrations and immersive scenography by Aurore Vullierme. Visitors can engage directly with master artisans working in ceramics, featherwork, jewellery and painted marble. This year’s edition expands spatial access across dozens of venues, from heritage galleries to contemporary showrooms.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/experience-royere/\"\u003eBirth of the Polar at Royère Gallery\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003e315 Spring Street, New York, NY 10013\u003c/h4\u003e\n\u003ch5\u003eOn view: May 7–30, 2025\u003cbr/\u003e\nOpen House: Friday, May 16, 2:00 – 5:00 PM (as part of Oui Design!)\u003c/h5\u003e\n\u003cp\u003eJean Royère’s Ours Polaire sofa is so familiar that it’s easy to forget how strange it once must have been when it first launched— all curves and no corners. This exhibition puts the piece back in context, not as an icon but as an object. The original frame, shaped like a boat hull and built in solid beech, is still assembled by hand in Lyon using the same layered construction Royère specified in the 1940s. Visitors are invited into the process to witness the immense craftsmanship of the famous piece.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/nycxdesign-tour-cornell-tech-fdr-four-freedoms-state-park/\"\u003eCornell Tech and FDR Four Freedoms State Park\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBloomberg Center Lobby, Cornell Tech, 2 West Loop Road, Roosevelt Island\u003c/h4\u003e\n\u003ch5\u003eTour date and time: May 20, 4:00 – 6:00 PM\u003c/h5\u003e\n\u003cdiv id=\"attachment_201884\"\u003e\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-201884\" src=\"https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1917\" srcset=\"https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-scaled.jpg 2560w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-300x225.jpg 300w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-1024x767.jpg 1024w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-768x575.jpg 768w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-1536x1150.jpg 1536w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-2048x1534.jpg 2048w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-66x50.jpg 66w, https://blog.architizer.com/wp-content/uploads/Cornell-Tech_Photo-by-Max-Touhey_Image-2-400x300.jpg 400w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-201884\"\u003e\u003cem\u003eCornell Tech, photograph by Max Touhey.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eThis two-part walking tour explores the architectural and civic ambitions of Roosevelt Island, beginning with Cornell Tech’s high-performance campus and concluding at Louis Kahn’s Four Freedoms Park. Highlights include the Bloomberg Center, the Tata Innovation Hub and The House — one of the world’s largest Passive House residential buildings — followed by a guided discussion of Kahn’s axial granite memorial and its role as a site of political reflection and urban poise.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://nycxdesign.org/event/school-of-constructed-environments-end-of-year-exhibition-2025/\"\u003eSchool of Constructed Environments: End of Year Exhibition 2025\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eParsons, The New School, Starr Foundation Hall, 63 Fifth Avenue, New York, NY 10011\u003c/h4\u003e\n\u003ch5\u003eOpening: Wednesday, May 14, 2025, 6:00 – 9:00 PM\u003cbr/\u003e\nOn view through May 19, 2025\u003c/h5\u003e\n\u003cp\u003eParsons’ School of Constructed Environments presents its annual graduate showcase across architecture, interior, lighting and product design. The exhibition offers a direct look at how the next generation is responding to contemporary spatial challenges through new formats, tools and ways of thinking — all displayed in one collective environment.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eThe Extended Entry Deadline for Architizer\u0026#39;s 2025 \u003c/i\u003e\u003ca href=\"https://enter.architizerproductawards.com/?utm_source=mailchimp\u0026amp;utm_medium=newsletter\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003e\u003ci\u003eA+Product Awards\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003ci\u003e is \u003cstrong\u003eFriday, February 21st\u003c/strong\u003e.\u003c/i\u003e\u003ci\u003e Get your brand in front of the AEC industry’s most renowned designers by \u003c/i\u003e\u003ca href=\"https://www.architizerproductawards.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003e\u003ci\u003esubmitting today\u003c/i\u003e\u003c/span\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-05-13T15:01:14Z",
  "modifiedTime": "2025-05-13T17:49:35Z"
}
