{
  "id": "107f8933-5d4f-4788-b215-52818c362b5e",
  "title": "Digvesh Rathi: From Club Matches To Being LSG's 'Go-To' Man",
  "link": "https://sports.ndtv.com/cricket/digvesh-rathi-from-club-matches-to-being-lsgs-go-to-man-the-inspirational-journey-8094110",
  "description": "Digvesh Rathi has been excellent for LSG in his maiden IPL season.",
  "author": "",
  "published": "Sun, 06 Apr 2025 00:17:17 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 4080,
  "excerpt": "Digvesh Rathi has been excellent for LSG in his maiden IPL season.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "Digvesh Rathi in action in IPL 2025.© BCCI/Sportzpics During domestic cricket season, Vijay Dahiya lives out of suitcase hopping from one Indian city to another fulfilling his broadcast commitments. But if he happens to be in Delhi during summer months, the former India keeper-batter would be watching Hot Weather club cricket at some ground and that's how he first discovered a gangly leg-break bowler -- Digvesh Singh Rathi with a high-arm action. It is learnt that once Dahiya saw Rathi bowling at the Jamia Milia Islamia University ground (where Delhi had played a number of Ranji Trophy games), he spoke to Ayush Badoni, who was also playing that particular club game.\"Ayush, this boy would play IPL in next couple of years,\" Dahiya didn't mind being a soothsayer during his conversation with Badoni, who was already with LSG back then.On Friday night, Dahiya, whose eye for spotting talent has been unquestionable, must have felt chuffed watching Rathi stop a star-studded Mumbai Indians on their tracks with figures of 1 for 21.It included eight dot balls and a beautiful googly to send in-form Naman Dhir back.It has not been a smooth ride for Digvesh, who turned 25 last December, as he had to deal with the fickle selection policies of Delhi cricket.Hailing from Sushila Garden located in North East Delhi's Seemapuri area, Digvesh was picked for Delhi U-23 squad back in 2018-19 season but didn't get to play a single game.He was dropped the following season and then there was no trace of him till the 2022-23 season when the BCCI had changed the U-23 competition to U-25 and Rathi played 10 games across red and white ball formats for Delhi.This season post his Delhi Premier League (DPL) success, Rathi played two Syed Mushtaq Ali T20 games against Arunachal Pradesh and Manipur and people in Delhi cricket are surprised as to why head coach Sarandeep Singh and selection committee did not think of playing him in more games. \"He did decently well but it was Suyash, who was playing for KKR during the 2023 IPL. Digvesh's moment came when Vijay Dahiya, who was coach of Purani Delhi 6, once again saw him perform for South Delhi Superstars during the last DPL. DPL actually turned out to be a game-changer for Digvesh,\" said a DDCA official, who has watched Digvesh's progress from close range.\"Vijay has been tracking him for three years. He is a very close friend of RCB leg-spinner Suyash Sharma. One is from Seemapuri and the other lives in Bhajanpura. Both come from North East Delhi constituency,\" he shared information about the leg-spinner with a flowing mane.\"Dono dost, ek saath practice bhi kiya karte thee. Koi bhi ground mein jagah mila, toh dono training karte the. (The two friends would train whichever ground was available for them. He was a net bowler at DC two years back and also went for trials with MI. Last year, he also appeared for trials at LSG,\" the DDCA official added.Before this season's LSG camp, Dahiya, who was back with the franchise, personally monitored the 15-day net session for Digvesh at the St Stephen's College ground.Digvesh has already copped 50 percent fines in both games for his tick the notebook celebrations and senior players in LSG team management would certainly come around and explain the dos and don'ts at the elite level.The celebrations involving Priyansh Arya during Punjab Kings was more about a game of one upmanship between two friends who played for the same franchise in the DPL.\"Priyansh told him before the match that I will hit you for six and Digvesh had challenged him that he would get him out. It's healthy banter between friends.\" Ask Dahiya about Rathi's strong points, the wily coach doesn't want to disclose anything for public consumption apart from what is there in-front of the viewers.He believes that Rathi will go the distance but he should be allowed to focus on his game.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2025-04/m0kdoelg_digvesh-rathi-bcci_625x300_05_April_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2025-04/m0kdoelg_digvesh-rathi-bcci_625x300_05_April_25.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"Digvesh Rathi: From Club Matches To Being LSG\u0026#39;s \u0026#39;Go-To\u0026#39; Man, The Inspirational Journey\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eDigvesh Rathi in action in IPL 2025.\u003cspan\u003e© BCCI/Sportzpics\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eDuring domestic cricket season, Vijay Dahiya lives out of suitcase hopping from one Indian city to another fulfilling his broadcast commitments. But if he happens to be in Delhi during summer months, the former India keeper-batter would be watching Hot Weather club cricket at some ground and that\u0026#39;s how he first discovered a gangly leg-break bowler -- Digvesh Singh Rathi with a high-arm action. It is learnt that once Dahiya saw Rathi bowling at the Jamia Milia Islamia University ground (where Delhi had played a number of Ranji Trophy games), he spoke to Ayush Badoni, who was also playing that particular club game.\u003c/p\u003e\u003cp\u003e\u0026#34;Ayush, this boy would play IPL in next couple of years,\u0026#34; Dahiya didn\u0026#39;t mind being a soothsayer during his conversation with Badoni, who was already with LSG back then.\u003c/p\u003e\u003cp\u003eOn Friday night, Dahiya, whose eye for spotting talent has been unquestionable, must have felt chuffed watching Rathi stop a star-studded Mumbai Indians on their tracks with figures of 1 for 21.\u003c/p\u003e\u003cp\u003eIt included eight dot balls and a beautiful googly to send in-form Naman Dhir back.\u003c/p\u003e\u003cp\u003eIt has not been a smooth ride for Digvesh, who turned 25 last December, as he had to deal with the fickle selection policies of Delhi cricket.\u003c/p\u003e\u003cp\u003eHailing from Sushila Garden located in North East Delhi\u0026#39;s Seemapuri area, Digvesh was picked for Delhi U-23 squad back in 2018-19 season but didn\u0026#39;t get to play a single game.\u003c/p\u003e\u003cp\u003eHe was dropped the following season and then there was no trace of him till the 2022-23 season when the BCCI had changed the U-23 competition to U-25 and Rathi played 10 games across red and white ball formats for Delhi.\u003c/p\u003e\u003cp\u003eThis season post his Delhi Premier League (DPL) success, Rathi played two Syed Mushtaq Ali T20 games against Arunachal Pradesh and Manipur and people in Delhi cricket are surprised as to why head coach Sarandeep Singh and selection committee did not think of playing him in more games. \u0026#34;He did decently well but it was Suyash, who was playing for KKR during the 2023 IPL. Digvesh\u0026#39;s moment came when Vijay Dahiya, who was coach of Purani Delhi 6, once again saw him perform for South Delhi Superstars during the last DPL. DPL actually turned out to be a game-changer for Digvesh,\u0026#34; said a DDCA official, who has watched Digvesh\u0026#39;s progress from close range.\u003c/p\u003e\u003cp\u003e\u0026#34;Vijay has been tracking him for three years. He is a very close friend of RCB leg-spinner Suyash Sharma. One is from Seemapuri and the other lives in Bhajanpura. Both come from North East Delhi constituency,\u0026#34; he shared information about the leg-spinner with a flowing mane.\u003c/p\u003e\u003cp\u003e\u0026#34;Dono dost, ek saath practice bhi kiya karte thee. Koi bhi ground mein jagah mila, toh dono training karte the. (The two friends would train whichever ground was available for them. He was a net bowler at DC two years back and also went for trials with MI. Last year, he also appeared for trials at LSG,\u0026#34; the DDCA official added.\u003c/p\u003e\u003cp\u003eBefore this season\u0026#39;s LSG camp, Dahiya, who was back with the franchise, personally monitored the 15-day net session for Digvesh at the St Stephen\u0026#39;s College ground.\u003c/p\u003e\u003cp\u003eDigvesh has already copped 50 percent fines in both games for his tick the notebook celebrations and senior players in LSG team management would certainly come around and explain the dos and don\u0026#39;ts at the elite level.\u003c/p\u003e\u003cp\u003eThe celebrations involving Priyansh Arya during Punjab Kings was more about a game of one upmanship between two friends who played for the same franchise in the DPL.\u003c/p\u003e\u003cp\u003e\u0026#34;Priyansh told him before the match that I will hit you for six and Digvesh had challenged him that he would get him out. It\u0026#39;s healthy banter between friends.\u0026#34; Ask Dahiya about Rathi\u0026#39;s strong points, the wily coach doesn\u0026#39;t want to disclose anything for public consumption apart from what is there in-front of the viewers.\u003c/p\u003e\u003cp\u003eHe believes that Rathi will go the distance but he should be allowed to focus on his game.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-06T00:17:17+05:30",
  "modifiedTime": null
}
