{
  "id": "1ba86dc1-ae72-4ea6-97be-bf68c33d8fdc",
  "title": "England 'may need to manage Stokes' bowling'",
  "link": "https://www.bbc.com/sport/cricket/articles/c9dpg3l020do",
  "description": "Assistant coach Marcus Trescothick admits England may have to manage Ben Stokes' bowling after the captain suffers another hamstring injury.",
  "author": "",
  "published": "Mon, 16 Dec 2024 10:40:30 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Stephan Shemilt",
  "length": 2603,
  "excerpt": "Assistant coach Marcus Trescothick admits England may have to manage Ben Stokes' bowling after the captain suffers another hamstring injury.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Assistant coach Marcus Trescothick admitted England may have to manage Ben Stokes' bowling workload after the captain sustained another hamstring injury.Stokes pulled up on the third afternoon of the third Test against New Zealand and will have a scan overnight.The 33-year-old's 36.2 overs in this Test are his most in a single match since June 2022.\"Maybe it's a case that you manage his bowling loads and he doesn't bowl the volume that he's bowled in this game,\" said Trescothick. \"We'll just have to look at how we manage it.\"Along with all-time greats Jacques Kallis and Sir Garfield Sobers, Stokes is among only three all-rounders to have scored at least 6,000 runs and taken more than 200 wickets in Test cricket.For much of 2023 his bowling was hampered by a long-term left-knee injury, upon which he had surgery at the end of that year.He returned to playing a full role as a bowler in the England side, but this latest problem is the second injury to his left hamstring in five months.The first was sustained playing in The Hundred in August, causing Stokes to miss four Tests.Again appearing to be at full fitness in New Zealand, the 66.1 overs he has bowled in this series are his most as captain. The 23 overs he sent down on the first day of the third Test in Hamilton are the most he has bowled in a single day.\"It's always challenging when it's in the same area as before,\" former England opener Trescothick told BBC Sport. \"Is it the same injury? We don't know. Until we get those scan results we're not going to know.\"Stokes was bowling his third over of the third day when he felt the injury in his hamstring and immediately left the field. Unlike the issue in The Hundred, when Stokes was helped off the field at Old Trafford, he was able to leave under his own steam.He did not appear for the rest of the New Zealand second innings, as the home side piled on 453 to set England an improbable 658 to win. The tourists slipped to 18-2 by the close.Following play, Stokes limped away from the England dressing room with his hamstring strapped.\"Naturally, he was upset,\" said Trescothick. \"That has calmed down a little bit now. He's done plenty of icing, and seen the doctors and the physio. He'll get advice, then hopefully that makes a decision for him.\"Stokes was due to play for MI Cape Town in the SA T20 in January, a stint that now looks in severe doubt. The slim chance that Stokes may have been chosen to play for England in the Champions Trophy also looks to be over.England's next Test is not until May, when they host Zimbabwe for a one-off four-day match at Trent Bridge.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2564/live/cdf5e460-bb95-11ef-acfc-7396dc948a8a.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAssistant coach Marcus Trescothick admitted England may have to manage Ben Stokes\u0026#39; bowling workload after the captain sustained another hamstring injury.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eStokes pulled up on the third afternoon of the third Test against New Zealand and will have a scan overnight.\u003c/p\u003e\u003cp\u003eThe 33-year-old\u0026#39;s 36.2 overs in this Test are his most in a single match since June 2022.\u003c/p\u003e\u003cp\u003e\u0026#34;Maybe it\u0026#39;s a case that you manage his bowling loads and he doesn\u0026#39;t bowl the volume that he\u0026#39;s bowled in this game,\u0026#34; said Trescothick. \u0026#34;We\u0026#39;ll just have to look at how we manage it.\u0026#34;\u003c/p\u003e\u003cp\u003eAlong with all-time greats Jacques Kallis and Sir Garfield Sobers, Stokes is among only three all-rounders to have scored at least 6,000 runs and taken more than 200 wickets in Test cricket.\u003c/p\u003e\u003cp\u003eFor much of 2023 his bowling was hampered by a long-term left-knee injury, upon which he had surgery at the end of that year.\u003c/p\u003e\u003cp\u003eHe returned to playing a full role as a bowler in the England side, but this latest problem is the second injury to his left hamstring in five months.\u003c/p\u003e\u003cp\u003eThe first was sustained playing in The Hundred in August, causing Stokes to miss four Tests.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAgain appearing to be at full fitness in New Zealand, the 66.1 overs he has bowled in this series are his most as captain. The 23 overs he sent down on the first day of the third Test in Hamilton are the most he has bowled in a single day.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s always challenging when it\u0026#39;s in the same area as before,\u0026#34; former England opener Trescothick told BBC Sport. \u003c/p\u003e\u003cp\u003e\u0026#34;Is it the same injury? We don\u0026#39;t know. Until we get those scan results we\u0026#39;re not going to know.\u0026#34;\u003c/p\u003e\u003cp\u003eStokes was bowling his third over of the third day when he felt the injury in his hamstring and immediately left the field. Unlike the issue in The Hundred, when Stokes was helped off the field at Old Trafford, he was able to leave under his own steam.\u003c/p\u003e\u003cp\u003eHe did not appear for the rest of the New Zealand second innings, as the home side piled on 453 to set England an improbable 658 to win. The tourists slipped to 18-2 by the close.\u003c/p\u003e\u003cp\u003eFollowing play, Stokes limped away from the England dressing room with his hamstring strapped.\u003c/p\u003e\u003cp\u003e\u0026#34;Naturally, he was upset,\u0026#34; said Trescothick. \u0026#34;That has calmed down a little bit now. He\u0026#39;s done plenty of icing, and seen the doctors and the physio. He\u0026#39;ll get advice, then hopefully that makes a decision for him.\u0026#34;\u003c/p\u003e\u003cp\u003eStokes was due to play for MI Cape Town in the SA T20 in January, a stint that now looks in severe doubt. The slim chance that Stokes may have been chosen to play for England in the Champions Trophy also looks to be over.\u003c/p\u003e\u003cp\u003eEngland\u0026#39;s next Test is not until May, when they host Zimbabwe for a one-off four-day match at Trent Bridge.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-16T10:40:30.384Z",
  "modifiedTime": null
}
