{
  "id": "1d3ef8af-f8b8-4dcd-b690-a94c0f4dfce8",
  "title": "'Something I'll always treasure' - Jensen announces international retirement",
  "link": "https://www.espncricinfo.com/ci/content/story/1487069.html?ex_cid=OTC-RSS",
  "description": "The New Zealand allrounder had been recalled to the T20I squad earlier this year before injury struck",
  "author": "",
  "published": "Fri, 23 May 2025 01:07:42 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ESPNcricinfo staff",
  "length": 1756,
  "excerpt": "The New Zealand allrounder had been recalled to the T20I squad earlier this year before injury struck",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsThe New Zealand allrounder had been recalled to the T20I squad earlier this year before injury struckHayley Jensen played 88 times across ODIs and T20Is  •  Getty ImagesNew Zealand allrounder Hayley Jensen has announced her retirement from international cricket after an 11-year career.Jensen, 32, played 35 ODIs and 53 T20Is having made her debut in 2014. She was part of four T20 World Cup squads - finishing as New Zealand's leading wicket-taker at the 2020 edition in Australia - and also the 2022 ODI World Cup on home soil. She had not featured in ODIs since late 2022 but had been recalled to the T20I squad for the series against Sri Lanka in March after a two-year absence before being ruled out through injury.\"Ever since I was 10 years old, I came home from my first cricket tournament and knew I wanted to be a White Fern,\" Jensen said. \"To have had the chance to live that dream is something I'll always treasure.\"It's been an incredible journey - filled with challenges, growth, unforgettable experiences, and the best group of people I could've hoped to share it with.\"It's never easy to move on from something that's meant this much, but I know in my heart it's time. I'm proud of what we've achieved together and even prouder to have been part of the White Ferns environment.\"New Zealand head coach Ben Sawyer said: \"I want to congratulate Hayley on a fantastic international career and thank her for her contributions to the White Ferns environment\"Hayley has made key contributions to the team with both bat and ball on the field and always brought a genuine passion and love for the game. We wish her all the best for whatever the future holds.\"Jensen will make a decision on whether to continue her domestic career at a later date.",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/317100/317126.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://plus.espn.com/cricket?ex_cid=cricinfonav\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cimg height=\"22\" alt=\"espn plus\" src=\"https://wassets.hscicdn.com/static/images/espn_plus_icon_light.svg\" fetchpriority=\"auto\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv id=\"section-1487069\"\u003e\u003carticle data-id=\"1487069\" data-src=\"/story/new-zealand-news-hayley-jensen-announces-retirement-from-international-cricket-1487069\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eThe New Zealand allrounder had been recalled to the T20I squad earlier this year before injury struck\u003c/p\u003e\u003c/header\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/317100/317126.6.jpg\" alt=\"Hayley Jensen plays one on the off side, New Zealand Women vs England Women, 1st ODI, Christchurch, February 23, 2021\" fetchpriority=\"auto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eHayley Jensen played 88 times across ODIs and T20Is  •  \u003cspan\u003eGetty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eNew Zealand allrounder \u003ca href=\"https://www.espncricinfo.com/cricketers/hayley-jensen-439029\"\u003eHayley Jensen\u003c/a\u003e has announced her retirement from international cricket after an 11-year career.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eJensen, 32, played 35 ODIs and 53 T20Is having made her debut in 2014. She was part of four T20 World Cup squads - finishing as \u003ca href=\"https://www.espncricinfo.com/records/tournament/averages-batting-bowling-by-team/icc-women-s-t20-world-cup-2019-20-12877?team=2614\"\u003eNew Zealand\u0026#39;s leading wicket-taker at the 2020 edition in Australia\u003c/a\u003e - and also the 2022 ODI World Cup on home soil. She had not featured in ODIs since late 2022 but had been recalled to the T20I squad for the series against Sri Lanka in March after a two-year absence before being ruled out through injury.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Ever since I was 10 years old, I came home from my first cricket tournament and knew I wanted to be a White Fern,\u0026#34; Jensen said. \u0026#34;To have had the chance to live that dream is something I\u0026#39;ll always treasure.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s been an incredible journey - filled with challenges, growth, unforgettable experiences, and the best group of people I could\u0026#39;ve hoped to share it with.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s never easy to move on from something that\u0026#39;s meant this much, but I know in my heart it\u0026#39;s time. I\u0026#39;m proud of what we\u0026#39;ve achieved together and even prouder to have been part of the White Ferns environment.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eNew Zealand head coach Ben Sawyer said: \u0026#34;I want to congratulate Hayley on a fantastic international career and thank her for her contributions to the White Ferns environment\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Hayley has made key contributions to the team with both bat and ball on the field and always brought a genuine passion and love for the game. We wish her all the best for whatever the future holds.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eJensen will make a decision on whether to continue her domestic career at a later date.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-23T01:07:00Z",
  "modifiedTime": null
}
