{
  "id": "2b493043-4a60-4a4b-a77b-daa47d420a65",
  "title": "'The perfect batter for his time' - meet India's latest record-breaker",
  "link": "https://www.bbc.com/sport/cricket/articles/cx2plx9g03ko",
  "description": "Meet India's latest batting superstar Abhishek Sharma, who struck a record-breaking 135 in their T20 win over England.",
  "author": "",
  "published": "Sun, 02 Feb 2025 19:42:31 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Matthew Henry",
  "length": 5158,
  "excerpt": "Meet India's latest batting superstar Abhishek Sharma, who struck a record-breaking 135 in their T20 win over England.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "When you are making your way as a batter in India, it helps to have a legend in your corner.Abhishek Sharma brutally destroyed England's bowling by striking 135 in India's crushing victory in the fifth T20.It was the kind of assault his mentor Yuvraj Singh used to inflict. Just ask Stuart Broad.\"He always wanted me to bat until 15 or 20 overs,\" Abhishek said after his destruction was complete - a knock of 54 balls which included 13 sixes, the most by an India batter in T20s.\"Today was my day.\"Abhishek had only just left the field, raising his bat as the Mumbai crowd chanted his name, when Yuvraj delivered his verdict.\"That's where I want to see you,\" said Yuvraj. \"Proud of you.\"Abhishek's relationship with his fellow left-hander Yuvraj goes back to when their paths crossed while playing first-class cricket for Punjab - Yuvraj at the end of his career, Abhishek at the start.What began as a bond between team-mates has taken on a more consistent mentorship in recent years.\"The big backlift and the flow of the bat is very reminiscent of Yuvraj Singh,\" Test Match Special commentator Prakash Wakankar told BBC Sport.\"Yuvi sees in Abhishek some of his unfulfilled career, which was cut short.\"On Abhishek's 24th birthday last year, Yuvraj posted a video on Instagram of the pair practising in the nets. With Yuvraj watching on, Abhishek crunched a straight six.It was a shot he played repeatedly against England - a towering strike off Brydon Carse the highlight.\"That was the special shot that Yuvraj mentioned before, so he was happy with the shots,\" said Abhishek.Abhishek hit India's highest score in a T20 international, beating Shubman Gill's 126 against New Zealand in 2023It was the sixth-highest individual T20 score in a match involving Test-playing nationsHis fifty was scored from 17 balls, the second-fastest for an Indian batter behind Yuvraj's 12-ball half-century against England in 2007His hundred came from 37 deliveries, the third-fastest hundred in a match between Test-playing nations, behind Rohit Sharma and David Miller's 35-ball centuries in the formatHe hit 13 sixes, a record for an India batter in a T20.Abhishek, born in Amritsar as the youngest of three siblings, is the perfect batter for his time in India.After their lacklustre exit at the hands of England in the 2022 World Cup, Rohit Sharma set about implementing a more aggressive style.Rohit led India to the T20 World Cup title in Barbados last June and, when he retired in the aftermath, Abhishek was where India turned.He was given a debut against Zimbabwe in July in India's first series after lifting the trophy in Bridgetown and hit a century in the second match.\"Abhishek scored a massive number of runs in the under-16 nationals but really the transformation began when he went to Sunrisers Hyderabad in the Indian Premier League, having initially played for Delhi Daredevils and not done much,\" said Wakankar.Abhishek had a solid IPL season in 2023 but it was last year he made his name.He was united with Australia batter Travis Head at the top of the order and together the pair helped Sunrisers break the record for the competition's highest total twice.Abhishek, able to work with Sunrisers batting coach Brian Lara, scored at a devastating strike-rate of 204.21 across 16 matches. He scored 484 runs in the season despite never playing an innings lasting more than 29 balls. Against England, he took on all of that brutal yet elegant power-hitting, only this time went on to play the match-winning hand.\"A very welcome change is to see more and more of that Yuvi-esque full face and flow of the bat,\" said Wakankar.\"He gives it the full swing when he plays either side of the wicket and has a good flick when he gets inside the line of the ball.\"All of Abhishek's 13 sixes resulted in England's diet of extreme pace or spin being hit between backward point and long-on.He reached 50 in 17 balls - only Yuvraj himself had got their quicker - and his hundred in 37.It meant England were hit for 100 in the first 6.3 overs and 247 in their 20 - the second-most they have ever conceded.\"I've played quite a lot of cricket and credit to Abhishek Sharma, that ball striking was as clean as I've seen,\" said England captain Jos Buttler. \"He played fantastically well.\"You always sit down and think what more we could've done or how we could've stopped him, but I think some days you have to give a lot of credit to the opposition - he played brilliantly well.\"Former England batter Kevin Pietersen said Abhishek's innings was \"as good as you will see\".\"That was one of the great T20 innings,\" he said. \"It's a very good bowling attack - [Mark] Wood, [Jofra] Archer and Adil Rashid.\"Speaking on TNT Sports, former England bowler Steven Finn said: \"It was quite a ridiculous show of hitting. It was absolutely beautiful. He has not looked to overhit.\"Every time the ball has been in his area, particularly outside off stump, he has smashed it down the ground.\"Former England captain Sir Alastair Cook added: \"It was extraordinary.\"He mis-hit one ball. There was no turn of the bat. Everything was so clean.\"A beautiful bat swing. Absolutely extraordinary.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37cf/live/3d72dba0-e19c-11ef-bd1b-d536627785f2.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eWhen you are making your way as a batter in India, it helps to have a legend in your corner.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eAbhishek Sharma brutally destroyed England\u0026#39;s bowling by striking 135 in \u003ca href=\"https://www.bbc.com/sport/cricket/articles/c203glqgnw7o\"\u003eIndia\u0026#39;s crushing victory in the fifth T20.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIt was the kind of assault his mentor Yuvraj Singh used to inflict. Just \u003ca href=\"https://www.bbc.com/sport/av/cricket/52397653\"\u003eask Stuart Broad\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;He always wanted me to bat until 15 or 20 overs,\u0026#34; Abhishek said after his destruction was complete - a knock of 54 balls which included 13 sixes, the most by an India batter in T20s.\u003c/p\u003e\u003cp\u003e\u0026#34;Today was my day.\u0026#34;\u003c/p\u003e\u003cp\u003eAbhishek had only just left the field, raising his bat as the Mumbai crowd chanted his name, when Yuvraj delivered his verdict.\u003c/p\u003e\u003cp\u003e\u0026#34;That\u0026#39;s where I want to see you,\u0026#34; said Yuvraj. \u0026#34;Proud of you.\u0026#34;\u003c/p\u003e\u003cp\u003eAbhishek\u0026#39;s relationship with his fellow left-hander Yuvraj goes back to when their paths crossed while playing first-class cricket for Punjab - Yuvraj at the end of his career, Abhishek at the start.\u003c/p\u003e\u003cp\u003eWhat began as a bond between team-mates has taken on a more consistent mentorship in recent years.\u003c/p\u003e\u003cp\u003e\u0026#34;The big backlift and the flow of the bat is very reminiscent of Yuvraj Singh,\u0026#34; Test Match Special commentator Prakash Wakankar told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;Yuvi sees in Abhishek some of his unfulfilled career, which was cut short.\u0026#34;\u003c/p\u003e\u003cp\u003eOn Abhishek\u0026#39;s 24th birthday last year, Yuvraj posted a video on Instagram of the pair practising in the nets. With Yuvraj watching on, Abhishek crunched a straight six.\u003c/p\u003e\u003cp\u003eIt was a shot he played repeatedly against England - a towering strike off Brydon Carse the highlight.\u003c/p\u003e\u003cp\u003e\u0026#34;That was the special shot that Yuvraj mentioned before, so he was happy with the shots,\u0026#34; said Abhishek.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003cp\u003eAbhishek hit India\u0026#39;s highest score in a T20 international, beating Shubman Gill\u0026#39;s 126 against New Zealand in 2023\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eIt was the sixth-highest individual T20 score in a match involving Test-playing nations\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHis fifty was scored from 17 balls, the second-fastest for an Indian batter behind Yuvraj\u0026#39;s 12-ball half-century against England in 2007\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHis hundred came from 37 deliveries, the third-fastest hundred in a match between Test-playing nations, behind Rohit Sharma and David Miller\u0026#39;s 35-ball centuries in the format\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHe hit 13 sixes, a record for an India batter in a T20.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAbhishek, born in Amritsar as the youngest of three siblings, is the perfect batter for his time in India.\u003c/p\u003e\u003cp\u003eAfter their lacklustre exit at the hands of England in the 2022 World Cup, Rohit Sharma set about implementing a more aggressive style.\u003c/p\u003e\u003cp\u003eRohit led India to the T20 World Cup title in Barbados last June and, when he retired in the aftermath, Abhishek was where India turned.\u003c/p\u003e\u003cp\u003eHe was given a debut against Zimbabwe in July in India\u0026#39;s first series after lifting the trophy in Bridgetown and hit a century in the second match.\u003c/p\u003e\u003cp\u003e\u0026#34;Abhishek scored a massive number of runs in the under-16 nationals but really the transformation began when he went to Sunrisers Hyderabad in the Indian Premier League, having initially played for Delhi Daredevils and not done much,\u0026#34; said Wakankar.\u003c/p\u003e\u003cp\u003eAbhishek had a solid IPL season in 2023 but it was last year he made his name.\u003c/p\u003e\u003cp\u003eHe was united with Australia batter Travis Head at the top of the order and together the pair helped Sunrisers break the record for the competition\u0026#39;s highest total twice.\u003c/p\u003e\u003cp\u003eAbhishek, able to work with Sunrisers batting coach Brian Lara, scored at a devastating strike-rate of 204.21 across 16 matches. \u003c/p\u003e\u003cp\u003eHe scored 484 runs in the season despite never playing an innings lasting more than 29 balls. Against England, he took on all of that brutal yet elegant power-hitting, only this time went on to play the match-winning hand.\u003c/p\u003e\u003cp\u003e\u0026#34;A very welcome change is to see more and more of that Yuvi-esque full face and flow of the bat,\u0026#34; said Wakankar.\u003c/p\u003e\u003cp\u003e\u0026#34;He gives it the full swing when he plays either side of the wicket and has a good flick when he gets inside the line of the ball.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAll of Abhishek\u0026#39;s 13 sixes resulted in England\u0026#39;s diet of extreme pace or spin being hit between backward point and long-on.\u003c/p\u003e\u003cp\u003eHe reached 50 in 17 balls - only Yuvraj himself had got their quicker - and his hundred in 37.\u003c/p\u003e\u003cp\u003eIt meant England were hit for 100 in the first 6.3 overs and 247 in their 20 - the second-most they have ever conceded.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve played quite a lot of cricket and credit to Abhishek Sharma, that ball striking was as clean as I\u0026#39;ve seen,\u0026#34; said England captain Jos Buttler. \u0026#34;He played fantastically well.\u003c/p\u003e\u003cp\u003e\u0026#34;You always sit down and think what more we could\u0026#39;ve done or how we could\u0026#39;ve stopped him, but I think some days you have to give a lot of credit to the opposition - he played brilliantly well.\u0026#34;\u003c/p\u003e\u003cp\u003eFormer England batter Kevin Pietersen said Abhishek\u0026#39;s innings was \u0026#34;as good as you will see\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;That was one of the great T20 innings,\u0026#34; he said. \u0026#34;It\u0026#39;s a very good bowling attack - [Mark] Wood, [Jofra] Archer and Adil Rashid.\u0026#34;\u003c/p\u003e\u003cp\u003eSpeaking on TNT Sports, former England bowler Steven Finn said: \u0026#34;It was quite a ridiculous show of hitting. It was absolutely beautiful. He has not looked to overhit.\u003c/p\u003e\u003cp\u003e\u0026#34;Every time the ball has been in his area, particularly outside off stump, he has smashed it down the ground.\u0026#34;\u003c/p\u003e\u003cp\u003eFormer England captain Sir Alastair Cook added: \u0026#34;It was extraordinary.\u003c/p\u003e\u003cp\u003e\u0026#34;He mis-hit one ball. There was no turn of the bat. Everything was so clean.\u003c/p\u003e\u003cp\u003e\u0026#34;A beautiful bat swing. Absolutely extraordinary.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-02T19:42:31.272Z",
  "modifiedTime": null
}
