{
  "id": "6c260b28-36e6-4235-bd41-70b22ce3724e",
  "title": "Zimbabwe fans singing 'gave me goosebumps', says centurion Bennett",
  "link": "https://www.espncricinfo.com/ci/content/story/1487217.html?ex_cid=OTC-RSS",
  "description": "Opener produces Test best with 139 off 143 to lift tourists at Trent Bridge",
  "author": "",
  "published": "Fri, 23 May 2025 22:45:36 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Firdose Moonda",
  "length": 4126,
  "excerpt": "Opener produces Test best with 139 off 143 to lift tourists at Trent Bridge",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "It was not Castle Corner at Harare Sports Club but the songs being sung from the stands at Trent Bridge made Brian Bennett feel right at home as he approached a milestone century against England. A small but boisterous group of Zimbabwean fans, including Bennett's parents, were in attendance and though they made up only a few hundred of the 13,282 people at the ground, they filled the air with the sound of thousands more.\"I could hear them singing the war cries as we always hear at Harare Sports Club, so it gave me a little goosebumps,\" Bennett said at the press conference afterwards. \"The reception I got from the crowd was unbelievable.\"Zimbabwean fans have had little to cheer over two gruelling days of cricket on their return to England after a 22-year absence but Bennett gave them reason to believe better days are coming. Among those that have scored Test centuries in the last five years are Sean Williams, Craig Ervine and Gary Ballance. The first two are 38 and 39 respectively and the last of those has joined the coaching staff. So to have 21-year old Bennett raise his bat to three figures twice in the space of six months points to the future; a future in which Zimbabwean cricket may be less reactive and more proactive as they seek to make their case for greater recognition.Bennett cuts himself a slice of history to keep Zimbabwe singingEngland find value in mismatch to get the gang back together in styleBennett blazes century but England scent three-day win after follow-onZimbabwe are not part of the World Test Championship, and don't know how they could be included, but have scheduled 11 Tests this year and Bennett is certain to play a big role. In Nottingham, he showed what he can offer as he scored the fastest hundred by a Zimbabwean inTests and took on the challenge of replying to England's first-innings score of 565 for 6 with intent.\"If it's in my area, I'm going to try and go for it,\" he said. \"It's in my game plan, not too reckless and today it came off. Opening the batting in Test match cricket is probably where I want to bat. It gives me more freedom. There are more gaps in the field, and that suits my game. If I stick to my game plans, I can get the team off to a good start, and that's what happened.\"Zimbabwe were 96 for 1 and 156 for 2 but their middle order was not able to stand up to Ben Stokes, who swung the ball both ways and asked questions Zimbabwe had no answers for. That's hardly their fault. Most of them had never faced the Dukes ball before last week's warm-up match, which Bennett identified as a particular challenge. \"It's not something we face but there's always challenges in cricket. You're only going to grow when you go out of your comfort zone,\" he said.Bennett said he had also never faced a short-ball barrage in Tests before, having only played in Belfast, Bulawayo and Bangladesh before. His school coach Andrew Birch told ESPNcricinfo that Bennett was unusually strong on the back foot for a youngster and he showed that with a selection of strong cut shots, including the shot that took him to his century - although he was eventually bounced out by Josh Tongue.Getting a hundred means he will go up on the honours board, alongside fellow Zimbabwean Murray Goodwin which he described as \"inspiring\", and someone whose name he saw being inscribed just a few hours ago. \"This morning I saw them putting up Zak Crawley's name and I thought, 'ooooh, it would be nice to be there as well,' so a few hours later, my name will be there. What a feeling.\"Better than his first century against Afghanistan in Bulawayo? \"Probably, yes,\" he said. \"This one tops that. To do it against England in England at Trent Bridge with a full crowd, with lots of Zimbabweans as well as my family, it's going to take a good performance to beat this one.\"But at 21, he knows the best could be yet to come. \"I'm still young, I'm still young. I'm still going to learn and adapt to different bowling strategies.\"And for Zimbabwean fans, that may mean they need some new songs to match.Firdose Moonda is ESPNcricinfo's correspondent for South Africa and women's cricket",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/400900/400989.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIt was not Castle Corner at Harare Sports Club but the songs being sung from the stands at Trent Bridge made \u003ca href=\"https://www.espncricinfo.com/cricketers/brian-bennett-1071484\"\u003eBrian Bennett\u003c/a\u003e feel right at home as he approached a milestone century against England. A small but boisterous group of Zimbabwean fans, including Bennett\u0026#39;s parents, were in attendance and though they made up only a few hundred of the 13,282 people at the ground, they filled the air with the sound of thousands more.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I could hear them singing the war cries as we always hear at Harare Sports Club, so it gave me a little goosebumps,\u0026#34; Bennett said at the press conference afterwards. \u0026#34;The reception I got from the crowd was unbelievable.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eZimbabwean fans have had little to cheer over \u003ca href=\"https://www.espncricinfo.com/series/zimbabwe-in-england-2025-1392687/england-vs-zimbabwe-only-test-1392691/live-cricket-score\"\u003etwo gruelling days of cricket \u003c/a\u003eon their return to England after a 22-year absence but Bennett gave them reason to believe better days are coming. Among those that have scored Test centuries in the last five years are Sean Williams, Craig Ervine and Gary Ballance. The first two are 38 and 39 respectively and the last of those has joined the coaching staff. So to have 21-year old Bennett raise his bat to three figures twice in the space of six months points to the future; a future in which Zimbabwean cricket may be less reactive and more proactive as they seek to make their case for greater recognition.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/eng-vs-zim-mens-test-brian-bennett-cuts-himself-a-slice-of-history-to-keep-zimbabwe-singing-1487196\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eBennett cuts himself a slice of history to keep Zimbabwe singing\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/eng-vs-zim-men-s-test-england-find-value-in-mismatch-to-get-the-gang-back-together-in-style-1487058\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eEngland find value in mismatch to get the gang back together in style\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/zimbabwe-in-england-2025-1392687/england-vs-zimbabwe-only-test-1392691/match-report-2\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eBennett blazes century but England scent three-day win after follow-on\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/team/zimbabwe-9\"\u003eZimbabwe\u003c/a\u003e are not part of the World Test Championship, and don\u0026#39;t know how they could be included, but have scheduled 11 Tests this year and Bennett is certain to play a big role. In Nottingham, he showed what he can offer as he scored the fastest hundred by a Zimbabwean inTests and took on the challenge of replying to England\u0026#39;s first-innings score of 565 for 6 with intent.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;If it\u0026#39;s in my area, I\u0026#39;m going to try and go for it,\u0026#34; he said. \u0026#34;It\u0026#39;s in my game plan, not too reckless and today it came off. Opening the batting in Test match cricket is probably where I want to bat. It gives me more freedom. There are more gaps in the field, and that suits my game. If I stick to my game plans, I can get the team off to a good start, and that\u0026#39;s what happened.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eZimbabwe were 96 for 1 and 156 for 2 but their middle order was not able to stand up to Ben Stokes, who swung the ball both ways and asked questions Zimbabwe had no answers for. That\u0026#39;s hardly their fault. Most of them had never faced the Dukes ball before last week\u0026#39;s warm-up match, which Bennett identified as a particular challenge. \u0026#34;It\u0026#39;s not something we face but there\u0026#39;s always challenges in cricket. You\u0026#39;re only going to grow when you go out of your comfort zone,\u0026#34; he said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBennett said he had also never faced a short-ball barrage in Tests before, having only played in Belfast, Bulawayo and Bangladesh before. His school coach Andrew Birch told ESPNcricinfo that Bennett was unusually strong on the back foot for a youngster and he showed that with a selection of strong cut shots, including the shot that took him to his century - although he was eventually bounced out by Josh Tongue.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eGetting a hundred means he will go up on the honours board, alongside fellow Zimbabwean \u003ca href=\"https://www.espncricinfo.com/cricketers/murray-goodwin-55456\"\u003eMurray Goodwin\u003c/a\u003e which he described as \u0026#34;inspiring\u0026#34;, and someone whose name he saw being inscribed just a few hours ago. \u0026#34;This morning I saw them putting up Zak Crawley\u0026#39;s name and I thought, \u0026#39;ooooh, it would be nice to be there as well,\u0026#39; so a few hours later, my name will be there. What a feeling.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBetter than his first century against Afghanistan in Bulawayo? \u0026#34;Probably, yes,\u0026#34; he said. \u0026#34;This one tops that. To do it against England in England at Trent Bridge with a full crowd, with lots of Zimbabweans as well as my family, it\u0026#39;s going to take a good performance to beat this one.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBut at 21, he knows the best could be yet to come. \u0026#34;I\u0026#39;m still young, I\u0026#39;m still young. I\u0026#39;m still going to learn and adapt to different bowling strategies.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAnd for Zimbabwean fans, that may mean they need some new songs to match.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eFirdose Moonda is ESPNcricinfo\u0026#39;s correspondent for South Africa and women\u0026#39;s cricket\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-23T19:15:00Z",
  "modifiedTime": null
}
