{
  "id": "75798cca-2366-42f0-b24f-4d4c7766899f",
  "title": "R Ashwin Reflects On Resolve To Maintain India's Home Dominance. Video",
  "link": "https://sports.ndtv.com/cricket/r-ashwin-reflects-on-resolve-to-maintain-indias-home-dominance-in-heartwarming-tribute-video-7296149",
  "description": "The Board of Control for Cricket in India on Friday posted a heartwarming tribute video for recently retired spinner Ravichandran Ashwin.",
  "author": "",
  "published": "Fri, 20 Dec 2024 22:49:52 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "",
  "length": 4312,
  "excerpt": "The Board of Control for Cricket in India on Friday posted a heartwarming tribute video for recently retired spinner Ravichandran Ashwin.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "The Board of Control for Cricket in India (BCCI) on Friday posted a heartwarming tribute video for recently retired spinner Ravichandran Ashwin, who reflected on a very big promise he made to himself early in his career when Indian team registered a series loss against England at home. Ashwin, who announced his retirement at the end of the Brisbane Test against Australia on Wednesday, was a crucial architect of India's home domination that lasted for over 12 years and kickstarted after India's loss to England in a Test series in 2012. India lost the series at home to England in 2012 by 1-2 and Ashwin was early in his international career during that series. Ashwin did end up as India's second-highest wicket-taker in that series with 14 scalps and overall at fourth spot, but his bowling average of 52.64 and no four or five-wicket hauls meant he was outbowled by England pair of Monty Panesar and Graeme Swann (17 and 20 wickets respectively) and compatriot Pragyan Ojha, who topped the charts with 20 scalps at an average of around 30 and two five-wicket hauls and best figures of 5/45.Ashwin, then a youngster, was dejected by this series loss and most importantly, a setback at familiar home conditions. In the BCCI video, Ashwin reminisced how he promised himself that he would make sure India would not lose a series once again at home.\"I made myself a promise in 2012, we lost a tricky series against England. I was very early in my career and I was just telling myself we are not gonna lose another one. Ever. And that is what I promised myself,\" said Ashwin. — BCCI (@BCCI) December 20, 2024 Ashwin indeed lived up to that promise. From 2013's home series against Australia to this year's home series against Bangladesh, the legend topped the bowling charts in an unbeaten run at home with 329 scalps at an average of 20.62, with best figures of 7/59. He also took 24 five-wicket hauls and five ten-wicket hauls all this while. With the bat, he contributed 1,556 runs in 56 matches and 70 innings at an average of 22.88, with three centuries and six fifties and best score of 124. With both bat and ball, Ashwin was a key architect of India's home dominance which came to an end during a 0-3 whitewash against New Zealand this year.Speaking on his accomplishments at the time of his retirement, Ashwin said that he did not expect that he would go on to accomplish so much.\"But in 2011, had someone told me I would getting so many wickets and retiring in 2024, December, I would not have believed them. This is a game I love but I did not expect I would be getting so much love and wickets and so many runs as well. I am glad, to have a sense of gratitude to all who supported me and challenged me. Thank you,\" he concluded.In 106 Tests for India, the legendary all-rounder took 537 wickets at an average of 24.00, with best figures of 7/59. He took 37 five-wicket hauls and eight ten-fers in his Test career. He is the seventh-highest wicket-taker in Tests overall and second-highest for India behind legendary spinner Anil Kumble (619 scalps). He also has 2nd most five-wicket hauls in Tests, behind Sri Lankan spin icon Muttiah Muralitharan (67).He also made 3,503 runs at an average of 25.75, with six centuries and 14 fifties in 151 innings and best score of 124.In 116 ODIs, the ace spinner took 156 wickets at an average of 33.20, with best figures of 4/25. He also made 707 runs at an average of 16.44, with one fifty, a knock of 65 in 63 innings. He is the 13th-highest wicket-taker in ODIs for India.In 65 T20Is, he took 72 wickets at an average of 23.22. His best figures are 4/8. He also scored 184 runs in 19 innings at an average of 26.28, with best score of 31. He is the sixth-highest wicket-taker for India in T20Is.With 765 scalps in 287 matches, he is India's second-highest wicket-taker across all formats, next to Kumble (953)He also won the 2011 50-Over World Cup and 2013 Champions Trophy with India.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2024-12/hgesnsng_r-ashwin-afp_625x300_20_December_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                        \n                                                \u003cp\u003eThe Board of Control for Cricket in India (BCCI) on Friday posted a heartwarming tribute video for recently retired spinner Ravichandran Ashwin, who reflected on a very big promise he made to himself early in his career when Indian team registered a series loss against England at home. Ashwin, who announced his retirement at the end of the Brisbane Test against Australia on Wednesday, was a crucial architect of India\u0026#39;s home domination that lasted for over 12 years and kickstarted after India\u0026#39;s loss to England in a Test series in 2012.\u003c/p\u003e\n\n\u003cp\u003eIndia lost the series at home to England in 2012 by 1-2 and Ashwin was early in his international career during that series. Ashwin did end up as India\u0026#39;s second-highest wicket-taker in that series with 14 scalps and overall at fourth spot, but his bowling average of 52.64 and no four or five-wicket hauls meant he was outbowled by England pair of Monty Panesar and Graeme Swann (17 and 20 wickets respectively) and compatriot Pragyan Ojha, who topped the charts with 20 scalps at an average of around 30 and two five-wicket hauls and best figures of 5/45.\u003c/p\u003e\u003cp\u003eAshwin, then a youngster, was dejected by this series loss and most importantly, a setback at familiar home conditions. In the BCCI video, Ashwin reminisced how he promised himself that he would make sure India would not lose a series once again at home.\u003c/p\u003e\u003cp\u003e\u0026#34;I made myself a promise in 2012, we lost a tricky series against England. I was very early in my career and I was just telling myself we are not gonna lose another one. Ever. And that is what I promised myself,\u0026#34; said Ashwin.\u003c/p\u003e\u003cblockquote\u003e\n\n— BCCI (@BCCI) \u003ca href=\"https://twitter.com/BCCI/status/1870099333020004568?ref_src=twsrc%5Etfw\"\u003eDecember 20, 2024\u003c/a\u003e\u003c/blockquote\u003e\n\u003cp\u003eAshwin indeed lived up to that promise. From 2013\u0026#39;s home series against Australia to this year\u0026#39;s home series against Bangladesh, the legend topped the bowling charts in an unbeaten run at home with 329 scalps at an average of 20.62, with best figures of 7/59. He also took 24 five-wicket hauls and five ten-wicket hauls all this while. With the bat, he contributed 1,556 runs in 56 matches and 70 innings at an average of 22.88, with three centuries and six fifties and best score of 124. With both bat and ball, Ashwin was a key architect of India\u0026#39;s home dominance which came to an end during a 0-3 whitewash against New Zealand this year.\u003c/p\u003e\u003cp\u003eSpeaking on his accomplishments at the time of his retirement, Ashwin said that he did not expect that he would go on to accomplish so much.\u003c/p\u003e\u003cp\u003e\u0026#34;But in 2011, had someone told me I would getting so many wickets and retiring in 2024, December, I would not have believed them. This is a game I love but I did not expect I would be getting so much love and wickets and so many runs as well. I am glad, to have a sense of gratitude to all who supported me and challenged me. Thank you,\u0026#34; he concluded.\u003c/p\u003e\u003cp\u003eIn 106 Tests for India, the legendary all-rounder took 537 wickets at an average of 24.00, with best figures of 7/59. He took 37 five-wicket hauls and eight ten-fers in his Test career. He is the seventh-highest wicket-taker in Tests overall and second-highest for India behind legendary spinner Anil Kumble (619 scalps). He also has 2nd most five-wicket hauls in Tests, behind Sri Lankan spin icon Muttiah Muralitharan (67).\u003c/p\u003e\u003cp\u003eHe also made 3,503 runs at an average of 25.75, with six centuries and 14 fifties in 151 innings and best score of 124.\u003c/p\u003e\u003cp\u003eIn 116 ODIs, the ace spinner took 156 wickets at an average of 33.20, with best figures of 4/25. He also made 707 runs at an average of 16.44, with one fifty, a knock of 65 in 63 innings. He is the 13th-highest wicket-taker in ODIs for India.\u003c/p\u003e\u003cp\u003eIn 65 T20Is, he took 72 wickets at an average of 23.22. His best figures are 4/8. He also scored 184 runs in 19 innings at an average of 26.28, with best score of 31. He is the sixth-highest wicket-taker for India in T20Is.\u003c/p\u003e\u003cp\u003eWith 765 scalps in 287 matches, he is India\u0026#39;s second-highest wicket-taker across all formats, next to Kumble (953)\u003c/p\u003e\u003cp\u003eHe also won the 2011 50-Over World Cup and 2013 Champions Trophy with India.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\n                                            \n                                            \n                                        \n                                            \u003cdiv\u003e\n                                                \u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n                                                \n                                            \u003c/div\u003e\n                                        \n\n                                        \n                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-20T22:49:52+05:30",
  "modifiedTime": null
}
