{
  "id": "7fab36c2-335c-4d4b-869f-77103aec37c3",
  "title": "Middlesex appoint Dane Vilas as interim first-team coach",
  "link": "https://www.espncricinfo.com/ci/content/story/1490941.html?ex_cid=OTC-RSS",
  "description": "Former Lancashire captain takes reins at Lord's in first major coaching assignment",
  "author": "",
  "published": "Thu, 19 Jun 2025 22:21:18 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ESPNcricinfo staff",
  "length": 2926,
  "excerpt": "Former Lancashire captain takes reins at Lord's in first major coaching assignment",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsFormer Lancashire captain takes reins at Lord's in first major coaching assignmentDane Vilas has been made interim first-team coach at Middlesex  •  Middlesex CCCMiddlesex have appointed former South Africa wicketkeeper-batter Dane Vilas as interim first-team coach until the end of the season. The move comes two days after Richard Johnson departed after three-and-a-half seasons in the role.Vilas, 40, retired from first-class cricket at the end of the 2023 season after seven years with Lancashire, although he continued to play in the SA20. He has been based in London for some time and will take charge at Middlesex with immediate effect.The club are currently third from bottom in Division Two of the County Championship, having won just twice in the opening block of seven games. They are in a similar position in the Blast, winning for only the second time this season on Thursday evening, shortly before Vilas' appointment was announced.Vilas announces Lancashire departureJohnson departs role as Middlesex first-team coach\"I am delighted to welcome Dane to the club as our Interim first-team coach,\" Middlesex's director of cricket, Alan Coleman, said. \"He has a wealth of experience to offer our squad, and I believe that we will all benefit from his presence and leadership across the rest of this season.\"Though Dane is still early in his coaching career, having only finished playing for Lancashire in 2023, I am confident that his leadership presence, competitive edge and experience of all formats, including franchise cricket, will have a huge impact on our squad.\"It is the leadership qualities that were evident when he captained Lancashire that drew me towards Dane. The teams that he has led played hard, committed, never-say-die cricket and I believe that is a style that will resonate well with our players, staff group and members.\"Dane will be supported by what I believe is an exceptional coaching team of Rory Coutts, Tim Murtagh and Ian Salisbury, who all bring variety and wide-ranging knowledge to our team.\"I am sure you will all joining me in welcoming Dane over the coming weeks as we look forward to the rest of our season. There is still a lot to play for and I am excited to see where our talented playing group can take us.\"Vilas played six Tests and one T20I for South Africa before joining Lancashire on a Kolpak contract. He was subsequently made club captain, leading the team to T20 Finals Day on three occasions and back-to-back runners-up finishes in the County Championship.Vilas said: \"It's an absolute honour to be here. Lord's is such a special place and I'm looking forward to getting started with the squad. The potential is endless for the group and I'll be keen to harness that and help grow their careers.\"I've got good relationships with Rory Coutts, Tim Murtagh and Ian Salisbury, so to have the four of us together is fantastic and I'm really looking forward to it.\"",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/402300/402338.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://plus.espn.com/cricket?ex_cid=cricinfonav\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cimg height=\"22\" alt=\"espn plus\" src=\"https://wassets.hscicdn.com/static/images/espn_plus_icon_light.svg\" fetchpriority=\"auto\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv id=\"section-1490941\"\u003e\u003carticle data-id=\"1490941\" data-src=\"/story/middlesex-appoint-dane-vilas-interim-first-team-coach-1490941\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eFormer Lancashire captain takes reins at Lord\u0026#39;s in first major coaching assignment\u003c/p\u003e\u003c/header\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/402300/402338.6.jpg\" alt=\"Dane Vilas has been made interim first-team coach at Middlesex, Lord\u0026#39;s, June 19, 2025\" fetchpriority=\"auto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eDane Vilas has been made interim first-team coach at Middlesex  •  \u003cspan\u003eMiddlesex CCC\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/team/middlesex-1190\"\u003eMiddlesex\u003c/a\u003e have appointed former South Africa wicketkeeper-batter \u003ca href=\"https://www.espncricinfo.com/cricketers/dane-vilas-262456\"\u003eDane Vilas\u003c/a\u003e as interim first-team coach until the end of the season. The move comes two days\u003ca href=\"https://www.espncricinfo.com/story/richard-johnson-departs-role-as-middlesex-first-team-coach-1490610\"\u003e after Richard Johnson departed\u003c/a\u003e after three-and-a-half seasons in the role.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eVilas, 40, retired from first-class cricket at the end of the 2023 season after seven years with Lancashire, although he continued to play in the SA20. He has been based in London for some time and will take charge at Middlesex with immediate effect.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe club are currently third from bottom in Division Two of the County Championship, having won just twice in the opening block of seven games. They are in a similar position in the Blast, winning for only the second time this season on Thursday evening, shortly before Vilas\u0026#39; appointment was announced.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/dane-vilas-announces-lancashire-departure-1392543\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eVilas announces Lancashire departure\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/richard-johnson-departs-role-as-middlesex-first-team-coach-1490610\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eJohnson departs role as Middlesex first-team coach\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I am delighted to welcome Dane to the club as our Interim first-team coach,\u0026#34; Middlesex\u0026#39;s director of cricket, \u003ca href=\"https://www.espncricinfo.com/cricketers/alan-coleman-11517\"\u003eAlan Coleman\u003c/a\u003e, said. \u0026#34;He has a wealth of experience to offer our squad, and I believe that we will all benefit from his presence and leadership across the rest of this season.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Though Dane is still early in his coaching career, having only finished playing for Lancashire in 2023, I am confident that his leadership presence, competitive edge and experience of all formats, including franchise cricket, will have a huge impact on our squad.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It is the leadership qualities that were evident when he captained Lancashire that drew me towards Dane. The teams that he has led played hard, committed, never-say-die cricket and I believe that is a style that will resonate well with our players, staff group and members.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Dane will be supported by what I believe is an exceptional coaching team of Rory Coutts, Tim Murtagh and Ian Salisbury, who all bring variety and wide-ranging knowledge to our team.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I am sure you will all joining me in welcoming Dane over the coming weeks as we look forward to the rest of our season. There is still a lot to play for and I am excited to see where our talented playing group can take us.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eVilas played six Tests and one T20I for South Africa before joining Lancashire on a Kolpak contract. He was subsequently made club captain, leading the team to T20 Finals Day on three occasions and back-to-back runners-up finishes in the County Championship.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eVilas said: \u0026#34;It\u0026#39;s an absolute honour to be here. Lord\u0026#39;s is such a special place and I\u0026#39;m looking forward to getting started with the squad. The potential is endless for the group and I\u0026#39;ll be keen to harness that and help grow their careers.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve got good relationships with Rory Coutts, Tim Murtagh and Ian Salisbury, so to have the four of us together is fantastic and I\u0026#39;m really looking forward to it.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-19T21:30:00Z",
  "modifiedTime": null
}
