{
  "id": "8b118f48-4865-4cda-98f8-bd3f491d042e",
  "title": "Jacob Bethell to debut for England in first Test against New Zealand",
  "link": "https://www.espncricinfo.com/ci/content/story/1461768.html?ex_cid=OTC-RSS",
  "description": "Ollie Pope will keep wicket as tourists deal with fallout from Jordan Cox injury",
  "author": "",
  "published": "Tue, 26 Nov 2024 00:39:54 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Vithushan Ehantharajah",
  "length": 4130,
  "excerpt": "Ollie Pope will keep wicket as tourists deal with fallout from Jordan Cox injury",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Jacob Bethell will make his Test debut for England at No. 3 against New Zealand in the first Test at Hagley Oval on Thursday, despite never having fulfilled the role in first-class cricket.As part of a reshuffled batting line-up following Jordan Cox's broken thumb - who was initially set to debut with Jamie Smith missing the tour on paternity leave - the Warwickshire middle order batter will come in at first-drop to allow Ollie Pope to keep wicket. Joe Root will remain at No.4 for his 150th cap.The selection of the Bethell in a position of such responsibility is a reflection of the selectors' regard for his talent. He made his T20I and ODI debuts against Australia at the end of the home summer, and impressed out in the Caribbean with three half-centuries across both formats on that white ball tour. He subsequently earned his maiden IPL gig with a £245,000 deal with Royal Challengers Bangalore on Monday.Nevertheless, the 21-year-old remains an unknown quantity in first-class cricket. He averages 25.44 from 30 innings, with just five half-centuries, none of which have come higher than No. 5. A career-best score of 93 came against Nottinghamshire in April. He will be come the first specialist batter to play Test cricket for England without a first-class century since Mike Gatting in 1978.Bethell only arrived in New Zealand on Sunday after time off at home following the West Indies series. As a result, he did not play any part in the two-day tour match against the New Zealand Prime Minister's XI.In a year of left-field selections from England, this might rank as one on the outer reaches of that spectrum. Particularly given Root, with his wealth of experience, could have performed the role. While Ben Stokes has been keen to allow England's leading Test run-scorer the comfort of batting No. 4 throughout his tenure as captain, it is worth noting Root's 262 against Pakistan last month came at three.Speaking on Tuesday, Root revealed he had not been approached about batting three, but backed Bethell to take this fast-tracked promotion in his stride. Despite having never played together, the pair know each other well as their fathers played together at Sheffield Collegiate Cricket Club.\"I love the look of him as a player,\" said Root. \"I've known Jacob and his family a long time and it's been lovely to watch him grow up as a player coming through in Barbados then at Warwickshire. What he's done in the white-ball stuff more recently has been exceptional.\"He's full of confidence, he's got great ability and a really well rounded game. He's a mature head on young shoulders and I think he has all the components to set him up nicely to be successful in this format and at this level. I'm sure he'll enjoy every aspect of the week, I'm really looking forward to watching him do his stuff.\"If you look at the way he sets up I think it suits that (batting at three), especially here with the little bit of extra bounce and carry. He plays very well square of the wicket and if he gets in on a wicket like that he could be very destructive. It's a really exciting opportunity and prospect for us to see a young player coming in hopefully doing something really special at the start of his career.\"This particular gamble has been forced, to a point. Cox's injury in the nets on Sunday morning ahead of play in Queenstown threw their initial plans into disarray. There has been a further complication as Durham's Ollie Robinson - due to be confirmed as the injury replacement - is currently getting his passport renewed. However it was unlikely he would have featured in the opening Test given the travel involved and the time needed to overcome jet lag.Despite a green seamer expected at Hagley Oval, England have chosen to persist with Shoaib Bashir as their spinner, with Chris Woakes, Gus Atkinson and Brydon Carse the out-and-out seamers, and Stokes as the all-round option.England XI for first Test: 1 ⁠Zak Crawley, 2⁠ ⁠Ben Duckett, 3⁠ ⁠Jacob Bethell, 4⁠ ⁠Joe Root, 5 ⁠Harry Brook, 6⁠ ⁠Ollie Pope (wk), 7⁠ ⁠Ben Stokes (capt), 8⁠ ⁠Chris Woakes, 9⁠ ⁠Gus Atkinson, 10⁠ ⁠Brydon Carse, 11⁠ ⁠Shoaib Bashir",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/390000/390061.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/jacob-bethell-1194959\"\u003eJacob Bethell\u003c/a\u003e will make his Test debut for England at No. 3 against New Zealand in the first Test at Hagley Oval on Thursday, despite never having fulfilled the role in first-class cricket.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAs part of a reshuffled batting line-up following Jordan Cox\u0026#39;s broken thumb - who was initially set to debut with Jamie Smith missing the tour on paternity leave - the Warwickshire middle order batter will come in at first-drop to allow \u003ca href=\"https://www.espncricinfo.com/cricketers/ollie-pope-887207\"\u003eOllie Pope\u003c/a\u003e to keep wicket. Joe Root will remain at No.4 for his 150th cap.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe selection of the Bethell in a position of such responsibility is a reflection of the selectors\u0026#39; regard for his talent. He made his T20I and ODI debuts against Australia at the end of the home summer, and impressed out in the Caribbean with three half-centuries across both formats on that white ball tour. He subsequently earned his maiden IPL gig with a £245,000 deal with Royal Challengers Bangalore on Monday.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eNevertheless, the 21-year-old remains an unknown quantity in first-class cricket. He averages 25.44 from 30 innings, with just five half-centuries, none of which have come higher than No. 5. A career-best score of 93 came against Nottinghamshire in April. He will be come the first specialist batter to play Test cricket for England without a first-class century since Mike Gatting in 1978.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBethell only arrived in New Zealand on Sunday after time off at home following the West Indies series. As a result, he did not play any part in the two-day tour match against the New Zealand Prime Minister\u0026#39;s XI.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIn a year of left-field selections from England, this might rank as one on the outer reaches of that spectrum. Particularly given Root, with his wealth of experience, could have performed the role. While Ben Stokes has been keen to allow England\u0026#39;s leading Test run-scorer the comfort of batting No. 4 throughout his tenure as captain, it is worth noting Root\u0026#39;s 262 against Pakistan last month came at three.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSpeaking on Tuesday, Root revealed he had not been approached about batting three, but backed Bethell to take this fast-tracked promotion in his stride. Despite having never played together, the pair know each other well as their fathers played together at Sheffield Collegiate Cricket Club.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I love the look of him as a player,\u0026#34; said Root. \u0026#34;I\u0026#39;ve known Jacob and his family a long time and it\u0026#39;s been lovely to watch him grow up as a player coming through in Barbados then at Warwickshire. What he\u0026#39;s done in the white-ball stuff more recently has been exceptional.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;He\u0026#39;s full of confidence, he\u0026#39;s got great ability and a really well rounded game. He\u0026#39;s a mature head on young shoulders and I think he has all the components to set him up nicely to be successful in this format and at this level. I\u0026#39;m sure he\u0026#39;ll enjoy every aspect of the week, I\u0026#39;m really looking forward to watching him do his stuff.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;If you look at the way he sets up I think it suits that (batting at three), especially here with the little bit of extra bounce and carry. He plays very well square of the wicket and if he gets in on a wicket like that he could be very destructive. It\u0026#39;s a really exciting opportunity and prospect for us to see a young player coming in hopefully doing something really special at the start of his career.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThis particular gamble has been forced, to a point. Cox\u0026#39;s injury in the nets on Sunday morning ahead of play in Queenstown threw their initial plans into disarray. There has been a further complication as Durham\u0026#39;s \u003ca href=\"https://www.espncricinfo.com/cricketers/ollie-robinson-893955\"\u003eOllie Robinson\u003c/a\u003e - due to be confirmed as the injury replacement - is currently getting his passport renewed. However it was unlikely he would have featured in the opening Test given the travel involved and the time needed to overcome jet lag.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eDespite a green seamer expected at Hagley Oval, England have chosen to persist with Shoaib Bashir as their spinner, with Chris Woakes, Gus Atkinson and Brydon Carse the out-and-out seamers, and Stokes as the all-round option.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cb\u003eEngland XI for first Test:\u003c/b\u003e 1 ⁠Zak Crawley, 2⁠ ⁠Ben Duckett, 3⁠ ⁠Jacob Bethell, 4⁠ ⁠Joe Root, 5 ⁠Harry Brook, 6⁠ ⁠Ollie Pope (wk), 7⁠ ⁠Ben Stokes (capt), 8⁠ ⁠Chris Woakes, 9⁠ ⁠Gus Atkinson, 10⁠ ⁠Brydon Carse, 11⁠ ⁠Shoaib Bashir\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-25T22:32:00Z",
  "modifiedTime": null
}
