{
  "id": "8c4b1ba5-c367-4749-a17d-c1606cc989d4",
  "title": "\"Average Of 25 Will Not Bring Us Success\": West Indies Coach Daren Sammy Slams Poor First-Class Cricket System",
  "link": "https://sports.ndtv.com/cricket/average-of-25-will-not-bring-us-success-west-indies-coach-daren-sammy-slams-poor-first-class-cricket-system-8733765#publisher=newsstand",
  "description": "Ahead of his side's three-match Test series at home against Australia, West Indies head coach Daren Sammy spoke on the team's poor first-class cricket system.",
  "author": "",
  "published": "Mon, 23 Jun 2025 00:02:21 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "Asian News International",
  "length": 3381,
  "excerpt": "Ahead of his side's three-match Test series at home against Australia, West Indies head coach Daren Sammy spoke on the team's poor first-class cricket system.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "File photo of Daren Sammy.© AFP Ahead of his side's three-match Test series at home against Australia, West Indies head coach Daren Sammy spoke on the team's poor first-class cricket system, saying that players averaging below 35 and being \"undroppable\" shows how poor the system is. WI will be kickstarting their World Test Championship (WTC) 2025-27 cycle with a tough home assignment with a depleted Australia in the first Test starting from June 25 onwards. Heading into the series, WI have dropped two of their batters, Kavem Hodge (playing 11 Tests, scoring 556 runs at an average of 25.27, including a century) and Alick Athanaze (13 Tests, average of 25.08 without any century but four fifties)On being asked about their absence during an interview on QFM Dominica, Sammy pointed out that WI are basing their selection on the basis of data and highlighted the poor health of the WI first-class cricket system.\"I had the analysts dive into the top three teams in the world and the different batting positions, what the best of the top three are doing in those different positions, the roles they are playing and then we compared them to ours and what we are doing,\" Sammy was quoted as saying by The Trinidad and Tobago Guardian, as quoted by Wisden.\"During that last Test World Championship [cycle], Kavem I think scored 500 runs at an average of 25. As Dominicans, we want our players to perform well, but we must not get emotional,\" he added.He also said that while both players have not been discarded altogether and doors are still open, he warned against glorifying averages of 25, saying that it would not bring the team success.\"If you notice, these guys just played in the 'A' team series, so they have not been discarded, just that at this moment, the direction that the team is going, the roles that we see from the data collected that is required to play, they just do not fit that role at that moment. However, it is not the end of the road for them,\" Sammy said.\"I think we are doing Hodge and Alick a disservice by glorifying an average of 25 in Test cricket, thinking that myself Miles [Bascombe, West Indies' director of cricket] and Jamal [Smith, senior talent manager] have some personal vendetta against any player.\"\"We are trying to create an environment that breeds success, breeds excellence and we need to keep on challenging, and it shows where our cricket is right now, when players averaging below 35 seem undroppable in our system and that shows how poor our system is, for us to be really talking about a 25 average, that will not bring us success,\" he concluded.Among the players selected for Aussie Tests, the uncapped batter Kevlon Anderson is the only one averaging above 40 in first-class cricket, with 44.44, with other two averaging above 35, Kraigg Brathwaite (37.99), and wicketkeeper Tevin Imlach (31.38).West Indies Test Squad for Series Against Australia: Roston Chase (Captain), Jomel Warrican (Vice Captain), Kevlon Anderson, Kraigg Brathwaite, John Campbell, Keacy Carty, Justin Greaves, Shai Hope, Tevin Imlach, Alzarri Joseph, Shamar Joseph, Brandon King, Johann Layne, Mikyle Louis, Anderson Phillip, Jayden Seales.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Topics mentioned in this article",
  "image": "https://s.ndtvimg.com/images/content/2015/jan/806/darren-sammy-wins.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"639\" height=\"479\" src=\"https://s.ndtvimg.com/images/content/2015/jan/806/darren-sammy-wins.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"\u0026#34;Average Of 25 Will Not Bring Us Success\u0026#34;: West Indies Coach Daren Sammy Slams Poor First-Class Cricket System\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eFile photo of Daren Sammy.\u003cspan\u003e© AFP\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eAhead of his side\u0026#39;s three-match Test series at home against Australia, West Indies head coach Daren Sammy spoke on the team\u0026#39;s poor first-class cricket system, saying that players averaging below 35 and being \u0026#34;undroppable\u0026#34; shows how poor the system is. WI will be kickstarting their World Test Championship (WTC) 2025-27 cycle with a tough home assignment with a depleted Australia in the first Test starting from June 25 onwards. Heading into the series, WI have dropped two of their batters, Kavem Hodge (playing 11 Tests, scoring 556 runs at an average of 25.27, including a century) and Alick Athanaze (13 Tests, average of 25.08 without any century but four fifties)\u003c/p\u003e\u003cp\u003eOn being asked about their absence during an interview on QFM Dominica, Sammy pointed out that WI are basing their selection on the basis of data and highlighted the poor health of the WI first-class cricket system.\u003c/p\u003e\u003cp\u003e\u0026#34;I had the analysts dive into the top three teams in the world and the different batting positions, what the best of the top three are doing in those different positions, the roles they are playing and then we compared them to ours and what we are doing,\u0026#34; Sammy was quoted as saying by The Trinidad and Tobago Guardian, as quoted by Wisden.\u003c/p\u003e\u003cp\u003e\u0026#34;During that last Test World Championship [cycle], Kavem I think scored 500 runs at an average of 25. As Dominicans, we want our players to perform well, but we must not get emotional,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eHe also said that while both players have not been discarded altogether and doors are still open, he warned against glorifying averages of 25, saying that it would not bring the team success.\u003c/p\u003e\u003cp\u003e\u0026#34;If you notice, these guys just played in the \u0026#39;A\u0026#39; team series, so they have not been discarded, just that at this moment, the direction that the team is going, the roles that we see from the data collected that is required to play, they just do not fit that role at that moment. However, it is not the end of the road for them,\u0026#34; Sammy said.\u003c/p\u003e\u003cp\u003e\u0026#34;I think we are doing Hodge and Alick a disservice by glorifying an average of 25 in Test cricket, thinking that myself Miles [Bascombe, West Indies\u0026#39; director of cricket] and Jamal [Smith, senior talent manager] have some personal vendetta against any player.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We are trying to create an environment that breeds success, breeds excellence and we need to keep on challenging, and it shows where our cricket is right now, when players averaging below 35 seem undroppable in our system and that shows how poor our system is, for us to be really talking about a 25 average, that will not bring us success,\u0026#34; he concluded.\u003c/p\u003e\u003cp\u003eAmong the players selected for Aussie Tests, the uncapped batter Kevlon Anderson is the only one averaging above 40 in first-class cricket, with 44.44, with other two averaging above 35, Kraigg Brathwaite (37.99), and wicketkeeper Tevin Imlach (31.38).\u003c/p\u003e\u003cp\u003eWest Indies Test Squad for Series Against Australia: Roston Chase (Captain), Jomel Warrican (Vice Captain), Kevlon Anderson, Kraigg Brathwaite, John Campbell, Keacy Carty, Justin Greaves, Shai Hope, Tevin Imlach, Alzarri Joseph, Shamar Joseph, Brandon King, Johann Layne, Mikyle Louis, Anderson Phillip, Jayden Seales.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-23T00:02:18+05:30",
  "modifiedTime": null
}
