{
  "id": "8c5ee3e2-25a5-45ca-ba7f-0eaa4727d1d4",
  "title": "Rohit Sharma is fast becoming India's unlucky charm",
  "link": "https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/rohit-sharma-is-fast-becoming-indias-unlucky-charm",
  "description": "\"As a captain, it definitely hurts to see that number, but in 365 days, you'll make two or three bad calls. That's okay.\"",
  "author": "Naman Agarwal",
  "published": "Mon, 09 Dec 2024 16:52:00 +0000",
  "source": "https://www.wisden.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Naman Agarwal",
  "length": 6110,
  "excerpt": "Rohit Sharma has lost four Tests in a row as captain. Will he last the entirety of the Australia series?",
  "siteName": "Wisden",
  "favicon": "https://www.wisden.com/static-assets/favicons/apple-touch-icon.png?v=23.07",
  "text": "\"As a captain, it definitely hurts to see that number, but in 365 days, you'll make two or three bad calls. That's okay.\" The number referenced here is 46, India's score in the first innings of the Bengaluru Test against New Zealand, which they lost. \"We are allowed [to lose a home Test series] once in 12 years.\" This was after the Pune Test defeat that followed Bengaluru, resulting in India's first series loss at home since 2012. \"It is quite tough. It tells you that nothing is easy in life. It is important for me to understand that life is not all about highs, it is about lows as well.\" The high here refers to the T20 World Cup trophy that India won earlier this year. The low? A first-ever 0-3 home Test series whitewash that culminated in Mumbai. \"Things didn't go our way the way we wanted to. But these things happen.\" The thing that happened here was a three-day drubbing at the hands of Australia in Adelaide on Sunday. It's easy to guess whose comments these are. Adelaide was Rohit Sharma's fourth consecutive loss as captain in less than two months, one more than the number of bad calls he felt was okay in a year. If that fact in itself doesn't give a bad enough account of Rohit's current fortunes, the fact that there was a convincing 295-run victory squeezed in between those four games under a different, fill-in captain only makes it look worse. And that is not all. — Wisden (@WisdenCricket) December 8, 2024 The magnitude of the four back-to-back defeats has overshadowed the extent of Rohit's downturn with the bat. This season, he averages 11.83 from six Tests, having scored 142 runs. Nitish Kumar Reddy, who made his debut on this tour, has 21 more runs than him from eight fewer innings. Overall, Rohit averages 27.13 from 12 Tests this year, his worst since making a move to the top of the order. In the five home Tests that India played before travelling to Australia, they did not register a single century opening partnership. At Perth, in Rohit's absence, KL Rahul, another fill-in, stepped up and added 201 with Yashasvi Jaiswal. It might all just be coincidence, but with every defeat and with every dismissal for a low score, there's a growing belief that India might actually do better without Rohit at the helm. Or maybe even without Rohit full stop. How did it reach this stage though? Three weeks before the 46 all out in Bengaluru, Rohit had been hailed as a ground-breaking captain for the way India made (and won) a game out of nothing in Kanpur. Then, they had scored 285-9 in 34.4 overs, the fastest innings in Test history. Rohit started with two sixes and the world was at his feet. But the sheer absurdity of that game and the records that were created in it made context disappear into the background. India had been put under pressure early on in Chennai in the first Test against Bangladesh, and multiple times across the five Tests against England earlier in the year. In fact, if not for an ill-fated Joe Root reverse scoop in Rajkot and a rearguard act by a two-Test old Dhruv Jurel in Ranchi, the series loss that eventually came against New Zealand could well have come eight months earlier. So far, Rohit has won 12 and lost eight Tests as captain, with a win/loss ratio of 1.50, exactly the same as MS Dhoni's. The similarities don't end there though. One of the chief complaints against Rohit the Test captain is how it often feels as if he lets the game meander along without much proactivity or creativity, much like Dhoni was criticised for during his days at the top. In Adelaide, India dished out freebies to Travis Head in a strange plan that focused on bowling outside off allowing him room to line up his preferred off-side. For the umpteenth time, they didn't bowl short enough frequently enough to the left-hander. On the second morning, Jasprit Bumrah bowled only four overs in a spell where he dismissed Nathan McSweeney and Steve Smith. He didn't get to bowl again in the first session. \"Bumrah had bowled a four-over spell and had already picked up a wicket in that. So why did he bowl only four overs, and didn't bowl after that at all? He didn't bowl in the entire session. So you are 100 per cent right when you say that you missed a trick in captaincy. Rohit's captaincy - let's call a spade a spade - we saw defensive captaincy. He allowed the match to drift,\" Akash Chopra said on his YouTube channel, dissecting the move. The last time Rohit Sharma averaged lower with the bat was in December 2018.#AUSvIND pic.twitter.com/wtVVubhHP7 — Wisden India (@WisdenIndia) December 6, 2024 After the New Zealand defeat, Rohit had admitted to captaincy failures himself. \"As a captain as well, I was not at my best at leading the team as well. And not with the bat as well.\" It's been a strange combination, has Rohit's captaincy and batting. If 'defensive' has been the keyword with the former, 'intent' and 'aggressive' have been the keywords with the latter. And yet neither has yielded results. His career average, which had reached a high of 47.2 in the middle of the last series against Australia, in 2023, has fallen to a six-year low of 41.5. At the age bracket in which he falls, very rarely are batters able to reverse that trend. At the start of the season, it felt like this World Test Championship would be a nice way to potentially cap off a 12-year Test career for Rohit. It has turned out anything but nice, and the elusive World Test Championship trophy seems to be slipping further and further away from Rohit's and India's grasp. India have bounced back to win a series in Australia twice now despite losing a Test. They have the pedigree to do it again. Maybe there's a last hurrah left in Rohit's destiny, like there was with the T20 World Cup. But the possibility of adding another to the list of similarities with Dhoni's Test captaincy looms large. Ten years back, the India captain had resigned and quit Test cricket in the middle of an Australia tour. With three matches left in the series, we might see history repeat itself. Cover StoriesCover Stories IndiaRohit SharmaSeries Cover Stories",
  "image": "https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e \u003cfigure\u003e\u003cimg src=\"https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=1200\" width=\"1200px\" height=\"675px\" sizes=\"(min-width: 1200px) 1200px\" data-src=\"https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=1200\" data-srcset=\"https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=300 300w, https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=500 500w, https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=750 750w, https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=1200 1200w, https://www.wisden.com/static-assets/waf-images/1c/0a/a3/16-9/yjUX8viyaZ.jpg?v=23.07\u0026amp;w=1920 1920w\" alt=\"Rohit Sharma captaincy\" importance=\"low\"/\u003e \u003c/figure\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003e\u0026#34;As a captain, it definitely hurts to see that number, but in 365 days, you\u0026#39;ll make two or three bad calls. That\u0026#39;s okay.\u0026#34;\u003c/p\u003e\u003c/div\u003e  \u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/india-vs-new-zealand-m-2024/cricket-news/full-list-india-fold-for-46-their-third-lowest-test-total-ever\"\u003eThe number referenced here is 46, India\u0026#39;s score in the first innings of the Bengaluru Test against New Zealand\u003c/a\u003e\u003c/strong\u003e, which they lost.\u003c/p\u003e \u003cp\u003e\u0026#34;We are allowed [to lose a home Test series] once in 12 years.\u0026#34; This was after the Pune Test defeat that followed Bengaluru, resulting in India\u0026#39;s first series loss at home since 2012. \u003c/p\u003e \u003cp\u003e\u0026#34;It is quite tough. It tells you that nothing is easy in life. It is important for me to understand that life is not all about highs, it is about lows as well.\u0026#34; The high here refers to the T20 World Cup trophy that India won earlier this year. The low? \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/india-vs-new-zealand-m-2024/cricket-news/the-morning-after-who-said-what-after-indias-defeat\"\u003eA first-ever 0-3 home Test series whitewash that culminated in Mumbai.\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u0026#34;Things didn\u0026#39;t go our way the way we wanted to. But these things happen.\u0026#34; The thing that happened here was a three-day drubbing at the hands of Australia in Adelaide on Sunday.\u003c/p\u003e \u003cp\u003eIt\u0026#39;s easy to guess whose comments these are.\u003c/p\u003e \u003cp\u003eAdelaide was \u003ca href=\"https://www.wisden.com/players/rohit-sharma-3852\"\u003eRohit Sharma\u003c/a\u003e\u0026#39;s fourth consecutive loss as captain in less than two months, one more than the number of bad calls he felt was okay in a year. \u003c/p\u003e \u003cp\u003eIf that fact in itself doesn\u0026#39;t give a bad enough account of Rohit\u0026#39;s current fortunes, the fact that there was \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/indias-biggest-test-wins-outside-asia-full-list-can-they-break-their-all-time-record-in-perth\"\u003ea convincing 295-run victory squeezed in between those four games under a different, fill-in captain\u003c/a\u003e\u003c/strong\u003e only makes it look worse. And that is not all.\u003c/p\u003e \u003cblockquote\u003e\n— Wisden (@WisdenCricket) \u003ca href=\"https://twitter.com/WisdenCricket/status/1865653675735253103?ref_src=twsrc%5Etfw\"\u003eDecember 8, 2024\u003c/a\u003e\u003c/blockquote\u003e  \u003cp\u003eThe magnitude of the four back-to-back defeats has overshadowed the extent of Rohit\u0026#39;s downturn with the bat. This season, he averages 11.83 from six Tests, having scored 142 runs. Nitish Kumar Reddy, who made his debut on this tour, has 21 more runs than him from eight fewer innings. Overall, Rohit averages 27.13 from 12 Tests this year, his worst since making a move to the top of the order. \u003c/p\u003e \u003cp\u003eIn the five home Tests that India played before travelling to Australia, they did not register a single century opening partnership. At Perth, in Rohit\u0026#39;s absence, \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/kl-rahul-always-needed-never-wanted\"\u003eKL Rahul, another fill-in, stepped up and added 201 with Yashasvi Jaiswal\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e \u003cp\u003eIt might all just be coincidence, but with every defeat and with every dismissal for a low score, there\u0026#39;s a growing belief that India might actually do better without Rohit at the helm. Or maybe even without Rohit full stop. \u003c/p\u003e \u003cp\u003eHow did it reach this stage though?\u003c/p\u003e \u003cp\u003eThree weeks before the 46 all out in Bengaluru, Rohit had been hailed as a ground-breaking captain for \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/india-vs-bangladesh-m-2024/cricket-features/how-india-reversed-the-test-formula-to-win-an-un-winnable-game-in-kanpur\"\u003ethe way India made (and won) a game out of nothing in Kanpur\u003c/a\u003e\u003c/strong\u003e. Then, they had scored 285-9 in 34.4 overs, the fastest innings in Test history. \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/india-vs-bangladesh-m-2024/cricket-news/watch-rohit-sharma-becomes-first-ever-test-opener-to-hit-two-sixes-off-first-two-balls\"\u003eRohit started with two sixes and the world was at his feet\u003c/a\u003e\u003c/strong\u003e. But the sheer absurdity of that game and the records that were created in it made context disappear into the background. \u003c/p\u003e \u003cp\u003eIndia had been put under pressure early on in Chennai in the first Test against Bangladesh, and multiple times across the five Tests against England earlier in the year. In fact, if not for an \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/england-in-india-2023-24/cricket-news/watch-joe-root-falls-reverse-ramping-jasprit-bumrah-early-on-day-three\"\u003eill-fated Joe Root reverse scoop in Rajkot\u003c/a\u003e\u003c/strong\u003e and a \u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/england-in-india-2023-24/cricket-features/dhruv-jurel-ranchi-test\"\u003erearguard act by a two-Test old Dhruv Jurel in Ranchi\u003c/a\u003e\u003c/strong\u003e, the series loss that eventually came against New Zealand could well have come eight months earlier.\u003c/p\u003e \u003cp\u003eSo far, Rohit has won 12 and lost eight Tests as captain, with a win/loss ratio of 1.50, exactly the same as MS Dhoni\u0026#39;s. The similarities don\u0026#39;t end there though. One of the chief complaints against Rohit the Test captain is how it often feels as if he lets the game meander along without much proactivity or creativity, much like Dhoni was criticised for during his days at the top.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/after-red-and-white-travis-head-renders-rohit-sharmas-india-colourless-in-pink\"\u003eIn Adelaide, India dished out freebies to Travis Head\u003c/a\u003e\u003c/strong\u003e in a strange plan that focused on bowling outside off allowing him room to line up his preferred off-side. For the umpteenth time, they didn\u0026#39;t bowl short enough frequently enough to the left-hander. On the second morning, \u003ca href=\"https://www.wisden.com/players/jasprit-bumrah-63755\"\u003eJasprit Bumrah\u003c/a\u003e bowled only four overs in a spell where he dismissed Nathan McSweeney and Steve Smith. He didn\u0026#39;t get to bowl again in the first session.\u003c/p\u003e \u003cp\u003e\u0026#34;Bumrah had bowled a four-over spell and had already picked up a wicket in that. So why did he bowl only four overs, and didn\u0026#39;t bowl after that at all? He didn\u0026#39;t bowl in the entire session. So you are 100 per cent right when you say that you missed a trick in captaincy. Rohit\u0026#39;s captaincy - let\u0026#39;s call a spade a spade - we saw defensive captaincy. He allowed the match to drift,\u0026#34; Akash Chopra said on his YouTube channel, dissecting the move. \u003c/p\u003e \u003cblockquote\u003e\u003cp dir=\"ltr\" lang=\"en\"\u003eThe last time Rohit Sharma averaged lower with the bat was in December 2018.\u003ca href=\"https://twitter.com/hashtag/AUSvIND?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#AUSvIND\u003c/a\u003e \u003ca href=\"https://t.co/wtVVubhHP7\"\u003epic.twitter.com/wtVVubhHP7\u003c/a\u003e\u003c/p\u003e\n— Wisden India (@WisdenIndia) \u003ca href=\"https://twitter.com/WisdenIndia/status/1864935265082724387?ref_src=twsrc%5Etfw\"\u003eDecember 6, 2024\u003c/a\u003e\u003c/blockquote\u003e  \u003cp\u003eAfter the New Zealand defeat, Rohit had admitted to captaincy failures himself. \u0026#34;As a captain as well, I was not at my best at leading the team as well. And not with the bat as well.\u0026#34;\u003c/p\u003e \u003cp\u003eIt\u0026#39;s been a strange combination, has Rohit\u0026#39;s captaincy and batting. If \u0026#39;defensive\u0026#39; has been the keyword with the former, \u0026#39;intent\u0026#39; and \u0026#39;aggressive\u0026#39; have been the keywords with the latter. And yet neither has yielded results. His career average, which had reached a high of 47.2 in the middle of the last series against Australia, in 2023, has fallen to a six-year low of 41.5. At the age bracket in which he falls, very rarely are batters able to reverse that trend. \u003c/p\u003e \u003cp\u003eAt the start of the season, it felt like this World Test Championship would be a nice way to potentially cap off a 12-year Test career for Rohit. It has turned out anything but nice, and the elusive World Test Championship trophy seems to be slipping further and further away from Rohit\u0026#39;s and India\u0026#39;s grasp. \u003c/p\u003e \u003cp\u003eIndia have bounced back to win a series in Australia twice now despite losing a Test. They have the pedigree to do it again. Maybe there\u0026#39;s a last hurrah left in Rohit\u0026#39;s destiny, like there was with the T20 World Cup. But the possibility of adding another to the list of similarities with Dhoni\u0026#39;s Test captaincy looms large. Ten years back, the India captain had resigned and quit Test cricket in the middle of an Australia tour. With three matches left in the series, we might see history repeat itself. \u003c/p\u003e     \u003cdiv\u003e \u003cp\u003e\u003cspan title=\"Cover Stories\"\u003eCover Stories\u003c/span\u003e\u003cspan title=\"Cover Stories India\"\u003eCover Stories India\u003c/span\u003e\u003cspan title=\"Rohit Sharma\"\u003eRohit Sharma\u003c/span\u003e\u003cspan title=\"Series Cover Stories\"\u003eSeries Cover Stories\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-09T16:52:00Z",
  "modifiedTime": "2024-12-09T16:52:59Z"
}
