{
  "id": "8c711d8c-0c7c-43be-8dd5-c796ac8ffbb6",
  "title": "'Chill as' Sutherland epitomises Australia's calm in the chaos",
  "link": "https://www.espncricinfo.com/ci/content/story/1455201.html?ex_cid=OTC-RSS",
  "description": "Defending 14 in the final over, Sutherland took 2 for 4 to help a hobbled Australia reach the semi-final",
  "author": "",
  "published": "Mon, 14 Oct 2024 00:24:52 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Valkerie Baynes",
  "length": 5248,
  "excerpt": "Defending 14 in the final over, Sutherland took 2 for 4 to help a hobbled Australia reach the semi-final",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsDefending 14 in the final over, Sutherland took 2 for 4 to help a hobbled Australia reach the semi-finalAnnabel Sutherland held her nerve in the final over  •  ICC/Getty Images\"How was your heart rate?\" Tahlia McGrath asked Annabel Sutherland after an extraordinary final over in which she defended 14 runs, took two wickets and denied India the right to decide their own destiny at the T20 World Cup.A high-stakes game played before a sold-out 14,946-strong crowd at Sharjah Stadium made up almost exclusively of Indian supporters had gone Australia's way by nine runs after the tightest contest of the tournament so far. And Sutherland was \"chill as\".It is testament to Sutherland's character and why Australia see her as such a bright prospect that, having celebrated her 23rd birthday the day before, she took it all in her stride, claiming 2 for 22 from her four overs after adding a vital 10 runs in six balls from No.8.Australia bring in Heather Graham in place of the injured Tayla Vlaeminck\"She's so composed,\" McGrath said, standing in as captain for the injured Alyssa Healy. \"She knew her plan, she executed beautifully. I said to her after, 'how was your heart rate?' and she goes, 'no I was fine, I was chill as' so I think that just shows the type of maturity that Belsey has.\"She's been in those big moments and delivered for us time and time again, even at the back end with some handy runs for us. She was huge for us today and very cool under pressure.\"And it was testament to this Australian side that they were able to shut out all the noise on the night and the upheaval beforehand to seal their place in the semi-finals.A few hours before the match, it was announced that Tayla Vlaeminck would be replaced in the squad by Heather Graham after dislocating her right - bowling - shoulder just four balls into Friday night's win against Pakistan. Vlaeminck's plight hit her team-mates hard given her battles with injury which have restricted her to just 28 appearances for her country since her debut in 2018.Australia are also waiting to hear whether Healy will be fit to take any further part in this World Cup after she injured her foot in the same match and turned up to watch the India clash on crutches and in a moon boot, her condition to be monitored over the coming days.\"There's been a lot going on,\" McGrath said. \"Friday night, that was a tough night for us and a lot to process but in tournaments like this it's move on, you've got a job to do.\"We've been really trying to get around each other as a group, whether it be the injured girls, the girls playing slightly different roles, and just really sticking together as a group and focusing on the job at hand. I thought we did a really good job of that and came out and played really well tonight. I'm really proud of the group.\"There were elements of chaos as Australia posted 151 for 8 upon winning the toss and opting to bat first. Georgia Wareham chose not to review an lbw decision which would have saved her and Sophie Molineux was run out walking back to the dugout not realising Jemimah Rodrigues had grassed a catch at backward point.McGrath's handy innings of 32 off 26 balls had moments of drama after she survived India's review for lbw, then was dropped by Harmanpreet Kaur at cover and finally stumped charging at Radha Yadav, all in the space of six deliveries.But she had kept her cool amid a rejigged middle-order and at the helm while Grace Harris, opening in Healy's place top-scored with 40 off 41 and Ellyse Perry played a cool 32 off 23.However, it was Megan Schutt's nerveless over in the 17th, when she conceded just one run and saw Richa Ghosh run out by a superb direct hit from Phoebe Litchfield at short cover, stood out for McGrath.\"She bowled outstanding,\" McGrath said. \"She nailed her plan and that swung the game right back in our favour. That was a really crucial moment in the game for us.\"McGrath has now captained Australia three times, twice in T20Is, including a match in India in 2022. Australia also had recent experience of pro-India full houses during their tour there in December and January.\"It was very loud,\" she said of Sunday in Sharjah. \"We're quite used to that now whenever we play against India. Lots of it was about just making eye contact with bowlers and trying to get everyone to look at me because trying to tell bowlers they'll bowl the next over or move fielders, is almost impossible with that noise.\"But for us it's almost trying to ignore the crowd at times because they can make you seem like you're behind the game when you maybe might not be. They're so passionate, cheer so loud and we love it but at times you can think that the game's getting away from you just with how loud the crowds cheering so it's just about staying level-headed, staying focused and getting a good read on the game.\"So when Harmanpreet threatened to take the match away from them with her 54 not out, the India captain's second unbeaten half-century in as many games at this tournament, Australia just had to stay \"chill as\". Now, waiting on the result of Monday's clash between New Zealand and Pakistan, it is India who will have to sweat it out.Valkerie Baynes is a general editor, women's cricket, at ESPNcricinfo",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/389000/389034.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle data-id=\"1455201\" data-src=\"/story/women-s-t20-world-cup-chill-as-sutherland-epitomises-australia-s-calm-in-the-chaos-1455201\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eDefending 14 in the final over, Sutherland took 2 for 4 to help a hobbled Australia reach the semi-final\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/valkerie-baynes-754\"\u003e\u003cspan\u003e\u003cimg width=\"48\" height=\"48\" alt=\"Valkerie Baynes\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/389000/389034.6.jpg\" alt=\"Annabel Sutherland held her nerve in the final over, Australia vs India, Women\u0026#39;s T20 World Cup, Sharjah, October 13, 2024\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAnnabel Sutherland held her nerve in the final over  •  \u003cspan\u003eICC/Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;How was your heart rate?\u0026#34; \u003ca href=\"https://www.espncricinfo.com/cricketers/tahlia-mcgrath-381311\"\u003eTahlia McGrath\u003c/a\u003e asked \u003ca href=\"https://www.espncricinfo.com/cricketers/annabel-sutherland-1071705\"\u003eAnnabel Sutherland\u003c/a\u003e after an extraordinary final over in which she \u003ca href=\"https://www.espncricinfo.com/series/icc-women-s-t20-world-cup-2024-25-1432420/australia-women-vs-india-women-18th-match-group-a-1432439/match-report\"\u003edefended 14 runs\u003c/a\u003e, took two wickets and denied India the right to decide their own destiny at the T20 World Cup.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eA high-stakes game played before a sold-out 14,946-strong crowd at Sharjah Stadium made up almost exclusively of Indian supporters had gone Australia\u0026#39;s way by nine runs after the tightest contest of the tournament so far. And Sutherland was \u0026#34;chill as\u0026#34;.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIt is testament to Sutherland\u0026#39;s character and why Australia see her as such a bright prospect that, having celebrated her 23rd birthday the day before, she took it all in her stride, claiming 2 for 22 from her four overs after adding a vital 10 runs in six balls from No.8.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/womens-t20-world-cup-australia-bring-in-heather-graham-in-place-of-the-injured-tayla-vlaeminck-1455109\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eAustralia bring in Heather Graham in place of the injured Tayla Vlaeminck\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;She\u0026#39;s so composed,\u0026#34; McGrath said, standing in as captain for the \u003ca href=\"https://www.espncricinfo.com/story/womens-t20-world-cup-australia-bring-in-heather-graham-in-place-of-the-injured-tayla-vlaeminck-1455109\"\u003einjured Alyssa Healy\u003c/a\u003e. \u0026#34;She knew her plan, she executed beautifully. I said to her after, \u0026#39;how was your heart rate?\u0026#39; and she goes, \u0026#39;no I was fine, I was chill as\u0026#39; so I think that just shows the type of maturity that Belsey has.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;She\u0026#39;s been in those big moments and delivered for us time and time again, even at the back end with some handy runs for us. She was huge for us today and very cool under pressure.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAnd it was testament to this Australian side that they were able to shut out all the noise on the night and the upheaval beforehand to seal their place in the semi-finals.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eA few hours before the match, it was announced that Tayla Vlaeminck would be replaced in the squad by Heather Graham after dislocating her right - bowling - shoulder just four balls into Friday night\u0026#39;s win against Pakistan. Vlaeminck\u0026#39;s plight hit her team-mates hard given her battles with injury which have restricted her to just 28 appearances for her country since her debut in 2018.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAustralia are also waiting to hear whether Healy will be fit to take any further part in this World Cup after she injured her foot in the same match and turned up to watch the India clash on crutches and in a moon boot, her condition to be monitored over the coming days.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;There\u0026#39;s been a lot going on,\u0026#34; McGrath said. \u0026#34;Friday night, that was a tough night for us and a lot to process but in tournaments like this it\u0026#39;s move on, you\u0026#39;ve got a job to do.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve been really trying to get around each other as a group, whether it be the injured girls, the girls playing slightly different roles, and just really sticking together as a group and focusing on the job at hand. I thought we did a really good job of that and came out and played really well tonight. I\u0026#39;m really proud of the group.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThere were elements of chaos as Australia posted 151 for 8 upon winning the toss and opting to bat first. Georgia Wareham chose not to review an lbw decision which would have saved her and Sophie Molineux was run out walking back to the dugout not realising Jemimah Rodrigues had grassed a catch at backward point.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMcGrath\u0026#39;s handy innings of 32 off 26 balls had moments of drama after she survived India\u0026#39;s review for lbw, then was dropped by Harmanpreet Kaur at cover and finally stumped charging at Radha Yadav, all in the space of six deliveries.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBut she had kept her cool amid a rejigged middle-order and at the helm while \u003ca href=\"https://www.espncricinfo.com/cricketers/grace-harris-381268\"\u003eGrace Harris\u003c/a\u003e, opening in Healy\u0026#39;s place top-scored with 40 off 41 and Ellyse Perry played a cool 32 off 23.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eHowever, it was \u003ca href=\"https://www.espncricinfo.com/cricketers/megan-schutt-420314\"\u003eMegan Schutt\u003c/a\u003e\u0026#39;s nerveless over in the 17th, when she conceded just one run and saw Richa Ghosh run out by a superb direct hit from Phoebe Litchfield at short cover, stood out for McGrath.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;She bowled outstanding,\u0026#34; McGrath said. \u0026#34;She nailed her plan and that swung the game right back in our favour. That was a really crucial moment in the game for us.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMcGrath has now captained Australia three times, twice in T20Is, including a match in India in 2022. Australia also had recent experience of pro-India full houses during their tour there in December and January.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It was very loud,\u0026#34; she said of Sunday in Sharjah. \u0026#34;We\u0026#39;re quite used to that now whenever we play against India. Lots of it was about just making eye contact with bowlers and trying to get everyone to look at me because trying to tell bowlers they\u0026#39;ll bowl the next over or move fielders, is almost impossible with that noise.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;But for us it\u0026#39;s almost trying to ignore the crowd at times because they can make you seem like you\u0026#39;re behind the game when you maybe might not be. They\u0026#39;re so passionate, cheer so loud and we love it but at times you can think that the game\u0026#39;s getting away from you just with how loud the crowds cheering so it\u0026#39;s just about staying level-headed, staying focused and getting a good read on the game.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSo when Harmanpreet threatened to take the match away from them with her 54 not out, the India captain\u0026#39;s second unbeaten half-century in as many games at this tournament, Australia just had to stay \u0026#34;chill as\u0026#34;. Now, waiting on the result of Monday\u0026#39;s clash between New Zealand and Pakistan, it is India who will have to sweat it out.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eValkerie Baynes is a general editor, women\u0026#39;s cricket, at ESPNcricinfo\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-14T00:20:00Z",
  "modifiedTime": null
}
