{
  "id": "940070f6-6d38-4b33-875a-fc5e30c56800",
  "title": "\"Couldn't Finish That Time\": Hardik Recalls 2017 Heartbreak After CT Success",
  "link": "https://sports.ndtv.com/cricket/couldnt-finish-that-time-emotional-hardik-pandya-recalls-2017-heartbreak-after-ct-2025-success-7886660",
  "description": "Hardik Pandya was the lone ranger for India in the 2017 final as he smashed a 43-ball 76, but the knock could not prevent his team from suffering a heavy defeat.",
  "author": "",
  "published": "Mon, 10 Mar 2025 00:27:39 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 4734,
  "excerpt": "Hardik Pandya was the lone ranger for India in the 2017 final as he smashed a 43-ball 76, but the knock could not prevent his team from suffering a heavy defeat.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "Hardik Pandya remembered the heartbreak in the Champions Trophy final in 2017.© AFP As his teammates basked in the glory of India's success in the Champions Trophy here on Sunday, star all-rounder Hardik Pandya remembered the heartbreak in the 2017 edition of the tournament. Back then India had lost to traditional rivals Pakistan in the final in England, where Hardik was part of the team. \"Always amazing to win an ICC event. I remember 2017 very closely, couldn't finish that time. Very pleased to have done it here,\" Hardik, who contributed significantly to India's title triumph on Sunday, told the official broadcaster. Hardik was the lone ranger for India in the 2017 final as he smashed a 43-ball 76, but the knock could not prevent his team from suffering a heavy defeat.Set a target of 252 by New Zealand, India completed the task with four wickets and six balls to spare to win their third Champions Trophy title, after 2002 and 2013.The all-rounder was also full of praise for KL Rahul, another contributor to the team's triumphal march and who made an unbeaten 34 in the final.\"KL was calm, he took his chances at the right time. He has immense talent, no one can time it as well as him.\" Rahul anchored the chase after India lost a couple of wickets to find themselves at 203/5 in the 42nd over.The Karnataka cricketer said he was always confident of getting the job done.\"As confident as I could be that I could get over the line. Keeping composure is all that matters, happy to have done it this time. I've batted in times like this in three out of the five games,\" Rahul said.\"Hard to put in words, but the team has pure skill. The way we've all had to play cricket growing up, we faced pressure from the time we became professional cricketers. The BCCI have groomed all of them and we've challenging ourselves to get better,\" the soft-spoken batter said.Mystery spinner Varun Chakaravarthy, Rohit's trump card in the tournament with nine wickets in three matches, called it a dream-come-true moment for him.\"It was a sudden inclusion (on being part of the XI from the league match against New Zealand), I didn't expect to turn out like this, a dream come true. The spin was less in the first innings and I had to be disciplined, just stick to the basics,\" Chakaravarthy said.India claimed the trophy without losing a match, reflecting their dominance in the tournament.Opener Shubman Gill, who started the tournament with a century against Bangladesh, expressed his awe for his skipper's free-flowing batting that has often set the tempo for the team.\"Felt amazing. For the most time, I sat back and enjoyed Rohit's batting. He told me doesn't matter how the scoreboard gap is, the aim was to bat till the end. We missed out in 2023, happy to win eight ODIs back to back.\"Seeing the intensity with which he plays with is amazing. He keeps telling us to give it everything and backs it up. New Zealand are very consistent and execute plans accurately. We know they give it their all. They showed it tonight with the consistency,\" Gill said.Veteran all-rounder Ravindra Jadeja, who has been part of few famous wins as well as heartbreaks, expressed his delight at this triumph.\"That is how it is with me; sometimes a hero, sometimes a zero. The wicket was not easy for a new batter. Hardik and KL were great. Winning the Champions Trophy is a huge thing. If you don't win a big tournament after playing so long, it hurts,\" said Jadeja, who hit the winning runs.For Shreyas Iyer, who lent solidity to the middle order with his calculated batting, it was a maiden ICC tournament win \"Feeling ecstatic. This is my first ICC trophy, kind of overwhelmed looking at each and everyone in the dressing room. I love to go under pressure, I thrive. Not able to get a big one (in the final) but immensely satisfying to contribute to win. These are the lucky earrings, they'll stay on,\" the stylish batter said.Wrist spinner Kuldeep Yadav, who sent back the dangerous Rachin Ravindra and Kane Williamson in quick succession to give India the upper hand, said managing four spinners in a playing XI is not an easy job.\"It is easy to say that four spinners in the team, but it is very tough to manage four spinners. There was a lot of planning and all credit to Rohit bhai. Big party tonight,\" Kuldeep said.\"Luckily my batting wasn't needed. KL and Hardik did brilliantly. I don't believe in favourites tags but we have been doing brilliantly. This win is dedicated to our fans.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2025-03/ai4dk85o_hardik-pandya-afp_625x300_04_March_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2025-03/ai4dk85o_hardik-pandya-afp_625x300_04_March_25.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"\u0026#34;Couldn\u0026#39;t Finish That Time\u0026#34;: Emotional Hardik Pandya Recalls 2017 Heartbreak After CT 2025 Success\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eHardik Pandya remembered the heartbreak in the Champions Trophy final in 2017.\u003cspan\u003e© AFP\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eAs his teammates basked in the glory of India\u0026#39;s success in the Champions Trophy here on Sunday, star all-rounder Hardik Pandya remembered the heartbreak in the 2017 edition of the tournament. Back then India had lost to traditional rivals Pakistan in the final in England, where Hardik was part of the team. \u0026#34;Always amazing to win an ICC event. I remember 2017 very closely, couldn\u0026#39;t finish that time. Very pleased to have done it here,\u0026#34; Hardik, who contributed significantly to India\u0026#39;s title triumph on Sunday, told the official broadcaster.\u003c/p\u003e\n\n\u003cp\u003eHardik was the lone ranger for India in the 2017 final as he smashed a 43-ball 76, but the knock could not prevent his team from suffering a heavy defeat.\u003c/p\u003e\u003cp\u003eSet a target of 252 by New Zealand, India completed the task with four wickets and six balls to spare to win their third Champions Trophy title, after 2002 and 2013.\u003c/p\u003e\u003cp\u003eThe all-rounder was also full of praise for KL Rahul, another contributor to the team\u0026#39;s triumphal march and who made an unbeaten 34 in the final.\u003c/p\u003e\u003cp\u003e\u0026#34;KL was calm, he took his chances at the right time. He has immense talent, no one can time it as well as him.\u0026#34; Rahul anchored the chase after India lost a couple of wickets to find themselves at 203/5 in the 42nd over.\u003c/p\u003e\u003cp\u003eThe Karnataka cricketer said he was always confident of getting the job done.\u003c/p\u003e\u003cp\u003e\u0026#34;As confident as I could be that I could get over the line. Keeping composure is all that matters, happy to have done it this time. I\u0026#39;ve batted in times like this in three out of the five games,\u0026#34; Rahul said.\u003c/p\u003e\u003cp\u003e\u0026#34;Hard to put in words, but the team has pure skill. The way we\u0026#39;ve all had to play cricket growing up, we faced pressure from the time we became professional cricketers. The BCCI have groomed all of them and we\u0026#39;ve challenging ourselves to get better,\u0026#34; the soft-spoken batter said.\u003c/p\u003e\u003cp\u003eMystery spinner Varun Chakaravarthy, Rohit\u0026#39;s trump card in the tournament with nine wickets in three matches, called it a dream-come-true moment for him.\u003c/p\u003e\u003cp\u003e\u0026#34;It was a sudden inclusion (on being part of the XI from the league match against New Zealand), I didn\u0026#39;t expect to turn out like this, a dream come true. The spin was less in the first innings and I had to be disciplined, just stick to the basics,\u0026#34; Chakaravarthy said.\u003c/p\u003e\u003cp\u003eIndia claimed the trophy without losing a match, reflecting their dominance in the tournament.\u003c/p\u003e\u003cp\u003eOpener Shubman Gill, who started the tournament with a century against Bangladesh, expressed his awe for his skipper\u0026#39;s free-flowing batting that has often set the tempo for the team.\u003c/p\u003e\u003cp\u003e\u0026#34;Felt amazing. For the most time, I sat back and enjoyed Rohit\u0026#39;s batting. He told me doesn\u0026#39;t matter how the scoreboard gap is, the aim was to bat till the end. We missed out in 2023, happy to win eight ODIs back to back.\u003c/p\u003e\u003cp\u003e\u0026#34;Seeing the intensity with which he plays with is amazing. He keeps telling us to give it everything and backs it up. New Zealand are very consistent and execute plans accurately. We know they give it their all. They showed it tonight with the consistency,\u0026#34; Gill said.\u003c/p\u003e\u003cp\u003eVeteran all-rounder Ravindra Jadeja, who has been part of few famous wins as well as heartbreaks, expressed his delight at this triumph.\u003c/p\u003e\u003cp\u003e\u0026#34;That is how it is with me; sometimes a hero, sometimes a zero. The wicket was not easy for a new batter. Hardik and KL were great. Winning the Champions Trophy is a huge thing. If you don\u0026#39;t win a big tournament after playing so long, it hurts,\u0026#34; said Jadeja, who hit the winning runs.\u003c/p\u003e\u003cp\u003eFor Shreyas Iyer, who lent solidity to the middle order with his calculated batting, it was a maiden ICC tournament win \u0026#34;Feeling ecstatic. This is my first ICC trophy, kind of overwhelmed looking at each and everyone in the dressing room. I love to go under pressure, I thrive. Not able to get a big one (in the final) but immensely satisfying to contribute to win. These are the lucky earrings, they\u0026#39;ll stay on,\u0026#34; the stylish batter said.\u003c/p\u003e\u003cp\u003eWrist spinner Kuldeep Yadav, who sent back the dangerous Rachin Ravindra and Kane Williamson in quick succession to give India the upper hand, said managing four spinners in a playing XI is not an easy job.\u003c/p\u003e\u003cp\u003e\u0026#34;It is easy to say that four spinners in the team, but it is very tough to manage four spinners. There was a lot of planning and all credit to Rohit bhai. Big party tonight,\u0026#34; Kuldeep said.\u003c/p\u003e\u003cp\u003e\u0026#34;Luckily my batting wasn\u0026#39;t needed. KL and Hardik did brilliantly. I don\u0026#39;t believe in favourites tags but we have been doing brilliantly. This win is dedicated to our fans.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-10T00:27:39+05:30",
  "modifiedTime": null
}
