{
  "id": "b476992c-f3a8-492a-8e36-2eb7735050d0",
  "title": "Inglis savours 'special' innings as Australia make winning start",
  "link": "https://www.espncricinfo.com/ci/content/story/1474392.html?ex_cid=OTC-RSS",
  "description": "Inglis-Carey stand breaks England before keeper's maiden ODI hundred seals stunning chase",
  "author": "",
  "published": "Sat, 22 Feb 2025 21:15:46 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Danyal Rasool",
  "length": 5226,
  "excerpt": "Inglis-Carey stand breaks England before keeper's maiden ODI hundred seals stunning chase",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "By the time Australia's fourth wicket fell, Josh Inglis had switched into declutter mode. There remained more than 200 runs still to get, the asking rate nearing eight, and there wasn't too much batting to come. There was little time to regroup and consolidate, and at the same time little room for error.None of this, Inglis understood, would be helpful to worry about. \"We were in and around the run rate to start off with, so that was a big help,\" Inglis said after the game. \"The partnership between Shorty [Matt Short] and Marnus [Labuschagne] was really important. They sort of set the platform there, got us off to a good start. And then me and [Alex] Carey, we didn't really say too much out there. Carey is pretty quiet when he's batting, so I think we were going pretty well. So, I just tried to not look at the scoreboard too much, [not] look at the run rate, just keep batting the way we were going.\"Australia were in pursuit of what would be the highest chase in an ICC tournament, and despite his obvious talent, Inglis hasn't had an ODI career of particular note yet. In 28 matches, he had scored 543 runs, averaging under 22, a quickfire 65 against West Indies in February 2024 his most significant ODI contribution. If Australia were to get close, he had to produce an effort little in his career so far provided reason to expect.Stats - Duckett's record knock eclipsed by Australia's record chaseJosh Inglis 120* seals record win for AustraliaDuckett delivers but England fall flat again to put tournament on the lineLahore can't look away as Australia do Australia things, led by InglisIn the immediate term, Carey and Inglis minimised risks while keeping the asking rate under control. Like Australia, England had opted for the security of a deeper batting order, and would have to compensate for it with part-time bowling. In just the second over after the partnership came together, Carey struck two fours of Livingstone, before Inglis launched him for six the following over. It balanced out the respectful caution they treated Adil Rashid with without falling too far behind.\"We trained here at night for the last couple of days and it got really dewy around half past seven or eight o'clock,\" Inglis said. \"So, we sort of knew that was in our favour during the run chase and if we could take it deep enough it would be tough for the bowlers at the back end. It made life easier for us, the wicket skidded on beautifully and it really helped our run chase.\"And we knew if we could get close enough with Maxi [Glenn Maxwell] still to come - we've just seen what Maxi can do and everyone's seen it for a while now. So, to get close enough for him to be able to explode like that at the back end was probably in the back of our thoughts.\"Inglis and Carey worked the run chase so expertly they didn't necessarily need any explosions. They added 146 in just 116 deliveries, and by the time Carey holed out to mid-off, Australia just needed to stick with a similar rate of scoring.That fireworks came via Maxwell's bat wasn't especially surprising; he took the sting out of England's two gun seamers in Jofra Archer and Mark Wood, scorching them for 31 in 11 balls. Inglis, however, wasn't far behind, his last 36 coming off just 14 balls. It included a huge six over midwicket off Archer to bring up his hundred, and another one in the same region off Wood to seal the win.\"Maybe under the circumstances [it's my best innings]. It's really special. I think in an ICC event, you want to have an impact and you want to help your team win a game, so maybe - I'll reflect on that in the future.\"Inglis' personal history with England perhaps adds a further layer of intrigue to the story. He was born in Leeds and only moved to Australia as a teenager, and said as recently as 2022 that he still supported England at cricket. Those days, he said today, were \"long gone now\".\"It doesn't matter who it's against,\" he said. \"It's a really tight, quick tournament. We knew how we started the World Cup in India last year and we weren't able to get a good start, we knew you can't work your way into this Champions Trophy. You've got to be right on it from the first game. So, I think that's probably the most pleasing thing, to get a win on the board in game one.\"And if there's little doubt about Inglis' loyalties now, the same couldn't necessarily be said about the crowed. With 26,232 packed into the new Gaddafi Stadium, Australian and English flags were visible in roughly equal measure, and celebrations at each six or wicket, almost irrespective of who they came from. The quality and intensity of the game, without doubt the best of this tournament so far, meant the spectators' attention was held right through the end, with few leaving before Inglis had struck the final blow.\"I thought the atmosphere was amazing all day today. It's obviously the new stands. I think the ground and the stadium looks amazing. To play tonight in front of a packed crowd was unbelievable and the noise at times was deafening, especially with the Mexican wave. I saw that going around a few times and it was a really nice crowd and good atmosphere tonight.\"Danyal Rasool is ESPNcricinfo's Pakistan correspondent. @Danny61000",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/397000/397067.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eBy the time Australia\u0026#39;s fourth wicket fell, \u003ca href=\"https://www.espncricinfo.com/cricketers/josh-inglis-662235\"\u003eJosh Inglis\u003c/a\u003e had switched into declutter mode. There remained more than 200 runs still to get, the asking rate nearing eight, and there wasn\u0026#39;t too much batting to come. There was little time to regroup and consolidate, and at the same time little room for error.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eNone of this, Inglis understood, would be helpful to worry about. \u0026#34;We were in and around the run rate to start off with, so that was a big help,\u0026#34; Inglis said after the game. \u0026#34;The partnership between Shorty [Matt Short] and Marnus [Labuschagne] was really important. They sort of set the platform there, got us off to a good start. And then me and [Alex] Carey, we didn\u0026#39;t really say too much out there. Carey is pretty quiet when he\u0026#39;s batting, so I think we were going pretty well. So, I just tried to not look at the scoreboard too much, [not] look at the run rate, just keep batting the way we were going.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAustralia were in pursuit of what would be the highest chase in an ICC tournament, and despite his obvious talent, Inglis hasn\u0026#39;t had an ODI career of particular note yet. In 28 matches, he had scored 543 runs, averaging under 22, a quickfire 65 against West Indies in February 2024 his most significant ODI contribution. If Australia were to get close, he had to produce an effort little in his career so far provided reason to expect.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/aus-vs-eng-stats-ben-ducketts-record-knock-eclipsed-by-australias-record-chase-1474328\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStats - Duckett\u0026#39;s record knock eclipsed by Australia\u0026#39;s record chase\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/icc-champions-trophy-2024-25-1459031/australia-vs-england-4th-match-group-b-1466417/match-report\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eJosh Inglis 120* seals record win for Australia\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/champions-trophy-aus-vs-eng-ben-duckett-delivers-but-england-fall-flat-again-to-put-tournament-on-the-line-1474393\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eDuckett delivers but England fall flat again to put tournament on the line\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/champions-trophy-lahore-can-t-look-away-as-australia-do-australia-things-led-by-josh-inglis-1474396\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eLahore can\u0026#39;t look away as Australia do Australia things, led by Inglis\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIn the immediate term, Carey and Inglis minimised risks while keeping the asking rate under control. Like Australia, England had opted for the security of a deeper batting order, and would have to compensate for it with part-time bowling. In just the second over after the partnership came together, Carey struck two fours of Livingstone, before Inglis launched him for six the following over. It balanced out the respectful caution they treated Adil Rashid with without falling too far behind.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We trained here at night for the last couple of days and it got really dewy around half past seven or eight o\u0026#39;clock,\u0026#34; Inglis said. \u0026#34;So, we sort of knew that was in our favour during the run chase and if we could take it deep enough it would be tough for the bowlers at the back end. It made life easier for us, the wicket skidded on beautifully and it really helped our run chase.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;And we knew if we could get close enough with Maxi [Glenn Maxwell] still to come - we\u0026#39;ve just seen what Maxi can do and everyone\u0026#39;s seen it for a while now. So, to get close enough for him to be able to explode like that at the back end was probably in the back of our thoughts.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eInglis and Carey worked the run chase so expertly they didn\u0026#39;t necessarily need any explosions. They added 146 in just 116 deliveries, and by the time Carey holed out to mid-off, Australia just needed to stick with a similar rate of scoring.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThat fireworks came via Maxwell\u0026#39;s bat wasn\u0026#39;t especially surprising; he took the sting out of England\u0026#39;s two gun seamers in Jofra Archer and Mark Wood, scorching them for 31 in 11 balls. Inglis, however, wasn\u0026#39;t far behind, his last 36 coming off just 14 balls. It included a huge six over midwicket off Archer to bring up his hundred, and another one in the same region off Wood to seal the win.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Maybe under the circumstances [it\u0026#39;s my best innings]. It\u0026#39;s really special. I think in an ICC event, you want to have an impact and you want to help your team win a game, so maybe - I\u0026#39;ll reflect on that in the future.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eInglis\u0026#39; personal history with England perhaps adds a further layer of intrigue to the story. He was born in Leeds and only moved to Australia as a teenager, and said as recently as 2022 that he still supported England at cricket. Those days, he said today, were \u0026#34;long gone now\u0026#34;.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It doesn\u0026#39;t matter who it\u0026#39;s against,\u0026#34; he said. \u0026#34;It\u0026#39;s a really tight, quick tournament. We knew how we started the World Cup in India last year and we weren\u0026#39;t able to get a good start, we knew you can\u0026#39;t work your way into this Champions Trophy. You\u0026#39;ve got to be right on it from the first game. So, I think that\u0026#39;s probably the most pleasing thing, to get a win on the board in game one.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAnd if there\u0026#39;s little doubt about Inglis\u0026#39; loyalties now, the same couldn\u0026#39;t necessarily be said about the crowed. With 26,232 packed into the new Gaddafi Stadium, Australian and English flags were visible in roughly equal measure, and celebrations at each six or wicket, almost irrespective of who they came from. The quality and intensity of the game, without doubt the best of this tournament so far, meant the spectators\u0026#39; attention was held right through the end, with few leaving before Inglis had struck the final blow.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I thought the atmosphere was amazing all day today. It\u0026#39;s obviously the new stands. I think the ground and the stadium looks amazing. To play tonight in front of a packed crowd was unbelievable and the noise at times was deafening, especially with the Mexican wave. I saw that going around a few times and it was a really nice crowd and good atmosphere tonight.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDanyal Rasool is ESPNcricinfo\u0026#39;s Pakistan correspondent. @Danny61000\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-22T21:06:00Z",
  "modifiedTime": null
}
