{
  "id": "b598ef94-4c95-4b45-adfa-610c871fde2f",
  "title": "Jamie Smith joins England's senior ranks with two-year ECB contract",
  "link": "https://www.espncricinfo.com/ci/content/story/1457887.html?ex_cid=OTC-RSS",
  "description": "Wicketkeeper is big beneficiary as England contract 29 players for 2024-25 season",
  "author": "",
  "published": "Thu, 31 Oct 2024 23:24:08 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Andrew Miller",
  "length": 4560,
  "excerpt": "Wicketkeeper is big beneficiary as England contract 29 players for 2024-25 season",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "England have signalled their intention to place Jamie Smith at the heart of their revival across formats, handing him a lucrative two-year ECB central contract that will commit him to their plans for both next year's Ashes tour of Australia and the 2026 T20 World Cup.Smith, 24, was one of the breakout stars of England's home Test summer, scoring a maiden Test hundred against Sri Lanka at Old Trafford, before being named as the PCA's Young Player of the Year at their annual end-of-season awards dinner.Though his opportunities in white-ball cricket have so far been limited by his workload, Smith showed glimpses of his potential in the recent home ODI series against Australia, and though he is due to miss the Test tour of New Zealand as he goes on paternity leave, he looks set to be a central figure in England's plans for their white-ball tour of India in January and the subsequent Champions Trophy.Fast bowler Gus Atkinson, another impressive addition to England's plans across formats, has also received a two-year deal (a one-year extension of his existing offer) while Joe Root, Harry Brook and Mark Wood have been retained on the second of the three-year deals that they signed in the last round of contracts for 2023-24.With Brendon McCullum already secured as England's head coach across formats for the next three years, England have now tied both their red- and white-ball captains, Ben Stokes and Jos Buttler, to two-year deals. As reported last week, Stokes has agreed to extend the one-year deal that he signed last year, having then taken a punt that his value to the team would rise in the interim.Buttler's deal, meanwhile, is a show of faith in England's white-ball captain despite an absence from professional cricket that has now extended to five months as he recovers from a persistent calf injury. It comes on the same day that his long association with Rajasthan Royals was ended by his omission from their list of retained players for the 2025 IPL.England rejigged their contracts system in September 2023 to reflect the mounting pressure on international cricket from the T20 franchise circuit, with 18 of those initial 26 offers being multi-year deals. That policy came in for criticism, however, particularly in the wake of England's disastrous 50-over World Cup defence, because it limited the potential to overhaul an under-performing squad. Notably, 19 of this year's 29 deals are for one year only, including that of Jonny Bairstow, who was dropped from all three formats earlier this year, midway through his two-year deal, and seems unlikely to feature in England's plans in the near future.Jamie Smith averts England tailspin in latest show of classBethell called up for NZ Tests as Smith misses tourStokes appeals for return of stolen items after burglaryStokes signs new deal, but England will miss him in first TestIn addition to Smith, four other players have signed their first central contracts: Shoaib Bashir, Phil Salt, Olly Stone and Will Jacks, who was the notable omission from England's plans last time around. Three further players have been handed development contracts, including two new additions in Jacob Bethell and Josh Hull, and John Turner, the fast bowler who could make his England debut in the Caribbean this week.Seven players have been cut from England's list for 2024-25, including Moeen Ali, Dawid Malan and James Anderson, who have retired from international cricket, and the fast bowlers Matthew Fisher and Saqib Mahmood, who had been on development contracts after making their Test debuts in the Caribbean in 2022.The most notable absentees, however, are Ollie Robinson and Ben Foakes, the Test wicketkeeper who made way for his Surrey team-mate Smith in the summer. Both men last featured on the tour of India in February, and their hopes of a recall in the current regime would now appear to be over.\"The strength and depth of talent across England Men's red and white-ball cricket is clear in the quality of players who are centrally contracted,\" Rob Key, England men's managing director, said. \"These contracts reward the players we believe will play an important role for our England Men's teams. Both our captains, Ben Stokes and Jos Buttler, have signed two-year central contracts that showcase the commitment of all the players to prioritise playing for their country.\"I want to congratulate all the players who have signed new central contracts ahead of what is set to be an exciting period for England Men's cricket.\"Andrew Miller is UK editor of ESPNcricinfo. @miller_cricket",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/386500/386509.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eEngland have signalled their intention to place\u003ca href=\"https://www.espncricinfo.com/cricketers/jamie-smith-1096092\"\u003e Jamie Smith\u003c/a\u003e at the heart of their revival across formats, handing him a lucrative two-year ECB central contract that will commit him to their plans for both next year\u0026#39;s Ashes tour of Australia and the 2026 T20 World Cup.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSmith, 24, was one of the breakout stars of England\u0026#39;s home Test summer, scoring a maiden Test hundred against Sri Lanka at Old Trafford, before being named as the PCA\u0026#39;s Young Player of the Year at their annual end-of-season awards dinner.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThough his opportunities in white-ball cricket have so far been limited by his workload, Smith showed glimpses of his potential in the recent home ODI series against Australia, and though he is due to miss the Test tour of New Zealand as he goes on paternity leave, he looks set to be a central figure in England\u0026#39;s plans for their white-ball tour of India in January and the subsequent Champions Trophy.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eFast bowler \u003ca href=\"https://www.espncricinfo.com/cricketers/gus-atkinson-1039481\"\u003eGus Atkinson\u003c/a\u003e, another impressive addition to England\u0026#39;s plans across formats, has also received a two-year deal (a one-year extension of his existing offer) while \u003ca href=\"https://www.espncricinfo.com/cricketers/joe-root-303669\"\u003eJoe Root\u003c/a\u003e, \u003ca href=\"https://www.espncricinfo.com/cricketers/harry-brook-911707\"\u003eHarry Brook\u003c/a\u003e and \u003ca href=\"https://www.espncricinfo.com/cricketers/mark-wood-351588\"\u003eMark Wood\u003c/a\u003e have been retained on the second of the three-year deals that they signed in the last round of contracts for 2023-24.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eWith Brendon McCullum already secured as England\u0026#39;s head coach across formats for the next three years, England have now tied both their red- and white-ball captains, \u003ca href=\"https://www.espncricinfo.com/cricketers/ben-stokes-311158\"\u003eBen Stokes\u003c/a\u003e and \u003ca href=\"https://www.espncricinfo.com/cricketers/jos-buttler-308967\"\u003eJos Buttler\u003c/a\u003e, to two-year deals. As reported last week, \u003ca href=\"https://www.espncricinfo.com/story/ben-stokes-signs-new-ecb-central-contract-england-must-adapt-without-him-first-test-1453873\"\u003eStokes has agreed to extend\u003c/a\u003e the one-year deal that he signed last year, having then taken a punt that his value to the team would rise in the interim.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eButtler\u0026#39;s deal, meanwhile, is a show of faith in England\u0026#39;s white-ball captain despite an absence from professional cricket that has now extended to five months as he recovers from a persistent calf injury. It comes on the same day that his long association with Rajasthan Royals was ended by his omission from their list of retained players for the 2025 IPL.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eEngland rejigged their contracts system in September 2023 to reflect the mounting pressure on international cricket from the T20 franchise circuit, with 18 of those initial 26 offers being multi-year deals. That policy came in for criticism, however, particularly in the wake of England\u0026#39;s disastrous 50-over World Cup defence, because it limited the potential to overhaul an under-performing squad. Notably, 19 of this year\u0026#39;s 29 deals are for one year only, including that of \u003ca href=\"https://www.espncricinfo.com/cricketers/jonny-bairstow-297433\"\u003eJonny Bairstow\u003c/a\u003e, who was dropped from all three formats earlier this year, midway through his two-year deal, and seems unlikely to feature in England\u0026#39;s plans in the near future.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/pak-vs-eng-jamie-smith-averts-england-tailspin-in-latest-show-of-class-1456822\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eJamie Smith averts England tailspin in latest show of class\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/jacob-bethell-called-up-new-zealand-tests-jamie-smith-misses-tour-1457517\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eBethell called up for NZ Tests as Smith misses tour\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/ben-stokes-appeals-for-return-of-stolen-items-after-home-is-burgled-during-pakistan-tour-1457730\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStokes appeals for return of stolen items after burglary\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/ben-stokes-signs-new-ecb-central-contract-england-must-adapt-without-him-first-test-1453873\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStokes signs new deal, but England will miss him in first Test\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIn addition to Smith, four other players have signed their first central contracts: Shoaib Bashir, Phil Salt, Olly Stone and Will Jacks, who was the notable omission from England\u0026#39;s plans last time around. Three further players have been handed development contracts, including two new additions in Jacob Bethell and Josh Hull, and John Turner, the fast bowler who could make his England debut in the Caribbean this week.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSeven players have been cut from England\u0026#39;s list for 2024-25, including Moeen Ali, Dawid Malan and James Anderson, who have retired from international cricket, and the fast bowlers Matthew Fisher and Saqib Mahmood, who had been on development contracts after making their Test debuts in the Caribbean in 2022.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe most notable absentees, however, are Ollie Robinson and Ben Foakes, the Test wicketkeeper who made way for his Surrey team-mate Smith in the summer. Both men last featured on the tour of India in February, and their hopes of a recall in the current regime would now appear to be over.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;The strength and depth of talent across England Men\u0026#39;s red and white-ball cricket is clear in the quality of players who are centrally contracted,\u0026#34; Rob Key, England men\u0026#39;s managing director, said. \u0026#34;These contracts reward the players we believe will play an important role for our England Men\u0026#39;s teams. Both our captains, Ben Stokes and Jos Buttler, have signed two-year central contracts that showcase the commitment of all the players to prioritise playing for their country.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I want to congratulate all the players who have signed new central contracts ahead of what is set to be an exciting period for England Men\u0026#39;s cricket.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAndrew Miller is UK editor of ESPNcricinfo. @miller_cricket\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-31T15:01:00Z",
  "modifiedTime": null
}
