{
  "id": "c02e9dec-46c5-4b8d-a20c-5bd118ea7c6a",
  "title": "Tamim Iqbal Announces Retirement From international Cricket Again",
  "link": "https://sports.ndtv.com/cricket/tamim-iqbal-announces-retirement-from-international-cricket-again-7446148",
  "description": "Bangladesh cricket stalwart Tamim Iqbal has announced his retirement from international cricket, marking the second time he has stepped away from the game.",
  "author": "",
  "published": "Sat, 11 Jan 2025 00:51:53 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "Asian News International",
  "length": 2950,
  "excerpt": "Bangladesh cricket stalwart Tamim Iqbal has announced his retirement from international cricket, marking the second time he has stepped away from the game.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "File photo of Tamim Iqbal© X (Twitter) Bangladesh cricket stalwart Tamim Iqbal has announced his retirement from international cricket, marking the second time he has stepped away from the game. His first retirement came in July 2023 during an emotional press conference, a decision he reversed within 24 hours after an intervention by Bangladesh's then-prime minister Sheikh Hasina. Tamim made his latest decision known to the Bangladesh selectors in Sylhet on Wednesday. Despite the Gazi Ashraf Hossain-led selection panel urging him to return for the upcoming Champions Trophy, Tamim reiterated his intent to retire. Though some of his teammates, including captain Najmul Hossain Shanto, requested him to reconsider, Tamim took an additional day to reflect but ultimately stood firm on his choice. \"I have been away from international cricket for a long time,\" he wrote on Facebook, as quoted by ESPNcricinfo.\"That distance will remain. My chapter in international cricket is over. I have been thinking about this for a long time. Now that a big event like the Champions Trophy is coming up, I do not want to be the focus of anyone's attention, which could lead to the team losing their focus. Of course, I did not want this to happen before, too,\" he added.\"Captain Najmul Hossain Shanto sincerely asked me to return to the team. There were discussions with the selection committee too. I am grateful to them for still considering me in the team. However, I have listened to my own heart,\" the post said.With the deadline for Champions Trophy squad announcements set for January 12, the Bangladesh Cricket Board (BCB) was prepared to wait until the last moment for Tamim's decision. His impressive domestic form had kept him in contention. He has been active in domestic cricket since stepping away from the international stage, leading Barishal to victory in the 2024 BPL and earning the 'Player of the Tournament' award. He also performed admirably in the Dhaka Premier League, followed by consistent runs in the NCL T20s and the ongoing BPL season.Tamim, however, dismissed the BCB's prolonged anticipation for his response, calling it \"unnecessary\" as he had already opted out of the central contracts for 2024, signalling his withdrawal from international cricket considerations.\"I removed myself from the BCB central contract a long time ago because I did not want to return to international cricket,\" he wrote.\"Many have said that I have left the matter hanging. Why would anyone discuss a cricketer who is no longer in BCB's contracted list? I voluntarily stepped down more than a year ago,\" he stated\"Even after that, there has been unnecessary discussion. The decision to retire or continue playing is the right of a cricketer or any professional sportsman. I have given myself time. Now I feel that the time has come,\" the post added. Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2022-05/8ubhkmmg_tamim-iqbal-afp_625x300_17_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2022-05/8ubhkmmg_tamim-iqbal-afp_625x300_17_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"Tamim Iqbal Announces Retirement From international Cricket Again\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eFile photo of Tamim Iqbal\u003cspan\u003e© X (Twitter)\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBangladesh cricket stalwart Tamim Iqbal has announced his retirement from international cricket, marking the second time he has stepped away from the game. His first retirement came in July 2023 during an emotional press conference, a decision he reversed within 24 hours after an intervention by Bangladesh\u0026#39;s then-prime minister Sheikh Hasina. Tamim made his latest decision known to the Bangladesh selectors in Sylhet on Wednesday. Despite the Gazi Ashraf Hossain-led selection panel urging him to return for the upcoming Champions Trophy, Tamim reiterated his intent to retire. Though some of his teammates, including captain Najmul Hossain Shanto, requested him to reconsider, Tamim took an additional day to reflect but ultimately stood firm on his choice.\u003c/p\u003e\n\n\u003cp\u003e\u0026#34;I have been away from international cricket for a long time,\u0026#34; he wrote on Facebook, as quoted by ESPNcricinfo.\u003c/p\u003e\u003cp\u003e\u0026#34;That distance will remain. My chapter in international cricket is over. I have been thinking about this for a long time. Now that a big event like the Champions Trophy is coming up, I do not want to be the focus of anyone\u0026#39;s attention, which could lead to the team losing their focus. Of course, I did not want this to happen before, too,\u0026#34; he added.\u003c/p\u003e\u003cp\u003e\u0026#34;Captain Najmul Hossain Shanto sincerely asked me to return to the team. There were discussions with the selection committee too. I am grateful to them for still considering me in the team. However, I have listened to my own heart,\u0026#34; the post said.\u003c/p\u003e\u003cp\u003eWith the deadline for Champions Trophy squad announcements set for January 12, the Bangladesh Cricket Board (BCB) was prepared to wait until the last moment for Tamim\u0026#39;s decision. His impressive domestic form had kept him in contention. He has been active in domestic cricket since stepping away from the international stage, leading Barishal to victory in the 2024 BPL and earning the \u0026#39;Player of the Tournament\u0026#39; award. He also performed admirably in the Dhaka Premier League, followed by consistent runs in the NCL T20s and the ongoing BPL season.\u003c/p\u003e\u003cp\u003eTamim, however, dismissed the BCB\u0026#39;s prolonged anticipation for his response, calling it \u0026#34;unnecessary\u0026#34; as he had already opted out of the central contracts for 2024, signalling his withdrawal from international cricket considerations.\u003c/p\u003e\u003cp\u003e\u0026#34;I removed myself from the BCB central contract a long time ago because I did not want to return to international cricket,\u0026#34; he wrote.\u003c/p\u003e\u003cp\u003e\u0026#34;Many have said that I have left the matter hanging. Why would anyone discuss a cricketer who is no longer in BCB\u0026#39;s contracted list? I voluntarily stepped down more than a year ago,\u0026#34; he stated\u003c/p\u003e\u003cp\u003e\u0026#34;Even after that, there has been unnecessary discussion. The decision to retire or continue playing is the right of a cricketer or any professional sportsman. I have given myself time. Now I feel that the time has come,\u0026#34; the post added.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-11T00:51:53+05:30",
  "modifiedTime": null
}
