{
  "id": "c5aaa0fc-119f-4a5b-a55a-aca522801006",
  "title": "Cox and Walter lead Essex response against Notts",
  "link": "https://www.bbc.com/sport/cricket/articles/c1jx56ljzk7o",
  "description": "A third-wicket stand of 123 gives Essex the platform for what looks a clear, if hardly decisive, advantage against Notts at Trent Bridge.",
  "author": "",
  "published": "Sat, 12 Apr 2025 18:20:19 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 4748,
  "excerpt": "A third-wicket stand of 123 gives Essex the platform for what looks a clear, if hardly decisive, advantage against Notts at Trent Bridge.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Rothesay County Championship Division One, Trent Bridge (day two)Nottinghamshire 347: Verreynne 128*; Cook 4-44, Snater 3-88Essex 301-5: Cox 82, Walter 76, Critchley 50*; James 2-42Notts (3 pts), Essex (5 pts)Match scorecardA third-wicket stand of 123, after Nottinghamshire had ended on 347, proved the platform for what looks a clear, if hardly decisive, Essex advantage at Trent Bridge.Jordan Cox, cruelly denied a Test debut when fracturing his thumb in the nets on England's tour of New Zealand last November, continued to a sweetly timed 82 after partner Paul Walter had gone for a more muscular 76. This in answer to Kyle Verreynne's eventual unbeaten 128 for the home side earlier.Though the first ball of the final session saw Cox feather a legside delivery to the keeper only one more wicket fell before the close of a second day where the last six overs were bowled with a new ball under floodlights as April's blue skies gave way to cloud.With 117 already posted this season against Surrey, the 24-year old Cox has now passed fifty 21 times in his career for Kent and Essex, notably continuing to eight centuries, a conversion rate that left Notts relieved to see him fall short. His one misjudgement earlier was the scampered single that took him to 80 yet only barely beat a throw at the non-striker's stumps.Walter, who made 95 in his one other innings this campaign, had taken the teenage Farhan Ahmed's off-spin for a six and a four with mighty blows to mid-wicket when he attempted another, next ball, but sliced to slip as it turned out of the left-hander's rough. By tea, 40 minutes later, Essex were 205-3 only for Cox to fall on resumption.Making it two wickets in his eight-over evening spell, Lyndon James then also removed Michael Pepper who cut a short ball to backward point for 26 to bring in Noah Thain. To his credit, the 20-year old, who endured a testing day when bowling on Friday, gamely resisted 75 balls for 21 overnight in support of Matt Critchley who will resume on 50There is still little in this pitch for bowlers but it may possibly become more uneven. Seamers from the Stuart Broad End have already made the odd ball jump from a length and some have kept a little low. Essex, still lacking opener Dean Elgar on paternity leave for newborn twins, had initially made an uncertain start to their innings in the morning when Charles Allison, in only his second Championship innings, aimed an ambitious on-drive at Fergus O'Neill and went lbw for eleven.Brett Hutton, the fourth seamer, then opened with a superb yorker first ball which whipped out Tom Westley lbw for five. Lunch soon following at 54-2.At the day's start, Essex had required eight overs to claim the home side's two remaining wickets as Notts missed a third batting point by three runs in finishing on 347. Verreynne, though dropped at slip off Simon Cook when on 33 on Friday, could again not be dislodged.His undefeated century took his tally in five innings for Notts so far to 376 – this for only once out. And in between his three Notts games last September and this one seven months later he had also made Test hundreds for South Africa against three different countries.At least Cook, who had Ahmed dabbing a short, wide one to a juggling third slip for 31 and then bowled Pennington for one, returned 4-44, figures that finally did him some measure of justice.Essex captain Tom Westley: \"It's been a challenging two days but I think we're in a really good position. The way the boys came out yesterday and today and fought back after such a hard Surrey match with so many overs bowled there was outstanding.\"If I'm honest we've been slightly under par here, many dismissals were more batting error than anything but we're well in the game and after two more days of hard cricket we can hopefully get a result.\"You always want someone in the top five to go on and get a hundred but, to be honest, I'd take the contributions all the way down the order as long as we get a lead.\"Nottinghamshire's Jack Haynes:\"I thought Kyle (Verreynne) coming in to make a brilliant hundred was superb and it gave us a competitive total. Then we stuck at it in the field and if we hit with the new ball in the morning we've got every chance. It's important to strike early.\"Your job in the field is to keep up the energy for the bowlers and they kept at it really well to break the crucial stand. The heavy roller had an impact this morning but the game can change very quickly and we've seen Trent Bridge pitches offer something later.\"A couple of balls kicked up a bit and the odd one's kept low and Farhan (Ahmed) got one or two to turn off the pitch so there could be some encouragement by the fourth day.\"ECB Reporters Network supported by Rothesay",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf68/live/3464f6b0-17ca-11f0-a710-e18c9fa98fc5.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eRothesay County Championship Division One, Trent Bridge (day two)\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eNottinghamshire 347: \u003c/b\u003eVerreynne 128*; Cook 4-44, Snater 3-88\u003c/p\u003e\u003cp\u003e\u003cb\u003eEssex 301-5: \u003c/b\u003eCox 82, Walter 76, Critchley 50*; James 2-42\u003c/p\u003e\u003cp\u003e\u003ci\u003eNotts (3 pts), Essex (5 pts)\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.com/sport/cricket/scorecard/e-225647\"\u003eMatch scorecard\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eA third-wicket stand of 123, after Nottinghamshire had ended on 347, proved the platform for what looks a clear, if hardly decisive, Essex advantage at Trent Bridge.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eJordan Cox, cruelly denied a Test debut when fracturing his thumb in the nets on England\u0026#39;s tour of New Zealand last November, continued to a sweetly timed 82 after partner Paul Walter had gone for a more muscular 76. This in answer to Kyle Verreynne\u0026#39;s eventual unbeaten 128 for the home side earlier.\u003c/p\u003e\u003cp\u003eThough the first ball of the final session saw Cox feather a legside delivery to the keeper only one more wicket fell before the close of a second day where the last six overs were bowled with a new ball under floodlights as April\u0026#39;s blue skies gave way to cloud.\u003c/p\u003e\u003cp\u003eWith 117 already posted this season against Surrey, the 24-year old Cox has now passed fifty 21 times in his career for Kent and Essex, notably continuing to eight centuries, a conversion rate that left Notts relieved to see him fall short. \u003c/p\u003e\u003cp\u003eHis one misjudgement earlier was the scampered single that took him to 80 yet only barely beat a throw at the non-striker\u0026#39;s stumps.\u003c/p\u003e\u003cp\u003eWalter, who made 95 in his one other innings this campaign, had taken the teenage Farhan Ahmed\u0026#39;s off-spin for a six and a four with mighty blows to mid-wicket when he attempted another, next ball, but sliced to slip as it turned out of the left-hander\u0026#39;s rough. By tea, 40 minutes later, Essex were 205-3 only for Cox to fall on resumption.\u003c/p\u003e\u003cp\u003eMaking it two wickets in his eight-over evening spell, Lyndon James then also removed Michael Pepper who cut a short ball to backward point for 26 to bring in Noah Thain. To his credit, the 20-year old, who endured a testing day when bowling on Friday, gamely resisted 75 balls for 21 overnight in support of Matt Critchley who will resume on 50\u003c/p\u003e\u003cp\u003eThere is still little in this pitch for bowlers but it may possibly become more uneven. Seamers from the Stuart Broad End have already made the odd ball jump from a length and some have kept a little low. \u003c/p\u003e\u003cp\u003eEssex, still lacking opener Dean Elgar on paternity leave for newborn twins, had initially made an uncertain start to their innings in the morning when Charles Allison, in only his second Championship innings, aimed an ambitious on-drive at Fergus O\u0026#39;Neill and went lbw for eleven.\u003c/p\u003e\u003cp\u003eBrett Hutton, the fourth seamer, then opened with a superb yorker first ball which whipped out Tom Westley lbw for five. Lunch soon following at 54-2.\u003c/p\u003e\u003cp\u003eAt the day\u0026#39;s start, Essex had required eight overs to claim the home side\u0026#39;s two remaining wickets as Notts missed a third batting point by three runs in finishing on 347. Verreynne, though dropped at slip off Simon Cook when on 33 on Friday, could again not be dislodged.\u003c/p\u003e\u003cp\u003eHis undefeated century took his tally in five innings for Notts so far to 376 – this for only once out. And in between his three Notts games last September and this one seven months later he had also made Test hundreds for South Africa against three different countries.\u003c/p\u003e\u003cp\u003eAt least Cook, who had Ahmed dabbing a short, wide one to a juggling third slip for 31 and then bowled Pennington for one, returned 4-44, figures that finally did him some measure of justice.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEssex captain Tom Westley: \u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s been a challenging two days but I think we\u0026#39;re in a really good position. The way the boys came out yesterday and today and fought back after such a hard Surrey match with so many overs bowled there was outstanding.\u003c/p\u003e\u003cp\u003e\u0026#34;If I\u0026#39;m honest we\u0026#39;ve been slightly under par here, many dismissals were more batting error than anything but we\u0026#39;re well in the game and after two more days of hard cricket we can hopefully get a result.\u003c/p\u003e\u003cp\u003e\u0026#34;You always want someone in the top five to go on and get a hundred but, to be honest, I\u0026#39;d take the contributions all the way down the order as long as we get a lead.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eNottinghamshire\u0026#39;s Jack Haynes:\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I thought Kyle (Verreynne) coming in to make a brilliant hundred was superb and it gave us a competitive total. Then we stuck at it in the field and if we hit with the new ball in the morning we\u0026#39;ve got every chance. It\u0026#39;s important to strike early.\u003c/p\u003e\u003cp\u003e\u0026#34;Your job in the field is to keep up the energy for the bowlers and they kept at it really well to break the crucial stand. The heavy roller had an impact this morning but the game can change very quickly and we\u0026#39;ve seen Trent Bridge pitches offer something later.\u003c/p\u003e\u003cp\u003e\u0026#34;A couple of balls kicked up a bit and the odd one\u0026#39;s kept low and Farhan (Ahmed) got one or two to turn off the pitch so there could be some encouragement by the fourth day.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eECB Reporters Network supported by Rothesay\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-12T18:20:19.208Z",
  "modifiedTime": null
}
