{
  "id": "e0d41d1c-6e18-42de-92d0-3ba22ba14415",
  "title": "Frustration for Babar after late dismissal despite return to form",
  "link": "https://www.espncricinfo.com/ci/content/story/1467962.html?ex_cid=OTC-RSS",
  "description": "Filling in as opener, Babar Azam had a good day with the bat but was left to ponder what could have been",
  "author": "",
  "published": "Mon, 06 Jan 2025 00:16:12 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Danyal Rasool",
  "length": 3912,
  "excerpt": "Filling in as opener, Babar Azam had a good day with the bat but was left to ponder what could have been",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsFilling in as opener, Babar Azam had a good day with the bat but was left to ponder what could have beenThe runs have returned for Babar Azam, but a chance for a century eluded him  •  AFP/Getty ImagesBabar Azam found himself rooted to the crease in disgust. He couldn't believe the shot he'd played after being set on a surface where there was limited threat from either the pitch or the bowlers. He must have thought he'd never make that mistake again, but two sessions later it happened.So, on a day where Babar scored two half-centuries, the bigger talking point surrounded his shot selection. Well set during Pakistan's first innings in the opening session, Kwena Maphaka had bowled one well down leg side, and managed to coax Babar into tickling it through to the wicketkeeper. It has been a persistent issue with Babar - the strangle down leg. But then again, so is his manner of dismissal two sessions later when, in the dying throes of the day, he threw his hands at a wide delivery from Marco Jansen, and edged it straight to gully.Babar, Masood fight for Pakistan after South Africa enforce follow-onStats: Masood and Babar raise the follow-on bar for openersMasood practices the art of not letting goBabar admitted the dismissals meant it was disappointment rather than relief that dominated his emotions. \"I'm very disappointed with both innings. I started well, but didn't finish well,\" he said. \"If you settle, you must go much bigger. That is why I was a bit upset. There were just 15 minutes left.\"It was all the more frustrating because South Africa posed no danger of dismissing either him or Shan Masood, who scored an unbeaten hundred. Having sent down nearly a hundred overs across the two innings, their discipline over the last two sessions had been poor; they bowled 10 no-balls in 49 overs of the second innings. There was almost no swing or movement of the seam, and Pakistan's openers appeared set to finish the day unbeaten, looking to salvage something after the disaster of the first.\"The conditions here are different from Centurion,\" Babar said. \"When you come to South Africa, you don't expect that [the pitch will be so flat]. With the new ball, it was a bit challenging, but once you settled down and built a partnership, it became easier. But there are some rough patches; you saw a couple of overs from Maharaj to Shan which got some turn and bounce. So the spinner is a bit of a challenge for the batter. But against the fast bowler, if you're settled, just play your normal game.\"There was, however, some relief for Babar. After about two years without a Test fifty, he had scored three on the trot, a run stretching back to the second innings in Centurion. However, all three dismissals were down to poor shot selection rather than bowlers working him out.\"I should have capitalised during our partnership, but unfortunately it didn't happen,\" he said. \"In the second innings, my partnership with Shan has helped us come back into the game a little. Tomorrow, we have to try and build a partnership, and the longer those partnerships are the more pressure there'll be on South Africa.\"But there is a bigger picture, one that his continued struggle of late has put him in a better position to appreciate. He is the highest run-scorer for Pakistan this series, and now has something every batter values: competitive time at the crease under his belt.\"Things change in life all the time,\" he said. \"I learned a lot during this time [of poor form] when what I wanted to do I wasn't able to do, and when I couldn't do the things that people expected of me. I just kept telling myself to stay calm, and believe that my ability and hard work would be vindicated, and to try and enjoy myself. But what was really important was to spend some time on the pitch, and thankfully [that has happened this series].\"Danyal Rasool is ESPNcricinfo's Pakistan correspondent. @Danny61000",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/394200/394299.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://plus.espn.com/cricket?ex_cid=cricinfonav\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cimg height=\"22\" alt=\"espn plus\" src=\"https://wassets.hscicdn.com/static/images/espn_plus_icon_light.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv id=\"section-1467962\"\u003e\u003carticle data-id=\"1467962\" data-src=\"/story/sa-vs-pak-frustration-for-babar-azam-after-late-dismissal-despite-return-to-form-1467962\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eFilling in as opener, Babar Azam had a good day with the bat but was left to ponder what could have been\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/danyal-rasool-689\"\u003e\u003cspan\u003e\u003cimg width=\"48\" height=\"48\" alt=\"Danyal Rasool\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/394200/394299.6.jpg\" alt=\"Babar Azam registered his third straight Test fifty, second for the day, South Africa vs Pakistan, 2nd Test, Cape Town, 3rd day, January 5, 2025\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eThe runs have returned for Babar Azam, but a chance for a century eluded him  •  \u003cspan\u003eAFP/Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/babar-azam-348144\"\u003eBabar Azam\u003c/a\u003e found himself rooted to the crease in disgust. He couldn\u0026#39;t believe the shot he\u0026#39;d played after being set on a surface where there was limited threat from either the pitch or the bowlers. He must have thought he\u0026#39;d never make that mistake again, but two sessions later it happened.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSo, on a day where Babar scored two half-centuries, the bigger talking point surrounded his shot selection. Well set during Pakistan\u0026#39;s first innings in the opening session, \u003ca href=\"https://www.espncricinfo.com/cricketers/kwena-maphaka-1294342\"\u003eKwena Maphaka\u003c/a\u003e had bowled one well down leg side, and managed to coax Babar into tickling it through to the wicketkeeper. It has been a persistent issue with Babar - the strangle down leg. But then again, so is his manner of dismissal two sessions later when, in the dying throes of the day, he threw his hands at a wide delivery from \u003ca href=\"https://www.espncricinfo.com/cricketers/marco-jansen-696401\"\u003eMarco Jansen\u003c/a\u003e, and edged it straight to gully.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/south-africa-vs-pakistan-2024-25-1432205/south-africa-vs-pakistan-2nd-test-1432218/match-report-3\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eBabar, Masood fight for Pakistan after South Africa enforce follow-on\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/sa-vs-pak-2nd-test-stats-shan-masood-and-babar-azam-raise-the-follow-on-bar-for-openers-1467952\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStats: Masood and Babar raise the follow-on bar for openers\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/sa-vs-pak-2024-25-2nd-test-shan-masood-practices-the-art-of-not-letting-go-1467953\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eMasood practices the art of not letting go\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eBabar admitted the dismissals meant it was disappointment rather than relief that dominated his emotions. \u0026#34;I\u0026#39;m very disappointed with both innings. I started well, but didn\u0026#39;t finish well,\u0026#34; he said. \u0026#34;If you settle, you must go much bigger. That is why I was a bit upset. There were just 15 minutes left.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIt was all the more frustrating because South Africa posed no danger of dismissing either him or \u003ca href=\"https://www.espncricinfo.com/cricketers/shan-masood-233901\"\u003eShan Masood\u003c/a\u003e, who scored an unbeaten hundred. Having sent down nearly a hundred overs across the two innings, their discipline over the last two sessions had been poor; they bowled 10 no-balls in 49 overs of the second innings. There was almost no swing or movement of the seam, and Pakistan\u0026#39;s openers appeared set to finish the day unbeaten, looking to salvage something after the disaster of the first.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;The conditions here are different from Centurion,\u0026#34; Babar said. \u0026#34;When you come to South Africa, you don\u0026#39;t expect that [the pitch will be so flat]. With the new ball, it was a bit challenging, but once you settled down and built a partnership, it became easier. But there are some rough patches; you saw a couple of overs from Maharaj to Shan which got some turn and bounce. So the spinner is a bit of a challenge for the batter. But against the fast bowler, if you\u0026#39;re settled, just play your normal game.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThere was, however, some relief for Babar. After about two years without a Test fifty, he had scored three on the trot, a run stretching back to the second innings in Centurion. However, all three dismissals were down to poor shot selection rather than bowlers working him out.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I should have capitalised during our partnership, but unfortunately it didn\u0026#39;t happen,\u0026#34; he said. \u0026#34;In the second innings, my partnership with Shan has helped us come back into the game a little. Tomorrow, we have to try and build a partnership, and the longer those partnerships are the more pressure there\u0026#39;ll be on South Africa.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBut there is a bigger picture, one that his continued struggle of late has put him in a better position to appreciate. He is the highest run-scorer for Pakistan this series, and now has something every batter values: competitive time at the crease under his belt.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Things change in life all the time,\u0026#34; he said. \u0026#34;I learned a lot during this time [of poor form] when what I wanted to do I wasn\u0026#39;t able to do, and when I couldn\u0026#39;t do the things that people expected of me. I just kept telling myself to stay calm, and believe that my ability and hard work would be vindicated, and to try and enjoy myself. But what was really important was to spend some time on the pitch, and thankfully [that has happened this series].\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDanyal Rasool is ESPNcricinfo\u0026#39;s Pakistan correspondent. @Danny61000\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-06T00:11:00Z",
  "modifiedTime": null
}
