{
  "id": "e885114d-e88f-472c-8563-9bd603d86152",
  "title": "Worcestershire cling on after Banton's 371 for Somerset",
  "link": "https://www.bbc.com/sport/cricket/articles/cy8exr40re7o",
  "description": "Worcestershire end day three on 280-5 in their second innings, still 236 behind, after Tom Banton's 371 sees Somerset to 670-7 declared at Taunton.",
  "author": "",
  "published": "Sun, 06 Apr 2025 18:12:06 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 4607,
  "excerpt": "Worcestershire end day three on 280-5 in their second innings, still 236 behind, after Tom Banton's 371 sees Somerset to 670-7 declared at Taunton.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Rothesay County Championship Division One, Cooper Associates County Ground, Taunton (day three)Worcestershire 154 \u0026 280-5: Hose 82, D'Oliveira 71, Ali 51; Leach 3-69 Somerset 670-7 dec: Banton 371, Rew 152, Abell 52; Finch 2-104Worcestershire (1 pt) trail Somerset (8 pts) by 236 with five wickets standingMatch scorecardSomerset's Tom Banton registered the fifth highest score in the history of the County Championship when finally dismissed for 371 on the third day of the match with Worcestershire at Taunton.Unbeaten on 344 overnight, the 26-year-old extended his boundary count to 56 fours and two sixes, facing 403 balls before his wicket saw Somerset declare their first innings on 670-7, with a lead of 516. Only Brian Lara (501 not out), Archie MacLaren (424), Sam Northeast (410 not out) and Graeme Hick (405) have produced bigger innings in Championship cricket.In the face of such a daunting deficit, Worcestershire slipped to 116-4 in their second innings before a spirited recovery to 280-5, still 236 behind. Former Somerset player Adam Hose led the fightback with 82, while Brett D'Oliveira made 71 not out and Kashif Ali 51. Jack Leach claimed 3-69.A day of cloudless skies began with the home side electing to extend their imposing first innings score of 637 for six and lead of 483, giving Banton the chance to build on what was already the highest individual score by a Somerset player.He rode his luck with a couple of skiers that fell safe and moved to 350 with a single off Tom Hinley, having faced 392 balls. Lewis Gregory, unbeaten on 30 overnight, was dropped at long-off, as he and Banton extended their seventh-wicket stand beyond the century mark.Banton then smacked Hinley for only the second six of his marathon innings, which had spanned eight hours and 42 minutes by the time he was caught behind off the same bowler attempting a cut shot. Every Worcestershire player shook his hand as he left the pitch with the 21st highest score ever in first-class matches to his name.There were a minimum of 88 overs left in the day and Worcestershire were soon in trouble as, with their total on 16, Gareth Roderick was pinned lbw by Craig Overton. Leach's left-arm spin was introduced as early as the eighth over, clearly viewed as Somerset's chief threat on a dry pitch.He struck with the second ball of his sixth over with the score on 40, which squeezed past the inside edge of Jake Libby's bat to hit his back pad and led to another successful leg-before appeal.It was 58-2 at lunch, with Kashif Ali and Ethan Brookes at the crease. Both batted positively and were looking well set when making elementary errors in the afternoon session.First Brookes, on 35, top-edged a sweep shot off Leach, then Kashif, untroubled in reaching an 85-ball half-century with eight fours, advanced down the pitch to the England spinner and drove in the air straight to Overton at mid-off.But by tea, Worcestershire were 191-4, Hose having marked his return to Taunton with a fluent fifty off 68 balls, including eight fours and a six. He continued in the same fashion after the interval, while D'Oliveira looked equally confident in moving to a half-century off 93 balls, with six fours.Keeping the ball on the ground, the pair had hardly played a false stroke when the second new ball became due with the score 257-4 after 80 overs and their partnership extended to 141. It accounted for Hose, lbw to a Kasey Aldridge yorker having faced 151 balls and hit 12 fours and a six.ECB Reporters Network supported by RothesaySomerset team-mate Jack Leach on Tom Banton's 371:\"His talent has never been questioned and is such that he could play for England in all formats. Sometimes it takes some low moments to help a player reach the next level with his game and he has been through those.\"The journey 'Bants' has been on with his cricket has included a couple of difficult years and I love the fact that he has been able to come back and work his game out.\"Now he is more motivated and focussed than ever and understands fully what he is trying to do. \"The patience he showed in his innings was an inspiration to us all and hopefully we can get him a win tomorrow to mark his incredible achievement.\"Worcestershire captains Brett D'Oliveira:\"It was a more positive day for us after two disappointing ones. I believe we bat right down the order and we still have players to come who can help save the game.\"Adam Hose and I always try to break our partnerships down into small parts, taking five overs at a time as a chunk and never trying to look far ahead. \"That is what we must do as a team tomorrow.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ca0/live/95b04a30-1308-11f0-b515-e35a0abdef6d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eRothesay County Championship Division One, Cooper Associates County Ground, Taunton (day three)\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eWorcestershire 154 \u0026amp; 280-5: \u003c/b\u003eHose 82, D\u0026#39;Oliveira 71, Ali 51; Leach 3-69\u003cb\u003e \u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eSomerset 670-7 dec: \u003c/b\u003eBanton 371, Rew 152, Abell 52; Finch 2-104\u003c/p\u003e\u003cp\u003e\u003ci\u003eWorcestershire (1 pt) trail Somerset (8 pts) by 236 with five wickets standing\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.com/sport/cricket/scorecard/e-225640\"\u003eMatch scorecard\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSomerset\u0026#39;s Tom Banton registered the fifth highest score in the history of the County Championship when finally dismissed for 371 on the third day of the match with Worcestershire at Taunton.\u003c/p\u003e\u003cp\u003eUnbeaten on 344 overnight, the 26-year-old extended his boundary count to 56 fours and two sixes, facing 403 balls before his wicket saw Somerset declare their first innings on 670-7, with a lead of 516. \u003c/p\u003e\u003cp\u003eOnly Brian Lara (501 not out), Archie MacLaren (424), Sam Northeast (410 not out) and Graeme Hick (405) have produced bigger innings in Championship cricket.\u003c/p\u003e\u003cp\u003eIn the face of such a daunting deficit, Worcestershire slipped to 116-4 in their second innings before a spirited recovery to 280-5, still 236 behind. \u003c/p\u003e\u003cp\u003eFormer Somerset player Adam Hose led the fightback with 82, while Brett D\u0026#39;Oliveira made 71 not out and Kashif Ali 51. Jack Leach claimed 3-69.\u003c/p\u003e\u003cp\u003eA day of cloudless skies began with the home side electing to extend their imposing first innings score of 637 for six and lead of 483, giving Banton the chance to build on what was already the highest individual score by a Somerset player.\u003c/p\u003e\u003cp\u003eHe rode his luck with a couple of skiers that fell safe and moved to 350 with a single off Tom Hinley, having faced 392 balls. \u003c/p\u003e\u003cp\u003eLewis Gregory, unbeaten on 30 overnight, was dropped at long-off, as he and Banton extended their seventh-wicket stand beyond the century mark.\u003c/p\u003e\u003cp\u003eBanton then smacked Hinley for only the second six of his marathon innings, which had spanned eight hours and 42 minutes by the time he was caught behind off the same bowler attempting a cut shot. \u003c/p\u003e\u003cp\u003eEvery Worcestershire player shook his hand as he left the pitch with the 21st highest score ever in first-class matches to his name.\u003c/p\u003e\u003cp\u003eThere were a minimum of 88 overs left in the day and Worcestershire were soon in trouble as, with their total on 16, Gareth Roderick was pinned lbw by Craig Overton. \u003c/p\u003e\u003cp\u003eLeach\u0026#39;s left-arm spin was introduced as early as the eighth over, clearly viewed as Somerset\u0026#39;s chief threat on a dry pitch.\u003c/p\u003e\u003cp\u003eHe struck with the second ball of his sixth over with the score on 40, which squeezed past the inside edge of Jake Libby\u0026#39;s bat to hit his back pad and led to another successful leg-before appeal.\u003c/p\u003e\u003cp\u003eIt was 58-2 at lunch, with Kashif Ali and Ethan Brookes at the crease. Both batted positively and were looking well set when making elementary errors in the afternoon session.\u003c/p\u003e\u003cp\u003eFirst Brookes, on 35, top-edged a sweep shot off Leach, then Kashif, untroubled in reaching an 85-ball half-century with eight fours, advanced down the pitch to the England spinner and drove in the air straight to Overton at mid-off.\u003c/p\u003e\u003cp\u003eBut by tea, Worcestershire were 191-4, Hose having marked his return to Taunton with a fluent fifty off 68 balls, including eight fours and a six. \u003c/p\u003e\u003cp\u003eHe continued in the same fashion after the interval, while D\u0026#39;Oliveira looked equally confident in moving to a half-century off 93 balls, with six fours.\u003c/p\u003e\u003cp\u003eKeeping the ball on the ground, the pair had hardly played a false stroke when the second new ball became due with the score 257-4 after 80 overs and their partnership extended to 141. \u003c/p\u003e\u003cp\u003eIt accounted for Hose, lbw to a Kasey Aldridge yorker having faced 151 balls and hit 12 fours and a six.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003ci\u003eECB Reporters Network supported by Rothesay\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eSomerset team-mate Jack Leach on Tom Banton\u0026#39;s 371:\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;His talent has never been questioned and is such that he could play for England in all formats. Sometimes it takes some low moments to help a player reach the next level with his game and he has been through those.\u003c/p\u003e\u003cp\u003e\u0026#34;The journey \u0026#39;Bants\u0026#39; has been on with his cricket has included a couple of difficult years and I love the fact that he has been able to come back and work his game out.\u003c/p\u003e\u003cp\u003e\u0026#34;Now he is more motivated and focussed than ever and understands fully what he is trying to do. \u003c/p\u003e\u003cp\u003e\u0026#34;The patience he showed in his innings was an inspiration to us all and hopefully we can get him a win tomorrow to mark his incredible achievement.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eWorcestershire captains Brett D\u0026#39;Oliveira:\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;It was a more positive day for us after two disappointing ones. I believe we bat right down the order and we still have players to come who can help save the game.\u003c/p\u003e\u003cp\u003e\u0026#34;Adam Hose and I always try to break our partnerships down into small parts, taking five overs at a time as a chunk and never trying to look far ahead. \u003c/p\u003e\u003cp\u003e\u0026#34;That is what we must do as a team tomorrow.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-06T18:11:59.906Z",
  "modifiedTime": null
}
