{
  "id": "82838153-b905-46f5-8078-8613efd9121a",
  "title": "Ten years of blogging, one article at a time",
  "link": "https://benoitpasquier.com/2022/03/ten-years-of-blogging-one-article-at-a-time/",
  "description": "Most of people don’t know but I’ve been blogging for some time now. Actually, tomorrow will be ten years. Today is a good time to take a walk on memory lane.",
  "author": "",
  "published": "Thu, 03 Mar 2022 08:00:00 +0000",
  "source": "https://benoitpasquier.com/index.xml",
  "categories": null,
  "byline": "Benoit Pasquier",
  "length": 6023,
  "excerpt": "Most of people don’t know but I’ve been blogging for some time now. Actually, tomorrow will be ten years. Today is a good time to take a walk on memory lane.",
  "siteName": "Benoit Pasquier",
  "favicon": "https://benoitpasquier.com/favicon.png",
  "text": "Most of people don’t know but I’ve been blogging for some time now. Actually, tomorrow will be ten years. Today is a good time to take a walk on memory lane. Four years ago, I already reflected on what I’ve learned from blogging. Funny enough, I feel it was yesterday I wrote this. Time flies. Today, I want to revisit and complete this part: what blogging for 10 years taught me, what it didn’t prepare me for, and what’s next? How much do you not know? In software engineering, we tend to measure ourselves based on technical knowledge. How much expert are you on this language? Do you know this latest framework? How come you’re not aware of this new paradigm? Ten years ago, I was rushing for knowledge on mobile development. There weren’t all those many resources we have today, or maybe it was just harder to find them. It felt more like hacking around without always understand what was going on. It’s a part of something I wish I knew early on in my career. Over the years, I learnt few things but I also have a better grasp of what I don’t know. For instance, I know how to build a mobile app, but I’m not expert to every other frameworks, I know where to find those information though and I’m okay with it. The earlier you accept that you can’t (and won’t) know everything, the better will be your relationship with technology. Not knowing make you want to find an answer out there, diving into pages of documentations, asking questions to the right people. Curiosity and patience are your best weapons. If I think about it, development would probably be the most boring job to do if there is no learning from it. Starting is the easy part A lot of people think launching a project or starting a blog is the end goal. I was the same. The truth is that starting is the easy part. Consistency is the hardest part. Within 10 years, I posted about ~140 posts. That’s about 1 post per month. There was time I managed to keep the pace and published one article per week for few months, but it really burned me out, and followed with months without posting anything. To put in perspective, John Sundell recently shared it started his blog 5 years ago, and already tackled more than 500 articles. That’s two articles a week in average! Amazing. Swift by Sundell now contains 500 articles about Swift, UIKit, SwiftUI, and beyond - making it one of the largest collections of 💯% free Swift and iOS development resources in the world! 😀🎉Thanks so much to all readers and sponsors who have made all of this possible! 🙌 pic.twitter.com/wsyGr11hdc— John Sundell (@johnsundell) January 3, 2022 It looks easy from outside, but I can assure you it’s not. It requires research, writing, code sample and so on. In average, it takes me about 4h from an idea to the publication of a post. Knowing that, I cannot have more respects to all those writers who release content every single week, regardless if it’s videos, podcast or else. Sharing is exposing yourself to the opinion of others When I started sharing articles, I never really thought about the impact on others. To me, it wasn’t about looking smart, or trying to get traffic for future sponsorship. It was just to share a solution to a problem I had, or an idea how to face a coding challenge, nothing more. Over the years, I saw this content slowly having impact to others. Sometimes, I heard great feedbacks, people having a genuine interest in my work or learning from my content. But sometimes, I also heard very strong opposite opinions, pushing me to my corner, enough to wish stop writing. At that time, it felt strange to me if I share an article “how to do X with Z” it could be interpreted as opinionated by some readers as “this is the only (and best) way to do X is with Z”. Sharing a way to do it wasn’t meant to close doors to other solutions, but it’s hard to please everyone. I wish I could tell you that after 10 years of writing I’m better at handling poor feedbacks, but I’m not there yet. As long as I care about what I do, it’s hard for me to let it go, that’s probably why I still do it over all those years. I don’t have the pretention that all my content has been great. Of course not. I’ve learnt and improved over time. I’m also always happy to hear anybody’s feedback, as long as it’s constructive. So what’s next? I could say I’ll double down and create the best article I’ve ever written, but that’s probably not true. It took me a while to find a balance where I’m happy about writing but also okay when I don’t post anything. This fine balance moved over time. After all, we all have 24h per day, so we got to choose what we want to focus on, and some of my focus isn’t always on writing. For instance, running and exercising take out 4h to 6h per week. Time management is key to keep this balance. That being said, I’m always interested to contribute and give back to the community. Writing articles has been one format I liked, and there might be other out there, maybe as a speaker to events, maybe as a mentor to new mobile developers, maybe something else. We’ll see if a new opportunity comes. It goes without saying but those past 10 years of blogging wouldn’t have been possible without the massive iOS community out there. There have been many amazing people who’s supported my work over time, directly or indirectly. My former and current teammates I learnt from. Lots of posts I shared came from day-to-day issues. The contributors to new development paradigm and frameworks we use every day. The curators for newsletters and other content to relay my work. The curious asking questions on StackOverflow that inspired me to go beyond. The creators who release iOS content and openly share about the struggle to create it. That reminded me I wasn’t alone struggling on those days. The many more out there … The last and important one is you! All the curious readers who spent time on this website trying to find an answer to your question. So thank you 🙇‍♂️ Until next time 👋 Credits Photo - Jeffrey Surju Photo - Adam Grant",
  "image": "https://benoitpasquier.com/images/2022/03/typing-machine.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv itemprop=\"articleBody\"\u003e\n              \u003cp\u003eMost of people don’t know but I’ve been blogging for some time now. \u003cem\u003eActually\u003c/em\u003e, tomorrow will be ten years. Today is a good time to take a walk on \u003cem\u003ememory lane\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eFour years ago, I already reflected on what \u003ca href=\"https://benoitpasquier.com/learning-from-blogging/\"\u003eI’ve learned from blogging\u003c/a\u003e. Funny enough, I feel it was yesterday I wrote this. \u003cem\u003eTime flies.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eToday, I want to revisit and complete this part: what blogging for 10 years taught me, what it didn’t prepare me for, and what’s next?\u003c/p\u003e\n\u003ch2 id=\"how-much-do-you-not-know\"\u003eHow much do you not know?\u003c/h2\u003e\n\u003cp\u003eIn software engineering, we tend to measure ourselves based on technical knowledge. How much expert are you on this language? Do you know this latest framework? How come you’re not aware of this new paradigm?\u003c/p\u003e\n\u003cp\u003eTen years ago, I was rushing for knowledge on mobile development. There weren’t all those many resources we have today, or maybe it was just harder to find them. It felt more like hacking around without always understand what was going on. It’s a part of something \u003ca href=\"https://benoitpasquier.com/2021/07/things-i-wish-i-knew-in-my-early-coding-career/\"\u003eI wish I knew early on\u003c/a\u003e in my career.\u003c/p\u003e\n\u003cp\u003eOver the years, I learnt few things but I also have a better grasp of what \u003cem\u003eI don’t know\u003c/em\u003e. For instance, I know how to build a mobile app, but I’m not expert to every other frameworks, I know where to find those information though and I’m okay with it.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://benoitpasquier.com/images/2022/03/you-dont-know.jpeg\" alt=\"what-i-know\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe earlier you accept that you can’t (and won’t) know everything, the better will be your relationship with technology.\u003c/p\u003e\n\u003cp\u003eNot knowing make you want to find an answer out there, diving into pages of documentations, asking questions to the right people. Curiosity and patience are your best weapons.\u003c/p\u003e\n\u003cp\u003eIf I think about it, development would probably be the most boring job to do if there is no learning from it.\u003c/p\u003e\n\u003ch2 id=\"starting-is-the-easy-part\"\u003eStarting is the easy part\u003c/h2\u003e\n\u003cp\u003eA lot of people think launching a project or starting a blog is the end goal. I was the same. The truth is that starting is the easy part. \u003cem\u003eConsistency\u003c/em\u003e is the hardest part.\u003c/p\u003e\n\u003cp\u003eWithin 10 years, I posted about ~140 posts. That’s about 1 post per month. There was time I managed to keep the pace and published one article per week for few months, but it really burned me out, and followed with months without posting anything.\u003c/p\u003e\n\u003cp\u003eTo put in perspective, \u003ca href=\"https://twitter.com/johnsundell\"\u003eJohn Sundell\u003c/a\u003e recently shared it started his blog 5 years ago, and already tackled more than 500 articles. That’s two articles a week in average!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAmazing.\u003c/em\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cdiv lang=\"en\" dir=\"ltr\"\u003e\u003cp\u003eSwift by Sundell now contains 500 articles about Swift, UIKit, SwiftUI, and beyond - making it one of the largest collections of 💯% free Swift and iOS development resources in the world! 😀🎉\u003c/p\u003e\u003cp\u003eThanks so much to all readers and sponsors who have made all of this possible! 🙌 \u003ca href=\"https://t.co/wsyGr11hdc\"\u003epic.twitter.com/wsyGr11hdc\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e— John Sundell (@johnsundell) \u003ca href=\"https://twitter.com/johnsundell/status/1477987444687777792?ref_src=twsrc%5Etfw\"\u003eJanuary 3, 2022\u003c/a\u003e\u003c/blockquote\u003e\n\n\n\u003cp\u003eIt looks easy from outside, but I can assure you it’s not. It requires research, writing, code sample and so on.\u003c/p\u003e\n\u003cp\u003eIn average, it takes me about 4h from an idea to the publication of a post. Knowing that, I cannot have more respects to all those writers who release content every single week, regardless if it’s videos, podcast or else.\u003c/p\u003e\n\u003ch2 id=\"sharing-is-exposing-yourself-to-the-opinion-of-others\"\u003eSharing is exposing yourself to the opinion of others\u003c/h2\u003e\n\u003cp\u003eWhen I started sharing articles, I never really thought about the impact on others. To me, it wasn’t about looking smart, or trying to get traffic for future sponsorship. It was just to share a solution to a problem I had, or an idea how to face a coding challenge, nothing more.\u003c/p\u003e\n\u003cp\u003eOver the years, I saw this content slowly having impact to others. Sometimes, I heard great feedbacks, people having a genuine interest in my work or learning from my content.\u003c/p\u003e\n\u003cp\u003eBut sometimes, I also heard very strong opposite opinions, pushing me to my corner, enough to \u003ca href=\"https://benoitpasquier.com/2020/03/should-i-quit-blogging/\"\u003ewish stop writing\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAt that time, it felt strange to me if I share an article \u003cem\u003e“how to do X with Z”\u003c/em\u003e it could be interpreted as opinionated by some readers as \u003cem\u003e“this is the only (and best) way to do X is with Z”\u003c/em\u003e. Sharing a way to do it wasn’t meant to close doors to other solutions, but it’s hard to please everyone.\u003c/p\u003e\n\u003cp\u003eI wish I could tell you that after 10 years of writing I’m better at handling poor feedbacks, but I’m not there yet. As long as I care about what I do, it’s hard for me to let it go, that’s probably why I still do it over all those years.\u003c/p\u003e\n\u003cp\u003eI don’t have the pretention that all my content has been great. Of course not. I’ve learnt and improved over time. I’m also always happy to hear anybody’s feedback, as long as it’s constructive.\u003c/p\u003e\n\u003ch2 id=\"so-whats-next\"\u003eSo what’s next?\u003c/h2\u003e\n\u003cp\u003eI could say I’ll double down and create the best article I’ve ever written, but that’s probably not true. It took me a while to find a balance where I’m happy about writing but also okay when I don’t post anything.\u003c/p\u003e\n\u003cp\u003eThis fine balance moved over time. After all, we all have 24h per day, so we got to choose what we want to focus on, and some of my focus isn’t always on writing. For instance, running and exercising take out 4h to 6h per week.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTime management is key to keep this balance.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThat being said, I’m always interested to contribute and give back to the community. Writing articles has been one format I liked, and there might be other out there, maybe as a speaker to events, maybe as a mentor to new mobile developers, maybe something else. We’ll see if a new opportunity comes.\u003c/p\u003e\n\n\u003cp\u003eIt goes without saying but those past 10 years of blogging wouldn’t have been possible without the massive iOS community out there.\u003c/p\u003e\n\u003cp\u003eThere have been many amazing people who’s supported my work over time, directly or indirectly.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMy former and current teammates I learnt from. Lots of posts I shared came from day-to-day issues.\u003c/li\u003e\n\u003cli\u003eThe contributors to new development paradigm and frameworks we use every day.\u003c/li\u003e\n\u003cli\u003eThe curators for newsletters and other content to relay my work.\u003c/li\u003e\n\u003cli\u003eThe curious asking questions on StackOverflow that inspired me to go beyond.\u003c/li\u003e\n\u003cli\u003eThe creators who release iOS content and openly share about the struggle to create it. That reminded me I wasn’t alone struggling on those days.\u003c/li\u003e\n\u003cli\u003eThe many more out there …\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe last and important one is you! All the curious readers who spent time on this website trying to find an answer to your question.\u003c/p\u003e\n\u003cp\u003eSo thank you 🙇‍♂️\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eUntil next time\u003c/em\u003e 👋\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eCredits\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003ePhoto - \u003ca href=\"https://unsplash.com/@notjeffreysurju\"\u003eJeffrey Surju\u003c/a\u003e\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003cem\u003ePhoto - \u003ca href=\"https://twitter.com/adammgrant/status/1356966998178209793\"\u003eAdam Grant\u003c/a\u003e\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n              \n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2022-03-03T08:00:00Z",
  "modifiedTime": "2022-03-03T08:00:00Z"
}
