{
  "id": "91a6ab1c-cb39-4f90-bb18-47512f65d653",
  "title": "Artifacts",
  "link": "https://fabisevi.ch/2025/07/23/artifacts/",
  "description": "I. I once knew a wonderful man. He was kind, gentle, and beloved by many. He was so wise that when he graduated from college, Mahatma Gandhi himself handed him his diploma. He was a scholar and a gentleman, blessed with the unique gift of deeply knowing Sanskrit and Hindi. He spent much of his life translating scrolls filled with the wisdom of the ancients into modern language — in pursuit of preserving history. II. When Mongol troops raided the House of Wisdom and dumped so many manuscripts into the Tigris that “the river ran black with ink”, Muslim chroniclers equated the loss of knowledge to a civilizational catastrophe. Many of the books in the Grand Library of Baghdad were torn apart by pillagers so their leather covers could be made into sandals — compounding the pain of an already destructive act. III. In 1969, three astronauts planted an American flag on the moon. This event was captured on film and beamed to millions of household television sets, as people across the world shared the experience of witnessing a profound leap for mankind. Our connection to the cosmos had been reshaped — and we still talk about it decades later. IV. Early internet phenomenons like Charlie the Unicorn, Potter Puppet Pals, and Peanut Butter Jelly Time provided endless entertainment. My older brother introduced me to All Your Base Are Belong to Us, and I showed him lolcats. A few months later, I met a kid I considered sheltered because he’d never heard of Newgrounds — so I showed him everything it had to offer, and we relived the humor together. That rhythm of discovery and sharing lasted for years, as the internet grew at a pace that felt almost unthinkable compared to my early childhood.",
  "author": "Joe Fabisevich",
  "published": "Wed, 23 Jul 2025 00:00:00 GMT",
  "source": "https://www.fabisevi.ch/feed.xml",
  "categories": null,
  "byline": "",
  "length": 5226,
  "excerpt": "I. I once knew a wonderful man. He was kind, gentle, and beloved by many. He was so wise that when he graduated from college, Mahatma Gandhi himself handed him his diploma. He was a scholar and a gentleman, blessed with the unique gift of deeply knowing Sanskrit and Hindi. He spent much of his life translating scrolls filled with the wisdom of the ancients into modern language — in pursuit of preserving history. II. When Mongol troops raided the House of Wisdom and dumped so many manuscripts into the Tigris that “the river ran black with ink”, Muslim chroniclers equated the loss of knowledge to a civilizational catastrophe. Many of the books in the Grand Library of Baghdad were torn apart by pillagers so their leather covers could be made into sandals — compounding the pain of an already destructive act. III. In 1969, three astronauts planted an American flag on the moon. This event was captured on film and beamed to millions of household television sets, as people across the world shared the experience of witnessing a profound leap for mankind. Our connection to the cosmos had been reshaped — and we still talk about it decades later. IV. Early internet phenomenons like Charlie the Unicorn, Potter Puppet Pals, and Peanut Butter Jelly Time provided endless entertainment. My older brother introduced me to All Your Base Are Belong to Us, and I showed him lolcats. A few months later, I met a kid I considered sheltered because he’d never heard of Newgrounds — so I showed him everything it had to offer, and we relived the humor together. That rhythm of discovery and sharing lasted for years, as the internet grew at a pace that felt almost unthinkable compared to my early childhood.",
  "siteName": "",
  "favicon": "https://fabisevi.ch/icons/icon-512x512.png?v=b60b950dc439294a707fb76cdaca4274",
  "text": "I. I once knew a wonderful man. He was kind, gentle, and beloved by many. He was so wise that when he graduated from college, Mahatma Gandhi himself handed him his diploma. He was a scholar and a gentleman, blessed with the unique gift of deeply knowing Sanskrit and Hindi. He spent much of his life translating scrolls filled with the wisdom of the ancients into modern language — in pursuit of preserving history. II. When Mongol troops raided the House of Wisdom and dumped so many manuscripts into the Tigris that “the river ran black with ink”, Muslim chroniclers equated the loss of knowledge to a civilizational catastrophe. Many of the books in the Grand Library of Baghdad were torn apart by pillagers so their leather covers could be made into sandals — compounding the pain of an already destructive act. III. In 1969, three astronauts planted an American flag on the moon. This event was captured on film and beamed to millions of household television sets, as people across the world shared the experience of witnessing a profound leap for mankind. Our connection to the cosmos had been reshaped — and we still talk about it decades later. IV. Early internet phenomenons like Charlie the Unicorn, Potter Puppet Pals, and Peanut Butter Jelly Time provided endless entertainment. My older brother introduced me to All Your Base Are Belong to Us, and I showed him lolcats. A few months later, I met a kid I considered sheltered because he’d never heard of Newgrounds — so I showed him everything it had to offer, and we relived the humor together. That rhythm of discovery and sharing lasted for years, as the internet grew at a pace that felt almost unthinkable compared to my early childhood. V. Millennials remember The Dress as a seminal cultural moment that captivated people for days, but what most don’t remember are the two llamas that escaped a zoo earlier that day and caused a commotion along the way. To my recollection, this was the first viral moment that was overtaken by another so quickly that it might as well not have even happened. VI. Last week I watched a very funny TikTok. It was a meme that dominated everyone's feeds for about eight hours — but then we collectively forgot it ever existed and moved on to the next funny video. As people willfully turn themselves into content creators, information disseminates faster than ever. The half-life of any artifact grows shorter, and the societal impact of any captured moment becomes increasingly fleeting. The purpose of writing, art, and creation has always been human connection — but as the goal shifts to pleasing an opaque algorithm, the creations themselves have become less meaningful. I expect this trend will only accelerate as more of our economy becomes tied to clicks and views, and as the act of creation grows more frictionless with the proliferation of AI. Artifacts are our distillations of history — they encapsulate and preserve the human experience. Our world is built on the artifacts of those who came before us — people who cared enough to share, document, and build something that outlasted themselves. It is a spiritual experience to create something new in this world — to turn a figment of our imagination into a shareable element of the universe. I do my best to fill my days with artifact creation — shunning the incentive structures the modern world creates when I can — to tap into the essence of what drives me to create artifacts that will outlive me. I don’t spend all my time creating my own artifacts; there is often more to be gained by sharing myself, so others can create their own artifacts that bring meaning to them and others. In a way, that transfer of knowledge is itself a transient artifact — just like a years-long running joke between me and my wife, a kiss we share, or a wedding vow we made, is an artifact of our love. Almost everything I consciously do is related to creating or preserving artifacts — but the artifact is only a small part of who I am. It’s no coincidence that I’ve aligned the time I spend on earth with the way I make a living with my values. Anything meaningful is worth doing, and worth preserving. What people see is the result of hundreds or thousands of hours of work that went into creating the artifact — and the hundreds of thousands of hours I’ve lived that led to it. But an artifact can never truly capture my full experience. It is a synthesized approximation. At best, it’s a low-fidelity version of my lived reality — not the life itself, but the echo. And yet, when thoughtfully preserved, the artifact will outlive me.Joe Fabisevich is an indie developer creating software at Red Panda Club Inc. while writing about design, development, and building a company. Formerly an iOS developer working on societal issues @Twitter. These days I don't tweet, but I do post on Bluesky.Like my writing? You can keep up with it in your favorite RSS reader, or get posts emailed in newsletter form. I promise to never spam you or send you anything other than my posts, it's just a way for you to read my writing wherever's most comfortable for you.If you'd like to know more, wanna talk, or need some advice, feel free to sign up for office hours, I'm very friendly. 🙂",
  "image": "https://fabisevi.ch/images/og-image.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eI.\u003c/strong\u003e I once knew \u003ca href=\"https://en.wikipedia.org/wiki/Panchapakesa_Jayaraman\"\u003ea wonderful man\u003c/a\u003e. He was kind, gentle, and beloved by many. He was so wise that when he graduated from college, Mahatma Gandhi himself handed him his diploma. He was a scholar and a gentleman, blessed with the unique gift of deeply knowing Sanskrit and Hindi. He spent much of his life translating scrolls filled with the wisdom of the ancients into modern language — in pursuit of preserving history.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eII.\u003c/strong\u003e When Mongol troops raided the House of Wisdom and dumped so many manuscripts into the Tigris that “the river ran black with ink”, Muslim chroniclers equated the loss of knowledge to a civilizational catastrophe. Many of the books in the Grand Library of Baghdad were torn apart by pillagers so their leather covers could be made into sandals — compounding the pain of an already destructive act.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIII.\u003c/strong\u003e In 1969, three astronauts planted an American flag on the moon. This event was captured on film and beamed to millions of household television sets, as people across the world shared the experience of witnessing a profound leap for mankind. Our connection to the cosmos had been reshaped — and we still talk about it decades later.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIV.\u003c/strong\u003e Early internet phenomenons like Charlie the Unicorn, Potter Puppet Pals, and Peanut Butter Jelly Time provided endless entertainment. My older brother introduced me to All Your Base Are Belong to Us, and I showed him lolcats. A few months later, I met a kid I considered sheltered because he’d never heard of Newgrounds — so I showed him everything it had to offer, and we relived the humor together. That rhythm of discovery and sharing lasted for years, as the internet grew at a pace that felt almost unthinkable compared to my early childhood.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eV.\u003c/strong\u003e Millennials remember The Dress as a seminal cultural moment that captivated people for days, but what most don’t remember are the two llamas that escaped a zoo earlier that day and caused a commotion along the way. To my recollection, this was the first viral moment that was overtaken by another so quickly that it might as well not have even happened.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVI.\u003c/strong\u003e Last week I watched a very funny TikTok. It was a meme that dominated everyone\u0026#39;s feeds for about eight hours — but then we collectively forgot it ever existed and moved on to the next funny video.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eAs people willfully turn themselves into content creators, information disseminates faster than ever. The half-life of any artifact grows shorter, and the societal impact of any captured moment becomes increasingly fleeting. The purpose of writing, art, and creation has always been human connection — but as the goal shifts to pleasing an opaque algorithm, the creations themselves have become less meaningful. I expect this trend will only accelerate as more of our economy becomes tied to clicks and views, and as the act of creation grows more frictionless with the proliferation of AI.\u003c/p\u003e\n\u003cp\u003eArtifacts are our distillations of history — they encapsulate and preserve the human experience. Our world is built on the artifacts of those who came before us — people who cared enough to share, document, and build something that outlasted themselves. It is a spiritual experience to create something new in this world — to turn a figment of our imagination into a shareable element of the universe.\u003c/p\u003e\n\u003cp\u003eI do my best to fill my days with artifact creation — shunning the incentive structures the modern world creates when I can — to tap into the essence of what drives me to create artifacts that will outlive me. I don’t spend all my time creating my own artifacts; there is often more to be gained by sharing myself, so others can create their own artifacts that bring meaning to them and others. In a way, that transfer of knowledge is itself a transient artifact — just like a years-long running joke between me and my wife, a kiss we share, or a wedding vow we made, is an artifact of our love.\u003c/p\u003e\n\u003cp\u003eAlmost everything I consciously do is related to creating or preserving artifacts — but the artifact is only a small part of who I am. It’s no coincidence that I’ve aligned the time I spend on earth with \u003ca href=\"https://plinky.app\"\u003ethe way I make a living\u003c/a\u003e with my values. Anything meaningful is worth doing, and worth preserving.\u003c/p\u003e\n\u003cp\u003eWhat people see is the result of hundreds or thousands of hours of work that went into creating the artifact — and the hundreds of thousands of hours I’ve lived that led to it. But an artifact can never truly capture my full experience. It is a synthesized approximation. At best, it’s a low-fidelity version of my lived reality — not the life itself, but the echo.\u003c/p\u003e\n\u003cp\u003eAnd yet, when thoughtfully preserved, the artifact will outlive me.\u003c/p\u003e\u003c/div\u003e\u003cp\u003eJoe Fabisevich is an indie developer creating software at \u003ca href=\"https://redpanda.club\"\u003eRed Panda Club Inc.\u003c/a\u003e while writing about design, development, and building a company. Formerly an iOS developer working on societal issues \u003ca href=\"https://bsky.app/profile/mergesort.me\"\u003e@Twitter\u003c/a\u003e. These days I don\u0026#39;t tweet, but I do post on \u003ca href=\"https://bsky.app/profile/mergesort.me\"\u003eBluesky\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eLike my writing? You can keep up with it in your favorite \u003ca href=\"https://fabisevi.ch/feed.xml\"\u003eRSS\u003c/a\u003e reader, or get posts \u003ca href=\"https://buttondown.com/mergesort\"\u003eemailed\u003c/a\u003e in newsletter form. I promise to never spam you or send you anything other than my posts, it\u0026#39;s just a way for you to read my writing wherever\u0026#39;s most comfortable for you.\u003c/p\u003e\u003cp\u003eIf you\u0026#39;d like to know more, wanna talk, or need some advice, feel free to sign up for \u003ca href=\"https://cal.com/mergesort/office-hours\"\u003eoffice hours\u003c/a\u003e, I\u0026#39;m very friendly. 🙂\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
