[
  {
    "id": "6a77b344-b97f-494a-90c1-a12566a05428",
    "title": "Nate on Atlas Obscura",
    "link": "https://play.prx.org/listen?ge=prx_3_735737f9-7275-498f-8f40-25ec358110e6\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. This is a special bonus episode of the podcast sharing a particularly good interview I did with the folks at Atlas Obscura.",
    "author": "Nate DiMeo",
    "published": "Sat, 07 Dec 2024 04:21:34 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/735737f9-7275-498f-8f40-25ec358110e6/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "e820d308-5ce8-4245-98de-3aeee22985c0",
    "title": "Nate DiMeo and Pablo Torre Find Out",
    "link": "https://play.prx.org/listen?ge=prx_3_7c0313eb-d1f3-463c-b668-f925e1b14df6\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. This is a special bonus episode of the podcast sharing with you my extremely fun appearance on the wonderful podcast, Pablo Torre Finds Out. You can watch it on Youtube, including the dynamite animation from my friend, Arthur Jones, here.",
    "author": "Nate DiMeo",
    "published": "Mon, 25 Nov 2024 18:49:57 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/7c0313eb-d1f3-463c-b668-f925e1b14df6/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "db43051e-9467-499b-be35-f166aa7e4d43",
    "title": "Show 71 - Mania for Subjugation",
    "link": "http://www.dancarlin.com/product/hardcore-history-71-mania-for-subjugation",
    "description": "What's the recipe for making a historically world-class apex predator? In the case of Alexander the Great, it might be the three Ns: Nature, Nurture, and Nepotism.",
    "author": "",
    "published": "Fri, 07 Jun 2024 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha71_Mania_for_Subjugation.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Alexander the Great",
      " Phillip II",
      " Macedonia",
      " Macedon",
      " Olympias",
      " Demosthenes",
      " Athens",
      " Sparta",
      " Thebes",
      " Persia",
      " history",
      " podcast",
      " ancient",
      " military",
      " Aristotle",
      " Greece",
      " Hellenistic"
    ]
  },
  {
    "id": "424d4ffa-13af-47d2-883e-af34cfae8d8d",
    "title": "Show 70 - Twilight of the Aesir II",
    "link": "http://www.dancarlin.com/product/hardcore-history-70-twilight-of-the-aesir-ii",
    "description": "Pagan Viking Sea Kings spend the 10th and 11th centuries morphing into Christian monarchs. But with rulers like Harald Bluetooth and Svein Forkbeard it's debatable whether things will be any less horrific for Scandinavia's neighbors",
    "author": "",
    "published": "Sun, 19 Nov 2023 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha70_Twilight_of_the_Aesir_II.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Vikings",
      " Scandinavia",
      " Anglo-Saxon",
      " Franks",
      " Irish",
      " Danes",
      " Norway",
      " Sweden",
      " Rus",
      " Russia",
      " Byzantium",
      " Constantinople",
      " raiding",
      " pirates",
      " history",
      " Forkbeard",
      " Bluetooth",
      "Hairfair",
      " Tryggvason"
    ]
  },
  {
    "id": "45d3f864-ccad-4aab-8885-a8423542c768",
    "title": "Charles Darwin’s Life: The Well-Known – and the Not So Well-Known",
    "link": "http://www.historyisnowmagazine.com/blog/2024/12/11/charles-darwins-life-the-well-known-and-the-not-so-well-known",
    "description": "Charles Darwin’s contribution to science stands virtually without peer.  He was a colossus in the field of evolutionary biology.  He was also a gentleman, a husband, and an invalid.   Lyn Squire, author of Fatally Inferior (Level Best Books 2024 – Amazon US | Amazon UK), the second book in the Dunston Burnett Trilogy, fills in the gaps. Charles Darwin with his eldest son William Darwin, circa 1842.THE WELL-KNOWNEveryone knows that Charles Darwin’s theory of evolution stands as one of the greatest breakthroughs in the history of scientific inquiry.  Darwin was a prolific writer completing more than a dozen major books in his seventy-three-year lifetime, but none as famous, revolutionary, impactful and enduring as On the Origin of Species published on November 24, 1859.Darwin had long known how breeders improved their stock of race horses by the careful mating of their fastest animals.  This process of human selection could be seen in livestock, birds, fruits, vegetables, all designed to develop the most desired traits in each species.  Darwin wanted to know if Mother Nature had a similar mechanism.  The writings of economist Thomas Malthus provided a clue.  He argued that the innate tendency of humans to breed led to populations expanding beyond their means, necessitating a fight for survival.  Darwin had found the springboard for his monumental intellectual leap to the idea of natural selection.  Survival of the fittest!  One general law governing the evolution of all organic beings – multiply; vary; let the strongest live; let the weakest die.  When it finally appeared in 1859, his theory of evolution was underpinned by a vast array of evidence.  Darwin had spent five years aboard HMS Beagle collecting specimens throughout the Galapagos archipelago, and then another twenty-three years compiling observations from around the world and conducting his own experiments before he felt his life’s work was ready for public scrutiny.   As Darwin said in his autobiography, “science consists in grouping facts so that general laws or conclusions may be drawn from them.” THE NOT SO WELL-KNOWNMany of those aware of Darwin’s contribution to our understanding of evolution may know little else about the man.  Other aspects of his life, however, shed light on his research and are of interest in their own right.  The three selected here are: the unsparing criticism of his writings; his marriage; and his chronic illness.CriticismPublication of On the Origin of Species caused an uproar throughout England.  Battle lines were quickly drawn between the new breed of fact-based researchers who readily embraced Darwin’s ground-breaking thesis, and the old guard of religious traditionalists with their unshakeable belief in the Bible’s account of God’s creation of man.  This was science pitted against religion in a life and death battle for the minds and souls of mankind.  Darwin was bombarded with scathing reviews in academic journals, blistering editorials in the leading newspapers and crude cartoons in the cheaper broadsheets.  The Great Debate held in Oxford barely six months after the book’s appearance, illustrates the ugly nature of the clash between firm-in-their-belief theologians and Darwin’s band of truth-seeking scientists.  Both factions behaved in a most unbecoming manner with tasteless taunts and simian slurs from one side answered by childish name-calling and anti-church abuse from the other.  The city of dreaming spires was rocked to the core, buzzing with increasingly far-fetched accounts of the opening salvos in what, from then on, was all-out war.Darwin, though, was a gentleman and a scholar from his time at Christ’s College, Cambridge to his later years at Down House, his home in Kent, and often chose dignified silence over open warfare in press or person.  In this he was fortunate in having Thomas Huxley, a brash but brilliant comparative anatomist, lead the charge in Darwin’s defense.  Huxley even described himself as Darwin’s “bulldog”.  After an offensive question addressed to him by Bishop Wilberforce at the Oxford debate, he famously replied with words to the effect that he, Huxley, would rather be an ape than a bishop.  Even mild-mannered Darwin sometimes expressed his displeasure and disappointment with his academic antagonists.  St. George Mivart, a young biologist, was one such.  He thoroughly savaged Darwin’s Descent of Man in the prestigious Quarterly Review.  Worse still, he ruthlessly criticised an innocuous article on divorce by Darwin’s son.  Darwin was furious.  As it happened, Mivart was seeking membership of the famous Athenaeum Club and Darwin and his supporters, all prominent members, scuttled his election.  A petty response, it might seem, but this was an attack on his family. MarriageDarwin had a long and happy marriage.  He and his wife, Emma, were, however, first cousins.  They had a common grandfather in the person of Josiah Wedgewood.  In the nineteenth century, the offspring of marriages between such close relatives were thought to suffer loss of vigour and even infertility, their frailties then passed on to future generations, the yet-to-be-born progeny already burdened by their inheritance.  Darwin was aware from correspondence with stock breeders throughout England that continued inbreeding of domesticated animals affected the general health and fertility of subsequent generations.  But did the same law of nature apply to humans as was commonly thought?  That was what Darwin desperately wanted to know.  It is little wonder, then, that Darwin devoted so much time and effort to studying the effects of crossbreeding and inbreeding in plants and animals, and even canvassed, albeit unsuccessfully, for the inclusion in the 1871 population census of a question on the number of children born to parents who were first cousins.  Far from being just an intriguing line of scientific inquiry, this was, for Charles Darwin, something frighteningly personal.Sadly, the Darwins lost three of their children – Mary, Anne and little Charles – in infancy.  Death had indeed been an all-too-frequent visitor to the Darwin household, but this was not uncommon for large families in the nineteenth century, and their remaining seven children reached maturity.  Of those, three had offspring, providing the Darwins with ten grandchildren.  Their fears had proven unfounded. IllnessIn youth, Darwin was a vigorous, healthy man.  For the forty years of his adult existence, however, he suffered from bouts of a never-fully-diagnosed, gastro-intestinal illness.  His “accursed stomach” as he called it, caused retching, flatulence, fatigue and vomiting to the point where he was obliged to keep a commode, hidden behind a partition, in his study.  (The visitor to Down House, only an hour and a half’s journey from Central London, can view the scientist’s carefully restored study, including the partition.)Darwin consulted several different doctors and tried every conceivable treatment, some prescribed by respected professionals, others by practitioners little better than quacks.  He tried the water therapy offered at the Water Cure Establishment at Malvern which involved him being heated by a spirit lamp and then rubbed down with cold wet towels while his feet were immersed in a cold foot bath.  Then he moved on to Dr E.W. Lane’s Moor Park hydropathic establishment which was much closer to Down House.  And after that to the Wells House hydropathic establishment in Ilkley, West Yorkshire.  At best, these treatments provided temporary relief, but whether that was a direct result of the therapies or simply the passage of time and natural recuperation is difficult to say.  Either way, his suffering continued.His chronic illness weighed on Darwin, as attested by its frequent mention in his autobiography.  It is a measure of the man, however, that towards the end of his personal account of his life, he was able to remark, perhaps wryly, that: “Even ill-health, though it has annihilated several years of my life, has saved me from the distractions of society and amusement.” Other readingThe above not-so-well-known selections barely skim the surface.  If you wish to learn more about Darwin, an excellent source is the two-volume biography by Janet Browne, Voyaging and The Power of Place, published by Princeton University Press in 1995 and 2002 respectively.  You will find a more personal, fascinating and shorter account of his life in The Autobiography of Charles Darwin, first published by Collins (London) in 1958.    Lyn Squire is the author of Fatally Inferior (Level Best Books, December 2024 - Amazon US | Amazon UK), a story of revenge set against the uproar that greeted publication of On the Origin of Species. Mr. Squire’s first novel in the Dunston Burnett Trilogy, Immortalised to Death (2023), was a First Place Category Winner in the 2023 Chanticleer International Book Awards.  His next book, The Séance of Murder, scheduled for publication in 2025 will complete the trilogy.",
    "author": "George Levrier-Jones",
    "published": "Wed, 11 Dec 2024 14:35:00 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/3a1794da-c348-4869-b71d-fd6f7c831fa8/20241211+1024px-Charles-Darwin-and-William-Darwin%2C-1842.png?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "19th century",
      "Blog Post"
    ]
  },
  {
    "id": "20aa2af4-b70b-4d59-9cce-f1f8ccd3a20c",
    "title": "The Other Major Battle of 1066 AD in England - The Battle of Stamford Bridge",
    "link": "http://www.historyisnowmagazine.com/blog/2024/12/9/the-other-major-battle-of-1066-ad-in-england-the-battle-of-stamford-bridge",
    "description": "The Medieval period, also known as the Middle Ages, began with the fall of the Western Roman Empire in 476 CE. This marked a significant shift in European history as centralized Roman authority collapsed, leading to a fragmentation of power among various kingdoms and tribes.A number of events would eventually lead from the Medieval period to the Renaissance. Here, Terry Bailey considers one of those major events – the 1066 CE Battle of Stamford Bridge in England. The Battle of Stamford Bridge, an 1870 painting by Peter Nicolai Arbo.The period is generally characterized by feudal systems, the dominance of the Catholic Church, and the gradual development of modern European nations. The term \"medieval\" itself derives from the Latin medium aevum, meaning \"middle age,\" reflecting its position between the classical antiquity of Greece and Rome and the Renaissance.The medieval period is traditionally considered to have ended around 1500 CE, though exact dates vary depending on the region and historical interpretation. Major events contributing to its conclusion include the fall of Constantinople in 1453, the invention of the printing press in the mid-15th century, and the beginning of the Age of Exploration.These milestones heralded the dawn of the Renaissance, a period of renewed interest in classical learning, art, and science that marked the transition to the early modern era. However, the long path of medieval history saw many battles for dominance, one such battle took place at the village of Stamford Bridge, East Riding of Yorkshire, England.The Battle of Stamford Bridge was fought on the 25th of September, 1066 and marked one of the pivotal moments in English history. Taking place in the heart of Yorkshire, the clash saw the forces of King Harold Godwinson confront the invading army of Harald Hardrada, King of Norway, who was supported by Harold's estranged brother, Tostig Godwinson.This fierce and dramatic encounter would bring an end to Hardrada's ambitious bid for the English throne, showcasing Harold Godwinson's strategic prowess and the resilience of his troops. However, the victory came at a significant cost, weakening Harold's army just weeks before another, more fateful confrontation awaited him at Hastings. Stamford Bridge is often regarded as the last stand of the Viking Age, marking the twilight of Norse dominance and the beginning of a transformative chapter in medieval England's history. The lead-up to the clash that altered English historyThe battle was born out of a complex web of succession disputes following the death of Edward the Confessor on the 5th of January, 1066. Edward had left no direct heir, leading to competing claims to the English throne. Harold Godwinson, the powerful Earl of Wessex, was crowned king, but his claim was challenged by two formidable rivals: Harald Hardrada, the King of Norway, and William, Duke of Normandy.Harald Hardrada's claim rested on an agreement between earlier monarchs, while William asserted that Edward had promised him the throne years earlier. These disputes culminated in a multi-front crisis for Harold Godwinson, who had to defend his kingdom against invaders from both the north and the south.In early September, Hardrada allied with Tostig Godwinson, Harold's exiled brother launched an invasion. The Norwegian fleet first sailed into the River Tees, conducted raids along the coast, then sailed up the Humber River and disembarked at Riccall on the 20th of September, 1066. Whence he defeated the northern English forces under the command of the Earls Morcar of Northumbria and Edwin of Mercia at the Battle of Fulford on the 20th of September, 1066. This victory led to the surrender and occupation of York by Hardrada's army on the 24th of September, 1066 consolidating his foothold in northern England. Cultural and political considerationsThe conflict was not merely a dynastic struggle; it reflected broader cultural tensions. The Anglo-Saxon aristocracy faced challenges from both the Scandinavian traditions of the Norse and the emerging feudal system of Normandy. Hardrada's invasion brought the Viking warrior ethos into direct conflict with the more centralized and militarily organized Anglo-Saxon kingdom.Meanwhile, Harold's position was precarious. He needed to demonstrate strength to maintain loyalty among his earls while addressing the immediate Viking threat before turning to face William of Normandy. The urgency of the moment required bold decisions and rapid mobilization. Commanders and strategiesHarold Godwinson:- A seasoned leader with deep ties to the English nobility, Harold understood the need for swift action. He marshalled his forces from southern England, covering nearly 190 miles in just four days—a remarkable logistical feat.Harald Hardrada:- A legendary Norse warrior with years of experience, Hardrada's strategy relied on shock and intimidation. After the Battle of Fulford, he believed the English forces in the north were sufficiently weakened.Tostig Godwinson:- The younger brother of Harold, Tostig sought revenge against his sibling and hoped to reclaim his earldom through an alliance with Hardrada. The unfolding of the battleOn the 25th of September, 1066, Harold's forces arrived unexpectedly at Stamford Bridge, catching Hardrada and his men off guard. The Vikings, who were not in full battle readiness were split across both sides of the River Derwent. Harold's surprise attack capitalized on their disorganization.The initial phase saw the English attacking the smaller Viking contingent on the western side of the river. According to legend, a lone Norse axeman held the bridge against Harold's forces for hours, allowing Hardrada to regroup.Eventually, the English killed the axeman and crossed the river, by driving a spear upwards through the wooden bridge from an Anglo-Saxon warrior wading the river.On the eastern side, Hardrada formed his warriors into a shield wall, a traditional Norse tactic designed to withstand heavy infantry attacks. Harold responded with disciplined archery and infantry maneuvers, creating gaps in the Viking line. The battle devolved into brutal hand-to-hand combat, with both sides suffering heavy losses. Tactics of the opposing forceNorwegian Tactics:- Hardrada's reliance on the shield wall was a reflection of Viking battlefield doctrine, emphasizing defense and counter-attacks. However, the lack of preparation and heavy armor, due to the warm weather, weakened his forces.English Tactics:- Harold's strategy was rooted in speed and surprise. His disciplined housecarls (professional soldiers) combined with local fyrd (militia) overwhelmed the Vikings through sustained pressure and adaptability. The outcome and aftermathThe battle ended with a decisive English victory. Both Harald Hardrada and Tostig Godwinson were killed, and the Norwegian army was annihilated. Of the initial invasion force of around 10,000 men, only 24 ships were needed to carry the survivors back to Norway.Despite his triumph, Harold's forces were severely weakened. Just days later, he received news that William of Normandy had landed on the south coast. Harold's march to Stamford Bridge and back to face William at the Battle of Hastings, (portrayed in the Bayeux Tapestry), would prove too taxing for his army, leading to his ultimate defeat on the 14th of October, 1066.In conclusion, the Battle of Stamford Bridge stands as a defining moment in English history, marking the end of Viking dominance and showcasing the resilience and tactical brilliance of Harold Godwinson. Despite his victory, the cost was immense—an exhausted army and a kingdom left vulnerable to the Norman invasion just weeks later.This pivotal clash not only symbolizes the end of one era but also the beginning of another, as the Norman Conquest reshaped the political, cultural, and social landscape of England. Stamford Bridge remains a testament to the shifting tides of history, where triumph and tragedy are inextricably intertwined. The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.  Notes The Bayeux TapestryThe tapestry portrays the Battle of Hastings after the Battle of Stamford Bridge and is an extraordinary piece of medieval craftsmanship that vividly depicts the events leading up to and including the Norman Conquest of England in 1066. Measuring nearly 70 meters in length, this embroidered cloth is believed to have been commissioned by Bishop Odo of Bayeux, the half-brother of William the Conqueror.It is widely regarded as a crucial visual source for understanding the conquest, illustrating key moments such as Harold Godwinson's oath to support William, the Battle of Hastings, and Harold's death, famously portrayed as being struck in the eye with an arrow.The tapestry's importance lies in its role as both an artwork and a historical narrative. As a near-contemporary source, it provides a detailed account of the Norman perspective, shedding light on the military strategies, naval preparations, and feudal relationships of the time. Its scenes offer rare visual insights into 11th-century armor, weaponry, ships, and daily life. Beyond its historical value, the tapestry is a masterpiece of Romanesque art, admired for its dynamic storytelling and vivid imagery.However, caution is warranted when interpreting the Bayeux Tapestry, as it was created by or for the Norman victors. Its narrative aligns with William's claim to the English throne and portrays Harold as an oath-breaker who usurped power. This perspective naturally reflects the biases of the conquerors, potentially downplaying or misrepresenting the Anglo-Saxon viewpoint. For instance, Harold's oath to William—central to Norman propaganda—may have been coerced or misinterpreted. Moreover, the tapestry omits other events, such as the resistance of northern England to Norman rule, which complicate the story of the conquest.In essence, while the Bayeux Tapestry is an invaluable artefact and narrative tool, its portrayal must be critically assessed. It remains a triumph of medieval storytelling, but its role as a tool of Norman legitimacy reminds us to scrutinize historical sources for the biases associated with the producer of the source.The Bayeux Tapestry is housed in the Musée de la Tapisserie de Bayeux (Bayeux Tapestry Museum) in the town of Bayeux, located in the Normandy region of France. The tapestry has been displayed there since the 19th century, although it has been relocated temporarily at times for preservation or exhibitions.The museum is specially designed to preserve the nearly 70-metre-long tapestry, which is displayed in a climate-controlled setting to prevent deterioration and is one of the most visited attractions in Normandy.",
    "author": "George Levrier-Jones",
    "published": "Mon, 09 Dec 2024 22:13:57 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/ca776c66-b217-47d0-aa4a-15f541969919/20241209+1024px-Arbo_-_Battle_of_Stamford_Bridge_%281870%29.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "Blog Post"
    ]
  },
  {
    "id": "2b8fe574-0838-4b0c-92a7-014208b5b270",
    "title": "Introduction to Eliot Stein’s Custodians of Wonder",
    "link": "https://www.thehistoryreader.com/cultural-history/introduction-to-eliot-steins-custodians-of-wonder/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=introduction-to-eliot-steins-custodians-of-wonder",
    "description": "In Custodians of Wonder, Eliot Stein takes a vivid look at 10 astonishing people who are maintaining some of the world’s oldest and rarest cultural traditions. Read on for an introductory excerpt from the book. Minutes after I met Anna, she was gripping my wrist with one hand and patting my cheek with the other. I was 22 […] The post Introduction to Eliot Stein’s Custodians of Wonder appeared first on The History Reader.",
    "author": "Sara Beth Haring",
    "published": "Thu, 12 Dec 2024 21:04:08 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/12/Burano-Lace-19th-century-169x300.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Cultural History",
      "World History",
      "burano lace",
      "Custodians of Wonder",
      "Eliot Stein",
      "Fashion",
      "traditions",
      "venetian lace"
    ]
  },
  {
    "id": "068a2a06-879c-48d8-b209-34661efe7dad",
    "title": "The Island Behind the Island: Real Life Inspiration for Trouble Island",
    "link": "https://www.thehistoryreader.com/us-history/the-island-behind-the-island-real-life-inspiration-for-trouble-island/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-island-behind-the-island-real-life-inspiration-for-trouble-island",
    "description": "Suspense author Sharon Short shares the rich history behind Middle Island, the real-life location that inspired her new novel, Trouble Island. Years ago, I accompanied one of my daughters on her fifth-grade trip to Middle Bass Island, just off the shore of Ohio in Lake Erie. The class was visiting The Ohio State University’s Stone […] The post The Island Behind the Island: Real Life Inspiration for Trouble Island appeared first on The History Reader.",
    "author": "Sara Beth Haring",
    "published": "Wed, 04 Dec 2024 17:44:12 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/12/Middle_Island_ONT_CA_2006-300x232.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Historical Fiction",
      "U. S. History",
      "gangsters",
      "Joe Ruscoe",
      "Lake Eerie",
      "Middle Island",
      "Prohibition",
      "suspense"
    ]
  },
  {
    "id": "cda92494-58eb-4ad2-a8d4-4dd2ea93db6a",
    "title": "When Christmas Went Viral",
    "link": "https://www.npr.org/2024/12/12/1218737986/when-christmas-went-viral",
    "description": "Christmas wasn't always a national shopping spree — or even a day off work. But in 19th-century London, it went viral. When Charles Dickens published A Christmas Carol, the book's tale of miserly Scrooge and the ghosts that transformed him transformed the holiday too, especially in the U.S.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 12 Dec 2024 08:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR2770863525.mp3?d=2995\u0026size=47932901\u0026e=1218737986\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "9603186f-79f2-4a7c-8324-cda850c81358",
    "title": "Seeking Asylum in the U.S.",
    "link": "https://www.npr.org/2024/12/05/1217308651/throughline-seeking-asylum-in-the-us",
    "description": "The U.S. has long professed to be a country where people can seek refuge. That's the promise etched into the base of the Statue of Liberty. But it's never been that clear-cut.Today on the show, the story of how the U.S. asylum system was forged in response to moments of crisis, and where it left gaps: from Jewish refugees fleeing the Holocaust, to Cuban and Haitian asylum seekers during the Cold War, to the precarious system of today.To access bonus episodes and listen to Throughline sponsor-free, subscribe to Throughline+ via Apple Podcasts or at plus.npr.org/throughline.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 05 Dec 2024 08:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR3122173928.mp3?d=3160\u0026size=50561028\u0026e=1217308651\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "c67c3f24-53a0-4fe1-8ab4-b931496ef132",
    "title": "Celebrating the Legacy of the Office of Strategic Services 82 Years On",
    "link": "https://www.historynet.com/celebrating-the-legacy-of-the-office-of-strategic-services-82-years-on/",
    "description": "From the OSS to the CIA, how Wild Bill Donovan shaped the American intelligence community.",
    "author": "Major Nicholas Dockery",
    "published": "Fri, 21 Jun 2024 13:17:24 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/06/The-OSS.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Stories",
      "CIA",
      "OSS"
    ]
  },
  {
    "id": "12067bff-20c8-4be4-a71e-e1950b65df18",
    "title": "Seminoles Taught American Soldiers a Thing or Two About Guerrilla Warfare",
    "link": "https://www.historynet.com/seminole-warrior-vs-us-soldier-book-review-2/",
    "description": "During the 1835–42 Second Seminole War and as Army scouts out West, these warriors from the South proved formidable.",
    "author": "Jon Guttman",
    "published": "Fri, 12 Apr 2024 12:24:00 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/02/book-review-seminole-warrior-ww.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Review",
      "Book Review",
      "Florida",
      "military history",
      "Native Americans",
      "Tactics"
    ]
  }
]
