{
  "id": "0510ca47-d3a1-48f1-9a29-4c63a846fd73",
  "title": "BMW iX facelift brings 426 miles of range for £92k",
  "link": "https://www.autocar.co.uk/car-news/new-cars/bmw-ix-facelift-brings-426-miles-range-92k",
  "description": "New line-up comprises 402bhp 45, 536bhp 60 and 659bhp M70 models Extensive revisions give flagship EV up to 659bhp and a big range boost The BMW iX, the Munich firm’s tech-laden electric flagship, has received a major update with substantial power upgrades and an increase in efficiency that boosts its range to 426 miles. Due to reach the UK in May, with pricing starting from £74,400, the new version of the Audi Q8 E-tron and Volvo EX90 rival has received only a minor styling makeover, but the changes under the skin are more significant. Product manager Marisa Hammersen said BMW has “worked hard to really optimise the efficiency in every area we could”. As an example of that, she cited the use of new headlights that require less energy when illuminated. The German marque has revamped the electric motors with an improved silicon-carbide inverter to reduce power losses, while retuning the drive system and working on the electronics to boost efficiency. There are also new drive modes, including settings that offer extra performance and help to maximise efficiency. As before, the iX will be offered in three variants, each with a dual-motor all-wheel-drive powertrain. To highlight the promised performance improvements, the iX 40 and iX 50 have been succeeded by the 45 and 60, while the hot M60 has spawned an even more potent M70. Those new designations bring the iX in line with the i5 electric saloon. The entry-level iX 45 produces 402bhp – an increase of 80bhp – and 516lb ft of torque. Using a new 94.8kWh battery, it offers a range of up to 374 miles with an official efficiency of 2.97mpkWh. Offered in Sport and M Sport trim, the iX 45's £74,400 price marks a small increase from its predecessor. The iX 60 is offered only in M Sport trim, priced from £92,200, and produces 536bhp and 564lb ft. It features a new 109.1kWh battery that boosts its range in UK trim to that 426-mile headline figure – a chunky increase of up to 34 miles on its predecessor, depending on specification. Both the 45 and 60 have a limited top speed of 124mph. The M70 offers 659bhp and up to 811lb ft when launch control mode is deployed. It is powered by a bespoke performance-honed 108.9kWh battery featuring different cells and chemistry, giving it a range of 366 miles. With a top speed of 155mph, it is priced at £113,300 – a significant reduction from the £124,605 price of the outgoing iX M60. While the iX 45 can charge at speeds of 175kW, both higher-spec models can achieve 195kW. The batteries on all three variants feature a new cell technology that, claims BMW, offers around 30% more usable energy content. The firm has worked to optimise the battery pre-conditioning to enable it to reach peak charging speeds faster. The iX can also be charged at 22kW on an AC connection and it has a new heat pump as part of its efficiency push. There are new drive moves, too, including a max range function that optimises the vehicle's settings for efficiency and can boost range by a claimed 25%. Hammersen said “we put a major focus on the driving dynamics” and the chassis and suspension have been tuned for each model to better match their respective power outputs. The iX continues to sit on steel rather than air suspension, with work done on the dampers to make the vehicle more stable during cornering. Buyers will have a choice of 21in and 23in wheels. The flagship M70 also features active rear steering, improved ride control and M Sport brakes as standard. Across the range, the key exterior change is a revamped version of the large kidney grille, in this case a panel that houses many of the sensors for the car’s advanced driver assistance systems. The new design features vertical line elements that run through both the kidney grille and the LED headlights and that, said Hammersen, are intended to “reduce the dominance of the kidney”. Inside, cars fitted with the M Sport package gain new multifunction seats and an M steering wheel, among other styling elements. The revamped iX will continue to be produced at the firm’s Dingolfing plant in Germany and deliveries are due to begin in the first half of this year.",
  "author": "",
  "published": "Tue, 28 Jan 2025 23:01:29 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "James Attwood",
  "length": 1736,
  "excerpt": "Extensive revisions give flagship EV up to 659bhp and 435 miles of range",
  "siteName": "Autocar",
  "favicon": "",
  "text": "While the iX 45 can charge at speeds of 175kW, both higher-spec models can achieve 195kW. The batteries on all three variants feature a new cell technology that, claims BMW, offers around 30% more usable energy content. The firm has worked to optimise the battery pre-conditioning to enable it to reach peak charging speeds faster. The iX can also be charged at 22kW on an AC connection and it has a new heat pump as part of its efficiency push. There are new drive moves, too, including a max range function that optimises the vehicle's settings for efficiency and can boost range by a claimed 25%. Hammersen said “we put a major focus on the driving dynamics” and the chassis and suspension have been tuned for each model to better match their respective power outputs. The iX continues to sit on steel rather than air suspension, with work done on the dampers to make the vehicle more stable during cornering. Buyers will have a choice of 21in and 23in wheels. The flagship M70 also features active rear steering, improved ride control and M Sport brakes as standard. Across the range, the key exterior change is a revamped version of the large kidney grille, in this case a panel that houses many of the sensors for the car’s advanced driver assistance systems. The new design features vertical line elements that run through both the kidney grille and the LED headlights and that, said Hammersen, are intended to “reduce the dominance of the kidney”. Inside, cars fitted with the M Sport package gain new multifunction seats and an M steering wheel, among other styling elements. The revamped iX will continue to be produced at the firm’s Dingolfing plant in Germany and deliveries are due to begin in the first half of this year.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/bmw-ix-2025-xdrive-60-m-sport-front-qtr-tracking.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eWhile the iX 45 can charge at speeds of 175kW, both higher-spec models can achieve 195kW.\u003c/p\u003e\n\u003cp\u003eThe batteries on all three variants feature a new cell technology that, claims BMW, offers around 30% more usable energy content. The firm has worked to optimise the battery pre-conditioning to enable it to reach peak charging speeds faster. The iX can also be charged at 22kW on an AC connection and it has a new heat pump as part of its efficiency push. There are new drive moves, too, including a max range function that optimises the vehicle\u0026#39;s settings for efficiency and can boost range by a claimed 25%.\u003c/p\u003e\n\u003cp\u003eHammersen said “we put a major focus on the driving dynamics” and the chassis and suspension have been tuned for each model to better match their respective power outputs. The iX continues to sit on steel rather than air suspension, with work done on the dampers to make the vehicle more stable during cornering. Buyers will have a choice of 21in and 23in wheels.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"BMW iX 2025 update – front\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/bmw-ix-2025-xdrive-60-m-sport-front-static.jpg?itok=FH272B64\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/bmw-ix-2025-xdrive-60-m-sport-front-static.jpg?itok=FH272B64\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe flagship M70 also features active rear steering, improved ride control and M Sport brakes as standard.\u003c/p\u003e\n\u003cp\u003eAcross the range, the key exterior change is a revamped version of the large kidney grille, in this case a panel that houses many of the sensors for the car’s advanced driver assistance systems. The new design features vertical line elements that run through both the kidney grille and the LED headlights and that, said Hammersen, are intended to “reduce the dominance of the kidney”.\u003c/p\u003e\u003cdiv\u003e\n\u003cp\u003eInside, cars fitted with the M Sport package gain new multifunction seats and an M steering wheel, among other styling elements.\u003c/p\u003e\n\u003cp\u003eThe revamped iX will continue to be produced at the firm’s Dingolfing plant in Germany and deliveries are due to begin in the first half of this year.\u003c/p\u003e\n\u003c/div\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "1970-01-01T01:00:00Z",
  "modifiedTime": null
}
