{
  "id": "16dfcfce-bdd6-4ca4-8186-91fc6907e42e",
  "title": "Ford Puma Gen-E",
  "link": "https://www.autocar.co.uk/car-review/ford/puma-gen-e",
  "description": "Ford's best-seller finally gets an all-electric powertrain It feels like the Ford Puma Gen-E was needed a couple of years ago, really.With the likes of the Renault 5 now hitting showrooms, plus the (recently price-cut) Jeep Avenger and VW ID.3, the Skoda Elroq, MG S5, Volvo EX30, Smart #1 and all of Stellantis’ other forthcoming sub-£30k electric cars shouldering in, never mind the ever-pressing ZEV mandate regulations, Ford desperately needs an affordable electric car.The good news is that the Ford Puma Gen-E is precisely the sort of lower-cost proposition that should get customers through the doors. Starting from under £30,000, it gets a 43kWh lithium-ion NMC battery (53kWh total capacity) that powers the front-wheel drive, all-electric Puma Gen-E to a WLTP range of up to 233 miles. That makes it one of the most efficient electric cars in the class, which is especially great news for a car that also manages a healthy 8.0 seconds to 62mph.Is it remotely that efficient in the real world? We’ll get to that a bit further down…",
  "author": "",
  "published": "Fri, 11 Apr 2025 23:00:00 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Vicky Parrott",
  "length": 15741,
  "excerpt": "Ford's best-seller finally gets an all-electric powertrain",
  "siteName": "Autocar",
  "favicon": "",
  "text": "It feels like the Ford Puma Gen-E was needed a couple of years ago, really.With the likes of the Renault 5 now hitting showrooms, plus the (recently price-cut) Jeep Avenger and VW ID.3, the Skoda Elroq, MG S5, Volvo EX30, Smart #1 and all of Stellantis’ other forthcoming sub-£30k electric cars shouldering in, never mind the ever-pressing ZEV mandate regulations, Ford desperately needs an affordable electric car.The good news is that the Ford Puma Gen-E is precisely the sort of lower-cost proposition that should get customers through the doors. Starting from under £30,000, it gets a 43kWh lithium-ion NMC battery (53kWh total capacity) that powers the front-wheel drive, all-electric Puma Gen-E to a WLTP range of up to 233 miles. That makes it one of the most efficient electric cars in the class, which is especially great news for a car that also manages a healthy 8.0 seconds to 62mph.Is it remotely that efficient in the real world? We’ll get to that a bit further down… Verdict Huge boot, compact dimensions, brilliant real-world efficiency and fun dynamics make the Puma a great choice, though others offer longer range at a similar price GoodFun to driveReal-world efficiencyHuge boot in a compact bodyBadOthers have longer rangeSome cheap interior finishesOne-pedal mode is grabby DESIGN \u0026 STYLING Pros Familiar looks Compact sizeBright colours to choose from Cons Familiar looksWhite badging looks a bit tacky You’ll have noticed that the electric Puma Gen-E looks much the same as the petrol Puma that’ll continue to be sold alongside it, that shares its platform with the Gen-E and was also the best selling car in the UK in 2023 and 2024. It's pretty easy to tell the difference, though, thanks to the blanked-off fascia that hints at the Mustang Mach-E and Capri for a touch of styling consistency among the brand’s electric cars. The white font on the boot is also a telltale sign that this is the electric one.But, of course, we’re still dealing with a 4.2-metre long compact SUV that's usefully shorter than the VW ID.3, MG 4 and co, or spot-on in size for the Jeep Avenger. INTERIOR Pros Huge boot spaceAll the media stuff you want is includedEasy control of the ADAS systems Cons Other touchscreens are more intuitive Some cheap-feeling materialsAir-con controls are in the screen That compact body makes it even more impressive that Ford has squeezed a vast 523-litres of luggage space – 145-litres of which is in the waterproof ‘Gigabox’ beneath the boot floor, complete with a plug, just in case you need to use it as an ice bath for your beers, or hose out the mud that’s gathered from mucky welly storage. It really is a serious selling point to have this much space in such a compact car; easy to park and easy to get a chunky buggy in the boot? Family motorists rejoice. There’s plenty of space in the rear seats, too. You will find a bit more rear head- and legroom in the MG S5, VW ID.3 and Kia EV3, but a couple of kids or lanky teens will be just fine in the back of the Puma.Things have changed up front, too, with plusher materials, a raised centre console with double-decker storage, and a new SYNC 4 infotainment touchscreen complete with wireless Apple CarPlay and Android Auto. It’s a big improvement on Ford infotainment systems of old, and the chief functions – nav, air-con and the like – are all easy enough to access and control, if a little fiddly when you're on the move. There’s also a physical shortcut button to bring up the drive modes (as well as the one-pedal mode and drive noise activation) on the screen, but you can’t actually switch modes simply by pressing the button again; you have to prod the infotainment system. Which is irritating.More importantly, the speed limit warning and lane-keep assist can each be switched on- and off by holding down a button on the steering wheel, for blissfully beep-free progress. ENGINES \u0026 PERFORMANCE Pros Good performance for UK roadsNice accelerator responseEngine ‘noise’ isn’t switchable, and not intrusive Cons One-pedal mode is grabbyThere are faster alternativesDrive modes have to be selected on the screen As for how it goes down the road, the Gen-E isn’t going to light up the forums with talk of its sheer pace. But the 165bhp, 214lb ft electric motor (a modified version of that fitted to the Mach-E) gives heart response even from higher speeds, and you’ll even get a bit of torquesteer squirming its way through the peculiarly huge steering wheel when you accelerate hard out of a corner.We don’t mind that; there’s something quite engaging about the gentle scrappiness of a bit of torquesteer, and it makes the Puma feel more engaging than the generally rather poker-faced ranks of electric crossovers. Plus, because it’s not got face-distorting accelerative potential, you can use all of the Puma’s potential on a good road without fearing for your life or your licence. And we all know that this is a good thing for anyone who really enjoys an unintimidating romp down a fine country road, even when it’s in something as unassuming as an electric Puma.Brake regen is mild as standard, or you can up it by hitting the ‘L’ button on the gear stalk, or by activating the one-pedal mode on the touchscreen. That’s okay, but it’s not an adaptive setup and others – particularly Kia and Hyundai – have far more variable barke regen’. The one-pedal mode in the Puma is also tricky, as it’s too grabby and reactive over a very short pedal travel for easy modulation around town. RIDE \u0026 HANDLING Pros Taut but well-judged damping Fun by class standards Cons Steering could have more feedback It's worth taking the longer route home in the Puma Gen-E, as it's got a rather impressive balance of taut- yet well-damped confidence.Yes, there’s a fair bit of weight to be managed here (although the 1563kg kerbweight isn’t at all bad by the standards of this class). But Ford’s still a little bit magic when it comes to making everyday cars that are fizzy yet friendly, and the electric Puma lives up to that.The wheel-at-each corner stance helps it to swivel gamely into corners, and the fairly tight body control keeps it from getting ungainly. Yet, it’s also damped well enough to take the sting out of sharp-edged speed bumps, recessed manhole covers and the usual surface detritus that makes up town roads. Sure, a Kia EV3 or Jeep Avenger are a bit cushier, but the Ford is never jarring, and so the firmish ride comfort isn’t actually a bother. In fact, the well-tied-down body control and shorter spring travel in the Puma arguably makes this a more comfortable option than the spongier-feeling family EVs on offer.Would we like a bit more steering feedback? Yes - but in the scheme of electric family cars the Ford’s steering has a nice bite to it, even if it is a bit anodyne no matter which drive mode you’ve selected. MPG \u0026 RUNNING COSTS Pros Great real-world efficiencyFive years free servicingDecent pricing Cons PCP costs could be lowerOthers have longer vehicle warrantiesOthers have longer WLTP range Of course, we can wax lyrical about Ford being a dab hand with damper rates, but the Puma Gen-E will live or die by its purchase costs – especially its monthly PCP and lease rates.List prices starting from under £30,000 for the Puma Gen-E Select are a strong start of it; although the keyless entry, Matrix LED lights and B\u0026O sound system will no doubt swing the decision in favour of the Premium trim for a lot of buyers. You’ll be wanting to add the £350 pack to get heated seats regardless of which trim you fancy, though; a weird omission from standard kit for what’s otherwise a very generously equipped car.What’s a bit more underwhelming is that the Gen-E currently starts from around £350 per month with a £5,000 deposit, over a 48 month contract. That’s competitive, but it’s far from the best in the class, so it’s good that Ford’s just introduced its ‘Power Promise’ that throws in a free home charger, 10,000 miles of free charging, and five years of free servicing. Sure, you’ll get a longer warranty with Kia, Hyundai or MG, but that’s still a persuasive package from Ford.Especially as that efficiency does seem to play out in the real world. Even on fast, hard-driven mountain roads above Barcelona, and with a fair stretch of motorway speeds included, we saw 4.4mpkWh, for a real-world range of 190 miles. Not bad at all for such a modest usable battery capacity – and obviously that means you’ll save money on electricity to keep the battery fed. It also means less time at the charger when you want a useful top-up on the go; the 100kW rapid charging is on a par with much of the Gen-E’s competition, but interesting the NMC battery has a sizeable 10kWh dormant buffer, largely to enable a flatter, faster charging curve. Ford’s boffins tell us that it’ll still be charging at well over 80kW well past the 80% mark, for a 10-80% charge in around 23 minutes. You’ll have to pre-heat the battery to get that, though, which you have to do by putting your planned charging stop into the car's nav system at least 30- to 45 minutes ahead of charging. VERDICT Verdict Huge boot, compact dimensions, brilliant real-world efficiency and fun dynamics make the Puma a great choice, though others offer longer range at a similar price GoodFun to driveReal-world efficiencyHuge boot in a compact bodyBadOthers have longer rangeSome cheap interior finishesOne-pedal mode is grabby The Ford Puma Gen-E offers a better balance of fun and comfort than most compact EVs of its kind, is one of the most spacious offerings in the class – especially when it comes to boot space – and has the efficiency, costs and ownership perks to make it a properly compelling overall package. Those monthly finance deals will probably need to improve if the electric Puma's to gather the kind of sales that its petrol equivalent has enjoyed. And some buyers may take convincing regards the Gen-E's modest battery capacity and range. Even so, on this evidence, Ford may well be onto a winner with its new junior EV. TECHNICAL SPECS Model tested: Ford Puma Gen-E Price as tested: unspecified Electric motor/s: 1 x AC synchronous, permanent magnet: front-transverse mounted Drive battery: Nickel-manganese-cobalt, 43/53kWh (usable/total capacity) Driveline layout: Front-transverse, FWD Model tested Ford Puma Gen-E Price as tested unspecified View all specs and rivals Electric motor/s 1 x AC synchronous, permanent magnet: front-transverse mounted Drive battery Nickel-manganese-cobalt, 43/53kWh (usable/total capacity) Driveline layout Front-transverse, FWD Battery size 43/53kWh (usable/total capacity) Energy efficiency 4.7mpkWh Max. charge rate 100kW DC Battery size 43/53kWh (usable/total capacity) Energy efficiency 4.7mpkWh Max. charge rate 100kW DC Vicky Parrott Vicky Parrott has been a motoring journalist since 2006, when she eventually did so much work experience at Autocar that it felt obliged to give her a job. After that, she spent seven years as a features and news writer, video presenter and road tester for Autocar, before becoming deputy road test editor for What Car? in 2013. After five years with What Car?, Vicky spent a couple of years as associate editor of DrivingElectric and then embarked on a freelance career that has seen her return to writing for Autocar and What Car? as well as for The Daily Telegraph and many others. Vicky has been a Car of the Year juror since 2020, and the proud owner of a 1992 Mercedes-Benz 300-SL 24V since 2017. She aspires to own an Alpine A110 and a Porsche Taycan Cross Turismo. NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/ford-puma_gen-e_2025-review-front-corner-028.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \n    \u003cdiv\u003e\n                                \u003cdiv\u003e\u003cp\u003eIt feels like the \u003cstrong\u003eFord Puma Gen-E\u003c/strong\u003e was needed a couple of years ago, really.\u003c/p\u003e\u003cp\u003eWith the likes of the \u003ca href=\"https://www.autocar.co.uk/car-review/renault/5\"\u003eRenault 5\u003c/a\u003e now hitting showrooms, plus the (recently price-cut) \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/avenger\"\u003eJeep Avenger\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/volkswagen/id-3\"\u003eVW ID.3\u003c/a\u003e, the \u003ca href=\"https://www.autocar.co.uk/car-review/skoda/elroq\"\u003eSkoda Elroq\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/mg-motor/s5-ev\"\u003eMG S5\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/volvo/ex30\"\u003eVolvo EX30\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/smart/1\"\u003eSmart #1 \u003c/a\u003eand all of Stellantis’ other forthcoming sub-£30k electric cars shouldering in, never mind the ever-pressing ZEV mandate regulations, Ford desperately needs an affordable electric car.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThe good news is that the Ford Puma Gen-E is precisely the sort of lower-cost proposition that should get customers through the doors. Starting from under £30,000, it gets a 43kWh lithium-ion NMC battery (53kWh total capacity) that powers the front-wheel drive, all-electric Puma Gen-E to a WLTP range of up to 233 miles. That makes it one of the most efficient electric cars in the class, which is especially great news for a car that also manages a healthy 8.0 seconds to 62mph.\u003c/p\u003e\u003cp\u003eIs it remotely that efficient in the real world? We’ll get to that a bit further down…\u003c/p\u003e\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eHuge boot, compact dimensions, brilliant real-world efficiency and fun dynamics make the Puma a great choice, though others offer longer range at a similar price \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eFun to drive\u003c/p\u003e\u003cp\u003eReal-world efficiency\u003c/p\u003e\u003cp\u003eHuge boot in a compact body\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOthers have longer range\u003c/p\u003e\u003cp\u003eSome cheap interior finishes\u003c/p\u003e\u003cp\u003eOne-pedal mode is grabby\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n                              \u003c/div\u003e\n\n        \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n                                            \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eFamiliar looks \u003c/p\u003e\u003cp\u003eCompact size\u003c/p\u003e\u003cp\u003eBright colours to choose from\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eFamiliar looks\u003c/p\u003e\u003cp\u003eWhite badging looks a bit tacky\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eYou’ll have noticed that the electric Puma Gen-E looks much the same as the petrol Puma that’ll continue to be sold alongside it, that shares its platform with the Gen-E and was also the best selling car in the UK in 2023 and 2024. It\u0026#39;s pretty easy to tell the difference, though, thanks to the blanked-off fascia that hints at the \u003ca href=\"https://www.autocar.co.uk/car-review/ford/mustang-mach-e\"\u003eMustang Mach-E\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/ford/capri\"\u003eCapri\u003c/a\u003e for a touch of styling consistency among the brand’s electric cars. The white font on the boot is also a telltale sign that this is the electric one.\u003c/p\u003e\u003cp\u003eBut, of course, we’re still dealing with a 4.2-metre long compact SUV that\u0026#39;s usefully shorter than the VW ID.3, MG 4 and co, or spot-on in size for the Jeep Avenger.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003c/div\u003e\n                                          \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eINTERIOR\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eHuge boot space\u003c/p\u003e\u003cp\u003eAll the media stuff you want is included\u003c/p\u003e\u003cp\u003eEasy control of the ADAS systems\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eOther touchscreens are more intuitive \u003c/p\u003e\u003cp\u003eSome cheap-feeling materials\u003c/p\u003e\u003cp\u003eAir-con controls are in the screen\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eThat compact body makes it even more impressive that Ford has squeezed a vast 523-litres of luggage space – 145-litres of which is in the waterproof ‘Gigabox’ beneath the boot floor, complete with a plug, just in case you need to use it as an ice bath for your beers, or hose out the mud that’s gathered from mucky welly storage. It really is a serious selling point to have this much space in such a compact car; easy to park and easy to get a chunky buggy in the boot? Family motorists rejoice. \u003c/p\u003e\u003cp\u003eThere’s plenty of space in the rear seats, too. You will find a bit more rear head- and legroom in the MG S5, VW ID.3 and \u003ca href=\"https://www.autocar.co.uk/car-review/kia/ev3\"\u003eKia EV3\u003c/a\u003e, but a couple of kids or lanky teens will be just fine in the back of the Puma.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThings have changed up front, too, with plusher materials, a raised centre console with double-decker storage, and a new SYNC 4 infotainment touchscreen complete with wireless Apple CarPlay and Android Auto. It’s a big improvement on Ford infotainment systems of old, and the chief functions – nav, air-con and the like – are all easy enough to access and control, if a little fiddly when you\u0026#39;re on the move. There’s also a physical shortcut button to bring up the drive modes (as well as the one-pedal mode and drive noise activation) on the screen, but you can’t actually switch modes simply by pressing the button again; you have to prod the infotainment system. Which is irritating.\u003c/p\u003e\u003cp\u003eMore importantly, the speed limit warning and lane-keep assist can each be switched on- and off by holding down a button on the steering wheel, for blissfully beep-free progress.\u003c/p\u003e\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eGood performance for UK roads\u003c/p\u003e\u003cp\u003eNice accelerator response\u003c/p\u003e\u003cp\u003eEngine ‘noise’ isn’t switchable, and not intrusive\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eOne-pedal mode is grabby\u003c/p\u003e\u003cp\u003eThere are faster alternatives\u003c/p\u003e\u003cp\u003eDrive modes have to be selected on the screen\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eAs for how it goes down the road, the Gen-E isn’t going to light up the forums with talk of its sheer pace. But the 165bhp, 214lb ft electric motor (a modified version of that fitted to the Mach-E) gives heart response even from higher speeds, and you’ll even get a bit of torquesteer squirming its way through the peculiarly huge steering wheel when you accelerate hard out of a corner.\u003c/p\u003e\u003cp\u003eWe don’t mind that; there’s something quite engaging about the gentle scrappiness of a bit of torquesteer, and it makes the Puma feel more engaging than the generally rather poker-faced ranks of electric crossovers. Plus, because it’s not got face-distorting accelerative potential, you can use all of the Puma’s potential on a good road without fearing for your life or your licence. And we all know that this is a good thing for anyone who really enjoys an unintimidating romp down a fine country road, even when it’s in something as unassuming as an electric Puma.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eBrake regen is mild as standard, or you can up it by hitting the ‘L’ button on the gear stalk, or by activating the one-pedal mode on the touchscreen. That’s okay, but it’s not an adaptive setup and others – particularly Kia and Hyundai – have far more variable barke regen’. The one-pedal mode in the Puma is also tricky, as it’s too grabby and reactive over a very short pedal travel for easy modulation around town.\u003c/p\u003e\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\u003cdiv data-id=\"ride\" id=\"chapter-ride\"\u003e\n                                      \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eRIDE \u0026amp; HANDLING\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eTaut but well-judged damping \u003c/p\u003e\u003cp\u003eFun by class standards\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eSteering could have more feedback\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eIt\u0026#39;s worth taking the longer route home in the Puma Gen-E, as it\u0026#39;s got a rather impressive balance of taut- yet well-damped confidence.\u003c/p\u003e\u003cp\u003eYes, there’s a fair bit of weight to be managed here (although the 1563kg kerbweight isn’t at all bad by the standards of this class). But Ford’s still a little bit magic when it comes to making everyday cars that are fizzy yet friendly, and the electric Puma lives up to that.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThe wheel-at-each corner stance helps it to swivel gamely into corners, and the fairly tight body control keeps it from getting ungainly. Yet, it’s also damped well enough to take the sting out of sharp-edged speed bumps, recessed manhole covers and the usual surface detritus that makes up town roads. Sure, a Kia EV3 or Jeep Avenger are a bit cushier, but the Ford is never jarring, and so the firmish ride comfort isn’t actually a bother. In fact, the well-tied-down body control and shorter spring travel in the Puma arguably makes this a more comfortable option than the spongier-feeling family EVs on offer.\u003c/p\u003e\u003cp\u003eWould we like a bit more steering feedback? Yes - but in the scheme of electric family cars the Ford’s steering has a nice bite to it, even if it is a bit anodyne no matter which drive mode you’ve selected.\u003c/p\u003e\u003c/div\u003e\n                                                      \u003c/div\u003e\n \n\n \n\u003cdiv data-id=\"mpg\" id=\"chapter-mpg\"\u003e\n      \n  \n    \u003cdiv\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eMPG \u0026amp; RUNNING COSTS\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eGreat real-world efficiency\u003c/p\u003e\u003cp\u003eFive years free servicing\u003c/p\u003e\u003cp\u003eDecent pricing\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003ePCP costs could be lower\u003c/p\u003e\u003cp\u003eOthers have longer vehicle warranties\u003c/p\u003e\u003cp\u003eOthers have longer WLTP range\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eOf course, we can wax lyrical about Ford being a dab hand with damper rates, but the Puma Gen-E will live or die by its purchase costs – especially its monthly PCP and lease rates.\u003c/p\u003e\u003cp\u003eList prices starting from under £30,000 for the Puma Gen-E Select are a strong start of it; although the keyless entry, Matrix LED lights and B\u0026amp;O sound system will no doubt swing the decision in favour of the Premium trim for a lot of buyers. You’ll be wanting to add the £350 pack to get heated seats regardless of which trim you fancy, though; a weird omission from standard kit for what’s otherwise a very generously equipped car.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eWhat’s a bit more underwhelming is that the Gen-E currently starts from around £350 per month with a £5,000 deposit, over a 48 month contract. That’s competitive, but it’s far from the best in the class, so it’s good that Ford’s just introduced its ‘Power Promise’ that throws in a free home charger, 10,000 miles of free charging, and five years of free servicing. Sure, you’ll get a longer warranty with Kia, Hyundai or MG, but that’s still a persuasive package from Ford.\u003c/p\u003e\u003cp\u003eEspecially as that efficiency does seem to play out in the real world. Even on fast, hard-driven mountain roads above Barcelona, and with a fair stretch of motorway speeds included, we saw 4.4mpkWh, for a real-world range of 190 miles. Not bad at all for such a modest usable battery capacity – and obviously that means you’ll save money on electricity to keep the battery fed.\u003c/p\u003e\u003c/div\u003e                                                    \u003c/div\u003e\n  \n                    \n            \u003cdiv\u003e\u003cp\u003eIt also means less time at the charger when you want a useful top-up on the go; the 100kW rapid charging is on a par with much of the Gen-E’s competition, but interesting the NMC battery has a sizeable 10kWh dormant buffer, largely to enable a flatter, faster charging curve. Ford’s boffins tell us that it’ll still be charging at well over 80kW well past the 80% mark, for a 10-80% charge in around 23 minutes. You’ll have to pre-heat the battery to get that, though, which you have to do by putting your planned charging stop into the car\u0026#39;s nav system at least 30- to 45 minutes ahead of charging.\u003c/p\u003e\u003c/div\u003e\n        \u003c/div\u003e\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n         \u003cdiv\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eVERDICT\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eHuge boot, compact dimensions, brilliant real-world efficiency and fun dynamics make the Puma a great choice, though others offer longer range at a similar price \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eFun to drive\u003c/p\u003e\u003cp\u003eReal-world efficiency\u003c/p\u003e\u003cp\u003eHuge boot in a compact body\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOthers have longer range\u003c/p\u003e\u003cp\u003eSome cheap interior finishes\u003c/p\u003e\u003cp\u003eOne-pedal mode is grabby\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eThe Ford Puma Gen-E offers a better balance of fun and comfort than most compact EVs of its kind, is one of the most spacious offerings in the class – especially when it comes to boot space – and has the efficiency, costs and ownership perks to make it a properly compelling overall package.\u003c/p\u003e\n\u003cp\u003eThose monthly finance deals will probably need to improve if the electric Puma\u0026#39;s to gather the kind of sales that its petrol equivalent has enjoyed. And some buyers may take convincing regards the Gen-E\u0026#39;s modest battery capacity and range.\u003c/p\u003e\n\u003cp\u003eEven so, on this evidence, Ford may well be onto a winner with its new junior EV.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n                      \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003e\u003ch2\u003eTECHNICAL SPECS\u003c/h2\u003e\u003c/p\u003e\n    \u003cdiv\u003e\n      \n      \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/thumbnail/public/ford-puma_gen-e_2025-review-front-corner-028.jpg?itok=GFCzrRwP\" alt=\"Ford Puma Gen E 2025 Review front corner 028\"/\u003e\u003c/p\u003e            \u003cdiv\u003e\n              \u003cp\u003eModel tested:\u003c/p\u003e\n              \u003cp\u003eFord Puma Gen-E\u003c/p\u003e\n            \u003c/div\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n              \u003cp\u003ePrice as tested:\u003c/p\u003e\n              \u003cp\u003eunspecified\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eElectric motor/s:\u003c/p\u003e\n              \u003cp\u003e1 x AC synchronous, permanent magnet: front-transverse mounted\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eDrive battery:\u003c/p\u003e\n              \u003cp\u003eNickel-manganese-cobalt, 43/53kWh (usable/total capacity)\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eDriveline layout:\u003c/p\u003e\n              \u003cp\u003eFront-transverse, FWD\u003c/p\u003e\n            \u003c/div\u003e\n                \n                \n\n      \u003c/div\u003e\n      \n      \n      \u003cdiv\u003e\n                          \u003cdiv\u003e\n              \u003cp\u003eModel tested\u003c/p\u003e\n                              \u003cp\u003eFord Puma Gen-E\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003ePrice as tested\u003c/p\u003e\n                              \u003cp\u003eunspecified\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                      \u003cp\u003eView all specs and rivals\u003c/p\u003e\n                                      \u003cdiv\u003e\n              \u003cp\u003eElectric motor/s\u003c/p\u003e\n                              \u003cp\u003e1 x AC synchronous, permanent magnet: front-transverse mounted\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eDrive battery\u003c/p\u003e\n                              \u003cp\u003eNickel-manganese-cobalt, 43/53kWh (usable/total capacity)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eDriveline layout\u003c/p\u003e\n                              \u003cp\u003eFront-transverse, FWD\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eBattery size\u003c/p\u003e\n                              \u003cp\u003e43/53kWh (usable/total capacity)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eEnergy efficiency\u003c/p\u003e\n                              \u003cp\u003e4.7mpkWh\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eMax. charge rate\u003c/p\u003e\n                              \u003cp\u003e100kW DC\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                  \u003c/div\u003e\n              \n          \u003c/div\u003e\n    \n      \u003c/div\u003e\n  \n    \u003cdiv\u003e\n                  \n                  \n                  \n                  \n                  \n                  \u003cdiv\u003e\n            \u003cp\u003eBattery size\u003c/p\u003e\n            \u003cp\u003e43/53kWh (usable/total capacity)\u003c/p\u003e\n          \u003c/div\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003eEnergy efficiency\u003c/p\u003e\n            \u003cp\u003e4.7mpkWh\u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n            \u003cp\u003eMax. charge rate\u003c/p\u003e\n            \u003cp\u003e100kW DC\u003c/p\u003e\n          \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/div\u003e\n\u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/vicky-parrott\"\u003eVicky Parrott\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/vicky-parrott\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/pictures/user-12-profile_photo.jpg\" width=\"200\" height=\"200\" alt=\"Vicky Parrott\" title=\"Vicky Parrott\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eVicky Parrott has been a motoring journalist since 2006, when she eventually did so much work experience at Autocar that it felt obliged to give her a job.\u003c/p\u003e\n\u003cp\u003eAfter that, she spent seven years as a features and news writer, video presenter and road tester for Autocar, before becoming deputy road test editor for What Car? in 2013. After five years with What Car?, Vicky spent a couple of years as associate editor of DrivingElectric and then embarked on a freelance career that has seen her return to writing for Autocar and What Car? as well as for The Daily Telegraph and many others.\u003c/p\u003e\n\u003cp\u003eVicky has been a Car of the Year juror since 2020, and the proud owner of a 1992 Mercedes-Benz 300-SL 24V since 2017. She aspires to own an Alpine A110 and a Porsche Taycan Cross Turismo.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n                            \u003c/div\u003e\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": null,
  "modifiedTime": null
}
