{
  "id": "1dceac6e-6489-49dd-aba3-f329709e52d9",
  "title": "Cars, SUVs can enter Mumbai toll free from today",
  "link": "https://www.autocarindia.com/industry/cars-suvs-can-enter-mumbai-toll-free-from-today-433218#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Maharashtra chief minister Eknath Shinde announced in the latest cabinet meeting that all light motor vehicles entering Mumbai via five entry points will be exempt from paying toll from today. No toll to enter Mumbai from five entry points Rule applicable for light motor vehicles only Mumbai Toll Waiver to be “permanent” According to the latest announcement, motorists entering Mumbai from Dahisar, LBS Road at Mulund (West), Eastern Express Highway Mulund (East), Airoli Creek Bridge and Vashi will not be charged any toll. This decision will not just help consumers save money but will also result in cutting down the massive traffic jams caused by these tolls. Chief minister Shinde said that the \"masterstroke\" move would save time, fuel and reduce pollution. \"It was a long pending demand to waive toll at Mumbai's entry points,\" he said. \"Many activists, including I, had approached the court demanding the same. It is a masterstroke decision.\" Sources tell us that the toll waiver will be “permanent”. Until yesterday, these booths collected either Rs 45 or Rs 75 per vehicles, and as many as 2.8 lakh light motor vehicles cross these tolls every day.",
  "author": "Akbar Merchant",
  "published": "Tue, 15 Oct 2024 01:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Akbar Merchant",
  "length": 1252,
  "excerpt": "Maharashtra chief minister Eknath Shinde made this announcement at the latest cabinet meeting.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Maharashtra chief minister Eknath Shinde made this announcement at the latest cabinet meeting.Maharashtra chief minister Eknath Shinde announced in the latest cabinet meeting that all light motor vehicles entering Mumbai via five entry points will be exempt from paying toll from today.No toll to enter Mumbai from five entry pointsRule applicable for light motor vehicles onlyMumbai Toll Waiver to be “permanent” According to the latest announcement, motorists entering Mumbai from Dahisar, LBS Road at Mulund (West), Eastern Express Highway Mulund (East), Airoli Creek Bridge and Vashi will not be charged any toll. This decision will not just help consumers save money but will also result in cutting down the massive traffic jams caused by these tolls. Chief minister Shinde said that the \"masterstroke\" move would save time, fuel and reduce pollution. \"It was a long pending demand to waive toll at Mumbai's entry points,\" he said. \"Many activists, including I, had approached the court demanding the same. It is a masterstroke decision.\"Sources tell us that the toll waiver will be “permanent”. Until yesterday, these booths collected either Rs 45 or Rs 75 per vehicles, and as many as 2.8 lakh light motor vehicles cross these tolls every day.",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241014080016_Mumbai_toll.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eMaharashtra chief minister Eknath Shinde made this announcement at the latest cabinet meeting.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eMaharashtra chief minister Eknath Shinde announced in the latest cabinet meeting that all light motor vehicles entering Mumbai via five entry points will be exempt from paying toll from today.\u003c/p\u003e\u003cul\u003e\u003cli\u003eNo toll to enter Mumbai from five entry points\u003c/li\u003e\u003cli\u003eRule applicable for light motor vehicles only\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMumbai Toll Waiver to be “permanent”\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e  According to the latest announcement, motorists entering Mumbai from Dahisar, LBS Road at Mulund (West), Eastern Express Highway Mulund (East), Airoli Creek Bridge and Vashi will not be charged any toll. This decision will not just help consumers save money but will also result in cutting down the massive traffic jams caused by these tolls.\u003c/p\u003e\u003cp\u003e  Chief minister Shinde said that the \u0026#34;masterstroke\u0026#34; move would save time, fuel and reduce pollution. \u0026#34;It was a long pending demand to waive toll at Mumbai\u0026#39;s entry points,\u0026#34; he said. \u0026#34;Many activists, including I, had approached the court demanding the same. It is a masterstroke decision.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSources tell us that the toll waiver will be “permanent”. Until yesterday, these booths collected either Rs 45 or Rs 75 per vehicles, and as many as 2.8 lakh light motor vehicles cross these tolls every day.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-15T01:00:00+05:30",
  "modifiedTime": null
}
