{
  "id": "1e78c24f-ea0e-4c53-bcec-35981ffeced8",
  "title": "Cross Car racing the future of Indian motorsport: FMSCI",
  "link": "https://www.autocarindia.com/motor-sports-news/cross-car-racing-the-future-of-indian-motorsport-fmsci-433785#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Newly-elected FMSCI (Federation of Motor Sports Clubs of India) President Arindam Ghosh has revealed plans to bring Cross Car racing to India, calling it “the future of motorsport” not just in the country, but globally. While the project is still in the early stages, Ghosh told Autocar India that “work is already underway, and the demo and test cars will be ready by January [2025]. But it has to be planned properly”. FMSCI sees potential in Cross Car races held in stadiums Small off-road buggies an affordable way to access motorsport What is cross car racing? Globally, Cross Car racing has been the first step in motorsport for several World Rally Championship and Rallycross racers. Essentially, Cross Car is to multi-surface racing what karting is to circuit racing. Usually held on autocross, dirt oval or rallycross tracks, these races feature small off-road buggies powered by motorcycle engines. Crucially, these buggies are easy to maintain and present an affordable way for people to access off-road motorsport. This makes it an ideal format for young racers to develop their skills. But this isn’t just limited to budding racers. Back in 2022, the FIA (the governing body for international motorsport) added Cross Car racing as part of its Motorsport Games roster. Currently there are three categories, headlined by the Senior category for drivers over 16 years of age and featuring 600cc-800cc rear-wheel drive cross cars. Next up is the Junior category for drivers aged 13-15, racing 690cc twin-cylinder two-wheel drive cars. And the latest addition is the Mini category for drivers aged eight to 12, racing identical FIA-supplied non-gearbox two-wheel drive mini cross cars. Focus on stadium sports For Ghosh, what makes Cross Car racing ideal for India is the fact that it can be held in stadiums, much like what we’ve seen recently with the Indian Supercross Racing League. This brings the racing to the people in cities, without all the complexities involved in setting up a circuits. Stadium stands also make it far easier for those in attendance to follow all the action. The FMSCI isn’t just focusing on Cross Car racing, though. Ghosh also stressed the need to set a proper training academy to “build our drivers first”. Tyre manufacturers remain key pillars of the motorsport community in India today and the two major national racing championships are currently run by JK Tyre and MRF Tyres. Ghosh has proposed unifying the two to attract larger crowds to races. “In our time at Sholavaram, we used to have at least 20,000-30,000 people coming to see on an open field. Now where is that?” he said. “JK Tyre has their own championship, MRF has their own championship. Somehow we have to try and bridge that gap and bring at least one championship or event where all of these unified series can run as per specifications and regulations.” Also see: Arindam Ghosh is new FMSCI president",
  "author": "Unnatee Gidithuri",
  "published": "Sun, 8 Dec 2024 08:30:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Unnatee  Gidithuri",
  "length": 3050,
  "excerpt": "FMSCI President Arindam Ghosh believes stadium-based Cross Car racing, featuring small off-road buggies, will be the next big thing in Indian motorsport.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "FMSCI President Arindam Ghosh believes stadium-based Cross Car racing, featuring small off-road buggies, will be the next big thing in Indian motorsport.Newly-elected FMSCI (Federation of Motor Sports Clubs of India) President Arindam Ghosh has revealed plans to bring Cross Car racing to India, calling it “the future of motorsport” not just in the country, but globally. While the project is still in the early stages, Ghosh told Autocar India that “work is already underway, and the demo and test cars will be ready by January [2025]. But it has to be planned properly”.FMSCI sees potential in Cross Car races held in stadiumsSmall off-road buggies an affordable way to access motorsportWhat is cross car racing?Globally, Cross Car racing has been the first step in motorsport for several World Rally Championship and Rallycross racers. Essentially, Cross Car is to multi-surface racing what karting is to circuit racing.Usually held on autocross, dirt oval or rallycross tracks, these races feature small off-road buggies powered by motorcycle engines. Crucially, these buggies are easy to maintain and present an affordable way for people to access off-road motorsport. This makes it an ideal format for young racers to develop their skills.But this isn’t just limited to budding racers. Back in 2022, the FIA (the governing body for international motorsport) added Cross Car racing as part of its Motorsport Games roster. Currently there are three categories, headlined by the Senior category for drivers over 16 years of age and featuring 600cc-800cc rear-wheel drive cross cars.Next up is the Junior category for drivers aged 13-15, racing 690cc twin-cylinder two-wheel drive cars. And the latest addition is the Mini category for drivers aged eight to 12, racing identical FIA-supplied non-gearbox two-wheel drive mini cross cars.Focus on stadium sportsFor Ghosh, what makes Cross Car racing ideal for India is the fact that it can be held in stadiums, much like what we’ve seen recently with the Indian Supercross Racing League. This brings the racing to the people in cities, without all the complexities involved in setting up a circuits. Stadium stands also make it far easier for those in attendance to follow all the action.The FMSCI isn’t just focusing on Cross Car racing, though. Ghosh also stressed the need to set a proper training academy to “build our drivers first”.Tyre manufacturers remain key pillars of the motorsport community in India today and the two major national racing championships are currently run by JK Tyre and MRF Tyres. Ghosh has proposed unifying the two to attract larger crowds to races. “In our time at Sholavaram, we used to have at least 20,000-30,000 people coming to see on an open field. Now where is that?” he said.“JK Tyre has their own championship, MRF has their own championship. Somehow we have to try and bridge that gap and bring at least one championship or event where all of these unified series can run as per specifications and regulations.”Also see:Arindam Ghosh is new FMSCI president",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241206033507_cross_car_fmsci.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eFMSCI President Arindam Ghosh believes stadium-based Cross Car racing, featuring small off-road buggies, will be the next big thing in Indian motorsport.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eNewly-elected FMSCI (Federation of Motor Sports Clubs of India) President Arindam Ghosh has revealed plans to bring Cross Car racing to India, calling it “the future of motorsport” not just in the country, but globally. While the project is still in the early stages, Ghosh told Autocar India that “work is already underway, and the demo and test cars will be ready by January [2025]. But it has to be planned properly”.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eFMSCI sees potential in Cross Car races held in stadiums\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSmall off-road buggies an affordable way to access motorsport\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eWhat is cross car racing?\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eGlobally, Cross Car racing has been the first step in motorsport for several World Rally Championship and Rallycross racers. Essentially, Cross Car is to multi-surface racing what karting is to circuit racing.\u003c/p\u003e\u003cp\u003eUsually held on autocross, dirt oval or rallycross tracks, these races feature small off-road buggies powered by motorcycle engines. Crucially, these buggies are easy to maintain and present an affordable way for people to access off-road motorsport. This makes it an ideal format for young racers to develop their skills.\u003c/p\u003e\u003cp\u003eBut this isn’t just limited to budding racers. Back in 2022, the FIA (the governing body for international motorsport) added Cross Car racing as part of its Motorsport Games roster. Currently there are three categories, headlined by the Senior category for drivers over 16 years of age and featuring 600cc-800cc rear-wheel drive cross cars.\u003c/p\u003e\u003cp\u003eNext up is the Junior category for drivers aged 13-15, racing 690cc twin-cylinder two-wheel drive cars. And the latest addition is the Mini category for drivers aged eight to 12, racing identical FIA-supplied non-gearbox two-wheel drive mini cross cars.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eFocus on stadium sports\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eFor Ghosh, what makes Cross Car racing ideal for India is the fact that it can be held in stadiums, much like what we’ve seen recently with the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/motor-sports-news/cs-santosh-bigrock-motorsports-wins-isrl-title-430791\"\u003eIndian Supercross Racing League\u003c/a\u003e\u003c/strong\u003e. This brings the racing to the people in cities, without all the complexities involved in setting up a circuits. Stadium stands also make it far easier for those in attendance to follow all the action.\u003c/p\u003e\u003cp\u003eThe FMSCI isn’t just focusing on Cross Car racing, though. Ghosh also stressed the need to set a proper training academy to “build our drivers first”.\u003c/p\u003e\u003cp\u003eTyre manufacturers remain key pillars of the motorsport community in India today and the two major national racing championships are currently run by JK Tyre and MRF Tyres. Ghosh has proposed unifying the two to attract larger crowds to races. “In our time at Sholavaram, we used to have at least 20,000-30,000 people coming to see on an open field. Now where is that?” he said.\u003c/p\u003e\u003cp\u003e“JK Tyre has their own championship, MRF has their own championship. Somehow we have to try and bridge that gap and bring at least one championship or event where all of these unified series can run as per specifications and regulations.”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/motor-sports-news/arindam-ghosh-elected-new-fmsci-president-432990\"\u003eArindam Ghosh is new FMSCI president\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-08T08:30:00+05:30",
  "modifiedTime": null
}
