{
  "id": "21c0a0aa-d8dd-45b8-b166-60a8c6554d10",
  "title": "BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB comparison",
  "link": "https://www.autocarindia.com/car-comparison-reviews/byd-sealion-7-vs-hyundai-ioniq-5-vs-bmw-ix1-lwb-comparison-435549#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
  "description": "The premium electric vehicles (EV) space has really begun to heat up. While there weren’t any options between the Rs 25 lakh MG ZS EV and the Rs 1 crore Mercedes EQC earlier, now there are as many as six EVs priced around Rs 50 lakh on sale. Of these, the Hyundai Ioniq 5, the recently launched BYD Sealion 7 and the locally made BMW iX1 LWB appear to be the most compelling. We brought the three together and put them through our real-world tests to see which one deserves a spot in your garage. All three EVs measure over 4.6 metres in length, over 1.8 metres in width and have a 2.8-metre or longer wheelbase. The BYD is the longest and the widest, the BMW is the tallest, and the Hyundai trumps the other two in wheelbase length. As for their underpinnings, the BYD and Hyundai have born-electric platforms, which allow for better packaging and interior space. As such, these two feature a properly usable frunk (front trunk), which the ICE-to-EV converted BMW lacks. BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB exterior design and engineering BYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 specificationsSealion 7 PerformanceiX1 eDrive 20LIoniq 5Length4830mm4616mm4635mmWidth1985mm1845mm1890mmHeight1620mm1627mm1625mmWheelbase2930mm2800mm3000mmBoot capacity (F/R)58/500 litresNA/490 litres57/527 litresKerb weight2340kg1948kg2015kgTyre size245/45 R20225/55 R18255/45 R20Battery capacity82.56kWh66.4kWh72.6kWhPower530hp204hp217hpTorque690Nm250Nm350NmDrive layoutAWDFWDRWD Each of these three EVs follows a different form factor. The Ioniq 5 takes the shape of a large hatchback; the iX1 is more like a traditional SUV, while the Sealion 7 looks like a coupé-SUV. It really depends on which style you prefer, but all of them stand out in their own way with distinctive design elements. The Ioniq 5 has a neo-retro look with sharp cuts and creases and unique multi-spoke, dual-tone alloys, and I particularly like the rectangular lighting elements. In contrast, the Sealion 7 has a more rounded design that goes with BYD’s family look. It does look large and ungainly from the front, but the large alloys and the tapering roofline add some flair. At the rear, there’s a connected lighting element, which has some nice details. The BMW is the most conventional by far and has that upright stance of an SUV. It features BMW’s signature kidney grille, which appears a bit too large, as do the LED headlights. Its side profile does not look the most proportionate, thanks to the longer wheelbase and the smaller 18-inch wheels; the rear is quite similar to the standard X1, with large, L-shaped LED tail-lamps. BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB interior space and comfort The Sealion 7’s interior is superbly finished and loaded with tech, but the instrument cluster is cluttered. All three EVs have distinct identities inside the cabin as well. Starting with the Sealion 7, you’re greeted with a relatively conventional-looking dashboard, which houses the screens for the touchscreen infotainment system and the driver’s display. The 15.6-inch touchscreen, in typical BYD fashion, can change orientation from landscape to portrait, is very slick to operate, has high-res graphics, and even gets an updated UI over its siblings. This screen controls most of the car’s functions, but it’s nice that there are some physical controls in the centre console and a neat trick to adjust the AC without going into the sub-menus. All you have to do is swipe on the screen with three fingers from left to right for fan speed and from top to bottom for the temperature. Tinted glass at the back helps keep the Sealion 7 cool. The driver’s display, too, is high-res, but it appears very cluttered, and a lot of the important info appears small. But you have to commend BYD for the superb material quality and fit-and-finish, which feel on par with European luxury brands. The BYD's high-res 360-degree camera is one of the best. In the centre console, you get two wireless charging pads and two cup holders; there’s even some storage space below the console. The front seats feature ventilation, have just the right amount of cushioning and are very comfortable for occupants of all sizes. At the back, too, the seats feel plush and can be reclined; there’s loads of space, particularly legroom. The large windows and the glass roof elevate the sense of space. BYD’s 500-litre boot can fit in a lot. BYD has also packed the Sealion 7 with features like wireless smartphone integration, a 12-speaker Dynaudio music system, powered front seats, auto headlamps and wipers, a gesture-controlled and powered tailgate, dynamic ambient lighting, and much more. As for safety, there are 11 airbags, including one between the front seats and two for the rear side bolsters. There’s also Level 2 ADAS, a crisp 360-degree camera, and a driver-attention monitor, which is way too sensitive – even briefly glancing at the touchscreen generates a warning. The Sealion 7’s rear seat is big on space and feels the plushest. As for the new iX1 LWB, it has the same dash design as the ICE-powered X1 and the iX1 xDrive30, with a large, curved display that includes the infotainment touchscreen and the instrument panel. There are large, horizontal AC vents on the passenger side of the dash and under the screen, below which a sizeable wireless charging pad is located. The centre console extends from the centre armrest and houses some of the car’s key functions. The screens, while high in resolution, are too complicated tonavigate initially and on the go. While the fit and finish are great, some materials lower in the cabin are hard and scratchy. The steering is typically BMW with a chunky rim; the touchscreen has swallowed too many controls, and the UI is confusing. The front seats are supportive, but larger passengers may find them narrow, and they don’t have ventilation, which the other two EVs provide. The cushioning is firmer than the BYD’s. While the seats may not seem as comfortable initially, you’ll feel the cushioning is well-judged the longer you spend time in them. It’s at the rear where you get to experience the benefits of a long wheelbase. Though you are seated quite low and in a bit of a knees-up position because of the underfloor battery, you get acres of legroom; the seat base is longer by 15mm, and the backrest can be reclined up to 28.5 degrees, all of which make it more comfortable than the standard wheelbase version of the iX1. Compared to the BYD, though, the BMW feels narrower inside, and the backrest cushioning is on the firmer side. What also would’ve added to the comfort is rear sun blinds, which are also missing in the BYD. The iX1 has the most legroom but doesn’t get sunshades. The BMW is the least feature-rich EV here, but it still gets stuff like a large panoramic glass roof, ambient lighting, auto LED headlamps, connected tech, a smartphone-enabled key, leather upholstery, eight airbags and Level 2 ADAS tech. BMW’s 490-litre boot is the smallest here. Now, let’s come to the Hyundai Ioniq 5. Step inside it, and you get a great sense of space, thanks to the massive glass area, light colours, flat floor and the absence of a traditional centre console. Hyundai has used recycled and sustainable materials inside, and what’s great is that the fit and finish, as well as the touch and feel of bits, are top-notch. However, the white upholstery stains very easily, as you’d typically expect. The Hyundai's cabin is well-finished, logically laid out and big on practicality; UI is the easiest to use. Headlining the dash are two 12.3-inch screens – one for the instrument cluster and the other for the infotainment. These displays are crisp and easy to read, and the UI is easier to understand and navigate than that of the other two. The steering is a 2-spoke unit that houses a round drive-mode selector, while the drive-selector stalk is beneath the headlamp stalk. Uniquely, the entire centre console slides front and back to tailor the space and access. There are also plenty of storage spaces, such as a huge drawer in place of the glove box, large door bins and the centre console itself. The Ioniq 5's front seats are cooled, heated and get ottomans. The front seats are broad and supremely comfortable, with soft cushioning and plenty of electric adjustments, including extendable leg rests, and they can be configured into a comfy lounger. They also have ventilation and heating. The rear seats, though not as comfy as the ones in front, are easily wide enough for three adults, with the outer two seats featuring heating and electric adjustment. However, you are seated in a knees-up position due to the battery under the floor. The Hyundai's rear seats are wide enough for three, but you’re seated in a knees-up position. The Ioniq 5 also packs in a panoramic fixed glass roof, an 8-speaker Bose sound system, a 360-degree parking camera, dual-zone climate control, an electric boot, ESP, six airbags and ADAS. Wired smartphone integration is a downer, though. BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB features and safety BYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 features and safety kitEquipmentSealion 7 PerformanceiX1 eDrive 20LIoniq 5Auto LED headlampsYesYesYesAlloy wheels20-inch18-inch20-inchGlass roofPanoramicPanoramicPanoramicTouchscreen15.6-inch12.3-inch12.3-inchApple CarPlay/Android AutoWirelessWirelessWiredBranded audio systemDynaudioHarman KardonBoseVentilated/heated front seatsYes/NoNo/NoYes/YesWireless chargingYesYesYesAmbient lightingYesYesYesPaddle shiftersNoNoYesDrive/regen modesYes/YesYes/YesYes/Yes360-degree cameraYesYesYesTinted rear glassYesNoNoRear sunshadesNoNoYesADASYesYesYesAirbags1186Price (ex-showroom, India)Rs 54.90 lakhRs 49 lakhRs 46.05 lakh   The Hyundai gets paddles to control regen; one-pedal mode’s also there.   BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB performance and refinement BYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 performanceSealion 7 PerformanceiX1 eDrive 20LIoniq 50-20kph0.84s1.73s1.23s0-40kph1.58s3.12s2.52s0-60kph2.35s4.53s3.82s0-80kph3.19s6.22s5.41s0-100kph4.43s8.34s7.48s0-120kph6.18s11.30s10.09s20-80kph2.48s4.83s4.12s40-100kph2.91s5.72s4.82s80-0kph (braking)26.22m/2.32s26.48m/2.37s24.43m/2.14s All three EVs featured here have different drive layouts. The Sealion 7 has an all-wheel drive (there is also an RWD version), the Ioniq 5 is rear-wheel drive and, rather unconventionally, it’s the BMW that’s front-wheel drive. The BYD, in this dual-motor Performance guise, also has a clear advantage in terms of output (530hp/690Nm), followed by the Hyundai (217hp/350Nm) and the BMW (204hp/250Nm). And this is reflected in the performance figures. The Sealion 7 Performance makes the 0-100kph sprint in a brisk 4.43 seconds, compared to the Ioniq’s 7.48 seconds and the iX1’s 11.30 seconds. It’s the same story in rolling acceleration, with the BYD comfortably outperforming its rivals. Before we get into the nitty-gritty of how these feel like to drive, one thing each of them does admirably well is delivering power in a linear manner, unlike EVs of old, which served up all of their performance in one big chunk right from the get-go. All three also get drive modes, which affect throttle sensitivity, power delivery and range. Let’s start with the BYD, which easily feels the quickest of the lot. What’s nice is that it is able to put its power down in a tidy manner, thanks to the AWD system. On the move, you’ll also appreciate how smooth and progressive the power delivery is. And while the powertrain is silent, you will start to hear more of the outside world as you get closer to triple-digit speeds despite it featuring double-glazed front windows. Similarly, in the Hyundai, you don’t get that neck-snapping acceleration; the power delivery is nice and smooth. But that’s not to say that you’ll feel a lack of performance, as the Ioniq 5 feels sprightly in the Sport mode. The throttle modulation has also been judged very well, and it feels like a normal ICE car to drive. What’s also nice is that suspension, road and tyre noises barely disrupt the silence of the cabin. The BMW, by far, feels the most relaxed out of the trio, and while it packs over 200hp, given the weight it has to haul around, it can leave you wanting more, like when you want to make a quick overtake. As it has a front-wheel drive, there’s also some torque steer to contend with when driven flat out. As for sound insulation, it isn’t as quiet on the move as the Ioniq but fares better than the Sealion 7. BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB range BYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 range and efficiencySealion 7 PerformanceiX1 eDrive 20LIoniq 5City efficiency4.90km/kWh6.48km/kWh7.07km/kWhHighway efficiency4.17km/kWh5.60km/kWh5.67km/kWhRange371km398km457kmRegen braking on high (80-20kph)236.44m/18.13s131.67m/9.17s164.67m/12.16sRegen braking on medium (80-20kph)NA183.88m/12.82s213.11m/15.74sRegen braking on low (80-20kph)421.22m/32.16s373.8m/26.14s367.65m/27.55s Like with the output and performance, there’s the same pecking order when it comes to battery sizes, too. The Sealion 7 has an 82.56kWh unit with BYD’s blade cell LFP battery technology. The Ioniq 5 has the second-largest battery pack at 72.6kWh, and the BMW has the smallest at 66.4kWh; these two use the NMC battery chemistry. However, the Ioniq 5 has the highest claimed range of 631km, followed by the Sealion 7 (542km) and the iX1 (531km). In our real-world range test, the Ioniq 5 came out on top with a calculated overall range of 457km, significantly higher than the other two. The iX1 LWB had a 398km range, and given the extra power, the BYD delivered the least range of 371km. And, as is the case with most EVs, all three were more efficient in the city cycle, where they can recuperate more energy.  The move to the long wheelbase has come at the cost of some agility. All three get multiple regen braking modes, but the BMW has an advantage here with four modes; the Hyundai gets three, while the BYD has only two. One must note that the BMW also has an adaptive regen mode, but it’s not very intuitive, and the Hyundai is the only one in which you can turn off regen, allowing for free coasting. However, the BMW’s mode controls are baked into the touchscreen, making it tedious to change them on the move, and it’s also the most aggressive of the lot. On the other hand, the BYD feels the least aggressive, even in its ‘High’ mode. It’s the Hyundai’s regen that is best tuned, with a natural feel in the lower level, and you can even adjust levels or turn it off via paddle shifters. Also, the iX1 and the Ioniq 5 are capable of one-pedal driving. Despite huge 20-inch alloys, the ride is supple. The Ioniq 5 is the clear winner when it comes to charging speeds, as it is capable of DC fast charging at speeds of up to 350kW, which is enough to take it from 10 to 80 percent in just 18 minutes. The BYD can be charged up to 150kW on a DC fast charger. Both these are also capable of V2V (vehicle-to-vehicle) and V2L (vehicle-to-load) functions, wherein they can charge other EVs and power/charge other devices. The BMW can be fast-charged up to 130kW. BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB ride comfort and handling As for ride and handling, the Sealion 7 has a hint of firmness to its ride, but it manages to deal with road imperfections fairly well. The 20-inch wheels on this AWD version are a fly in the ointment, making it feel crashy over bumps. Given its mass and high centre of gravity, the BYD rolls a fair bit around bends, and its steering feels a little too quick. Smaller 18-inch wheels help give it a cushy ride. The Ioniq 5 feels planted at all speeds, and you’ll like the maturity with which it drives. The steering is direct and has a good heft, but it doesn’t feel sporty to drive, which is fine given its focus on comfort. And despite sitting on those large 20-inch alloys, the ride feels comfy and well-damped, and the Ioniq 5 deals with the rough stuff fairly well. There are some minor vertical movements over expansion joints, but it feels well-controlled. Meanwhile, the long wheelbase has affected the BMW iX1’s handling just as you’d expect. It doesn’t feel as agile as the regular wheelbase, dual-motor iX1 xDrive30, but it still grips corners admirably well with little body roll to speak of. The ride quality, like in most BMWs lately, is excellent. It feels very absorbent and does a good job of making the iX1 feel composed over most surfaces. BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB price and verdict The iX1, which has BMW’s badge value to bank on, has plenty of space at the back and is very attractively priced at Rs 49 lakh; dynamically, it’s the best here. But it has its shortcomings – it isn’t as equipped as the others; the infotainment system is unnecessarily complex and has swallowed a lot of key functions; the rear-seat backrest cushioning is firm, and certain plastics lower in the cabin feel out of place on a BMW. Now let’s sum up the Sealion 7. It is BYD’s most rounded offering in India yet and has everything we love about the Seal sedan in a more practical package. The interior quality and fit-and-finish are top-notch; it’s got all the tech and features you need, a comfortable backseat, and the most powerful drivetrain that’s quite smooth. It’s also the only one here with all-wheel drive (Rs 54.90 lakh), though there’s an RWD version with a higher claimed range of 567km but a lower output (310hp, 380Nm) and a price tag of Rs 48.90 lakh, which is still more expensive than the Hyundai and with a lower promised range. The Sealion 7 loses ground in its real-world range, which is the lowest, and it isn’t as well-rounded in many specific matters – the sound levels inside the cabin are high, the ride isn’t as plush, and the driver’s display is cluttered. And then, there’s BYD’s relative lack of an aftersales network. And this brings us to the winner, the Hyundai Ioniq 5. It standsout as the most approachable and well-rounded package. The cabin is spacious, the seats are very comfy and unique, and the infotainment is easy to navigate. The Ioniq 5 is also the most natural to drive, has the best real-world range and can charge at the fastest pace. To top it off, it’s the most affordable, too, at Rs 46 lakh. It’s no wonder then that the Ioniq 5 won our Car of the Year 2024 award and this comparison, too. Also see: BMW iX1 LWB vs Hyundai Ioniq 5 vs BYD Sealion 7 video comparison BYD Sealion 7 vs Seal: price, range, features and specs compared",
  "author": "Soham Thakur",
  "published": "Sat, 31 May 2025 14:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
  "categories": null,
  "byline": "Soham Thakur",
  "length": 18681,
  "excerpt": "If you have around Rs 50 lakh to spend on a premium EV, you\u0026amp;#8217;re probably contemplating between the Ioniq 5, Sealion 7 and iX1 LWB. We help you make a decision.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "If you have around Rs 50 lakh to spend on a premium EV, you’re probably contemplating between the Ioniq 5, Sealion 7 and iX1 LWB. We help you make a decision.The premium electric vehicles (EV) space has really begun to heat up. While there weren’t any options between the Rs 25 lakh MG ZS EV and the Rs 1 crore Mercedes EQC earlier, now there are as many as six EVs priced around Rs 50 lakh on sale. Of these, the Hyundai Ioniq 5, the recently launched BYD Sealion 7 and the locally made BMW iX1 LWB appear to be the most compelling. We brought the three together and put them through our real-world tests to see which one deserves a spot in your garage.All three EVs measure over 4.6 metres in length, over 1.8 metres in width and have a 2.8-metre or longer wheelbase. The BYD is the longest and the widest, the BMW is the tallest, and the Hyundai trumps the other two in wheelbase length. As for their underpinnings, the BYD and Hyundai have born-electric platforms, which allow for better packaging and interior space. As such, these two feature a properly usable frunk (front trunk), which the ICE-to-EV converted BMW lacks.BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB exterior design and engineeringBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 specificationsSealion 7 PerformanceiX1 eDrive 20LIoniq 5Length4830mm4616mm4635mmWidth1985mm1845mm1890mmHeight1620mm1627mm1625mmWheelbase2930mm2800mm3000mmBoot capacity (F/R)58/500 litresNA/490 litres57/527 litresKerb weight2340kg1948kg2015kgTyre size245/45 R20225/55 R18255/45 R20Battery capacity82.56kWh66.4kWh72.6kWhPower530hp204hp217hpTorque690Nm250Nm350NmDrive layoutAWDFWDRWDEach of these three EVs follows a different form factor. The Ioniq 5 takes the shape of a large hatchback; the iX1 is more like a traditional SUV, while the Sealion 7 looks like a coupé-SUV. It really depends on which style you prefer, but all of them stand out in their own way with distinctive design elements.The Ioniq 5 has a neo-retro look with sharp cuts and creases and unique multi-spoke, dual-tone alloys, and I particularly like the rectangular lighting elements. In contrast, the Sealion 7 has a more rounded design that goes with BYD’s family look. It does look large and ungainly from the front, but the large alloys and the tapering roofline add some flair. At the rear, there’s a connected lighting element, which has some nice details. The BMW is the most conventional by far and has that upright stance of an SUV. It features BMW’s signature kidney grille, which appears a bit too large, as do the LED headlights. Its side profile does not look the most proportionate, thanks to the longer wheelbase and the smaller 18-inch wheels; the rear is quite similar to the standard X1, with large, L-shaped LED tail-lamps.BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB interior space and comfortThe Sealion 7’s interior is superbly finished and loaded with tech, but the instrument cluster is cluttered.All three EVs have distinct identities inside the cabin as well. Starting with the Sealion 7, you’re greeted with a relatively conventional-looking dashboard, which houses the screens for the touchscreen infotainment system and the driver’s display. The 15.6-inch touchscreen, in typical BYD fashion, can change orientation from landscape to portrait, is very slick to operate, has high-res graphics, and even gets an updated UI over its siblings. This screen controls most of the car’s functions, but it’s nice that there are some physical controls in the centre console and a neat trick to adjust the AC without going into the sub-menus. All you have to do is swipe on the screen with three fingers from left to right for fan speed and from top to bottom for the temperature.Tinted glass at the back helps keep the Sealion 7 cool.The driver’s display, too, is high-res, but it appears very cluttered, and a lot of the important info appears small. But you have to commend BYD for the superb material quality and fit-and-finish, which feel on par with European luxury brands.The BYD's high-res 360-degree camera is one of the best.In the centre console, you get two wireless charging pads and two cup holders; there’s even some storage space below the console. The front seats feature ventilation, have just the right amount of cushioning and are very comfortable for occupants of all sizes. At the back, too, the seats feel plush and can be reclined; there’s loads of space, particularly legroom. The large windows and the glass roof elevate the sense of space.BYD’s 500-litre boot can fit in a lot.BYD has also packed the Sealion 7 with features like wireless smartphone integration, a 12-speaker Dynaudio music system, powered front seats, auto headlamps and wipers, a gesture-controlled and powered tailgate, dynamic ambient lighting, and much more. As for safety, there are 11 airbags, including one between the front seats and two for the rear side bolsters. There’s also Level 2 ADAS, a crisp 360-degree camera, and a driver-attention monitor, which is way too sensitive – even briefly glancing at the touchscreen generates a warning.The Sealion 7’s rear seat is big on space and feels the plushest.As for the new iX1 LWB, it has the same dash design as the ICE-powered X1 and the iX1 xDrive30, with a large, curved display that includes the infotainment touchscreen and the instrument panel. There are large, horizontal AC vents on the passenger side of the dash and under the screen, below which a sizeable wireless charging pad is located. The centre console extends from the centre armrest and houses some of the car’s key functions. The screens, while high in resolution, are too complicated tonavigate initially and on the go. While the fit and finish are great, some materials lower in the cabin are hard and scratchy.The steering is typically BMW with a chunky rim; the touchscreen has swallowed too many controls, and the UI is confusing.The front seats are supportive, but larger passengers may find them narrow, and they don’t have ventilation, which the other two EVs provide. The cushioning is firmer than the BYD’s. While the seats may not seem as comfortable initially, you’ll feel the cushioning is well-judged the longer you spend time in them. It’s at the rear where you get to experience the benefits of a long wheelbase. Though you are seated quite low and in a bit of a knees-up position because of the underfloor battery, you get acres of legroom; the seat base is longer by 15mm, and the backrest can be reclined up to 28.5 degrees, all of which make it more comfortable than the standard wheelbase version of the iX1. Compared to the BYD, though, the BMW feels narrower inside, and the backrest cushioning is on the firmer side. What also would’ve added to the comfort is rear sun blinds, which are also missing in the BYD.The iX1 has the most legroom but doesn’t get sunshades.The BMW is the least feature-rich EV here, but it still gets stuff like a large panoramic glass roof, ambient lighting, auto LED headlamps, connected tech, a smartphone-enabled key, leather upholstery, eight airbags and Level 2 ADAS tech.BMW’s 490-litre boot is the smallest here.Now, let’s come to the Hyundai Ioniq 5. Step inside it, and you get a great sense of space, thanks to the massive glass area, light colours, flat floor and the absence of a traditional centre console. Hyundai has used recycled and sustainable materials inside, and what’s great is that the fit and finish, as well as the touch and feel of bits, are top-notch. However, the white upholstery stains very easily, as you’d typically expect.The Hyundai's cabin is well-finished, logically laid out and big on practicality; UI is the easiest to use.Headlining the dash are two 12.3-inch screens – one for the instrument cluster and the other for the infotainment. These displays are crisp and easy to read, and the UI is easier to understand and navigate than that of the other two. The steering is a 2-spoke unit that houses a round drive-mode selector, while the drive-selector stalk is beneath the headlamp stalk. Uniquely, the entire centre console slides front and back to tailor the space and access. There are also plenty of storage spaces, such as a huge drawer in place of the glove box, large door bins and the centre console itself.The Ioniq 5's front seats are cooled, heated and get ottomans.The front seats are broad and supremely comfortable, with soft cushioning and plenty of electric adjustments, including extendable leg rests, and they can be configured into a comfy lounger. They also have ventilation and heating. The rear seats, though not as comfy as the ones in front, are easily wide enough for three adults, with the outer two seats featuring heating and electric adjustment. However, you are seated in a knees-up position due to the battery under the floor.The Hyundai's rear seats are wide enough for three, but you’re seated in a knees-up position.The Ioniq 5 also packs in a panoramic fixed glass roof, an 8-speaker Bose sound system, a 360-degree parking camera, dual-zone climate control, an electric boot, ESP, six airbags and ADAS. Wired smartphone integration is a downer, though.BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB features and safetyBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 features and safety kitEquipmentSealion 7 PerformanceiX1 eDrive 20LIoniq 5Auto LED headlampsYesYesYesAlloy wheels20-inch18-inch20-inchGlass roofPanoramicPanoramicPanoramicTouchscreen15.6-inch12.3-inch12.3-inchApple CarPlay/Android AutoWirelessWirelessWiredBranded audio systemDynaudioHarman KardonBoseVentilated/heated front seatsYes/NoNo/NoYes/YesWireless chargingYesYesYesAmbient lightingYesYesYesPaddle shiftersNoNoYesDrive/regen modesYes/YesYes/YesYes/Yes360-degree cameraYesYesYesTinted rear glassYesNoNoRear sunshadesNoNoYesADASYesYesYesAirbags1186Price (ex-showroom, India)Rs 54.90 lakhRs 49 lakhRs 46.05 lakh  The Hyundai gets paddles to control regen; one-pedal mode’s also there.  BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB performance and refinementBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 performanceSealion 7 PerformanceiX1 eDrive 20LIoniq 50-20kph0.84s1.73s1.23s0-40kph1.58s3.12s2.52s0-60kph2.35s4.53s3.82s0-80kph3.19s6.22s5.41s0-100kph4.43s8.34s7.48s0-120kph6.18s11.30s10.09s20-80kph2.48s4.83s4.12s40-100kph2.91s5.72s4.82s80-0kph (braking)26.22m/2.32s26.48m/2.37s24.43m/2.14sAll three EVs featured here have different drive layouts. The Sealion 7 has an all-wheel drive (there is also an RWD version), the Ioniq 5 is rear-wheel drive and, rather unconventionally, it’s the BMW that’s front-wheel drive. The BYD, in this dual-motor Performance guise, also has a clear advantage in terms of output (530hp/690Nm), followed by the Hyundai (217hp/350Nm) and the BMW (204hp/250Nm). And this is reflected in the performance figures. The Sealion 7 Performance makes the 0-100kph sprint in a brisk 4.43 seconds, compared to the Ioniq’s 7.48 seconds and the iX1’s 11.30 seconds. It’s the same story in rolling acceleration, with the BYD comfortably outperforming its rivals.Before we get into the nitty-gritty of how these feel like to drive, one thing each of them does admirably well is delivering power in a linear manner, unlike EVs of old, which served up all of their performance in one big chunk right from the get-go. All three also get drive modes, which affect throttle sensitivity, power delivery and range.Let’s start with the BYD, which easily feels the quickest of the lot. What’s nice is that it is able to put its power down in a tidy manner, thanks to the AWD system. On the move, you’ll also appreciate how smooth and progressive the power delivery is. And while the powertrain is silent, you will start to hear more of the outside world as you get closer to triple-digit speeds despite it featuring double-glazed front windows.Similarly, in the Hyundai, you don’t get that neck-snapping acceleration; the power delivery is nice and smooth. But that’s not to say that you’ll feel a lack of performance, as the Ioniq 5 feels sprightly in the Sport mode. The throttle modulation has also been judged very well, and it feels like a normal ICE car to drive. What’s also nice is that suspension, road and tyre noises barely disrupt the silence of the cabin.The BMW, by far, feels the most relaxed out of the trio, and while it packs over 200hp, given the weight it has to haul around, it can leave you wanting more, like when you want to make a quick overtake. As it has a front-wheel drive, there’s also some torque steer to contend with when driven flat out. As for sound insulation, it isn’t as quiet on the move as the Ioniq but fares better than the Sealion 7.BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB rangeBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 range and efficiencySealion 7 PerformanceiX1 eDrive 20LIoniq 5City efficiency4.90km/kWh6.48km/kWh7.07km/kWhHighway efficiency4.17km/kWh5.60km/kWh5.67km/kWhRange371km398km457kmRegen braking on high (80-20kph)236.44m/18.13s131.67m/9.17s164.67m/12.16sRegen braking on medium (80-20kph)NA183.88m/12.82s213.11m/15.74sRegen braking on low (80-20kph)421.22m/32.16s373.8m/26.14s367.65m/27.55sLike with the output and performance, there’s the same pecking order when it comes to battery sizes, too. The Sealion 7 has an 82.56kWh unit with BYD’s blade cell LFP battery technology. The Ioniq 5 has the second-largest battery pack at 72.6kWh, and the BMW has the smallest at 66.4kWh; these two use the NMC battery chemistry. However, the Ioniq 5 has the highest claimed range of 631km, followed by the Sealion 7 (542km) and the iX1 (531km).In our real-world range test, the Ioniq 5 came out on top with a calculated overall range of 457km, significantly higher than the other two. The iX1 LWB had a 398km range, and given the extra power, the BYD delivered the least range of 371km. And, as is the case with most EVs, all three were more efficient in the city cycle, where they can recuperate more energy. The move to the long wheelbase has come at the cost of some agility.All three get multiple regen braking modes, but the BMW has an advantage here with four modes; the Hyundai gets three, while the BYD has only two. One must note that the BMW also has an adaptive regen mode, but it’s not very intuitive, and the Hyundai is the only one in which you can turn off regen, allowing for free coasting. However, the BMW’s mode controls are baked into the touchscreen, making it tedious to change them on the move, and it’s also the most aggressive of the lot. On the other hand, the BYD feels the least aggressive, even in its ‘High’ mode. It’s the Hyundai’s regen that is best tuned, with a natural feel in the lower level, and you can even adjust levels or turn it off via paddle shifters. Also, the iX1 and the Ioniq 5 are capable of one-pedal driving.Despite huge 20-inch alloys, the ride is supple.The Ioniq 5 is the clear winner when it comes to charging speeds, as it is capable of DC fast charging at speeds of up to 350kW, which is enough to take it from 10 to 80 percent in just 18 minutes. The BYD can be charged up to 150kW on a DC fast charger. Both these are also capable of V2V (vehicle-to-vehicle) and V2L (vehicle-to-load) functions, wherein they can charge other EVs and power/charge other devices. The BMW can be fast-charged up to 130kW.BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB ride comfort and handlingAs for ride and handling, the Sealion 7 has a hint of firmness to its ride, but it manages to deal with road imperfections fairly well. The 20-inch wheels on this AWD version are a fly in the ointment, making it feel crashy over bumps. Given its mass and high centre of gravity, the BYD rolls a fair bit around bends, and its steering feels a little too quick.Smaller 18-inch wheels help give it a cushy ride.The Ioniq 5 feels planted at all speeds, and you’ll like the maturity with which it drives. The steering is direct and has a good heft, but it doesn’t feel sporty to drive, which is fine given its focus on comfort. And despite sitting on those large 20-inch alloys, the ride feels comfy and well-damped, and the Ioniq 5 deals with the rough stuff fairly well. There are some minor vertical movements over expansion joints, but it feels well-controlled.Meanwhile, the long wheelbase has affected the BMW iX1’s handling just as you’d expect. It doesn’t feel as agile as the regular wheelbase, dual-motor iX1 xDrive30, but it still grips corners admirably well with little body roll to speak of. The ride quality, like in most BMWs lately, is excellent. It feels very absorbent and does a good job of making the iX1 feel composed over most surfaces.BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB price and verdictThe iX1, which has BMW’s badge value to bank on, has plenty of space at the back and is very attractively priced at Rs 49 lakh; dynamically, it’s the best here. But it has its shortcomings – it isn’t as equipped as the others; the infotainment system is unnecessarily complex and has swallowed a lot of key functions; the rear-seat backrest cushioning is firm, and certain plastics lower in the cabin feel out of place on a BMW.Now let’s sum up the Sealion 7. It is BYD’s most rounded offering in India yet and has everything we love about the Seal sedan in a more practical package. The interior quality and fit-and-finish are top-notch; it’s got all the tech and features you need, a comfortable backseat, and the most powerful drivetrain that’s quite smooth. It’s also the only one here with all-wheel drive (Rs 54.90 lakh), though there’s an RWD version with a higher claimed range of 567km but a lower output (310hp, 380Nm) and a price tag of Rs 48.90 lakh, which is still more expensive than the Hyundai and with a lower promised range. The Sealion 7 loses ground in its real-world range, which is the lowest, and it isn’t as well-rounded in many specific matters – the sound levels inside the cabin are high, the ride isn’t as plush, and the driver’s display is cluttered. And then, there’s BYD’s relative lack of an aftersales network.And this brings us to the winner, the Hyundai Ioniq 5. It standsout as the most approachable and well-rounded package. The cabin is spacious, the seats are very comfy and unique, and the infotainment is easy to navigate. The Ioniq 5 is also the most natural to drive, has the best real-world range and can charge at the fastest pace. To top it off, it’s the most affordable, too, at Rs 46 lakh. It’s no wonder then that the Ioniq 5 won our Car of the Year 2024 award and this comparison, too.Also see:BMW iX1 LWB vs Hyundai Ioniq 5 vs BYD Sealion 7 video comparisonBYD Sealion 7 vs Seal: price, range, features and specs comparedImagesVideos",
  "image": "https://img.autocarindia.com/ExtraImages/20250530050827_BYD_Sealion_7_vs_BMW_iX1_LWB_vs_Hyundai_Ioniq_5_Front_Quarter_Static.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eIf you have around Rs 50 lakh to spend on a premium EV, you’re probably contemplating between the Ioniq 5, Sealion 7 and iX1 LWB. We help you make a decision.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe premium electric vehicles (EV) space has really begun to heat up. While there weren’t any options between the Rs 25 lakh \u003ca href=\"https://www.autocarindia.com/cars/mg/zs-ev\"\u003e\u003cstrong\u003eMG ZS EV\u003c/strong\u003e\u003c/a\u003e and the Rs 1 crore \u003ca href=\"https://www.autocarindia.com/cars/mercedes-benz/eqc\"\u003e\u003cstrong\u003eMercedes EQC\u003c/strong\u003e\u003c/a\u003e earlier, now there are as many as six EVs priced around Rs 50 lakh on sale. Of these, the \u003ca href=\"https://www.autocarindia.com/cars/hyundai/ioniq-5\"\u003e\u003cstrong\u003eHyundai Ioniq 5\u003c/strong\u003e\u003c/a\u003e, the recently launched \u003ca href=\"https://www.autocarindia.com/cars/byd/sealion-7\"\u003e\u003cstrong\u003eBYD Sealion 7\u003c/strong\u003e\u003c/a\u003e and the locally made \u003ca href=\"https://www.autocarindia.com/cars/bmw-ix1-lwb\"\u003e\u003cstrong\u003eBMW iX1 LWB\u003c/strong\u003e\u003c/a\u003e appear to be the most compelling. We brought the three together and put them through our real-world tests to see which one deserves a spot in your garage.\u003c/p\u003e\u003cp\u003eAll three EVs measure over 4.6 metres in length, over 1.8 metres in width and have a 2.8-metre or longer wheelbase. The BYD is the longest and the widest, the BMW is the tallest, and the Hyundai trumps the other two in wheelbase length. As for their underpinnings, the BYD and Hyundai have born-electric platforms, which allow for better packaging and interior space. As such, these two feature a properly usable frunk (front trunk), which the ICE-to-EV converted BMW lacks.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB exterior design and engineering\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"4\" scope=\"col\"\u003eBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 specifications\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003c/td\u003e\u003ctd\u003eSealion 7 Performance\u003c/td\u003e\u003ctd\u003eiX1 eDrive 20L\u003c/td\u003e\u003ctd\u003eIoniq 5\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eLength\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e4830mm\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e4616mm\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e4635mm\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eWidth\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e1985mm\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e1845mm\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e1890mm\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eHeight\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e1620mm\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e1627mm\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e1625mm\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eWheelbase\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e2930mm\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e2800mm\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e3000mm\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBoot capacity (F/R)\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e58/500 litres\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eNA/490 litres\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e57/527 litres\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eKerb weight\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e2340kg\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e1948kg\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e2015kg\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eTyre size\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e245/45 R20\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e225/55 R18\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e255/45 R20\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBattery capacity\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e82.56kWh\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e66.4kWh\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e72.6kWh\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003ePower\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e530hp\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e204hp\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e217hp\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eTorque\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e690Nm\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e250Nm\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e350Nm\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eDrive layout\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eAWD\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eFWD\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eRWD\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003eEach of these three EVs follows a different form factor. The Ioniq 5 takes the shape of a large hatchback; the iX1 is more like a traditional SUV, while the Sealion 7 looks like a coupé-SUV. It really depends on which style you prefer, but all of them stand out in their own way with distinctive design elements.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_vs_BMW_iX1_LWB_vs_Hyundai_Ioniq_5_Wheels.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB\"/\u003e\u003c/p\u003e\u003cp\u003eThe Ioniq 5 has a neo-retro look with sharp cuts and creases and unique multi-spoke, dual-tone alloys, and I particularly like the rectangular lighting elements. In contrast, the Sealion 7 has a more rounded design that goes with BYD’s family look. It does look large and ungainly from the front, but the large alloys and the tapering roofline add some flair. At the rear, there’s a connected lighting element, which has some nice details. The BMW is the most conventional by far and has that upright stance of an SUV. It features BMW’s signature kidney grille, which appears a bit too large, as do the LED headlights. Its side profile does not look the most proportionate, thanks to the longer wheelbase and the smaller 18-inch wheels; the rear is quite similar to the standard X1, with large, L-shaped LED tail-lamps.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB interior space and comfort\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 interior\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_Interior.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 interior\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Sealion 7’s interior is superbly finished and loaded with tech, but the instrument cluster is cluttered.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAll three EVs have distinct identities inside the cabin as well. Starting with the Sealion 7, you’re greeted with a relatively conventional-looking dashboard, which houses the screens for the touchscreen infotainment system and the driver’s display. The 15.6-inch touchscreen, in typical BYD fashion, can change orientation from landscape to portrait, is very slick to operate, has high-res graphics, and even gets an updated UI over its siblings. This screen controls most of the car’s functions, but it’s nice that there are some physical controls in the centre console and a neat trick to adjust the AC without going into the sub-menus. All you have to do is swipe on the screen with three fingers from left to right for fan speed and from top to bottom for the temperature.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 rear windows\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_Tinted_Rear_Glass.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 rear windows\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eTinted glass at the back helps keep the Sealion 7 cool.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe driver’s display, too, is high-res, but it appears very cluttered, and a lot of the important info appears small. But you have to commend BYD for the superb material quality and fit-and-finish, which feel on par with European luxury brands.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 360 degree camera\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_Touchscreen.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 360 degree camera\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe BYD\u0026#39;s high-res 360-degree camera is one of the best.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIn the centre console, you get two wireless charging pads and two cup holders; there’s even some storage space below the console. The front seats feature ventilation, have just the right amount of cushioning and are very comfortable for occupants of all sizes. At the back, too, the seats feel plush and can be reclined; there’s loads of space, particularly legroom. The large windows and the glass roof elevate the sense of space.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 boot\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_Boot.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 boot\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eBYD’s 500-litre boot can fit in a lot.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eBYD has also packed the Sealion 7 with features like wireless smartphone integration, a 12-speaker Dynaudio music system, powered front seats, auto headlamps and wipers, a gesture-controlled and powered tailgate, dynamic ambient lighting, and much more. As for safety, there are 11 airbags, including one between the front seats and two for the rear side bolsters. There’s also Level 2 ADAS, a crisp 360-degree camera, and a driver-attention monitor, which is way too sensitive – even briefly glancing at the touchscreen generates a warning.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 rear seat\" src=\"https://img.autocarindia.com/Reviews/20250530051237_BYD_Sealion_7_Rear_Seats.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 rear seat\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Sealion 7’s rear seat is big on space and feels the plushest.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAs for the new iX1 LWB, it has the same dash design as the ICE-powered X1 and the iX1 xDrive30, with a large, curved display that includes the infotainment touchscreen and the instrument panel. There are large, horizontal AC vents on the passenger side of the dash and under the screen, below which a sizeable wireless charging pad is located. The centre console extends from the centre armrest and houses some of the car’s key functions. The screens, while high in resolution, are too complicated tonavigate initially and on the go. While the fit and finish are great, some materials lower in the cabin are hard and scratchy.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BMW iX1 interior\" src=\"https://img.autocarindia.com/Reviews/BMW_iX1_LWB_Interior.jpg?w=700\u0026amp;c=0\" title=\"BMW iX1 interior\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe steering is typically BMW with a chunky rim; the touchscreen has swallowed too many controls, and the UI is confusing.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe front seats are supportive, but larger passengers may find them narrow, and they don’t have ventilation, which the other two EVs provide. The cushioning is firmer than the BYD’s. While the seats may not seem as comfortable initially, you’ll feel the cushioning is well-judged the longer you spend time in them. It’s at the rear where you get to experience the benefits of a long wheelbase. Though you are seated quite low and in a bit of a knees-up position because of the underfloor battery, you get acres of legroom; the seat base is longer by 15mm, and the backrest can be reclined up to 28.5 degrees, all of which make it more comfortable than the standard wheelbase version of the iX1. Compared to the BYD, though, the BMW feels narrower inside, and the backrest cushioning is on the firmer side. What also would’ve added to the comfort is rear sun blinds, which are also missing in the BYD.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BMW iX1 rear seats\" src=\"https://img.autocarindia.com/Reviews/BMW_iX1_LWB_Rear_Seats.jpg?w=700\u0026amp;c=0\" title=\"BMW iX1 rear seats\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe iX1 has the most legroom but doesn’t get sunshades.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe BMW is the least feature-rich EV here, but it still gets stuff like a large panoramic glass roof, ambient lighting, auto LED headlamps, connected tech, a smartphone-enabled key, leather upholstery, eight airbags and Level 2 ADAS tech.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BMW iX1 boot\" src=\"https://img.autocarindia.com/Reviews/BMW_iX1_LWB_Boot.jpg?w=700\u0026amp;c=0\" title=\"BMW iX1 boot\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eBMW’s 490-litre boot is the smallest here.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eNow, let’s come to the Hyundai Ioniq 5. Step inside it, and you get a great sense of space, thanks to the massive glass area, light colours, flat floor and the absence of a traditional centre console. Hyundai has used recycled and sustainable materials inside, and what’s great is that the fit and finish, as well as the touch and feel of bits, are top-notch. However, the white upholstery stains very easily, as you’d typically expect.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Hyundai Ioniq 5 interior\" src=\"https://img.autocarindia.com/Reviews/Hyundai_Ioniq_5_Interior.jpg?w=700\u0026amp;c=0\" title=\"Hyundai Ioniq 5 interior\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Hyundai\u0026#39;s cabin is well-finished, logically laid out and big on practicality; UI is the easiest to use.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHeadlining the dash are two 12.3-inch screens – one for the instrument cluster and the other for the infotainment. These displays are crisp and easy to read, and the UI is easier to understand and navigate than that of the other two. The steering is a 2-spoke unit that houses a round drive-mode selector, while the drive-selector stalk is beneath the headlamp stalk. Uniquely, the entire centre console slides front and back to tailor the space and access. There are also plenty of storage spaces, such as a huge drawer in place of the glove box, large door bins and the centre console itself.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Hyundai Ioniq 5 front seats\" src=\"https://img.autocarindia.com/Reviews/Hyundai_Ioniq_5_Front_Seats.jpg?w=700\u0026amp;c=0\" title=\"Hyundai Ioniq 5 front seats\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Ioniq 5\u0026#39;s front seats are cooled, heated and get ottomans.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe front seats are broad and supremely comfortable, with soft cushioning and plenty of electric adjustments, including extendable leg rests, and they can be configured into a comfy lounger. They also have ventilation and heating. The rear seats, though not as comfy as the ones in front, are easily wide enough for three adults, with the outer two seats featuring heating and electric adjustment. However, you are seated in a knees-up position due to the battery under the floor.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Hyundai Ioniq 5 rear seats\" src=\"https://img.autocarindia.com/Reviews/Hyundai_Ioniq_5_Rear_Seats.jpg?w=700\u0026amp;c=0\" title=\"Hyundai Ioniq 5 rear seats\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Hyundai\u0026#39;s rear seats are wide enough for three, but you’re seated in a knees-up position.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Ioniq 5 also packs in a panoramic fixed glass roof, an 8-speaker Bose sound system, a 360-degree parking camera, dual-zone climate control, an electric boot, ESP, six airbags and ADAS. Wired smartphone integration is a downer, though.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB features and safety\u003c/strong\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"4\" scope=\"col\"\u003eBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 features and safety kit\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003eEquipment\u003c/td\u003e\u003ctd\u003eSealion 7 Performance\u003c/td\u003e\u003ctd\u003eiX1 eDrive 20L\u003c/td\u003e\u003ctd\u003eIoniq 5\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAuto LED headlamps\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAlloy wheels\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e20-inch\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e18-inch\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e20-inch\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eGlass roof\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003ePanoramic\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003ePanoramic\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003ePanoramic\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eTouchscreen\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e15.6-inch\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e12.3-inch\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e12.3-inch\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eApple CarPlay/Android Auto\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eWireless\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eWireless\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eWired\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBranded audio system\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eDynaudio\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eHarman Kardon\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eBose\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eVentilated/heated front seats\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes/No\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eNo/No\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes/Yes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eWireless charging\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAmbient lighting\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003ePaddle shifters\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eNo\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eNo\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eDrive/regen modes\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes/Yes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eYes/Yes\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes/Yes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e360-degree camera\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eTinted rear glass\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eNo\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eNo\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRear sunshades\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eNo\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eNo\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eADAS\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAirbags\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e11\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e8\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e6\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003ePrice (ex-showroom, India)\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eRs 54.90 lakh\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003eRs 49 lakh\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003eRs 46.05 lakh\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cbr/\u003e  \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Hyundai Ioniq 5 paddle shifter\" src=\"https://img.autocarindia.com/Reviews/Hyundai_Ioniq_5_Paddle_Shifters.jpg?w=700\u0026amp;c=0\" title=\"Hyundai Ioniq 5 paddle shifter\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Hyundai gets paddles to control regen; one-pedal mode’s also there.\u003c/em\u003e\u003cbr/\u003e  \u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB performance and refinement\u003c/strong\u003e\u003c/h2\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"4\" scope=\"col\"\u003eBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 performance\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003c/td\u003e\u003ctd\u003eSealion 7 Performance\u003c/td\u003e\u003ctd\u003eiX1 eDrive 20L\u003c/td\u003e\u003ctd\u003eIoniq 5\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-20kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e0.84s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e1.73s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e1.23s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-40kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e1.58s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e3.12s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e2.52s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-60kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e2.35s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e4.53s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e3.82s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-80kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e3.19s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e6.22s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e5.41s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-100kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e4.43s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e8.34s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e7.48s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-120kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e6.18s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e11.30s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e10.09s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e20-80kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e2.48s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e4.83s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e4.12s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e40-100kph\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e2.91s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e5.72s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e4.82s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e80-0kph (braking)\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e26.22m/2.32s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e26.48m/2.37s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e24.43m/2.14s\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003eAll three EVs featured here have different drive layouts. The Sealion 7 has an all-wheel drive (there is also an RWD version), the Ioniq 5 is rear-wheel drive and, rather unconventionally, it’s the BMW that’s front-wheel drive. The BYD, in this dual-motor Performance guise, also has a clear advantage in terms of output (530hp/690Nm), followed by the Hyundai (217hp/350Nm) and the BMW (204hp/250Nm). And this is reflected in the performance figures. The Sealion 7 Performance makes the 0-100kph sprint in a brisk 4.43 seconds, compared to the Ioniq’s 7.48 seconds and the iX1’s 11.30 seconds. It’s the same story in rolling acceleration, with the BYD comfortably outperforming its rivals.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB rear tracking\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_and_BMW_iX1_LWB_Rear_Tracking.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB rear tracking\"/\u003e\u003c/p\u003e\u003cp\u003eBefore we get into the nitty-gritty of how these feel like to drive, one thing each of them does admirably well is delivering power in a linear manner, unlike EVs of old, which served up all of their performance in one big chunk right from the get-go. All three also get drive modes, which affect throttle sensitivity, power delivery and range.\u003c/p\u003e\u003cp\u003eLet’s start with the BYD, which easily feels the quickest of the lot. What’s nice is that it is able to put its power down in a tidy manner, thanks to the AWD system. On the move, you’ll also appreciate how smooth and progressive the power delivery is. And while the powertrain is silent, you will start to hear more of the outside world as you get closer to triple-digit speeds despite it featuring double-glazed front windows.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB front tracking\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_and_Hyundai_Ioniq_5_Front_Tracking.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB front tracking\"/\u003e\u003c/p\u003e\u003cp\u003eSimilarly, in the Hyundai, you don’t get that neck-snapping acceleration; the power delivery is nice and smooth. But that’s not to say that you’ll feel a lack of performance, as the Ioniq 5 feels sprightly in the Sport mode. The throttle modulation has also been judged very well, and it feels like a normal ICE car to drive. What’s also nice is that suspension, road and tyre noises barely disrupt the silence of the cabin.\u003c/p\u003e\u003cp\u003eThe BMW, by far, feels the most relaxed out of the trio, and while it packs over 200hp, given the weight it has to haul around, it can leave you wanting more, like when you want to make a quick overtake. As it has a front-wheel drive, there’s also some torque steer to contend with when driven flat out. As for sound insulation, it isn’t as quiet on the move as the Ioniq but fares better than the Sealion 7.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB range\u003c/strong\u003e\u003c/h2\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"4\" scope=\"col\"\u003eBYD Sealion 7 vs BMW iX1 LWB vs Hyundai Ioniq 5 range and efficiency\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003c/td\u003e\u003ctd\u003eSealion 7 Performance\u003c/td\u003e\u003ctd\u003eiX1 eDrive 20L\u003c/td\u003e\u003ctd\u003eIoniq 5\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eCity efficiency\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e4.90km/kWh\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e6.48km/kWh\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e7.07km/kWh\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eHighway efficiency\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e4.17km/kWh\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e5.60km/kWh\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e5.67km/kWh\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRange\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e371km\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e398km\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e457km\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRegen braking on high (80-20kph)\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e236.44m/18.13s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e131.67m/9.17s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e164.67m/12.16s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRegen braking on medium (80-20kph)\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003eNA\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e183.88m/12.82s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e213.11m/15.74s\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRegen braking on low (80-20kph)\u003c/td\u003e\u003ctd data-label=\"Sealion 7 Performance\"\u003e421.22m/32.16s\u003c/td\u003e\u003ctd data-label=\"iX1 eDrive 20L\"\u003e373.8m/26.14s\u003c/td\u003e\u003ctd data-label=\"Ioniq 5\"\u003e367.65m/27.55s\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003eLike with the output and performance, there’s the same pecking order when it comes to battery sizes, too. The Sealion 7 has an 82.56kWh unit with BYD’s blade cell LFP battery technology. The Ioniq 5 has the second-largest battery pack at 72.6kWh, and the BMW has the smallest at 66.4kWh; these two use the NMC battery chemistry. However, the Ioniq 5 has the highest claimed range of 631km, followed by the Sealion 7 (542km) and the iX1 (531km).\u003c/p\u003e\u003cp\u003eIn our real-world range test, the Ioniq 5 came out on top with a calculated overall range of 457km, significantly higher than the other two. The iX1 LWB had a 398km range, and given the extra power, the BYD delivered the least range of 371km. And, as is the case with most EVs, all three were more efficient in the city cycle, where they can recuperate more energy. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BMW iX1 LWB front tracking\" src=\"https://img.autocarindia.com/Reviews/BMW_iX1_LWB_Front_Quarter_Tracking.jpg?w=700\u0026amp;c=0\" title=\"BMW iX1 LWB front tracking\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe move to the long wheelbase has come at the cost of some agility.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAll three get multiple regen braking modes, but the BMW has an advantage here with four modes; the Hyundai gets three, while the BYD has only two. One must note that the BMW also has an adaptive regen mode, but it’s not very intuitive, and the Hyundai is the only one in which you can turn off regen, allowing for free coasting. However, the BMW’s mode controls are baked into the touchscreen, making it tedious to change them on the move, and it’s also the most aggressive of the lot. On the other hand, the BYD feels the least aggressive, even in its ‘High’ mode. It’s the Hyundai’s regen that is best tuned, with a natural feel in the lower level, and you can even adjust levels or turn it off via paddle shifters. Also, the iX1 and the Ioniq 5 are capable of one-pedal driving.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Hyundai Ioniq 5 rear tracking\" src=\"https://img.autocarindia.com/Reviews/Hyundai_Ioniq_5_Rear_Quarter_Tracking.jpg?w=700\u0026amp;c=0\" title=\"Hyundai Ioniq 5 rear tracking\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eDespite huge 20-inch alloys, the ride is supple.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Ioniq 5 is the clear winner when it comes to charging speeds, as it is capable of DC fast charging at speeds of up to 350kW, which is enough to take it from 10 to 80 percent in just 18 minutes. The BYD can be charged up to 150kW on a DC fast charger. Both these are also capable of V2V (vehicle-to-vehicle) and V2L (vehicle-to-load) functions, wherein they can charge other EVs and power/charge other devices. The BMW can be fast-charged up to 130kW.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB ride comfort and handling\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eAs for ride and handling, the Sealion 7 has a hint of firmness to its ride, but it manages to deal with road imperfections fairly well. The 20-inch wheels on this AWD version are a fly in the ointment, making it feel crashy over bumps. Given its mass and high centre of gravity, the BYD rolls a fair bit around bends, and its steering feels a little too quick.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BMW iX1 LWB alloy wheels\" src=\"https://img.autocarindia.com/Reviews/BMW_iX1_LWB_Wheels.jpg?w=700\u0026amp;c=0\" title=\"BMW iX1 LWB alloy wheels\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eSmaller 18-inch wheels help give it a cushy ride.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Ioniq 5 feels planted at all speeds, and you’ll like the maturity with which it drives. The steering is direct and has a good heft, but it doesn’t feel sporty to drive, which is fine given its focus on comfort. And despite sitting on those large 20-inch alloys, the ride feels comfy and well-damped, and the Ioniq 5 deals with the rough stuff fairly well. There are some minor vertical movements over expansion joints, but it feels well-controlled.\u003c/p\u003e\u003cp\u003eMeanwhile, the long wheelbase has affected the BMW iX1’s handling just as you’d expect. It doesn’t feel as agile as the regular wheelbase, dual-motor iX1 xDrive30, but it still grips corners admirably well with little body roll to speak of. The ride quality, like in most BMWs lately, is excellent. It feels very absorbent and does a good job of making the iX1 feel composed over most surfaces.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eBYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB price and verdict\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe iX1, which has BMW’s badge value to bank on, has plenty of space at the back and is very attractively priced at Rs 49 lakh; dynamically, it’s the best here. But it has its shortcomings – it isn’t as equipped as the others; the infotainment system is unnecessarily complex and has swallowed a lot of key functions; the rear-seat backrest cushioning is firm, and certain plastics lower in the cabin feel out of place on a BMW.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB\" src=\"https://img.autocarindia.com/Reviews/BYD_Sealion_7_vs_BMW_iX1_LWB_vs_Hyundai_Ioniq_5_Side_Tracking.jpg?w=700\u0026amp;c=0\" title=\"BYD Sealion 7 vs Hyundai Ioniq 5 vs BMW iX1 LWB\"/\u003e\u003c/p\u003e\u003cp\u003eNow let’s sum up the Sealion 7. It is BYD’s most rounded offering in India yet and has everything we love about the Seal sedan in a more practical package. The interior quality and fit-and-finish are top-notch; it’s got all the tech and features you need, a comfortable backseat, and the most powerful drivetrain that’s quite smooth. It’s also the only one here with all-wheel drive (Rs 54.90 lakh), though there’s an RWD version with a higher claimed range of 567km but a lower output (310hp, 380Nm) and a price tag of Rs 48.90 lakh, which is still more expensive than the Hyundai and with a lower promised range. The Sealion 7 loses ground in its real-world range, which is the lowest, and it isn’t as well-rounded in many specific matters – the sound levels inside the cabin are high, the ride isn’t as plush, and the driver’s display is cluttered. And then, there’s BYD’s relative lack of an aftersales network.\u003c/p\u003e\u003cp\u003eAnd this brings us to the winner, the Hyundai Ioniq 5. It standsout as the most approachable and well-rounded package. The cabin is spacious, the seats are very comfy and unique, and the infotainment is easy to navigate. The Ioniq 5 is also the most natural to drive, has the best real-world range and can charge at the fastest pace. To top it off, it’s the most affordable, too, at Rs 46 lakh. It’s no wonder then that the \u003ca href=\"https://www.autocarindia.com/car-news/hyundai-ioniq-5-royal-enfield-himalayan-win-big-at-the-autocar-awards-2024-430380\"\u003e\u003cstrong\u003eIoniq 5 won our Car of the Year 2024 award\u003c/strong\u003e\u003c/a\u003e and this comparison, too.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-video-reviews/bmw-ix1-vs-hyundai-ioniq-5-vs-byd-sealion-7-video-comparison-435091\"\u003eBMW iX1 LWB vs Hyundai Ioniq 5 vs BYD Sealion 7 video comparison\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/auto-features/byd-sealion-7-vs-seal-price-range-features-and-specs-compared-434632\"\u003eBYD Sealion 7 vs Seal: price, range, features and specs compared\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-435549\"\u003e\u003cul id=\"tab-id-435549\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-435549\" href=\"#.\" rel=\"#tab-images-container-435549\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-435549\" href=\"#.\" rel=\"#tab-videos-container-435549\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "20 min read",
  "publishedTime": "2025-05-31T14:00:00+05:30",
  "modifiedTime": null
}
