{
  "id": "32129798-aa17-42c4-8381-84974e68706a",
  "title": "Aston Martin Vanquish Volante",
  "link": "https://www.autocar.co.uk/car-review/aston-martin/vanquish-volante",
  "description": "We (nearly) run out of superlatives to describe Aston’s fastest, most powerful and most expensive open top car It’s 90kg heavier. Anti roll bar stiffness and rear spring rates have been upped by 7%. And the roof goes up and down. There you go. The material differences between the coupe and this Aston Martin Vanquish Volante.Long gone are the days where ripping the roof off ruined the rigidity of a car. The foundational structure, Aston’s chief engineer Simon Newton, reassures me, is basically the same between the regular Aston Martin Vanquish and the Volante. The interior, too, is the same as the regular car, and it continues with that car’s raison d’être. This is a two-tonne bruiser of a super GT-cum-supercar. A 5.2-litre V12-engined £360,000 2.0-metre wide screaming flare that signals “I am doing very well for myself”.",
  "author": "",
  "published": "Wed, 23 Jul 2025 00:01:05 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Murray ScullionDigital editor",
  "length": 9378,
  "excerpt": "We (nearly) run out of superlatives to describe Aston’s fastest, most powerful and most expensive open top car",
  "siteName": "Autocar",
  "favicon": "",
  "text": "It’s 90kg heavier. Anti roll bar stiffness and rear spring rates have been upped by 7%. And the roof goes up and down. There you go. The material differences between the coupe and this Aston Martin Vanquish Volante.Long gone are the days where ripping the roof off ruined the rigidity of a car. The foundational structure, Aston’s chief engineer Simon Newton, reassures me, is basically the same between the regular Aston Martin Vanquish and the Volante. The interior, too, is the same as the regular car, and it continues with that car’s raison d’être. This is a two-tonne bruiser of a super GT-cum-supercar. A 5.2-litre V12-engined £360,000 2.0-metre wide screaming flare that signals “I am doing very well for myself”. Verdict Everything we love about the coupe, just with more drama. GoodEverything we love about the Vanquish - just without a roofHuge power that can be translated to the roadStunning designBadNot cheap, even in this realmA few more niggling issues than a car for this price should haveVery small, impractical boot DESIGN \u0026 STYLING9 Pros Kamm tail, if anything, slightly improved with roof offNear 50:50 weigh distributionFront visibility makes it surprisingly easy to place on the road It’s surprisingly delicate. The roof’s K-fold mechanism (named after its elegant folding procedure) stacks very tightly with a super low lid. So it doesn't ruin the lines of that gorgeous kamm tail rear. Simon says the articulation index (a new one for me - essentially a measure of speech intelligibility) with the roof up is low, which is very good. If I had a passenger with me during my drive I would have found them easy to understand, although they’d likely be a touch annoyed by the squeaking coming from the roof.The weight gain is from underbody bracing, which helps make this roofless Vanquish some 75% stiffer laterally than the DBS Volante it replaces, Simon is also keen to point out. Weight distribution is slightly closer to 50:50 now, too. Pros Feels and looks expensiveGood all-round visibility Cons Ultimately very similar to the VantageLuggage capacity tiny, even for a car of this ilk The interior is basically untouched compared with the regular car. Which means it’s neatly laid out, expensively put together with physical controls for most things. The view out is reassuringly straight forward considering the size of the car.The roof can be opened in 14-seconds and closed in 16-seconds. It works at up to 31mph and can be remotely operated via the key fob too.With the roof closed there’s 219 litres worth of space in the boot - some 29 litres less than the coupe - and with it stowed there’s a mere 187 litres worth. This is tiny. You can just about fit a couple of overnight bags in there and not much else.Elsewhere inside you’ll find the latest Apple CarPlay system, Ultra. Tim Cook’s tentacles now extend from the infotainment screen to the driver’s display. There are a few different design options, all of which are neat and easy to read. Climate controls on the infotainment are controlled by Apple, but Aston Martin also has physical cylindrical rollers that control temp and fan speed. Saying that, the temperature control is permanently synced to the left-hand side of the infotainment screen. It is overlaid everything. Which means if you’re on an app that has some info down the left hand side, let’s say Google Map’s speed warning for instance, you cannot see it. Aston assured me a fix is in the works. ENGINES \u0026 PERFORMANCE9 Pros Huge levels of achievable powerColossal mid-range, theatrical top-end Cons Gearbox could be more precise 824bhp and 738lb ft of torque means 214mph is achievable. The 0-62mph time of 3.4 secs almost seems a bit quaint compared with 1000bhp four-wheel drive EVs of today. Almost.Insanely fast electric cars make it feel like the world is hurtling towards you in a kind of impassive way you have no control over. Whereas with this V12 you are actively dragging everything in front of you behind you Michael Phelps style. Except instead of a wake there is a swell of deep, guttural noise that crescends into a wall. This is from the engine. The noises coming from my mouth were mostly high pitched laughs of fun and joy. Perhaps this being the largest difference between EV and V12 powertrains.Peak bhp doesn’t kick until 6500rpm and when it arrives it hits hard. A clever bit of torque shaping (Aston is loath to call it cutting or throttling) in GT mode helps the power arrive cleanly and linearly through the first four gears. In the racier modes it gets real. Fast. It’s easier than with the old Aston Martin DBS 770 or a Ferrari 812 Superfast but you have to have a bit of bottle to spin it all the way out to its 7000rpm limit on UK roads as the car hunkers down and your hands become busy.The ZF ‘box comes with a bespoke Aston setup. It can be a touch hesitant to kick down. But manual mode means manual and it rifles through your paddle-shift commands cleanly. There’s no knack to these carbon-ceramic discs either; no bite to get through or squeaks and judders to contend with. Just hugely impressive and easy braking force. The kind of brakes you get used to after a few hours in the car, and need a bit of time to adjust back to regular cars after. RIDE \u0026 HANDLING9 Pros A ride so good, even in its harshest setting it can be used on UK roadsFantastically resolute handling Cons Slightly too firm at low speeds The drive modes play a good part in this car’s ride. GT is pure plush. Lots of squidge and travel from the suspension. In its raciest mode, Sport +, things get stiffer and more rampant. Yet, it’s a drive mode that is still genuinely usable in the right circumstances on UK roads.OK I wouldn’t use it on a tight, single lane road, but on the right A-road (preferably something with very few blemishes!) It feels good. Tight, responsive, entertaining, furiously quick, but with a ride that won’t give you backache. Makers of try-hard hot hatches, take note.Steering is exceptional. Some might complain that it is not quite up to Ferrari standards of response. But if you’re the type of person who thinks having things a touch slower makes it more measured and easier to control, you’ll get on with the Vanquish very well. The electronically controlled Bosch diff comes in early but is subtle in its workings. It is certainly flattering. Verdict Everything we love about the coupe, just with more drama. GoodEverything we love about the Vanquish - just without a roofHuge power that can be translated to the roadStunning designBadNot cheap, even in this realmA few more niggling issues than a car for this price should haveVery small, impractical boot Sadly, the Volante is one of these cars that sounds better from outside than in, probably not helped by just a touch of augmented sound scaping in the car. The boot is tiny. And while the interior is expensively crafted, there’s no getting round the fact it’s much the same as a Vantage. There’s about a £15,000 walk up from the Coupe and £360,000-£400,000 is a lot of money for a car. Even for billionaires. Especially one with a few annoying foibles. But really I’m nitpicking now because it is wonderful. Murray Scullion Title: Digital editor Murray has been a journalist for more than a decade. During that time he’s written for magazines, newspapers and websites, but he now finds himself as Autocar’s digital editor. He leads the output of the website and contributes to all other digital aspects, including the social media channels, podcasts and videos. During his time he has reviewed cars ranging from £50 - £500,000, including Austin Allegros and Ferrari 812 Superfasts. He has also interviewed F1 megastars, knows his PCPs from his HPs and has written, researched and experimented with behavioural surplus and driverless technology. Murray graduated from the University of Derby with a BA in Journalism in 2014 and has previously written for Classic Car Weekly, Modern Classics Magazine, buyacar.co.uk, parkers.co.uk and CAR Magazine, as well as carmagazine.co.uk. NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/aston-martin-vanquish-volante-review-2025-001.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \n    \u003cdiv\u003e\n                                \u003cdiv\u003e\u003cp\u003eIt’s 90kg heavier. Anti roll bar stiffness and rear spring rates have been upped by 7%. And the roof goes up and down. There you go. The material differences between the coupe and this \u003cstrong\u003eAston Martin Vanquish Volante\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eLong gone are the days where ripping the roof off ruined the rigidity of a car. The foundational structure, Aston’s chief engineer Simon Newton, reassures me, is basically the same between the regular \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/vanquish\"\u003eAston Martin Vanquish\u003c/a\u003e and the Volante. \u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThe interior, too, is the same as the regular car, and it continues with that car’s raison d’être. This is a two-tonne bruiser of a super GT-cum-supercar. A 5.2-litre V12-engined £360,000 2.0-metre wide screaming flare that signals “I am doing very well for myself”.\u003c/p\u003e\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eEverything we love about the coupe, just with more drama.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eEverything we love about the Vanquish - just without a roof\u003c/p\u003e\u003cp\u003eHuge power that can be translated to the road\u003c/p\u003e\u003cp\u003eStunning design\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eNot cheap, even in this realm\u003c/p\u003e\u003cp\u003eA few more niggling issues than a car for this price should have\u003c/p\u003e\u003cp\u003eVery small, impractical boot\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n                              \u003c/div\u003e\n\n        \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n                                            \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eKamm tail, if anything, slightly improved with roof off\u003c/p\u003e\u003cp\u003eNear 50:50 weigh distribution\u003c/p\u003e\u003cp\u003eFront visibility makes it surprisingly easy to place on the road\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eIt’s surprisingly delicate. The roof’s K-fold mechanism (named after its elegant folding procedure) stacks very tightly with a super low lid. So it doesn\u0026#39;t ruin the lines of that gorgeous kamm tail rear. \u003c/p\u003e\u003cp\u003eSimon says the articulation index (a new one for me - essentially a measure of speech intelligibility) with the roof up is low, which is very good. If I had a passenger with me during my drive I would have found them easy to understand, although they’d likely be a touch annoyed by the squeaking coming from the roof.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThe weight gain is from underbody bracing, which helps make this roofless Vanquish some 75% stiffer laterally than the DBS Volante it replaces, Simon is also keen to point out. Weight distribution is slightly closer to 50:50 now, too.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" height=\"600\" src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/aston-martin-vanquish-volante-review-2025-005_0.jpg?itok=_nUlACqa\" width=\"900\"/\u003e\u003c/p\u003e\u003c/div\u003e\n                                          \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eFeels and looks expensive\u003c/p\u003e\u003cp\u003eGood all-round visibility\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eUltimately very similar to the Vantage\u003c/p\u003e\u003cp\u003eLuggage capacity tiny, even for a car of this ilk\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eThe interior is basically untouched compared with the regular car. Which means it’s neatly laid out, expensively put together with physical controls for most things. The view out is reassuringly straight forward considering the size of the car.\u003c/p\u003e\u003cp\u003eThe roof can be opened in 14-seconds and closed in 16-seconds. It works at up to 31mph and can be remotely operated via the key fob too.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eWith the roof closed there’s 219 litres worth of space in the boot - some 29 litres less than the coupe - and with it stowed there’s a mere 187 litres worth. This is tiny. You can just about fit a couple of overnight bags in there and not much else.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" height=\"600\" src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/aston-martin-vanquish-volante-review-2025-014_0.jpg?itok=hfXvoQRv\" width=\"900\"/\u003e\u003c/p\u003e\u003cp\u003eElsewhere inside you’ll find the latest \u003ca href=\"https://www.autocar.co.uk/car-news/consumer/what-apple-carplay-and-how-does-it-work\"\u003eApple CarPlay\u003c/a\u003e system, Ultra. Tim Cook’s tentacles now extend from the infotainment screen to the driver’s display. There are a few different design options, all of which are neat and easy to read. \u003c/p\u003e\u003cp\u003eClimate controls on the infotainment are controlled by Apple, but \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin\"\u003eAston Martin\u003c/a\u003e also has physical cylindrical rollers that control temp and fan speed. Saying that, the temperature control is permanently synced to the left-hand side of the infotainment screen. It is overlaid everything. Which means if you’re on an app that has some info down the left hand side, let’s say Google Map’s speed warning for instance, you cannot see it. Aston assured me a fix is in the works.\u003c/p\u003e\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eHuge levels of achievable power\u003c/p\u003e\u003cp\u003eColossal mid-range, theatrical top-end\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eGearbox could be more precise\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" height=\"600\" src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/aston-martin-vanquish-volante-review-2025-022.jpg?itok=2E3HqdV_\" width=\"900\"/\u003e\u003c/p\u003e\u003cp\u003e824bhp and 738lb ft of torque means 214mph is achievable. The 0-62mph time of 3.4 secs almost seems a bit quaint compared with 1000bhp four-wheel drive EVs of today. Almost.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eInsanely fast \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-electric-cars\"\u003eelectric cars\u003c/a\u003e make it feel like the world is hurtling towards you in a kind of impassive way you have no control over. Whereas with this V12 you are actively dragging everything in front of you behind you Michael Phelps style. Except instead of a wake there is a swell of deep, guttural noise that crescends into a wall. This is from the engine. The noises coming from my mouth were mostly high pitched laughs of fun and joy. Perhaps this being the largest difference between EV and V12 powertrains.\u003c/p\u003e\u003cp\u003ePeak bhp doesn’t kick until 6500rpm and when it arrives it hits hard. A clever bit of torque shaping (Aston is loath to call it cutting or throttling) in GT mode helps the power arrive cleanly and linearly through the first four gears. \u003c/p\u003e\u003cp\u003eIn the racier modes it gets real. Fast. It’s easier than with the old \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/dbs-770-ultimate-2023-2024\"\u003eAston Martin DBS 770\u003c/a\u003e or a \u003ca href=\"https://www.autocar.co.uk/car-review/ferrari/812-superfast\"\u003eFerrari 812 Superfast\u003c/a\u003e but you have to have a bit of bottle to spin it all the way out to its 7000rpm limit on UK roads as the car hunkers down and your hands become busy.\u003c/p\u003e\u003cp\u003eThe ZF ‘box comes with a bespoke Aston setup. It can be a touch hesitant to kick down. But manual mode means manual and it rifles through your paddle-shift commands cleanly. There’s no knack to these carbon-ceramic discs either; no bite to get through or squeaks and judders to contend with. Just hugely impressive and easy braking force. The kind of brakes you get used to after a few hours in the car, and need a bit of time to adjust back to regular cars after.\u003c/p\u003e\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\u003cdiv data-id=\"ride\" id=\"chapter-ride\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eRIDE \u0026amp; HANDLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eA ride so good, even in its harshest setting it can be used on UK roads\u003c/p\u003e\u003cp\u003eFantastically resolute handling\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eSlightly too firm at low speeds\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eThe drive modes play a good part in this car’s ride. GT is pure plush. Lots of squidge and travel from the suspension. In its raciest mode, Sport +, things get stiffer and more rampant. Yet, it’s a drive mode that is still genuinely usable in the right circumstances on UK roads.\u003c/p\u003e\u003cp\u003eOK I wouldn’t use it on a tight, single lane road, but on the right A-road (preferably something with very few blemishes!) It feels good. Tight, responsive, entertaining, furiously quick, but with a ride that won’t give you backache. Makers of try-hard hot hatches, take note.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eSteering is exceptional. Some might complain that it is not quite up to Ferrari standards of response. But if you’re the type of person who thinks having things a touch slower makes it more measured and easier to control, you’ll get on with the Vanquish very well. The electronically controlled Bosch diff comes in early but is subtle in its workings. It is certainly flattering.\u003c/p\u003e\u003c/div\u003e\n                                                      \u003c/div\u003e\n \n\n \n\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n         \u003cdiv\u003e\n                                    \n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eEverything we love about the coupe, just with more drama.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eEverything we love about the Vanquish - just without a roof\u003c/p\u003e\u003cp\u003eHuge power that can be translated to the road\u003c/p\u003e\u003cp\u003eStunning design\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eNot cheap, even in this realm\u003c/p\u003e\u003cp\u003eA few more niggling issues than a car for this price should have\u003c/p\u003e\u003cp\u003eVery small, impractical boot\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eSadly, the Volante is one of these cars that sounds better from outside than in, probably not helped by just a touch of augmented sound scaping in the car. The boot is tiny. And while the interior is expensively crafted, there’s no getting round the fact it’s much the same as a Vantage. \u003c/p\u003e\u003cp\u003eThere’s about a £15,000 walk up from the Coupe and £360,000-£400,000 is a lot of money for a car. Even for billionaires. Especially one with a few annoying foibles. \u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eBut really I’m nitpicking now because it is wonderful.\u003c/p\u003e\u003c/div\u003e\n                                                    \u003c/div\u003e\n                      \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/murray-scullion\"\u003eMurray Scullion\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/murray-scullion\"\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/murray-scullion-mug.jpg\" width=\"1600\" height=\"1600\" alt=\"Murray Scullion\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eDigital editor\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eMurray has been a journalist for more than a decade. During that time he’s written for magazines, newspapers and websites, but he now finds himself as Autocar’s digital editor.\u003c/p\u003e\n\u003cp\u003eHe leads the output of the website and contributes to all other digital aspects, including the social media channels, podcasts and videos. During his time he has reviewed cars ranging from £50 - £500,000, including Austin Allegros and Ferrari 812 Superfasts. He has also interviewed F1 megastars, knows his PCPs from his HPs and has written, researched and experimented with behavioural surplus and driverless technology.\u003c/p\u003e\n\u003cp\u003eMurray graduated from the University of Derby with a BA in Journalism in 2014 and has previously written for Classic Car Weekly, Modern Classics Magazine, buyacar.co.uk, parkers.co.uk and CAR Magazine, as well as carmagazine.co.uk.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n                            \u003c/div\u003e\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": null,
  "modifiedTime": null
}
