{
  "id": "323a4990-7725-4f7d-8576-98d510e08ee0",
  "title": "The best MPVs and people carriers – driven and tested",
  "link": "https://www.autocar.co.uk/car-news/best-cars/best-mpv-people-carriers",
  "description": "The best way to haul people and cargo is still with an MPV. These are the best ones currently on sale Multi-purpose vehicles (MPVs) are among the most versatile forms of transport you can find, majoring on space, practicality and people-carrying.  One of their biggest selling points is their extremely efficient use of space, which means they're often better value than vehicles with a similar footprint. But don't think MPVs are lacking in other areas. They're packed with clever and handy features that reduce the stress of transporting families, often to better effect than some of the best SUVs.  Generally speaking, MPVs feature up to seven seats, but the sector also includes five-seat models. Some even go up to nine seats. With SUVs continuing to surge ahead in the sales charts, though, the number of people carriers on sale in the UK is dropping. We've lost the Ford S-Max, Ford Galaxy and Volkswagen Sharan in the past few years, but don't worry: the MPV hasn’t slipped into obscurity just yet. Our top MPV pick is the Dacia Jogger, which offers by far the best value for money and supreme practicality. But which other models should you consider buying? Read on to find out about the top 10 MPVs and people carriers...",
  "author": "",
  "published": "Mon, 28 Apr 2025 16:15:00 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "by Jack Warrick",
  "length": 19553,
  "excerpt": "The best way to haul people and cargo is still with an MPV. These are the best ones currently on sale",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The best MPVs and people carriers – driven and tested The best way to haul people and cargo is still with an MPV. These are the best ones currently on sale Close Multi-purpose vehicles (MPVs) are among the most versatile forms of transport you can find, majoring on space, practicality and people-carrying.  One of their biggest selling points is their extremely efficient use of space, which means they're often better value than vehicles with a similar footprint. But don't think MPVs are lacking in other areas. They're packed with clever and handy features that reduce the stress of transporting families, often to better effect than some of the best SUVs.  Generally speaking, MPVs feature up to seven seats, but the sector also includes five-seat models. Some even go up to nine seats. With SUVs continuing to surge ahead in the sales charts, though, the number of people carriers on sale in the UK is dropping. We've lost the Ford S-Max, Ford Galaxy and Volkswagen Sharan in the past few years, but don't worry: the MPV hasn’t slipped into obscurity just yet. Our top MPV pick is the Dacia Jogger, which offers by far the best value for money and supreme practicality. But which other models should you consider buying? Read on to find out about the top 10 MPVs and people carriers... Design8Interior8Performance7Ride \u0026 Handling8Costs9 Pros Outstandingly good valueVersatile and practical for its sizeSurprisingly agile at lower speeds Cons Powertrain has its rougher, lazier momentsLimited engine rangeInterior can feel cheap Best for: Value for moneyAmid a flood of more premium options that have supreme badge appeal, the Dacia Jogger stands at the top of the pile as the best MPV on sale today.The Jogger is a genuine seven-seat family car that you can buy new for less than £15,000. But there’s so much more to this versatile machine than its bargain-basement price.It offers five decent-sized seats and a couple of more kiddy-sized ones in the boot, but the latter can easily be lifted out entirely when you've got big loads to carry.Dacia's MPV is arguably all the car your family would ever need. It can be had with hybrid power too, if you want to save even more cash on running costs. Performance, ride and handling are all as capable as you'd expect, although you'll encounter comical levels of body roll if you push too hard. Regardless, there hasn't been a new MPV with the potential to rejuvenate interest in this flagging class for a decade or more, but the Jogger's value alone could do that.Finance this car with Drivenfi Design8Interior8Performance7Ride \u0026 Handling7Costs8 Pros Massive boot and lots of storageComfortable to driveSliding doors Cons Not as sharp as many large SUVsCheap-feeling interiorShort electric range Best for: Interior spaceMore than two decades and almost two million sales ago, Citroën pioneered the van-based MPV with the Berlingo, and this latest (but only third-generation) model returns to the original's charm and oddball likeability.What’s more, its appeal has recently been enhanced by Citroën’s reversal of its decision to drop petrol and diesel versions. Both the 1.2-litre petrol and 1.5-diesel have been reinstated, albeit only in the five-seat bodystyle. If you need the seven seats that the longer XL version provides, then you’re restricted to the 134bhp electric powertrain with its 50kWh battery, which provides a realistic range of around 110 miles.Whatever the motive force, there are stout reasons to buy a Berlingo instead of a more conventional MPV. The interior is truly cavernous, with 186 litres of storage space dotted about it. The sliding doors are also a great feature.Best of all, the Berlingo rides with a languid calmness and steers intuitively, making it a relaxing companion regardless of the quality or type of road. Finance this car with DrivenfiDesign8Interior9Performance8Ride \u0026 Handling7Costs7 Pros Versatile interiorGreat look and feel insideVery easy to place, given its size Cons Fiddly infotainment systemSome rattles and resonancesDefaults to ‘electric’ mode on every start Best for: Interior versatility Here's another van-based MPV, but this is a full-sized one that’s perfect for the largest of families. Based on VW’s new T7, the Multivan is arguably the most stylish and car-like version to appear in ‘T’ history, which can trace its roots back nearly 80 years.Underpinned by the brand’s MQB architecture rather than a dedicated commercial vehicle platform, the T7 drives with all the assurance, comfort and refinement of a very large Golf. The steering is accurate, body control is good and the ride is pliant.  This is backed up by a punchy engine line-up that runs to a 1.5-litre petrol and 2.0-litre diesel, plus the 2.0-litre TSI petrol from the Golf GTI. There’s also a plug-in hybrid, complete with a claimed EV range of 31 miles, and sliding doors. Inside, the Multivan is simply vast and offers the sort of flexibility that other MPVs can only dream of. There are seven individual seats (you can have fewer if you wish) and the ones in the back slide, swivel and fold.Remove the chairs (at 15kg apiece, they ain’t light) and you can run a removal service at the weekend.The Multivan is a spacious, comfortable and brilliantly sorted people carrier. But with prices starting at just over £40,000 and rising to within an uncomfortable biscuit of £70,000, so it should be.Finance this car with Drivenfi Design9Interior8Performance8Ride \u0026 Handling8Costs7 Pros Comfort and passenger spaceRefinement and touring mannersJust enough Type 2 charms Cons High priceLacks clever cabin modularityIt could certainly be smaller Best for: CharacterThe Volkswagen ID Buzz was one of the industry’s most hotly anticipated vehicles before it arrived. It sits on the Volkswagen Group’s MEB platform, which means this big bus shares the same underpinnings as the ID 3, ID 4 and ID 5. Similarly to the Multivan, the ID Buzz is more of a car, rather than an actual van. In fact, the Buzz has been available since launch as a five-seat passenger car and as a 2+1 Cargo commercial vehicle variant. A seven-seat long-wheelbase version with a larger, 110kWh battery has been available since mid-2024 too, improving its versatility further.The regular-wheelbase models have a 77kWh battery for an official range of 255 miles – not the highest figure in the world, but a maximum charging speed of 170kW makes top-ups quick. Entry-level Buzz models are driven by a single 201bhp electric motor, but a GTX variant adds a second motor for all-wheel drive and a combined 335bhp. Whether you’re a devotee of Volkswagen’s traditional camper van or after a conventional people carrier, the Buzz offers a likeable package of versatility-first electric family motoring. Finance this car with DrivenfiDesign8Interior8Performance8Ride \u0026 Handling8Costs8 Pros Airy and spacious interiorSeats can be removed for van-like cargo spaceCheaper than many options on this list Cons Poor infotainmentRide is prone to thumpingIneffective touchpad climate control Best for: HandlingA replacement for the previous Focus-based Connect, the Ford Tourneo Custom picks up where its highly underrated predecessor left off. That car delivered Berlingo-style space and utility with genuine dynamic polish, and the latest version is no different.Based on VW’s MQB platform, the Tourneo has been tuned by Ford’s engineers to give it a poised and plush feel that allows it to scythe through corners as effortlessly as it soaks up bumps.As before, there’s a choice of two bodystyles: a standard five-seater and a longer (Grand Tourneo) seven-seat option. Both deliver acres of interior space and loads of handy storage, while the sliding rear side doors boost an already versatile package.Go for the seven-seat version and, with both rear benches removed, there’s a cavernous 3100 litres of carrying capacity. If you’d rather have a VW badge on the nose, then there’s also the Caddy version.Finance this car with Drivenfi Design7Interior8Performance7Ride \u0026 Handling8Costs7 Pros A good, versatile all-rounder Great practicalitySingular engine option is a good one Cons It's very old now and lacks characterEngine line-up has shrunk over the yearsIt's quite expensive Best for: Daily drivingThe Touran feels like a car formed from the very core of the MPV textbook, having been created to deliver great occupant space inside a fairly compact footprint. It can’t quite match the BMW 2 Series Active Tourer for premium-brand allure or driver appeal and it also lacks a bit of charm in its design. But like all great VWs, it's functional in all respects, offering a versatile and pretty roomy seven-seat cabin without the risk of it dwarfing your three-bed semi.VW only offers the Touran with its 1.5-litre TSI Evo petrol engine, which develops 148bhp yet hauls the car along easily enough and with creditable refinement and decent economy. Handling is neat, contained and comfortable.The Touran scores at least eight out of 10 in every department, making it a strong all-rounder.Finance this car with DrivenfiDesign7Interior8Performance8Ride \u0026 Handling8Costs8 Pros Excellent build qualityVery spaciousClassy and composed to drive Cons No longer offers the option of seven seatsSteeling lacks any sort of feelNot cheap Best for: Technology It’s somewhat surprising that in such a declining sector, premium player BMW has stuck by the MPV.In fact, the latest 2 Series Active Tourer isn’t a facelift of the previous model but an all-new vehicle built on the current 1 Series platform. And the result is a classy and composed hatchback that offers a decent dose of extra practicality.The old seven-seat Gran Tourer has been dropped, so it’s only this five-seat model that remains. Sitting within a footprint not much larger than a 1 Series, it serves up plenty of space for most growing families, with generous room in the rear, where a sliding bench allows you to choose between extra space for luggage or legs. As you’d expect, the fit and finish is excellent, plus the 2 Series gets the brand’s latest slick infotainment and advanced driver aids. It feels like a BMW on the move too, with just enough agility and engagement to satisfy your inner keen driver. There’s a pair of smooth and responsive 48V mild-hybrid petrols and a 218d diesel, plus the option of the four-wheel-drive 225e and 230e plug-in hybrids. The 230e offers a hot-hatch-humbling 322bhp while both plug-in hybrids claim an impressive 56 miles of EV range for an 8% company car tax banding.Finance this car with Drivenfi Design4Interior7Performance7Ride \u0026 Handling7Costs5 Pros Up to nine seatsIncredible spaceVan and passenger car bodystyles Cons Feels a bit too much like a van to driveCheap-feeling interiorPoor PHEV range Best for: Load-luggingIf maximising the amount of space and passenger-carrying capacity is your top priority, you need to be looking at the passenger versions of medium-sized vans.The best van to drive is the Ford Transit Custom and the Tourneo Custom is the same but made more habitable for carrying passengers.One of our photographers ran a Ford Tourneo Custom PHEV for six months and found that the versatility fitted his lifestyle perfectly, and while it was never going to rival a Focus for driver appeal, it never felt like a chore to drive, either.We’d recommend a conventional diesel, though, because the pure-electric range of the PHEV is a paltry 30 miles.Finance this car with DrivenfiDesign7Interior8Performance7Ride \u0026 Handling7Costs6 Pros Extremely quiet and smoothNicely weighted and very accurate steeringLooks the part Cons Size means it's a little more sluggish off the mark than most EVsBouncy ride on UK roadsPrices start from around £75,000. Yikes Best for: StyleMercedes has got the all-electric seven-seater market pretty well served between the EQB and this, the larger and more expensive EQV.Effectively an electric V-Class, this is a big, tall, van-like vehicle with sliding side doors and captain's chairs in the second row that can spin to face either forwards or backwards.It's powered by a 204bhp electric motor and has a usable range of just over 200 miles. And with air suspension and plenty of mass rolling along, it's quiet and comfortable, and handles well for something so large and heavy.You'd be lucky to pick up an airport transfer in an EQV – and, allowing for the tax advantages, your chauffeur would be pretty happy to run one, assuming they have easy access to a charger.Finance this car with Drivenfi Design7Interior10Performance4Ride \u0026 Handling7Costs8 Pros Genuinely opulent rear-seat space and lounging potentialHigh-material quality and tactile appeal of cabinVery luxurious Cons Engine can struggle with the LM's 2.3-tonne kerb weightNot as comfortable as it should beThose looks Best for: LuxuryThe Lexus LM is exactly the sort of posh MPV you’d expect to see transporting the wealthy from one central London black-tie ball to another.Starting from £89,995, it’s the most expensive MPV on this list by a considerable margin, but it’s easy to see why once you step inside. The LM’s interior has been designed for old-school luxury, and it certainly feels special.The rear seats are airline-style recliners with heating and ventilation functions, and there are even seven massage functions, footrests and cushions. You can also lay the seats flat and use them as a sleeping area. Not enough? You’ll be interested in the 48in television, then. And if the TV is a bit old-school for you, you can use the LM’s phone-sized touchscreen to control all media functions and top up your phone's battery using the wireless phone charger hidden in the armrest. Other hotel room functions include a fridge and shoe storage.The LM isn’t the best to drive – or anywhere near it. It’s powered by a 2.5-litre four-cylinder petrol engine, paired with either a single electric motor or a twin-motor set-up. Both specifications struggle with the weight of the LM, and it often feels slow, unresponsive and generally underpowered. It’s also surprisingly noisy and isn’t quite refined enough. Finance this car with DrivenfiHOW TO CHOOSE THE BEST MPV When choosing the best MPV, you'll likely be on the hunt for practicality, space and the ability to carry as many passengers as possible. Drivers should consider these factors when selecting their choice MPV. HOW WE TESTED AND SELECTEDOur experienced team of road testers has driven each of the cars on this list and ranked them based on several factors, including ride, handling, performance, and economy. FAQs What is an MPV? A multipurpose vehicle (MPV) is a car that excels in versatility. They're the best option for people carrying, load-lugging and families, offering excellent all-round interior space. MPVs are often overlooked in place of SUVs, but they're more spacious, can be equipped with more seats and benefit from a higher number of storage compartments. What's not to like? How is an MPV different from an SUV? While both MPVs and SUVs can carry multiple passengers, the main differences between the two are: MPVs are typically more spacious inside, with better options for adjusting seats and maximizing interior volume. SUVs also generally have higher ground clearance and may offer off-road capabilities. MPVs focus more on comfort and practicality, while SUVs tend to emphasize performance and style. What are the seating configurations in MPVs? The number of seats in. an MPV can vary. Generally speaking, they have between five and seven seats, although some more expensive and larger options can have up to nine seats. In a standard seven-seater, they're usually organised in a 2+3+2 formation - that's two seats in the front, three in the middle row and two at the rear. While the second row of seats is often a standard seating arrangement, the rearmost, third row is often a bench seat, which can fold down or be removed completely in some models for a cavernous cargo space What's the biggest MPV on sale in the UK today? Lots of MPVs pride themselves on offering more space than the competition, but few will offer more room than the Ford Tourneo Custom. Ford's minivan offers up to 1200 litres of cargo space in L1 specification, rising to 1900 litres for the larger L2 model. The Tourneo can have up to nine seats, laid out in a 3+3+3 organisation, and there's plenty of room for passengers of all heights.      Is there an electric MPV? While the number of MPVs might be generally dwindling, the number of electric options on sale is growing. Some of the biggest brands in the UK offer MPVs with EV-only power, including Ford, Citroen, Mercedes and Volkswagen.  Some options appear in our top ten list, but our highest recommendations include the Volkswagen ID Buzz, Ford Tourneo Custom and Tourneo Connect, the Citroen e-Berlingo (or it's Stellantis stablemates from Vauxhall and Peugeot), and the Mercedes EQV.  Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. used Dacia Jogger cars for sale In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/autocar_best_mpvs_and_people_carriers.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \n\n  \u003cp\u003e\n\n    \n    \n    \n          \u003ch2 itemprop=\"name\"\u003eThe best MPVs and people carriers – driven and tested\u003c/h2\u003e    \n    \n    \n  \u003c/p\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cp\u003e\u003ch2\u003eThe best way to haul people and cargo is still with an MPV. These are the best ones currently on sale\u003c/h2\u003e\n\u003c/p\u003e\n  \n  \u003c/div\u003e\n    \u003c/div\u003e\u003cdiv\u003e\n  \n    \u003cdiv\u003e\n              \u003cdiv id=\"carousel-wrapper\"\u003e\n    \u003cdiv id=\"sitewide-slider\"\u003e\u003cul\u003e\u003cli\u003e\n      \u003cp\u003e\u003cimg fetchpriority=\"high\" src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/gallery_slide/public/images/car-reviews/first-drives/legacy/autocar_best_mpvs_and_people_carriers.jpg?itok=nvnoFzAp\" data-src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/gallery_slide/public/images/car-reviews/first-drives/legacy/autocar_best_mpvs_and_people_carriers.jpg?itok=nvnoFzAp\" width=\"1200\" height=\"795\" alt=\"Autocar best MPVs and people carriers\" title=\"Autocar best MPVs and people carriers\"/\u003e    \u003c/p\u003e\n      \u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e    \u003cp\u003eClose\u003c/p\u003e\n  \u003c/div\u003e\n                    \u003cdiv\u003e\n                              \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/square_43x43/public/headshot_web.jpg?itok=if7W0tQC\" title=\"Jack Warrick\" alt=\"Jack Warrick\"/\u003e\n  \n  \u003c/p\u003e\n\n\u003c/div\u003e\n                                            \u003cdiv\u003e\n\u003cp\u003eMulti-purpose vehicles (MPVs) are among the most versatile forms of transport you can find, majoring on\u003cspan\u003e space, p\u003c/span\u003e\u003cspan\u003eracticality and people-carrying.\u003c/span\u003e \u003c/p\u003e\n\u003cp\u003eOne of their biggest selling points is their extremely efficient use of space, which means they\u0026#39;re often better value than vehicles with a similar footprint.\u003c/p\u003e\n\u003cp\u003eBut don\u0026#39;t think MPVs are lacking in other areas. They\u0026#39;re packed with clever and handy features that reduce the stress of transporting families, often to better effect than some of the \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-suvs\"\u003ebest SUVs\u003c/a\u003e. \u003c/p\u003e\n\n\u003cp\u003eGenerally speaking, MPVs feature up to seven seats, but the sector also includes five-seat models. Some even go up to nine seats.\u003c/p\u003e\n\u003cp\u003eWith \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-suvs\"\u003eSUVs\u003c/a\u003e continuing to surge ahead in the sales charts, though, the number of people carriers on sale in the UK is dropping.\u003c/p\u003e\n\u003cp\u003eWe\u0026#39;ve lost the \u003ca href=\"https://www.autocar.co.uk/car-review/ford/s-max\"\u003eFord S-Max\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/ford/galaxy\"\u003eFord Galaxy\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/volkswagen/sharan-2010-2021\"\u003eVolkswagen Sharan\u003c/a\u003e in the past few years, but don\u0026#39;t worry: the MPV hasn’t slipped into obscurity just yet.\u003c/p\u003e\n\u003cp\u003eOur top MPV pick is the \u003ca href=\"https://www.autocar.co.uk/car-review/dacia/jogger\"\u003eDacia Jogger\u003c/a\u003e, which offers by far the best value for money and supreme practicality. But which other models should you consider buying? Read on to find out about the top 10 MPVs and people carriers...\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cblock\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/best_estates_and_mpvs_-_dacia_jogger.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eOutstandingly good value\u003c/p\u003e\u003cp\u003eVersatile and practical for its size\u003c/p\u003e\u003cp\u003eSurprisingly agile at lower speeds\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003ePowertrain has its rougher, lazier moments\u003c/p\u003e\u003cp\u003eLimited engine range\u003c/p\u003e\u003cp\u003eInterior can feel cheap\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eValue for money\u003c/p\u003e\u003cp\u003eAmid a flood of more premium options that have supreme badge appeal, the Dacia Jogger stands at the top of the pile as the best MPV on sale today.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThe Jogger is a genuine seven-seat family car that you can buy new for less than £15,000. But there’s so much more to this versatile machine than its bargain-basement price.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt offers five decent-sized seats and a couple of more kiddy-sized ones in the boot, but the latter can easily be lifted out entirely when you\u0026#39;ve got big loads to carry.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eDacia\u0026#39;s MPV is arguably all the car your family would ever need. It can be had with hybrid power too, if you want to save even more cash on running costs. \u003c/p\u003e\u003cp\u003ePerformance, ride and handling are all as capable as you\u0026#39;d expect, although you\u0026#39;ll encounter comical levels of body roll \u003cspan\u003eif you push too hard\u003c/span\u003e. \u003c/p\u003e\u003cp\u003eRegardless, there hasn\u0026#39;t been a new MPV with the potential to rejuvenate interest in this flagging class for a decade or more, but the Jogger\u0026#39;s value alone could do that.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/block\u003e\u003c/div\u003e                                          \u003c/div\u003e\n          \n          \n                    \n        \u003c/div\u003e\n\n        \n  \n        \n      \u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/best_mpvs_and_people_carriers_-_citroen_berlingo.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eMassive boot and lots of storage\u003c/p\u003e\u003cp\u003eComfortable to drive\u003c/p\u003e\u003cp\u003eSliding doors\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eNot as sharp as many large SUVs\u003c/p\u003e\u003cp\u003eCheap-feeling interior\u003c/p\u003e\u003cp\u003eShort electric range\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eInterior space\u003c/p\u003e\u003cp\u003eMore than two decades and almost two million sales ago, Citroën pioneered the van-based MPV with the Berlingo, and this latest (but only third-generation) model returns to the original\u0026#39;s charm and oddball likeability.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eWhat’s more, its appeal has recently been enhanced by Citroën’s reversal of its decision to drop petrol and diesel versions. \u003c/p\u003e\u003cp\u003eBoth the 1.2-litre petrol and 1.5-diesel have been reinstated, albeit only in the five-seat bodystyle. If you need the seven seats that the longer XL version provides, then you’re restricted to the 134bhp electric powertrain with its 50kWh battery, which provides a realistic range of around 110 miles.\u003c/p\u003e\u003cp\u003eWhatever the motive force, there are stout reasons to buy a Berlingo instead of a more conventional MPV. The interior is truly cavernous, with 186 litres of storage space dotted about it. The sliding doors are also a great feature.\u003c/p\u003e\u003cp\u003eBest of all, the Berlingo rides with a languid calmness and steers intuitively, making it a relaxing companion regardless of the quality or type of road. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/01-volkswagen-multivan-rt-2023-lead-driving_0.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eVersatile interior\u003c/p\u003e\u003cp\u003eGreat look and feel inside\u003c/p\u003e\u003cp\u003eVery easy to place, given its size\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eFiddly infotainment system\u003c/p\u003e\u003cp\u003eSome rattles and resonances\u003c/p\u003e\u003cp\u003eDefaults to ‘electric’ mode on every start\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eInterior versatility\u003cstrong\u003e \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eHere\u0026#39;s another van-based MPV, but this is a full-sized one that’s perfect for the largest of families. Based on VW’s new T7, the Multivan is arguably the most stylish and car-like version to appear in ‘T’ history, which can trace its roots back nearly 80 years.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eUnderpinned by the brand’s MQB architecture rather than a dedicated commercial vehicle platform, the T7 drives with all the assurance, comfort and refinement of a very large Golf. The steering is accurate, body control is good and the ride is pliant. \u003c/p\u003e\u003cp\u003e This is backed up by a punchy engine line-up that runs to a 1.5-litre petrol and 2.0-litre diesel, plus the 2.0-litre TSI petrol from the Golf GTI. \u003cspan\u003eThere’s also a plug-in hybrid, complete with a claimed EV range of 31 miles, and sliding doors. \u003c/span\u003e\u003c/p\u003e\u003cp\u003eInside, the Multivan is simply vast and offers the sort of flexibility that other MPVs can only dream of. There are seven individual seats (you can have fewer if you wish) and the ones in the back slide, swivel and fold.\u003c/p\u003e\u003cp\u003eRemove the chairs (at 15kg apiece, they ain’t light) and you can run a removal service at the weekend.\u003c/p\u003e\u003cp\u003eThe Multivan is a spacious, comfortable and brilliantly sorted people carrier. But with prices starting at just over £40,000 and rising to within an uncomfortable biscuit of £70,000, so it should be.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e          \u003c/div\u003e\n        \n      \u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/01-vw-id-buzz-rt-2023-lead-driving_1.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eComfort and passenger space\u003c/p\u003e\u003cp\u003eRefinement and touring manners\u003c/p\u003e\u003cp\u003eJust enough Type 2 charms\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eHigh price\u003c/p\u003e\u003cp\u003eLacks clever cabin modularity\u003c/p\u003e\u003cp\u003eIt could certainly be smaller\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eCharacter\u003c/p\u003e\u003cp\u003eThe Volkswagen ID Buzz was one of the industry’s most hotly anticipated vehicles before it arrived. \u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eIt sits on the Volkswagen Group’s MEB platform, which means this big bus shares the same underpinnings as the ID 3, ID 4 and ID 5. Similarly to the Multivan, the ID Buzz is more of a car, rather than an actual van. \u003c/p\u003e\u003cp\u003eIn fact, the Buzz has been available since launch as a five-seat passenger car and as a 2+1 Cargo commercial vehicle variant. A seven-seat long-wheelbase version with a larger, \u003cspan\u003e110kWh battery has been available since\u003c/span\u003e mid-2024 too, improving its versatility further.\u003c/p\u003e\u003cp\u003eThe regular-wheelbase models have a 77kWh battery for an official range of 255 miles – not the highest figure in the world, but a maximum charging speed of 170kW makes top-ups quick. \u003c/p\u003e\u003cp\u003eEntry-level Buzz models are driven by a single 201bhp electric motor, but a GTX variant adds a second motor for all-wheel drive and a combined 335bhp. \u003c/p\u003e\u003cp\u003eWhether you’re a devotee of Volkswagen’s traditional camper van or after a conventional people carrier, the Buzz offers a likeable package of versatility-first electric family motoring. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/ford-tourneo-36-front-tracking_1.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eAiry and spacious interior\u003c/p\u003e\u003cp\u003eSeats can be removed for van-like cargo space\u003c/p\u003e\u003cp\u003eCheaper than many options on this list\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003ePoor infotainment\u003c/p\u003e\u003cp\u003eRide is prone to thumping\u003c/p\u003e\u003cp\u003eIneffective touchpad climate control\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eHandling\u003c/p\u003e\u003cp\u003eA replacement for the previous Focus-based Connect, the Ford Tourneo Custom picks up where its highly underrated predecessor left off. That car delivered Berlingo-style space and utility with genuine dynamic polish, and the latest version is no different.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eBased on VW’s MQB platform, the Tourneo has been tuned by Ford’s engineers to give it a poised and plush feel that allows it to scythe through corners as effortlessly as it soaks up bumps.\u003c/p\u003e\u003cp\u003eAs before, there’s a choice of two bodystyles: a standard five-seater and a longer (Grand Tourneo) seven-seat option. Both deliver acres of interior space and loads of handy storage, while the sliding rear side doors boost an already versatile package.\u003c/p\u003e\u003cp\u003eGo for the seven-seat version and, with both rear benches removed, there’s a cavernous 3100 litres of carrying capacity. If you’d rather have a VW badge on the nose, then there’s also the Caddy version.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e          \u003c/div\u003e\n        \n      \u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/volkswagen_touran.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eA good, versatile all-rounder \u003c/p\u003e\u003cp\u003eGreat practicality\u003c/p\u003e\u003cp\u003eSingular engine option is a good one\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eIt\u0026#39;s very old now and lacks character\u003c/p\u003e\u003cp\u003eEngine line-up has shrunk over the years\u003c/p\u003e\u003cp\u003eIt\u0026#39;s quite expensive\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eDaily driving\u003c/p\u003e\u003cp\u003eThe Touran feels like a car formed from the very core of the MPV textbook, having been created to deliver great occupant space inside a fairly compact footprint. \u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eIt can’t quite match the BMW 2 Series Active Tourer for premium-brand allure or driver appeal and it also lacks a bit of charm in its design. But like all great \u003cspan\u003eVWs\u003c/span\u003e, it\u0026#39;s functional in all respects, offering a versatile and pretty roomy seven-seat cabin without the risk of it dwarfing your three-bed semi.\u003c/p\u003e\u003cp\u003eVW only offers the \u003cspan\u003eTouran\u003c/span\u003e with its 1.5-litre TSI Evo petrol engine, which develops 148bhp yet hauls the car along easily enough and with creditable refinement and decent economy. Handling is neat, contained and comfortable.\u003c/p\u003e\u003cp\u003eThe Touran scores at least eight out of 10 in every department, making it a strong all-rounder.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/best_mpvs_-_bmw_2_series_active_tourer.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eExcellent build quality\u003c/p\u003e\u003cp\u003eVery spacious\u003c/p\u003e\u003cp\u003eClassy and composed to drive\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eNo longer offers the option of seven seats\u003c/p\u003e\u003cp\u003eSteeling lacks any sort of feel\u003c/p\u003e\u003cp\u003eNot cheap\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eTechnology \u003c/p\u003e\u003cp\u003eIt’s somewhat surprising that in such a declining sector, premium player BMW has stuck by the MPV.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eIn fact, the latest 2 Series Active Tourer isn’t a facelift of the previous model but an all-new vehicle built on the current 1 Series platform. And the result is a classy and composed hatchback that offers a decent dose of extra practicality.\u003c/p\u003e\u003cp\u003eThe old seven-seat Gran Tourer has been dropped, so it’s only this five-seat model that remains. Sitting within a footprint not much larger than a 1 Series, it serves up plenty of space for most growing families, with generous room in the rear, where a sliding bench allows you to choose between extra space for luggage or legs. \u003c/p\u003e\u003cp\u003eAs you’d expect, the fit and finish is excellent, plus the 2 Series gets the brand’s latest slick infotainment and advanced driver aids. It feels like a BMW on the move too, with just enough agility and engagement to satisfy your inner keen driver. \u003c/p\u003e\u003cp\u003eThere’s a pair of smooth and responsive 48V mild-hybrid petrols and a 218d diesel, plus the option of the four-wheel-drive 225e and 230e plug-in hybrids. The 230e offers a hot-hatch-humbling 322bhp while both plug-in hybrids claim an impressive 56 miles of EV range for an 8% company car tax banding.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e          \u003c/div\u003e\n        \n      \u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/2-ford-tourneo-2021-lt-hero-side.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e4\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e5\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eUp to nine seats\u003c/p\u003e\u003cp\u003eIncredible space\u003c/p\u003e\u003cp\u003eVan and passenger car bodystyles\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eFeels a bit too much like a van to drive\u003c/p\u003e\u003cp\u003eCheap-feeling interior\u003c/p\u003e\u003cp\u003ePoor PHEV range\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eLoad-lugging\u003c/p\u003e\u003cp\u003eIf maximising the amount of space and passenger-carrying capacity is your top priority, you need to be looking at the passenger versions of medium-sized vans.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eThe best van to drive is the Ford Transit Custom and the Tourneo Custom is the same but made more habitable for carrying passengers.\u003c/p\u003e\u003cp\u003eOne of our photographers ran a Ford Tourneo Custom PHEV for six months and found that the versatility fitted his lifestyle perfectly, and while it was never going to rival a Focus for driver appeal, it never felt like a chore to drive, either.\u003c/p\u003e\u003cp\u003eWe’d recommend a conventional diesel, though, because the pure-electric range of the PHEV is a paltry 30 miles.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/1-mercedes-benz-eqv-2021-lhd-first-drive-review-hero-front_1.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e6\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eExtremely quiet and smooth\u003c/p\u003e\u003cp\u003eNicely weighted and very accurate steering\u003c/p\u003e\u003cp\u003eLooks the part\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eSize means it\u0026#39;s a little more sluggish off the mark than most EVs\u003c/p\u003e\u003cp\u003eBouncy ride on UK roads\u003c/p\u003e\u003cp\u003ePrices start from around £75,000. Yikes\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eStyle\u003c/p\u003e\u003cp\u003eMercedes has got the all-electric seven-seater market pretty well served between the EQB and this, the larger and more expensive EQV.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eEffectively an electric V-Class, this is a big, tall, van-like vehicle with sliding side doors and captain\u0026#39;s chairs in the second row that can spin to face either forwards or backwards.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s powered by a 204bhp electric motor and has a usable range of just over 200 miles. And with air suspension and plenty of mass rolling along, it\u0026#39;s quiet and comfortable, and handles well for something so large and heavy.\u003c/p\u003e\u003cp\u003eYou\u0026#39;d be lucky to pick up an airport transfer in an EQV – and, allowing for the tax advantages, your chauffeur would be pretty happy to run one, assuming they have easy access to a charger.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e          \u003c/div\u003e\n        \n      \u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/lexus-lm-review-2024-01-panning-front_0.jpg\" alt=\"https://images.cdn.autocar.co.uk/\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDesign\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eInterior\u003c/span\u003e\u003cspan\u003e10\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003ePerformance\u003c/span\u003e\u003cspan\u003e4\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eRide \u0026amp; Handling\u003c/span\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eCosts\u003c/span\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eGenuinely opulent rear-seat space and lounging potential\u003c/p\u003e\u003cp\u003eHigh-material quality and tactile appeal of cabin\u003c/p\u003e\u003cp\u003eVery luxurious\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n          \u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n            \u003c/p\u003e\n            \u003cdiv\u003e\u003cp\u003eEngine can struggle with the LM\u0026#39;s 2.3-tonne kerb weight\u003c/p\u003e\u003cp\u003eNot as comfortable as it should be\u003c/p\u003e\u003cp\u003eThose looks\u003c/p\u003e\u003c/div\u003e\n          \u003c/div\u003e\n        \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eBest for: \u003c/strong\u003eLuxury\u003c/p\u003e\u003cp\u003eThe Lexus LM is exactly the sort of posh MPV you’d expect to see transporting the wealthy from one central London black-tie ball to another.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\u003cp\u003eStarting from £89,995, it’s the most expensive MPV on this list by a considerable margin, but it’s easy to see why once you step inside. The LM’s interior has been designed for old-school luxury, and it certainly feels special.\u003c/p\u003e\u003cp\u003eThe rear seats are airline-style recliners with heating and ventilation functions, and there are even seven massage functions, footrests and cushions. You can also lay the seats flat and use them as a sleeping area. \u003c/p\u003e\u003cp\u003eNot enough? You’ll be interested in the 48in television, then. And if the TV is a bit old-school for you, you can use the LM’s phone-sized touchscreen to control all media functions and top up your phone\u0026#39;s battery using the wireless phone charger hidden in the armrest. Other hotel room functions include a fridge and shoe storage.\u003c/p\u003e\u003cp\u003eThe LM isn’t the best to drive – or anywhere near it. It’s powered by a 2.5-litre four-cylinder petrol engine, paired with either a single electric motor or a twin-motor set-up. \u003c/p\u003e\u003cp\u003eBoth specifications struggle with the weight of the LM, and it often feels slow, unresponsive and generally underpowered. It’s also surprisingly noisy and isn’t quite refined enough. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"sponsored\" href=\"https://drivenfi.co.uk/?utm_source=Autocar%20Best%20Cars\u0026amp;utm_medium=Drivenfi %20Widget\u0026amp;utm_campaign=Clicks\u0026amp;utm_conte\"\u003eFinance this car with Drivenfi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eHOW TO CHOOSE THE BEST MPV \u003c/h2\u003e\u003cp\u003eWhen choosing the best MPV, you\u0026#39;ll likely be on the hunt for practicality, space and the ability to carry as many passengers as possible. Drivers should consider these factors when selecting their choice MPV. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eHOW WE TESTED AND SELECTED\u003c/h2\u003e\u003cp\u003eOur experienced team of road testers has driven each of the cars on this list and ranked them based on several factors, including ride, handling, performance, and economy. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eFAQs\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\n        \u003cdiv\u003e\n    \u003cdiv\u003e\u003ch3\u003e\u003cp\u003e\n\u003ch2\u003eWhat is an MPV?\u003c/h2\u003e\n\u003c/p\u003e\n\u003c/h3\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\nA multipurpose vehicle (MPV) is a car that excels in versatility. They\u0026#39;re the best option for people carrying, load-lugging and families, offering excellent all-round interior space. MPVs are often overlooked in place of SUVs, but they\u0026#39;re more spacious, can be equipped with more seats and benefit from a higher number of storage compartments. What\u0026#39;s not to like?\n\u003c/p\u003e\n\u003c/div\u003e  \u003c/div\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\u003ch3\u003e\u003cp\u003e\n\u003ch2\u003eHow is an MPV different from an SUV?\u003c/h2\u003e\n\u003c/p\u003e\n\u003c/h3\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\nWhile both MPVs and SUVs can carry multiple passengers, the main differences between the two are: MPVs are typically more spacious inside, with better options for adjusting seats and maximizing interior volume. SUVs also generally have higher ground clearance and may offer off-road capabilities. MPVs focus more on comfort and practicality, while SUVs tend to emphasize performance and style.\n\u003c/p\u003e\n\u003c/div\u003e  \u003c/div\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\u003ch3\u003e\u003cp\u003e\n\u003ch2\u003eWhat are the seating configurations in MPVs?\u003c/h2\u003e\n\u003c/p\u003e\n\u003c/h3\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\nThe number of seats in. an MPV can vary. Generally speaking, they have between five and seven seats, although some more expensive and larger options can have up to nine seats. In a standard seven-seater, they\u0026#39;re usually organised in a 2+3+2 formation - that\u0026#39;s two seats in the front, three in the middle row and two at the rear. While the second row of seats is often a standard seating arrangement, the rearmost, third row is often a bench seat, which can fold down or be removed completely in some models for a cavernous cargo space\n\u003c/p\u003e\n\u003c/div\u003e  \u003c/div\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\u003ch3\u003e\u003cp\u003e\n\u003ch2\u003eWhat\u0026#39;s the biggest MPV on sale in the UK today?\u003c/h2\u003e\n\u003c/p\u003e\n\u003c/h3\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\nLots of MPVs pride themselves on offering more space than the competition, but few will offer more room than the Ford Tourneo Custom. Ford\u0026#39;s minivan offers up to 1200 litres of cargo space in L1 specification, rising to 1900 litres for the larger L2 model. The Tourneo can have up to nine seats, laid out in a 3+3+3 organisation, and there\u0026#39;s plenty of room for passengers of all heights. \n \n \n\u003c/p\u003e\n\u003c/div\u003e  \u003c/div\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\u003ch3\u003e\u003cp\u003e\n\u003ch2\u003eIs there an electric MPV?\u003c/h2\u003e\n\u003c/p\u003e\n\u003c/h3\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\nWhile the number of MPVs might be generally dwindling, the number of electric options on sale is growing. Some of the biggest brands in the UK offer MPVs with EV-only power, including Ford, Citroen, Mercedes and Volkswagen. \nSome options appear in our top ten list, but our highest recommendations include the Volkswagen ID Buzz, Ford Tourneo Custom and Tourneo Connect, the Citroen e-Berlingo (or it\u0026#39;s Stellantis stablemates from Vauxhall and Peugeot), and the Mercedes EQV. \n\u003c/p\u003e\n\u003c/div\u003e  \u003c/div\u003e\n    \u003c/div\u003e\u003c/div\u003e\u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \u003c/div\u003e\n  \n      \u003cdiv\u003e\n                    \n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused Dacia Jogger cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogo.png\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\n    \n\n\n    \n          \n    \n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "21 min read",
  "publishedTime": null,
  "modifiedTime": null
}
