{
  "id": "32e968a3-8a90-42b1-9a1e-469eac5f79e7",
  "title": "Building A Convertible EV Is Way Harder Than You'd Think",
  "link": "https://www.jalopnik.com/1893185/why-there-arent-more-ev-convertibles/",
  "description": "If you love both convertibles and electric vehicles, you may have some disappointment in store. Here's why building a convertible EV is so hard.",
  "author": "Charles Krome",
  "published": "Mon, 30 Jun 2025 00:05:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Convertibles",
    "EVs and Hybrids"
  ],
  "byline": "Charles Krome",
  "length": 4205,
  "excerpt": "If you love both convertibles and electric vehicles, you may have some disappointment in store. Here's why building a convertible EV is so hard.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Are automakers dropping the ball when it comes to droptop EVs? It's a good question when you look at how many other vehicle types are available with all-electric power trains. The technology has quickly migrated throughout the industry, so you've got full-on luxury sedans, full-size pickups, three-row SUVs, nimble hatchbacks, mainstream family machines, thrilling coupes, and even a sort-of minivan, all available today in EV formats. But you'll have to look pretty hard to find a convertible EV — and have a pretty large bank account, too. The EV convertibles on sale today are led by two pricey rides. The Maserati GranCabrio Folgore is a gorgeous electric convertible that's also shockingly quick, with 0-60 times of 2.8 seconds, and impressively expensive, with a suggested price starting at $206,700. That makes the GMC Hummer EV seem like a bargain at $96,550 (plus $2,495 destination charge), even if you have to pay another $1,495 for the Hummer EV's Infinity Roof, which is made up of removable panels for open-air driving. (You can insert your own GMC Hummer EV jokes here.) Automakers like Porsche, Polestar, and Tesla have teased EV convertibles, but none has made it to showrooms yet. It's turning out that building all-electric droptops isn't as simple as it might seem. Top concerns making convertible EVs Engineering a convertible is no easy task regardless of its power train. A hard roof is a key structural part of any vehicle, and if you remove it, you have to replace it with robust reinforcement parts that add weight and cost to a vehicle — while reducing its efficiency and performance. A hard top also plays an important role in a vehicle's safety, and that has to be accounted for in convertibles. With EVs, though, all those issues are exacerbated. For instance, range is especially vital for EV owners, and that's going to be reduced by adding the weight of a convertible mechanism and extra structural reinforcements. In terms of safety, having a battery pack on the bottom of EVs — the usual configuration — helps with stability, but if you do happen to roll one over, all that massive weight is now above your head and has to be supported. EV makers in general are also struggling to make electric vehicles less expensive, and again, the added cost of convertibles takes finances in the other direction. There's also a subtle design factor that makes it difficult to build EV convertibles. The so-called skateboard platforms they use are fine for tall-riding trucks and SUVs, but the typical convertible is a low-slung coupe, a look hard to achieve when a car's body is on top of its batteries. Easy alternatives to hard-to-build convertible EVs If you absolutely must have a car that combines electric-only driving with open-air excitement, there are a few other options. McLaren's speedy Artura Spider, the horsepower-heavy Bentley Continental GT, and the first V6 Ferrari spider for the road, the 296 GTS, all feature convertible tops and plug-in hybrid powertrains, which enable limited-range EV driving. Of course, those aren't all that easy to afford, either. For something a little lighter on the wallet, the Jeep Wrangler 4xe stands out. The country's best-selling plug-in hybrid has a suggested price of $50,695 (plus $1,995 destination charge), can manage 21 miles of EV travel, and shows off a removable top and doors plus a fold-down windscreen. For more electric range, but a bit less fresh air, there are a (surprisingly) few EVs with power-operating sunroofs. Not even Tesla offers one currently, but you can check out some trim levels of rides including the Kia EV6 and Niro, the Hyundai Ioniq 6 and Kona, and Nissan Ariya — a forgotten EV bargain — from the popular brands, all starting below the average transaction price of a typical new vehicle. Otherwise, EVs may help keep the air cleaner by eliminating tailpipe emissions, but not many let you enjoy a nice clean breeze as you go.",
  "image": "https://www.jalopnik.com/img/gallery/building-a-convertible-ev-is-way-harder-than-youd-think/l-intro-1750180505.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eAre automakers dropping the ball when it comes to droptop EVs? It\u0026#39;s a good question when you look at how many other vehicle types are available with all-electric power trains. The technology has quickly migrated throughout the industry, so you\u0026#39;ve got full-on luxury sedans, full-size pickups, three-row SUVs, nimble hatchbacks, mainstream family machines, thrilling coupes, and even a sort-of minivan, all available today in EV formats.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eBut you\u0026#39;ll have to look pretty hard to find a convertible EV — and have a pretty large bank account, too. The EV convertibles on sale today are led by two pricey rides. The \u003ca href=\"https://www.jalopnik.com/maserati-grancabrio-folgore-is-a-gorgeous-electric-conv-1851410426/\" target=\"_blank\"\u003eMaserati GranCabrio Folgore is a gorgeous electric convertible\u003c/a\u003e that\u0026#39;s also shockingly quick, with 0-60 times of 2.8 seconds, and impressively expensive, with a suggested price starting at $206,700. That makes the GMC Hummer EV seem like a bargain at $96,550 (plus $2,495 destination charge), even if you have to pay another $1,495 for the Hummer EV\u0026#39;s Infinity Roof, which is made up of removable panels for open-air driving. (You can insert your own \u003ca href=\"https://www.jalopnik.com/why-barbie-poking-fun-at-the-gmc-hummer-ev-is-one-of-th-1850687474/\" target=\"_blank\"\u003eGMC Hummer EV jokes\u003c/a\u003e here.)\u003c/p\u003e\n\u003cp\u003eAutomakers like Porsche, Polestar, and Tesla have teased EV convertibles, but none has made it to showrooms yet. It\u0026#39;s turning out that building all-electric droptops isn\u0026#39;t as simple as it might seem.\u003c/p\u003e\n\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eTop concerns making convertible EVs\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eEngineering a convertible is no easy task regardless of its power train. A hard roof is a key structural part of any vehicle, and if you remove it, you have to replace it with robust reinforcement parts that add weight and cost to a vehicle — while reducing its efficiency and performance. A hard top also plays an important role in a vehicle\u0026#39;s safety, and that has to be accounted for in convertibles.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eWith EVs, though, all those issues are exacerbated. For instance, range is especially vital for EV owners, and that\u0026#39;s going to be reduced by adding the weight of a convertible mechanism and extra structural reinforcements. In terms of safety, having a battery pack on the bottom of EVs — the usual configuration — helps with stability, but if you do happen to roll one over, all that massive weight is now above your head and has to be supported. EV makers in general are also struggling to make electric vehicles less expensive, and again, the added cost of convertibles takes finances in the other direction.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThere\u0026#39;s also a subtle design factor that makes it difficult to build EV convertibles. The so-called skateboard platforms they use are fine for tall-riding trucks and SUVs, but the typical convertible is a low-slung coupe, a look hard to achieve when a car\u0026#39;s body is on top of its batteries.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eEasy alternatives to hard-to-build convertible EVs\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eIf you absolutely must have a car that combines electric-only driving with open-air excitement, there are a few other options. \u003ca href=\"https://www.jalopnik.com/mclaren-s-new-artura-spider-hits-205-mph-takes-just-11-1851288679/\" target=\"_blank\"\u003eMcLaren\u0026#39;s speedy Artura Spider\u003c/a\u003e, the \u003ca href=\"https://www.jalopnik.com/1830335/bentley-continental-gt-flying-spur-base-model-hp-range-details/\" target=\"_blank\"\u003ehorsepower-heavy Bentley Continental GT\u003c/a\u003e, and the \u003ca href=\"https://www.jalopnik.com/the-ferrari-296-gts-is-the-first-v6-ferrari-spider-for-1848812664/\" target=\"_blank\"\u003efirst V6 Ferrari spider for the road\u003c/a\u003e, the 296 GTS, all feature convertible tops and plug-in hybrid powertrains, which enable limited-range EV driving. Of course, those aren\u0026#39;t all that easy to afford, either. For something a little lighter on the wallet, the Jeep Wrangler 4xe stands out. The country\u0026#39;s best-selling plug-in hybrid has a suggested price of $50,695 (plus $1,995 destination charge), can manage 21 miles of EV travel, and shows off a removable top and doors plus a fold-down windscreen.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eFor more electric range, but a bit less fresh air, there are a (surprisingly) few EVs with power-operating sunroofs. Not even Tesla offers one currently, but you can check out some trim levels of rides including the Kia EV6 and Niro, the Hyundai Ioniq 6 and Kona, and Nissan Ariya — \u003ca href=\"https://www.jalopnik.com/the-nissan-aryia-is-a-forgotten-ev-bargain-1851731869/\" target=\"_blank\"\u003ea forgotten EV bargain\u003c/a\u003e — from the popular brands, all starting below the average transaction price of a typical new vehicle. Otherwise, EVs may help keep the air cleaner by eliminating tailpipe emissions, but not many let you enjoy a nice clean breeze as you go.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-30T00:05:00Z",
  "modifiedTime": "2025-06-30T00:05:00Z"
}
