{
  "id": "3acc1adf-0059-4df3-afdd-98b58eefd6b8",
  "title": "Meet the man who buys the Ferraris you really shouldn't",
  "link": "https://www.autocar.co.uk/car-news/features/meet-man-who-buys-ferraris-you-really-shouldnt",
  "description": "Chivers’ collection of cars is insured for £500,000 Serial Ferrari owner Scott Chivers buys the Ferraris you really never should, such as a car he’s dubbed Ratarossa It’s Stig of the Dump meets Don Johnson - a chop-top Ferrari Testarossa crudely stiffened and finished in primer; the antidote to all those gleaming Rosso Corsa Ferraris piloted once a year by meticulously groomed squillionaires, dressed to impress in prancing horse regalia. It belongs to Scott Chivers, a man with interesting views on Ferraris and owning them... “I have red Ferraris but it’s not my favourite colour and I don’t drive the cars to be seen,” he says. “My daily driver is a black 360 Challenge Stradale. I’ve owned it for eight years and done 50,000 miles in it. I go to the shops and take my kids to school in it. I love the fact it’s used – and looks it.” His Testarossa, or Ratarossa as he calls it (a name inspired by the term ‘rat’, short for ‘recycled automotive transport’ exemplified by superficially rusty split-screen Type 2 Volkswagens), is the ultimate expression of Scott’s Ferrari philosophy. Its grey body is rough and rippled, the engine cover is barely secure, the slender metal stiffening beams are visible between the sills and seats, the door cards flap around and the leather trim around the A-posts and behind the seats is as neat as my gift wrapping... Does it look low to you? That’s because it sits on lowering springs. The weight of the strengthening beams forced the car down at the back. Scott says he ripped out the old suspension and ordered three sets of front springs of different specs so he could play around with the ride height to equalise front and rear. Next thing, he’ll be saying there’s an old Vauxhall four-pot under that rear cover. Not a chance: Scott props it open with a piece of 4x2 to reveal the car’s original, and suitably grimy, flat-12 engine. Somewhere in there is the original five-speed manual transmission, too, as evidenced by the dull alloy transmission gate downstream in the cabin. Scott bought the car from a bloke in California. At the time, he was looking for an engine cover for his 1990 Testarossa coupe, a left-hand-drive car he’d bought from the Netherlands. (Seven of his Ferraris are left-hookers.) There he was, surfing the web, when up pops this four-year-old ad for an unfinished Testarossa spider project car. “I was intrigued and called the seller on the off-chance it was still available,” says Scott. “Incredibly, it was. He’d bought it intending to restore it but it just sat in his garage gathering dust. The owner said he wasn’t interested in selling it to anyone who would just break it for spares. I told him I would take on the project and get the car roadworthy. We agreed a deal and I shipped the car here to the UK. All in – the car, shipping, taxes – it cost me £16,000.” Ferrari made only one Testarossa Spider, commissioned by company boss Gianni Agnelli in 1986. It was sold by his children in 2016 for £1.2 million. Naturally, it was a proper job, unlike the dozen or so copycats, including Scott’s, that followed from body shops. At some point, Scott’s car was owned by a US kit car company that used it as the basis for its replica Testarossas. Then one day, perhaps following a crash, they cut the roof off, at which point, says Scott, Ferrari stepped in to protect its copyright... “When I received the car and the two crates of bits that came with it, my intention was to rebuild it,” says Scott. “I had my other Testarossa coupeÃ that had also just arrived so I used that as a blueprint to work out where the bits from the crates should go and as a wiring guide. I was able to swap parts between the two cars so I was able to cheaply and quickly verify if things worked or not.” But as Scott’s giant Ferrari puzzle came together, the more he loved its raw and unfinished appearance. No bad thing, either, since to bring it to factory standard would have cost a bomb and, in any case, without a roof, it could never be a purist’s Ferrari and his investment would never be recouped. He decided just to enjoy the build, make the car mechanically perfect – and stick with the rat look. “For me, the rat look is where the car is perfect under the skin but looks like it’s been sat around, untouched and never restored,” says Scott. “Bits I’ve since acquired or refitted were finished in red so I’ve left them because they add a touch of colour.” To describe Scott as a Ferrari nut is something of an understatement. His passion for the marque began as a boy when he saw a competition on the back page of Reader’s Digest to win a 308. At the time, his dad never stopped going on about the 246 Dino he dreamed of owning, and then Out Run, the Sega game, came out, featuring a Testarossa Spider. “When, eventually, I could afford to, I bought my first Ferrari – a 348 Spider,” he says. At this point, I should point out that Scott, a down-to-earth chap of 42, appears to be comfortably off but by no means loaded. He’s freshly divorced and is taking a year out of his job as an IT bod to consider his future. He has recently moved into a small estate somewhere in the Berkshire commuter belt; nice houses but with driveways too small for more than two cars. It’s why I have no trouble finding his place, since out on the road in front of it is part of his Ferrari collection: the Ratarossa and an F355 Spider; on the driveway, a 355 F1 Spider; and in the double garage, where the Ratty lives when it’s raining or Scott’s working on it, a 308. In all, Scott has eight Ferraris: two 355s, three 308s and the Ratarossa, all left-hand drive, and the 360 Challenge Stradale and a 456 GTA, both right-hand drive. In addition, he has a 1969 Porsche 911 T Coupe and a Volkswagen Golf GTI Mk1. Some are here and the rest are with friends and family. They’re insured for £500,000 and his annual premium is £3000. How has he done it? “I’m the guy who buys the Ferrari you shouldn’t: the one with uncertain history, in the wrong colour or the unfinished project. They’re relatively cheap to buy and I make a profit selling them on when I’ve sorted them out. I plough the money back into the collection.” But not all of his purchases are ‘orphans’. “My 430 Scuderia was immaculate,” he says. “I owned it for three months and then sold it, making £25,000. I added £3000 and straight away bought a left-hand-drive F355.” Over time, Scott has become a whizz with the spanners. He’s self-taught but little, short of dropping an engine for a timing belt change, is beyond him. He’s constantly on the internet, seeking out deals, parts and technical advice. Next on Scott’s Ratty to-do list is to refurbish the car’s steering and front suspension, give the engine a thorough service and tidy up the cabin. He’ll fit a sports exhaust too. It’ll all be done properly using genuine parts. As a final flourish, he’ll detail the engine so it looks like new. Is there one Ferrari Scott would sell his collection for? “Yes: an F40. It would be the only one that would be driven every day. I did once suggest to my ex that we extend the mortgage to buy one.” No need to ask why it’s just him and eight Fezzas these days.",
  "author": "",
  "published": "Mon, 21 Apr 2025 08:15:27 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "John Evans",
  "length": 5384,
  "excerpt": "Serial Ferrari owner Scott Chivers buys the Ferraris you really never should, such as a car he’s dubbed Ratarossa",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Next thing, he’ll be saying there’s an old Vauxhall four-pot under that rear cover. Not a chance: Scott props it open with a piece of 4x2 to reveal the car’s original, and suitably grimy, flat-12 engine. Somewhere in there is the original five-speed manual transmission, too, as evidenced by the dull alloy transmission gate downstream in the cabin. Scott bought the car from a bloke in California. At the time, he was looking for an engine cover for his 1990 Testarossa coupe, a left-hand-drive car he’d bought from the Netherlands. (Seven of his Ferraris are left-hookers.) There he was, surfing the web, when up pops this four-year-old ad for an unfinished Testarossa spider project car. “I was intrigued and called the seller on the off-chance it was still available,” says Scott. “Incredibly, it was. He’d bought it intending to restore it but it just sat in his garage gathering dust. The owner said he wasn’t interested in selling it to anyone who would just break it for spares. I told him I would take on the project and get the car roadworthy. We agreed a deal and I shipped the car here to the UK. All in – the car, shipping, taxes – it cost me £16,000.” Ferrari made only one Testarossa Spider, commissioned by company boss Gianni Agnelli in 1986. It was sold by his children in 2016 for £1.2 million. Naturally, it was a proper job, unlike the dozen or so copycats, including Scott’s, that followed from body shops. At some point, Scott’s car was owned by a US kit car company that used it as the basis for its replica Testarossas. Then one day, perhaps following a crash, they cut the roof off, at which point, says Scott, Ferrari stepped in to protect its copyright... “When I received the car and the two crates of bits that came with it, my intention was to rebuild it,” says Scott. “I had my other Testarossa coupeÃ that had also just arrived so I used that as a blueprint to work out where the bits from the crates should go and as a wiring guide. I was able to swap parts between the two cars so I was able to cheaply and quickly verify if things worked or not.” But as Scott’s giant Ferrari puzzle came together, the more he loved its raw and unfinished appearance. No bad thing, either, since to bring it to factory standard would have cost a bomb and, in any case, without a roof, it could never be a purist’s Ferrari and his investment would never be recouped. He decided just to enjoy the build, make the car mechanically perfect – and stick with the rat look. “For me, the rat look is where the car is perfect under the skin but looks like it’s been sat around, untouched and never restored,” says Scott. “Bits I’ve since acquired or refitted were finished in red so I’ve left them because they add a touch of colour.” To describe Scott as a Ferrari nut is something of an understatement. His passion for the marque began as a boy when he saw a competition on the back page of Reader’s Digest to win a 308. At the time, his dad never stopped going on about the 246 Dino he dreamed of owning, and then Out Run, the Sega game, came out, featuring a Testarossa Spider. “When, eventually, I could afford to, I bought my first Ferrari – a 348 Spider,” he says. At this point, I should point out that Scott, a down-to-earth chap of 42, appears to be comfortably off but by no means loaded. He’s freshly divorced and is taking a year out of his job as an IT bod to consider his future. He has recently moved into a small estate somewhere in the Berkshire commuter belt; nice houses but with driveways too small for more than two cars. It’s why I have no trouble finding his place, since out on the road in front of it is part of his Ferrari collection: the Ratarossa and an F355 Spider; on the driveway, a 355 F1 Spider; and in the double garage, where the Ratty lives when it’s raining or Scott’s working on it, a 308. In all, Scott has eight Ferraris: two 355s, three 308s and the Ratarossa, all left-hand drive, and the 360 Challenge Stradale and a 456 GTA, both right-hand drive. In addition, he has a 1969 Porsche 911 T Coupe and a Volkswagen Golf GTI Mk1. Some are here and the rest are with friends and family. They’re insured for £500,000 and his annual premium is £3000. How has he done it? “I’m the guy who buys the Ferrari you shouldn’t: the one with uncertain history, in the wrong colour or the unfinished project. They’re relatively cheap to buy and I make a profit selling them on when I’ve sorted them out. I plough the money back into the collection.” Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. used Ferrari cars for sale In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/screen_shot_2018-06-27_at_15.46.27.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eNext thing, he’ll be saying there’s an old \u003ca href=\"https://www.autocar.co.uk/car-reviews/vauxhall\"\u003eVauxhall\u003c/a\u003e four-pot under that rear cover. Not a chance: Scott props it open with a piece of 4x2 to reveal the car’s original, and suitably grimy, flat-12 engine. Somewhere in there is the original five-speed manual transmission, too, as evidenced by the dull alloy transmission gate downstream in the cabin.\u003c/p\u003e\n\u003cp\u003eScott bought the car from a bloke in California. At the time, he was looking for an engine cover for his 1990 Testarossa coupe, a left-hand-drive car he’d bought from the Netherlands. (Seven of his Ferraris are left-hookers.) There he was, surfing the web, when up pops this four-year-old ad for an unfinished Testarossa spider project car.\u003c/p\u003e\n\u003cp\u003e“I was intrigued and called the seller on the off-chance it was still available,” says Scott. “Incredibly, it was. He’d bought it intending to restore it but it just sat in his garage gathering dust. The owner said he wasn’t interested in selling it to anyone who would just break it for spares. I told him I would take on the project and get the car roadworthy. We agreed a deal and I shipped the car here to the UK. All in – the car, shipping, taxes – it cost me £16,000.”\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Luc 5172\" data-src=\"/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/luc_5172.jpg\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/luc_5172.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eFerrari made only one Testarossa Spider, commissioned by company boss Gianni Agnelli in 1986. It was sold by his children in 2016 for £1.2 million. Naturally, it was a proper job, unlike the dozen or so copycats, including Scott’s, that followed from body shops.\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003eAt some point, Scott’s car was owned by a US kit car company that used it as the basis for its replica Testarossas. Then one day, perhaps following a crash, they cut the roof off, at which point, says Scott, Ferrari stepped in to protect its copyright...\u003c/p\u003e\n\u003cp\u003e“When I received the car and the two crates of bits that came with it, my intention was to rebuild it,” says Scott. “I had my other Testarossa coupeÃ that had also just arrived so I used that as a blueprint to work out where the bits from the crates should go and as a wiring guide. I was able to swap parts between the two cars so I was able to cheaply and quickly verify if things worked or not.”\u003c/p\u003e\n\u003cp\u003eBut as Scott’s giant Ferrari puzzle came together, the more he loved its raw and unfinished appearance. No bad thing, either, since to bring it to factory standard would have cost a bomb and, in any case, without a roof, it could never be a purist’s Ferrari and his investment would never be recouped. He decided just to enjoy the build, make the car mechanically perfect – and stick with the rat look.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Screen shot 2018 06 27 at 15\" data-src=\"/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/screen_shot_2018-06-27_at_15.46.35.jpg\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/screen_shot_2018-06-27_at_15.46.35.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003e“For me, the rat look is where the car is perfect under the skin but looks like it’s been sat around, untouched and never restored,” says Scott.\u003c/p\u003e\n\u003cp\u003e“Bits I’ve since acquired or refitted were finished in red so I’ve left them because they add a touch of colour.” To describe Scott as a Ferrari nut is something of an understatement. His passion for the marque began as a boy when he saw a competition on the back page of Reader’s Digest to win a 308. At the time, his dad never stopped going on about the 246 Dino he dreamed of owning, and then Out Run, the Sega game, came out, featuring a Testarossa Spider.            \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003e“When, eventually, I could afford to, I bought my first Ferrari – a 348 Spider,” he says.\u003c/p\u003e\n\u003cp\u003eAt this point, I should point out that Scott, a down-to-earth chap of 42, appears to be comfortably off but by no means loaded. He’s freshly divorced and is taking a year out of his job as an IT bod to consider his future.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Screen shot 2018 06 27 at 15\" data-src=\"/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/screen_shot_2018-06-27_at_15.47.05.jpg\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/screen_shot_2018-06-27_at_15.47.05.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eHe has recently moved into a small estate somewhere in the Berkshire commuter belt; nice houses but with driveways too small for more than two cars. It’s why I have no trouble finding his place, since out on the road in front of it is part of his Ferrari collection: the Ratarossa and an F355 Spider; on the driveway, a 355 F1 Spider; and in the double garage, where the Ratty lives when it’s raining or Scott’s working on it, a 308.\u003c/p\u003e\n\u003cp\u003eIn all, Scott has eight Ferraris: two 355s, three 308s and the Ratarossa, all left-hand drive, and the 360 Challenge Stradale and a 456 GTA, both right-hand drive. In addition, he has a 1969 \u003ca href=\"https://www.autocar.co.uk/car-reviews/porsche\"\u003ePorsche\u003c/a\u003e 911 T Coupe and a \u003ca href=\"https://www.autocar.co.uk/car-review/volkswagen/golf-gti\"\u003eVolkswagen Golf GTI\u003c/a\u003e Mk1.\u003c/p\u003e\n\u003cp\u003eSome are here and the rest are with friends and family. They’re insured for £500,000 and his annual premium is £3000. How has he done it? “I’m the guy who buys the Ferrari you shouldn’t: the one with uncertain history, in the wrong colour or the unfinished project. They’re relatively cheap to buy and I make a profit selling them on when I’ve sorted them out. I plough the money back into the collection.”            \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused Ferrari  cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogo.png\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2020-03-18T11:00:00Z",
  "modifiedTime": null
}
