{
  "id": "4b3b93db-0708-4597-afec-6f2d6ac3ed08",
  "title": "AWD Jeep Avenger 4xe launched in UK from £30,999",
  "link": "https://www.autocar.co.uk/car-news/new-cars/awd-jeep-avenger-4xe-launched-uk-%C2%A330999",
  "description": "Rugged Avenger 4x4 combines a petrol engine with two electric motors for improved off-road ability The new Jeep Avenger 4xe, the model line’s new range-topper, has gone on sale in the UK priced from £30,999. At launch, the 4x4 is available in two trims: base Upland and a special The North Face Edition. The latter is priced at £34,999 and limited to 4806 examples. Over the standard car, it gets Summit Gold accents and “a nature-inspired colour pallet”. Deliveries will begin in March. Featuring an all-wheel-drive hybrid powertrain – it is not offered as an EV –  the 4xe will “go further, faster and better off road” than any rival and “establishes a new standard” in the class, says Jeep.  “We are proud to introduce a model that not only delivers on performance and sustainability but also sets a new standard for versatility and style,” said new Jeep Europe boss Eric Laforge. The Avenger was launched as an EV in mid-2023, with a cheaper pure-petrol variant introduced in the UK a few months later. Both are front-wheel-drive models, but Jeep had always planned to eventually offer an all-wheel-drive variant to build on the brand’s long history of off-road ability. A 4x4 version was first previewed at the 2022 Paris motor show. Former boss Antonio Filosa, now head of Stellantis North America, previously told Autocar: “Every time we think of a Jeep product, we think of a four-wheel-drive version. Jeep is by far the most capable brand in the world, and for us capability is all around off-road. So in each segment, any Jeep vehicle must have more capability than every rival.” The Avenger 4xe combines a 134bhp 1.2-litre turbocharged petrol engine driving through a six-speed dual-clutch automatic gearbox with a pair of 28bhp electric motors (one on each axle). The 48V hybrid system is designed to offer significant traction and torque to boost its off-road performance. Jeep claims it can generate up to 1400lb ft at the rear wheels, a figure likely achieved by multiplying motor torque by the gear ratio. The all-wheel drive system helps to give the 4xe a 0-62mph time of 9.5sec and the top speed is 120mph. Jeep also claims a “minimal” increase in CO2 emissions over the existing Avenger hybrid offered in some markets, although the firm has yet to give an exact figure. The powertrain uses a ‘smart’ all-wheel drive system, so power is always sent to all four wheels below 19mph. Between 19mph and 56mph, the rear axle is powered only when required, and two-wheel-drive is always used at higher speeds to minimise fuel consumption. There is on-demand torque distribution in all-wheel drive mode, with a split of up to 50:50 front to rear. The Selec-Terrain drive mode function features Auto, Snow, Sand and Mud and Sport settings, which alter the power distribution and stability control for the various conditions. The powertrain features a 22:7:1 reducer on the rear axle to allow for that 1400lb ft of torque, and Jeep claims that gives the Avenger 4xe the ability to traverse slopes of up to 40% - and 20% even when there’s no grip at the front wheels. With a ride height of 210mm, the 4xe model sits 10mm higher than the regular Avenger, enabling the ability to ford up to 400mm of water. Another bespoke addition is multi-link rear suspension, which allows for greater articulation on the rear axle. Additionally, the Avenger 4xe offers 22deg approach, 21deg breakover and 35deg departure angles. As previewed by the 2022 concept, the Avenger 4xe features a number of design tweaks from the regular version. The foglights have been moved slightly higher to provide better visibility, and there are roof rails and a rear tow hook. The front and rear bumpers are now made from mould-in-colour material and feature an anti-scratch finish, and the front bumper shows more of the wheels and includes extra cladding. There is a new optional bonnet sticker designed to reduce reflections when driving in sunny weather. Mud and snow tyres are offered as standard, with optional All Terrain 3PMSF tyres also available. Both are mounted on black alloy wheels. Inside, the 4xe gains new seats made from an easily washable material, along with greater use of more durable materials to extend the cabin life.",
  "author": "",
  "published": "Fri, 25 Oct 2024 16:20:00 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Felix Page, James Attwood",
  "length": 2736,
  "excerpt": "Rugged Avenger 4x4 combines a petrol engine with two EV motors for improved off-road ability",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The new Jeep Avenger 4xe, the model line’s new range-topper, has gone on sale in the UK priced from £30,999. At launch, the 4x4 is available in two trims: base Upland and a special The North Face Edition. The latter is priced at £34,999 and limited to 4806 examples. Over the standard car, it gets Summit Gold accents and “a nature-inspired colour pallet”. Deliveries will begin in March. Featuring an all-wheel-drive hybrid powertrain – it is not offered as an EV –  the 4xe will “go further, faster and better off road” than any rival and “establishes a new standard” in the class, says Jeep.  “We are proud to introduce a model that not only delivers on performance and sustainability but also sets a new standard for versatility and style,” said new Jeep Europe boss Eric Laforge. The Avenger was launched as an EV in mid-2023, with a cheaper pure-petrol variant introduced in the UK a few months later. Both are front-wheel-drive models, but Jeep had always planned to eventually offer an all-wheel-drive variant to build on the brand’s long history of off-road ability. A 4x4 version was first previewed at the 2022 Paris motor show. Former boss Antonio Filosa, now head of Stellantis North America, previously told Autocar: “Every time we think of a Jeep product, we think of a four-wheel-drive version. Jeep is by far the most capable brand in the world, and for us capability is all around off-road. So in each segment, any Jeep vehicle must have more capability than every rival.” The Avenger 4xe combines a 134bhp 1.2-litre turbocharged petrol engine driving through a six-speed dual-clutch automatic gearbox with a pair of 28bhp electric motors (one on each axle). The 48V hybrid system is designed to offer significant traction and torque to boost its off-road performance. Jeep claims it can generate up to 1400lb ft at the rear wheels, a figure likely achieved by multiplying motor torque by the gear ratio. The all-wheel drive system helps to give the 4xe a 0-62mph time of 9.5sec and the top speed is 120mph. Jeep also claims a “minimal” increase in CO2 emissions over the existing Avenger hybrid offered in some markets, although the firm has yet to give an exact figure. The powertrain uses a ‘smart’ all-wheel drive system, so power is always sent to all four wheels below 19mph. Between 19mph and 56mph, the rear axle is powered only when required, and two-wheel-drive is always used at higher speeds to minimise fuel consumption. There is on-demand torque distribution in all-wheel drive mode, with a split of up to 50:50 front to rear. The Selec-Terrain drive mode function features Auto, Snow, Sand and Mud and Sport settings, which alter the power distribution and stability control for the various conditions.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/jeep_avenger_4xe_0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe new \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/avenger\"\u003eJeep Avenger\u003c/a\u003e 4xe, the model line’s new range-topper, has gone on sale in the UK priced from £30,999.\u003c/p\u003e\n\u003cp\u003eAt launch, the 4x4 is available in two trims: base Upland and a special The North Face Edition. The latter is priced at £34,999 and limited to 4806 examples. Over the standard car, it gets Summit Gold accents and “a nature-inspired colour pallet”. Deliveries will begin in March.\u003c/p\u003e\n\u003cp\u003eFeaturing an all-wheel-drive hybrid powertrain – it is not offered as an EV –  the 4xe will “go further, faster and better off road” than any rival and “establishes a new standard” in the class, says \u003ca href=\"https://www.autocar.co.uk/car-reviews/jeep\"\u003eJeep\u003c/a\u003e.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e“We are proud to introduce a model that not only delivers on performance and sustainability but also sets a new standard for versatility and style,” said new Jeep Europe boss Eric Laforge.\u003c/p\u003e\n\u003cp\u003eThe Avenger was launched as an EV in mid-2023, with a cheaper pure-petrol variant introduced in the UK a few months later. Both are front-wheel-drive models, but Jeep had always planned to eventually offer an all-wheel-drive variant to build on the brand’s long history of off-road ability. A 4x4 version was first previewed at the 2022 Paris motor show.\u003c/p\u003e\n\u003cp\u003eFormer boss Antonio Filosa, now head of Stellantis North America, previously told Autocar: “Every time we think of a Jeep product, we think of a four-wheel-drive version. Jeep is by far the most capable brand in the world, and for us capability is all around off-road. So in each segment, any Jeep vehicle must have more capability than every rival.”\u003c/p\u003e\n\u003cp\u003eThe Avenger 4xe combines a 134bhp 1.2-litre turbocharged petrol engine driving through a six-speed dual-clutch automatic gearbox with a pair of 28bhp electric motors (one on each axle). The 48V hybrid system is designed to offer significant traction and torque to boost its off-road performance. Jeep claims it can generate up to 1400lb ft at the rear wheels, a figure likely achieved by multiplying motor torque by the gear ratio.\u003c/p\u003e\n\u003cp\u003eThe all-wheel drive system helps to give the 4xe a 0-62mph time of 9.5sec and the top speed is 120mph. Jeep also claims a “minimal” increase in CO2 emissions over the existing Avenger hybrid offered in some markets, although the firm has yet to give an exact figure.\u003c/p\u003e\n\u003cp\u003eThe powertrain uses a ‘smart’ all-wheel drive system, so power is always sent to all four wheels below 19mph. Between 19mph and 56mph, the rear axle is powered only when required, and two-wheel-drive is always used at higher speeds to minimise fuel consumption.\u003c/p\u003e\n\u003cp\u003eThere is on-demand torque distribution in all-wheel drive mode, with a split of up to 50:50 front to rear. The Selec-Terrain drive mode function features Auto, Snow, Sand and Mud and Sport settings, which alter the power distribution and stability control for the various conditions.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-05-22T16:01:01Z",
  "modifiedTime": null
}
