{
  "id": "50b01998-054f-440d-8451-92f37b98c0e2",
  "title": "30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed",
  "link": "https://bringatrailer.com/listing/1995-ferrari-f355-berlinetta-21/",
  "description": "This 1995 Ferrari F355 Berlinetta has spent time in several states through the seller’s acquisition in 2007 and now shows 30k miles. It is powered by a 3.5-liter DOHC V8 linked with a six-speed manual transaxle and a limited-slip differential. Finished in Blu Chiaro over Cream Connolly leather upholstery, the car is equipped with 18″ magnesium wheels, a Challenge-style rear grille, a Tubi Style exhaust system and headers, fog lights, aluminum pedals, an aftermarket audio system, a gated shifter, and pop-up headlights. An engine-out timing belt service was reportedly performed in 2022, and work carried out under current ownership is said to have included replacing the clutch, cooling fans, engine and transaxle mounts, and CV boot covers. Previously listed on BaT in June 2023, this F355 Berlinetta is now offered with a tool kit, service records, a clean Carfax report, and a clean New Mexico title in the seller’s name.",
  "author": "bringatrailer",
  "published": "Tue, 31 Dec 2024 00:20:04 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 3702,
  "excerpt": "Bid for the chance to own a 30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #176,383.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/google-chrome-icon-192x192.png?v=99cc535109",
  "text": "This 1995 Ferrari F355 Berlinetta has spent time in several states through the seller’s acquisition in 2007 and now shows 30k miles. It is powered by a 3.5-liter DOHC V8 linked with a six-speed manual transaxle and a limited-slip differential. Finished in Blu Chiaro over Cream Connolly leather upholstery, the car is equipped with 18″ magnesium wheels, a Challenge-style rear grille, a Tubi Style exhaust system and headers, fog lights, aluminum pedals, an aftermarket audio system, a gated shifter, and pop-up headlights. An engine-out timing belt service was reportedly performed in 2022, and work carried out under current ownership is said to have included replacing the clutch, cooling fans, engine and transaxle mounts, and CV boot covers. Previously listed on BaT in June 2023, this F355 Berlinetta is now offered with a tool kit, service records, a clean Carfax report, and a clean New Mexico title in the seller’s name. The Pininfarina-designed body is finished in Blu Chiaro, and styling incorporates pop-up headlights, integrated front fog lights, an integrated rear decklid spoiler, quad exhaust outlets, a vented engine cover, and air intakes on the doors and rocker panels. A Challenge-style rear grille was added under current ownership. The front bumper cover, front lip, and hood are said to have been refinished in 2022, and paint meter readings are provided in the gallery below. The majority of the listing photos were taken in June 2023, and the seller states the car has been stored since that time and only driven ~30 miles. The 18″ five-spoke magnesium wheels wear staggered-width Bridgestone Potenza tires. Ferrari-branded brake calipers are mounted over ventilated discs at each corner. Replacement CV boot covers are said to have been fitted under current ownership. The cabin features sport seats trimmed in Cream Connolly leather that extends to the center console, door panel inserts, and lower half of the dashboard. Appointments include a gated shifter, automatic climate control, power windows and locks, drilled aluminum pedals, and aftermarket audio components consisting of a head unit, door speakers, and amplifiers. The seller notes that the subwoofer has been removed and that sticky buttons have been refinished under current ownership. The leather-wrapped steering wheel frames a 200-mph speedometer, a 10k-rpm tachometer, and gauges for oil pressure and coolant temperature. Ancillary instruments in the center stack include an analog clock and gauges for fuel level and oil temperature. The six-digit odometer shows 30k miles, approximately 8k of which were added under current ownership. The mid-mounted 3.5-liter DOHC V8 features five valves per cylinder and dry-sump lubrication and has been modified with a Tubi Style exhaust system, headers, and aftermarket catalytic converters. Power is sent to the rear wheels through a six-speed manual transaxle and a limited-slip differential. The seller notes that an engine-out belt service was last completed in 2022, and a replacement clutch, cooling fans, and transaxle and engine mounts have reportedly been fitted under current ownership. Additional underside photos are provided in the gallery. The Carfax report is free of accidents or other reported damage. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_dsc_6999-45390.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 1995 Ferrari F355 Berlinetta has spent time in several states through the seller’s acquisition in 2007 and now shows 30k miles. It is powered by a 3.5-liter DOHC V8 linked with a six-speed manual transaxle and a limited-slip differential. Finished in Blu Chiaro over Cream Connolly leather upholstery, the car is equipped with 18″ magnesium wheels, a Challenge-style rear grille, a Tubi Style exhaust system and headers, fog lights, aluminum pedals, an aftermarket audio system, a gated shifter, and pop-up headlights. An engine-out timing belt service was reportedly performed in 2022, and work carried out under current ownership is said to have included replacing the clutch, cooling fans, engine and transaxle mounts, and CV boot covers. Previously listed \u003ca href=\"https://bringatrailer.com/listing/1995-ferrari-f355-berlinetta-8/\" target=\"_blank\" rel=\"noopener\"\u003eon BaT in June 2023\u003c/a\u003e, this F355 Berlinetta is now offered with a tool kit, service records, a clean Carfax report, and a clean New Mexico title in the seller’s name.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_dsc_6982-25598.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe Pininfarina-designed body is finished in Blu Chiaro, and styling incorporates pop-up headlights, integrated front fog lights, an integrated rear decklid spoiler, quad exhaust outlets, a vented engine cover, and air intakes on the doors and rocker panels. A Challenge-style rear grille was added under current ownership. The front bumper cover, front lip, and hood are said to have been refinished in 2022, and paint meter readings are provided in the gallery below. The majority of the listing photos were taken in June 2023, and the seller states the car has been stored since that time and only driven ~30 miles.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_dsc_7046-25566.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 18″ five-spoke magnesium wheels wear staggered-width Bridgestone Potenza tires. Ferrari-branded brake calipers are mounted over ventilated discs at each corner. Replacement CV boot covers are said to have been fitted under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_dsc_7036-03482-25536.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe cabin features sport seats trimmed in Cream Connolly leather that extends to the center console, door panel inserts, and lower half of the dashboard. Appointments include a gated shifter, automatic climate control, power windows and locks, drilled aluminum pedals, and aftermarket audio components consisting of a head unit, door speakers, and amplifiers. The seller notes that the subwoofer has been removed and that sticky buttons have been refinished under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_1000004440-25512.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe leather-wrapped steering wheel frames a 200-mph speedometer, a 10k-rpm tachometer, and gauges for oil pressure and coolant temperature. Ancillary instruments in the center stack include an analog clock and gauges for fuel level and oil temperature. The six-digit odometer shows 30k miles, approximately 8k of which were added under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_IMG_3609-91480-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe mid-mounted 3.5-liter DOHC V8 features five valves per cylinder and dry-sump lubrication and has been modified with a Tubi Style exhaust system, headers, and aftermarket catalytic converters. Power is sent to the rear wheels through a six-speed manual transaxle and a limited-slip differential. The seller notes that an engine-out belt service was last completed in 2022, and a replacement clutch, cooling fans, and transaxle and engine mounts have reportedly been fitted under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1995_ferrari_f355-berlinetta_1995_ferrari_f355-berlinetta_img_20230531_083057263-14095-scaled-1-25463.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"30k-Mile 1995 Ferrari F355 Berlinetta 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eAdditional underside photos are provided in the gallery.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or other reported damage.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
