{
  "id": "6efd9d18-fbc1-4f29-87cd-245ba4467aad",
  "title": "Can You Use A Tesla To Jumpstart A Gas Car?",
  "link": "https://www.jalopnik.com/1847171/can-you-jump-start-gas-car-with-tesla/",
  "description": "We've all seen a gas vehicle help jump someone's stranded car in a parking lot, but what about a Tesla? Can these EVs help out your fellow strangers?",
  "author": "Richard Sachek",
  "published": "Sun, 04 May 2025 23:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Tesla",
    "Jalopnik Explains"
  ],
  "byline": "Richard Sachek",
  "length": 3611,
  "excerpt": "We've all seen a gas vehicle help jump someone's stranded car in a parking lot, but what about a Tesla? Can these EVs help out your fellow strangers?",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Welcome, Jalopnik readers, to something completely different: a Tesla article that has nothing to do with controversial frontman Elon Musk and his role in the Trump Administration or DOGE. Instead, we're going to address the burning question of what happens if a Tesla owner encounters an internal combustion engine (ICE) vehicle with a dead battery? The temptation may be strong to leave that polluting, earth-wrecking heap stranded by the side of the road. But assuming that you're a good person and actually want to help a fellow motorist out of a jam, can you and should you? To be clear, Tesla strictly forbids jump-starting other vehicles, ICE or otherwise. In fact, the owners manual for a Model 3 couldn't be clearer. It specifically states, \"Model 3 cannot be used to jumpstart another vehicle. Doing so can result in damage.\" If you attempt to jumpstart an ICE vehicle with your Tesla, Jalopnik will definitely not be responsible for any financial destruction that ensues. With those disclaimers out of the way, yes, you can probably jumpstart a gasoline-powered car with a Tesla. But did we mention that you shouldn't? Jump-starting will probably work, but it's risky Besides the high-voltage traction battery that powers the drive wheels, many Teslas also have a conventional 12-volt battery like regular cars under the hood. There's also a DC/DC converter on board that allows auxiliary systems like lighting and audio to tap into the large lithium-ion traction battery. The risk begins with using a Tesla's 12-volt battery to jumpstart a gas car because the high-amperage load from the other vehicle's starter motor is capable of stressing the small-ish Tesla battery. However, wrecking a Tesla's 12-volt battery is nothing compared to what happens if you damage the DC/DC converter in the process of jump-starting. Granted, the DC/DC converter is rated for a healthy 200 amps, but there's always a small risk of a sudden surge that bricks this pricey component and sends you to the dealership on a tow truck for an expensive repair. That's particularly true in cold weather, when an ICE vehicle may require additional cranking amps to get going. Ditto for larger engines like V8s or diesels that require higher cranking amps.  Here's what Tesla owners can safely do to help So what should you do if you want to safely help a gas vehicle driver with a dead battery? This next suggestion isn't endorsed by Tesla either, but some owners mention that it's much less risky to let the ICE vehicle's battery charge from Tesla's 12-volt battery for a while, like 10 to 15 minutes. When the gas car is ready to attempt starting, disconnect the jumper cables (used as charging leads) from the Tesla first. Now would be a good time to mention that some recent Tesla models are moving away from regular 12-volt car batteries altogether in favor of a 16-volt lithium-ion auxiliary battery. If you have the new 16-volt architecture or you're not sure which type you have, definitely do not attempt to connect to an ICE vehicle. On one Tesla forum, some particularly good-hearted EV owners mention carrying a small, inexpensive lithium-ion jumpstart pack to assist stranded gas car drivers without risking damage to their own whips. Perhaps Tesla owners aren't so bad, after all?",
  "image": "https://www.jalopnik.com/img/gallery/can-you-use-a-tesla-to-jumpstart-a-gas-car/l-intro-1745956317.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eWelcome, Jalopnik readers, to something completely different: a Tesla article that has nothing to do with \u003ca href=\"https://www.jalopnik.com/1826495/elon-musk-unprecedented-brand-damage-tesla-sales-trump-tariffs/\" target=\"_blank\"\u003econtroversial frontman Elon Musk\u003c/a\u003e and his role in the Trump Administration or DOGE. Instead, we\u0026#39;re going to address the burning question of what happens if a Tesla owner encounters an internal combustion engine (ICE) vehicle with a dead battery? The temptation may be strong to leave that polluting, earth-wrecking heap stranded by the side of the road. But assuming that you\u0026#39;re a good person and actually want to help a fellow motorist out of a jam, can you and should you?\u003c/p\u003e\n\u003cp\u003eTo be clear, Tesla strictly forbids jump-starting other vehicles, ICE or otherwise. In fact, the \u003ca href=\"https://www.tesla.com/ownersmanual/model3/en_us/GUID-3567D5F4-A5F4-4323-8BE0-023D5438FFC6.html\" target=\"_blank\"\u003eowners manual\u003c/a\u003e for a Model 3 couldn\u0026#39;t be clearer. It specifically states, \u0026#34;Model 3 cannot be used to jumpstart another vehicle. Doing so can result in damage.\u0026#34; If you attempt to jumpstart an ICE vehicle with your Tesla, Jalopnik will definitely not be responsible for any financial destruction that ensues. With those disclaimers out of the way, yes, you can probably jumpstart a gasoline-powered car with a Tesla. But did we mention that you shouldn\u0026#39;t?\u003c/p\u003e\n\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eJump-starting will probably work, but it\u0026#39;s risky\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eBesides the high-voltage traction battery that powers the drive wheels, many Teslas also have \u003ca href=\"https://www.jalopnik.com/why-electric-cars-still-use-ordinary-12-volt-batteries-1847209291/\" target=\"_blank\"\u003ea conventional 12-volt battery like regular cars\u003c/a\u003e under the hood. There\u0026#39;s also a DC/DC converter on board that allows auxiliary systems like lighting and audio to tap into the large lithium-ion traction battery. The risk begins with using a Tesla\u0026#39;s 12-volt battery to jumpstart a gas car because the high-amperage load from the other vehicle\u0026#39;s starter motor is capable of stressing the small-ish Tesla battery.\u003c/p\u003e\n\u003cp\u003eHowever, wrecking a Tesla\u0026#39;s 12-volt battery is nothing compared to what happens if you damage the DC/DC converter in the process of jump-starting. Granted, the DC/DC converter is rated for a healthy 200 amps, but there\u0026#39;s always a small risk of a sudden surge that bricks this pricey component and sends you to the dealership on a tow truck for an expensive repair. That\u0026#39;s particularly true in cold weather, when an ICE vehicle may require additional cranking amps to get going. Ditto for larger engines like V8s or diesels that require higher cranking amps. \u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eHere\u0026#39;s what Tesla owners can safely do to help\u003c/h2\u003e\n                                \u003cp data-post-url=\"https://www.jalopnik.com/1847171/can-you-jump-start-gas-car-with-tesla/\" data-post-title=\"Can You Use A Tesla To Jumpstart A Gas Car?\" data-slide-num=\"2\" data-post-id=\"1847171\"\u003e\n                                         \u003ciframe src=\"https://www.youtube.com/embed/woC1UyOCma8?si=CyIzF9jprUL9VHwO\" frameborder=\"0\" allowfullscreen=\"\" data-slide-url=\"https://www.jalopnik.com/1847171/can-you-jump-start-gas-car-with-tesla/\" data-slide-num=\"2\" data-post-id=\"1847171\" data-slide-title=\"Can You Use A Tesla To Jumpstart A Gas Car?: Here\u0026#39;s what Tesla owners can safely do to help\"\u003e\u003c/iframe\u003e\n                    \u003c/p\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eSo what should you do if you want to safely help a gas vehicle driver with a dead battery? This next suggestion isn\u0026#39;t endorsed by Tesla either, but some owners mention that it\u0026#39;s much less risky to let the ICE vehicle\u0026#39;s battery charge from Tesla\u0026#39;s 12-volt battery for a while, like 10 to 15 minutes. When the gas car is ready to attempt starting, disconnect the jumper cables (used as charging leads) from the Tesla first.\u003c/p\u003e\n\u003cp\u003eNow would be a good time to mention that some recent Tesla models are moving away from regular 12-volt car batteries altogether in favor of a 16-volt lithium-ion auxiliary battery. If you have the new 16-volt architecture or you\u0026#39;re not sure which type you have, definitely do not attempt to connect to an ICE vehicle. On one Tesla forum, some particularly good-hearted EV owners mention carrying a small, \u003ca href=\"https://www.jalopnik.com/cool-tool-heres-a-cheap-jump-start-battery-pack-that-a-1846598842/\" target=\"_blank\"\u003einexpensive lithium-ion jumpstart pack\u003c/a\u003e to assist stranded gas car drivers without risking damage to their own whips. Perhaps Tesla owners aren\u0026#39;t so bad, after all?\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-04T23:25:00Z",
  "modifiedTime": "2025-05-04T23:25:00Z"
}
