{
  "id": "70758a64-5366-4d0c-afe0-05373d655d21",
  "title": "Trump Gutted FAA Days Before Fatal Air Collision",
  "link": "https://jalopnik.com/trump-gutted-faa-days-before-fatal-air-collision-1851752028",
  "description": "An American Airlines regional jet collided with a U.S. Army Black Hawk helicopter at about 9:00 p.m. Wednesday night, reportedly killing all 64 people in the plane and the three soldiers in the helicopter. Authorities are still in the process of searching for the bodies of the deceased, but it’s already being called…Read more...",
  "author": "Collin Woodard",
  "published": "Thu, 30 Jan 2025 21:15:00 GMT",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "trump",
    "disaster accident",
    "spacex",
    "black hawk",
    "federal aviation administration",
    "spacex",
    "michael whitaker",
    "american airlines",
    "aviation safety",
    "hyperloop",
    "airport",
    "tesla",
    "mike whitaker",
    "biden",
    "air traffic control",
    "elon musk"
  ],
  "byline": "Collin Woodard",
  "length": 3814,
  "excerpt": "We still don't know what, specifically, caused the crash.",
  "siteName": "Jalopnik",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/341329e55edf8a8a922929e6eb19ebde.png",
  "text": "An American Airlines regional jet collided with a U.S. Army Black Hawk helicopter at about 9:00 p.m. Wednesday night, reportedly killing all 64 people in the plane and the three soldiers in the helicopter. Authorities are still in the process of searching for the bodies of the deceased, but it’s already being called the deadliest commercial plane crash since 2001. So it sure as hell isn’t a great time to hear that Trump eliminated the Aviation Security Advisory Committee and ran off the guy in charge, as well as the fact that the Federal Aviation Administration says air traffic control was understaffed at the time of the crash.Suggested ReadingTesla Investor Day 2023 Was Pretty Great if You Ignored ElonOffEnglishSuggested ReadingThe new old president wasted no time throwing the federal government into chaos, including eliminating the Aviation Security Advisory Committee on January 22. The Trump administration reportedly told them the Department of Homeland Security was getting rid of everyone who was on an advisory committee at the time, saying it was part of a “commitment to eliminating the misuse of resources and ensuring that DHS activities prioritize our national security.”The administration appears to be betting it can get away with a technicality since it only fired the people on the committee but didn’t go as far as to eliminate the committee. It still exists, but it has no members. So technically, they aren’t violating the 1988 law that required the creation of the committee. It’s total bullshit, but it’s also not like the Supreme Court has shown any sign that it will push back against Trump’s illegal and unconstitutional moves, so that’s fun. We also learned that Michael Whitaker, who had served as the head of the Federal Aviation Administration under Biden, resigned, with the Daily Beast reporting that he was run out of D.C. by Trump’s new favorite lap dog, Tesla CEO Elon Musk. Or rather, that should be “SpaceX CEO Elon Musk.” Whitaker wanted to fine SpaceX for breaking the law, and Musk didn’t like that. As we’ve seen, SpaceX doesn’t have the best environmental track record, and if the government started enforcing those laws, it would get very expensive and inconvenient for Musk’s rocket ship company.Musk hasn’t been quiet about his distaste for Whitaker and the FAA, complaining many times on X, the social media site he bought and subsequently turned into a Nazi bar, calling for Whitaker to resign, saying the FAA needed to be reformed and responding positively to a user whose post said the FAA should not exist. While FAA administrators usually serve a five-year term, Whitaker resigned after about a year.What’s perhaps most concerning, though, is a report that the air traffic control tower at Ronald Reagan National Airport was understaffed at the time of the collision. According to a preliminary Federal Aviation Administration safety report seen by the New York Times, staffing was “not normal for the time of day and volume of traffic.” That meant the controller in charge of helicopters was also in charge of planes, something the FAA doesn’t normally do. Among other reasons, planes and helicopters typically communicate on different frequencies, requiring controllers to split their attention.This isn’t new, though. The Reagan ATC tower has reportedly had staffing issues for years. While they have 19 fully certified controllers as of September 2023, the union and FAA want at least 30. Because of the staffing issues, controllers often work six days a week on shifts that run for at least six hours. So, of course, the Trump administration also included air traffic controllers in its buyout offer. Because the one thing you need when ATC is understaffed is fewer controllers. The next however many years is going to be just wonderful, isn’t it?",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/62b382edaef838fb62ecaed66cb869d9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAn American Airlines regional jet \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/american-airlines-jet-carrying-60-passengers-crashes-in-1851751317\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/american-airlines-jet-carrying-60-passengers-crashes-in-1851751317\"\u003ecollided with a U.S. Army Black Hawk helicopter\u003c/a\u003e\u003c/span\u003e at about 9:00 p.m. Wednesday night, reportedly killing all 64 people in the plane and the three soldiers in the helicopter. Authorities are still in the process of searching for the bodies of the deceased, but it’s already being called the deadliest commercial plane crash \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.cbsnews.com/newyork/news/new-york-city-remembers-victims-of-american-airlines-flight-587-crash-22-years-later/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.cbsnews.com/newyork/news/new-york-city-remembers-victims-of-american-airlines-flight-587-crash-22-years-later/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003esince 2001\u003c/a\u003e\u003c/span\u003e. So it sure as hell isn’t a great time to hear that Trump \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eeliminated the Aviation Security Advisory Committee\u003c/a\u003e\u003c/span\u003e and \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eran off the guy in charge\u003c/a\u003e\u003c/span\u003e, as well as the fact that the Federal Aviation Administration says \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.nytimes.com/live/2025/01/29/us/plane-crash-washington-dc?partner=bloomberg#staffing-was-not-normal-at-airport-tower-according-to-a-preliminary-faa-report\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.nytimes.com/live/2025/01/29/us/plane-crash-washington-dc?partner=bloomberg#staffing-was-not-normal-at-airport-tower-according-to-a-preliminary-faa-report\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eair traffic control was understaffed\u003c/a\u003e\u003c/span\u003e at the time of the crash.\u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"193952\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Tesla Investor Day 2023 Was Pretty Great if You Ignored Elon\" data-video-blog-id=\"12\" data-video-network=\"jalopnik\" data-video-duration=\"108\" data-playlist=\"193952,195687,197316\" data-current=\"193952\"\u003e\u003cdiv\u003e\u003cp\u003eTesla Investor Day 2023 Was Pretty Great if You Ignored Elon\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/193952/193952_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/193952/193952_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/193952/193952_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/193952/193952_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003ctrack kind=\"captions\" label=\"English\" src=\"https://kinja.com/api/videoupload/caption/19415.vtt\" srclang=\"en\"/\u003e\u003c/video\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-label=\"\"\u003eOff\u003c/li\u003e\u003cli data-label=\"English\"\u003eEnglish\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eThe new old president wasted no time throwing the federal government into chaos, including eliminating the Aviation Security Advisory Committee on January 22. The Trump administration reportedly told them the Department of Homeland Security was getting rid of everyone who was on an advisory committee at the time, saying it was part of a “commitment to eliminating the misuse of resources and ensuring that DHS activities prioritize our national security.”\u003cbr/\u003e\u003c/p\u003e\u003cp\u003eThe administration appears to be betting it can get away with a technicality since it only fired the people on the committee but didn’t go as far as to eliminate the committee. It still exists, but it has no members. So technically, they aren’t violating the 1988 law that required the creation of the committee. It’s total bullshit, but it’s also not like the Supreme Court has shown any sign that it will push back against Trump’s illegal and unconstitutional moves, so that’s fun. \u003c/p\u003e\u003cp\u003eWe also learned that Michael Whitaker, who had served as the head of the Federal Aviation Administration under Biden, resigned, with the Daily Beast reporting that he was run out of D.C. by Trump’s new favorite lap dog, Tesla CEO Elon Musk. Or rather, that should be “SpaceX CEO Elon Musk.” Whitaker wanted to fine SpaceX for breaking the law, and Musk didn’t like that. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/spacex-flights-in-2024-will-emit-more-co2-in-the-u-s-t-1851651952\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/spacex-flights-in-2024-will-emit-more-co2-in-the-u-s-t-1851651952\"\u003eAs we’ve seen\u003c/a\u003e\u003c/span\u003e, SpaceX doesn’t have the best environmental track record, and if the government started enforcing those laws, it would get very expensive and inconvenient for Musk’s rocket ship company.\u003c/p\u003e\u003cp\u003eMusk hasn’t been quiet about his distaste for Whitaker and the FAA, complaining many times on X, the social media site he bought and subsequently turned into a Nazi bar, calling for Whitaker to resign, saying the FAA needed to be reformed and responding positively to a user whose post said the FAA should not exist. While FAA administrators usually serve a five-year term, Whitaker resigned after about a year.\u003c/p\u003e\u003cp\u003eWhat’s perhaps most concerning, though, is a report that the air traffic control tower at Ronald Reagan National Airport was understaffed at the time of the collision. According to a preliminary Federal Aviation Administration safety \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.nytimes.com/2025/01/30/business/air-traffic-control-staffing-plane-crash.html\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.nytimes.com/2025/01/30/business/air-traffic-control-staffing-plane-crash.html\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ereport seen by the \u003cem\u003eNew York Times\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e, staffing was “not normal for the time of day and volume of traffic.” That meant the controller in charge of helicopters was also in charge of planes, something the FAA doesn’t normally do. Among other reasons, planes and helicopters typically communicate on different frequencies, requiring controllers to split their attention.\u003c/p\u003e\u003cp\u003eThis isn’t new, though. The Reagan ATC tower has reportedly had staffing issues for years. While they have 19 fully certified controllers as of September 2023, the union and FAA want at least 30. Because of the staffing issues, controllers often work six days a week on shifts that run for at least six hours. So, of course, the Trump administration also included air traffic controllers in its buyout offer. Because the one thing you need when ATC is understaffed is fewer controllers. The next however many years is going to be just wonderful, isn’t it?\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-30T16:15:00-05:00",
  "modifiedTime": null
}
