{
  "id": "7cf99eb6-b778-4858-8a81-3dc1075c6003",
  "title": "You can sleep in Xpeng's new EV – but should you?",
  "link": "https://www.autocar.co.uk/opinion/new-cars/you-can-sleep-xpengs-new-ev-%E2%80%93-should-you",
  "description": "In-car sleeping is an advertised feature of Xpeng's G6, not just a theoretical possibility Have you ever noticed that there are regional market trends for seat adjustment mechanisms? I never had, until a wise colleague some years ago pointed one out. “Japanese and Korean cars very often have lever-style adjusters for seat recline,” he said, “whereas European and American cars [those without motorised seats, at least] tend to have those wheel-style adjusters that you have to wind all the way up and down.” This, he assured me, is because it’s much more common in Asian countries – Japan especially – than it is elsewhere for people to sleep in their cars, and a simpler recline mechanism (literally just lift, plonk, snore) makes this a lot easier. Makes sense: I can imagine Tokyo business types, after a ridiculously long day of work and socialising, preferring to grab some shut-eye in the front seat, rather than schlepping an hour home just to get up and turn around all the earlier to come back the following morning. And in-car sleeping, funnily enough, might be becoming a global trend. A couple of test cars I’ve driven recently have been especially suited to it. The first was the Hyundai Inster, a pint-sized electric hatchback in which all four seats can be folded flat to make a decent-sized sleeping area. Which is especially funny, because the car itself can’t be much bigger than a king-sized bed. The second, about which you will be reading in an upcoming road test, is the Xpeng G6. This is quite a derivative mid-sized electric crossover that’s plainly out to steal the lunch of the Tesla Model Y. The fact that it offers no fewer than three ‘sleep space’ cabin layouts might be the most interesting thing about it. Because the front seats are motorised, the car at least partially converts itself. You just whip out the front headrests, then select which ‘mode’ you want from the touchscreen. You can have one front seat flattened or both of them, or you can have the front chairs motored forwards and convert the back-seat area and boot for sleeping (the back-seat folding is done manually). An inflatable mattress can be supplied with the car as an accessory, to be pumped up from the 12V socket. And then, and rather importantly, once your sleeping area is set up, the climate control will stay active for as long as you like, maintaining a comfortable slumbering temperature, whereas in other cars it would automatically shut down after a while. Presumably because it’s electric, the G6 can shuffle power between its high- and low-voltage power circuits to enable this. And you might well have it plugged in and on charge at the same time, of course. The infotainment system can play a range of lullaby-like audio tracks while you drop off, too. The crackling of a bonfire was my favourite. Car-sleeping is the kind of thing that gets romanticised in car brochures, but I doubt if it would really catch on as a selling point in the UK. Our laws are quite particular about where and how it’s legal to do it. Make a habit of it and you’re likely to be woken by a police officerbefore too long, because sleeping in a car while inebriated remains a specific criminal offence. But, frankly, who would want to do it sober? It’s often prohibited in private car parks. You need to seek permission if you’re on privately owned land. And even in the places where it is safe and legal, we still live in Britain, of course, so you’re likely to attract attention from locals who assume you’re homeless, dispossessed or simply odd and would rather report you to the police and have you moved on than let you represent any kind of risk to their golden retriever. In any case, the G6 that I tested didn’t have the mattress accessory included, so sadly I couldn’t properly test its effectiveness as a mobile sleeping pod. I would have been willing, reader, in the interests of journalistic thoroughness. I’m just not quite sure where I would have parked to do it, or what people would have thought of me.",
  "author": "",
  "published": "Sun, 16 Mar 2025 07:00:48 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Opinion"
  ],
  "byline": "Matt Saunders",
  "length": 3708,
  "excerpt": "In-car sleeping is an advertised feature of Xpeng's G6, not just a theoretical possibility",
  "siteName": "Autocar",
  "favicon": "",
  "text": "You can have one front seat flattened or both of them, or you can have the front chairs motored forwards and convert the back-seat area and boot for sleeping (the back-seat folding is done manually). An inflatable mattress can be supplied with the car as an accessory, to be pumped up from the 12V socket. And then, and rather importantly, once your sleeping area is set up, the climate control will stay active for as long as you like, maintaining a comfortable slumbering temperature, whereas in other cars it would automatically shut down after a while. Presumably because it’s electric, the G6 can shuffle power between its high- and low-voltage power circuits to enable this. And you might well have it plugged in and on charge at the same time, of course. The infotainment system can play a range of lullaby-like audio tracks while you drop off, too. The crackling of a bonfire was my favourite. Car-sleeping is the kind of thing that gets romanticised in car brochures, but I doubt if it would really catch on as a selling point in the UK. Our laws are quite particular about where and how it’s legal to do it. Make a habit of it and you’re likely to be woken by a police officerbefore too long, because sleeping in a car while inebriated remains a specific criminal offence. But, frankly, who would want to do it sober? It’s often prohibited in private car parks. You need to seek permission if you’re on privately owned land. And even in the places where it is safe and legal, we still live in Britain, of course, so you’re likely to attract attention from locals who assume you’re homeless, dispossessed or simply odd and would rather report you to the police and have you moved on than let you represent any kind of risk to their golden retriever. In any case, the G6 that I tested didn’t have the mattress accessory included, so sadly I couldn’t properly test its effectiveness as a mobile sleeping pod. I would have been willing, reader, in the interests of journalistic thoroughness. I’m just not quite sure where I would have parked to do it, or what people would have thought of me. Matt Saunders Title: Road test editor As Autocar’s chief car tester and reviewer, it’s Matt’s job to ensure the quality, objectivity, relevance and rigour of the entirety of Autocar’s reviews output, as well contributing a great many detailed road tests, group tests and drive reviews himself. Matt has been an Autocar staffer since the autumn of 2003, and has been lucky enough to work alongside some of the magazine’s best-known writers and contributors over that time. He served as staff writer, features editor, assistant editor and digital editor, before joining the road test desk in 2011. Since then he’s driven, measured, lap-timed, figured, and reported on cars as varied as the Bugatti Veyron, Rolls-Royce Phantom, Tesla Roadster, Ariel Hipercar, Tata Nano, McLaren Senna, Renault Twizy and Toyota Mirai. Among his wider personal highlights of the job have been covering Sebastien Loeb’s record-breaking run at Pikes Peak in 2013; doing 190mph on derestricted German autobahn in a Brabus Rocket; and driving McLaren’s legendary ‘XP5’ F1 prototype. His own car is a trusty Mazda CX-5. NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/xpeng-g6-seats-road-test-column.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eYou can have one front seat flattened or both of them, or you can have the front chairs motored forwards and convert the back-seat area and boot for sleeping (the back-seat folding is done manually).\u003c/p\u003e\n\u003cp\u003eAn inflatable mattress can be supplied with the car as an accessory, to be pumped up from the 12V socket.\u003c/p\u003e\n\u003cp\u003eAnd then, and rather importantly, once your sleeping area is set up, the climate control will stay active for as long as you like, maintaining a comfortable slumbering temperature, whereas in other cars it would automatically shut down after a while.\u003c/p\u003e\n\u003cp\u003ePresumably because it’s electric, the G6 can shuffle power between its high- and low-voltage power circuits to enable this. And you might well have it plugged in and on charge at the same time, of course.\u003c/p\u003e\n\u003cp\u003eThe infotainment system can play a range of lullaby-like audio tracks while you drop off, too.\u003c/p\u003e\n\u003cp\u003eThe crackling of a bonfire was my favourite. Car-sleeping is the kind of thing that gets romanticised in car brochures, but I doubt if it would really catch on as a selling point in the UK.\u003c/p\u003e\n\u003cp\u003eOur laws are quite particular about where and how it’s legal to do it. Make a habit of it and you’re likely to be woken by a police officerbefore too long, because sleeping in a car while inebriated remains a specific criminal offence.\u003c/p\u003e\n\u003cp\u003eBut, frankly, who would want to do it sober? It’s often prohibited in private car parks. You need to seek permission if you’re on privately owned land.\u003c/p\u003e\n\u003cp\u003eAnd even in the places where it is safe and legal, we still live in Britain, of course, so you’re likely to attract attention from locals who assume you’re homeless, dispossessed or simply odd and would rather report you to the police and have you moved on than let you represent any kind of risk to their golden retriever.\u003c/p\u003e\n\u003cp\u003eIn any case, the G6 that I tested didn’t have the mattress accessory included, so sadly I couldn’t properly test its effectiveness as a mobile sleeping pod.\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \u003cdiv\u003e\n\u003cp\u003eI would have been willing, reader, in the interests of journalistic thoroughness.\u003c/p\u003e\u003cblock\u003e\n\n    \n    \n    \n              \n    \n    \n  \u003c/block\u003e\n\u003cp\u003eI’m just not quite sure where I would have parked to do it, or what people would have thought of me.\u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\n  \n      \n  \n  \u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/matt-saunders\"\u003eMatt Saunders\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/matt-saunders\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/matt-saunders-autocar.jpg\" width=\"150\" height=\"150\" alt=\"Matt Saunders Autocar\" title=\"Matt Saunders Autocar\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eRoad test editor\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eAs Autocar’s chief car tester and reviewer, it’s Matt’s job to ensure the quality, objectivity, relevance and rigour of the entirety of Autocar’s reviews output, as well contributing a great many detailed road tests, group tests and drive reviews himself.\u003c/p\u003e\n\u003cp\u003eMatt has been an Autocar staffer since the autumn of 2003, and has been lucky enough to work alongside some of the magazine’s best-known writers and contributors over that time. He served as staff writer, features editor, assistant editor and digital editor, before joining the road test desk in 2011.\u003c/p\u003e\n\u003cp\u003eSince then he’s driven, measured, lap-timed, figured, and reported on cars as varied as the \u003ca href=\"https://www.autocar.co.uk/car-review/bugatti/veyron-2005-2015\"\u003eBugatti Veyron\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/rolls-royce/phantom\"\u003eRolls-Royce Phantom\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/tesla/roadster-2008-2012\"\u003eTesla Roadster\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/ariel/hipercar\"\u003eAriel Hipercar\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/tata/nano\"\u003eTata Nano\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/mclaren/senna\"\u003eMcLaren Senna\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/renault/twizy\"\u003eRenault Twizy\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/toyota/mirai\"\u003eToyota Mirai\u003c/a\u003e. Among his wider personal highlights of the job have been covering Sebastien Loeb’s record-breaking run at Pikes Peak in 2013; \u003cspan\u003edoing 190mph on derestricted German autobahn in a Brabus Rocket; \u003c/span\u003eand driving McLaren’s legendary ‘XP5’ F1 prototype. His own car is a trusty Mazda CX-5.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-16T07:00:48Z",
  "modifiedTime": null
}
