{
  "id": "7d933f7a-45b3-46f2-9c88-1f7f82ae46de",
  "title": "Night light: We try overnight track ‘day’ in the Mazda MX-5",
  "link": "https://www.autocar.co.uk/car-news/features/night-light-we-try-overnight-track-day-mazda-mx-5",
  "description": "Not only is the MX-5 good on track, it also swallowed up the six-hour drive to Anglesey with aplomb We take to North Wales, in winter, for a world-first unlit track night I am peddling my Mazda MX-5 as fast as I dare. In front of me is almost perfect darkness. I know there's a sharp right-hander coming up quickly, but I’m finding it difficult to pick a braking point, because behind me is a PENETRATING high beam from the front bumper-mounted auxiliary lights of a 1990s Mitsubishi Evo rally car.  I turn right. Make it round the corner without incident. Then, indicate right, stay right, and hear the tsu tsu schuu of a turbo wastegate fly past on the left. Man, this driving at track in the dark malarkey is no joke.  I am taking part in the “world’s first unlit night time track day” at Anglesey. Yep, North Wales, at night, in the winter. Mission Motorsport - the forces motorsport charity - does not mess about.  It has hosted its Race of Remembrance endurance event at Trac Mon for more than a decade and has decided to run a track night to give regular folk the chance to enjoy the special madness that is a racing circuit, set next to the coast, at 2 degrees. Mazda’s PR Manager, Owen Mildenhall, has invited me along in my long-term MX-5 so I can get a bit of track driving in.  Owen is a man completely au fait with driving on track at night, having competed in the Nurburgring 24 hours, whereas I am not. In fact I have never even driven round Anglesey. So I decide to get there early, before daybreak, to at least get round the track during daylight hours. Anglesey - despite what its General Manager Annette Freeman says - is in the arse end of nowhere. Which means I got to take the Mazda on its first long trip. In years gone by, a six-hour journey in a low-slung sports car would have probably warranted a separate article. But the ease at which a modern MX-5 can shrug this off makes it barely worth mentioning. Within 30 minutes of arriving at the track I realise I have thoroughly underestimated the amount of faffing and form filling required to actually get moving.  I only achieve five laps out during daytime. And they were a bit of a blur to be honest. I didn’t manage to pick a quiet time and it felt like more serious racing machinery was constantly coming up in the rear view mirror and I was always off-line letting things pass and not quite learning the track. Night time soon comes and we head out on track. There were around 25 cars taking part in total, split into two groups. I was in the first group. As I exit the fully lit pitlane and emerge onto the track I begin to understand the size of the task at hand. After a few corners, the bright, clear, warm iridescent lights of the pitlane seem a lifetime ago.  The light sources are now harsh, unfamiliar and flickering. If they were a film they’d come with an epilepsy warning. The first few laps were done behind a safety car, and once that pulls in things improve. The faster, more serious machinery gets away and leaves the slower stuff (including me) behind. I get past a couple of slower cars and within a few laps I’m on my own. I thought this might be the toughest, but the truth is that this was the best. The cat's eyes dotted around the track were easy to follow, softly improved by the lights of other, distant cars ahead. I fell into a flow, and really, really enjoyed it. There was potential for a bit of bravado and red-mist to kick in but it just didn’t. People let other people pass. There were no big-time Charlies here doing their best Lewis Hamilton impressions. Sure, this word’s first might have been a bit tenuous, but we were all pioneers in our own, small way. Doing our best. Admittedly, the foglights off some of the more serious stuff was bloody bright where they’re barreling down on you. The Track mode on this MX-5 is brilliant, by the way. It’s new for this to-spec Homura car and it really allows quite the angle and velocity of slip before it intervenes. The steering is a delight - loads of feedback, light, and direct too. Especially appreciated considering for one session I went roof down jacket on, and didn’t exactly have the space to do a lot of steering. The engine is surprisingly muscular too. There were a few other earlier model MX-5s and a Clio 182 on track and while theoretically similar in power, I could really sense the advantage I had on the straights. Our nine o’clock curfew soon came round and me and my photographer Max retire to the on-site cafe for a pre-ordered Lasagna and chips. I really feel like I’ve earned my double carbs.  Track days - despite no racing per se - are pretty full on. And to do one at night, with no big floodlights, relying purely on your own car’s lights and the ones of others was pretty hairy at times. But truly fun, invigorating and a one-of-a-kind experience.",
  "author": "",
  "published": "Sat, 22 Mar 2025 07:00:48 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Murray Scullion",
  "length": 4720,
  "excerpt": "We take to North Wales, in winter, for a world-first unlit track night",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Within 30 minutes of arriving at the track I realise I have thoroughly underestimated the amount of faffing and form filling required to actually get moving.  I only achieve five laps out during daytime. And they were a bit of a blur to be honest. I didn’t manage to pick a quiet time and it felt like more serious racing machinery was constantly coming up in the rear view mirror and I was always off-line letting things pass and not quite learning the track. Night time soon comes and we head out on track. There were around 25 cars taking part in total, split into two groups. I was in the first group. As I exit the fully lit pitlane and emerge onto the track I begin to understand the size of the task at hand. After a few corners, the bright, clear, warm iridescent lights of the pitlane seem a lifetime ago.  The light sources are now harsh, unfamiliar and flickering. If they were a film they’d come with an epilepsy warning. The first few laps were done behind a safety car, and once that pulls in things improve. The faster, more serious machinery gets away and leaves the slower stuff (including me) behind. I get past a couple of slower cars and within a few laps I’m on my own. I thought this might be the toughest, but the truth is that this was the best. The cat's eyes dotted around the track were easy to follow, softly improved by the lights of other, distant cars ahead. I fell into a flow, and really, really enjoyed it. There was potential for a bit of bravado and red-mist to kick in but it just didn’t. People let other people pass. There were no big-time Charlies here doing their best Lewis Hamilton impressions. Sure, this word’s first might have been a bit tenuous, but we were all pioneers in our own, small way. Doing our best. Admittedly, the foglights off some of the more serious stuff was bloody bright where they’re barreling down on you. The Track mode on this MX-5 is brilliant, by the way. It’s new for this to-spec Homura car and it really allows quite the angle and velocity of slip before it intervenes. The steering is a delight - loads of feedback, light, and direct too. Especially appreciated considering for one session I went roof down jacket on, and didn’t exactly have the space to do a lot of steering. The engine is surprisingly muscular too. There were a few other earlier model MX-5s and a Clio 182 on track and while theoretically similar in power, I could really sense the advantage I had on the straights. Our nine o’clock curfew soon came round and me and my photographer Max retire to the on-site cafe for a pre-ordered Lasagna and chips. I really feel like I’ve earned my double carbs.  Track days - despite no racing per se - are pretty full on. And to do one at night, with no big floodlights, relying purely on your own car’s lights and the ones of others was pretty hairy at times. But truly fun, invigorating and a one-of-a-kind experience. Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. Murray Scullion Title: Digital editor Murray has been a journalist for more than a decade. During that time he’s written for magazines, newspapers and websites, but he now finds himself as Autocar’s digital editor. He leads the output of the website and contributes to all other digital aspects, including the social media channels, podcasts and videos. During his time he has reviewed cars ranging from £50 - £500,000, including Austin Allegros and Ferrari 812 Superfasts. He has also interviewed F1 megastars, knows his PCPs from his HPs and has written, researched and experimented with behavioural surplus and driverless technology. Murray graduated from the University of Derby with a BA in Journalism in 2014 and has previously written for Classic Car Weekly, Modern Classics Magazine, buyacar.co.uk, parkers.co.uk and CAR Magazine, as well as carmagazine.co.uk. used Mazda MX-5 cars for sale In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/anglesey-night-track-session-2025-me-8.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eWithin 30 minutes of arriving at the track I realise I have thoroughly underestimated the amount of faffing and form filling required to actually get moving. \u003c/p\u003e\n\u003cp\u003eI only achieve five laps out during daytime. And they were a bit of a blur to be honest. I didn’t manage to pick a quiet time and it felt like more serious racing machinery was constantly coming up in the rear view mirror and I was always off-line letting things pass and not quite learning the track.\u003c/p\u003e\n\u003cp\u003eNight time soon comes and we head out on track. There were around 25 cars taking part in total, split into two groups. I was in the first group. As I exit the fully lit pitlane and emerge onto the track I begin to understand the size of the task at hand. After a few corners, the bright, clear, warm iridescent lights of the pitlane seem a lifetime ago. \u003c/p\u003e\n\u003cp\u003eThe light sources are now harsh, unfamiliar and flickering. If they were a film they’d come with an epilepsy warning.\u003c/p\u003e\n\u003cp\u003eThe first few laps were done behind a safety car, and once that pulls in things improve. The faster, more serious machinery gets away and leaves the slower stuff (including me) behind. I get past a couple of slower cars and within a few laps I’m on my own.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/anglesey-night-track-session-2025-me-7-1600x1067-2a7ae54b-c7fc-45f9-b0a1-f9b6c52f75c5.jpg?itok=yyiF4YiR\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/anglesey-night-track-session-2025-me-7-1600x1067-2a7ae54b-c7fc-45f9-b0a1-f9b6c52f75c5.jpg?itok=yyiF4YiR\"/\u003e\u003c/p\u003e\n\u003cp\u003eI thought this might be the toughest, but the truth is that this was the best. The cat\u0026#39;s eyes dotted around the track were easy to follow, softly improved by the lights of other, distant cars ahead. I fell into a flow, and really, really enjoyed it.\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003eThere was potential for a bit of bravado and red-mist to kick in but it just didn’t. People let other people pass. There were no big-time Charlies here doing their best Lewis Hamilton impressions. Sure, this word’s first might have been a bit tenuous, but we were all pioneers in our own, small way. Doing our best. Admittedly, the foglights off some of the more serious stuff was bloody bright where they’re barreling down on you.\u003c/p\u003e\n\u003cp\u003eThe Track mode on this MX-5 is brilliant, by the way. It’s new for this to-spec Homura car and it really allows quite the angle and velocity of slip before it intervenes. The steering is a delight - loads of feedback, light, and direct too. Especially appreciated considering for one session I went roof down jacket on, and didn’t exactly have the space to do a lot of steering.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/anglesey-night-track-session-2025-me-21-1600x1067-ebe69992-9d91-4042-b9fb-4e936b050427.jpg?itok=-8ga-Cw6\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/anglesey-night-track-session-2025-me-21-1600x1067-ebe69992-9d91-4042-b9fb-4e936b050427.jpg?itok=-8ga-Cw6\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe engine is surprisingly muscular too. There were a few other earlier model MX-5s and a \u003ca href=\"https://www.autocar.co.uk/car-news/used-car-buying-guides/renault-sport-clio\"\u003eClio 182\u003c/a\u003e on track and while theoretically similar in power, I could really sense the advantage I had on the straights.\u003c/p\u003e\n\u003cp\u003eOur nine o’clock curfew soon came round and me and my photographer Max retire to the on-site cafe for a pre-ordered Lasagna and chips. I really feel like I’ve earned my double carbs. \u003c/p\u003e\n\u003cp\u003eTrack days - despite no racing per se - are pretty full on. And to do one at night, with no big floodlights, relying purely on your own car’s lights and the ones of others was pretty hairy at times. But truly fun, invigorating and a one-of-a-kind experience.\u003c/p\u003e\n            \u003c/div\u003e\u003cdiv\u003e\n          \u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/murray-scullion\"\u003eMurray Scullion\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/murray-scullion\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/murray-scullion-mug.jpg\" width=\"1600\" height=\"1600\" alt=\"Murray Scullion\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eDigital editor\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eMurray has been a journalist for more than a decade. During that time he’s written for magazines, newspapers and websites, but he now finds himself as Autocar’s digital editor.\u003c/p\u003e\n\u003cp\u003eHe leads the output of the website and contributes to all other digital aspects, including the social media channels, podcasts and videos. During his time he has reviewed cars ranging from £50 - £500,000, including Austin Allegros and Ferrari 812 Superfasts. He has also interviewed F1 megastars, knows his PCPs from his HPs and has written, researched and experimented with behavioural surplus and driverless technology.\u003c/p\u003e\n\u003cp\u003eMurray graduated from the University of Derby with a BA in Journalism in 2014 and has previously written for Classic Car Weekly, Modern Classics Magazine, buyacar.co.uk, parkers.co.uk and CAR Magazine, as well as carmagazine.co.uk.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused Mazda MX-5 cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogo.png\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-22T07:00:48Z",
  "modifiedTime": null
}
