{
  "id": "7dd3c225-26b9-4aa3-90a7-41c0d060df0a",
  "title": "Toyota Land Cruiser",
  "link": "https://www.autocar.co.uk/car-review/toyota/land-cruiser",
  "description": "Rejuvenated icon promises better on-road manners without compromising off-road capability The Toyota Land Cruiser is proof that the Japanese firm truly offers the most diverse model range in the business. Sure, one could haul a Mercedes A-Class inside a Mercedes Actros, but they don’t live next to each other in showrooms. Whereas you could drive away from a Toyota dealer in anything from a 65mpg hybrid supermini to a straight-six manual sports car – or an off-roader with a ladder-frame chassis, a live rear axle and a 2.8-litre four-cylinder diesel engine.The Land Cruiser helped build the Japanese brand’s reputation for solid engineering, and although it is a bit of a niche thing in Europe, elsewhere it’s still massive.You can take that literally: in some markets, the Land Cruiser has its own model range, including the 4.6m-long Land Cruiser 300 Series and the ultra-old-school Land Cruiser 70 Series. That comes with a 4.5-litre V8 diesel and a manual ’box.Over here, we get just the 250 Series, also known as Prado, and it entered a new generation in 2024. It’s not electric, it’s not even a hybrid (not over here, anyway) and the mechanical specification hasn’t radically altered from the old one.But although the new J250-generation Land Cruiser isn’t a radical departure from the J150  before it, there’s still plenty to talk about.The Toyota Land Cruiser range at a glanceAll Land Cruisers sold in the UK are powered by the familiar 2.8-litre four-cylinder diesel engine from the old Land Cruiser and the current Toyota Hilux pick-up truck, although it has been updated for a broader spread of torque through a new, smaller turbocharger. A 48V mild-hybrid version will join the range later.The four-pot diesel is paired with a new eight-speed automatic gearbox. Toyota calls it Direct Shift, which means it is a torque converter with a lock-up clutch that closes at lower speeds than before. Toyota offers two specifications: Invincible and First Edition. The First Edition, offered in limited numbers and now sold out, exclusively features a paint job reminiscent of the classic 1960s Land Cruiser 40, with round headlights and either Smoky Blue or Land Sand paint, matched with a grey roof. All cars come as standard with black leather upholstery, dual-zone air conditioning, a 12.3in touchscreen and a head-up display. Other equipment includes a JBL stereo, a panoramic reversing camera, a digital driver’s display, 20in alloy wheels and a sunroof.What’s quite unusual is that you can choose from two entirely different headlight designs: one square, one circular. First Edition cars get the circular lights as standard, and Invincible cars get square ones.",
  "author": "",
  "published": "Wed, 4 Dec 2024 19:00:00 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Illya VerpraetRoad Tester",
  "length": 1262,
  "excerpt": "Rejuvenated icon promises better on-road manners without compromising off-road capability",
  "siteName": "Autocar",
  "favicon": "",
  "text": "But although the new J250-generation Land Cruiser isn’t a radical departure from the J150  before it, there’s still plenty to talk about. The Toyota Land Cruiser range at a glance All Land Cruisers sold in the UK are powered by the familiar 2.8-litre four-cylinder diesel engine from the old Land Cruiser and the current Toyota Hilux pick-up truck, although it has been updated for a broader spread of torque through a new, smaller turbocharger. A 48V mild-hybrid version will join the range later. The four-pot diesel is paired with a new eight-speed automatic gearbox. Toyota calls it Direct Shift, which means it is a torque converter with a lock-up clutch that closes at lower speeds than before.  Toyota offers two specifications: Invincible and First Edition. The First Edition, offered in limited numbers and now sold out, exclusively features a paint job reminiscent of the classic 1960s Land Cruiser 40, with round headlights and either Smoky Blue or Land Sand paint, matched with a grey roof.  All cars come as standard with black leather upholstery, dual-zone air conditioning, a 12.3in touchscreen and a head-up display. Other equipment includes a JBL stereo, a panoramic reversing camera, a digital driver’s display, 20in alloy wheels and a sunroof.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/toyota_land_cruiser_lead.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eBut although the new J250-generation Land Cruiser isn’t a radical departure from the J150  before it, there’s still plenty to talk about.\u003c/p\u003e\n\u003ch2\u003eThe Toyota Land Cruiser range at a glance\u003c/h2\u003e\n\u003cp\u003eAll Land Cruisers sold in the UK are powered by the familiar 2.8-litre four-cylinder diesel engine from the old Land Cruiser and the current\u003ca href=\"https://www.autocar.co.uk/car-review/toyota/hilux\"\u003e Toyota Hilux\u003c/a\u003e \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/top-10-best-pickup-trucks\"\u003epick-up truck\u003c/a\u003e, although it has been updated for a broader spread of torque through a new, smaller turbocharger. A 48V mild-hybrid version will join the range later.\u003c/p\u003e\n\u003cp\u003eThe four-pot diesel is paired with a new eight-speed automatic gearbox. Toyota calls it Direct Shift, which means it is a torque converter with a lock-up clutch that closes at lower speeds than before. \u003c/p\u003e\n\u003cp\u003eToyota offers two specifications: Invincible and First Edition. The First Edition, offered in limited numbers and now sold out, exclusively features a paint job reminiscent of the classic 1960s Land Cruiser 40, with round headlights and either Smoky Blue or Land Sand paint, matched with a grey roof. \u003c/p\u003e\n\u003cp\u003eAll cars come as standard with black leather upholstery, dual-zone air conditioning, a 12.3in touchscreen and a head-up display. Other equipment includes a JBL stereo, a panoramic reversing camera, a digital driver’s display, 20in alloy wheels and a sunroof.            \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
