{
  "id": "7fe94724-1b1a-4754-9b90-2fb2cdeff6db",
  "title": "Nissan Leaf reinvented as fastback SUV - and we've driven it",
  "link": "https://www.autocar.co.uk/car-news/new-cars/nissan-leaf-reinvented-fastback-suv-and-weve-driven-it",
  "description": "Nissan says insights from customers can help new Leaf ‘set standard for future EVs’ The Nissan Leaf has been reinvented as a sleek SUV with a range of up to 375 miles thart its chief engineer has vowed will “set the standard for future electric vehicles” – and we've had a first taste. The pioneering EV was launched in 2010 as a mid-sized hatchback but has been entirely reinvented for this third generation to take on the likes of the Skoda Elroq and Kia EV3 in the family crossover class. It will be sold globally and manufactured at Nissan's Sunderland plant in the UK. While the new Leaf has just been revealed, Autocar has already had two runs in prototype versions, first at Nissan's Grandrive test track in Japan and then at Millbrook Proving Ground in the UK. New Nissan Leaf: technical details The new Leaf sits on the CMF-EV platform that's used by the larger Nissan Ariya and various Renault EVs, meaning it’s technically unrelated to the first two generations of Leaf. However, chief engineer Hiroki Isobe told Autocar that learnings from those cars – gained from more than 700,000 global sales that led to more than 17 billion miles of driving – were invaluable. “The aim was to set the standard for future electric vehicles,” he said. “We’re building on the Leaf DNA: it’s created for everyday customers and the goal was to create an easy-to-use EV that can be driven without any discomfort. We have a huge database of information about what customers want.” That put the focus on maximising the efficiency of the Leaf, which resulted in an aerodynamically sculpted body, including flush door handles, a steeply raked windscreen and an underfloor cover, combining for a drag coefficient of just 0.25. There’s also a revamped ‘three-in-one’ electric motor and a separate heat pump to optimise the efficiency of the heating system. It sits on 18in or 19in tyres, depending on spec. Two battery options will be offered, with usable capacities of 52kWh and 75kWh, giving the car an official range of 271 or 375 miles. But Nissan emphasises its efficiency at motorway speed, claiming it can cover more than 200 miles at an 80mph cruise. Unlike previous Leafs, the new car will be equipped in the UK with a CCS charging system, rather than a Chademo one, which can take DC rapid-charging rates of up to 150kW. The interior has also been completely reinvented, with the dashboard built around a pair of 14.3in screens running a Google-based infotainment system. Despite the Leaf’s new fastback bodystyle, Nissan claims it has plenty of rear head room, while the boot capacity is put at 437 litres. The Leaf will be offered with a range of semiautonomous driving technology and a 3.7kW vehicle-to-load outlet. It will be built and sold globally, including at Sunderland. That plant has been heavily upgraded and expanded to house production of the Leaf along with the next-generation Juke and Qashqai crossovers, which are both set to sit on the same CMF-EV platform. While the new Juke is expected in the coming years, the next-generation Qashqai has been delayed. First drive: Nissan Leaf prototype The new Nissan Leaf feels like a bit of a milestone moment: it’s the first mainstream mass-market EV to reach a third generation. Although that really depends on how you define such things: to all intents and purposes, the new Leaf is an entirely new model. The only thing it has in common with its pioneering predecessors is a name. The original Leaf arrived in 2010 as a mid-sized five-door hatchback with a Chademo charging port, a 24kWh battery, a 124-mile range, a price tag of £23,350 after a government grant and a whole load of novelty about whether a car powered by batteries could actually find mainstream buyers. The Mk2 Leaf followed in 2018, eventually featuring a 60kWh battery that gave it a range of up to 239 miles and priced from £21,990 (again, after a government grant). Fifteen years after being launched and the Leaf is as unrecognisable compared with its predecessors as the concept of a government grant is to UK EV buyers. For this third generation it has grown substantially and is now firmly a crossover – albeit a very sleek one – rather than a hatchback. That shift in size helps make way for the new Renault-built Nissan Micra but is also designed to position the new Leaf as the primary car of a household. The Leaf now sits on the same platform as the larger Ariya EV and has a strong family resemblance to that model: it’s determinedly less frumpy than the Leafs of old. That’s in part because of the brief the development team was set, described by chief vehicle engineer Hiroki Isobe as: “Efficiency, efficiency, efficiency.” Plenty of sleek aerodynamic elements help the new body to achieve that improved drag coefficient of 0.25 (the Mk2 Leaf’s was 0.28) and thereby maximise range, and there’s now a bespoke heat pump for the heating system. With the biggest 75kWh (usable capacity) battery pack fitted, the Leaf has an official range of 375 miles. But the main focus has been on offering real-world range at speed, and indeed Nissan claims it can cover more than 200 miles at an 80mph cruise. When you do reach your destination, it will charge at up to 150kW via – gasp! – a CCS plug. At which time, can we all please spare a moment to remember Chademo, forever to be remembered as the Betamax of EV charging? Any judgement on that will have to wait, though, because so far our running in the Leaf has been far more limited. I sampled a prototype version under a long embargo at Nissan’s Grandrive test track in Yokohama, then last week editor Mark Tisshaw tackled the Hill Route at Millbrook Proving Ground in one. Both tracks gave hints at the new Leaf’s dynamic prowess but little more. Mechanically, the Leaf has a new ‘three-in-one’ electric motor (meaning it combines the inverter, motor and reducer into a single package) that sends up to 214bhp and 261lb ft of torque to the front wheels. There’s MacPherson-strut suspension up front and a multi-link arrangement at the rear, while wheel sizes range from 18in to 19in. Nissan says the Leaf has been set up for a comfortable ride in order to better fit its family car brief. And even on a short drive, what’s instantly apparent is the refinement: it’s really quiet and calm, with strong noise isolation. The power delivery feels linear and smooth as well: it’s not an EV for showing off with dramatic acceleration, but it has strong pick-up, as you would expect. The Mk2 Leaf’s one-pedal mode returns, plus there’s now adjustable brake regen controlled by paddles on the steering wheel. They work well, but I suspect most drivers will end up using the one-pedal mode most of the time. When it comes to dynamics, the new Leaf is fairly typical among crossovers of this size: our initial experiences have revealed no real foibles or annoyances that would put you off, but those searching for pure driver engagement will be left wanting. Still, the steering is well weighted and it’s a very relaxing car to drive. It’s also a pleasant place to sit: the dashboard’s twin digital screens are crisp and clear and there are useful physical buttons for key functions, although we didn’t have enough time to really find out how well either worked. The layout is a little more traditional than the Ariya’s, but in terms of practicality that’s not a bad thing at all. Back in 2010, there were no rivals for it if you were looking for something electric, but today the electric crossover market is incredibly crowded. Nissan will be relieved, then, that these early drives suggest the reinvented Leaf should find itself near the sharp end.",
  "author": "",
  "published": "Tue, 17 Jun 2025 13:00:00 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "James Attwood, Felix Page",
  "length": 6232,
  "excerpt": "Nissan confirms full debut for new electric crossover in June ahead of production starting in Sunderland",
  "siteName": "Autocar",
  "favicon": "",
  "text": "There’s also a revamped ‘three-in-one’ electric motor and a separate heat pump to optimise the efficiency of the heating system. It sits on 18in or 19in tyres, depending on spec. Two battery options will be offered, with usable capacities of 52kWh and 75kWh, giving the car an official range of 271 or 375 miles. But Nissan emphasises its efficiency at motorway speed, claiming it can cover more than 200 miles at an 80mph cruise. Unlike previous Leafs, the new car will be equipped in the UK with a CCS charging system, rather than a Chademo one, which can take DC rapid-charging rates of up to 150kW. The interior has also been completely reinvented, with the dashboard built around a pair of 14.3in screens running a Google-based infotainment system. Despite the Leaf’s new fastback bodystyle, Nissan claims it has plenty of rear head room, while the boot capacity is put at 437 litres. The Leaf will be offered with a range of semiautonomous driving technology and a 3.7kW vehicle-to-load outlet. It will be built and sold globally, including at Sunderland. That plant has been heavily upgraded and expanded to house production of the Leaf along with the next-generation Juke and Qashqai crossovers, which are both set to sit on the same CMF-EV platform. While the new Juke is expected in the coming years, the next-generation Qashqai has been delayed. First drive: Nissan Leaf prototype The new Nissan Leaf feels like a bit of a milestone moment: it’s the first mainstream mass-market EV to reach a third generation. Although that really depends on how you define such things: to all intents and purposes, the new Leaf is an entirely new model. The only thing it has in common with its pioneering predecessors is a name. The original Leaf arrived in 2010 as a mid-sized five-door hatchback with a Chademo charging port, a 24kWh battery, a 124-mile range, a price tag of £23,350 after a government grant and a whole load of novelty about whether a car powered by batteries could actually find mainstream buyers. The Mk2 Leaf followed in 2018, eventually featuring a 60kWh battery that gave it a range of up to 239 miles and priced from £21,990 (again, after a government grant). Fifteen years after being launched and the Leaf is as unrecognisable compared with its predecessors as the concept of a government grant is to UK EV buyers. For this third generation it has grown substantially and is now firmly a crossover – albeit a very sleek one – rather than a hatchback. That shift in size helps make way for the new Renault-built Nissan Micra but is also designed to position the new Leaf as the primary car of a household. The Leaf now sits on the same platform as the larger Ariya EV and has a strong family resemblance to that model: it’s determinedly less frumpy than the Leafs of old. That’s in part because of the brief the development team was set, described by chief vehicle engineer Hiroki Isobe as: “Efficiency, efficiency, efficiency.” Plenty of sleek aerodynamic elements help the new body to achieve that improved drag coefficient of 0.25 (the Mk2 Leaf’s was 0.28) and thereby maximise range, and there’s now a bespoke heat pump for the heating system. With the biggest 75kWh (usable capacity) battery pack fitted, the Leaf has an official range of 375 miles. But the main focus has been on offering real-world range at speed, and indeed Nissan claims it can cover more than 200 miles at an 80mph cruise. When you do reach your destination, it will charge at up to 150kW via – gasp! – a CCS plug. At which time, can we all please spare a moment to remember Chademo, forever to be remembered as the Betamax of EV charging? Any judgement on that will have to wait, though, because so far our running in the Leaf has been far more limited. I sampled a prototype version under a long embargo at Nissan’s Grandrive test track in Yokohama, then last week editor Mark Tisshaw tackled the Hill Route at Millbrook Proving Ground in one. Both tracks gave hints at the new Leaf’s dynamic prowess but little more. Mechanically, the Leaf has a new ‘three-in-one’ electric motor (meaning it combines the inverter, motor and reducer into a single package) that sends up to 214bhp and 261lb ft of torque to the front wheels. There’s MacPherson-strut suspension up front and a multi-link arrangement at the rear, while wheel sizes range from 18in to 19in. Nissan says the Leaf has been set up for a comfortable ride in order to better fit its family car brief. And even on a short drive, what’s instantly apparent is the refinement: it’s really quiet and calm, with strong noise isolation. Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. James Attwood Title: Associate editor James is Autocar’s associate editor, and has more than 20 years of experience of working in automotive and motorsport journalism. He has been in his current role since September 2024, and helps lead Autocar's features and new sections, while regularly interviewing some of the biggest names in the industry. Oh, and he once helped make Volkswagen currywurst. Really. Before first joining Autocar in 2017, James spent more than a decade in motorsport journalist, working on Autosport, autosport.com, F1 Racing and Motorsport News, covering everything from club rallying to top-level international events. He also spent 18 months running Move Electric, Haymarket's e-mobility title, where he developed knowledge of the e-bike and e-scooter markets.  NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/2026-nissan-leaf-front-quarter-tracking.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eThere’s also a revamped ‘three-in-one’ electric motor and a separate heat pump to optimise the efficiency of the heating system. It sits on 18in or 19in tyres, depending on spec.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"2026 Nissan Leaf – rear quarter static\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/2026-nissan-leaf-rear-quarter-static.jpg?itok=8ow3MYth\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/2026-nissan-leaf-rear-quarter-static.jpg?itok=8ow3MYth\"/\u003e\u003c/p\u003e\n\u003cp\u003eTwo battery options will be offered, with usable capacities of 52kWh and 75kWh, giving the car an official range of 271 or 375 miles. But Nissan emphasises its efficiency at motorway speed, claiming it can cover more than 200 miles at an 80mph cruise.\u003c/p\u003e\n\u003cp\u003eUnlike previous Leafs, the new car will be equipped in the UK with a CCS charging system, rather than a Chademo one, which can take DC rapid-charging rates of up to 150kW.\u003c/p\u003e\n\u003cp\u003eThe interior has also been completely reinvented, with the dashboard built around a pair of 14.3in screens running a Google-based infotainment system.\u003c/p\u003e\n\u003cp\u003eDespite the Leaf’s new fastback bodystyle, Nissan claims it has plenty of rear head room, while the boot capacity is put at 437 litres.\u003c/p\u003e\n\u003cp\u003eThe Leaf will be offered with a range of semiautonomous driving technology and a 3.7kW vehicle-to-load outlet.\u003c/p\u003e\n\u003cp\u003eIt will be built and sold globally, including at Sunderland. That plant has been heavily upgraded and expanded to house production of the Leaf along with the \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/first-look-new-electric-nissan-juke-ahead-2026-launch\"\u003enext-generation Juke\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/electric-nissan-qashqai\"\u003eQashqai crossovers\u003c/a\u003e, which are both set to sit on the same CMF-EV platform.\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003eWhile the new Juke is expected in the coming years, the next-generation Qashqai has been delayed.\u003c/p\u003e\n\u003ch2\u003eFirst drive: Nissan Leaf prototype\u003c/h2\u003e\n\u003cp\u003eThe new \u003ca href=\"https://www.autocar.co.uk/car-review/nissan/leaf\"\u003eNissan Leaf\u003c/a\u003e feels like a bit of a milestone moment: it’s the first mainstream mass-market EV to reach a third generation. Although that really depends on how you define such things: to all intents and purposes, the new Leaf is an entirely new model. The only thing it has in common with its pioneering predecessors is a name.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.autocar.co.uk/car-review/nissan/leaf-2011-2017\"\u003eoriginal Leaf\u003c/a\u003e arrived in 2010 as a mid-sized five-door hatchback with a Chademo charging port, a 24kWh battery, a 124-mile range, a price tag of £23,350 after a government grant and a whole load of novelty about whether a car powered by batteries could actually find mainstream buyers.\u003c/p\u003e\n\u003cp\u003eThe Mk2 Leaf followed in 2018, eventually featuring a 60kWh battery that gave it a range of up to 239 miles and priced from £21,990 (again, after a government grant).\u003c/p\u003e\n\u003cp\u003eFifteen years after being launched and the Leaf is as unrecognisable compared with its predecessors as the concept of a government grant is to UK EV buyers. For this third generation it has grown substantially and is now firmly a crossover – albeit a very sleek one – rather than a hatchback. That shift in size helps make way for the new Renault-built \u003ca href=\"https://www.autocar.co.uk/car-review/nissan/micra\"\u003eNissan Micra\u003c/a\u003e but is also designed to position the new Leaf as the primary car of a household.\u003c/p\u003e\n\u003cp\u003eThe Leaf now sits on the same platform as the larger \u003ca href=\"https://www.autocar.co.uk/car-review/nissan/ariya\"\u003eAriya EV\u003c/a\u003e and has a strong family resemblance to that model: it’s determinedly less frumpy than the Leafs of old.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"2026 Nissan Leaf – front quarter, cornering\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/2026-nissan-leaf-front-quarter-tracking-cornering.jpg?itok=oG0COINE\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/2026-nissan-leaf-front-quarter-tracking-cornering.jpg?itok=oG0COINE\"/\u003e\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003eThat’s in part because of the brief the development team was set, described by chief vehicle engineer Hiroki Isobe as: “Efficiency, efficiency, efficiency.”\u003c/p\u003e\n\u003cp\u003ePlenty of sleek aerodynamic elements help the new body to achieve that improved drag coefficient of 0.25 (the Mk2 Leaf’s was 0.28) and thereby maximise range, and there’s now a bespoke heat pump for the heating system.\u003c/p\u003e\n\u003cp\u003eWith the biggest 75kWh (usable capacity) battery pack fitted, the Leaf has an official range of 375 miles. But the main focus has been on offering real-world range at speed, and indeed Nissan claims it can cover more than 200 miles at an 80mph cruise.\u003c/p\u003e\n\u003cp\u003eWhen you do reach your destination, it will charge at up to 150kW via – gasp! – a CCS plug. At which time, can we all please spare a moment to remember Chademo, forever to be remembered as the Betamax of EV charging?\u003c/p\u003e\n\u003cp\u003eAny judgement on that will have to wait, though, because so far our running in the Leaf has been far more limited. I sampled a prototype version under a long embargo at \u003ca href=\"https://www.autocar.co.uk/car-review/nissan\"\u003eNissan\u003c/a\u003e’s Grandrive test track in Yokohama, then last week editor \u003ca href=\"https://www.autocar.co.uk/users/mark-tisshaw\"\u003eMark Tisshaw\u003c/a\u003e tackled the Hill Route at Millbrook Proving Ground in one. Both tracks gave hints at the new Leaf’s dynamic prowess but little more.\u003c/p\u003e\n\u003cp\u003eMechanically, the Leaf has a new ‘three-in-one’ electric motor (meaning it combines the inverter, motor and reducer into a single package) that sends up to 214bhp and 261lb ft of torque to the front wheels. There’s MacPherson-strut suspension up front and a multi-link arrangement at the rear, while wheel sizes range from 18in to 19in.\u003c/p\u003e\n\u003cp\u003eNissan says the Leaf has been set up for a comfortable ride in order to better fit its family car brief. And even on a short drive, what’s instantly apparent is the refinement: it’s really quiet and calm, with strong noise isolation.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"2026 Nissan Leaf – cornering, rear\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/2026-nissan-leaf-rear-quarter-tracking-cornering.jpg?itok=AtvogFP7\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/2026-nissan-leaf-rear-quarter-tracking-cornering.jpg?itok=AtvogFP7\"/\u003e            \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/james-attwood\"\u003eJames Attwood\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/james-attwood\"\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/attersmug.jpg\" width=\"205\" height=\"205\" alt=\"James Attwood, digital editor\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eAssociate editor\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003eJames is Autocar’s associate \u003c/span\u003e\u003cspan\u003eeditor, and has more than 20 years of experience of working in automotive and motorsport journalism. He has been in his current role since September 2024\u003c/span\u003e\u003cspan\u003e, and helps lead Autocar\u0026#39;s features and new sections\u003c/span\u003e\u003cspan\u003e, while regularly interviewing some of the biggest names in the industry. Oh, and he once helped make Volkswagen currywurst.\u003c/span\u003e Really.\u003c/p\u003e\n\u003cp\u003eBefore first joining Autocar in 2017, James spent more than a decade in motorsport journalist, working on Autosport, autosport.com, F1 Racing and Motorsport News, covering everything from club rallying to top-level international events. He also spent 18 months running Move Electric, Haymarket\u0026#39;s e-mobility title, where he developed knowledge of the e-bike and e-scooter markets. \u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-03T10:38:37Z",
  "modifiedTime": null
}
