{
  "id": "88c7b7a0-86b5-4e4e-b619-45caec10bfba",
  "title": "India UK FTA: Luxury cars, premium bikes to get cheaper",
  "link": "https://www.autocarindia.com/industry/india-uk-fta-luxury-cars-premium-bikes-to-get-cheaper-435295#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "India and the UK have concluded a landmark trade deal that should give a boost to our country’s automotive sector, along with opening opportunities for both nations to have cheaper imports. As part of the free trade agreement, India will reduce tariffs on “high-end cars” imported from the UK from the current 100 percent to just 10 percent. Meanwhile, “India will gain from tariff elimination on about 99 percent of the tariff lines, covering almost 100 percent of the trade value,” the release stated. However, quotas will be established for automobile imports on both sides, it added. British luxury cars to become more affordable Prices of cars from JLR, Aston Martin, Bentley and Rolls-Royce to reduce As the import duty on made-in-UK cars will come down drastically, carmakers like JLR, Aston Martin, Bentley and Rolls-Royce – all of which manufacture in the UK and import models to India – will likely benefit from price reductions across their respective portfolios. The UK government’s press release states that it has secured “India’s best-ever agreement on rules of origin”. This indicates that cars exported to India may not require local content in order to comply with the new tariff rules. Among the points of clarification still required from both governments are the number of models that will be tariff-free, and what constitutes a “high-end car”. Rs 650 crore worth of cars imported to India from the UK in 2024 In 2024, India imported cars worth Rs 650 crore from the UK, while motorcycle imports stood at Rs 30 crore; the Indian government site also lists auto parts imports worth Rs 1,150 crore during the year. Among the luxury brands present in India – from Mercedes-Benz and BMW to Bentley, Ferrari and Rolls-Royce – JLR accounted for imports worth over Rs 500 crore. Made-in-UK limited edition Triumph bikes will become cheaper The free trade agreement also means limited-edition Triumph bikes, like the Rocket 3 Evel Knievel edition, are likely to reduce in price, as they are directly brought in from the UK. We’ll have to wait and see how much that amounts to when further clarification is provided. Carmakers and bike manufacturers in India could benefit Mahindra, Maruti Suzuki, Toyota, JLR, Royal Enfield, TVS and Bajaj could leverage tariff elimination on imports to the UK The India-UK free trade agreement will also be beneficial for Indian manufacturers like Mahindra, Royal Enfield, TVS and Bajaj, and international companies that manufacture in India, like JLR, Maruti Suzuki and Toyota. These brands are currently importing or plan to import made-in-India models to the UK. Mahindra's executive director and CEO, Auto and Farm Sectors, Rajesh Jejurikar, had said that the brand is looking to launch the BE 6 and XUV 9e in the UK, “We do have a plan to go to the EU with our electric vehicles at some point in the future, but that will be in a calibrated way. We will do right-hand-drive EVs first and then move to left-hand-drive.” The FTA will help price Mahindra’s EVs competitively among other similar-sized e-SUVs in the UK market. Maruti and Toyota’s first EVs, the e Vitara and Urban Cruiser, respectively, are being produced at Suzuki’s Gujarat plant for domestic sales and export, including the UK. The free trade agreement will also help price the Japanese company’s EVs well for the UK market, where it may also go up against the Mahindra BE 6. That JLR already locally assembles the Range Rover Evoque, Range Rover Velar, Range Rover and Land Rover Discovery Sport at its Pune plant means that prices for these models may also reduce in India. There are a few Indian bike makers – Royal Enfield, TVS and Bajaj – who will be able to benefit from the FTA between the two nations. Royal Enfield’s entire portfolio is sold in the UK, which creates opportunities for the brand to start exports from India. Meanwhile, Piaggio, TVS and Bajaj make select models – the Aprilia 457, upcoming Norton bikes and Triumph 400s and sub-400cc KTMs, respectively – in India for the UK market. These would likely see a rationalisation in price as well, making them more affordable there. Also see: Tata loses ground to MG, Mahindra in April 2025 EV sales Next Auto Expo to be held in 2027 New Maharashtra EV Policy 2025: car subsidies, toll waivers explained",
  "author": "Rivan RS",
  "published": "Wed, 7 May 2025 17:59:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Rivan RS",
  "length": 4455,
  "excerpt": "Along with imports from the UK becoming more affordable for Indians, car and bike makers based in India, like Mahindra and TVS, are also likely to benefit from the free trade agreement.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Along with imports from the UK becoming more affordable for Indians, car and bike makers based in India, like Mahindra and TVS, are also likely to benefit from the free trade agreement.India and the UK have concluded a landmark trade deal that should give a boost to our country’s automotive sector, along with opening opportunities for both nations to have cheaper imports. As part of the free trade agreement, India will reduce tariffs on “high-end cars” imported from the UK from the current 100 percent to just 10 percent. Meanwhile, “India will gain from tariff elimination on about 99 percent of the tariff lines, covering almost 100 percent of the trade value,” the release stated. However, quotas will be established for automobile imports on both sides, it added.British luxury cars to become more affordablePrices of cars from JLR, Aston Martin, Bentley and Rolls-Royce to reduceAs the import duty on made-in-UK cars will come down drastically, carmakers like JLR, Aston Martin, Bentley and Rolls-Royce – all of which manufacture in the UK and import models to India – will likely benefit from price reductions across their respective portfolios. The UK government’s press release states that it has secured “India’s best-ever agreement on rules of origin”. This indicates that cars exported to India may not require local content in order to comply with the new tariff rules.Among the points of clarification still required from both governments are the number of models that will be tariff-free, and what constitutes a “high-end car”.Rs 650 crore worth of cars imported to India from the UK in 2024In 2024, India imported cars worth Rs 650 crore from the UK, while motorcycle imports stood at Rs 30 crore; the Indian government site also lists auto parts imports worth Rs 1,150 crore during the year. Among the luxury brands present in India – from Mercedes-Benz and BMW to Bentley, Ferrari and Rolls-Royce – JLR accounted for imports worth over Rs 500 crore.Made-in-UK limited edition Triumph bikes will become cheaperThe free trade agreement also means limited-edition Triumph bikes, like the Rocket 3 Evel Knievel edition, are likely to reduce in price, as they are directly brought in from the UK. We’ll have to wait and see how much that amounts to when further clarification is provided.Carmakers and bike manufacturers in India could benefitMahindra, Maruti Suzuki, Toyota, JLR, Royal Enfield, TVS and Bajaj could leverage tariff elimination on imports to the UKThe India-UK free trade agreement will also be beneficial for Indian manufacturers like Mahindra, Royal Enfield, TVS and Bajaj, and international companies that manufacture in India, like JLR, Maruti Suzuki and Toyota. These brands are currently importing or plan to import made-in-India models to the UK.Mahindra's executive director and CEO, Auto and Farm Sectors, Rajesh Jejurikar, had said that the brand is looking to launch the BE 6 and XUV 9e in the UK, “We do have a plan to go to the EU with our electric vehicles at some point in the future, but that will be in a calibrated way. We will do right-hand-drive EVs first and then move to left-hand-drive.” The FTA will help price Mahindra’s EVs competitively among other similar-sized e-SUVs in the UK market.Maruti and Toyota’s first EVs, the e Vitara and Urban Cruiser, respectively, are being produced at Suzuki’s Gujarat plant for domestic sales and export, including the UK. The free trade agreement will also help price the Japanese company’s EVs well for the UK market, where it may also go up against the Mahindra BE 6.That JLR already locally assembles the Range Rover Evoque, Range Rover Velar, Range Rover and Land Rover Discovery Sport at its Pune plant means that prices for these models may also reduce in India.There are a few Indian bike makers – Royal Enfield, TVS and Bajaj – who will be able to benefit from the FTA between the two nations. Royal Enfield’s entire portfolio is sold in the UK, which creates opportunities for the brand to start exports from India. Meanwhile, Piaggio, TVS and Bajaj make select models – the Aprilia 457, upcoming Norton bikes and Triumph 400s and sub-400cc KTMs, respectively – in India for the UK market. These would likely see a rationalisation in price as well, making them more affordable there.Also see:Tata loses ground to MG, Mahindra in April 2025 EV salesNext Auto Expo to be held in 2027New Maharashtra EV Policy 2025: car subsidies, toll waivers explained",
  "image": "https://img.autocarindia.com/ExtraImages/20250507055950_India_UK_Free_trade_agreement_Range_Rover_Maruti_e_Vitara.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eAlong with imports from the UK becoming more affordable for Indians, car and bike makers based in India, like Mahindra and TVS, are also likely to benefit from the free trade agreement.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIndia and the UK have concluded a landmark trade deal that should give a boost to our country’s automotive sector, along with opening opportunities for both nations to have cheaper imports. As part of the free trade agreement, India will reduce tariffs on “high-end cars” imported from the UK from the current 100 percent to just 10 percent. Meanwhile, “India will gain from tariff elimination on about 99 percent of the tariff lines, covering almost 100 percent of the trade value,” the release stated. However, quotas will be established for automobile imports on both sides, it added.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBritish luxury cars to become more affordable\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003ePrices of cars from JLR, Aston Martin, Bentley and Rolls-Royce to reduce\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eAs the import duty on made-in-UK cars will come down drastically, carmakers like \u003ca href=\"https://www.autocarindia.com/industry/jlr-ev-india-manufacturing-plans-shelved-report-434827\"\u003e\u003cstrong\u003eJLR\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.autocarindia.com/cars/aston-martin\"\u003e\u003cstrong\u003eAston Martin\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.autocarindia.com/cars/bentley\"\u003e\u003cstrong\u003eBentley\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/rolls-royce\"\u003e\u003cstrong\u003eRolls-Royce\u003c/strong\u003e\u003c/a\u003e – all of which manufacture in the UK and import models to India – will likely benefit from price reductions across their respective portfolios. The UK government’s press release states that it has secured “India’s best-ever agreement on rules of origin”. This indicates that cars exported to India may not require local content in order to comply with the new tariff rules.\u003c/p\u003e\u003cp\u003eAmong the points of clarification still required from both governments are the number of models that will be tariff-free, and what constitutes a “high-end car”.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eRs 650 crore worth of cars imported to India from the UK in 2024\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eIn 2024, India imported cars worth Rs 650 crore from the UK, while motorcycle imports stood at Rs 30 crore; the Indian government site also lists auto parts imports worth Rs 1,150 crore during the year. Among the luxury brands present in India – from \u003ca href=\"https://www.autocarindia.com/cars/mercedes-benz\"\u003e\u003cstrong\u003eMercedes-Benz\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/bmw\"\u003e\u003cstrong\u003eBMW\u003c/strong\u003e\u003c/a\u003e to Bentley, \u003ca href=\"https://www.autocarindia.com/cars/ferrari\"\u003e\u003cstrong\u003eFerrari\u003c/strong\u003e\u003c/a\u003e and Rolls-Royce – \u003ca href=\"https://www.autocarindia.com/industry/jlr-india-records-21-percent-sales-growth-in-h1-fy25-433249\"\u003e\u003cstrong\u003eJLR\u003c/strong\u003e\u003c/a\u003e accounted for imports worth over Rs 500 crore.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMade-in-UK limited edition Triumph bikes will become cheaper\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe free trade agreement also means limited-edition Triumph bikes, like the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/bike-news/triumph-rocket-3-evel-knievel-edition-unveiled-433992/\"\u003eRocket 3 Evel Knievel edition\u003c/a\u003e\u003c/strong\u003e, are likely to reduce in price, as they are directly brought in from the UK. We’ll have to wait and see how much that amounts to when further clarification is provided.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eCarmakers and bike manufacturers in India could benefit\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eMahindra, Maruti Suzuki, Toyota, JLR, Royal Enfield, TVS and Bajaj could leverage tariff elimination on imports to the UK\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe India-UK free trade agreement will also be beneficial for Indian manufacturers like \u003ca href=\"https://www.autocarindia.com/cars/mahindra\"\u003e\u003cstrong\u003eMahindra\u003c/strong\u003e\u003c/a\u003e, Royal Enfield, TVS and Bajaj, and international companies that manufacture in India, like JLR, \u003ca href=\"https://www.autocarindia.com/cars/maruti-suzuki\"\u003e\u003cstrong\u003eMaruti Suzuki\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/toyota\"\u003e\u003cstrong\u003eToyota\u003c/strong\u003e\u003c/a\u003e. These brands are currently importing or plan to import made-in-India models to the UK.\u003c/p\u003e\u003cp\u003eMahindra\u0026#39;s executive director and CEO, Auto and Farm Sectors, Rajesh Jejurikar, had said that the brand is looking to launch the \u003ca href=\"https://www.autocarindia.com/cars/mahindra/be-6e\"\u003e\u003cstrong\u003eBE 6\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/mahindra/xev-9e\"\u003e\u003cstrong\u003eXUV 9e\u003c/strong\u003e\u003c/a\u003e in the UK, “We do have a plan to go to the EU with our electric vehicles at some point in the future, but that will be in a calibrated way. We will do right-hand-drive EVs first and then move to left-hand-drive.” The FTA will help price Mahindra’s EVs competitively among other similar-sized e-SUVs in the UK market.\u003c/p\u003e\u003cp\u003eMaruti and Toyota’s first EVs, the \u003ca href=\"https://www.autocarindia.com/cars/maruti-suzuki/e-vitara\"\u003e\u003cstrong\u003ee Vitara\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/car-news/toyota-urban-cruiser-ev-makes-india-debut-auto-expo-2025-434207\"\u003e\u003cstrong\u003eUrban Cruiser\u003c/strong\u003e\u003c/a\u003e, respectively, are being produced at Suzuki’s Gujarat plant for domestic sales and export, including the UK. The free trade agreement will also help price the Japanese company’s EVs well for the UK market, where it may also go up against the Mahindra BE 6.\u003c/p\u003e\u003cp\u003eThat JLR already locally assembles the \u003ca href=\"https://www.autocarindia.com/cars/land-rover/range-rover-evoque\"\u003e\u003cstrong\u003eRange Rover Evoque\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.autocarindia.com/cars/land-rover/range-rover-velar\"\u003e\u003cstrong\u003eRange Rover Velar\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.autocarindia.com/cars/land-rover/range-rover\"\u003e\u003cstrong\u003eRange Rover\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/land-rover/discovery-sport\"\u003e\u003cstrong\u003eLand Rover Discovery Sport\u003c/strong\u003e\u003c/a\u003e at its Pune plant means that prices for these models may also reduce in India.\u003c/p\u003e\u003cp\u003eThere are a few Indian bike makers – \u003ca href=\"https://www.autocarindia.com/bikes/royal-enfield\"\u003e\u003cstrong\u003eRoyal Enfield\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.autocarindia.com/bikes/tvs\"\u003e\u003cstrong\u003eTVS\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/bikes/bajaj\"\u003e\u003cstrong\u003eBajaj\u003c/strong\u003e\u003c/a\u003e – who will be able to benefit from the FTA between the two nations. Royal Enfield’s entire portfolio is sold in the UK, which creates opportunities for the brand to start exports from India. Meanwhile, Piaggio, TVS and Bajaj make select models – the \u003ca href=\"https://www.autocarindia.com/bike-news/aprilia-tuono-457-launched-at-rs-395-lakh-434588\"\u003e\u003cstrong\u003eAprilia 457\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.autocarindia.com/bike-news/tvs-confirms-norton-india-launch-by-end-2025-435293\"\u003e\u003cstrong\u003eupcoming Norton bikes\u003c/strong\u003e\u003c/a\u003e and Triumph 400s and sub-400cc KTMs, respectively – in India for the UK market. These would likely see a rationalisation in price as well, making them more affordable there.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/tata-loses-ground-to-mg-mahindra-in-april-2025-ev-sales-435285\"\u003eTata loses ground to MG, Mahindra in April 2025 EV sales\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/next-auto-expo-to-be-held-in-2027-435270\"\u003eNext Auto Expo to be held in 2027\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/industry/new-maharashtra-ev-policy-2025-car-subsidies-toll-waivers-explained-435252\"\u003e\u003cstrong\u003eNew Maharashtra EV Policy 2025: car subsidies, toll waivers explained\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-07T17:59:00+05:30",
  "modifiedTime": null
}
