{
  "id": "8e0e5154-ced7-4ec2-ae9f-b8d6c2ca3bf2",
  "title": "Elon Musk Confirms Tesla's New Cheap Car Will Just Be A Stripped Down Model Y",
  "link": "https://www.jalopnik.com/1921330/tesla-new-cheap-car-just-a-model-y/",
  "description": "No word on what the new Model Y will (or, rather, won't) feature.",
  "author": "Nicholas Werner",
  "published": "Thu, 24 Jul 2025 19:49:01 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "News",
    "Tesla"
  ],
  "byline": "Nicholas Werner",
  "length": 2268,
  "excerpt": "No word on what the new Model Y will (or, rather, won't) feature.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "During its second-quarter 2025 earnings call, Tesla formally declared that, yes, at long last, it would be making a cheaper car. As the accomplished salesman he is, CEO Elon Musk really went all out to hype up the new vehicle, pulling out every trick in the book to delight both your intellect and your senses: \"It's just a Model Y,\" he said. Well, with a pitch like that, sign me up! Production of the cheaper Model Y actually began in June, although full capacity won't ramp up until later in the year. It ought to go on sale in Q4, according to Tesla, and you know that when Tesla gives you a date, you can take that to the bank. No word on what the new Model Y will (or, rather, won't) feature. The news isn't exactly surprising. Word came last year that the so-called \"Model 2,\" a brand-new cheap EV from Tesla, had been canceled before ever being announced. But Tesla certainly needs something to get its flagging revenue back up, as its woeful Q2 report makes clear. Musk promises (promises!) this will come in the form of robotaxis, despite the fact that that business model isn't expected to turn a profit for years to come. Just in case robot cars don't immediately bring cash in the door, Tesla has to have a backup option to lift it out of its hole. The cheaper version of the company's bestseller is it. What to strip out of a Model Y to make it cheaper So, what can Tesla actually do to bring the price down? There's actually a precedent for this: Last year, Tesla unveiled a decontented Model 3 for sale in Mexico. This trim swapped out the leather upholstery for cloth, reduced the interior ambient lights to white only, and ditched the rear-facing screen and heated seats. Plausibly, it could do the same to the Model Y. Right now, a base Model Y goes for $44,990, before taxes and (expiring) tax credits. Mexico's bottom trim Model 3 sells for about 9% less than the next higher one, so applying that math here would result in a compact SUV at about $41,000, give or take. Might Tesla go further? To do that, it would really need to slash the battery down, which would be a pretty major move. That, or take the brakes out.",
  "image": "https://www.jalopnik.com/img/gallery/teslas-new-cheap-car-is-just-a-stripped-down-model-y/l-intro-1753386516.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eDuring its second-quarter 2025 earnings call, Tesla formally declared that, yes, at long last, it would be making a cheaper car. As the accomplished salesman he is, CEO Elon Musk really went all out to hype up the new vehicle, pulling out every trick in the book to delight both your intellect and your senses: \u0026#34;It\u0026#39;s just a Model Y,\u0026#34; he said. Well, with a pitch like that, sign me up!\u003c/p\u003e\n\u003cp\u003eProduction of the cheaper Model Y actually began in June, although full capacity won\u0026#39;t ramp up until later in the year. It ought to go on sale in Q4, according to Tesla, and you know that when Tesla gives you a date, you can take that to the bank. No word on what the new Model Y will (or, rather, won\u0026#39;t) feature.\u003c/p\u003e\n\u003cp\u003eThe news isn\u0026#39;t exactly surprising. \u003ca href=\"https://www.jalopnik.com/affordable-25-000-tesla-is-officially-dead-unless-you-1851680285/\" target=\"_blank\"\u003eWord came last year that the so-called \u0026#34;Model 2,\u0026#34;\u003c/a\u003e a brand-new cheap EV from Tesla, had been canceled before ever being announced. But Tesla certainly needs something to get its flagging revenue back up, as \u003ca href=\"https://www.jalopnik.com/1921111/elon-musk-loses-12-billion-in-wealth-overnight/\" target=\"_blank\"\u003eits woeful Q2 report makes clear\u003c/a\u003e. Musk promises (promises!) this will come in the form of robotaxis, despite the fact that \u003ca href=\"https://www.jalopnik.com/1914869/robotaxis-8-years-break-even/\" target=\"_blank\"\u003ethat business model isn\u0026#39;t expected to turn a profit for years to come\u003c/a\u003e. Just in case robot cars don\u0026#39;t immediately bring cash in the door, Tesla has to have a backup option to lift it out of its hole. The cheaper version of the company\u0026#39;s bestseller is it.\u003c/p\u003e\n\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhat to strip out of a Model Y to make it cheaper\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eSo, what can Tesla actually do to bring the price down? There\u0026#39;s actually a precedent for this: Last year, Tesla unveiled a decontented Model 3 for sale in Mexico. This trim swapped out the leather upholstery for cloth, reduced the interior ambient lights to white only, and ditched the rear-facing screen and heated seats. Plausibly, it could do the same to the Model Y.\u003c/p\u003e\n\u003cp\u003eRight now, a base Model Y goes for $44,990, before taxes and \u003ca href=\"https://www.jalopnik.com/1908217/automakers-working-overtime-to-sell-evs-before-tax-credit-killed/\" target=\"_blank\"\u003e(expiring) tax credits\u003c/a\u003e. Mexico\u0026#39;s bottom trim Model 3 sells for about 9% less than the next higher one, so applying that math here would result in a compact SUV at about $41,000, give or take. Might Tesla go further? To do that, it would really need to slash the battery down, which would be a pretty major move. That, or take the brakes out.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-24T19:49:01Z",
  "modifiedTime": "2025-07-24T19:49:01Z"
}
