{
  "id": "8ee1085f-64f1-480e-80f8-631b22d41dd2",
  "title": "2025 Audi Q8 long term review, 2,300km report",
  "link": "https://www.autocarindia.com/car-long-termer/2025-audi-q8-long-term-review-2300km-report-434494#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
  "description": "Sandy brown, misty gold, light beige. That’s how people described the Q8’s new Sakhir Gold paint shade. The colour proved to be a big talking point in the time the car was with me. Most loved it, often saying it was nice, different and eye-catching. Indeed, in a world of greys and silvers, the Q8’s Sakhir Gold – muted as it is – catches your eye. I have to hand it to Audi here because, in the month that I’ve had it, there have been so many who have come up and asked me about the car, most starting with the colour, of course. As is the norm, the touchscreens are a pain to use, but the media knob is a saviour. Then, it’s the insides they like. The fit and finish are good, and the dark brown seats in our car lend the cabin a nice, rich look. There was high praise from a Defender owner, too; however, he was quick to notice the lack of certain equipment, such as ventilated or massage seats and a powered steering wheel adjust. These are odd misses for an otherwise well-specced car that has soft-close doors, a Bang \u0026 Olufsen sound system, four-zone climate control, a panoramic sunroof, and sliding rear seats. There are also the twin touchscreens, which I am not a fan of. Oddly enough, they started flickering on two separate occasions when answering calls on the car’s native operating system. It has not shown up since. Another oddity with the system is the radio tuner. The UI is not intuitive at all, and there’s no way to see the frequency during a scan. As a result, it’s easier to use voice commands to select a frequency. Tuning the radio is frustrating – controls are buried deep, and there’s no frequency readout. While there’s no third row, the second row slides back and forth, allowing us to fit a large-framed map flat on the boot floor. The rear seats split 40:20:40 (instead of 60:40), so I could carry a long, flat-packed Ikea bookcase despite four of us in the car. Delivering party supplies for one of my wife’s events was also easy enough, and the Q8 swallowed about 40 or so backpacks and all the party supplies. We also took the car to Goa for a short vacation – this time without our kids – so we had less to carry, and the 605-litre boot was more than enough for our two suitcases and laptop bags. The boot lid does taper, but at 605 litres, it can manage a lot. The drive to Goa proved to be redemption for the Q8’s 3.0-litre V6 turbo-petrol engine. It makes 340hp and 500Nm, and power is channelled to all four wheels via Audi’s Quattro all-wheel-drive system. I remember describing the performance as ‘more than adequate’ when I first reviewed the car in South Africa, but South Mumbai is another story. It feels very lethargic in constant start-stop traffic, and that, along with its size, makes it feel ponderous. A dedicated slot keeps the key fob safe and handy, and it feels nice to use. Getting out onto open roads then was a relief and a reminder of how nice the engine can be. Pop the car into Dynamic mode, and it’s sprightly enough. Overtaking is easy, and with the engine kept in a lower gear (higher revs), there isn’t that pause for a kickdown every time you need to get by. Even when you extend the engine, refinement is good, and you get a nice, sporty note. The trip to Goa was also redemption – only relatively speaking – for the TFSI engine’s drinking habits. Getting it past 5kpl in town is a challenge, and I managed it only once. Out on the two highway runs, though, we managed 9.3kpl (Mumbai to Goa) and 10.1kpl (Goa to Mumbai), measured tankful to tankful. You have to bear in mind that while these figures are poor in absolute terms, they are par for the course for petrol SUVs in this class. The glove box is small and not cooled, so no chilled drinks on long drives. It has been a busy first month for the Q8 in our fleet: lots of in-city running carrying cargo of various shapes and sizes, and a trip to Goa, too. What’s next? I’m sure it’s going to be a trip to Mahabaleshwar with Hormazd soon. Stay tuned for that ‘Maha’ test. Also see: Audi RS Q8 Performance bookings open New ICE-powered Audi A6 global debut on March 4 Audi revises its model naming strategy again",
  "author": "Sergius Barretto",
  "published": "Sat, 15 Feb 2025 08:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
  "categories": null,
  "byline": "Sergius Barretto",
  "length": 4251,
  "excerpt": "First report: Audi\u0026amp;#8217;s flagship SUV enters our fleet and is soon put to work, carrying cargo of all sizes and travelling to Goa.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "First report: Audi’s flagship SUV enters our fleet and is soon put to work, carrying cargo of all sizes and travelling to Goa.Sandy brown, misty gold, light beige. That’s how people described the Q8’s new Sakhir Gold paint shade. The colour proved to be a big talking point in the time the car was with me. Most loved it, often saying it was nice, different and eye-catching. Indeed, in a world of greys and silvers, the Q8’s Sakhir Gold – muted as it is – catches your eye. I have to hand it to Audi here because, in the month that I’ve had it, there have been so many who have come up and asked me about the car, most starting with the colour, of course.As is the norm, the touchscreens are a pain to use, but the media knob is a saviour.Then, it’s the insides they like. The fit and finish are good, and the dark brown seats in our car lend the cabin a nice, rich look. There was high praise from a Defender owner, too; however, he was quick to notice the lack of certain equipment, such as ventilated or massage seats and a powered steering wheel adjust. These are odd misses for an otherwise well-specced car that has soft-close doors, a Bang \u0026 Olufsen sound system, four-zone climate control, a panoramic sunroof, and sliding rear seats. There are also the twin touchscreens, which I am not a fan of. Oddly enough, they started flickering on two separate occasions when answering calls on the car’s native operating system. It has not shown up since. Another oddity with the system is the radio tuner. The UI is not intuitive at all, and there’s no way to see the frequency during a scan. As a result, it’s easier to use voice commands to select a frequency.Tuning the radio is frustrating – controls are buried deep, and there’s no frequency readout.While there’s no third row, the second row slides back and forth, allowing us to fit a large-framed map flat on the boot floor. The rear seats split 40:20:40 (instead of 60:40), so I could carry a long, flat-packed Ikea bookcase despite four of us in the car. Delivering party supplies for one of my wife’s events was also easy enough, and the Q8 swallowed about 40 or so backpacks and all the party supplies. We also took the car to Goa for a short vacation – this time without our kids – so we had less to carry, and the 605-litre boot was more than enough for our two suitcases and laptop bags.The boot lid does taper, but at 605 litres, it can manage a lot.The drive to Goa proved to be redemption for the Q8’s 3.0-litre V6 turbo-petrol engine. It makes 340hp and 500Nm, and power is channelled to all four wheels via Audi’s Quattro all-wheel-drive system. I remember describing the performance as ‘more than adequate’ when I first reviewed the car in South Africa, but South Mumbai is another story. It feels very lethargic in constant start-stop traffic, and that, along with its size, makes it feel ponderous.A dedicated slot keeps the key fob safe and handy, and it feels nice to use.Getting out onto open roads then was a relief and a reminder of how nice the engine can be. Pop the car into Dynamic mode, and it’s sprightly enough. Overtaking is easy, and with the engine kept in a lower gear (higher revs), there isn’t that pause for a kickdown every time you need to get by. Even when you extend the engine, refinement is good, and you get a nice, sporty note. The trip to Goa was also redemption – only relatively speaking – for the TFSI engine’s drinking habits. Getting it past 5kpl in town is a challenge, and I managed it only once. Out on the two highway runs, though, we managed 9.3kpl (Mumbai to Goa) and 10.1kpl (Goa to Mumbai), measured tankful to tankful. You have to bear in mind that while these figures are poor in absolute terms, they are par for the course for petrol SUVs in this class.The glove box is small and not cooled, so no chilled drinks on long drives.It has been a busy first month for the Q8 in our fleet: lots of in-city running carrying cargo of various shapes and sizes, and a trip to Goa, too. What’s next? I’m sure it’s going to be a trip to Mahabaleshwar with Hormazd soon. Stay tuned for that ‘Maha’ test.Also see:Audi RS Q8 Performance bookings openNew ICE-powered Audi A6 global debut on March 4Audi revises its model naming strategy againVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250212052635_Audi_Q8_long_term_review_front_static.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eFirst report: Audi’s flagship SUV enters our fleet and is soon put to work, carrying cargo of all sizes and travelling to Goa.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eSandy brown, misty gold, light beige. That’s how people described the \u003ca href=\"https://www.autocarindia.com/cars/audi/q8/\"\u003e\u003cstrong\u003eQ8\u003c/strong\u003e\u003c/a\u003e’s new Sakhir Gold paint shade. The colour proved to be a big talking point in the time the car was with me. Most loved it, often saying it was nice, different and eye-catching. Indeed, in a world of greys and silvers, the Q8’s Sakhir Gold – muted as it is – catches your eye. I have to hand it to Audi here because, in the month that I’ve had it, there have been so many who have come up and asked me about the car, most starting with the colour, of course.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"2025 Audi Q8 infotainment button\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Audi-Q8-long-term-review-infotainment-button.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"2025 Audi Q8 infotainment button\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAs is the norm, the touchscreens are a pain to use, but the media knob is a saviour.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThen, it’s the insides they like. The fit and finish are good, and the dark brown seats in our car lend the cabin a nice, rich look. There was high praise from a \u003ca href=\"https://www.autocarindia.com/cars/land-rover/defender\"\u003e\u003cstrong\u003eDefender\u003c/strong\u003e\u003c/a\u003e owner, too; however, he was quick to notice the lack of certain equipment, such as ventilated or massage seats and a powered steering wheel adjust. These are odd misses for an otherwise well-specced car that has soft-close doors, a Bang \u0026amp; Olufsen sound system, four-zone climate control, a panoramic sunroof, and sliding rear seats. There are also the twin touchscreens, which I am not a fan of. Oddly enough, they started flickering on two separate occasions when answering calls on the car’s native operating system. It has not shown up since. Another oddity with the system is the radio tuner. The UI is not intuitive at all, and there’s no way to see the frequency during a scan. As a result, it’s easier to use voice commands to select a frequency.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"2025 Audi Q8 infotainment\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Audi-Q8-long-term-review-infotainment.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"2025 Audi Q8 infotainment\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eTuning the radio is frustrating – controls are buried deep, and there’s no frequency readout.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eWhile there’s no third row, the second row slides back and forth, allowing us to fit a large-framed map flat on the boot floor. The rear seats split 40:20:40 (instead of 60:40), so I could carry a long, flat-packed Ikea bookcase despite four of us in the car. Delivering party supplies for one of my wife’s events was also easy enough, and the Q8 swallowed about 40 or so backpacks and all the party supplies. We also took the car to Goa for a short vacation – this time without our kids – so we had less to carry, and the 605-litre boot was more than enough for our two suitcases and laptop bags.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"2025 Audi Q8 boot\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Audi-Q8-long-term-review-boot.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"2025 Audi Q8 boot\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe boot lid does taper, but at 605 litres, it can manage a lot.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe drive to Goa proved to be redemption for the Q8’s 3.0-litre V6 turbo-petrol engine. It makes 340hp and 500Nm, and power is channelled to all four wheels via Audi’s Quattro all-wheel-drive system. I remember describing the performance as ‘more than adequate’ when I \u003ca href=\"https://www.autocarindia.com/car-reviews/audi-q8-facelift-review-mildly-does-it-429777\" title=\"Audi Q8 facelift review: Mildly does it\"\u003e\u003cstrong\u003efirst reviewed the car in South Africa\u003c/strong\u003e\u003c/a\u003e, but South Mumbai is another story. It feels very lethargic in constant start-stop traffic, and that, along with its size, makes it feel ponderous.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"2025 Audi Q8 key\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Audi-Q8-long-term-review-key-holder.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"2025 Audi Q8 key\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eA dedicated slot keeps the key fob safe and handy, and it feels nice to use.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eGetting out onto open roads then was a relief and a reminder of how nice the engine can be. Pop the car into Dynamic mode, and it’s sprightly enough. Overtaking is easy, and with the engine kept in a lower gear (higher revs), there isn’t that pause for a kickdown every time you need to get by. Even when you extend the engine, refinement is good, and you get a nice, sporty note. The trip to Goa was also redemption – only relatively speaking – for the TFSI engine’s drinking habits. Getting it past 5kpl in town is a challenge, and I managed it only once. Out on the two highway runs, though, we managed 9.3kpl (Mumbai to Goa) and 10.1kpl (Goa to Mumbai), measured tankful to tankful. You have to bear in mind that while these figures are poor in absolute terms, they are par for the course for petrol SUVs in this class.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"2025 Audi Q8 glove box\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Audi-Q8-long-term-review-glove-box.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"2025 Audi Q8 glove box\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe glove box is small and not cooled, so no chilled drinks on long drives.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIt has been a busy first month for the Q8 in our fleet: lots of in-city running carrying cargo of various shapes and sizes, and a trip to Goa, too. What’s next? I’m sure it’s going to be a trip to Mahabaleshwar with Hormazd soon. Stay tuned for that ‘Maha’ test.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/audi-rs-q8-performance-bookings-on-at-rs-5-lakh-434380\"\u003eAudi RS Q8 Performance bookings open\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-ice-powered-audi-a6-global-debut-on-march-4-434503\"\u003eNew ICE-powered Audi A6 global debut on March 4\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/audi-revises-its-model-naming-strategy-again-434455\"\u003eAudi revises its model naming strategy again\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434494\"\u003e\u003cul id=\"tab-id-434494\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434494\" href=\"#.\" rel=\"#tab-videos-container-434494\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-15T08:00:00+05:30",
  "modifiedTime": null
}
