{
  "id": "9437e673-1e56-4655-8016-93924718d957",
  "title": "New Skoda Superb to make India debut at Bharat Mobility Global Expo 2025",
  "link": "https://www.autocarindia.com/car-news/new-skoda-superb-to-make-india-debut-at-bharat-mobility-global-expo-2025-433897#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The new Skoda Superb will be shown in India for the first time in January at the Bharat Mobility Global Expo alongside the new Kodiaq and Octavia RS. The fourth-gen Superb debuted globally in late 2023 and is more of an evolution of the outgoing third-gen car.  The new Superb has Skoda’s ‘Modern Solid’ design theme It shares a lot of interior bits with the new Kodiaq Likely to have a 2.0-litre turbo-petrol unit; diesel mill a possibility, too  New Skoda Superb is familiar yet new The new Superb looks more stylish than its predecessor and draws from the brand’s Modern Solid design language that incorporates angular, sharply drawn lines with a mix of traditional Skoda cues. Inside, the new Superb gets the ‘smart dial’ controls on the dashboard, just like the ones seen on the second-gen Kodiaq. These controls can be customised for different functions according to user preferences. It also gets some physical buttons on the dashboard, while a majority of functions have moved to the new 13-inch infotainment screen, which is again similar to the new Kodiaq. Under the hood, the Superb comes with multiple petrol and diesel engine options, depending on the market. For India, we expect the 2.0-litre turbo petrol with 204hp or 265hp output.  New Skoda Superb will be sold as a full import in India Just like the outgoing Superb, which was reintroduced as a full import last year, the new-gen car being displayed at the show will also be launched in India as a fully imported unit. Skoda confirmed this development to us a few months ago. The key reason, as reported earlier, is the shifting of the Superb’s production facility from Kvasiny, Czechia, to the VW Group’s plant in Bratislava, Slovakia. The Bratislava plant does not have a facility to build CKD (completely knocked down) kits of the Superb and can only produce complete vehicles for local sale and exports.  For India, too, local assembly won’t be cost-effective. The previous-gen Superb, which was locally assembled, struggled to cross monthly sales of 400 units. The fully imported third-gen Superb launched last year has also been finding it tough to attract customers, with some unsold units being offered at tempting discounts that bring the car’s price almost on par with the locally assembled version. Though the fourth-gen Superb will be imported as completely built units, some small changes will have to be carried out, such as ADAS calibration for Indian conditions, which will add to costs. Skoda could bring back the Superb diesel via the CBU route to attract diesel loyalists. But all in all, the idea of bringing the fourth-gen Superb even as a full import would turn out to be highly expensive. Expect more details on the Superb’s India launch at the Bharat Mobility Global Expo, which starts on January 17. Also see: New Skoda Kodiaq India debut at Bharat Mobility show 2025 Skoda Octavia RS India debut at Bharat Mobility Show Skoda Enyaq facelift teaser shows new design language",
  "author": "Akbar Merchant",
  "published": "Wed, 25 Dec 2024 08:30:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Akbar Merchant",
  "length": 3042,
  "excerpt": "The fourth-gen Superb will be launched in India as a full import sometime next year.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The fourth-gen Superb will be launched in India as a full import sometime next year.The new Skoda Superb will be shown in India for the first time in January at the Bharat Mobility Global Expo alongside the new Kodiaq and Octavia RS. The fourth-gen Superb debuted globally in late 2023 and is more of an evolution of the outgoing third-gen car. The new Superb has Skoda’s ‘Modern Solid’ design themeIt shares a lot of interior bits with the new KodiaqLikely to have a 2.0-litre turbo-petrol unit; diesel mill a possibility, too New Skoda Superb is familiar yet newThe new Superb looks more stylish than its predecessor and draws from the brand’s Modern Solid design language that incorporates angular, sharply drawn lines with a mix of traditional Skoda cues.Inside, the new Superb gets the ‘smart dial’ controls on the dashboard, just like the ones seen on the second-gen Kodiaq. These controls can be customised for different functions according to user preferences. It also gets some physical buttons on the dashboard, while a majority of functions have moved to the new 13-inch infotainment screen, which is again similar to the new Kodiaq.Under the hood, the Superb comes with multiple petrol and diesel engine options, depending on the market. For India, we expect the 2.0-litre turbo petrol with 204hp or 265hp output. New Skoda Superb will be sold as a full import in IndiaJust like the outgoing Superb, which was reintroduced as a full import last year, the new-gen car being displayed at the show will also be launched in India as a fully imported unit. Skoda confirmed this development to us a few months ago.The key reason, as reported earlier, is the shifting of the Superb’s production facility from Kvasiny, Czechia, to the VW Group’s plant in Bratislava, Slovakia. The Bratislava plant does not have a facility to build CKD (completely knocked down) kits of the Superb and can only produce complete vehicles for local sale and exports. For India, too, local assembly won’t be cost-effective. The previous-gen Superb, which was locally assembled, struggled to cross monthly sales of 400 units. The fully imported third-gen Superb launched last year has also been finding it tough to attract customers, with some unsold units being offered at tempting discounts that bring the car’s price almost on par with the locally assembled version.Though the fourth-gen Superb will be imported as completely built units, some small changes will have to be carried out, such as ADAS calibration for Indian conditions, which will add to costs. Skoda could bring back the Superb diesel via the CBU route to attract diesel loyalists. But all in all, the idea of bringing the fourth-gen Superb even as a full import would turn out to be highly expensive.Expect more details on the Superb’s India launch at the Bharat Mobility Global Expo, which starts on January 17.Also see:New Skoda Kodiaq India debut at Bharat Mobility show 2025Skoda Octavia RS India debut at Bharat Mobility ShowSkoda Enyaq facelift teaser shows new design languageVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241219035950_Skoda_Superb_BMS3.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThe fourth-gen Superb will be launched in India as a full import sometime next year.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe new Skoda Superb will be shown in India for the first time in January at the Bharat Mobility Global Expo alongside the new Kodiaq and Octavia RS. The fourth-gen Superb debuted globally in late 2023 and is more of an evolution of the outgoing third-gen car. \u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eThe new Superb has Skoda’s ‘Modern Solid’ design theme\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIt shares a lot of interior bits with the new Kodiaq\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eLikely to have a 2.0-litre turbo-petrol unit; diesel mill a possibility, too \u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eNew Skoda Superb is familiar yet new\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe new Superb looks more stylish than its predecessor and draws from the brand’s Modern Solid design language that incorporates angular, sharply drawn lines with a mix of traditional Skoda cues.\u003c/p\u003e\u003cp\u003eInside, the new Superb gets the ‘smart dial’ controls on the dashboard, just like the ones seen on the second-gen Kodiaq. These controls can be customised for different functions according to user preferences. It also gets some physical buttons on the dashboard, while a majority of functions have moved to the new 13-inch infotainment screen, which is again similar to the new Kodiaq.\u003c/p\u003e\u003cp\u003eUnder the hood, the Superb comes with multiple petrol and diesel engine options, depending on the market. For India, we expect the 2.0-litre turbo petrol with 204hp or 265hp output. \u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eNew Skoda Superb will be sold as a full import in India\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eJust like the outgoing Superb, which was reintroduced as a full import last year, the new-gen car being displayed at the show will also be launched in India as a fully imported unit. \u003ca href=\"https://www.autocarindia.com/car-news/new-skoda-superb-to-be-an-import-only-as-local-assembly-unviable-432288\" title=\"New Skoda Superb to be an import only as local assembly unviable\"\u003e\u003cstrong\u003eSkoda confirmed this development\u003c/strong\u003e\u003c/a\u003e to us a few months ago.\u003c/p\u003e\u003cp\u003eThe key reason, as reported earlier, is the shifting of the Superb’s production facility from Kvasiny, Czechia, to the VW Group’s plant in Bratislava, Slovakia. The Bratislava plant does not have a facility to build CKD (completely knocked down) kits of the Superb and can only produce complete vehicles for local sale and exports. \u003c/p\u003e\u003cp\u003eFor India, too, local assembly won’t be cost-effective. The previous-gen Superb, which was locally assembled, struggled to cross monthly sales of 400 units. The fully imported third-gen Superb launched last year has also been finding it tough to attract customers, with some \u003ca href=\"https://www.autocarindia.com/car-news/skoda-superb-import-units-available-at-rs-18-lakh-discount-433892\" title=\"Skoda Superb import units available at Rs 18 lakh discount\"\u003e\u003cstrong\u003eunsold units being offered at tempting discounts\u003c/strong\u003e\u003c/a\u003e that bring the car’s price almost on par with the locally assembled version.\u003c/p\u003e\u003cp\u003eThough the fourth-gen Superb will be imported as completely built units, some small changes will have to be carried out, such as ADAS calibration for Indian conditions, which will add to costs. Skoda could bring back the Superb diesel via the CBU route to attract diesel loyalists. But all in all, the idea of bringing the fourth-gen Superb even as a full import would turn out to be highly expensive.\u003c/p\u003e\u003cp\u003eExpect more details on the Superb’s India launch at the Bharat Mobility Global Expo, which starts on January 17.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-skoda-kodiaq-india-debut-at-bharat-mobility-show-2025-433884\"\u003eNew Skoda Kodiaq India debut at Bharat Mobility show 2025\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/skoda-octavia-rs-india-debut-at-bharat-mobility-show-433887\"\u003eSkoda Octavia RS India debut at Bharat Mobility Show\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/skoda-enyaq-facelift-teaser-shows-new-design-language-433891\"\u003eSkoda Enyaq facelift teaser shows new design language\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-433897\"\u003e\u003cul id=\"tab-id-433897\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-433897\" href=\"#.\" rel=\"#tab-videos-container-433897\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-25T08:30:00+05:30",
  "modifiedTime": null
}
