{
  "id": "95660d09-79da-4c7c-98d1-d161735d4ffb",
  "title": "S50-Powered 1988 BMW M3",
  "link": "https://bringatrailer.com/listing/1988-bmw-m3-250/",
  "description": "This 1988 BMW M3 is a US-market Diamond Black Metallic example that was fitted with a 3.0-liter S50B30 inline-six paired with a five-speed manual transmission and was acquired by the current owner in 2014. Additional modifications include 17\" AC Schnitzer wheels, black leather E36 M3 Vader front seats, an Alpine head unit, and an M-Tech II steering wheel. Work in preparation for the sale included fluid changes as well as replacement of the steering rack and fuel lines. This modified E30 M3 is now offered by the seller on behalf of the current owner with a Carfax report and a clean Virginia title.",
  "author": "bringatrailer",
  "published": "Sat, 08 Feb 2025 23:20:09 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 3286,
  "excerpt": "Bid for the chance to own a S50-Powered 1988 BMW M3 at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #180,574.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/google-chrome-icon-192x192.png?v=7564266137",
  "text": "This 1988 BMW M3 is a US-market Diamond Black Metallic example that was fitted with a 3.0-liter S50B30 inline-six paired with a five-speed manual transmission and was acquired by the current owner in 2014. Additional modifications include 17″ AC Schnitzer wheels, black leather E36 M3 Vader front seats, an Alpine head unit, and an M-Tech II steering wheel. Work in preparation for the sale included fluid changes as well as replacement of the steering rack and fuel lines. This modified E30 M3 is now offered by the seller on behalf of the current owner with a Carfax report and a clean Virginia title. The car is finished in Diamond Black Metallic (181) and features an electric sunroof, a rear spoiler, fog lights, painted mirror caps, twin exhaust outlets, and wider fenders compared to the standard E30. The windshield wiper has been converted to a single wiper. The driver’s door and rear quarter panel were reportedly replaced following an accident in October 2007 per the Carfax report. The 17″ AC Schnitzer Type 3 wheels are mounted with 235/40 front and 245/40 rear Toyo Proxes R1R tires. Bilstein coilovers have been added up front along with a Racing Dynamics strut bar. The brake fluid was flushed in September 2024, while the steering rack, outer tie rod ends, and power steering fluid were reportedly replaced in November 2024. The seller reports that the front right tire rubs when moving at slow speeds and at full steering lock, which is noted to be due to the aftermarket wheels. The cabin has been retrofitted with black leather Vader front seats from an E36 M3 and is equipped with a color-matching rear bench and door panels. Equipment includes an Alpine stereo linked with an aftermarket amplifier, air conditioning, cruise control, M Sport pedals, and power windows, mirrors, and locks. The 13-button onboard computer is nonfunctional, and the seller notes a rattle when the air conditioning system turns on. The three-spoke M-Tech II steering wheel shows wear on its rim and fronts VDO instrumentation including a 160-mph speedometer and an 8k-rpm tachometer as well as gauges for oil temperature, coolant temperature, and fuel level. The six-digit odometer shows 222k miles, approximately 600 of which were added under current ownership. The check engine light remains illuminated. The 3.0-liter S50B30 inline-six was installed in place of the original 2.3-liter inline-four, and an oil change was performed in September 2024. A number of fuel hoses were replaced in November 2024. Power is sent to the rear wheels through a five-speed manual transmission and a limited-slip differential. The car is equipped with an exhaust system sourced from an E36 M3. The Carfax report shows the aforementioned accident report and lists registration history in Florida, Illinois, Alaska, New Jersey, California, and Virginia. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_img_3657-75471.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 1988 BMW M3 is a US-market Diamond Black Metallic example that was fitted with a 3.0-liter S50B30 inline-six paired with a five-speed manual transmission and was acquired by the current owner in 2014. Additional modifications include 17″ AC Schnitzer wheels, black leather E36 M3 Vader front seats, an Alpine head unit, and an M-Tech II steering wheel. Work in preparation for the sale included fluid changes as well as replacement of the steering rack and fuel lines. This modified E30 M3 is now offered by the seller on behalf of the current owner with a Carfax report and a clean Virginia title.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_img_3655-75481.jpeg?w=620\u0026amp;resize=620%2C413\" alt=\"S50-Powered 1988 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe car is finished in Diamond Black Metallic (181) and features an electric sunroof, a rear spoiler, fog lights, painted mirror caps, twin exhaust outlets, and wider fenders compared to the standard E30. The windshield wiper has been converted to a single wiper. The driver’s door and rear quarter panel were reportedly replaced following an accident in October 2007 per the Carfax report.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_img_3652-75488.jpeg?w=620\u0026amp;resize=620%2C413\" alt=\"S50-Powered 1988 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 17″ AC Schnitzer Type 3 wheels are mounted with 235/40 front and 245/40 rear Toyo Proxes R1R tires. Bilstein coilovers have been added up front along with a Racing Dynamics strut bar. The brake fluid was flushed in September 2024, while the steering rack, outer tie rod ends, and power steering fluid were reportedly replaced in November 2024. The seller reports that the front right tire rubs when moving at slow speeds and at full steering lock, which is noted to be due to the aftermarket wheels.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_image021-74900.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"S50-Powered 1988 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe cabin has been retrofitted with black leather Vader front seats from an E36 M3 and is equipped with a color-matching rear bench and door panels. Equipment includes an Alpine stereo linked with an aftermarket amplifier, air conditioning, cruise control, M Sport pedals, and power windows, mirrors, and locks. The 13-button onboard computer is nonfunctional, and the seller notes a rattle when the air conditioning system turns on.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_image035-74906.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"S50-Powered 1988 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe three-spoke M-Tech II steering wheel shows wear on its rim and fronts VDO instrumentation including a 160-mph speedometer and an 8k-rpm tachometer as well as gauges for oil temperature, coolant temperature, and fuel level. The six-digit odometer shows 222k miles, approximately 600 of which were added under current ownership. The check engine light remains illuminated.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_image033-74913.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"S50-Powered 1988 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 3.0-liter S50B30 inline-six was installed in place of the original 2.3-liter inline-four, and an oil change was performed in September 2024. A number of fuel hoses were replaced in November 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/1988_bmw_m3_IMG_3598-90503-scaled.jpeg?w=620\u0026amp;resize=620%2C349\" alt=\"S50-Powered 1988 BMW M3\" width=\"620\" height=\"349\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is sent to the rear wheels through a five-speed manual transmission and a limited-slip differential. The car is equipped with an exhaust system sourced from an E36 M3.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report shows the aforementioned accident report and lists registration history in Florida, Illinois, Alaska, New Jersey, California, and Virginia.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
