{
  "id": "99a937d5-1477-47d9-a99b-bcca46900da3",
  "title": "If You’re So Excited About Bare Bones Single-Cab Trucks, Just Get This",
  "link": "https://www.carscoops.com/2025/04/if-youre-so-excited-about-slates-bare-bones-truck-then-just-go-get-this/",
  "description": "The 1999 Ford Ranger delivers a proven, no-nonsense truck experience without the startup drama",
  "author": "Andreas Tsaousis",
  "published": "Sun, 27 Apr 2025 23:40:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Auction",
    "Electric Vehicles",
    "Ford",
    "Ford Ranger",
    "Mecum",
    "Reports",
    "Used Cars"
  ],
  "byline": "Andreas Tsaousis",
  "length": 4304,
  "excerpt": "The 1999 Ford Ranger delivers a proven, no-nonsense truck experience without the startup drama",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "The 1999 Ford Ranger delivers a proven, no-nonsense truck experience without the startup drama 1 hour ago by Andreas Tsaousis A well-preserved 1999 Ford Ranger pickup truck will be sold at auction in May. It’s a single-cab XLT model powered by a 117hp 2.5-liter four-cylinder engine. Despite being 26 years old, it has fewer than 52,000 miles on the odometer. If we had a buck for each startup that shows up and states it intends to build the Holy Grail of the current automotive market, a truly affordable EV, only to either go the way of the dodo or fail to deliver on their promises, we’d probably be so rich we could afford to, well, launch our own startup. The latest in this long line is Slate, with its “Truck”. It’s key selling point is that it’s a back-basics single-cab pickup with a super affordable price starting under $28,000, or around $20,000 with EV incentives that President Trump hasn’t axed (yet) despite being openly against them. More: Would You Really Pay $28K For A Crank Window EV With No Speakers? Even if Slate’s pickup truck does hit the market exactly as promised, you don’t need to read the fine print to realize that its EV is affordable not because they’ve found a secret sauce, but due to it being laughably basic. So much so that it lacks not just most of the features we’ve come to expect as standard, but also things like electric windows, an audio system, speakers, and an infotainment screen. You can pay extra to add them in, but at that point, aren’t you just defeating the whole “affordable EV” idea? Or, You Know, Just Get a Ranger If all you really want is a cheap single-cab truck with the minimum comfort creatures, here’s a used Ford Ranger for you. Not the current model, which is far from basic and definitely not an EV from a startup, but a classic, third-generation 1999 Ranger XLT, which is set to cross the Mecum auction block on May 15. Sure, it’s 26 years old, powered by a 2.5-liter combustion engine, and you still have to crank the windows with your hands, but hey, it’s got stuff. Not exactly luxury, but it’s hardly a bare-bones, dollar store special either. It sports an automatic transmission, power steering and brakes, air conditioning, alloy wheels, a soft bed cover, chrome grille and bumpers. But wait, there’s more! This truck also gets a radio (yes, with speakers), a center console arm rest, cupholders and, brace yourself EV startup defenders, a glovebox! You know, basic human comforts you won’t find in the Slate EV unless you pay extra for the “luxury”. More: Someone Turned A Ram 1500 TRX Into The Shortest And Most Badass Single-Cab Truck Ever Moreover, it has a much more useful range than the base Truck’s lame 150 miles that can be increased to 240 miles (if you pay more), a max payload and towing capacity that exceed the Truck’s 1,400 lbs (635 kg) and 1,000 lbs (453 kg), respectively, is built by a legacy automaker, has sold in great numbers so parts are readily available, and despite its age, the odo reads just 51,645 miles. So, if you’re after a cheap, no-nonsense single-cab truck, don’t worry; you’ve got options. You just won’t find them wrapped in the shiny, buzzword-heavy startup hype that’s always promising to change the world. But hey, if you’re into solid, reliable trucks without the drama, check out the listing over here.",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                        \u003cp\u003e\n                            The 1999 Ford Ranger delivers a proven, no-nonsense truck experience without the startup drama                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003e1 hour ago\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/04/rtyehgbfv-c.webp 2450w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/rtyehgbfv-c-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/rtyehgbfv-c-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/rtyehgbfv-c-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/rtyehgbfv-c-1536x864.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/rtyehgbfv-c-2048x1152.webp 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c.jpg 2450w, https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c-768x432.jpg 768w, https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c-1536x864.jpg 1536w, https://www.carscoops.com/wp-content/uploads/2025/04/rtyehgbfv-c-2048x1152.jpg 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" If You’re So Excited About Bare Bones Single-Cab Trucks, Just Get This\" width=\"2450\" height=\"1378\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/andreastcarscoops-com/\"\u003e\u003cspan\u003eAndreas Tsaousis\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/div\u003e\u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eA well-preserved 1999 Ford Ranger pickup truck will be sold at auction in May.\u003c/li\u003e\n\n\n\n\u003cli\u003eIt’s a single-cab XLT model powered by a 117hp 2.5-liter four-cylinder engine.\u003c/li\u003e\n\n\n\n\u003cli\u003eDespite being 26 years old, it has fewer than 52,000 miles on the odometer.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eIf we had a buck for each startup that shows up and states it intends to build the Holy Grail of the current automotive market, a truly affordable EV, only to either go the way of the dodo or fail to deliver on their promises, we’d probably be so rich we could afford to, well, launch our own startup. The latest in this long \u003ca href=\"https://www.carscoops.com/2025/04/slate-shakes-up-evs-with-sub-20000-pickup-that-can-morph-into-an-suv/\"\u003eline is Slate, with its “Truck”\u003c/a\u003e.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eIt’s key selling point is that it’s a back-basics single-cab pickup with a super affordable price starting under $28,000, or around $20,000 with EV incentives that President Trump hasn’t axed (yet) despite being openly against them.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2025/04/ev-startup-breaks-the-internet-with-28k-dollar-store-truck-but-does-slate-deserve-the-hype/\"\u003eWould You Really Pay $28K For A Crank Window EV With No Speakers?\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eEven if \u003ca href=\"https://www.carscoops.com/tag/slate-auto/\"\u003eSlate’s\u003c/a\u003e pickup truck does hit the market exactly as promised, you don’t need to read the fine print to realize that its EV is affordable not because they’ve found a secret sauce, but due to it b\u003ca href=\"https://www.carscoops.com/2025/04/slate-ev-versus-ford-maverick/\"\u003eeing laughably basic\u003c/a\u003e. So much so that it lacks not just most of the features we’ve come to expect as standard, but also things like electric windows, an audio system, speakers, and an infotainment screen. You can pay extra to add them in, but at that point, aren’t you just defeating the whole “affordable EV” idea?\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003e\u003cstrong\u003eOr, You Know, Just Get a Ranger\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIf all you really want is a cheap single-cab truck with the minimum comfort creatures, here’s a used \u003ca href=\"https://www.carscoops.com/tag/ford-ranger/\"\u003eFord Ranger\u003c/a\u003e for you. Not the current model, which is far from basic and definitely not an EV from a startup, but a classic, third-generation 1999 Ranger XLT, which is set to cross the Mecum auction block on May 15.\u003c/p\u003e\n\n\n\n                            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                     \n\n\n\n\u003cp\u003eSure, it’s 26 years old, powered by a 2.5-liter combustion engine, and you still have to crank the windows with your hands, but hey, it’s got stuff. Not exactly luxury, but it’s hardly a bare-bones, dollar store special either. It sports an automatic transmission, power steering and brakes, air conditioning, alloy wheels, a soft bed cover, chrome grille and bumpers.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut wait, there’s more! This truck also gets a radio (yes, with \u003cem\u003espeakers)\u003c/em\u003e, a center console arm rest, cupholders and, brace yourself EV startup defenders, a glovebox! You know, basic human comforts you won’t find in the Slate EV unless you pay extra for the “luxury”.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2023/09/someone-turned-a-ram-1500-trx-into-the-coolest-single-cab-truck-ever/\"\u003eSomeone Turned A Ram 1500 TRX Into The Shortest And Most Badass Single-Cab Truck Ever\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eMoreover, it has a much more useful range than the base Truck’s lame 150 miles that can be increased to 240 miles (if you pay more), a max payload and towing capacity that exceed the Truck’s 1,400 lbs (635 kg) and 1,000 lbs (453 kg), respectively, is built by a legacy automaker, has sold in great numbers so parts are readily available, and despite its age, the odo reads just 51,645 miles.\u003c/p\u003e\n\n\n\n                            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                     \n\n\n\n\u003cp\u003eSo, if you’re after a cheap, no-nonsense single-cab \u003ca href=\"https://www.carscoops.com/tag/trucks/\"\u003etruck\u003c/a\u003e, don’t worry; you’ve got options. You just won’t find them wrapped in the shiny, buzzword-heavy startup hype that’s always promising to change the world. But hey, if you’re into solid, reliable trucks without the drama, check out the listing over \u003cem\u003e\u003ca href=\"https://www.mecum.com/lots/1144227/1999-ford-ranger-xlt-pickup/\"\u003ehere\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\n\t\t\n\t\t\n\n\n\n\n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-27T23:40:00Z",
  "modifiedTime": "2025-04-27T20:01:07Z"
}
