{
  "id": "9baf455a-d737-42af-bd89-103d9dac9277",
  "title": "GWM Ora 03",
  "link": "https://www.autocar.co.uk/car-review/gwm/ora-03",
  "description": "The former Funky Cat gets a new £25k entry model and a sporting-inspired GT range-topper Don’t be deceived by the jazzy bumpers, racy alloys and GT badging: the new GWM Ora 03 GT is not an Alpine A290 rival. This is the new top-rung version of the Ora 03, and while it might look every inch the hot hatch hero, it’s not looking to trouble the podium at a future running of our Best Driver’s Car showdown. It forms part of a new three-pronged line-up introduced as part of a bid to widen the Ora 03’s appeal and help it better compete in an increasingly busy field of small electric cars.Fundamentally, though, this left-field, lesser-spotted hatchback is unchanged, having received the bigger battery and much-needed smartphone mirroring functionality in a facelift a while back - when it also confoundingly dropped the Funky Cat moniker that had no doubt played an important role in establishing a foothold for GWM in the UK. A victory for rationality over whimsy, but one that bosses say will help to present a more uniform line-up worldwide. When the Ora 03 was launched three years ago under its original name, it didn't play the same value game as its MG 4 EV compatriot. It was originally announced with a very attractive price, but Ora’s UK sales director told Autocar: “Once we saw the car and realised how high-quality the interior was, and really understood the personality of it, we realised we’ve got something really quite special and therefore we can be quite targeted in the market where it’s going to be.”Thus it was priced from £33,000 with the smaller battery in a bid to cement its premium credentials. But with sales not quite matching up to expectations and an electric hatchback market that’s much busier than it was in 2022, it’s time for a reset, with that price point now occupied by the leggiest variant and the smaller-batteried Pure going head-to-head with the cheapest Renault 5 and BYD Dolphin at £25k. The mid-rung Pro splits the difference with the standard design treatment but the bigger battery at £29k.",
  "author": "",
  "published": "Tue, 11 Feb 2025 09:10:30 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Richard LaneDeputy road test editor",
  "length": 3989,
  "excerpt": "The former Funky Cat gets a new £25k entry model and a sporting-inspired GT range-topper",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Step inside the 03 and on first impression the claim that this is a premium product rings true. Most surfaces above waist level are soft-touch and the red microsuede material that lines the dashboard and door cards feels plusher than the textured rubber you might ordinarily find there. The seats are upholstered in an unusually soft synthetic leather. It gets a little sweaty on long journeys, but it’s a cut above the plain vinyl you sit on in the MG 5 EV. The bright red and beige colour scheme won’t be to everyone’s taste, but it’s a nice change from the gloomy blackness of so many modern cars. Green and black are available if you prefer something more subdued. Cabin spec offerings are good in the 03. The base Pure variant gets electric front seats, a 360deg camera, rear parking sensors and a wireless phone charger, and the Pro adds heated front seats, parking assistance, front parking sensors and electrically folding door mirrors. The GT gets all of that plus massaging front seats and a panoramic sunroof.  Unfortunately, some of the controls are less pleasing. The rotary drive selector doesn’t feel like it’s connected to anything and the detents of the BMW-style indicator stalk (it always returns to centre) are quite weak, making it easy to indicate the wrong way. The ‘chrome’ switch panel in the centre of the dash may be inspired by the Mini but doesn’t look or feel as convincing. The toggle switches control a number of climate functions but not the temperature. For that, you need to tap the very small up and down icons on the screen. Meanwhile, functions like the headlight aim and driving mode selector, which could happily have been integrated into the touchscreen, get dedicated buttons. Better news comes in the form of the available cabin space. Front passengers are unlikely to be short on storage thanks to trays and bins of various sizes in the centre console, as well as two cupholders and a spot for your glasses in the roof. Rear passengers enjoy generous leg room for this size of car, but rear accommodation is affected by the battery pack raising the floor height, so the seating position isn’t ideal and head room is limited. There’s a single USB charging port back there and no air vents, but that’s not unusual in this class. GWM must have sacrificed some boot space in favour of rear-seat accommodation, though, as the Ora 03 has only slightly more luggage space than an electric Mini Cooper. All versions now come with wireless smartphone mirroring functionality - a feature whose absence was a major shortcoming at launch. That’s good news in that it theoretically minimises your involvement with the clunky and often-frustrating inbuilt infotainment, but unfortunately Apple CarPlay malfunctioned to the point of inutility on our test run, which makes it difficult to count as a perk. It’s a shame that GWM wasn’t able to finesse this sorely needed functionality when it was rolled out in ‘beta’ form a few years ago.  Compounding that irritation is that the phone mirroring takes over the whole screen, so accessing the climate controls involves navigating three menus rather than one. Pressing the physical air-con on/off button does bring up a menu, but that's a hacky workaround. The rest of the multimedia system remains fiddly, with very small on-screen buttons and confusingly arranged menu structures. Elsewhere, sat-nav, DAB radio, Bluetooth and, oddly, Deezer are built in to the touchscreen’s interface. It provided a relatively stable connection, but it is impractical compared with phone mirroring. The speakers can also sound a little thin when competing with road noise on the motorway. The sat-nav works well and will show how much range the car will have left at your destination. Pressing the voice command button or saying ‘Hello Ora’ triggers the voice assistant and causes a cartoon character to pop up on the screen, but we found it was unable to parse fairly simple commands like 'find the nearest Gridserve charger'.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/gwm-ora-03-gt-2025-jb20250129_7727.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eStep inside the 03 and on first impression the claim that this is a premium product rings true. Most surfaces above waist level are soft-touch and the red microsuede material that lines the dashboard and door cards feels plusher than the textured rubber you might ordinarily find there.\u003c/p\u003e\n\u003cp\u003eThe seats are upholstered in an unusually soft synthetic leather. It gets a little sweaty on long journeys, but it’s a cut above the plain vinyl you sit on in the \u003ca href=\"https://www.autocar.co.uk/car-review/mg/5\"\u003eMG 5 EV\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe bright red and beige colour scheme won’t be to everyone’s taste, but it’s a nice change from the gloomy blackness of so many modern cars. Green and black are available if you prefer something more subdued.\u003c/p\u003e\n\u003cp\u003eCabin spec offerings are good in the 03. The base Pure variant gets electric front seats, a 360deg camera, rear parking sensors and a wireless phone charger, and the Pro adds heated front seats, parking assistance, front parking sensors and electrically folding door mirrors. The GT gets all of that plus massaging front seats and a panoramic sunroof. \u003c/p\u003e\n\u003cp\u003eUnfortunately, some of the controls are less pleasing. The rotary drive selector doesn’t feel like it’s connected to anything and the detents of the \u003ca href=\"https://www.autocar.co.uk/car-reviews/bmw\"\u003eBMW\u003c/a\u003e-style indicator stalk (it always returns to centre) are quite weak, making it easy to indicate the wrong way.\u003c/p\u003e\n\u003cp\u003eThe ‘chrome’ switch panel in the centre of the dash may be inspired by the Mini but doesn’t look or feel as convincing. The toggle switches control a number of climate functions but not the temperature. For that, you need to tap the very small up and down icons on the screen. Meanwhile, functions like the headlight aim and driving mode selector, which could happily have been integrated into the touchscreen, get dedicated buttons.\u003c/p\u003e\n\u003cp\u003eBetter news comes in the form of the available cabin space. Front passengers are unlikely to be short on storage thanks to trays and bins of various sizes in the centre console, as well as two cupholders and a spot for your glasses in the roof.\u003c/p\u003e\n\u003cp\u003eRear passengers enjoy generous leg room for this size of car, but rear accommodation is affected by the battery pack raising the floor height, so the seating position isn’t ideal and head room is limited. There’s a single USB charging port back there and no air vents, but that’s not unusual in this class.\u003c/p\u003e\n\u003cp\u003eGWM must have sacrificed some boot space in favour of rear-seat accommodation, though, as the Ora 03 has only slightly more luggage space than an electric Mini Cooper.\u003c/p\u003e\n\u003cp\u003eAll versions now come with wireless smartphone mirroring functionality - a feature whose absence was a major shortcoming at launch. That’s good news in that it theoretically minimises your involvement with the clunky and often-frustrating inbuilt infotainment, but unfortunately Apple CarPlay malfunctioned to the point of inutility on our test run, which makes it difficult to count as a perk. It’s a shame that GWM wasn’t able to finesse this sorely needed functionality when it was rolled out in ‘beta’ form a few years ago. \u003c/p\u003e\n\u003cp\u003eCompounding that irritation is that the phone mirroring takes over the whole screen, so accessing the climate controls involves navigating three menus rather than one. Pressing the physical air-con on/off button does bring up a menu, but that\u0026#39;s a hacky workaround. The rest of the multimedia system remains fiddly, with very small on-screen buttons and confusingly arranged menu structures.\u003c/p\u003e\n\u003cp\u003eElsewhere, sat-nav, DAB radio, Bluetooth and, oddly, Deezer are built in to the touchscreen’s interface. It provided a relatively stable connection, but it is impractical compared with phone mirroring. The speakers can also sound a little thin when competing with road noise on the motorway. The sat-nav works well and will show how much range the car will have left at your destination.\u003c/p\u003e\n\u003cp\u003ePressing the voice command button or saying ‘Hello Ora’ triggers the voice assistant and causes a cartoon character to pop up on the screen, but we found it was unable to parse fairly simple commands like \u0026#39;find the nearest Gridserve charger\u0026#39;.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
