{
  "id": "9e76c406-4328-47c8-97ad-8a2479d5d9f0",
  "title": "Report: Trump to Kill EV Tax Credit",
  "link": "https://www.thetruthaboutcars.com/cars/news-blog/report-trump-to-kill-ev-tax-credit-44510290?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
  "description": "Elections have consequences, and the election of Donald Trump back to the White House might mean the $7,500 electric-vehicle tax credit is doomed.",
  "author": "Tim Healey",
  "published": "Thu, 14 Nov 2024 22:15:38 +0000",
  "source": "https://www.thetruthaboutcars.com/feed/",
  "categories": [
    "News Blog"
  ],
  "byline": "Tim Healey",
  "length": 5926,
  "excerpt": "Elections have consequences, and the election of Donald Trump back to the White House might mean the $7,500 electric-vehicle tax credit is doomed.",
  "siteName": "Ttac",
  "favicon": "https://cdn-fastly.thetruthaboutcars.com/resources/themes/ttac/imgs-responsive/ttac-apple-touch-icon.png",
  "text": "Published:  November 14th, 2024 Elections have consequences, and the election of Donald Trump back to the White House might mean the $7,500 electric-vehicle tax credit is doomed. According to Reuters, the Trump team wants to kill the credit as a part of broader tax-reform legislation. Interestingly, Reuters also reports that the move has the support of Tesla representatives, despite the fact that company only sells EVs and is the American markets' largest purveyor of EVs. Tesla boss Elon Musk is close to Trump and has been involved in the early stages of the transition to the next administration. It's unclear how much the tax credit boosts sales -- a quick scan of studies and news articles suggest that it does, but I also saw a study suggesting that some buyers would've purchased an EV even without the credit -- but it is clear that the removal of the credit will have an impact on the automotive market. What kind of impact remains to be seen.As Ward's Auto points out, automakers could lower MSRPs to make up the difference, for one thing.My gut suggests that tax credits are just one part of the buying decision for shoppers considering an EV, along with range, charging availability, and other factors. I'd also think that perhaps the credit might get some first-time EV buyers to go electric, though how many is hard to quantify. Whether this change would stall the growth of the EV segment is also unclear. On the surface, it seems like it would, but on the other hand there are other challenges to greater EV adoption. We cover them on this site and the podcast regularly -- lack of charging availability, charging times that are too slow, range anxiety, sticker price, repair costs, et cetera.Back to Tesla -- Musk has said the end of the tax credit could lightly dent Tesla sales but might really hurt its competitors. Tesla has a market share of nearly half when it comes to EVs in the U.S. and other automakers have been playing catch up. That's because Tesla was selling EVs earlier than most other OEMs, though legacy automakers have been launching more and more new EVs over the past 5-10 years. Indeed, Tesla's EV market share was 80 percent as recently as early 2020. Now, as regular TTAC readers know, most full-line automakers have multiple EV offerings across market segments and classes.This opens another can of worms in terms of having the CEO of one company in a position where he can manipulate the government to benefit his business (or, in Musk's cases, businesses) -- but that's a topic for another day.I should note here that two people behind the proposed change are Harold Hamm -- described by Reuters as a \"billionaire oilman\" and North Dakota governor Doug Burgum. North Dakota is the third-largest oil-producing state in the U.S.The oil-and-gas industry unsurprisingly has supported the end of the EV tax credit. Trump has pushed to boost U.S. oil production, which is already at record highs under Joe Biden's presidential administration. Trump has also suggested he'd cut back on clean energy initiatives, which include subsidies for alternative energy sources such as wind, solar, and hydrogen. The Reuters story suggests that Trump is targeting the EV tax credit in order to pay for the extension of large tax cuts that are set to expire soon after he retakes the oath of office. A key industry group didn't respond to a Reuters request for comment but it has been in support of retaining the credit.Here's what the Alliance for Automotive Innovation, which represents basically every OEM except Tesla, had to say earlier this year, per Reuters.The Alliance for Automotive Innovation, a trade group representing nearly all major automakers besides Tesla, also did not immediately respond. The alliance last month in an Oct. 15 letter urged Congress to retain the EV tax credits, calling them \"critical to cementing the U.S. as a global leader in the future of automotive technology and manufacturing.\" Trump had been saying during his campaign that he'd end the Biden administration's \"EV mandate\" but he never offered specifics. Not to mention that there really isn't an EV \" mandate\". Finally, as Reuters notes, Trump may face political headwinds from his own party -- some of the clean-energy policies passed by the Biden administration have sent money towards Republican-dominated states and are popular in those states. I'd also add that some EVs are built in areas that lean heavily Republican -- Trump could face pushback from those who stand to lose work if fewer EVs are pumped out on the assembly line.[Images: Kia, Ford, Hyundai]Become a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by  subscribing to our newsletter. Tim Healey grew up around the auto-parts business and has always had a love for cars — his parents joke his first word was “‘Vette”. Despite this, he wanted to pursue a career in sports writing but he ended up falling semi-accidentally into the automotive-journalism industry, first at Consumer Guide Automotive and later at Web2Carz.com. He also worked as an industry analyst at Mintel Group and freelanced for About.com, CarFax, Vehix.com, High Gear Media, Torque News, FutureCar.com, Cars.com, among others, and of course Vertical Scope sites such as AutoGuide.com, Off-Road.com, and HybridCars.com. He’s an urbanite and as such, doesn’t need a daily driver, but if he had one, it would be compact, sporty, and have a manual transmission. More by Tim Healey",
  "image": "https://cdn-fastly.thetruthaboutcars.com/media/marketing_photos/2024/11/14/87154/social-44510290.jpg?size=1200x628",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                    \u003cp\u003e\u003cspan\u003e \u003cstrong\u003ePublished: \u003c/strong\u003e November 14th, 2024\u003c/span\u003e\u003c/p\u003e                        \u003c/div\u003e\u003cdiv data-tr_zone=\"Activity Body\"\u003e\n                        \n\n                                \n\n    \n    \n    \n\n    \u003cdiv id=\"element-140656\"\u003e\n    \u003cp\u003eElections have consequences, and the election of Donald Trump back to the White House might mean the $7,500 electric-vehicle tax credit is doomed.\u003c/p\u003e\u003ccuttext\u003e\u003c/cuttext\u003e\n\u003c/div\u003e\n    \n\n    \u003cp\u003eAccording to \u003ci\u003e \u003ca href=\"https://www.reuters.com/business/autos-transportation/trumps-transition-team-aims-kill-biden-ev-tax-credit-2024-11-14/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eReuters\u003c/a\u003e\u003c/i\u003e, the Trump team wants to kill the credit as a part of broader tax-reform legislation. Interestingly, \u003ci\u003eReuters \u003c/i\u003ealso reports that the move has the support of Tesla representatives, despite the fact that company only sells EVs and is the American markets\u0026#39; largest purveyor of EVs. Tesla boss Elon Musk is close to Trump and has been involved in the early stages of the transition to the next administration.\u003c/p\u003e\n        \n    \n\n    \u003cdiv id=\"element-140662\"\u003e\n    \u003cp\u003eIt\u0026#39;s unclear how much the tax credit boosts sales -- a quick scan of studies and news articles suggest that it does, but I also saw a study \u003ca href=\"https://news.stanford.edu/stories/2024/10/electric-vehicle-subsidies-help-the-climate-u-s-automakers#:~:text=min%20readEconomics-,Electric%20vehicle%20subsidies%20help%20the%20climate%20and%20automakers%2C%20but%20at,have%20purchased%20EVs%20without%20subsidies.\" rel=\"nofollow noopener\" target=\"_blank\"\u003esuggesting\u003c/a\u003e that some buyers would\u0026#39;ve purchased an EV even without the credit -- but it is clear that the removal of the credit will have an impact on the automotive market. What kind of impact remains to be seen.\u003c/p\u003e\u003cp\u003eAs \u003ci\u003eWard\u0026#39;s Auto \u003c/i\u003e \u003ca href=\"https://www.wardsauto.com/fixed-operations/industry-voices-government-incentives-impact-on-ev-sales\" rel=\"nofollow noopener\" target=\"_blank\"\u003epoints out\u003c/a\u003e, automakers could lower MSRPs to make up the difference, for one thing.\u003c/p\u003e\u003cp\u003eMy gut suggests that tax credits are just one part of the buying decision for shoppers considering an EV, along with range, charging availability, and other factors. I\u0026#39;d also think that perhaps the credit might get some first-time EV buyers to go electric, though how many is hard to quantify.\u003c/p\u003e\n\u003c/div\u003e\n    \n    \n\n\n    \n\n        \n\n\n    \u003cdiv id=\"element-140665\"\u003e\n    \u003cp\u003eWhether this change would stall the growth of the EV segment is also unclear. On the surface, it seems like it would, but on the other hand there are other challenges to greater EV adoption. We cover them on this site and the podcast regularly -- lack of charging availability, charging times that are too slow, range anxiety, sticker price, repair costs, et cetera.\u003c/p\u003e\u003cp\u003eBack to Tesla -- Musk has said the end of the tax credit could lightly dent Tesla sales but might really hurt its competitors. Tesla has a market share of nearly half when it comes to EVs in the U.S. and other automakers have been playing catch up. That\u0026#39;s because Tesla was selling EVs earlier than most other OEMs, though legacy automakers have been launching more and more new EVs over the past 5-10 years. Indeed, Tesla\u0026#39;s EV market share was 80 percent as recently as early 2020. Now, as regular TTAC readers know, most full-line automakers have multiple EV offerings across market segments and classes.\u003c/p\u003e\u003cp\u003eThis opens another can of worms in terms of having the CEO of one company in a position where he can manipulate the government to benefit his business (or, in Musk\u0026#39;s cases, businesses) -- but that\u0026#39;s a topic for another day.\u003c/p\u003e\u003cp\u003eI should note here that two people behind the proposed change are Harold Hamm -- described by \u003ci\u003eReuters \u003c/i\u003eas a \u0026#34;billionaire oilman\u0026#34; and North Dakota governor Doug Burgum. North Dakota is the third-largest oil-producing state in the U.S.\u003c/p\u003e\u003cp\u003eThe oil-and-gas industry unsurprisingly has supported the end of the EV tax credit. Trump has pushed to boost U.S. oil production, which is already at record highs under Joe Biden\u0026#39;s presidential administration. Trump has also suggested he\u0026#39;d cut back on clean energy initiatives, which include subsidies for alternative energy sources such as wind, solar, and hydrogen.\u003c/p\u003e\n\u003c/div\u003e\n        \n    \n\n    \u003cdiv id=\"element-140674\"\u003e\n    \u003cp\u003eThe \u003ci\u003eReuters\u003c/i\u003e story suggests that Trump is targeting the EV tax credit in order to pay for the extension of large tax cuts that are set to expire soon after he retakes the oath of office.\u003c/p\u003e\n\u003c/div\u003e\n    \n\n    \n\n    \n\n    \u003cdiv id=\"element-140668\"\u003e\n    \u003cp\u003eA key industry group didn\u0026#39;t respond to a \u003ci\u003eReuters\u003c/i\u003e request for comment but it has been in support of retaining the credit.\u003c/p\u003e\u003cp\u003eHere\u0026#39;s what the Alliance for Automotive Innovation, which represents basically every OEM except Tesla, had to say earlier this year, per \u003ci\u003eReuters.\u003c/i\u003e\u003c/p\u003e\u003cblockquote\u003eThe Alliance for Automotive Innovation, a trade group representing nearly all major automakers besides Tesla, also did not immediately respond. The alliance last month in an Oct. 15 letter urged Congress to retain the EV tax credits, calling them \u0026#34;critical to cementing the U.S. as a global leader in the future of automotive technology and manufacturing.\u0026#34;\u003c/blockquote\u003e\n\u003c/div\u003e\n    \n    \n    \n\n    \u003cdiv id=\"element-140671\"\u003e\n    \u003cp\u003eTrump had been saying during his campaign that he\u0026#39;d end the Biden administration\u0026#39;s \u0026#34;EV mandate\u0026#34; but he never offered specifics. Not to mention that there really isn\u0026#39;t an EV \u0026#34; \u003ca href=\"https://www.thetruthaboutcars.com/cars/news-blog/no-there-s-not-an-ev-mandate-44508244\"\u003emandate\u003c/a\u003e\u0026#34;. Finally, as \u003ci\u003eReuters \u003c/i\u003enotes, Trump may face political headwinds from his own party -- some of the clean-energy policies passed by the Biden administration have sent money towards Republican-dominated states and are popular in those states. I\u0026#39;d also add that some EVs are built in areas that lean heavily Republican -- Trump could face pushback from those who stand to lose work if fewer EVs are pumped out on the assembly line.\u003c/p\u003e\u003cp\u003e[Images: Kia, Ford, Hyundai]\u003c/p\u003e\u003cp\u003e\u003ci\u003eBecome a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by  \u003ca href=\"https://email.thetruthaboutcars.com/newsletter-signup/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esubscribing to our newsletter\u003c/a\u003e.\u003c/i\u003e\u003c/p\u003e\n\u003c/div\u003e\n        \n    \n\n\n    \n\n\n\n\n\n\n                        \n                    \u003c/div\u003e\u003cdiv\u003e\n                \u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdn-fastly.thetruthaboutcars.com/media/profile/2023/12/15/1375158_1.jpg?size=91x91\" alt=\"Tim Healey\" width=\"90\" height=\"90\"/\u003e\u003c/p\u003e\u003cdiv\u003e\n                    \n                    \u003cp\u003eTim Healey grew up around the auto-parts business and has always had a love for cars — his parents joke his first word was “‘Vette”. Despite this, he wanted to pursue a career in sports writing but he ended up falling semi-accidentally into the automotive-journalism industry, first at Consumer Guide Automotive and later at Web2Carz.com. He also worked as an industry analyst at Mintel Group and freelanced for About.com, CarFax, Vehix.com, High Gear Media, Torque News, FutureCar.com, Cars.com, among others, and of course Vertical Scope sites such as AutoGuide.com, Off-Road.com, and HybridCars.com. He’s an urbanite and as such, doesn’t need a daily driver, but if he had one, it would be compact, sporty, and have a manual transmission.\u003c/p\u003e\n                    \u003cp\u003eMore by \u003ca href=\"https://www.thetruthaboutcars.com/member/1375158/tim-healey\"\u003eTim Healey\u003c/a\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-14T17:15:38-05:00",
  "modifiedTime": "2024-11-14T17:51:25-05:00"
}
