{
  "id": "ad5176c7-88ee-4ee7-a7e4-fed3ac21ea62",
  "title": "Ferrari 250 GT Speciale Spyder Re-Creation",
  "link": "https://bringatrailer.com/listing/1970-ferrari-250-gt-speciale-tribute/",
  "description": "This Ferrari 250 GT re-creation depicts a Spyder reimagining of the Berlinetta Speciale that was custom-built in 1957 by Pinin Farina for Prince Bernhard van Lippe-Biesterfeld of the Netherlands. This car, chassis 13153, was initially built as a 365 GT 2+2 in 1969 and received a mechanical refurbishment around 2000 that involved an overhaul of the 4.4-liter Colombo V12. The car was sourced in 2010 by David Rose, former owner of Ferrari of San Diego, as the basis for the project. It was transported to Coachsmithing Auto Design of Blair, Wisconsin, where it was stripped and fitted with hand-formed aluminum bodywork finished in red along with a removable color-matched hardtop. Following Mr. Rose's passing, the completion of the build was overseen by his brother and concluded in 2024. Shifting is via a five-speed manual transmission, and the car is further equipped with triple Weber carburetors, 15\" Borrani wire wheels, ventilated disc brakes, and a quad-exit exhaust system. Inside, the refreshed cabin houses seating for two trimmed in tan leather as well as a wood-rimmed steering wheel, power windows, and Veglia instrumentation. Work performed in preparation for the sale involved servicing the rear air shocks, performing electrical work, repairing leaks at the brake master cylinder and power steering pump, and replacing the clutch cable and spark plugs. This 250 GT Speciale re-creation is now offered on dealer consignment in California with an owner's manual, service records, spare components, and a Massachusetts title listing the car as a 1970 Ferrari 365 GT 2+2 Coupe.",
  "author": "bringatrailer",
  "published": "Sat, 07 Dec 2024 01:00:16 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 5637,
  "excerpt": "Bid for the chance to own a Ferrari 250 GT Speciale Spyder Re-Creation at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #174,018.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/apple-touch-icon-ipad-retina-152x152.png?v=http://40f2f07521",
  "text": "This Ferrari 250 GT re-creation depicts a Spyder reimagining of the Berlinetta Speciale that was custom-built in 1957 by Pinin Farina for Prince Bernhard van Lippe-Biesterfeld of the Netherlands. This car, chassis 13153, was initially built as a 365 GT 2+2 in 1969 and received a mechanical refurbishment around 2000 that involved an overhaul of the 4.4-liter Colombo V12. The car was sourced in 2010 by David Rose, former owner of Ferrari of San Diego, as the basis for the project. It was transported to Coachsmithing Auto Design of Blair, Wisconsin, where it was stripped and fitted with hand-formed aluminum bodywork finished in red along with a removable color-matched hardtop. Following Mr. Rose’s passing, the completion of the build was overseen by his brother and concluded in 2024. Shifting is via a five-speed manual transmission, and the car is further equipped with triple Weber carburetors, 15″ Borrani wire wheels, ventilated disc brakes, and a quad-exit exhaust system. Inside, the refreshed cabin houses seating for two trimmed in tan leather as well as a wood-rimmed steering wheel, power windows, and Veglia instrumentation. Work performed in preparation for the sale involved servicing the rear air shocks, performing electrical work, repairing leaks at the brake master cylinder and power steering pump, and replacing the clutch cable and spark plugs. This 250 GT Speciale re-creation is now offered on dealer consignment in California with an owner’s manual, service records, spare components, and a Massachusetts title listing the car as a 1970 Ferrari 365 GT 2+2 Coupe. A friend of Enzo Ferrari, Prince Bernhard van Lippe-Biesterfeld of the Netherlands commissioned Carrozzeria Pinin Farina to construct a 250 GT with one-off Berlinetta coachwork. Chassis 0725GT was completed in 1957 and drew inspiration from the contemporary 400 and 410 Superamerica cars, specifically the 4.9 Superfast. Styling incorporated a long bonnet, an oval grille, independent front bumperettes, fender vents, and taillights mounted atop curved tailfins. This re-creation depicts a Spyder variant of the Prince Bernhard car with aluminum bodywork that is said to have been formed by hand using a wooden buck. Mounted over a 365 GT 2+2 coupe chassis, the car is finished in red and features horizontal front bumperettes in lieu of the vertical uprights used on the original Berlinetta Speciale. Further exterior details include a hood scoop, enclosed headlights with bright housings, aluminum fender vents, a wrap-around rear bumper, and Ferrari badging. Imperfections in the finish along the hood are shown up close in the gallery below. The color-matched hardtop is removable and was designed to mirror the roofline of the Prince Bernhard coupe. Polished aluminum trim begins aft of the windshield and trails over the side louvers and along the custom-fabricated rear window, while the underside of the hardtop wears a tan headliner. Weatherstripping has not been fitted around the side glass window recesses, though spare rubber is included in the sale. The chrome-finished 15″ Borrani wire wheels are wrapped in Pirelli Cinturato CN72 tires that were mounted in 2024, while a matching spare wheel wearing Michelin rubber is stored in the trunk compartment. The aftermarket rear air shocks were serviced in September 2024, at which time leaks at the brake master cylinder and power steering pump were repaired. Stopping power is provided by servo-assisted four-wheel ventilated disc brakes. The selling dealer notes evidence of clear coat failure along the wheels. Originally a 2+2 cabin, the interior was reconfigured with low-back bucket seating for two trimmed in tan leather upholstery that extends to the door panels and central tunnel. Beige carpets cover the floors and exhibit wear, while the custom-fabricated dashboard, center stack, and door caps wear black leather. The car is equipped with power windows, and storage is located behind the rear bulkhead. The air-conditioning system does not work. The wood-rimmed steering wheel features a prancing horse horn button and fronts Veglia Borletti instrumentation including an 8k-rpm tachometer and a 180-mph speedometer, while gauges monitoring water temperature, oil pressure, amperage, and fuel level are housed above the center stack. The five-digit odometer shows 48k miles, approximately 600 of which were added under current ownership. The 4.4-liter 60° Colombo SOHC V12 was overhauled in 2000 by the Boston Sportscar Company of Weston, Massachusetts, and was carried over from the donor 365 GT. Induction is via triple Weber carburetors, and output was rated at 320 horsepower when new. Areas of the firewall were modified during the build, at which time an aftermarket wiring harness was installed. The spark plugs were replaced and electrical work was carried out in preparation for the sale. Power is sent to the rear wheels via a five-speed manual transmission. The car is equipped with a quad-exit exhaust system, and a replacement clutch cable was installed in September 2024. A number of spare components will accompany the car. Photos documenting various stages of the build are viewable in the gallery below. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-ferrari-special-os-07-73701.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis Ferrari 250 GT re-creation depicts a Spyder reimagining of the Berlinetta Speciale that was custom-built in 1957 by Pinin Farina for Prince Bernhard van Lippe-Biesterfeld of the Netherlands. This car, chassis 13153, was initially built as a 365 GT 2+2 in 1969 and received a mechanical refurbishment around 2000 that involved an overhaul of the 4.4-liter Colombo V12. The car was sourced in 2010 by David Rose, former owner of Ferrari of San Diego, as the basis for the project. It was transported to Coachsmithing Auto Design of Blair, Wisconsin, where it was stripped and fitted with hand-formed aluminum bodywork finished in red along with a removable color-matched hardtop. Following Mr. Rose’s passing, the completion of the build was overseen by his brother and concluded in 2024. Shifting is via a five-speed manual transmission, and the car is further equipped with triple Weber carburetors, 15″ Borrani wire wheels, ventilated disc brakes, and a quad-exit exhaust system. Inside, the refreshed cabin houses seating for two trimmed in tan leather as well as a wood-rimmed steering wheel, power windows, and Veglia instrumentation. Work performed in preparation for the sale involved servicing the rear air shocks, performing electrical work, repairing leaks at the brake master cylinder and power steering pump, and replacing the clutch cable and spark plugs. This 250 GT Speciale re-creation is now offered on dealer consignment in California with an owner’s manual, service records, spare components, and a Massachusetts title listing the car as a 1970 Ferrari 365 GT 2+2 Coupe.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-ferrari-special-w-03-73835.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eA friend of Enzo Ferrari, Prince Bernhard van Lippe-Biesterfeld of the Netherlands commissioned Carrozzeria Pinin Farina to construct a 250 GT with one-off Berlinetta coachwork. Chassis 0725GT was completed in 1957 and drew inspiration from the contemporary 400 and 410 Superamerica cars, specifically the 4.9 Superfast. Styling incorporated a long bonnet, an oval grille, independent front bumperettes, fender vents, and taillights mounted atop curved tailfins.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-Ferrari-Special-W-08-35310.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThis re-creation depicts a Spyder variant of the Prince Bernhard car with aluminum bodywork that is said to have been formed by hand using a wooden buck. Mounted over a 365 GT 2+2 coupe chassis, the car is finished in red and features horizontal front bumperettes in lieu of the vertical uprights used on the original Berlinetta Speciale. Further exterior details include a hood scoop, enclosed headlights with bright housings, aluminum fender vents, a wrap-around rear bumper, and Ferrari badging. Imperfections in the finish along the hood are shown up close in the gallery below.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-Ferrari-Special-W-32-35432.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe color-matched hardtop is removable and was designed to mirror the roofline of the Prince Bernhard coupe. Polished aluminum trim begins aft of the windshield and trails over the side louvers and along the custom-fabricated rear window, while the underside of the hardtop wears a tan headliner. Weatherstripping has not been fitted around the side glass window recesses, though spare rubber is included in the sale.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-Ferrari-Special-W-14-35340.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe chrome-finished 15″ Borrani wire wheels are wrapped in Pirelli Cinturato CN72 tires that were mounted in 2024, while a matching spare wheel wearing Michelin rubber is stored in the trunk compartment. The aftermarket rear air shocks were serviced in September 2024, at which time leaks at the brake master cylinder and power steering pump were repaired. Stopping power is provided by servo-assisted four-wheel ventilated disc brakes. The selling dealer notes evidence of clear coat failure along the wheels.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-Ferrari-Special-W-55-35548.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eOriginally a 2+2 cabin, the interior was reconfigured with low-back bucket seating for two trimmed in tan leather upholstery that extends to the door panels and central tunnel. Beige carpets cover the floors and exhibit wear, while the custom-fabricated dashboard, center stack, and door caps wear black leather. The car is equipped with power windows, and storage is located behind the rear bulkhead. The air-conditioning system does not work.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-Ferrari-Special-W-52-35533.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe wood-rimmed steering wheel features a prancing horse horn button and fronts Veglia Borletti instrumentation including an 8k-rpm tachometer and a 180-mph speedometer, while gauges monitoring water temperature, oil pressure, amperage, and fuel level are housed above the center stack. The five-digit odometer shows 48k miles, approximately 600 of which were added under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_241116-Ferrari-Special-W-59-35569.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 4.4-liter 60° Colombo SOHC V12 was overhauled in 2000 by the Boston Sportscar Company of Weston, Massachusetts, and was carried over from the donor 365 GT. Induction is via triple Weber carburetors, and output was rated at 320 horsepower when new. Areas of the firewall were modified during the build, at which time an aftermarket wiring harness was installed. The spark plugs were replaced and electrical work was carried out in preparation for the sale.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_img_9249-74028.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is sent to the rear wheels via a five-speed manual transmission. The car is equipped with a quad-exit exhaust system, and a replacement clutch cable was installed in September 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_img_9320-74059.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eA number of spare components will accompany the car.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/1970_ferrari_250-gt-speciale-tribute_ferrari-43371.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Ferrari 250 GT Speciale Spyder Re-Creation\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePhotos documenting various stages of the build are viewable in the gallery below.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
