{
  "id": "c4b30700-043d-4b36-a122-a19667b702cd",
  "title": "Why Won't The Vatican Let Formula 1 Race Inside Its Walls?",
  "link": "https://www.jalopnik.com/1843071/f1-race-inside-vatican/",
  "description": "What better way is there to introduce a new generation to your religion than letting F1 race on the streets of your walled-off city-state?",
  "author": "Collin Woodard",
  "published": "Fri, 25 Apr 2025 20:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "News",
    "Racing"
  ],
  "byline": "Collin Woodard",
  "length": 2691,
  "excerpt": "What better way is there to introduce a new generation to your religion than letting F1 race on the streets of your walled-off city-state?",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Sony Pictures Pope Francis died recently, and the timing couldn't have been worse for JD Vance, who met with Pope Francis literally right before he died. Imagine the Pope clinging to life just so he can tell you to your face that you're a bad person. I wouldn't dare show my face in public again, and I'm not even Catholic. Now that they're in the process of choosing a new Pope, there's also a lot more attention on the Vatican, as well as the many reforms that the Cool Pope ushered in. At the same time, though, with all the reforms and the potential for even more change, I do have to ask — Why won't the Vatican let Formula 1 race inside its walls? I mean, F1 is basically just for rich people, and the Catholic church has a ton of money, so it works on that level. More importantly, though, it would also be cool, and Catholicism could really use some help in that regard, especially now that the Cool Pope has shuffled off this mortal coil. Putting Interim Pope Kevin in charge of things was a good start, but it'll take a lot more than choosing Pope Pizzaballa to wash off the stink of, well, you know. And what better way is there to introduce a new generation to your religion than letting F1 race on the streets of your walled-off city-state? That's a good-looking street circuit right there Admittedly, this isn't exactly an original idea. It came to me via The Algorithm and the Formula Dank subreddit. But sometimes you see someone else's idea, and it's so good, you just have to share it with the rest of the internet. I mean, you could probably quibble with the layout user pasteque202 chose if you really wanted to, but even if you think it could use some improvements, you at least have to admit it's a good start.  Sadly, it also doesn't appear that the Vatican allows Google on its streets, so I can't jump into Street View and see how viable the layout is, but you also have to imagine there aren't many speed bumps, and the pavement's in excellent condition. I mean, you can't have poorly maintained roads inside the Pope's own city, right? They'd also have to figure out what to do about the crashes, but maybe we could get the drivers to agree not to crash into anything too old or valuable.  Personally, I think F1 racing inside the Vatican is a totally reasonable idea, and if other people are already thinking the same thing, surely it's been proposed before. So now I need to know. Why won't the Vatican let F1 race inside its walls?",
  "image": "https://www.jalopnik.com/img/gallery/why-wont-the-vatican-let-f1-race-inside-its-walls/l-intro-1745532750.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1843071/f1-race-inside-vatican/\" data-post-title=\"Why Won\u0026#39;t The Vatican Let Formula 1 Race Inside Its Walls?\" data-slide-num=\"0\" data-post-id=\"1843071\"\u003e\n                                             \u003cpicture id=\"p368981faf656fa178a9de327c0b94bf8\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-wont-the-vatican-let-f1-race-inside-its-walls/intro-1745532750.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-wont-the-vatican-let-f1-race-inside-its-walls/intro-1745532750.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/why-wont-the-vatican-let-f1-race-inside-its-walls/intro-1745532750.jpg\" data-slide-url=\"https://www.jalopnik.com/1843071/f1-race-inside-vatican/\" data-post-id=\"1843071\" data-slide-num=\"0\" data-slide-title=\"Why Won\u0026#39;t The Vatican Let Formula 1 Race Inside Its Walls?: \" width=\"780\" height=\"438\" alt=\"Spectre car chase in the Vatican\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003e\u003ca href=\"https://www.jalopnik.com/1839810/pope-francis-last-popemobile-ride/\" target=\"_blank\"\u003ePope Francis died recently\u003c/a\u003e, and the timing couldn\u0026#39;t have been worse for JD Vance, who met with Pope Francis literally right before he died. Imagine the Pope clinging to life just so he can tell you to your face that you\u0026#39;re a bad person. I wouldn\u0026#39;t dare show my face in public again, and I\u0026#39;m not even Catholic. Now that they\u0026#39;re in the process of choosing a new Pope, there\u0026#39;s also a lot more attention on the Vatican, as well as the many reforms that the Cool Pope ushered in. At the same time, though, with all the reforms and the potential for even more change, I do have to ask — Why won\u0026#39;t the Vatican let \u003ca href=\"https://www.jalopnik.com/experiencing-the-las-vegas-grand-prix-through-the-eyes-1851727979/\" target=\"_blank\"\u003eFormula 1\u003c/a\u003e race inside its walls?\u003c/p\u003e\n\u003cp\u003eI mean, F1 is basically just for rich people, and the Catholic church has a ton of money, so it works on that level. More importantly, though, it would also be cool, and Catholicism could really use some help in that regard, especially now that the Cool Pope has shuffled off this mortal coil. Putting Interim Pope Kevin in charge of things was a good start, but it\u0026#39;ll take a lot more than choosing Pope Pizzaballa to wash off the stink of, well, you know. And what better way is there to introduce a new generation to your religion than letting F1 race on the streets of your walled-off city-state?\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThat\u0026#39;s a good-looking street circuit right there\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eAdmittedly, this isn\u0026#39;t exactly an original idea. It came to me via The Algorithm and the Formula Dank subreddit. But sometimes you see someone else\u0026#39;s idea, and it\u0026#39;s so good, you just have to share it with the rest of the internet. I mean, you could probably quibble with the layout user pasteque202 chose if you really wanted to, but even if you think it could use some improvements, you at least have to admit it\u0026#39;s a good start. \u003c/p\u003e\n\u003cp\u003eSadly, it also doesn\u0026#39;t appear that the Vatican allows Google on its streets, so I can\u0026#39;t jump into Street View and see how viable the layout is, but you also have to imagine there aren\u0026#39;t many speed bumps, and the pavement\u0026#39;s in excellent condition. I mean, you can\u0026#39;t have poorly maintained roads inside the Pope\u0026#39;s own city, right? They\u0026#39;d also have to figure out what to do about the crashes, but maybe we could get the drivers to agree not to crash into anything too old or valuable. \u003c/p\u003e\n\u003cp\u003ePersonally, I think F1 racing inside the Vatican is a totally reasonable idea, and if other people are already thinking the same thing, surely it\u0026#39;s been proposed before. So now I need to know. Why won\u0026#39;t the Vatican let F1 race inside its walls?\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-25T20:25:00Z",
  "modifiedTime": "2025-04-25T20:25:00Z"
}
