{
  "id": "d8c88477-8bd7-4a98-ad91-61e1d40dcbb8",
  "title": "Tata Motors overtakes Maruti as maker of India’s No.1 car",
  "link": "https://www.autocarindia.com/car-news/tata-motors-overtakes-maruti-as-maker-of-indias-no1-car-434049#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "For the first time in 40 years, India’s largest-selling car did not carry the Maruti Suzuki logo. The Punch, a sub-compact SUV from Tata Motors, edged out Maruti Suzuki’s Wagon R and Swift to become the country's largest-selling car in 2024. Tata Motors sold over 2.02 lakh units of Tata Punch in 2024, overtaking the Wagon R, which sold 1.91 lakh units. Three out of the top five selling cars in the country in 2024 were SUVs. Tata Punch's rise to the top Reviewing the calendar year 2024 performance, Shailesh Chandra, MD, Tata Motors Passenger Vehicles Ltd. and Tata Passenger Electric Mobility Ltd. said the PV industry is expected to touch a sales volume of 4.3 million units, with strong growth in the SUV segment and sustained traction for emission-friendly powertrains.  Launched in 2021, Punch, with its SUV silhouette, upright stance, 190 mm ground clearance, and commanding driver position in a 3.8-metre footprint, created an all-new sub-segment in the sub-4 m SUV category.  Based on footprint, this segment is turning out to be an ideal alternative for prospective buyers of hatchbacks like the Maruti Swift. With these attributes, Tata Punch started selling over 10,000 units a month and became the 10th best-selling car in 2022. In terms of footprint, features, and price point, the Exter and Punch are equally matched; Hyundai and Tata have nearly similar sales footprints. However, the Hyundai Exter could not deliver even half the volume of the Tata Punch in 2024.  What does this mean for Maruti Suzuki? India's shift towards premium cars is turning out to be a litmus test for Maruti Suzuki, the country’s largest affordable car maker. Limited SUV options, especially at a price above Rs 10 lakh, impacted Maruti Suzuki’s market share.  Consider this: In 2018, before the pandemic, the Indian industry had its best year ever, with 33.49 lakh car sales. With 52 percent of the Indian market's share, Maruti sold more cars than all its competitors combined. And the top five best-selling products were all from Maruti’s stable.  In 2024, when the Indian industry reached another peak of about 42.86 lakh car sales in the post-pandemic era, Maruti’s market share not only fell to 41 percent but also lost the distinction of supplying India's best-selling car. History of India’s best-selling car In the post-independence era, Hindustan Motors’ Ambassador held the number one position for nearly three decades in a duopoly with the Premier Padmini as the second best-selling product in India back then. But in 1985, a modern, reliable, and affordable offering from Suzuki, the Maruti 800, took over the crown of best-selling car for years to come. The next four decades were dominated by Maruti-Suzuki, which grew from strength to strength, even when markets were opened to other foreign rivals in the post-90s liberalization era. After Maruti 800, its spiritual successor, Alto, remained a best seller for 13 years, reaching the highest sales of 3,11,367 in 2011. That’s the highest ever sales achieved by any car in the Indian industry in a calendar year. However, after 2018, things changed rapidly due to evolving regulations—e.g., the transition from BS IV to BS VI, and the call for mandatory airbags.  The number one position has been shifting among several Maruti products, from the sub-4m Dzire to the Swift premium hatchback to the tall-boy Wagon R. The 2024 top five list underlines how the shift in choice to SUVs has impacted not only vehicle brands but also the models and market share.  Also see:  SUVs, MPVs drive growth for Maruti in 2024 as hatchback sales decline Punch, Creta and Brezza highest selling SUVs in 2024",
  "author": "Ketan Thakkar",
  "published": "Sun, 5 Jan 2025 12:56:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Ketan Thakkar",
  "length": 3715,
  "excerpt": "In 2024, the Tata Punch topped sales, ending Maruti Suzuki\u0026#39;s 40-year reign.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "In 2024, the Tata Punch topped sales, ending Maruti Suzuki's 40-year reign.For the first time in 40 years, India’s largest-selling car did not carry the Maruti Suzuki logo. The Punch, a sub-compact SUV from Tata Motors, edged out Maruti Suzuki’s Wagon R and Swift to become the country's largest-selling car in 2024. Tata Motors sold over 2.02 lakh units of Tata Punch in 2024, overtaking the Wagon R, which sold 1.91 lakh units. Three out of the top five selling cars in the country in 2024 were SUVs.Tata Punch's rise to the topReviewing the calendar year 2024 performance, Shailesh Chandra, MD, Tata Motors Passenger Vehicles Ltd. and Tata Passenger Electric Mobility Ltd. said the PV industry is expected to touch a sales volume of 4.3 million units, with strong growth in the SUV segment and sustained traction for emission-friendly powertrains. Launched in 2021, Punch, with its SUV silhouette, upright stance, 190 mm ground clearance, and commanding driver position in a 3.8-metre footprint, created an all-new sub-segment in the sub-4 m SUV category. Based on footprint, this segment is turning out to be an ideal alternative for prospective buyers of hatchbacks like the Maruti Swift. With these attributes, Tata Punch started selling over 10,000 units a month and became the 10th best-selling car in 2022.In terms of footprint, features, and price point, the Exter and Punch are equally matched; Hyundai and Tata have nearly similar sales footprints. However, the Hyundai Exter could not deliver even half the volume of the Tata Punch in 2024. What does this mean for Maruti Suzuki?India's shift towards premium cars is turning out to be a litmus test for Maruti Suzuki, the country’s largest affordable car maker. Limited SUV options, especially at a price above Rs 10 lakh, impacted Maruti Suzuki’s market share. Consider this: In 2018, before the pandemic, the Indian industry had its best year ever, with 33.49 lakh car sales. With 52 percent of the Indian market's share, Maruti sold more cars than all its competitors combined. And the top five best-selling products were all from Maruti’s stable. In 2024, when the Indian industry reached another peak of about 42.86 lakh car sales in the post-pandemic era, Maruti’s market share not only fell to 41 percent but also lost the distinction of supplying India's best-selling car.History of India’s best-selling carIn the post-independence era, Hindustan Motors’ Ambassador held the number one position for nearly three decades in a duopoly with the Premier Padmini as the second best-selling product in India back then.But in 1985, a modern, reliable, and affordable offering from Suzuki, the Maruti 800, took over the crown of best-selling car for years to come. The next four decades were dominated by Maruti-Suzuki, which grew from strength to strength, even when markets were opened to other foreign rivals in the post-90s liberalization era.After Maruti 800, its spiritual successor, Alto, remained a best seller for 13 years, reaching the highest sales of 3,11,367 in 2011. That’s the highest ever sales achieved by any car in the Indian industry in a calendar year.However, after 2018, things changed rapidly due to evolving regulations—e.g., the transition from BS IV to BS VI, and the call for mandatory airbags. The number one position has been shifting among several Maruti products, from the sub-4m Dzire to the Swift premium hatchback to the tall-boy Wagon R. The 2024 top five list underlines how the shift in choice to SUVs has impacted not only vehicle brands but also the models and market share. Also see: SUVs, MPVs drive growth for Maruti in 2024 as hatchback sales declinePunch, Creta and Brezza highest selling SUVs in 2024Videos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250105125056_TataPunch _1_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eIn 2024, the Tata Punch topped sales, ending Maruti Suzuki\u0026#39;s 40-year reign.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eFor the first time in 40 years, India’s largest-selling car did not carry the Maruti Suzuki logo. The \u003ca href=\"https://www.autocarindia.com/cars/tata/punch\"\u003e\u003cstrong\u003ePunch,\u003c/strong\u003e\u003c/a\u003e a sub-compact SUV from Tata Motors, edged out Maruti Suzuki’s \u003ca href=\"https://www.autocarindia.com/cars/maruti-suzuki/wagon-r\"\u003e\u003cstrong\u003eWagon R\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/maruti-suzuki/swift\"\u003e\u003cstrong\u003eSwift\u003c/strong\u003e\u003c/a\u003e to become the country\u0026#39;s largest-selling car in 2024. Tata Motors sold over 2.02 lakh units of Tata Punch in 2024, overtaking the Wagon R, which sold 1.91 lakh units. Three out of the top five selling cars in the country in 2024 were SUVs.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/e3fbea30-f51b-4a71-9cf2-6c525c3114a5_Screenshot-20250104-170543.png\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eTata Punch\u0026#39;s rise to the top\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eReviewing the calendar year 2024 performance, Shailesh Chandra, MD, Tata Motors Passenger Vehicles Ltd. and Tata Passenger Electric Mobility Ltd. said the PV industry is expected to touch a sales volume of 4.3 million units, with strong growth in the SUV segment and sustained traction for emission-friendly powertrains. \u003c/p\u003e\u003cp\u003eLaunched in 2021, Punch, with its SUV silhouette, upright stance, 190 mm ground clearance, and commanding driver position in a 3.8-metre footprint, created an all-new sub-segment in the sub-4 m SUV category. \u003c/p\u003e\u003cp\u003eBased on footprint, this segment is turning out to be an ideal alternative for prospective buyers of hatchbacks like the Maruti Swift. With these attributes, Tata Punch started selling over 10,000 units a month and became the 10th best-selling car in 2022.\u003c/p\u003e\u003cp\u003eIn terms of footprint, features, and price point, the Exter and Punch are equally matched; Hyundai and Tata have nearly similar sales footprints. However, the Hyundai Exter could not deliver even half the volume of the Tata Punch in 2024. \u003c/p\u003e\u003ch2\u003e\u003cspan\u003eWhat does this mean for Maruti Suzuki?\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eIndia\u0026#39;s shift towards premium cars is turning out to be a litmus test for Maruti Suzuki, the country’s largest affordable car maker. Limited SUV options, especially at a price above Rs 10 lakh, impacted Maruti Suzuki’s market share. \u003c/p\u003e\u003cp\u003eConsider this: In 2018, before the pandemic, the Indian industry had its best year ever, with 33.49 lakh car sales. With 52 percent of the Indian market\u0026#39;s share, Maruti sold more cars than all its competitors combined. And the top five best-selling products were all from Maruti’s stable. \u003c/p\u003e\u003cp\u003eIn 2024, when the Indian industry reached another peak of about 42.86 lakh car sales in the post-pandemic era, Maruti’s market share not only fell to 41 percent but also lost the distinction of supplying India\u0026#39;s best-selling car.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eHistory of India’s best-selling car\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eIn the post-independence era, Hindustan Motors’ Ambassador held the number one position for nearly three decades in a duopoly with the Premier Padmini as the second best-selling product in India back then.\u003c/p\u003e\u003cp\u003eBut in 1985, a modern, reliable, and affordable offering from Suzuki, the Maruti 800, took over the crown of best-selling car for years to come. The next four decades were dominated by Maruti-Suzuki, which grew from strength to strength, even when markets were opened to other foreign rivals in the post-90s liberalization era.\u003c/p\u003e\u003cp\u003eAfter Maruti 800, its spiritual successor, Alto, remained a best seller for 13 years, reaching the highest sales of 3,11,367 in 2011. That’s the highest ever sales achieved by any car in the Indian industry in a calendar year.\u003c/p\u003e\u003cp\u003eHowever, after 2018, things changed rapidly due to evolving regulations—e.g., the transition from BS IV to BS VI, and the call for mandatory airbags. \u003c/p\u003e\u003cp\u003eThe number one position has been shifting among several Maruti products, from the sub-4m Dzire to the Swift premium hatchback to the tall-boy Wagon R. The 2024 top five list underlines how the shift in choice to SUVs has impacted not only vehicle brands but also the models and market share. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see: \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/industry/suvs-mpvs-drive-growth-for-maruti-in-2024-as-hatchback-sales-decline-434016\"\u003e\u003cstrong\u003eSUVs, MPVs drive growth for Maruti in 2024 as hatchback sales decline\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/industry/punch-creta-and-brezza-among-top-3-most-suvs-sold-in-2024-433948\"\u003e\u003cstrong\u003ePunch, Creta and Brezza highest selling SUVs in 2024\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434049\"\u003e\u003cul id=\"tab-id-434049\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434049\" href=\"#.\" rel=\"#tab-videos-container-434049\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-05T12:56:00+05:30",
  "modifiedTime": null
}
