{
  "id": "d99cd960-912c-4aeb-8cc2-10d25ac91ec7",
  "title": "Abandoned History: GM's Unitized Power Package, you Down With UPP?",
  "link": "https://www.thetruthaboutcars.com/cars/abandoned-history/abandoned-history-gm-s-unitized-power-package-you-down-with-upp-44510980?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
  "description": "As we wrapped up the latest installment in the Rare Rides series on the Cadillac Eldorado, we reached a turning point in the prestigious coupe’s identity: it became front-wheel drive. Underneath the ‘67 Eldorado’s smooth and angular body was the new Unitized Power Package, the UPP. And it was the culmination of a long powertrain project at GM.",
  "author": "Corey Lewis",
  "published": "Mon, 23 Dec 2024 22:00:00 +0000",
  "source": "https://www.thetruthaboutcars.com/feed/",
  "categories": [
    "Abandoned History"
  ],
  "byline": "Corey Lewis",
  "length": 8608,
  "excerpt": "As we wrapped up the latest installment in the Rare Rides series on the Cadillac Eldorado, we reached a turning point in the prestigious coupe’s identity: i…",
  "siteName": "Ttac",
  "favicon": "https://cdn-fastly.thetruthaboutcars.com/resources/themes/ttac/imgs-responsive/ttac-apple-touch-icon.png",
  "text": "Published:  December 23rd, 2024 As we wrapped up the latest installment in the Rare Rides series on the Cadillac Eldorado, we reached a turning point in the prestigious coupe’s identity: it became front-wheel drive. Underneath the ‘67 Eldorado’s smooth and angular body was the new Unitized Power Package, the UPP. And it was the culmination of a long powertrain project at GM. When the Oldsmobile Toronado debuted as the first vehicle to use the UPP in 1966, it was a watershed moment in the domestic car industry. General Motors bravely put forth a front-wheel drive coupe; the very first front-drive American car since the Thirties. America had last produced a front-drive car in 1937, when the luxurious and small Cord company went out of business for the second time amid grand financial misdoings. General Motors first displayed a front-drive concept car in 1955, when it showed the LaSalle II at the Motorama show. Two designs were displayed, a roadster and a sedan. The Corvette-adjacent looking roadster was well ahead of its time with features like an independent suspension, fuel injection, and brake drums that were integral to the wheel. It was this pair of cars that got the front-drive idea stuck in Oldsmobile’s mind. The UPP had a long nine-year development period, and began in earnest in 1958. At the time, GM assigned John Beltz to lead the project. Beltz was a rising force at Oldsmobile, and while the UPP project was underway he successfully led another important project to production: the 1964 Olds 4-4-2. It was important that Oldsmobile debuted the UPP first, for two reasons. The first was the nature of Oldsmobile, as GM’s brand with the best engineers who created and implemented cutting edge ideas. Recall Oldsmobile was still at the forefront in the Nineties, when it installed the TravTek navigation system for consumer testing in the Toronado. The system was later put into commercial use across the Oldsmobile line as Guidestar. The second reason was a more practical one. The UPP needed to have time on the roads for real world testing, even beyond what the engineers could do with test vehicles. Real people driving real examples of the UPP-equipped Toronado, to see if there were any major flaws. Only then could GM allow its Standard of the World brand, Cadillac, to implement the new powertrain. Pity they didn’t follow this methodology with the HT4100 engine. Originally the UPP project was supposed to be quick and lower-cost. Oldsmobile planned to convert the F-85 (later called Cutlass) line to front-wheel drive. Oldsmobile’s compact line struggled to compete with more appealing offerings from Ford like the Falcon, and from 1962 the slightly larger (downsized intermediate) Fairlane. But the project extended longer than planned, and costs ballooned. The challenges of fitting a V8 engine, an automatic transmission, and all the other drivetrain components into the space usually reserved solely for the engine presented many challenges. A longitudinal layout was used, and the engine was offset to the right in the engine bay. The location was necessary to fit in the transmission, which was separated into two halves. The unit began as the Turbo-Hydramatic 400 ( THM400) The front of the transmission was turned 180 degrees to face forward, while the torque converter remained in its usual spot at the rear of the engine. The resulting transmission was called the THM425. A major engineering hurdle was transfer of the drive between the torque converter and the input shaft of the transmission. This was an issue in 1930’s front-wheel drive vehicles from Cord, and made the front-drive vehicles unreliable. GM’s answer was to use a two-inch wide chain with dual 7.5-inch sprockets. The chain was of the steel link-belt variety and designed by Morse Chain, a division of the Borg-Warner company. The chain setup proved to be quiet and reliable. Steering and suspension duties were via universal CV joints paired to the driveshafts. General Motors was so concerned about the big budget UPP being reliable that it tested the system for over 1.5 million miles. All those miles were spread out in more than a dozen test vehicles. Assuming an average speed of 55 miles per hour would have meant 27,272 hours of testing. When the Toronado went on sale in 1966 it made a big splash with its styling and revolutionary front-wheel drive. It was an all-new take on the burgeoning personal luxury segment, and the industry took notice. Toronado won several awards immediately, and every auto magazine wrote in-depth content on the slinky Oldsmobile with the UPP. The overbuilt powertrain was ready for Cadillac adoption the following year in the new Eldorado, with the two pricy coupes helping to spread out the costs accumulated in the extended development timeline of the UPP. In 1967 the Toronado was offered in base form for $4,674 ($44,821 adj.) or as a Deluxe Coupe for $4,869 ($46,691 adj.). The Cadillac Eldorado asked a hefty $5,875 ($56,338 adj.) that year. The UPP was so robust that it was also ported directly for use on enormous and heavy recreational vehicles. From 1973 to 1978 GMC produced its Motorhome, which used the exact same drive components as the Toronado and Eldorado. Assembled by Pontiac West Assembly, the Class A motorhome used a 455 (7.5L) Rocket V8, or the 403 (6.6L) Oldsmobile V8. They were available as 23- or 26-foot RVs. Final development came in the form of downsizing and weight loss, in a world subsequent to the 1973 OPEC Crisis. The UPP was slimmed down in 1979 to work under the downsized E-body coupes (Riviera, Toronado, Eldorado). Engines were smaller, between 4.1 and 6.0 liters, and the Riviera was front-drive for the first time. The lighter-duty THM325 took over for the THM425 in those applications.  UPP would last through 1984. In 1985, in fear of projected astronomical fuel prices by the end of the Eighties, GM released its fully downsized cars company-wide. With front-wheel drive and exceedingly compromised design and brand differentiation, GM left its proud UPP in the dust. But that’s an Abandoned History topic for another day.  [Images: GM, Peterson Automotive Museum]Become a TTAC insider. the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by subscribing to our newsletter.",
  "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/23/16231/social-44510980.jpg?size=1200x628",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                    \u003cp\u003e\u003cspan\u003e \u003cstrong\u003ePublished: \u003c/strong\u003e December 23rd, 2024\u003c/span\u003e\u003c/p\u003e                        \u003c/div\u003e\u003cdiv data-tr_zone=\"Activity Body\"\u003e\n                        \n\n                        \n\n\n                        \n\n                            \n                                        \n\n                            \u003cdiv\u003e\n                                \u003cp\u003eAs we wrapped up the \u003cu\u003e \u003ca href=\"https://www.thetruthaboutcars.com/cars/features/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-xlv-44510941\"\u003elatest installment\u003c/a\u003e\u003c/u\u003e in the Rare Rides series on the Cadillac Eldorado, we reached a turning point in the prestigious coupe’s identity: it became front-wheel drive. Underneath the ‘67 Eldorado’s smooth and angular body was the new Unitized Power Package, the UPP. And it was the culmination of a long powertrain project at GM.\u003c/p\u003e\u003ccuttext\u003e\u003c/cuttext\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eWhen the Oldsmobile Toronado debuted as the first vehicle to use the UPP in 1966, it was a watershed moment in the domestic car industry. General Motors bravely put forth a front-wheel drive coupe; the very first front-drive American car since the Thirties. America had last produced a front-drive car in 1937, when the luxurious and small Cord company went out of business for the second time amid grand financial misdoings. \u003c/p\u003e\n\n                    \n\n\n                    \n                            \n                            \n\n                            \u003cp\u003eGeneral Motors first displayed a front-drive concept car in 1955, when it showed the LaSalle II at the Motorama show. Two designs were displayed, a roadster and a sedan. The Corvette-adjacent looking roadster was well ahead of its time with features like an independent suspension, fuel injection, and brake drums that were integral to the wheel. It was this pair of cars that got the front-drive idea stuck in Oldsmobile’s mind. \u003c/p\u003e\n\n                    \n\n\n\n                                \n                                \n\n                            \n                            \n\n                            \u003cp\u003eThe UPP had a long nine-year development period, and began in earnest in 1958. At the time, GM assigned John Beltz to lead the project. Beltz was a rising force at Oldsmobile, and while the UPP project was underway he successfully led another important project to production: the 1964 Olds 4-4-2.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eIt was important that Oldsmobile debuted the UPP first, for two reasons. The first was the nature of Oldsmobile, as GM’s brand with the best engineers who created and implemented cutting edge ideas. Recall Oldsmobile was still at the forefront in the Nineties, when it installed the \u003cu\u003e \u003ca href=\"https://www.thetruthaboutcars.com/cars/features/abandoned-history-oldsmobile-s-guidestar-navigation-system-and-other-cartography-44503711\"\u003eTravTek navigation system\u003c/a\u003e\u003c/u\u003e for consumer testing in the Toronado. The system was later put into commercial use across the Oldsmobile line as \u003cu\u003e \u003ca href=\"https://www.thetruthaboutcars.com/cars/features/abandoned-history-oldsmobile-s-guidestar-navigation-system-and-other-cartography-44504248\"\u003eGuidestar\u003c/a\u003e\u003c/u\u003e.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eThe second reason was a more practical one. The UPP needed to have time on the roads for real world testing, even beyond what the engineers could do with test vehicles. Real people driving real examples of the UPP-equipped Toronado, to see if there were any major flaws. Only then could GM allow its Standard of the World brand, Cadillac, to implement the new powertrain. Pity they didn’t follow this methodology with the \u003cu\u003e \u003ca href=\"https://www.thetruthaboutcars.com/2022/02/abandoned-history-general-motors-high-technology-engine-and-other-cafe-foibles-part-iv/\"\u003eHT4100 engine\u003c/a\u003e\u003c/u\u003e.\u003c/p\u003e\n\n                    \n\n\n                    \n                            \n                            \n\n                            \u003cp\u003eOriginally the UPP project was supposed to be quick and lower-cost. Oldsmobile planned to convert the F-85 (later called Cutlass) line to front-wheel drive. Oldsmobile’s compact line struggled to compete with more appealing offerings from Ford like the Falcon, and from 1962 the slightly larger (downsized intermediate) Fairlane.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eBut the project extended longer than planned, and costs ballooned. The challenges of fitting a V8 engine, an automatic transmission, and all the other drivetrain components into the space \u003ci\u003eusually\u003c/i\u003e reserved solely for the engine presented many challenges. A longitudinal layout was used, and the engine was offset to the right in the engine bay.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eThe location was necessary to fit in the transmission, which was separated into two halves. The unit began as the Turbo-Hydramatic 400 (\u003cu\u003e \u003ca href=\"https://www.thetruthaboutcars.com/2022/05/abandoned-history-general-motors-turbo-hydramatic-transmissions-part-ii/\"\u003eTHM400\u003c/a\u003e\u003c/u\u003e) The front of the transmission was turned 180 degrees to face forward, while the torque converter remained in its usual spot at the rear of the engine. The resulting transmission was called the THM425.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eA major engineering hurdle was transfer of the drive between the torque converter and the input shaft of the transmission. This was an issue in 1930’s front-wheel drive vehicles from Cord, and made the front-drive vehicles unreliable. GM’s answer was to use a two-inch wide chain with dual 7.5-inch sprockets. The chain was of the steel link-belt variety and designed by Morse Chain, a division of the Borg-Warner company. The chain setup proved to be quiet and reliable.\u003c/p\u003e\n\n                    \n\n\n                    \n                            \n                            \n\n                            \u003cp\u003eSteering and suspension duties were via universal CV joints paired to the driveshafts. General Motors was so concerned about the big budget UPP being reliable that it tested the system for over 1.5 million miles. All those miles were spread out in more than a dozen test vehicles. Assuming an average speed of 55 miles per hour would have meant 27,272 \u003ci\u003ehours\u003c/i\u003e of testing.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eWhen the Toronado went on sale in 1966 it made a big splash with its styling and revolutionary front-wheel drive. It was an all-new take on the burgeoning personal luxury segment, and the industry took notice. Toronado won several awards immediately, and every auto magazine wrote in-depth content on the slinky Oldsmobile with the UPP.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eThe overbuilt powertrain was ready for Cadillac adoption the following year in the new Eldorado, with the two pricy coupes helping to spread out the costs accumulated in the extended development timeline of the UPP. In 1967 the Toronado was offered in base form for $4,674 ($44,821 adj.) or as a Deluxe Coupe for $4,869 ($46,691 adj.). The Cadillac Eldorado asked a hefty $5,875 ($56,338 adj.) that year.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eThe UPP was so robust that it was also ported directly for use on enormous and heavy recreational vehicles. From 1973 to 1978 GMC produced its Motorhome, which used the exact same drive components as the Toronado and Eldorado. Assembled by Pontiac West Assembly, the Class A motorhome used a 455 (7.5L) Rocket V8, or the 403 (6.6L) Oldsmobile V8. They were available as 23- or 26-foot RVs.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cdiv\u003e\n                                \u003cp\u003eFinal development came in the form of downsizing and weight loss, in a world subsequent to the 1973 OPEC Crisis. The UPP was slimmed down in 1979 to work under the downsized E-body coupes (Riviera, Toronado, Eldorado). Engines were smaller, between 4.1 and 6.0 liters, and the Riviera was front-drive for the first time. The lighter-duty THM325 took over for the THM425 in those applications. \u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cp\u003eUPP would last through 1984. In 1985, in fear of projected astronomical fuel prices by the end of the Eighties, GM released its fully downsized cars company-wide. With front-wheel drive and exceedingly compromised design and brand differentiation, GM left its proud UPP in the dust. But that’s an Abandoned History topic for another day. \u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n\n                            \u003cdiv\u003e\n                                \u003cp\u003e[Images: GM, Peterson Automotive Museum]\u003c/p\u003e\u003cp\u003e\u003ci\u003eBecome a TTAC insider. the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by \u003cu\u003e \u003ca href=\"https://email.thetruthaboutcars.com/newsletter-signup/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esubscribing to our newsletter\u003c/a\u003e\u003c/u\u003e.\u003c/i\u003e\u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-23T17:00:00-05:00",
  "modifiedTime": "2024-12-23T17:00:00-05:00"
}
