{
  "id": "e2d26230-448e-43e3-9d5b-36a14cb7e3fa",
  "title": "2025 World Car of the Year finalists announced",
  "link": "https://www.autocarindia.com/car-news/2025-world-car-of-the-year-finalists-announced-434119#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The World Car Awards has announced the top 10 finalists for the World Car of the Year (WCOTY) 2025 award, along with the top finalists in the other five categories. They were chosen via a secret ballot after being assessed on parameters like safety, value, environmental impact, significance and emotional appeal (or ‘Wow!’ factor). The WCOTY jury is made of 96 distinguished international automotive journalists from 30 countries, including Hormazd Sorabjee, Editor of Autocar India, and Renuka Kirpalani, Consulting Editor (Video), Autocar India. Porsche leads with five cars across categories; not in the WCOTY list Nearly 50 percent of all cars combined are electric vehicles, 17 to be precise Here is a compiled list of finalists for the 2025 awards: 2025 World Car of the Year finalists Audi A5 / S5 BMW X3 Ford Mustang Hyundai Inster / Casper Electric Kia EV3 Mini Cooper Electric Suzuki Swift Toyota Camry Toyota Land Cruiser / Land Cruiser 250 Volkswagen Tiguan / Tayron 2025 World Urban Car of the Year BYD Seagull / Dolphin Mini Hyundai Inster / Casper Electric Mini Cooper Mini Cooper Electric Suzuki Swift 2025 World Luxury Car of the Year Lexus GX Porsche Macan Porsche Panamera Volkswagen ID. Buzz Volvo EX90 2025 World Performance Car of the Year Bentley Continental GT Speed BMW M5 Ford Mustang Porsche 911 Carrera GTS Porsche Taycan Turbo GT 2025 World Electric Vehicle of the Year Hyundai Inster / Casper Electric Kia EV3 Porsche Macan Electric Volkswagen ID. Buzz Volvo EX90 2025 World Car Design of the Year MG Windsor EV Kia EV3 Mini Cooper Toyota Land Cruiser / Land Cruiser 250 Volkswagen ID. Buzz 2025 World Car Award: what’s next The second round of test drives and voting has now begun and will stretch till February. Then, the top three finalists will be revealed on March 4, followed by the announcement of all winners (category wise) at the New York auto show on April 5. Which car would you like to see win the 2025 WCOTY awards? Let us know in the comments.",
  "author": "Uday singh",
  "published": "Sat, 11 Jan 2025 14:56:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Uday singh",
  "length": 842,
  "excerpt": "The \u0026#39;Made-in-India\u0026#39; MG Windsor EV is one of the finalists for World Car Design of the Year.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The 'Made-in-India' MG Windsor EV is one of the finalists for World Car Design of the Year.The World Car Awards has announced the top 10 finalists for the World Car of the Year (WCOTY) 2025 award, along with the top finalists in the other five categories. They were chosen via a secret ballot after being assessed on parameters like safety, value, environmental impact, significance and emotional appeal (or ‘Wow!’ factor).The WCOTY jury is made of 96 distinguished international automotive journalists from 30 countries, including Hormazd Sorabjee, Editor of Autocar India, and Renuka Kirpalani, Consulting Editor (Video), Autocar India.Porsche leads with five cars across categories; not in the WCOTY listNearly 50 percent of all cars combined are electric vehicles, 17 to be preciseHere is a compiled list of finalists for the 2025 awards:",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250111052239_World Car of the Year finalists.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThe \u0026#39;Made-in-India\u0026#39; MG Windsor EV is one of the finalists for World Car Design of the Year.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe World Car Awards has announced the top 10 finalists for the World Car of the Year (WCOTY) 2025 award, along with the top finalists in the other five categories. They were chosen via a secret ballot after being assessed on parameters like safety, value, environmental impact, significance and emotional appeal (or ‘Wow!’ factor).\u003c/p\u003e\u003cp\u003eThe WCOTY jury is made of 96 distinguished international automotive journalists from 30 countries, including Hormazd Sorabjee, Editor of Autocar India, and Renuka Kirpalani, Consulting Editor (Video), Autocar India.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003ePorsche leads with five cars across categories; not in the WCOTY list\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eNearly 50 percent of all cars combined are electric vehicles, 17 to be precise\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003cdiv\u003e\u003cp\u003eHere is a compiled list of finalists for the 2025 awards:\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-01-11T14:56:00+05:30",
  "modifiedTime": null
}
