{
  "id": "e7c95889-8c30-49a3-9941-e5fb1fc23848",
  "title": "Volkswagen ID7 GTX",
  "link": "https://www.autocar.co.uk/car-review/volkswagen/id-7-gtx",
  "description": "Hot version of talented saloon EV is intended to be not just rapid but also engaging When the GTX badge was launched by Volkswagen in 2021, it was tipped as an electric equivalent of – and eventual successor to – the GTI line. But it has suffered by comparison: adding power and straight-line speed is easy on EVs and doesn’t make for an everyday performance hero. Three years later, with new management in Wolfsburg committed to GTI, it’s GTX that’s set to eventually be phased out.Some irony, then, that this new Volkswagen ID 7 GTX showcases exactly what the badge could stand for: a compelling take on what a warmed-up VW EV can be, with a distinct nod towards grand tourers and a different feel to GTI cars.It helps that this new model has an excellent base to work from: in entry-level Pro for the ID 7 was named Autocar's Best Saloon of 2024 and the best in a competitive class that also includes the Tesla Model 3. It's a refined, understated and well-rounded car, a better base to create a GTX model from than the earlier ID 4 and ID 5 SUVs.So is the Volkswagen ID 7 GTX a true electric performance car or, as is often the car with hot EVs, would you be better off sticking to the base model?",
  "author": "",
  "published": "Mon, 19 May 2025 12:00:00 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Associate editor Follow:",
  "length": 2747,
  "excerpt": "Hot version of talented saloon EV is intended to be not just rapid but also engaging",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The ID 7 GTX features a four-wheel-drive powertrain. At the rear is the same 282bhp Volkswagen Group APP550 permanent magnet synchronous electric motor as in the standard Pro and Pro S versions. That's twinned with a new 107bhp asynchronous motor (designated AKA150) mounted on the front axle.  The rear motor is the primary drive unit, with the front one called upon when needed. If you were wondering, Volkswagen chose to use an asynchronous unit on the front axle because it claims this is more efficient when not being called upon to provide power. Despite the two motors offering 282bhp and 107bhp respectively, total system output is capped at 335bhp. That's 53bhp more than the standard version of the ID 7 but significantly down on the 460bhp Tesla Model 3 Performance. Crucially, the modifications made for this GTX model extend beyond simply adding more power than you could sensibly enjoy. The progressive steering has been tuned to offer more feel, with the electronic differential lock system also reworked. There has also been extensive work to broaden the variance in dynamics enabled by the Dynamic Chassis Control (fitted as standard in the UK). Notably, Volkswagen engineers say the big advances have come from developments of the system software. The other big technical change is in the battery: the 77kWh pack used in the Pro model has been switched for an 86kWh one (also found in the long-range Pro S). It's a different design, with the pack containing 13 cell modules instead of 12. It means that in saloon form, the GTX offers a range of 370 miles. The exterior styling changes that mark out the GTX from standard versions of the ID 7 are subtle but notable. There's a new front bumper design exclusive to the performance line, along with revamped daytime running lights and a gloss-black front air intake. The bumper is aerodynamically styled to aid efficiency, while the front-end design now features a light-up VW logo as standard.  At the rear, there's a bespoke horizontal light strip (the rear VW badge illuminates as well) and customisable 3D-effect LED clusters. On the saloon, the lower area of the rear bumper features a honeycomb grille pattern and there's a notable diffuser.  The GTX sits on 20in wheels as standard, with 21in versions available as an option (and fitted to our test car). There are also custom GTX wheel rim designs. The GTX is also offered in Tourer estate form, which has an identical footprint and wheelbase to the saloon version but a bulkier rear end to accommodate a usefully larger boot. The two machines are visually identical at the front and share identical mechanicals, but because of the greater surface area, the Tourer has a reduced – but still substantial – range of 363 miles.",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/vw-id7-gtx-review-2024-01-front-tracking.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe ID 7 GTX features a four-wheel-drive powertrain. At the rear is the same 282bhp Volkswagen Group APP550 permanent magnet synchronous electric motor as in the standard Pro and Pro S versions. That\u0026#39;s twinned with a new 107bhp asynchronous motor (designated AKA150) mounted on the front axle. \u003c/p\u003e\n\u003cp\u003eThe rear motor is the primary drive unit, with the front one called upon when needed. If you were wondering, \u003cspan\u003eVolkswagen\u003c/span\u003e chose to use an asynchronous unit on the front axle because it claims this is more efficient when not being called upon to provide power.\u003c/p\u003e\n\u003cp\u003eDespite the two motors offering 282bhp and 107bhp respectively, total system output is capped at 335bhp. That\u0026#39;s 53bhp more than the standard version of the ID 7 but significantly down on the 460bhp \u003ca href=\"https://www.autocar.co.uk/car-review/tesla/model-3\"\u003eTesla Model 3 Performance\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCrucially, the modifications made for this GTX model extend beyond simply adding more power than you could sensibly enjoy. The progressive steering has been tuned to offer more feel, with the electronic differential lock system also reworked. There has also been extensive work to broaden the variance in dynamics enabled by the Dynamic Chassis Control (fitted as standard in the UK). Notably, \u003cspan\u003eVolkswagen\u003c/span\u003e engineers say the big advances have come from developments of the system software.\u003c/p\u003e\n\u003cp\u003eThe other big technical change is in the battery: the 77kWh pack used in the Pro model has been switched for an 86kWh one (also found in the long-range Pro S). It\u0026#39;s a different design, with the pack containing 13 cell modules instead of 12. It means that in saloon form, the GTX offers a range of 370 miles.\u003c/p\u003e\n\u003cp\u003eThe exterior styling changes that mark out the GTX from standard versions of the ID 7 are subtle but notable.\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s a new front bumper design exclusive to the performance line, along with revamped daytime running lights and a gloss-black front air intake. The bumper is aerodynamically styled to aid efficiency, while the front-end design now features a light-up VW logo as standard. \u003c/p\u003e\n\u003cp\u003eAt the rear, there\u0026#39;s a bespoke horizontal light strip (the rear VW badge illuminates as well) and customisable 3D-effect LED clusters.\u003c/p\u003e\n\u003cp\u003eOn the saloon, the lower area of the rear bumper features a honeycomb grille pattern and there\u0026#39;s a notable diffuser. \u003c/p\u003e\n\u003cp\u003eThe GTX sits on 20in wheels as standard, with 21in versions available as an option (and fitted to our test car). There are also custom GTX wheel rim designs.\u003c/p\u003e\n\u003cp\u003eThe GTX is also offered in Tourer estate form, which has an identical footprint and wheelbase to the saloon version but a bulkier rear end to accommodate a usefully larger boot.\u003c/p\u003e\n\u003cp\u003eThe two machines are visually identical at the front and share identical mechanicals, but because of the greater surface area, the Tourer has a reduced – but still substantial – range of 363 miles.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
