{
  "id": "f088c4b2-0451-44e7-89a9-79bf1cce98b2",
  "title": "10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion",
  "link": "https://bringatrailer.com/listing/2004-ferrari-360-challenge-stradale-33/",
  "description": "This 2004 Ferrari 360 Challenge Stradale is one of approximately 1,300 examples produced worldwide, and its six-speed gearbox has been converted to manual operation in 2023. Finished in Argento Nurburgring over Rosso Alcantara and cloth upholstery, the car has 10k miles and is powered by a 3.6-liter V8, which has been fitted with GruppeM carbon-fiber intakes. Equipment includes ceramic-composite brakes, 19\" Challenge-style alloy wheels, Scuderia Ferrari fender shields, a Challenge-style rear grille, carbon-fiber sport seats, a gated shifter, and machined aluminum pedals. This 360 Challenge Stradale was purchased by the owner in 2023 and is now offered on dealer consignment with the owner's manual, a tool kit, a car cover, a clean Carfax report, and a clean California title.",
  "author": "bringatrailer",
  "published": "Thu, 28 Nov 2024 00:58:35 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 3628,
  "excerpt": "Bid for the chance to own a 10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #173,113.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/apple-touch-icon-ipad-retina-152x152.png?v=http://a231e8a4fa",
  "text": "This 2004 Ferrari 360 Challenge Stradale is one of approximately 1,300 examples produced worldwide, and its six-speed gearbox has been converted to manual operation in 2023. Finished in Argento Nurburgring over Rosso Alcantara and cloth upholstery, the car has 10k miles and is powered by a 3.6-liter V8, which has been fitted with GruppeM carbon-fiber intakes. Equipment includes ceramic-composite brakes, 19″ Challenge-style alloy wheels, Scuderia Ferrari fender shields, a Challenge-style rear grille, carbon-fiber sport seats, a gated shifter, and machined aluminum pedals. This 360 Challenge Stradale was purchased by the owner in 2023 and is now offered on dealer consignment with the owner’s manual, a tool kit, a car cover, a clean Carfax report, and a clean California title. The 360 Challenge Stradale was the track-focused version of the 360 Modena and featured weight-saving measures including composite bumpers, a Lexan rear window with carbon-fiber supports, and carbon-fiber mirror housings. This example is finished in Argento Nurburgring and features xenon headlights, Scuderia Ferrari fender shields, a Challenge-style rear grille, and quad exhaust outlets exiting through the rear fascia. Paint protection film has been applied to the exterior, per the seller. The 19″ Challenge-style alloy wheels are mounted with Pirelli P Zero Corsa tires. The suspension features lower and stiffer titanium coil springs as well as a thicker rear anti-roll bar than those on the standard 360. Stopping power is from red-finished Ferrari-branded calipers over cross-drilled and ventilated ceramic-composite rotors at each corner. The cockpit features carbon-fiber sport seats upholstered in Rosso Alcantara and cloth along with matching fabric on the dashboard. Weight-saving trim utilized in the Challenge Stradale model included carbon-fiber door panels and reduced sound deadening. Additional appointments include aluminum pedals and a gated shifter. The air conditioning system does not blow cold, and interior sticky surfaces were refinished under current ownership, per the seller. The leather-wrapped steering wheel frames a 220-mph speedometer and a tachometer with an 8,500-rpm redline as well as a digital fuel level readout and gauges for oil pressure, oil temperature, and coolant temperature. The digital odometer indicates 10k miles, approximately 1k of which were added under current ownership. The mid-mounted 3.6-liter Tipo F131 V8 features a flat-plane crankshaft, dry-sump lubrication, dual overhead camshafts, and five valves per cylinder. The Challenge Stradale was factory rated at 425 horsepower, an increase over the standard 360, achieved using lighter and higher-compression pistons, a revised intake manifold, and ported intake and exhaust runners. GruppeM carbon-fiber intakes have been fitted. Power is sent to the rear wheels through a six-speed gearbox that has been converted to manual operation in 2023, at which time the flywheel was resurfaced and the clutch, release bearing, and flywheel bolts were replaced. The Carfax report is free of accidents or other reported damage. The car passed a California emissions inspection in September 2022. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/11/2004_ferrari_360-challenge-stradale_dsc02208-16362.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 2004 Ferrari 360 Challenge Stradale is one of approximately 1,300 examples produced worldwide, and its six-speed gearbox has been converted to manual operation in 2023. Finished in Argento Nurburgring over Rosso Alcantara and cloth upholstery, the car has 10k miles and is powered by a 3.6-liter V8, which has been fitted with GruppeM carbon-fiber intakes. Equipment includes ceramic-composite brakes, 19″ Challenge-style alloy wheels, Scuderia Ferrari fender shields, a Challenge-style rear grille, carbon-fiber sport seats, a gated shifter, and machined aluminum pedals. This 360 Challenge Stradale was purchased by the owner in 2023 and is now offered on dealer consignment with the owner’s manual, a tool kit, a car cover, a clean Carfax report, and a clean California title.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/2004_ferrari_360-challenge-stradale_dsc01220-28635.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 360 Challenge Stradale was the track-focused version of the 360 Modena and featured weight-saving measures including composite bumpers, a Lexan rear window with carbon-fiber supports, and carbon-fiber mirror housings. This example is finished in Argento Nurburgring and features xenon headlights, Scuderia Ferrari fender shields, a Challenge-style rear grille, and quad exhaust outlets exiting through the rear fascia. Paint protection film has been applied to the exterior, per the seller.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/2004_ferrari_360-challenge-stradale_dsc01281-2-28606.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 19″ Challenge-style alloy wheels are mounted with Pirelli P Zero Corsa tires. The suspension features lower and stiffer titanium coil springs as well as a thicker rear anti-roll bar than those on the standard 360. Stopping power is from red-finished Ferrari-branded calipers over cross-drilled and ventilated ceramic-composite rotors at each corner.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/2004_ferrari_360-challenge-stradale_dsc01145-28540.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe cockpit features carbon-fiber sport seats upholstered in Rosso Alcantara and cloth along with matching fabric on the dashboard. Weight-saving trim utilized in the Challenge Stradale model included carbon-fiber door panels and reduced sound deadening. Additional appointments include aluminum pedals and a gated shifter. The air conditioning system does not blow cold, and interior sticky surfaces were refinished under current ownership, per the seller.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/2004_ferrari_360-challenge-stradale_dsc01216-2-28518.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe leather-wrapped steering wheel frames a 220-mph speedometer and a tachometer with an 8,500-rpm redline as well as a digital fuel level readout and gauges for oil pressure, oil temperature, and coolant temperature. The digital odometer indicates 10k miles, approximately 1k of which were added under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/11/2004_ferrari_360-challenge-stradale_dsc01055-28472.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"10k-Mile 2004 Ferrari 360 Challenge Stradale 6-Speed Conversion\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe mid-mounted 3.6-liter Tipo F131 V8 features a flat-plane crankshaft, dry-sump lubrication, dual overhead camshafts, and five valves per cylinder. The Challenge Stradale was factory rated at 425 horsepower, an increase over the standard 360, achieved using lighter and higher-compression pistons, a revised intake manifold, and ported intake and exhaust runners. GruppeM carbon-fiber intakes have been fitted. Power is sent to the rear wheels through a six-speed gearbox that has been converted to manual operation in 2023, at which time the flywheel was resurfaced and the clutch, release bearing, and flywheel bolts were replaced.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or other reported damage.\u003c/p\u003e\n\u003cp\u003eThe car passed a California emissions inspection in September 2022.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
