{
  "id": "f1927518-b39d-41a2-84bf-7a65bcb4647b",
  "title": "Mercedes-Benz to launch 5-seater EQS 450 SUV on January 9",
  "link": "https://www.autocarindia.com/car-news/mercedes-benz-to-launch-5-seater-eqs-450-suv-on-january-9-433857#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Mercedes-Benz is gearing up to launch the EQS 450 SUV and G 580 with EQ technology on January 9. The latter will be a CKD offering, and incidentally, India is the first market outside the US to assemble the EQS SUV. Mercedes EQS 580 SUV and Maybach EQS 680 SUV launched in September The EQS 450 shares its 122kWh battery with the Maybach EQS 680 Current EQS 580 has a range of 809km Mercedes EQS 450 battery specs The 450 will be the second variant in the EQS SUV line-up (excluding the Maybach) and will be available as a 5-seater. It will be powered by the same 122kWh battery pack used in the 7-seater EQS 580 4Matic SUV (544hp, 858Nm). This is by far the country’s largest claimed cell capacity for any passenger EV. The battery can be charged from 10 to 80 percent in 31 minutes using a 200kW DC charger. For reference, the EQA and EQE SUVs are run by 70.5kWh and 90.5kWh batteries, respectively. Mercedes EQS 450 exterior, interior details This entry-level EQS SUV continues to have a familiar design with a blanked-off grille that extends into the lower section of the front bumper. The LED headlamps are bridged by a light bar running across the nose. Its overall aerodynamic silhouette resembles the EQS 580 but the design of the 21-inch alloy wheel has been refreshed. Inside, seats with crafted covers are standard and it gets exclusive features like Energising Air Control Plus. It is likely to borrow the 56-inch Hyperscreen setup – 12.3-inch instrument cluster and front passenger screen and a 17.7-inch touchscreen infotainment. It is also likely to include twin 11.6-inch rear entertainment screens, a 5-speaker Burmester audio system, 360-degree camera, 5-zone automatic climate control, soft close doors, puddle lamps and illuminated running boards. As for the safety bundle, expect Level 2 ADAS, 9 airbags, and more.  Mercedes EQS 450 price The Mercedes EQS 450 SUV is designed for buyers seeking extra cabin space, especially the chauffeur-driven. It remains to be seen how Mercedes will price it, as it will be placed between the Rs 1.59 crore EQE and the Rs 1.61 crore EQS SUVs (both prices on road, Mumbai). Stay tuned to the Autocar India website for more updates. Also see:    Mercedes EQS SUV review: High on EQ   Mercedes EQS to be replaced by S-Class electric for next-gen",
  "author": "Uday Singh",
  "published": "Fri, 13 Dec 2024 19:51:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Uday Singh",
  "length": 2256,
  "excerpt": "The G 580 with EQ Technology will also arrive alongside.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The G 580 with EQ Technology will also arrive alongside.Mercedes-Benz is gearing up to launch the EQS 450 SUV and G 580 with EQ technology on January 9. The latter will be a CKD offering, and incidentally, India is the first market outside the US to assemble the EQS SUV.Mercedes EQS 580 SUV and Maybach EQS 680 SUV launched in SeptemberThe EQS 450 shares its 122kWh battery with the Maybach EQS 680Current EQS 580 has a range of 809kmMercedes EQS 450 battery specsThe 450 will be the second variant in the EQS SUV line-up (excluding the Maybach) and will be available as a 5-seater. It will be powered by the same 122kWh battery pack used in the 7-seater EQS 580 4Matic SUV (544hp, 858Nm). This is by far the country’s largest claimed cell capacity for any passenger EV. The battery can be charged from 10 to 80 percent in 31 minutes using a 200kW DC charger. For reference, the EQA and EQE SUVs are run by 70.5kWh and 90.5kWh batteries, respectively.Mercedes EQS 450 exterior, interior detailsThis entry-level EQS SUV continues to have a familiar design with a blanked-off grille that extends into the lower section of the front bumper. The LED headlamps are bridged by a light bar running across the nose. Its overall aerodynamic silhouette resembles the EQS 580 but the design of the 21-inch alloy wheel has been refreshed.Inside, seats with crafted covers are standard and it gets exclusive features like Energising Air Control Plus. It is likely to borrow the 56-inch Hyperscreen setup – 12.3-inch instrument cluster and front passenger screen and a 17.7-inch touchscreen infotainment. It is also likely to include twin 11.6-inch rear entertainment screens, a 5-speaker Burmester audio system, 360-degree camera, 5-zone automatic climate control, soft close doors, puddle lamps and illuminated running boards. As for the safety bundle, expect Level 2 ADAS, 9 airbags, and more. Mercedes EQS 450 priceThe Mercedes EQS 450 SUV is designed for buyers seeking extra cabin space, especially the chauffeur-driven. It remains to be seen how Mercedes will price it, as it will be placed between the Rs 1.59 crore EQE and the Rs 1.61 crore EQS SUVs (both prices on road, Mumbai). Stay tuned to the Autocar India website for more updates.Also see: ImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241213074738_eqssuv450.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThe G 580 with EQ Technology will also arrive alongside.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/cars/mercedes-benz\"\u003e\u003cstrong\u003eMercedes-Benz\u003c/strong\u003e\u003c/a\u003e is gearing up to launch the EQS 450 SUV and G 580 with EQ technology on January 9. The latter will be a CKD offering, and incidentally, India is the first market outside the US to assemble the \u003ca href=\"https://www.autocarindia.com/cars/mercedes-benz/eqe-suv\"\u003e\u003cstrong\u003eEQS SUV\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eMercedes EQS 580 SUV and Maybach EQS 680 SUV launched in September\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eThe EQS 450 shares its 122kWh battery with the Maybach EQS 680\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eCurrent EQS 580 has a range of 809km\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003eMercedes EQS 450 battery specs\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe 450 will be the second variant in the EQS SUV line-up (excluding the Maybach) and will be available as a 5-seater. It will be powered by the same 122kWh battery pack used in the 7-seater EQS 580 4Matic SUV (544hp, 858Nm). This is by far the country’s largest claimed cell capacity for any passenger EV. The battery can be charged from 10 to 80 percent in 31 minutes using a 200kW DC charger. For reference, the EQA and EQE SUVs are run by 70.5kWh and 90.5kWh batteries, respectively.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eMercedes EQS 450 exterior, interior details\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThis entry-level EQS SUV continues to have a familiar design with a blanked-off grille that extends into the lower section of the front bumper. The LED headlamps are bridged by a light bar running across the nose. Its overall aerodynamic silhouette resembles the EQS 580 but the design of the 21-inch alloy wheel has been refreshed.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Mercedes-Benz EQS SUV 450 \" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20241213074748_Websiteimages  (2).jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Mercedes-Benz EQS SUV 450 \"/\u003e\u003c/p\u003e\u003cp\u003eInside, seats with crafted covers are standard and it gets exclusive features like Energising Air Control Plus. It is likely to borrow the 56-inch Hyperscreen setup – 12.3-inch instrument cluster and front passenger screen and a 17.7-inch touchscreen infotainment. It is also likely to include twin 11.6-inch rear entertainment screens, a 5-speaker Burmester audio system, 360-degree camera, 5-zone automatic climate control, soft close doors, puddle lamps and illuminated running boards. As for the safety bundle, expect Level 2 ADAS, 9 airbags, and more. \u003c/p\u003e\u003ch2\u003e\u003cspan\u003eMercedes EQS 450 price\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe Mercedes EQS 450 SUV is designed for buyers seeking extra cabin space, especially the chauffeur-driven. It remains to be seen how Mercedes will price it, as it will be placed between the Rs 1.59 crore EQE and the Rs 1.61 crore EQS SUVs (both prices on road, Mumbai). Stay tuned to the Autocar India website for more updates.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see: \u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-433857\"\u003e\u003cul id=\"tab-id-433857\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-433857\" href=\"#.\" rel=\"#tab-images-container-433857\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-433857\" href=\"#.\" rel=\"#tab-videos-container-433857\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-13T19:51:00+05:30",
  "modifiedTime": null
}
