{
  "id": "f53acb61-b1df-4259-93b2-c4e13f232a4c",
  "title": "Aston Martin Vantage Roadster",
  "link": "https://www.autocar.co.uk/car-review/aston-martin/vantage-roadster",
  "description": "Honing the ‘entry-level’ Aston produced spectacular results. Are they diminished in drop-top form? Last year we were treated to a heavily revised Aston Martin Vantage, and now there's an open-air version: the Roadster.This car has the potential to be really quite special. When we say the Vantage was heavily revised, we mean it. Compared to the previous model, power skyrocketed. The chassis also gained complex new electronics and suspension hardware, not to mention a far more serious contact patch. All this has now been translated to the Roadster – and with minimal dynamic compromise, according to the Aston. What we'll now discover is whether that's really the case, and whether the Roadster justifies its £180,000-plus asking price.",
  "author": "",
  "published": "Mon, 12 May 2025 00:01:03 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Deputy road test editor Follow:",
  "length": 10992,
  "excerpt": "Honing the ‘entry-level’ Aston produced spectacular results. Are they diminished in drop-top form?",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Last year we were treated to a heavily revised Aston Martin Vantage, and now there's an open-air version: the Roadster. This car has the potential to be really quite special. When we say the Vantage was heavily revised, we mean it. Compared to the previous model, power skyrocketed. The chassis also gained complex new electronics and suspension hardware, not to mention a far more serious contact patch.  All this has now been translated to the Roadster – and with minimal dynamic compromise, according to the Aston. What we'll now discover is whether that's really the case, and whether the Roadster justifies its £180,000-plus asking price. Verdict Pricey but has tons of charisma and few drawbacks. Possibly now the Vantage to have GoodElegant roof-down conversion of the coupeCohesive handling near-identical to the coupe'sMonstrous sense of personality with the roof offBadHeavier than rivals from Ferrari and PorscheLuggage space predictably compromised DESIGN \u0026 STYLING Pros Weight-gain over the coupe has been minimisedIntended from the outset to have the coupe's racey characterRapidly acting Z-fold roof mech is very neat indeed Cons Heavier outright than its direct rivals Eyebrows were raised when an Aston Martin engineer, speaking at the Austrian launch of the new Roadster, suggested the spring and damper rates had been carried over wholesale from the coupé unaltered. For something without a proper carbonfibre tub, this would be irregular. When you lop the top off a coupé, the body often then needs to be dramatically strengthened, adding heft to a car whose axles are already no longer singing in perfect unison because torsional stiffness has plummeted. Custom suspension rates are devised to claw back some precision and cohesion – or at least enhance the perception of those attributes. As it happens, the Vantage Roadster’s rear dampers do run recalibrated software, but the change compared with the coupé is minimal and the front axle hasn’t received any attention at all. So is this conversion a rush job? Budgets biting, perhaps? Nope. The Roadster simply doesn’t need special treatment, apparently. So meagre is the weight gain over the coupé and so stiff is the aluminium chassis (thanks in part to the fact it was developed from the outset with both derivatives in mind) that from a dynamic standpoint the coupé and convertible are essentially the same. Given how keen and fun-loving the coupé is, that will be music to the ears of those in the market for a rip-snorting drop-top that really handles. Here’s another surprising stat: 6.8sec. Not the 0-62mph time, thankfully. Rather the time taken for the ‘Z-fold’ fabric roof to arc through its full scope in either direction. It really is a rapid bit of mechanical choreography. The Porsche 911 Cabriolet needs 12sec and Ferrari’s Roma Spider a little longer still. What makes the Vantage Roadster all the more impressive is that the weight gain from the roof mechanicals and all the other structural additions is also the lowest of this trio, at 60kg. Opt for a Roma Spider instead of a coupé and you’re carrying 72kg more; in the 911 Carrera GTS Cabriolet, 80kg. Mind you, the Vantage is the heaviest outright. Of course, much of the above was also true of the previous Vantage Roadster, introduced in 2021. Where this new version markedly differs from its predecessor concerns the driveline and vast contact patch, both of which are, like the suspension rates, transplanted directly from the current coupé. That means you get a 656bhp (up 153bhp), 590lb ft (up 84lb ft) twin-turbocharged 4.0-litre V8 from Mercedes-AMG, driving through a ZF eight-speed torque-converter and an electronic limited-slip differential, all overseen by a stability control system with a superbly lenient midway setting before, should you turn it off entirely, you’re given access to a multi-stage traction control system. It’s also worth noting that the Roadster now hits the same 202mph V-max as the coupé (and reaches 62mph only a tenth slower) and is fitted with the same 73-litre tank, for a touring range of 450 miles. INTERIOR Pros Truly superb environment for long drivesIncreased level of 'Q' personalisation options Cons Limited luggage space because of the roof mechCapacitative switchgear isn't the easiest the use What you don’t get is the same carrying capacity. The coupé’s hatchback boot opening gives it a boot bigger than that even of the new Vanquish; if you open up the Roadster’s bootlid, you will find notably less luggage space, if not so little as to be routinely problematic. And in any case, as we shall soon highlight, the tighter cavity comes in handy because it means you can wedge your belongings in more tightly. Elsewhere the cabin is as per the coupe, which to say seriously well screwed together and conspicuously lavish in its materials, be they carbonfibre, leather or metal. Overall, this is easily now the most special cockpit in the class, and avoids ergonomics pitfalls, such as the Ferrari Roma Spider's strangely short driver footrest, which saps a bit of comfort on longer journeys.  Aston has also improved the legibility of the Vantage’s digital dials – chiefly in regard to gear and engine speed – and added a shortcut button for the ADAS settings on the broad transmission tunnel. The same changes are being made to the coupé. ENGINES \u0026 PERFORMANCE Pros Simply epic on full throttle, roof up or downOld-fashioned power-on adjustability is tons of funGood breadth to the chassis, which can tour… or rampage Cons Handling isn't as clinical as the 911's or fluid as the Roma'sRoadster's weight gain is small at 60kg but it's still there The Roadster’s visual muscle writes an almighty cheque, but it’s one the driving experience mostly cashes, especially when the roof is stowed away. The experience is – hold the front page – as per the coupé, only with added hell breaking loose behind you. Through mountain switchbacks there remains a faint nose-iness to the balance that wouldn’t be so apparent in the sharper Roma or 911, but the Roadster’s ability to remedy this with throttle is unparalleled. And while even in Sport+ mode there are flashes when the body works the Bilstein DTX dampers almost painfully hard, in general the Roadster has the control to keep everything hanging together, however far you push it. It’s an open-air muscle car with oodles of polish: Pontiac GTO meets Caterham Seven, with all the luxury.   As for refinement? It’s difficult to comment reliably when Austria’s roads are so good, but you would expect the Roadster to feel very similar to the coupé in the UK. Which is to say not immune to road roar but generally easier company than the equivalent 911. Aston could certainly have dialled the Roadster back a touch, making it more the riviera cruiser that the look hints at, but there’s the DB12 Volante for that, and there is merit in offering a model every bit as dynamically capable and exciting as the Vantage coupé, only in convertible form. It’s an unapologetic have-your-cake-and-eat-it play. MPG \u0026 RUNNING COSTS Pros Expensive but not unreasonably so given the competition Cons V8 is thirsty and tyres will be expensive The Roadster costs £181,500, compared to the £165,000 of the coupe. That's a fairly typical premium for open-air motiring in this class, and more broadly the Aston looks reasonably priced compared to its chief rivals from Porsche, Ferrari and Maserati.  As for economy, the official claimed figure is 23.0mpg. You can expect to do a better than on the motorway – and obviously far worse if you give twin-turbo V8 its head and really start to enjoy yourself. Tyres won't come cheap either. The new Vantage and is Roadster sibling have ane normous contact patch, with 325-section rears. Given how much the car loves to get a little bit out shape, you might be coming in for new boots sooner than expected.   VERDICT Verdict Pricey but has tons of charisma and few drawbacks. Possibly now the Vantage to have GoodElegant roof-down conversion of the coupeCohesive handling near-identical to the coupe'sMonstrous sense of personality with the roof offBadHeavier than rivals from Ferrari and PorscheLuggage space predictably compromised As somebody who generally veers towards the fixed-head option, I’d find it fairly hard to look past this drop-top. The handling is 2% less crisp, sure, but if you’re looking for the last word in synaptic delight, the 911 GTS is more grittily communicative anyway and the Roma more fluid, whichever the derivative. Anyway, that's not why you buy the Vantage, although it is a fine-handling car. You buy it for the looks, the noise, the sweetly doled-out oversteer, the cabin opulence, the long-distance capability and sense of satisfaction this car imparts. The coupé knits together those elements to lovable effect and, for a price, the Roadster takes the whole show up another notch still. Richard Lane Richard joined Autocar in 2017 and like all road testers is typically found either behind a keyboard or steering wheel (or, these days, a yoke). As deputy road test editor he delivers in-depth road tests and performance benchmarking, plus feature-length comparison stories between rival cars. He can also be found presenting on Autocar's YouTube channel. Mostly interested in how cars feel on the road – the sensations and emotions they can evoke – Richard drives around 150 newly launched makes and models every year. His job is then to put the reader firmly in the driver's seat.  NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/astonmartinvantageroadster0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \n    \u003cdiv\u003e\n                                \u003cdiv\u003e\n\u003cp\u003eLast year we were treated to a heavily revised \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/vantage\"\u003e\u003cstrong\u003eAston Martin Vantage\u003c/strong\u003e\u003c/a\u003e, and now there\u0026#39;s an open-air version: the Roadster.\u003c/p\u003e\n\u003cp\u003eThis car has the potential to be really quite special. When we say the Vantage was heavily revised, we mean it. Compared to the \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/vantage-2018-2024\"\u003eprevious model\u003c/a\u003e, power skyrocketed. The chassis also gained complex new electronics and suspension hardware, not to mention a far more serious contact patch. \u003c/p\u003e\n\u003cp\u003eAll this has now been translated to the Roadster – and with minimal dynamic compromise, according to the Aston. What we\u0026#39;ll now discover is whether that\u0026#39;s really the case, and whether the Roadster justifies its £180,000-plus asking price.\u003c/p\u003e\n\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003ePricey but has tons of charisma and few drawbacks. Possibly now the Vantage to have\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eElegant roof-down conversion of the coupe\u003c/p\u003e\u003cp\u003eCohesive handling near-identical to the coupe\u0026#39;s\u003c/p\u003e\u003cp\u003eMonstrous sense of personality with the roof off\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eHeavier than rivals from Ferrari and Porsche\u003c/p\u003e\u003cp\u003eLuggage space predictably compromised\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n                              \u003c/div\u003e\n\n        \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n      \n  \n      \u003cdiv\u003e\n                                            \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eWeight-gain over the coupe has been minimised\u003c/p\u003e\u003cp\u003eIntended from the outset to have the coupe\u0026#39;s racey character\u003c/p\u003e\u003cp\u003eRapidly acting Z-fold roof mech is very neat indeed\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eHeavier outright than its direct rivals\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eEyebrows were raised when an Aston Martin engineer, speaking at the Austrian launch of the new Roadster, suggested the spring and damper rates had been carried over wholesale from the coupé unaltered.\u003c/p\u003e\n\u003cp\u003eFor something without a proper carbonfibre tub, this would be irregular. When you lop the top off a coupé, the body often then needs to be dramatically strengthened, adding heft to a car whose axles are already no longer singing in perfect unison because torsional stiffness has plummeted. Custom suspension rates are devised to claw back some precision and cohesion – or at least enhance the perception of those attributes.\u003c/p\u003e\n\u003cp\u003eAs it happens, the Vantage Roadster’s rear dampers do run recalibrated software, but the change compared with the coupé is minimal and the front axle hasn’t received any attention at all. So is this conversion a rush job? Budgets biting, perhaps? Nope. The Roadster simply doesn’t need special treatment, apparently.\u003c/p\u003e\n\u003cp\u003eSo meagre is the weight gain over the coupé and so stiff is the aluminium chassis (thanks in part to the fact it was developed from the outset with both derivatives in mind) that from a dynamic standpoint the coupé and convertible are essentially the same. Given how keen and fun-loving the coupé is, that will be music to the ears of those in the market for a rip-snorting drop-top that really handles.\u003c/p\u003e\n\u003cp\u003eHere’s another surprising stat: 6.8sec. Not the 0-62mph time, thankfully. Rather the time taken for the ‘Z-fold’ fabric roof to arc through its full scope in either direction. It really is a rapid bit of mechanical choreography. The \u003ca href=\"https://www.autocar.co.uk/car-review/porsche/911\"\u003ePorsche 911\u003c/a\u003e Cabriolet needs 12sec and \u003ca href=\"https://www.autocar.co.uk/car-review/ferrari/roma-spider\"\u003eFerrari’s Roma Spider\u003c/a\u003e a little longer still.\u003c/p\u003e\u003c/div\u003e                                          \u003c/div\u003e\n   \n                     \n            \u003cdiv\u003e\n\u003cp\u003eWhat makes the Vantage Roadster all the more impressive is that the weight gain from the roof mechanicals and all the other structural additions is also the lowest of this trio, at 60kg. Opt for a Roma Spider instead of a coupé and you’re carrying 72kg more; in the 911 Carrera GTS Cabriolet, 80kg. Mind you, the Vantage is the heaviest outright.\u003c/p\u003e\n\u003cp\u003eOf course, much of the above was also true of the previous Vantage Roadster, introduced in 2021. Where this new version markedly differs from its predecessor concerns the driveline and vast contact patch, both of which are, like the suspension rates, transplanted directly from the current coupé.\u003c/p\u003e\n\u003cp\u003eThat means you get a 656bhp (up 153bhp), 590lb ft (up 84lb ft) twin-turbocharged 4.0-litre V8 from Mercedes-AMG, driving through a ZF eight-speed torque-converter and an electronic limited-slip differential, all overseen by a stability control system with a superbly lenient midway setting before, should you turn it off entirely, you’re given access to a multi-stage traction control system.\u003c/p\u003e\n\u003cp\u003eIt’s also worth noting that the Roadster now hits the same 202mph V-max as the coupé (and reaches 62mph only a tenth slower) and is fitted with the same 73-litre tank, for a touring range of 450 miles.\u003c/p\u003e\n\u003c/div\u003e\n        \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eINTERIOR\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eTruly superb environment for long drives\u003c/p\u003e\u003cp\u003eIncreased level of \u0026#39;Q\u0026#39; personalisation options\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eLimited luggage space because of the roof mech\u003c/p\u003e\u003cp\u003eCapacitative switchgear isn\u0026#39;t the easiest the use\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eWhat you don’t get is the same carrying capacity. The coupé’s hatchback boot opening gives it a boot bigger than that even of the \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/vanquish\"\u003enew Vanquish\u003c/a\u003e; if you open up the Roadster’s bootlid, you will find notably less luggage space, if not so little as to be routinely problematic. And in any case, as we shall soon highlight, the tighter cavity comes in handy because it means you can wedge your belongings in more tightly.\u003c/p\u003e\n\u003cp\u003eElsewhere the cabin is as per the coupe, which to say seriously well screwed together and conspicuously lavish in its materials, be they carbonfibre, leather or metal. Overall, this is easily now the most special cockpit in the class, and avoids ergonomics pitfalls, such as the Ferrari Roma Spider\u0026#39;s strangely short driver footrest, which saps a bit of comfort on longer journeys. \u003c/p\u003e\n\u003cp\u003eAston has also improved the legibility of the Vantage’s digital dials – chiefly in regard to gear and engine speed – and added a shortcut button for the ADAS settings on the broad transmission tunnel. The same changes are being made to the coupé.\u003c/p\u003e\n\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eSimply epic on full throttle, roof up or down\u003c/p\u003e\u003cp\u003eOld-fashioned power-on adjustability is tons of fun\u003c/p\u003e\u003cp\u003eGood breadth to the chassis, which can tour… or rampage\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eHandling isn\u0026#39;t as clinical as the 911\u0026#39;s or fluid as the Roma\u0026#39;s\u003c/p\u003e\u003cp\u003eRoadster\u0026#39;s weight gain is small at 60kg but it\u0026#39;s still there\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe Roadster’s visual muscle writes an almighty cheque, but it’s one the driving experience mostly cashes, especially when the roof is stowed away. The experience is – hold the front page – as per the coupé, only with added hell breaking loose behind you.\u003c/p\u003e\n\u003cp\u003eThrough mountain switchbacks there remains a faint nose-iness to the balance that wouldn’t be so apparent in the sharper Roma or 911, but the Roadster’s ability to remedy this with throttle is unparalleled. And while even in Sport+ mode there are flashes when the body works the Bilstein DTX dampers almost painfully hard, in general the Roadster has the control to keep everything hanging together, however far you push it.\u003c/p\u003e\n\u003cp\u003eIt’s an open-air muscle car with oodles of polish: Pontiac GTO meets Caterham Seven, with all the luxury.  \u003c/p\u003e\n\u003cp\u003eAs for refinement? It’s difficult to comment reliably when Austria’s roads are so good, but you would expect the Roadster to feel very similar to the coupé in the UK. Which is to say not immune to road roar but generally easier company than the equivalent 911.\u003c/p\u003e\n\u003cp\u003eAston could certainly have dialled the Roadster back a touch, making it more the riviera cruiser that the look hints at, but there’s the DB12 Volante for that, and there is merit in offering a model every bit as dynamically capable and exciting as the Vantage coupé, only in convertible form. It’s an unapologetic have-your-cake-and-eat-it play.\u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\n \n\n \n\u003cdiv data-id=\"mpg\" id=\"chapter-mpg\"\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eMPG \u0026amp; RUNNING COSTS\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eExpensive but not unreasonably so given the competition \u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eV8 is thirsty and tyres will be expensive\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe Roadster costs £181,500, compared to the £165,000 of the coupe. That\u0026#39;s a fairly typical premium for open-air motiring in this class, and more broadly the Aston looks reasonably priced compared to its chief rivals from Porsche, Ferrari and Maserati. \u003c/p\u003e\n\u003cp\u003eAs for economy, the official claimed figure is 23.0mpg. You can expect to do a better than on the motorway – and obviously far worse if you give twin-turbo V8 its head and really start to enjoy yourself. Tyres won\u0026#39;t come cheap either. The new Vantage and is Roadster sibling have ane normous contact patch, with 325-section rears. Given how much the car loves to get a little bit out shape, you might be coming in for new boots sooner than expected.  \u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n         \u003cdiv\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eVERDICT\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003ePricey but has tons of charisma and few drawbacks. Possibly now the Vantage to have\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eElegant roof-down conversion of the coupe\u003c/p\u003e\u003cp\u003eCohesive handling near-identical to the coupe\u0026#39;s\u003c/p\u003e\u003cp\u003eMonstrous sense of personality with the roof off\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eHeavier than rivals from Ferrari and Porsche\u003c/p\u003e\u003cp\u003eLuggage space predictably compromised\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eAs somebody who generally veers towards the fixed-head option, I’d find it fairly hard to look past this drop-top. The handling is 2% less crisp, sure, but if you’re looking for the last word in synaptic delight, the 911 GTS is more grittily communicative anyway and the Roma more fluid, whichever the derivative.\u003c/p\u003e\n\u003cp\u003eAnyway, that\u0026#39;s not why you buy the Vantage, although it is a fine-handling car. You buy it for the looks, the noise, the sweetly doled-out oversteer, the cabin opulence, the long-distance capability and sense of satisfaction this car imparts. The coupé knits together those elements to lovable effect and, for a price, the Roadster takes the whole show up another notch still.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n                      \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/richard-lane\"\u003eRichard Lane\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\u003cp\u003eRichard joined Autocar in 2017 and like all road testers is typically found either behind a keyboard or steering wheel (or, these days, a yoke).\u003c/p\u003e\n\u003cp\u003eAs deputy road test editor he delivers in-depth road tests and performance benchmarking, plus feature-length comparison stories between rival cars. He can also be found presenting on Autocar\u0026#39;s \u003ca href=\"https://www.youtube.com/channel/UCIMzhx509wEXMuGkTK-kD9Q\"\u003eYouTube channel\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMostly interested in how cars feel on the road – the sensations and emotions they can evoke – Richard drives around 150 newly launched makes and models every year. His job is then to put the reader firmly in the driver\u0026#39;s seat. \u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n                            \u003c/div\u003e\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": null,
  "modifiedTime": null
}
