{
  "id": "fce43bb2-e112-4307-be9b-bdbe1790afac",
  "title": "Volvo XC60 gets new look and upgraded interior",
  "link": "https://www.autocar.co.uk/car-news/new-cars/volvo-xc60-gets-new-look-and-upgraded-interior",
  "description": "New grille mirrors that fitted to the XC90 Brand’s best-selling SUV gets a further update ahead of the arrival of its electric sibling, the EX60 The Volvo XC60 has been updated with a new look and upgraded interior in a bid to maintain the appeal of the brand's best-selling model. Visual changes include a new grille similar to that fitted to the new XC90, as well as darker rear lights. There will also be new wheel designs, although UK specifications have yet to be confirmed. Inside, the car gets a larger, 11.2in infotainment touchscreen that is now elevated above the dashboard’s surface. It runs via a more powerful chip from American firm Qualcomm, which is said to make the system twice as quick to respond to inputs as before. It also brings crisper graphics, according to Volvo. The new XC60 is said to get more luxurious materials inside, with upholstery options including a combination of Nordico synthetic leather and herringbone-pattern fabric. Cabin refinement is said to be improved too. Powertrains are unchanged, meaning there is a choice of a 248bhp mild hybrid or two plug-in hybrids with outputs of 345bhp and 449bhp. Cars with coil-sprung suspension will receive new dampers intended to soften their ride, although the air suspension set-up remains unchanged. Prices are set to be confirmed next month but are expected to rise slightly compared with the outgoing version of the XC60, which is priced from £46,115. Deliveries will begin in the third quarter, between July and the end of September. That the petrol-powered XC60 has received an update so close to the release of its electric counterpart, the EX60 (due next year), suggests it will remain on sale for the foreseeable future. Indeed, Volvo boss Jim Rowan has previously suggested that the larger XC90 could remain on sale into the next decade, depending on demand for the model relative to its EX90 sibling. “We will be ready to go fully electric this decade, but if the market infrastructure and customer acceptance is not quite there, we can allow that to take a few more years,” he said. “The transition to electrification will not be linear. Customers and markets are moving at different speeds, and therefore we will continue to invest in our hybrids so that wherever you are in your journey to electric driving, you can have a Volvo to suit your needs and your situations.”",
  "author": "",
  "published": "Tue, 18 Feb 2025 12:56:35 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Autocar",
  "length": 2221,
  "excerpt": "Brand’s best-selling SUV gets another update ahead of the arrival of its electric sibling, the EX60",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The Volvo XC60 has been updated with a new look and upgraded interior in a bid to maintain the appeal of the brand's best-selling model. Visual changes include a new grille similar to that fitted to the new XC90, as well as darker rear lights. There will also be new wheel designs, although UK specifications have yet to be confirmed. Inside, the car gets a larger, 11.2in infotainment touchscreen that is now elevated above the dashboard’s surface. It runs via a more powerful chip from American firm Qualcomm, which is said to make the system twice as quick to respond to inputs as before. It also brings crisper graphics, according to Volvo. The new XC60 is said to get more luxurious materials inside, with upholstery options including a combination of Nordico synthetic leather and herringbone-pattern fabric. Cabin refinement is said to be improved too. Powertrains are unchanged, meaning there is a choice of a 248bhp mild hybrid or two plug-in hybrids with outputs of 345bhp and 449bhp. Cars with coil-sprung suspension will receive new dampers intended to soften their ride, although the air suspension set-up remains unchanged. Prices are set to be confirmed next month but are expected to rise slightly compared with the outgoing version of the XC60, which is priced from £46,115. Deliveries will begin in the third quarter, between July and the end of September. That the petrol-powered XC60 has received an update so close to the release of its electric counterpart, the EX60 (due next year), suggests it will remain on sale for the foreseeable future. Indeed, Volvo boss Jim Rowan has previously suggested that the larger XC90 could remain on sale into the next decade, depending on demand for the model relative to its EX90 sibling. “We will be ready to go fully electric this decade, but if the market infrastructure and customer acceptance is not quite there, we can allow that to take a few more years,” he said. “The transition to electrification will not be linear. Customers and markets are moving at different speeds, and therefore we will continue to invest in our hybrids so that wherever you are in your journey to electric driving, you can have a Volvo to suit your needs and your situations.”",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/volvo-xc60-refresh-front-quarter.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.autocar.co.uk/car-review/volvo/xc60\"\u003eVolvo XC60\u003c/a\u003e has been updated with a new look and upgraded interior in a bid to maintain the appeal of the brand\u0026#39;s best-selling model.\u003c/p\u003e\n\u003cp\u003eVisual changes include a new grille similar to that fitted to the \u003ca href=\"https://www.autocar.co.uk/car-review/volvo/xc90\"\u003enew XC90\u003c/a\u003e, as well as darker rear lights. There will also be new wheel designs, although UK specifications have yet to be confirmed.\u003c/p\u003e\n\u003cp\u003eInside, the car gets a larger, 11.2in infotainment touchscreen that is now elevated above the dashboard’s surface.\u003c/p\u003e\n\n\u003cp\u003eIt runs via a more powerful chip from American firm Qualcomm, which is said to make the system twice as quick to respond to inputs as before. It also brings crisper graphics, according to Volvo.\u003c/p\u003e\n\u003cp\u003eThe new XC60 is said to get more luxurious materials inside, with upholstery options including a combination of Nordico synthetic leather and herringbone-pattern fabric. Cabin refinement is said to be improved too.\u003c/p\u003e\n\u003cp\u003ePowertrains are unchanged, meaning there is a choice of a 248bhp mild hybrid or two plug-in hybrids with outputs of 345bhp and 449bhp.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Volvo XC60 update – dashboard\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/volvo-xc60-refresh-dashboard.jpg?itok=Z7o2VkPR\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/volvo-xc60-refresh-dashboard.jpg?itok=Z7o2VkPR\"/\u003e\u003c/p\u003e\n\u003cp\u003eCars with coil-sprung suspension will receive new dampers intended to soften their ride, although the air suspension set-up remains unchanged.\u003c/p\u003e\n\u003cp\u003ePrices are set to be confirmed next month but are expected to rise slightly compared with the outgoing version of the XC60, which is priced from £46,115. Deliveries will begin in the third quarter, between July and the end of September.\u003c/p\u003e\n\u003cp\u003eThat the petrol-powered XC60 has received an update so close to the release of its \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/crucial-volvo-ex60-start-testing-year-ahead-2026-launch\"\u003eelectric counterpart, the EX60\u003c/a\u003e (due next year), suggests it will remain on sale for the foreseeable future.\u003c/p\u003e\n\u003cp\u003eIndeed, Volvo boss Jim Rowan has previously suggested that the larger \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/new-petrol-volvo-xc90-revealed-firm-hints-ice-sales-after-2030\"\u003eXC90 could remain on sale\u003c/a\u003e into the next decade, depending on demand for the model relative to its \u003ca href=\"https://www.autocar.co.uk/car-review/volvo/ex90\"\u003eEX90 sibling\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e“We will be ready to go fully electric this decade, but if the market infrastructure and customer acceptance is not quite there, we can allow that to take a few more years,” he said. “The transition to electrification will not be linear. Customers and markets are moving at different speeds, and therefore we will continue to invest in our hybrids so that wherever you are in your journey to electric driving, you can have a Volvo to suit your needs and your situations.” \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "1970-01-01T01:00:00Z",
  "modifiedTime": null
}
