{
  "id": "02ed5247-d4e0-4af8-860a-e255c56396c1",
  "title": "Bentancur, Son \u0026 the rise of racism against South East Asians in football",
  "link": "https://www.bbc.com/sport/football/articles/cde7p7yy6nno",
  "description": "BBC Sport looks at the rise in racism towards East and South East Asian players and fans in football.",
  "author": "",
  "published": "Wed, 20 Nov 2024 13:38:49 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Nizaar Kinsella",
  "length": 6108,
  "excerpt": "BBC Sport looks at the rise in racism towards East and South East Asian players and fans in football.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Bentancur, Son \u0026 the rise of racism against South East Asians in footballImage source, Getty ImagesImage caption, Totteham's Son Heung-min accepted an apology from team-mate Rodrigo Bentancur in the summer.The seven-game ban given to Tottenham's Rodrigo Bentancur for a racial slur about team-mate Son Heung-min has restarted the conversation about racism towards players and fans of East and South East Asian descent.Anti-racism charity Kick It Out (KIO) says there has been a rise in both incidents of racism towards East and South East Asian players - and reports of those incidents, highlighted in these statistics:There were 395 reports of \"player-targeted\" racist abuse in stadiums and online to KIO in the 2023-24 season - up from 277 in 2022-23.55% of those reports of racism aimed at specific players last season was towards those from an East Asian background.Of the 937 player-specific abuse reports to KIO in the past five full seasons, 327 of them (35%) have been directed at just seven East and South East Asian players. Kick It Out chief executive Samuel Okafor said: \"We are getting a lot of reports about this type of racism.\"It’s fans sending us a clear message they are not willing to tolerate discrimination and it’s a message that football needs to listen to.\"The players who have being targeted regularly over the past five seasons have not been named by Kick It Out.The most high profile East or South East Asian players in the Premier League are Spurs' Son and Hwang Hee-Chan from South Korea, and the Japanese quartet of Brighton winger Kauro Mitoma, Arsenal's Takehiro Tomiyasu, Crystal Palace's Daichi Kamada and Southampton's Yukinari Sugawara.In October, Como's Marco Curto was given a 10-match ban by Fifa, five suspended, for racially abusing Wolves forward Hwang in a pre-season friendly in July.Spurs players 'moving on'Son has been racially abused multiple times since coming to the Premier League in 2015, with the most recent case seeing a Nottingham Forest supporter banned from every ground in the country.Similar publicised incidents have occurred involving Son among the fan bases for Manchester United, Chelsea, Crystal Palace and West Ham between 2019 and 2023. Show Racism the Red Card also called out viral social media posts linking Asian players to the coronavirus outbreak in 2020. On Wednesday, Tottenham released a statement that said: \"The club has appealed against the length of Bentancur's FA suspension.\"While we accept the guilty finding against Rodrigo by the independent regulatory commission, we believe the subsequent sanction is severe.\"Spurs defender Ben Davies, speaking while on international duty with Wales, said: \"I think that as a group, as a team at Tottenham, we’ve all put a line under it and moved on.\"But, ultimately, it's important that we realise that these kind of things need to be looked at with the seriousness that it has been.\"Manager Ange Postecoglou will speak to the media on Friday and previously said his midfielder made a \"big error\" and that \"he has got to take the punishment\".'We have this every week' - the fan experience\"To be brutally honest, we run into these kind of things every week,\" says London-based Premier League video content creator Kevin Yuan.It's not only the high profile players facing racist abuse - fans have told BBC Sport about their experiences following football.Yuan was racially abused alongside a female colleague outside Wembley Stadium by Real Madrid supporters after the Champions League final in June.Yuan creates football content for the Chinese media market and was filming with celebrating Madrid fans who were - unknown to him - singing a racially offensive chant in Spanish about Chinese women, aimed at his colleague.\"I asked one fan what did that chant mean? And he said, that's it's a Real Madrid chant, that we are champions,\" he said.\"The next day we were told by our friends in Spain that this was actually a very racist song. We found it incredibly offensive.\"Yuan revealed he has faced similar incidents filming at English clubs.\"It feels like part of our jobs [to take the abuse],\" he said. \"We film at different stadiums before and after the game and it seems to happen literally every week. \"I don't know if it is because of the way I look or speak.\"I am in a chat group with Chinese supporters of Manchester United and we have a saying that you will be extremely lucky to avoid a racist incident at least once during a season.\"It happens no matter which team you support. I came to the UK in 2008 and have been going to games since then - but I feel like a foreigner, like I don't fit in. I would hope people can understand how unsettling it is and put themselves in my shoes.\"Some fans are 'characterised as tourists'Image source, Getty ImagesImage caption, A Tottenham fan holds up a banner supporting Son Heung-minMaxwell Min, the projects co-ordinator for the Frank Soo Foundation, which celebrates the life of the first non-white player to play for England in 1945, explains why he thinks there is a tension. \"It's easy to conclude that East and South East Asians don't play football - but there is a missing link that they are often playing at levels unaffiliated to the county FA system so it is easy to ignore them,\" he said.\"There may be a simple fact that it is only in recent years that East and South East Asians have begun playing in our stadiums at the highest level, through Japanese and Korean players. \"There are also new fans in the stadium and there is this assumption that these fans have a more shallow interest in the sport; that it is not as deep as the so-called local or usual ethnic groups that are seen, often seeing them characterised as 'tourists'.Min added: \"I've had negative incidents myself but the love of football has put me in the position where I am working in the game in this role.\"When I was a kid, I thought Manchester United's Ji Sung Park was the best an Asian player could be. But seeing Son win the Golden Boot and be on course to become a legend for Tottenham has increased my dreams and positive expectations for the future.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eBentancur, Son \u0026amp; the rise of racism against South East Asians in football\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Totteham\u0026#39;s Son Heung-min accepted an apology from team-mate Rodrigo Bentancur in the summer.\" loading=\"eager\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5eb9/live/f06f5240-a77e-11ef-a968-c7efee733ac0.jpg 976w\" width=\"1024\" height=\"575.937069813176\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eTotteham\u0026#39;s Son Heung-min accepted an apology from team-mate Rodrigo Bentancur in the summer.\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eThe seven-game ban given to Tottenham\u0026#39;s Rodrigo Bentancur for a racial slur about team-mate Son Heung-min has restarted the conversation about racism towards players and fans of East and South East Asian descent.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eAnti-racism charity Kick It Out (KIO) says there has been a rise in both incidents of racism towards East and South East Asian players - and reports of those incidents, highlighted in these statistics:\u003c/p\u003e\u003cdiv\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003cp\u003eThere were \u003ca href=\"https://www.bbc.com/sport/football/articles/c80xwlgpwxjo\"\u003e395 reports of \u0026#34;player-targeted\u0026#34; racist abuse\u003c/a\u003e in stadiums and online to KIO in the 2023-24 season - up from 277 in 2022-23.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e55% of those reports of racism aimed at specific players last season was towards those from an East Asian background.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eOf the 937 player-specific abuse reports to KIO in the past five full seasons, 327 of them (35%) have been directed at just seven East and South East Asian players. \u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eKick It Out chief executive Samuel Okafor said: \u0026#34;We are getting a lot of reports about this type of racism.\u003c/p\u003e\u003cp\u003e\u0026#34;It’s fans sending us a clear message they are not willing to tolerate discrimination and it’s a message that football needs to listen to.\u0026#34;\u003c/p\u003e\u003cp\u003eThe players who have being targeted regularly over the past five seasons have not been named by Kick It Out.\u003c/p\u003e\u003cp\u003eThe most high profile East or South East Asian players in the Premier League are Spurs\u0026#39; Son and Hwang Hee-Chan from South Korea, and the Japanese quartet of Brighton winger Kauro Mitoma, Arsenal\u0026#39;s Takehiro Tomiyasu, Crystal Palace\u0026#39;s Daichi Kamada and Southampton\u0026#39;s Yukinari Sugawara.\u003c/p\u003e\u003cp\u003eIn October, Como\u0026#39;s Marco Curto was given a \u003ca href=\"https://www.bbc.com/sport/football/articles/c5y065y1jnxo\"\u003e10-match ban by Fifa,\u003c/a\u003e five suspended, for racially abusing Wolves forward Hwang in a pre-season friendly in July.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Spurs-players-moving-on\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eSpurs players \u0026#39;moving on\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSon has been racially abused multiple times since coming to the Premier League in 2015, with the most recent case seeing a \u003ca href=\"https://www.bbc.com/news/articles/c299rkzr4ddo\"\u003eNottingham Forest supporter banned\u003c/a\u003e from every ground in the country.\u003c/p\u003e\u003cp\u003eSimilar publicised incidents have occurred involving Son among the fan bases for Manchester United, Chelsea, Crystal Palace and West Ham between 2019 and 2023. \u003c/p\u003e\u003cp\u003eShow Racism the Red Card also called out viral social media posts linking Asian players to the coronavirus outbreak in 2020. \u003c/p\u003e\u003cp\u003eOn Wednesday, Tottenham released a statement that said: \u0026#34;\u003ca href=\"https://www.bbc.com/sport/football/articles/c5yx7v23pejo\"\u003eThe club has appealed against the length of Bentancur\u0026#39;s FA suspension.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;While we accept the guilty finding against Rodrigo by the independent regulatory commission, we believe the subsequent sanction is severe.\u0026#34;\u003c/p\u003e\u003cp\u003eSpurs defender Ben Davies, speaking while on international duty with Wales, said: \u0026#34;I think that as a group, as a team at Tottenham, we’ve all put a line under it and moved on.\u003c/p\u003e\u003cp\u003e\u0026#34;But, ultimately, it\u0026#39;s important that we realise that these kind of things need to be looked at with the seriousness that it has been.\u0026#34;\u003c/p\u003e\u003cp\u003eManager Ange Postecoglou will speak to the media on Friday and previously said his midfielder made a \u0026#34;big error\u0026#34; and that \u0026#34;he has got to take the punishment\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"We-have-this-every-week-the-fan-experience\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;We have this every week\u0026#39; - the fan experience\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;To be brutally honest, we run into these kind of things every week,\u0026#34; says London-based Premier League video content creator Kevin Yuan.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s not only the high profile players facing racist abuse - fans have told BBC Sport about their experiences following football.\u003c/p\u003e\u003cp\u003eYuan was racially abused alongside a female colleague outside Wembley Stadium by Real Madrid supporters after the Champions League final in June.\u003c/p\u003e\u003cp\u003eYuan creates football content for the Chinese media market and was filming with celebrating Madrid fans who were - unknown to him - singing a racially offensive chant in Spanish about Chinese women, aimed at his colleague.\u003c/p\u003e\u003cp\u003e\u0026#34;I asked one fan what did that chant mean? And he said, that\u0026#39;s it\u0026#39;s a Real Madrid chant, that we are champions,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;The next day we were told by our friends in Spain that this was actually a very racist song. We found it incredibly offensive.\u0026#34;\u003c/p\u003e\u003cp\u003eYuan revealed he has faced similar incidents filming at English clubs.\u003c/p\u003e\u003cp\u003e\u0026#34;It feels like part of our jobs [to take the abuse],\u0026#34; he said. \u0026#34;We film at different stadiums before and after the game and it seems to happen literally every week. \u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t know if it is because of the way I look or speak.\u003c/p\u003e\u003cp\u003e\u0026#34;I am in a chat group with Chinese supporters of Manchester United and we have a saying that you will be extremely lucky to avoid a racist incident at least once during a season.\u003c/p\u003e\u003cp\u003e\u0026#34;It happens no matter which team you support. I came to the UK in 2008 and have been going to games since then - but I feel like a foreigner, like I don\u0026#39;t fit in. I would hope people can understand how unsettling it is and put themselves in my shoes.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Some-fans-are-characterised-as-tourists\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eSome fans are \u0026#39;characterised as tourists\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eA Tottenham fan holds up a banner supporting Son Heung-min\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eMaxwell Min, the projects co-ordinator for the Frank Soo Foundation, which \u003ca href=\"https://www.bbc.com/sport/football/67418972\"\u003ecelebrates the life of the first non-white player to play for England\u003c/a\u003e in 1945, explains why he thinks there is a tension. \u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s easy to conclude that East and South East Asians don\u0026#39;t play football - but there is a missing link that they are often playing at levels unaffiliated to the county FA system so it is easy to ignore them,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;There may be a simple fact that it is only in recent years that East and South East Asians have begun playing in our stadiums at the highest level, through Japanese and Korean players. \u003c/p\u003e\u003cp\u003e\u0026#34;There are also new fans in the stadium and there is this assumption that these fans have a more shallow interest in the sport; that it is not as deep as the so-called local or usual ethnic groups that are seen, often seeing them characterised as \u0026#39;tourists\u0026#39;.\u003c/p\u003e\u003cp\u003eMin added: \u0026#34;I\u0026#39;ve had negative incidents myself but the love of football has put me in the position where I am working in the game in this role.\u003c/p\u003e\u003cp\u003e\u0026#34;When I was a kid, I thought Manchester United\u0026#39;s Ji Sung Park was the best an Asian player could be. But seeing Son win the Golden Boot and be on course to become a legend for Tottenham has increased my dreams and positive expectations for the future.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-20T13:38:49.564Z",
  "modifiedTime": null
}
