{
  "id": "17551a1b-ff98-40e6-a912-2842c8903544",
  "title": "Mr Calm no more - Bellamy revels in Wales' chaos",
  "link": "https://www.bbc.com/sport/football/articles/cp3ygppk271o",
  "description": "Craig Bellamy shed his new 'Mr Calm' nickname after a wild conclusion to Wales' World Cup qualifier in North Macedonia.",
  "author": "",
  "published": "Wed, 26 Mar 2025 00:11:35 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Dafydd Pritchard",
  "length": 3664,
  "excerpt": "Craig Bellamy shed his new 'Mr Calm' nickname after a wild conclusion to Wales' World Cup qualifier in North Macedonia.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Craig Bellamy's new nickname did not last long.On Saturday, the Wales head coach was described as \"Mr Calm\" by captain Ben Davies after his half-time speech following a frustrating first half against Kazakhstan.For those familiar with Bellamy the player – a combustible, volatile sort – Davies' moniker will have raised a few eyebrows.But Bellamy the coach is not the young footballer who his former Newcastle United manager Bobby Robson had said could start an argument in an empty room.Now 45 and managing his country, Bellamy has mellowed. After periods of introspection and self-analysis, Bellamy the coach is a different person, one who prides himself on his composure and analytical eye.Players have talked of his considered team talks and detailed tactical presentations; his interviews with the media have been measured, thoughtful and wide-ranging.But in North Macedonia on Tuesday night, when Wales bundled in an added-time equaliser after a conclusion of stupefying drama, that cool veneer disappeared in an instant.As David Brooks' shot crept over the line, an ecstatic Bellamy leapt in the air and roared with delight. His feet had barely touched the ground when he was asked to summarise his feelings.\"My main reaction? Probably shock, still,\" he said.\"Calm? Not at all. Even now, I'm not. I thought it would have been difficult to accept losing today. But you have to accept certain things as much as you don't want to.\"As a coach you try to teach the players. I hope they learn from me but, I always feel as a coach, you learn from the players. Today's given me so much, like the character.\"The injury-time chaos warped the narrative arc of the game.Wales had dominated for 90 minutes but looked to have fallen for a sucker punch when substitute Joe Allen's backpass was picked off by Bojan Miovski, whose goal had sparked jubilant celebrations among the home players and fans.Then came the bedlam as Wales disposed with Bellamy's modus operandi of patient build-up play and launched the ball to big Kieffer Moore, who nodded the ball down for fellow substitute David Brooks to force the ball over the line from close range.For all the unfiltered joy of that moment, however, Bellamy could not hide his frustration.\"To watch it happen was like 'Wow' but, at the same time, to come away with a point actually leaves me disappointed, I have to be honest, due to the performance,\" he said.\"In the manner, then we have to take it of course. If I look at the game, we were in control but football can find a cruel way sometimes.\"Maybe because I haven't suffered defeat in a short reign but I still felt there was something more.\"This was Bellamy's eighth game in charge of Wales and he still hasn't lost yet, with four wins and four draws leading to Nations League promotion and a solid start to World Cup qualifying.His frustration was understandable in Skopje. North Macedonia offered very little, while Wales could not convert their possessional domination into the three points it warranted.Once the elation of the celebrations subsides, Bellamy will ensure that Wales know this was an opportunity missed.Wales are second in Group J, behind early leaders North Macedonia on goal difference, but greater challenges await with top seeds Belgium yet to play.\"It could have been a very precious one [point]. I feel probably on the performance, I think the way I looked at the game today, I think we needed three. It could turn out to be an important point but time will tell,\" Bellamy added.\"We know in international football, chances can be limited at times but we had our big chances as well. On reflection of the game, maybe we needed to take three.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a62/live/836e2120-09c7-11f0-97d3-37df2b293ed1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eCraig Bellamy\u0026#39;s new nickname did not last long.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eOn Saturday, \u003ca href=\"https://www.bbc.com/sport/football/articles/c3rn00ylyr0o\"\u003ethe Wales head coach was described as \u0026#34;Mr Calm\u0026#34; by captain Ben Davies\u003c/a\u003e after his half-time speech following a frustrating first half against Kazakhstan.\u003c/p\u003e\u003cp\u003eFor those familiar with Bellamy the player – a combustible, volatile sort – Davies\u0026#39; moniker will have raised a few eyebrows.\u003c/p\u003e\u003cp\u003eBut Bellamy the coach is not the young footballer who his former Newcastle United manager Bobby Robson had said could start an argument in an empty room.\u003c/p\u003e\u003cp\u003eNow 45 and managing his country, Bellamy has mellowed. After periods of introspection and self-analysis, Bellamy the coach is a different person, one who prides himself on his composure and analytical eye.\u003c/p\u003e\u003cp\u003ePlayers have talked of his considered team talks and detailed tactical presentations; his interviews with the media have been measured, thoughtful and wide-ranging.\u003c/p\u003e\u003cp\u003eBut in North Macedonia on Tuesday night, when Wales bundled in an added-time equaliser after a conclusion of stupefying drama, that cool veneer disappeared in an instant.\u003c/p\u003e\u003cp\u003eAs David Brooks\u0026#39; shot crept over the line, an ecstatic Bellamy leapt in the air and roared with delight. His feet had barely touched the ground when he was asked to summarise his feelings.\u003c/p\u003e\u003cp\u003e\u0026#34;My main reaction? Probably shock, still,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;Calm? Not at all. Even now, I\u0026#39;m not. I thought it would have been difficult to accept losing today. But you have to accept certain things as much as you don\u0026#39;t want to.\u003c/p\u003e\u003cp\u003e\u0026#34;As a coach you try to teach the players. I hope they learn from me but, I always feel as a coach, you learn from the players. Today\u0026#39;s given me so much, like the character.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe injury-time chaos warped the narrative arc of the game.\u003c/p\u003e\u003cp\u003eWales had dominated for 90 minutes but looked to have fallen for a sucker punch when substitute Joe Allen\u0026#39;s backpass was picked off by Bojan Miovski, whose goal had sparked jubilant celebrations among the home players and fans.\u003c/p\u003e\u003cp\u003eThen came the bedlam as Wales disposed with Bellamy\u0026#39;s modus operandi of patient build-up play and launched the ball to big Kieffer Moore, who nodded the ball down for fellow substitute David Brooks to force the ball over the line from close range.\u003c/p\u003e\u003cp\u003eFor all the unfiltered joy of that moment, however, Bellamy could not hide his frustration.\u003c/p\u003e\u003cp\u003e\u0026#34;To watch it happen was like \u0026#39;Wow\u0026#39; but, at the same time, to come away with a point actually leaves me disappointed, I have to be honest, due to the performance,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;In the manner, then we have to take it of course. If I look at the game, we were in control but football can find a cruel way sometimes.\u003c/p\u003e\u003cp\u003e\u0026#34;Maybe because I haven\u0026#39;t suffered defeat in a short reign but I still felt there was something more.\u0026#34;\u003c/p\u003e\u003cp\u003eThis was Bellamy\u0026#39;s eighth game in charge of Wales and he still hasn\u0026#39;t lost yet, with four wins and four draws leading to Nations League promotion and a solid start to World Cup qualifying.\u003c/p\u003e\u003cp\u003eHis frustration was understandable in Skopje. North Macedonia offered very little, while Wales could not convert their possessional domination into the three points it warranted.\u003c/p\u003e\u003cp\u003eOnce the elation of the celebrations subsides, Bellamy will ensure that Wales know this was an opportunity missed.\u003c/p\u003e\u003cp\u003eWales are second in Group J, behind early leaders North Macedonia on goal difference, but greater challenges await with top seeds Belgium yet to play.\u003c/p\u003e\u003cp\u003e\u0026#34;It could have been a very precious one [point]. I feel probably on the performance, I think the way I looked at the game today, I think we needed three. It could turn out to be an important point but time will tell,\u0026#34; Bellamy added.\u003c/p\u003e\u003cp\u003e\u0026#34;We know in international football, chances can be limited at times but we had our big chances as well. On reflection of the game, maybe we needed to take three.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-26T00:11:35.489Z",
  "modifiedTime": null
}
