{
  "id": "18cedd87-2e42-40e5-8d78-c03aada4d3b2",
  "title": "Is it time for the 'Jokić Rules'? What NBA can do about triple-double boom",
  "link": "https://sports.yahoo.com/nikola-jokic-and-the-triple-double-boom-will-the-nba-have-to-temper-scoring-again-181629476.html",
  "description": "Scoring has been climbing as of late, but this year the stat inflation has revealed itself in a more subtle way.",
  "author": "Yahoo Sports",
  "published": "Wed, 29 Jan 2025 18:16:29 GMT",
  "source": "https://sports.yahoo.com/rss/",
  "categories": [
    "Sports"
  ],
  "byline": "Tom Haberstroh",
  "length": 10212,
  "excerpt": "Scoring has been climbing as of late, but this year the stat inflation has revealed itself in a more subtle way.",
  "siteName": "Yahoo Sports",
  "favicon": "",
  "text": "We’re just days away from the NBA trade deadline on Feb. 6, which has understandably diverted our collective focus on transaction rumor mills and spicy off-court matters (thank you, Jimmy Butler and De’Aaron Fox!). But there’s something happening on the court that deserves our full attention.Stat inflation is back.Last January, scoring performances from individual players went off the charts. Seventy was the new 40. Joel Embiid scored 70 points and Karl-Anthony Towns poured in 62 on the same evening. Four days later, Luka Dončić put up 73 points the same night that Devin Booker tallied 62. When teams scored 150 points, we didn’t bat an eye.Scoring had gotten so out of control that, in the middle of the season, the league office instructed its officials, unbeknownst to several teams I spoke with last year, to allow more physicality and make it tougher for offenses to put the ball in the basket. And at this rate, we may be heading that way again.Scoring has been climbing as of late (have you seen the New York Knicks’ point totals lately?), but this year the stat inflation has revealed itself in a more subtle way: the once-elusive triple-double is now commonplace.(Grant Thomas/Yahoo Sports Illustration)Nikola Jokić has been the face of the statistical surge. The three-time MVP has been on a tear recently, tallying six triple-doubles in his last eight games, including a preposterous 35-point, 22-rebound, 17-assist masterpiece against Sacramento. But it’s not just Jokić. All told, 27 players have registered a triple-double this season, some seemingly out of nowhere. On Saturday, Houston’s Amen Thompson accomplished the feat after not tallying more than five assists in any previous game this season.We’re on a historic pace here, folks. We’re not even at the All-Star break and there have been 87 triple-doubles this season, putting the league on track for 152 triple-doubles, which would break the record of 142 triple-doubles set in 2020-21. To put 87 triple-doubles in perspective, the NBA had not seen that many in a full season until 2016-17 — and we still have about half the season left. Actually, there have been more triple-doubles this month than the entire 82-game slate in 2009-10. Drilling down even further, Josh Hart has more triple-doubles this half-season than Dwyane Wade did in his entire career.So, what’s going on? Let's explore the rise of a trend that is showing no signs of slowing down. Especially with the big man in Denver.In his first season playing next to Russell Westbrook, Jokić is averaging 29.7 points, 12.9 rebounds and 10.1 assists per game, putting him on track to become the first big man to accomplish the triple-double feat.At this rate, Jokić will threaten Westbrook’s triple-double record for a season. In his MVP campaign in 2016-17, Westbrook broke Oscar Robertson’s hallowed triple-double record of 41 games with at least double-digits in points, rebounds and assists (Westbrook finished with 42).Jokić has already tallied 21 triple-doubles in his 41 games played this season, which amounts to 51 percent of his games. If he plays in every remaining game of the Nuggets’ schedule while maintaining his current pace, Jokić will have logged 39 triple-doubles this season, well within striking distance of Westbrook’s record.But there’s reason to believe that Jokić will top Westbrook’s high-water mark sooner than we think. Jokić has floored the accelerator on his triple-double pace lately, registering 10 such games in his last 16 outings, or about two out of every three games. At that heightened rate and assuming he doesn’t miss any of Denver’s remaining games, Jokić would finish with 43 triple-doubles, surpassing Westbrook’s record.What’s truly crazy about Jokić’s run is that he’s logging triple-doubles even before the fourth quarter begins. In fact, he’d still lead the league with 12 triple-doubles if we eliminated all fourth quarters and overtimes from his ledger. Through three quarters this season, Jokić is averaging 23.9 points, 10.8 rebounds and 8.5 assists, somehow mirroring his full-game averages during his first MVP season of 2020-21: 26.4 points, 10.8 rebounds, 8.3 assists.Though Westbrook is now at Jokić’s side, the numbers point to a different Jokić triple-double whisperer: Christian Braun.With Kentavious Caldwell-Pope bolting to Orlando over the summer, the Nuggets promoted from within, electing to give Braun the spot in the starting lineup vacated by the former Laker. An elite cutter, Braun has been the recipient of 87 of Jokić’s assists this season, second most on the team behind Michael Porter Jr., who was Jokić’s favorite dime target last season as well.In Braun, Jokić has an off-ball bucket-getter who doesn’t need the ball in his hands to create scoring opportunities. With Braun on the court, Jokić’s assist rate soars to 10.4 assists per 75 possessions, the highest for any Jokić counterpart and higher than his rate with KCP on the floor last season.But Jokić’s historic pace isn’t the only reason why triple-doubles are up league-wide. After all, one of the league’s most prolific triple-double machines, Luka Dončić, has missed most of the season. There’s something else going on here.It’s not just JokićWe haven’t seen any 70-point games yet this season, but we have witnessed some jaw-dropping stat-lines especially of the triple-double variety. At their core, triple-doubles are a natural byproduct of a larger scoring boom across the league.Look at the New York Knicks. With Karl-Anthony Towns in the fold, the Knicks have jumped out to an offensive rating of 119.7, second best in the league. Tom Thibodeau’s offense has topped 140 points three times this month, more than it's had in any one season since 1978, per Stathead.com tracking. Not coincidentally, with the Knicks’ offense on full tilt, Hart has tallied six triple-doubles already this season, the fifth most in the league. This time last year, Hart didn’t have a single triple-double in his entire career.Like with Hart and the Knicks, it stands to reason that triple-doubles rise as teams build prolific offenses. To achieve a triple-double, a team needs to step on the gas, hit shots and pump up assist totals. It’s no coincidence that triple-doubles nearly went extinct during the dead-ball era of the early 2000s when trodding teams struggled to score 90 points.Indeed, league-wide scoring is on the rise over the last month. After scoring dipped to about 106 points per team around Christmas, the scoreboard has been lit up across the NBA to levels at about 115 points per team. That’s about the same level of scoring that we saw last season before the league stepped in. Before the downturn around the All-Star break, the league was seeing teams score 115.5 points per 48 minutes, down from its peak at 118 points and a tick above where we were at this week (114.5).Last season, around the All-Star break, scoring seemed to crash across the league. The 60- and 70-point games all but disappeared. Scoreboards started returning to more normal levels. The data showed that referees were not calling as many fouls, allowing defenses to get more of an upper-hand on attacking offenses.At the Paris Games last week, NBA commissioner Adam Silver responded to a question about the issue of too many 3-pointers. On the topic, he made a slight detour to mention that the NBA can influence officiating on the fly to improve the viewing experience.“I remember there was an era in the NBA, largely in the '90s, where there was a sense that we had taken away some of the finesse aspects of the game; the game had become too physical. Maybe we went too far in the other direction, and we made some adjustments last year to allow defenses to be a little more physical. Fans responded positively to that, and I think teams did, as well.“Some teams may have had some concerns with exactly how that adjustment was made, but the end result, I think, has been very positive from a fan standpoint.”It’s not clear how the league would actively tame the prevalence of triple-doubles if they thought it was being cheapened. Unlike individual scoring totals bolstered by distasteful foul-hunting tactics, a referee’s whistle has less impact on a player’s ability to reach, say, double-digit assists. Free throws don’t count toward assist totals anyway.The triple-double trend feels like it will be a lot stickier for the simple fact that the rise of big playmakers operating in space has made high assist totals a lot more attainable. With clogged paints, illegal defense restrictions and hand-checking rules of previous generations, it made sense that smaller point guards like John Stockton, Isiah Thomas and Muggsy Bogues were depended on to run the methodical offenses directed by a coach’s playcalls.Now, with five-out offenses, better-skilled players and wide-open passing lanes, bigger athletes can functionally act the part of the point guard while continuing to rack up big rebounding totals. It’s not just Hart and Jokić. Kings center Domantas Sabonis has seven triple-doubles. LeBron James, who is the size of Karl Malone, has nine triple-doubles. Cade Cunningham, who may have been a small forward in previous decades, has seven triple-doubles after logging zero last season (largely thanks to an improved supporting cast that can, actually, you know, shoot).If the scoring surge continues, keep an eye on what the NBA’s competition committee does in the offseason. There are more possessions in today’s game compared to the early 2000s and 1990s, which helps give players more time to boost triple-double categories. The league could try to slow the game down or make it tougher for offenses to get to their spots. Eliminating defensive three seconds or tightening the freedom of movement rules could put triple-doubles in check. But don’t hold your breath on any major in-season adjustments.For now, the rise of the triple-double doesn’t seem to be something that needs to be reined in, but we’re not too far away from reaching last year’s boiling point. If off-the-charts scoring and preposterous statlines continue through the All-Star break, an adjustment might be on the table. In any case, good luck trying to limit Nikola Jokić.",
  "image": "https://s.yimg.com/ny/api/res/1.2/4NHd4.T3g1imQFJooEa0FQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Nzk7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-01/350755e0-de5e-11ef-b5fe-0e3f5501a797",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-wf-sticky-boundary=\"caas-body-section\" data-wf-sticky-offset=\"165px   10px\" data-wf-sticky-target=\".caas-share-buttons\"\u003e\u003cp\u003eWe’re just days away from the NBA trade deadline on Feb. 6, which has understandably diverted our collective focus on transaction rumor mills and spicy off-court matters (thank you, \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/warriors-among-several-teams-back-in-the-mix-on-jimmy-butler-as-nba-trade-deadline-nears-sources-170807824.html\" data-ylk=\"slk:Jimmy Butler;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eJimmy Butler\u003c/a\u003e and \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/sources-kings-open-to-dealing-all-star-deaaron-fox-ahead-of-trade-deadline-204308577.html\" data-ylk=\"slk:De’Aaron Fox;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eDe’Aaron Fox\u003c/a\u003e!). But there’s something happening on the court that deserves our full attention.\u003c/p\u003e\u003cp\u003eStat inflation is back.\u003c/p\u003e\u003cp\u003eLast January, scoring performances from individual players went off the charts. Seventy was the new 40. Joel Embiid scored 70 points and Karl-Anthony Towns poured in 62 on the same evening. Four days later, Luka Dončić put up 73 points the same night that Devin Booker tallied 62. When teams scored 150 points, we didn’t bat an eye.\u003c/p\u003e\u003cp\u003eScoring had gotten so out of control that, in the middle of the season, \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/nba-commissioner-silver-cites-kerrs-234930018.html\" data-ylk=\"slk:the league office instructed its officials;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003ethe league office instructed its officials\u003c/a\u003e, unbeknownst to several teams I spoke with last year, to allow more physicality and make it tougher for offenses to put the ball in the basket. And at this rate, we may be heading that way again.\u003c/p\u003e\u003cp\u003eScoring has been climbing as of late (have you \u003cem\u003eseen\u003c/em\u003e the New York Knicks’ \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://sports.yahoo.com/nba/sacramento-kings-new-york-knicks-2025012518/\" data-ylk=\"slk:point;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003epoint\u003c/a\u003e \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://sports.yahoo.com/nba/memphis-grizzlies-new-york-knicks-2025012718/\" data-ylk=\"slk:totals;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003etotals\u003c/a\u003e lately?), but this year the stat inflation has revealed itself in a more subtle way: the once-elusive triple-double is now commonplace.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"(Grant Thomas/Yahoo Sports Illustration)\" src=\"https://s.yimg.com/ny/api/res/1.2/93zsf3lxKUaNEXyhM3Qmng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MztjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2025-01/350755e0-de5e-11ef-b5fe-0e3f5501a797\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cfigcaption\u003e(Grant Thomas/Yahoo Sports Illustration)\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eNikola Jokić has been the face of the statistical surge. The three-time MVP has been on a tear recently, tallying six triple-doubles in his last eight games, including a preposterous \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://sports.yahoo.com/nikola-jokic-notches-5th-straight-triple-double-nails-34-court-shot-makes-history-as-nuggets-beat-kings-064111357.html\" data-ylk=\"slk:35-point, 22-rebound, 17-assist masterpiece;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e35-point, 22-rebound, 17-assist masterpiece\u003c/a\u003e against Sacramento. But it’s not just Jokić. All told, 27 players have registered a triple-double this season, some seemingly out of nowhere. On Saturday, Houston’s Amen Thompson accomplished the feat after not tallying more than five assists in any previous game this season.\u003c/p\u003e\u003cp\u003eWe’re on a historic pace here, folks. We’re not even at the All-Star break and there have been 87 triple-doubles this season, putting the league on track for 152 triple-doubles, which would break the record of 142 triple-doubles set in 2020-21. To put 87 triple-doubles in perspective, the NBA had not seen that many in a full season until 2016-17 — and we still have about half the season left. Actually, there have been more triple-doubles \u003cem\u003ethis month\u003c/em\u003e than the entire 82-game slate in 2009-10. Drilling down even further, Josh Hart has more triple-doubles this half-season than Dwyane Wade did in his entire \u003cem\u003ecareer\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eSo, what’s going on? Let\u0026#39;s explore the rise of a trend that is showing no signs of slowing down. Especially with the big man in Denver.\u003c/p\u003e\u003cp\u003eIn his first season playing next to Russell Westbrook, Jokić is averaging 29.7 points, 12.9 rebounds and 10.1 assists per game, putting him on track to become the first big man to accomplish the triple-double feat.\u003c/p\u003e\u003cp\u003eAt this rate, Jokić will threaten Westbrook’s triple-double record for a season. In his MVP campaign in 2016-17, Westbrook broke Oscar Robertson’s hallowed triple-double record of 41 games with at least double-digits in points, rebounds and assists (Westbrook finished with 42).\u003c/p\u003e\u003cp\u003eJokić has already tallied 21 triple-doubles in his 41 games played this season, which amounts to 51 percent of his games. If he plays in every remaining game of the Nuggets’ schedule while maintaining his current pace, Jokić will have logged 39 triple-doubles this season, well within striking distance of Westbrook’s record.\u003c/p\u003e\u003cp\u003eBut there’s reason to believe that Jokić will top Westbrook’s high-water mark sooner than we think. Jokić has floored the accelerator on his triple-double pace lately, registering 10 such games in his last 16 outings, or about two out of every three games. At that heightened rate and assuming he doesn’t miss any of Denver’s remaining games, Jokić would finish with 43 triple-doubles, surpassing Westbrook’s record.\u003c/p\u003e\u003cp\u003eWhat’s truly crazy about Jokić’s run is that he’s logging triple-doubles even before the fourth quarter begins. In fact, he’d still lead the league with 12 triple-doubles if we eliminated all fourth quarters and overtimes from his ledger. Through three quarters this season, Jokić is averaging 23.9 points, 10.8 rebounds and 8.5 assists, somehow mirroring his full-game averages during his first MVP season of 2020-21: 26.4 points, 10.8 rebounds, 8.3 assists.\u003c/p\u003e\u003cp\u003eThough Westbrook is now at Jokić’s side, the numbers point to a different Jokić triple-double whisperer: Christian Braun.\u003c/p\u003e\u003cp\u003eWith Kentavious Caldwell-Pope bolting to Orlando over the summer, the Nuggets promoted from within, electing to give Braun the spot in the starting lineup vacated by the former Laker. An elite cutter, Braun has been the recipient of 87 of Jokić’s assists this season, second most on the team behind Michael Porter Jr., who was Jokić’s favorite dime target last season as well.\u003c/p\u003e\u003cp\u003eIn Braun, Jokić has an off-ball bucket-getter who doesn’t need the ball in his hands to create scoring opportunities. With Braun on the court, Jokić’s assist rate soars to 10.4 assists per 75 possessions, the highest for any Jokić counterpart and higher than his rate with KCP on the floor last season.\u003c/p\u003e\u003cp\u003eBut Jokić’s historic pace isn’t the only reason why triple-doubles are up league-wide. After all, one of the league’s most prolific triple-double machines, Luka Dončić, has missed most of the season. There’s something else going on here.\u003c/p\u003e\u003ch2 id=\"its-not-just-jokic\"\u003e\u003cstrong\u003eIt’s not just Jokić\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eWe haven’t seen any 70-point games yet this season, but we have witnessed some jaw-dropping stat-lines especially of the triple-double variety. At their core, triple-doubles are a natural byproduct of a larger scoring boom across the league.\u003c/p\u003e\u003cp\u003eLook at the New York Knicks. With Karl-Anthony Towns in the fold, the Knicks have jumped out to an offensive rating of 119.7, second best in the league. Tom Thibodeau’s offense has topped 140 points three times this month, more than it\u0026#39;s had in any one \u003cem\u003eseason\u003c/em\u003e since 1978, per Stathead.com tracking. Not coincidentally, with the Knicks’ offense on full tilt, Hart has tallied six triple-doubles already this season, the fifth most in the league. This time last year, Hart didn’t have a single triple-double in his entire career.\u003c/p\u003e\u003cp\u003eLike with Hart and the Knicks, it stands to reason that triple-doubles rise as teams build prolific offenses. To achieve a triple-double, a team needs to step on the gas, hit shots and pump up assist totals. It’s no coincidence that triple-doubles nearly went extinct during the dead-ball era of the early 2000s when trodding teams struggled to score 90 points.\u003c/p\u003e\u003cp\u003eIndeed, league-wide scoring is on the rise over the last month. After scoring dipped to about 106 points per team around Christmas, the scoreboard has been lit up across the NBA to levels at about 115 points per team. That’s about the same level of scoring that we saw last season before the league stepped in. Before the downturn around the All-Star break, the league was seeing teams score 115.5 points per 48 minutes, down from its peak at 118 points and a tick above where we were at this week (114.5).\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://s.yimg.com/ny/api/res/1.2/dgZWTYbP4DuTKhX2D9ddSQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYwMjtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2025-01/39c666c0-de6d-11ef-bbb7-6c1c732c14cf\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cp\u003eLast season, around the All-Star break, \u003ca data-i13n=\"cpos:7;pos:1\" href=\"https://www.tomthefinder.com/p/nba-scoring-is-crashing-why\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:scoring seemed to crash;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003escoring seemed to crash\u003c/a\u003e across the league. The 60- and 70-point games all but disappeared. Scoreboards started returning to more normal levels. The data showed that referees were not calling as many fouls, allowing defenses to get more of an upper-hand on attacking offenses.\u003c/p\u003e\u003cp\u003eAt the Paris Games last week, NBA commissioner Adam Silver responded to a question about the issue of too many 3-pointers. On the topic, he made a slight detour to mention that the NBA can influence officiating on the fly to improve the viewing experience.\u003c/p\u003e\u003cp\u003e“I remember there was an era in the NBA, largely in the \u0026#39;90s, where there was a sense that we had taken away some of the finesse aspects of the game; the game had become too physical. Maybe we went too far in the other direction, and we made some adjustments last year to allow defenses to be a little more physical. Fans responded positively to that, and I think teams did, as well.\u003c/p\u003e\u003cp\u003e“Some teams may have had some concerns with exactly how that adjustment was made, but the end result, I think, has been very positive from a fan standpoint.”\u003c/p\u003e\u003cp\u003eIt’s not clear how the league would actively tame the prevalence of triple-doubles if they thought it was being cheapened. Unlike individual scoring totals bolstered by distasteful foul-hunting tactics, a referee’s whistle has less impact on a player’s ability to reach, say, double-digit assists. Free throws don’t count toward assist totals anyway.\u003c/p\u003e\u003cp\u003eThe triple-double trend feels like it will be a lot stickier for the simple fact that the rise of big playmakers operating in space has made high assist totals a lot more attainable. With clogged paints, illegal defense restrictions and hand-checking rules of previous generations, it made sense that smaller point guards like John Stockton, Isiah Thomas and Muggsy Bogues were depended on to run the methodical offenses directed by a coach’s playcalls.\u003c/p\u003e\u003cp\u003eNow, with five-out offenses, better-skilled players and wide-open passing lanes, bigger athletes can functionally act the part of the point guard while continuing to rack up big rebounding totals. It’s not just Hart and Jokić. Kings center Domantas Sabonis has seven triple-doubles. LeBron James, who is the size of Karl Malone, has nine triple-doubles. Cade Cunningham, who may have been a small forward in previous decades, has seven triple-doubles after logging zero last season (largely thanks to an improved supporting cast that can, actually, you know, shoot).\u003c/p\u003e\u003cp\u003eIf the scoring surge continues, keep an eye on what the NBA’s competition committee does in the offseason. There are more possessions in today’s game compared to the early 2000s and 1990s, which helps give players more time to boost triple-double categories. The league could try to slow the game down or make it tougher for offenses to get to their spots. Eliminating defensive three seconds or tightening the freedom of movement rules could put triple-doubles in check. But don’t hold your breath on any major in-season adjustments.\u003c/p\u003e\u003cp\u003eFor now, the rise of the triple-double doesn’t seem to be something that needs to be reined in, but we’re not too far away from reaching last year’s boiling point. If off-the-charts scoring and preposterous statlines continue through the All-Star break, an adjustment might be on the table. In any case, good luck trying to limit Nikola Jokić.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-01-31T14:39:29Z",
  "modifiedTime": null
}
