{
  "id": "1f27660f-9303-4be1-92d8-fba83889b1bf",
  "title": "'The door is ajar for Arsenal - this must be their catalyst'",
  "link": "https://www.bbc.com/sport/football/articles/c9qj7egx2y1o",
  "description": "Arsenal's vital win over Tottenham must be the catalyst for both their Premier League title challenge and a striker search, says BBC Sport chief football writer Phil McNulty.",
  "author": "",
  "published": "Wed, 15 Jan 2025 23:50:47 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Phil McNulty",
  "length": 4903,
  "excerpt": "Arsenal's vital win over Tottenham must be the catalyst for both their Premier League title challenge and a striker search, says BBC Sport chief football writer Phil McNulty.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Mikel Arteta pumped his fists to the stands while Gabriel threw his shirt into the crowd in celebration as a period of abject misery for Arsenal came to a victorious conclusion against Tottenham.The stakes are always high in the north London derby, but much was riding on this one for Arteta and his team, as a season that started with so much optimism and expectation threatened to flounder.Arsenal came into the meeting with Spurs on the back of damaging home defeats by Newcastle United in the Carabao Cup, and by Manchester United in the FA Cup.The scenes at the end of this win over Spurs were wild, noisy and laced with relief as much as celebration. Arsenal had known anything less than victory over their arch-rivals would put a serious dent in their title pursuit.It demonstrated just how much this 2-1 win meant. Arsenal are now four points behind Liverpool, having played a game more, but this must now be the catalyst for action on and off the pitch.Arsenal, as is their habit, made a very large meal of beating a mediocre Spurs, struck down by injuries but still well short of the standards expected.The warning signals flashed for Arsenal when, after almost total domination of possession, Spurs took the lead through Son Heung-min after 25 minutes.Arsenal managed to turn their fortunes around to claim three vital points and are now, for all their recent failings, right back in the title race.The door is ajar for Arsenal and Arteta, but they will struggle to open it any further unless they do what seems plainly obvious and sign a striker to give them a cutting edge.In a glass half-full assessment, midfielder Declan Rice told BBC Radio 5 Live: \"We're probably unlucky we didn't score 10 tonight.\"Not strictly true. No luck involved.Arsenal had 14 shots with only four on target, their equaliser coming from Dominic Solanke's own goal, resulting from a 40th minute corner that should not have been given - as the final touch before the ball went out of play had come off Leandro Trossard rather than Pedro Porro.Trossard then compounded the agony for Spurs with a winner four minutes later with a low drive that should have been saved by keeper Antonin Kinsky.This is not to suggest Arsenal did not deserve their victory. It was fully merited but only served to illustrate once more how the Gunners must sign a striker before the January transfer window closes.It is not too strong to say Arteta and Arsenal's chances of success depend on it, especially with the sight of Bukayo Saka on crutches on the sidelines after hamstring surgery and striker Gabriel Jesus out for the long term as he awaits an operation on a serious knee injury.Arsenal's fans groaned in frustration at too much over-elaboration around the penalty area. Rice and Martin Odegaard wasted chances, while Kai Havertz headed tamely at Kinsky, squandering the opportunity to emphasise the superiority they clearly had over Spurs.Arteta, as he must be, is aware of the problems, saying: \"We are actively looking and we will try to do something. Let's see what we can get.\"The Gunners needed to respond when they were in trouble after the Son setback, and the biggest response came from 18-year-old Myles Lewis-Skelly, who gave a magnificent display, fully meriting the standing ovation he received when he was taken off three minutes from time.Lewis-Skelly belied his youth to emerge as a key driving force and inspiration, completing 30 out of 32 passes, taking responsibility when Arsenal needed him most, with his manager describing his performance as \"amazing\".Arteta said: \"He was phenomenal. He is a real personality. He has so much trust in himself. He has that attitude about him. He had to play against Brennan Johnson and Dejan Kulusevski while managing the occasion. It is not easy but he was top.\"And Rice added: \"The young boy was unbelievable. To be playing the way he is at just 18 is just ridiculous. No fear. Four or five times in the second half, he used his body to get away from someone.\"If Arteta has been looking for signs that he has reserves of talent to ensure Arsenal can go deep into this season in search of trophies, then Lewis-Skelly, one of his emerging young stars, provided them.Arteta told BBC Sport: \"The attitude we played with, not feeling sorry for ourselves, was phenomenal. We played 120 minutes three days ago.\"We had some big chances and big situations. At the end, we had to suffer more than we wanted. When you have the opportunities, you have to take them. We are on a really consistent run in the Premier League.\"It is now about recovery, then Aston Villa on Saturday, going and going.\"And he added: \"We know how important this game was and is. It's a gift with which we can make out supporters happy.\"Now he needs to deliver an even bigger gift in the shape of a clinical finisher who can ensure this win is not a false dawn in Arsenal's Premier League title challenge.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/703e/live/b6516ad0-d39d-11ef-9fd6-0be88a764111.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eMikel Arteta pumped his fists to the stands while Gabriel threw his shirt into the crowd in celebration as a period of abject misery for Arsenal came to a victorious conclusion against Tottenham.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe stakes are always high in the north London derby, but much was riding on this one for Arteta and his team, as a season that started with so much optimism and expectation threatened to flounder.\u003c/p\u003e\u003cp\u003eArsenal came into the meeting with Spurs on the back of damaging home defeats by Newcastle United in the Carabao Cup, and by Manchester United in the FA Cup.\u003c/p\u003e\u003cp\u003eThe scenes at the end of this win over Spurs were wild, noisy and laced with relief as much as celebration. Arsenal had known anything less than victory over their arch-rivals would put a serious dent in their title pursuit.\u003c/p\u003e\u003cp\u003eIt demonstrated just how much this 2-1 win meant. Arsenal are now four points behind Liverpool, having played a game more, but this must now be the catalyst for action on and off the pitch.\u003c/p\u003e\u003cp\u003eArsenal, as is their habit, made a very large meal of beating a mediocre Spurs, struck down by injuries but still well short of the standards expected.\u003c/p\u003e\u003cp\u003eThe warning signals flashed for Arsenal when, after almost total domination of possession, Spurs took the lead through Son Heung-min after 25 minutes.\u003c/p\u003e\u003cp\u003eArsenal managed to turn their fortunes around to claim three vital points and are now, for all their recent failings, right back in the title race.\u003c/p\u003e\u003cp\u003eThe door is ajar for Arsenal and Arteta, but they will struggle to open it any further unless they do what seems plainly obvious and sign a striker to give them a cutting edge.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn a glass half-full assessment, midfielder Declan Rice told BBC Radio 5 Live: \u0026#34;We\u0026#39;re probably unlucky we didn\u0026#39;t score 10 tonight.\u0026#34;\u003c/p\u003e\u003cp\u003eNot strictly true. No luck involved.\u003c/p\u003e\u003cp\u003eArsenal had 14 shots with only four on target, their equaliser coming from Dominic Solanke\u0026#39;s own goal, resulting from a 40th minute corner that should not have been given - as the final touch before the ball went out of play had come off Leandro Trossard rather than Pedro Porro.\u003c/p\u003e\u003cp\u003eTrossard then compounded the agony for Spurs with a winner four minutes later with a low drive that should have been saved by keeper Antonin Kinsky.\u003c/p\u003e\u003cp\u003eThis is not to suggest Arsenal did not deserve their victory. It was fully merited but only served to illustrate once more how the Gunners must sign a striker before the January transfer window closes.\u003c/p\u003e\u003cp\u003eIt is not too strong to say Arteta and Arsenal\u0026#39;s chances of success depend on it, especially with the sight of Bukayo Saka on crutches on the sidelines after hamstring surgery and striker Gabriel Jesus out for the long term as he awaits an operation on a serious knee injury.\u003c/p\u003e\u003cp\u003eArsenal\u0026#39;s fans groaned in frustration at too much over-elaboration around the penalty area. \u003c/p\u003e\u003cp\u003eRice and Martin Odegaard wasted chances, while Kai Havertz headed tamely at Kinsky, squandering the opportunity to emphasise the superiority they clearly had over Spurs.\u003c/p\u003e\u003cp\u003eArteta, as he must be, is aware of the problems, saying: \u0026#34;We are actively looking and we will try to do something. Let\u0026#39;s see what we can get.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe Gunners needed to respond when they were in trouble after the Son setback, and the biggest response came from 18-year-old Myles Lewis-Skelly, who gave a magnificent display, fully meriting the standing ovation he received when he was taken off three minutes from time.\u003c/p\u003e\u003cp\u003eLewis-Skelly belied his youth to emerge as a key driving force and inspiration, completing 30 out of 32 passes, taking responsibility when Arsenal needed him most, with his manager describing his performance as \u0026#34;amazing\u0026#34;.\u003c/p\u003e\u003cp\u003eArteta said: \u0026#34;He was phenomenal. He is a real personality. He has so much trust in himself. He has that attitude about him. He had to play against Brennan Johnson and Dejan Kulusevski while managing the occasion. It is not easy but he was top.\u0026#34;\u003c/p\u003e\u003cp\u003eAnd Rice added: \u0026#34;The young boy was unbelievable. To be playing the way he is at just 18 is just ridiculous. No fear. Four or five times in the second half, he used his body to get away from someone.\u0026#34;\u003c/p\u003e\u003cp\u003eIf Arteta has been looking for signs that he has reserves of talent to ensure Arsenal can go deep into this season in search of trophies, then Lewis-Skelly, one of his emerging young stars, provided them.\u003c/p\u003e\u003cp\u003eArteta told BBC Sport: \u0026#34;The attitude we played with, not feeling sorry for ourselves, was phenomenal. We played 120 minutes three days ago.\u003c/p\u003e\u003cp\u003e\u0026#34;We had some big chances and big situations. At the end, we had to suffer more than we wanted. When you have the opportunities, you have to take them. We are on a really consistent run in the Premier League.\u003c/p\u003e\u003cp\u003e\u0026#34;It is now about recovery, then Aston Villa on Saturday, going and going.\u0026#34;\u003c/p\u003e\u003cp\u003eAnd he added: \u0026#34;We know how important this game was and is. It\u0026#39;s a gift with which we can make out supporters happy.\u0026#34;\u003c/p\u003e\u003cp\u003eNow he needs to deliver an even bigger gift in the shape of a clinical finisher who can ensure this win is not a false dawn in Arsenal\u0026#39;s Premier League title challenge.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-15T23:50:47.907Z",
  "modifiedTime": null
}
