{
  "id": "30212cc3-54e7-4a70-a535-ec6e88818eb7",
  "title": "'Best game of season' - Newcastle give Liverpool rivals hope",
  "link": "https://www.bbc.com/sport/football/articles/c390l92r03po",
  "description": "Liverpool's 3-3 draw at Newcastle is described as \"one of the best games of the season\" - and gives their rivals hope in the battle for the Premier League title.",
  "author": "",
  "published": "Wed, 04 Dec 2024 23:44:44 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 5963,
  "excerpt": "Liverpool's 3-3 draw at Newcastle is described as \"one of the best games of the season\" - and gives their rivals hope in the battle for the Premier League title.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Image source, Getty ImagesImage caption, Liverpool conceded a 90th-minute equaliser as they drew 3-3 at NewcastleIt was described as one of the best games of the season as Premier League leaders Liverpool drew 3-3 with Newcastle in an enthralling match at St James' Park. The Reds twice trailed and then led thanks to a double from the ever-reliable Mohamed Salah, and looked set to extend their winning run in the league to five games.But Fabian Schar's 90th-minute equaliser earned Newcastle a deserved point at the end of an exhausting encounter.\"One of the best [games] I've seen this season,\" said former Chelsea winger Pat Nevin on BBC Radio 5 Live at full-time.\"We have seen it ebb and flow. Both sides will be happy with the point in the end.\"But they will not be the only sides happy with the draw, with Chelsea, Arsenal and Manchester City - second, third and fourth respectively - all picking up wins on Wednesday. Fifth-placed Brighton, meanwhile, play Fulham on Thursday.It means Liverpool's lead is cut from nine points to seven at the start of a busy December that could see things change dramatically at the top of the table.'Lots of twists and turns in title race'Image source, Getty ImagesHistorically, Liverpool were already in a title-winning position before a ball was kicked on Wednesday.After beating Manchester City on Sunday they were nine points clear of second place after 13 league games. Only two teams in Premier League history have had a lead of at least nine points after the same number of matches - Manchester United in 1993-94 and Chelsea in 2005-06 - and both went on to win the title.Despite that, many are still urging caution in the battle at the top.Reds boss Arne Slot said before the Newcastle game that 19 matches would be a better barometer of how the title battle is shaping up, an opinion that will have only been galvanised after the 3-3 draw with Newcastle.Manchester City's loss to Liverpool left them 11 points adrift of the Reds but that has been cut to nine, and history suggests they are more than capable of overturning such a deficit.In 2018-19, they trailed Liverpool by 10 points after a poor run of form in December but then won 18 of their 19 matches from the 30th of that month to go on and clinch the title.\"I think we know Man City are not out of the title race - they are going to have a say,\" former Manchester City player and manager Stuart Pearce said on Amazon Prime.\"There are going to be a lot of twists and turns in the title race. That's what makes the Premier League so good.\"Former Arsenal forward Theo Walcott added: \"This is where you get a feel for where you will end up at the end of the season. It is a period where you can make up a lot of points.\"Former Manchester United striker Dimitar Berbatov, a Premier League champion with them in 2008–09 and 2010–11, said his former manager Sir Alex Ferguson would never entertain title talk at this stage of the season.\"He would say if we stay first after the Christmas period we win the league,\" he told Amazon Prime.\"He was always very strict around this time of the year - 'stay at home and don't go out'. It was worth it - it is about winning the title at the end of the day.\"Who has toughest December run?Liverpool's next match is the unpredictability of a Merseyside derby, while they also face Tottenham on 22 December - with both those games away.Chelsea also have a trip to London rivals Spurs, but after that the highest-placed team they face is Brentford, currently ninth.All Arsenal's opponents are currently in the bottom half of the table, whereas Manchester City have a derby against Manchester United on 15 December and must also go to Aston Villa.Brighton, who play on Thursday night and could go fourth with a win, only have two home games in the rest of December - against Crystal Palace and Brentford.Top five's upcoming fixtures:Liverpool: 7 Dec Everton (a); 14 Dec Fulham (h); 22 Dec Tottenham (a); 26 Dec Leicester (h); 29 Dec West Ham (a)Chelsea: 8 Dec Tottenham (a); 15 Dec Brentford (a); 22 Dec Everton (a) 26 Dec Fulham (h) 30 Dec Ipswich (a)Arsenal: 8 Dec Fulham (a); 14 Dec Everton (h); 21 Dec Crystal Palace (a); 27 Dec Ipswich (h)Man City: 7 Dec Crystal Palace (a); 15 Dec Manchester United (h); 21 Dec Aston Villa (a); 26 Dec Everton (h); 29 Dec Leicester (a)Brighton: 5 Dec Fulham (a) 8 Dec Leicester (a); 15 Dec Crystal Palace (h); 21 Dec West Ham (a); 27 Dec Brentford (h); 30 Dec Aston Villa (a)What are the teams saying?Media caption, Mixed emotions for Slot after Liverpool draw at NewcastleLiverpool boss Arne Slot after the Newcastle draw: \"A great game to watch. This is what we do lately but with the exception of us not winning this game. There were moments in the game where I was happy about it but then at 3-2 up [to draw 3-3] it is a disappointment.\"Arsenal manager Mikel Arteta, on Liverpool dropping points on Wednesday: \"I didn't know as I was so happy celebrating in the dressing room [after Arsenal beat Manchester United].\"We got that news, but it is difficult to win this league. It is still very early.\"Gunners midfielder Declan Rice: \"When you have a blip in the league you get written off. People get carried away. You just need to be around it in February time. Liverpool have dropped points - they're seven away so we will see what happens.\"Manchester City boss Pep Guardiola on if Wednesday's win against Nottingham Forest will prove a turning point: \"I don't know. We have to prove it again. It's just one game but it was important to break this run.\"Chelsea manager Enzo Maresca on his side's form: \"We are focused on that [performing] since the start. I think that the results, for sure, helps a lot - calms down a little bit of noise around the club. \"It's a good feeling, especially to see the fans happy because after the last two years, you know better than me, many things happened. The feeling from them now is good and it is a good feeling also for us.\"More on this story",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Mohamed Salah reacts after Liverpool\u0026#39;s draw with Newcastle \" loading=\"eager\" src=\"https://ichef.bbci.co.uk/ace/standard/995/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/6012/live/48d5ff30-b295-11ef-a961-afa5e77061f6.jpg 976w\" width=\"995\" height=\"559\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eLiverpool conceded a 90th-minute equaliser as they drew 3-3 at Newcastle\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eIt was described as one of the best games of the season as Premier League leaders Liverpool drew 3-3 with Newcastle in an enthralling match at St James\u0026#39; Park. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Reds twice trailed and then led thanks to a double from the ever-reliable Mohamed Salah, and looked set to extend their winning run in the league to five games.\u003c/p\u003e\u003cp\u003eBut Fabian Schar\u0026#39;s 90th-minute equaliser earned Newcastle a deserved point at the end of an exhausting encounter.\u003c/p\u003e\u003cp\u003e\u0026#34;One of the best [games] I\u0026#39;ve seen this season,\u0026#34; said former Chelsea winger Pat Nevin on BBC Radio 5 Live at full-time.\u003c/p\u003e\u003cp\u003e\u0026#34;We have seen it ebb and flow. Both sides will be happy with the point in the end.\u0026#34;\u003c/p\u003e\u003cp\u003eBut they will not be the only sides happy with the draw, with Chelsea, Arsenal and Manchester City - second, third and fourth respectively - all picking up wins on Wednesday. Fifth-placed Brighton, meanwhile, play Fulham on Thursday.\u003c/p\u003e\u003cp\u003eIt means Liverpool\u0026#39;s lead is cut from nine points to seven at the start of a busy December that could see things change dramatically at the top of the table.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Lots-of-twists-and-turns-in-title-race\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Lots of twists and turns in title race\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHistorically, Liverpool were already in a title-winning position before a ball was kicked on Wednesday.\u003c/p\u003e\u003cp\u003eAfter beating Manchester City on Sunday they were nine points clear of second place after 13 league games. \u003c/p\u003e\u003cp\u003eOnly two teams in Premier League history have had a lead of at least nine points after the same number of matches - Manchester United in 1993-94 and Chelsea in 2005-06 - and both went on to win the title.\u003c/p\u003e\u003cp\u003eDespite that, many are still urging caution in the battle at the top.\u003c/p\u003e\u003cp\u003eReds boss Arne Slot said before the Newcastle game that 19 matches would be a better barometer of how the title battle is shaping up, an opinion that will have only been galvanised after the 3-3 draw with Newcastle.\u003c/p\u003e\u003cp\u003eManchester City\u0026#39;s loss to Liverpool left them 11 points adrift of the Reds but that has been cut to nine, and history suggests they are more than capable of overturning such a deficit.\u003c/p\u003e\u003cp\u003eIn 2018-19, they trailed Liverpool by 10 points after a poor run of form in December but then won 18 of their 19 matches from the 30th of that month to go on and clinch the title.\u003c/p\u003e\u003cp\u003e\u0026#34;I think we know Man City are not out of the title race - they are going to have a say,\u0026#34; former Manchester City player and manager Stuart Pearce said on Amazon Prime.\u003c/p\u003e\u003cp\u003e\u0026#34;There are going to be a lot of twists and turns in the title race. That\u0026#39;s what makes the Premier League so good.\u0026#34;\u003c/p\u003e\u003cp\u003eFormer Arsenal forward Theo Walcott added: \u0026#34;This is where you get a feel for where you will end up at the end of the season. It is a period where you can make up a lot of points.\u0026#34;\u003c/p\u003e\u003cp\u003eFormer Manchester United striker Dimitar Berbatov, a Premier League champion with them in 2008–09 and 2010–11, said his former manager Sir Alex Ferguson would never entertain title talk at this stage of the season.\u003c/p\u003e\u003cp\u003e\u0026#34;He would say if we stay first after the Christmas period we win the league,\u0026#34; he told Amazon Prime.\u003c/p\u003e\u003cp\u003e\u0026#34;He was always very strict around this time of the year - \u0026#39;stay at home and don\u0026#39;t go out\u0026#39;. It was worth it - it is about winning the title at the end of the day.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Who-has-toughest-December-run\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWho has toughest December run?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLiverpool\u0026#39;s next match is the unpredictability of a Merseyside derby, while they also face Tottenham on 22 December - with both those games away.\u003c/p\u003e\u003cp\u003eChelsea also have a trip to London rivals Spurs, but after that the highest-placed team they face is Brentford, currently ninth.\u003c/p\u003e\u003cp\u003eAll Arsenal\u0026#39;s opponents are currently in the bottom half of the table, whereas Manchester City have a derby against Manchester United on 15 December and must also go to Aston Villa.\u003c/p\u003e\u003cp\u003eBrighton, who play on Thursday night and could go fourth with a win, only have two home games in the rest of December - against Crystal Palace and Brentford.\u003c/p\u003e\u003cp\u003e\u003cb\u003eTop five\u0026#39;s upcoming fixtures:\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eLiverpool: 7 Dec \u003c/b\u003eEverton (a); \u003cb\u003e14 Dec\u003c/b\u003e Fulham (h); \u003cb\u003e22 Dec \u003c/b\u003eTottenham (a); \u003cb\u003e26 Dec \u003c/b\u003eLeicester (h); \u003cb\u003e29 Dec \u003c/b\u003eWest Ham (a)\u003c/p\u003e\u003cp\u003e\u003cb\u003eChelsea: 8 Dec\u003c/b\u003e Tottenham (a); \u003cb\u003e15 Dec\u003c/b\u003e Brentford (a); \u003cb\u003e22 Dec\u003c/b\u003e Everton (a)\u003cb\u003e 26 Dec\u003c/b\u003e Fulham (h) \u003cb\u003e30 Dec\u003c/b\u003e Ipswich (a)\u003c/p\u003e\u003cp\u003e\u003cb\u003eArsenal: 8 Dec\u003c/b\u003e Fulham (a); \u003cb\u003e14 Dec\u003c/b\u003e Everton (h);\u003cb\u003e 21 Dec\u003c/b\u003e Crystal Palace (a); \u003cb\u003e27 Dec\u003c/b\u003e Ipswich (h)\u003c/p\u003e\u003cp\u003e\u003cb\u003eMan City: 7 Dec \u003c/b\u003eCrystal Palace (a); \u003cb\u003e15 Dec \u003c/b\u003eManchester United (h); \u003cb\u003e21 Dec \u003c/b\u003eAston Villa (a); \u003cb\u003e26 Dec\u003c/b\u003e Everton (h); \u003cb\u003e29 Dec\u003c/b\u003e Leicester (a)\u003c/p\u003e\u003cp\u003e\u003cb\u003eBrighton:\u003c/b\u003e \u003cb\u003e5 Dec \u003c/b\u003eFulham (a) \u003cb\u003e8 Dec \u003c/b\u003eLeicester (a); \u003cb\u003e15 Dec \u003c/b\u003eCrystal Palace (h); \u003cb\u003e21 Dec \u003c/b\u003eWest Ham (a); \u003cb\u003e27 Dec\u003c/b\u003e Brentford (h); \u003cb\u003e30 Dec \u003c/b\u003eAston Villa (a)\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-are-the-teams-saying\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat are the teams saying?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eMixed emotions for Slot after Liverpool draw at Newcastle\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eLiverpool boss Arne Slot after the Newcastle draw:\u003c/b\u003e \u0026#34;A great game to watch. This is what we do lately but with the exception of us not winning this game. There were moments in the game where I was happy about it but then at 3-2 up [to draw 3-3] it is a disappointment.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eArsenal manager Mikel Arteta, on Liverpool dropping points on Wednesday:\u003c/b\u003e \u0026#34;I didn\u0026#39;t know as I was so happy celebrating in the dressing room [after Arsenal beat Manchester United].\u003c/p\u003e\u003cp\u003e\u0026#34;We got that news, but it is difficult to win this league. It is still very early.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eGunners midfielder Declan Rice:\u003c/b\u003e \u0026#34;When you have a blip in the league you get written off. People get carried away. You just need to be around it in February time. Liverpool have dropped points - they\u0026#39;re seven away so we will see what happens.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eManchester City boss Pep Guardiola on if Wednesday\u0026#39;s win against Nottingham Forest will prove a turning point: \u003c/b\u003e\u0026#34;I don\u0026#39;t know. We have to prove it again. It\u0026#39;s just one game but it was important to break this run.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eChelsea manager Enzo Maresca on his side\u0026#39;s form:\u003c/b\u003e \u0026#34;We are focused on that [performing] since the start. I think that the results, for sure, helps a lot - calms down a little bit of noise around the club. \u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a good feeling, especially to see the fans happy because after the last two years, you know better than me, many things happened. The feeling from them now is good and it is a good feeling also for us.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-04T23:44:44.767Z",
  "modifiedTime": null
}
