{
  "id": "3d6ae0f1-bf32-456a-95ca-5edecec7a4df",
  "title": "Ireland's 'master of control' buoyed by Murrayfield win",
  "link": "https://www.bbc.com/sport/rugby-union/articles/cpvm3gx7p8mo",
  "description": "Ireland's Sam Prendergast is staying level-headed while the hype around him continues to grow.",
  "author": "",
  "published": "Sun, 09 Feb 2025 19:48:16 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Matt Gault",
  "length": 3393,
  "excerpt": "Ireland's Sam Prendergast is staying level-headed while the hype around him continues to grow.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Sam Prendergast tightened his grip on Ireland's number 10 jersey with an impressive display in Sunday's dominant win over Scotland at Murrayfield, but he is staying level-headed while the hype around him continues to grow. Prendergast, 21, had not played an away fixture for Ireland before Sunday and was winning just his fifth cap in a team filled with experience. But he looked as comfortable as any player in green, scoring 12 points while orchestrating the attack through an impressive range of passing, kicking and decision-making. Speaking on the BBC's television coverage, legendary Irish out-half Ronan O'Gara showered praise on the Leinster youngster, labelling him a \"master of control\". \"[Prendergast has] been one of the shining lights, one of the three best performers on the pitch,\" O'Gara said after Ireland's powerful first-half display put them 17-5 ahead.\"He's very composed, a good kick strategy, good decisions on when to run, when to kick, when to play the ball in front of his forwards.\"He's been a master of control.\"While a smiling Prendergast insists he did \"not particularly\" feel like O'Gara's description, he was happy to receive a \"nice compliment from a very good player\" while consciously focusing on the team's fast start.\"I thought it was really good and it just kind of let us build a bit of momentum,\" said Prendergast, who was named player of the match.Prendergast has started Ireland's past four Tests, helping steer them to back-to-back Six Nations victories over England and Scotland which leaves Simon Easterby's team as the only side still able to win the Grand Slam. Having been preferred to Jack Crowley, Prendergast missed a couple of kicks against England but was strong off the tee and in open play at Murrayfield.\"I wanted to do better than I did last week,\" he added.\"I was a bit more used to the shot clock again but it was good.\"In a cramped corridor in the bowels of Murrayfield, softly spoken Prendergast constantly batted away attention on his own efforts, instead shining the light on the \"world-class\" players around him.\"You look at the backs outside me and in terms of the managing the game, the help I get, there's a lot of world-class players in that backline. \"It's a lot easier and then what the forwards are giving us both from the starters and bench, it's unbelievable to be a part of.\"While Ireland raced into a 17-0 lead, Scotland narrowed the gap to six points through a Duhan van der Merwe try and two Blair Kinghorn penalties. But Prendergast insists there was no panic in the Irish ranks, even during Scotland's resurgence either side of half-time.\"We felt pretty good in the first half and they got a few, not lucky breaks, but a few things going their way. \"I think we did well not to concede the tries off the back of it.\"With a trip to Wales next for Ireland on 22 February, Prendergast could win a Triple Crown in just his third Six Nations appearance. But he is not entertaining any thoughts of silverware or milestones just yet. \"I was just focused on this game. The only experience I have of the Six Nations before this is in the under-20s, but in terms of building game to game, it's quite similar. \"You just need to keep taking each games as it comes. I'm not too focused on milestones, I'm just focused on getting better each week. \"Now we have a week with no game so it's an opportunity to learn and get better.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3573/live/e69bf080-e71a-11ef-9251-b3b9898ca290.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eSam Prendergast tightened his grip on Ireland\u0026#39;s number 10 jersey with an impressive display in Sunday\u0026#39;s dominant win over Scotland at Murrayfield, but he is staying level-headed while the hype around him continues to grow. \u003c/b\u003e\u003c/p\u003e\u003cp\u003ePrendergast, 21, had not played an away fixture for Ireland before Sunday and was winning just his fifth cap in a team filled with experience. \u003c/p\u003e\u003cp\u003eBut he looked as comfortable as any player in green, scoring 12 points while orchestrating the attack through an impressive range of passing, kicking and decision-making. \u003c/p\u003e\u003cp\u003eSpeaking on the BBC\u0026#39;s television coverage, legendary Irish out-half Ronan O\u0026#39;Gara showered praise on the Leinster youngster, labelling him a \u0026#34;master of control\u0026#34;. \u003c/p\u003e\u003cp\u003e\u0026#34;[Prendergast has] been one of the shining lights, one of the three best performers on the pitch,\u0026#34; O\u0026#39;Gara said after Ireland\u0026#39;s powerful first-half display put them 17-5 ahead.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s very composed, a good kick strategy, good decisions on when to run, when to kick, when to play the ball in front of his forwards.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s been a master of control.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile a smiling Prendergast insists he did \u0026#34;not particularly\u0026#34; feel like O\u0026#39;Gara\u0026#39;s description, he was happy to receive a \u0026#34;nice compliment from a very good player\u0026#34; while consciously focusing on the team\u0026#39;s fast start.\u003c/p\u003e\u003cp\u003e\u0026#34;I thought it was really good and it just kind of let us build a bit of momentum,\u0026#34; said Prendergast, who was named player of the match.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePrendergast has started Ireland\u0026#39;s past four Tests, helping steer them to back-to-back Six Nations victories over England and Scotland which leaves Simon Easterby\u0026#39;s team as the only side still able to win the Grand Slam. \u003c/p\u003e\u003cp\u003eHaving been preferred to Jack Crowley, Prendergast missed a couple of kicks against England but was strong off the tee and in open play at Murrayfield.\u003c/p\u003e\u003cp\u003e\u0026#34;I wanted to do better than I did last week,\u0026#34; he added.\u003c/p\u003e\u003cp\u003e\u0026#34;I was a bit more used to the shot clock again but it was good.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a cramped corridor in the bowels of Murrayfield, softly spoken Prendergast constantly batted away attention on his own efforts, instead shining the light on the \u0026#34;world-class\u0026#34; players around him.\u003c/p\u003e\u003cp\u003e\u0026#34;You look at the backs outside me and in terms of the managing the game, the help I get, there\u0026#39;s a lot of world-class players in that backline. \u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a lot easier and then what the forwards are giving us both from the starters and bench, it\u0026#39;s unbelievable to be a part of.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile Ireland raced into a 17-0 lead, Scotland narrowed the gap to six points through a Duhan van der Merwe try and two Blair Kinghorn penalties. \u003c/p\u003e\u003cp\u003eBut Prendergast insists there was no panic in the Irish ranks, even during Scotland\u0026#39;s resurgence either side of half-time.\u003c/p\u003e\u003cp\u003e\u0026#34;We felt pretty good in the first half and they got a few, not lucky breaks, but a few things going their way. \u003c/p\u003e\u003cp\u003e\u0026#34;I think we did well not to concede the tries off the back of it.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWith a trip to Wales next for Ireland on 22 February, Prendergast could win a Triple Crown in just his third Six Nations appearance. \u003c/p\u003e\u003cp\u003eBut he is not entertaining any thoughts of silverware or milestones just yet. \u003c/p\u003e\u003cp\u003e\u0026#34;I was just focused on this game. The only experience I have of the Six Nations before this is in the under-20s, but in terms of building game to game, it\u0026#39;s quite similar. \u003c/p\u003e\u003cp\u003e\u0026#34;You just need to keep taking each games as it comes. I\u0026#39;m not too focused on milestones, I\u0026#39;m just focused on getting better each week. \u003c/p\u003e\u003cp\u003e\u0026#34;Now we have a week with no game so it\u0026#39;s an opportunity to learn and get better.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-09T19:48:16.184Z",
  "modifiedTime": null
}
