{
  "id": "3e742ab2-1dde-49c1-a798-dd2080b59ca5",
  "title": "An inner drive mistaken for laziness: The makings of Van Dijk",
  "link": "https://www.bbc.com/sport/football/articles/cd9le3v7n8eo",
  "description": "As Virgil van Dijk prepares to lift his second Premier League title with Liverpool, we look at how the 33-year-old centre-back learned from early setbacks to become one of the best in the world.",
  "author": "",
  "published": "Wed, 23 Apr 2025 22:00:37 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Arthur Renard",
  "length": 7922,
  "excerpt": "As Virgil van Dijk prepares to lift his second Premier League title with Liverpool, we look at how the 33-year-old centre-back learned from early setbacks to become one of the best in the world.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Image source, Getty ImagesSuddenly he was back where it all began. Last month Virgil van Dijk made a secret visit to his old Dutch club Willem II to bring back a youth football tournament.He said: \"It's my way of giving back and helping nurture the next generation of world-class talent. This tournament gives rising stars the platform they need to take the next step towards their dreams.\"Fittingly, the next edition of the 'Virgil Legacy Trophy' in September will feature all of the clubs where Van Dijk played in his career, plus the likes of Arsenal, Manchester City and PSG.And it was in Tilburg, a Dutch city in the southern province of North Brabant, where the current Liverpool captain gained invaluable insights about football and life.As he prepares to lift his second Premier League title with Liverpool, we look at how the 33-year-old centre-back learned from early setbacks to become one of the best in the world.'Some youth managers even saw him as lazy'Van Dijk joined Willem II's then-acclaimed academy in 2001 as a 10-year-old.It was a club that had defied the odds just a few years earlier by finishing second in the Eredivisie in 1998-99 and reaching the Champions League.Shortly after his arrival, Jan van Loon was installed as academy director.\"There was actually no striker who stood a chance against him,\" Van Loon said. \"He was physically strong and he had a natural talent to take balls off opponents at exactly the right moment. \"I remember in games we would sometimes say to him: 'Watch out Virgil, there is an opponent behind you.' He would be very relaxed, like: 'Yeah, OK, no worries.'\"I recall a game against Ajax, where he would mark their best player. We were saying 'make sure he doesn't touch any ball,' and that's exactly what Virgil would do.\"Yet there was still room for improvement, Van Loon, added: \"So now and then he could come across as laconic, a bit too easy going. Maybe at times some youth managers even thought of him as lazy.\"That image was partly created by his timekeeping, as Van Dijk would sometimes arrive late for training sessions. It even got to the point where some coaches wondered whether the young defender should remain at the club. But when Van Loon took a closer interest in the young footballer, he also gained insight into Van Dijk's personal life. He said: \"His parents were divorced and at times he had to look after his younger brother and sister. Sometimes he had to take them from school and make them lunch, before jumping on the bus to Willem II. \"That meant he could be late now and then, and if I asked him about the reasons he would always explain in detail what had happened. \"One time I remember his little brother had asked him for peanut butter on his bread, something he had to go and get in the supermarket - and subsequently he just missed the bus. That period has shaped him both as a human and footballer.\"Image source, Getty ImagesImage caption, Virgil van Dijk made his debut for Groningen in May 2011'It takes a village to raise a child'Van Dijk's impressive performances finally saw him offered a chance to play for the second team, when he was playing for Willem's under-19s.But on the day of the match he had to submit a report for school, which he hadn't completed. School was paramount for the club, so he risked missing his big break,\"I said to Virgil: 'Let's look for a solution together',\" Van Loon added. \"He was really popular with his classmates, not because he was a footballer but just as a human being. \"He asked a few of his peers and everything was done in time. Not that they wrote the assignment, but they did help him. The night before the game I got a message from the teacher saying everything was fine. \"That teacher also played his part. That's why I always say it takes a village to raise a child. You need several people around you to push you in the right direction.\"Van Loon, who also had a spell as head of coaching at Arsenal's academy, noticed how Van Dijk nurtured his people skills by recognising who could help him.He said: \"He developed a skill to assemble people around him who would be best for his career. He would ask for extra attention from the best staff members, because he instinctively felt they could make him better. \"That was very special, I also saw that with players like Bukayo Saka and Frenkie de Jong, who was also in the academy of Willem II.\"At the club there was an exercise physiologist, who knew how to relate strength training to the role of centre-back. When exercises were finished, Virgil said: 'No, we'll continue for a while.' There you could see his inner drive, even though some other coaches had an impression that he was lazy.\"'My body was broken and I couldn't do anything'As a teenager, Van Dijk combined his time playing at the Willem II academy with a part-time job as a dishwasher.But, despite growing in stature and switching from right-back to centre-back, not everyone was convinced by Van Dijk at Willem and clubs hesitated to offer him a first professional contract.\"Inside the club there wasn't a unanimous opinion about him and I think Virgil felt that, that the opinions of the technical people were divided,\" Van Loon said. FC Groningen took the opportunity and signed a 19-year-old Van Dijk in 2010 - despite Willem finally making him an offer.The defender felt his own club were late with their offer and opted to take a different path in his career.He made his professional debut in May 2011 and impressed in his first full season the year after - until serious illness stopped him in his tracks.It took two trips to different hospitals to diagnose him with appendicitis, peritonitis and a kidney infection, and he had to be operated on straight away.Van Dijk, said at the time: \"My body was broken and I couldn't do anything. At such a moment, the worst scenarios are whizzing around your head. For the first time in my life, football was very much a side issue. My life was at risk.\"At some point I had to sign some papers. It was a kind of testament. If I died, a part of my money would go to my mum.\"Image source, Getty ImagesImage caption, Virgil van Dijk won the Champions League with Liverpool'Probably the best I've worked with as a manager'The operation went well but, despite a quick recovery and some impressive performances, the top clubs in Holland didn't express a big interest. It was then Celtic signed him for about £2.5m in 2013.\"He came in the first day and trained. I had a chat with him and said 'enjoy yourself here because I don't think you'll be here long',\" then manager Neil Lennon recalls.\"He's got pace, composure, physicality, technically brilliant. The progress was impossible to stop. He was such a good player - probably the best I've worked with as a manager.\"After two seasons, including two league titles and a Scottish Cup, Van Dijk moved to Southampton.\"I always thought he had the game and he's proven that,\" said Lennon. \"He could play for any team in the world and I'm surprised Manchester United or Manchester City, Barcelona or Real Madrid didn't come in and buy him rather than Liverpool at the time.\"Van Dijk became the world's most expensive defender when he signed for Liverpool in 2018 for £75m.He has since won the Champions League, Premier League, an FA Cup, two League Cups, the Club World Cup and won the 2019 UEFA player of the year award. He is now just one win away from his second Premier League title.Van Loon, said: \"He has adapted to new and more challenging situations. He has become captain and the way he deals with the coaching staff and press is very impressive. \"I'm very proud of what he has achieved. And he did it himself, there is no-one who solved things for him.\"He had to pull the strings and take the initiative. It gives such a boost to young people who may also start with nothing and who work to achieve their goals in life.\"LiverpoolPremier LeagueFootballMore on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c618/live/bf741ef0-1f92-11f0-9060-674316cb3a1f.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/400/cpsprodpb/73a4/live/83511cb0-1f93-11f0-9295-937dcb0aec23.jpg.webp 400w\" type=\"image/webp\" sizes=\"(min-width: 900px) 50vw, 100vw\"/\u003e\u003cimg alt=\"Liverpool\u0026#39;s Virgil van Dijk\" sizes=\"(min-width: 900px) 50vw, 100vw\" src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/73a4/live/83511cb0-1f93-11f0-9295-937dcb0aec23.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/400/cpsprodpb/73a4/live/83511cb0-1f93-11f0-9295-937dcb0aec23.jpg 400w\" width=\"624\" height=\"624\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/header\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eSuddenly he was back where it all began. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eLast month Virgil van Dijk made a secret visit to his old Dutch club Willem II to bring back a youth football tournament.\u003c/p\u003e\u003cp\u003eHe said: \u0026#34;It\u0026#39;s my way of giving back and helping nurture the next generation of world-class talent. This tournament gives rising stars the platform they need to take the next step towards their dreams.\u0026#34;\u003c/p\u003e\u003cp\u003eFittingly, the next edition of the \u0026#39;Virgil Legacy Trophy\u0026#39; in September will feature all of the clubs where Van Dijk played in his career, plus the likes of Arsenal, Manchester City and PSG.\u003c/p\u003e\u003cp\u003eAnd it was in Tilburg, a Dutch city in the southern province of North Brabant, where the current Liverpool captain gained invaluable insights about football and life.\u003c/p\u003e\u003cp\u003eAs he prepares to lift his second Premier League title with Liverpool, we look at how the 33-year-old centre-back learned from early setbacks to become one of the best in the world.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Some-youth-managers-even-saw-him-as-lazy\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Some youth managers even saw him as lazy\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVan Dijk joined Willem II\u0026#39;s then-acclaimed academy in 2001 as a 10-year-old.\u003c/p\u003e\u003cp\u003eIt was a club that had defied the odds just a few years earlier by finishing second in the Eredivisie in 1998-99 and reaching the Champions League.\u003c/p\u003e\u003cp\u003eShortly after his arrival, Jan van Loon was installed as academy director.\u003c/p\u003e\u003cp\u003e\u0026#34;There was actually no striker who stood a chance against him,\u0026#34; Van Loon said. \u0026#34;He was physically strong and he had a natural talent to take balls off opponents at exactly the right moment.  \u003c/p\u003e\u003cp\u003e\u0026#34;I remember in games we would sometimes say to him: \u0026#39;Watch out Virgil, there is an opponent behind you.\u0026#39; He would be very relaxed, like: \u0026#39;Yeah, OK, no worries.\u0026#39;\u003c/p\u003e\u003cp\u003e\u0026#34;I recall a game against Ajax, where he would mark their best player. We were saying \u0026#39;make sure he doesn\u0026#39;t touch any ball,\u0026#39; and that\u0026#39;s exactly what Virgil would do.\u0026#34;\u003c/p\u003e\u003cp\u003eYet there was still room for improvement, \u003c/p\u003e\u003cp\u003eVan Loon, added: \u0026#34;So now and then he could come across as laconic, a bit too easy going. Maybe at times some youth managers even thought of him as lazy.\u0026#34;\u003c/p\u003e\u003cp\u003eThat image was partly created by his timekeeping, as Van Dijk would sometimes arrive late for training sessions. \u003c/p\u003e\u003cp\u003eIt even got to the point where some coaches wondered whether the young defender should remain at the club. \u003c/p\u003e\u003cp\u003eBut when Van Loon took a closer interest in the young footballer, he also gained insight into Van Dijk\u0026#39;s personal life. \u003c/p\u003e\u003cp\u003eHe said: \u0026#34;His parents were divorced and at times he had to look after his younger brother and sister. Sometimes he had to take them from school and make them lunch, before jumping on the bus to Willem II. \u003c/p\u003e\u003cp\u003e\u0026#34;That meant he could be late now and then, and if I asked him about the reasons he would always explain in detail what had happened. \u003c/p\u003e\u003cp\u003e\u0026#34;One time I remember his little brother had asked him for peanut butter on his bread, something he had to go and get in the supermarket - and subsequently he just missed the bus. That period has shaped him both as a human and footballer.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Virgil van Dijk\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/7ba7/live/882da900-1f94-11f0-9295-937dcb0aec23.jpg 976w\" width=\"1024\" height=\"576.1252446183953\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eVirgil van Dijk made his debut for Groningen in May 2011\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"It-takes-a-village-to-raise-a-child\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;It takes a village to raise a child\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVan Dijk\u0026#39;s impressive performances finally saw him offered a chance to play for the second team, when he was playing for Willem\u0026#39;s under-19s.\u003c/p\u003e\u003cp\u003eBut on the day of the match he had to submit a report for school, which he hadn\u0026#39;t completed. School was paramount for the club, so he risked missing his big break,\u003c/p\u003e\u003cp\u003e\u0026#34;I said to Virgil: \u0026#39;Let\u0026#39;s look for a solution together\u0026#39;,\u0026#34; Van Loon added. \u0026#34;He was really popular with his classmates, not because he was a footballer but just as a human being. \u003c/p\u003e\u003cp\u003e\u0026#34;He asked a few of his peers and everything was done in time. Not that they wrote the assignment, but they did help him. The night before the game I got a message from the teacher saying everything was fine. \u003c/p\u003e\u003cp\u003e\u0026#34;That teacher also played his part. That\u0026#39;s why I always say it takes a village to raise a child. You need several people around you to push you in the right direction.\u0026#34;\u003c/p\u003e\u003cp\u003eVan Loon, who also had a spell as head of coaching at Arsenal\u0026#39;s academy, noticed how Van Dijk nurtured his people skills by recognising who could help him.\u003c/p\u003e\u003cp\u003eHe said: \u0026#34;He developed a skill to assemble people around him who would be best for his career. He would ask for extra attention from the best staff members, because he instinctively felt they could make him better. \u003c/p\u003e\u003cp\u003e\u0026#34;That was very special, I also saw that with players like Bukayo Saka and Frenkie de Jong, who was also in the academy of Willem II.\u003c/p\u003e\u003cp\u003e\u0026#34;At the club there was an exercise physiologist, who knew how to relate strength training to the role of centre-back. When exercises were finished, Virgil said: \u0026#39;No, we\u0026#39;ll continue for a while.\u0026#39; There you could see his inner drive, even though some other coaches had an impression that he was lazy.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"My-body-was-broken-and-I-couldnt-do-anything\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;My body was broken and I couldn\u0026#39;t do anything\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAs a teenager, Van Dijk combined his time playing at the Willem II academy with a part-time job as a dishwasher.\u003c/p\u003e\u003cp\u003eBut, despite growing in stature and switching from right-back to centre-back, not everyone was convinced by Van Dijk at Willem and clubs hesitated to offer him a first professional contract.\u003c/p\u003e\u003cp\u003e\u0026#34;Inside the club there wasn\u0026#39;t a unanimous opinion about him and I think Virgil felt that, that the opinions of the technical people were divided,\u0026#34; Van Loon said. \u003c/p\u003e\u003cp\u003eFC Groningen took the opportunity and signed a 19-year-old Van Dijk in 2010 - despite Willem finally making him an offer.\u003c/p\u003e\u003cp\u003eThe defender felt his own club were late with their offer and opted to take a different path in his career.\u003c/p\u003e\u003cp\u003eHe made his professional debut in May 2011 and impressed in his first full season the year after - until serious illness stopped him in his tracks.\u003c/p\u003e\u003cp\u003eIt took two trips to different hospitals to diagnose him with appendicitis, peritonitis and a kidney infection, and he had to be operated on straight away.\u003c/p\u003e\u003cp\u003eVan Dijk, said at the time: \u0026#34;My body was broken and I couldn\u0026#39;t do anything. At such a moment, the worst scenarios are whizzing around your head. For the first time in my life, football was very much a side issue. My life was at risk.\u003c/p\u003e\u003cp\u003e\u0026#34;At some point I had to sign some papers. It was a kind of testament. If I died, a part of my money would go to my mum.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Liverpool\u0026#39;s Virgil van Dijk with the Champions League trophy\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/4e1c/live/bba9e5a0-1f94-11f0-9295-937dcb0aec23.jpg 976w\" width=\"1024\" height=\"576\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eVirgil van Dijk won the Champions League with Liverpool\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Probably-the-best-Ive-worked-with-as-a-manager\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Probably the best I\u0026#39;ve worked with as a manager\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe operation went well but, despite a quick recovery and some impressive performances, the top clubs in Holland didn\u0026#39;t express a big interest. \u003c/p\u003e\u003cp\u003eIt was then Celtic signed him for about £2.5m in 2013.\u003c/p\u003e\u003cp\u003e\u0026#34;He came in the first day and trained. I had a chat with him and said \u0026#39;enjoy yourself here because I don\u0026#39;t think you\u0026#39;ll be here long\u0026#39;,\u0026#34; then manager Neil Lennon recalls.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s got pace, composure, physicality, technically brilliant. The progress was impossible to stop. He was such a good player - probably the best I\u0026#39;ve worked with as a manager.\u0026#34;\u003c/p\u003e\u003cp\u003eAfter two seasons, including two league titles and a Scottish Cup, Van Dijk moved to Southampton.\u003c/p\u003e\u003cp\u003e\u0026#34;I always thought he had the game and he\u0026#39;s proven that,\u0026#34; said Lennon. \u0026#34;He could play for any team in the world and I\u0026#39;m surprised Manchester United or Manchester City, Barcelona or Real Madrid didn\u0026#39;t come in and buy him rather than Liverpool at the time.\u0026#34;\u003c/p\u003e\u003cp\u003eVan Dijk became the world\u0026#39;s most expensive defender when he signed for Liverpool in 2018 for £75m.\u003c/p\u003e\u003cp\u003eHe has since won the Champions League, Premier League, an FA Cup, two League Cups, the Club World Cup and won the 2019 UEFA player of the year award. He is now just one win away from his second Premier League title.\u003c/p\u003e\u003cp\u003eVan Loon, said: \u0026#34;He has adapted to new and more challenging situations. He has become captain and the way he deals with the coaching staff and press is very impressive. \u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m very proud of what he has achieved. And he did it himself, there is no-one who solved things for him.\u003c/p\u003e\u003cp\u003e\u0026#34;He had to pull the strings and take the initiative. It gives such a boost to young people who may also start with nothing and who work to achieve their goals in life.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"topic-list\"\u003e\u003cul role=\"list\" spacing=\"2\"\u003e\u003cli\u003e\u003ca href=\"https://www.bbc.com/sport/football/teams/liverpool\"\u003eLiverpool\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.bbc.com/sport/football/premier-league\"\u003ePremier League\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.bbc.com/sport/football\"\u003eFootball\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-23T22:00:37.521Z",
  "modifiedTime": null
}
