{
  "id": "4bee6f73-7ac9-4371-a87c-c944dcf30bfd",
  "title": "Lineker to stop hosting Match of the Day, BBC confirms",
  "link": "https://www.bbc.com/news/articles/crln27ek10no",
  "description": "The BBC has \"agreed in principle a contract extension through to the 2026 World Cup,\" with Lineker.",
  "author": "",
  "published": "Tue, 12 Nov 2024 13:05:26 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Helen Bushby",
  "length": 5802,
  "excerpt": "The BBC has \"agreed in principle a contract extension through to the 2026 World Cup,\" with Lineker.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Gary Lineker seen after stepping down from Match of the DayThe BBC has confirmed that Match of the Day host Gary Lineker is to step down from the flagship football show at the end of this season, but will host BBC Sport’s coverage of the 2026 World Cup.He will also front the BBC's coverage of the FA Cup 2025/2026. \"The BBC and Gary Lineker have agreed in principle a contract extension through to the 2026 World Cup,\" the BBC said, while confirming his Match of the Day tenure was ending.Lineker said: “I’m delighted to continue my long association with BBC Sport and would like to thank all those who made this happen.”Who could replace Lineker as host?How Gary Lineker went from football sensation to BBC starHe will continue with the MOTD Top Ten podcast and the BBC will also now host the popular The Rest is Football podcast on BBC Sounds.The podcast features Lineker, Alan Shearer, and Micah Richards discussing the latest football news along with stories from their careers, and is part of Goalhanger productions, co-founded by Lineker.This marks the first time it will also be made available on the BBC's own audio platform; it is currently available on podcast platforms such as Spotify and Apple.The BBC said there will be one episode per week of The Rest is Football on BBC Sounds from next month. Goalhanger also produces popular shows including The Rest is History, The Rest is Politics and The Rest is Entertainment.PA MediaGary Lineker: “I’m delighted to continue my long association with BBC Sport\"Lineker, whose contract was coming to an end, entered negotiations with the BBC's new head of sport in October.BBC News understands that Lineker was open to staying on at Match of the Day, but the BBC did not offer him a new contract for the show.However, it's understood both parties are now happy with the new agreement.\"With 33 million viewers last season across the Premier League and FA Cup, Match of the Day remains part of the staple diet of football fans who still get a huge buzz from hearing that iconic theme tune on a Saturday night,\" the BBC said.\"The show continually evolves for changing viewing habits bringing its unique and unmatched analysis and commentary across all platforms. Future plans for Match of the Day will be announced in due course.\"Alex Kay-Jelski, director of BBC Sport described Lineker as a world-class presenter. \"We’re delighted that he’ll lead our coverage of the next World Cup and continue to lead our live coverage of the FA Cup,\" he said. “After 25 seasons Gary is stepping down from MOTD. We want to thank him for everything he has done for the show, which continues to attract millions of viewers each week. \"He’ll be hugely missed on the show but we’re so happy he is staying with the BBC to present live football.”Former BBC director general Greg Dyke told BBC Radio 4's Today programme that Lineker was \"the outstanding sports presenter of his time\", but added: \"Life moves on, presenters don't stay forever.\"The 63-year-old has hosted Match of the Day since 1999. He will have held the post for 26 years when he leaves at the end of the Premier League season in May 2025.Dyke, who was director general when Lineker first began hosting the football show in 1999, did not speculate on whether Lineker had been \"offered a new contract or not\".He also said he did not know whether the recent controversy over the presenter's social media use was connected with his departure.\"Whether this is anything to do with that I don't know. It's one of the few times I've disagreed with the BBC since I left,\" he said.\"I thought that he was a sports presenter, and therefore what he was saying about politics was irrelevant to his performance as as a presenter.\"But it's there in the background. So it must have been a thought in the mind of of whoever took the decision.\"Dyke said losing the presenter was \"a big loss\", but \"in the end people watch Match of the Day for the football\".'Very hard act to follow'Lineker told Esquire magazine in an interview published earlier this month that he accepted he will \"have to slow down at some point\".Dyke also said the BBC is \"in difficulties financially\", referring to recent job cuts being made as part of wider BBC efforts to save £700m a year, adding that losing Lineker \"would be a saving on a sports budget, which you could use elsewhere\".Lineker is one of the corporation's best-known presenters and its highest-paid star, of those whose salaries are declared, earning more than £1.3m a year.He has also presented coverage of major tournaments like World Cups and European Championships for the BBC, as well as BBC Sports Personality of the Year ceremonies.Lineker has worked for other sports networks during his time at the BBC, including US network NBC and BT Sport (now TNT Sport). Alastair Campbell, who co-presents The Rest Is Politics podcast, said Lineker would be \"a very hard act to follow\", Sky News reported.\"He is an excellent broadcaster and a very good guy,\" Campbell said.Lineker's new contract has now been agreed and he will leave on a high at the biggest tournament in world football. But replacing a star presenter on a high profile show is always a risk.Lineker was briefly suspended by bosses last year after an outcry over his social media post about the UK's asylum policy.The incident led to a review of BBC social media guidelines, which concluded that high-profile presenters should be allowed to express views on issues and policies but stop short of political campaigning.Lineker described the new rules at the time as \"all very sensible\".Before becoming a TV presenter, Lineker had a hugely successful career as a striker for England as well as Leicester, Everton, Tottenham Hotspur and Barcelona.Additional reporting by Mallory Moench, Katie Razzall and Steven McIntosh.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ec57/live/7f5b67f0-a0e0-11ef-8ab9-9192db313061.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eGary Lineker seen after stepping down from Match of the Day\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb id=\"the-bbc-has-confirmed-that-match-of-the-day-host-gary-lineker-is-to-step-down-from-the-flagship-football-show-at-the-end-of-this-season,-but-will-host-bbc-sport’s-coverage-of-the-2026-world-cup.\"\u003eThe BBC has confirmed that Match of the Day host Gary Lineker is to step down from the flagship football show at the end of this season, but will host BBC Sport’s coverage of the 2026 World Cup.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eHe will also front the BBC\u0026#39;s coverage of the FA Cup 2025/2026. \u003c/p\u003e\u003cp\u003e\u0026#34;The BBC and Gary Lineker have agreed in principle a contract extension through to the 2026 World Cup,\u0026#34; the BBC said, while confirming his Match of the Day tenure was ending.\u003c/p\u003e\u003cp\u003eLineker said: “I’m delighted to continue my long association with BBC Sport and would like to thank all those who made this happen.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/c8el9d56yy6o\"\u003eWho could replace Lineker as host?\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cp39xlwexyxo\"\u003eHow Gary Lineker went from football sensation to BBC star\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHe will continue with the MOTD Top Ten podcast and the BBC will also now\u003cb id=\"\"\u003e \u003c/b\u003ehost the popular The Rest is Football podcast on BBC Sounds.\u003c/p\u003e\u003cp\u003eThe podcast features Lineker, Alan Shearer, and Micah Richards discussing the latest football news along with stories from their careers, and is part of Goalhanger productions, co-founded by Lineker.\u003c/p\u003e\u003cp\u003eThis marks the first time it will also be made available on the BBC\u0026#39;s own audio platform; it is currently available on podcast platforms such as Spotify and Apple.\u003c/p\u003e\u003cp\u003eThe BBC said there will be one episode per week of The Rest is Football on BBC Sounds from next month. \u003c/p\u003e\u003cp\u003eGoalhanger also produces popular shows including The Rest is History, The Rest is Politics and The Rest is Entertainment.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e63c/live/dddcfaa0-a0e0-11ef-ba0f-3521f4b3d263.jpg.webp\" loading=\"lazy\" alt=\"PA Media Gary Lineker in a suit waving\"/\u003e\u003cspan\u003ePA Media\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eGary Lineker: “I’m delighted to continue my long association with BBC Sport\u0026#34;\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLineker, whose contract was coming to an end, entered negotiations with the BBC\u0026#39;s new head of sport in October.\u003c/p\u003e\u003cp\u003eBBC News understands that Lineker was open to staying on at Match of the Day, but the BBC did not offer him a new contract for the show.\u003c/p\u003e\u003cp\u003eHowever, it\u0026#39;s understood both parties are now happy with the new agreement.\u003c/p\u003e\u003cp\u003e\u0026#34;With 33 million viewers last season across the Premier League and FA Cup, Match of the Day remains part of the staple diet of football fans who still get a huge buzz from hearing that iconic theme tune on a Saturday night,\u0026#34; the BBC said.\u003c/p\u003e\u003cp\u003e\u0026#34;The show continually evolves for changing viewing habits bringing its unique and unmatched analysis and commentary across all platforms. Future plans for Match of the Day will be announced in due course.\u0026#34;\u003c/p\u003e\u003cp\u003eAlex Kay-Jelski, director of BBC Sport described Lineker as a world-class presenter. \u003c/p\u003e\u003cp\u003e\u0026#34;We’re delighted that he’ll lead our coverage of the next World Cup and continue to lead our live coverage of the FA Cup,\u0026#34; he said. \u003c/p\u003e\u003cp\u003e“After 25 seasons Gary is stepping down from MOTD. We want to thank him for everything he has done for the show, which continues to attract millions of viewers each week. \u003c/p\u003e\u003cp\u003e\u0026#34;He’ll be hugely missed on the show but we’re so happy he is staying with the BBC to present live football.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFormer BBC director general Greg Dyke told BBC Radio 4\u0026#39;s Today programme that Lineker was \u0026#34;the outstanding sports presenter of his time\u0026#34;, but added: \u0026#34;Life moves on, presenters don\u0026#39;t stay forever.\u0026#34;\u003c/p\u003e\u003cp\u003eThe 63-year-old has hosted Match of the Day since 1999. He will have held the post for 26 years when he leaves at the end of the Premier League season in May 2025.\u003c/p\u003e\u003cp\u003eDyke, who was director general when Lineker first began hosting the football show in 1999, did not speculate on whether Lineker had been \u0026#34;offered a new contract or not\u0026#34;.\u003c/p\u003e\u003cp\u003eHe also said he did not know whether the recent controversy over the presenter\u0026#39;s social media use was connected with his departure.\u003c/p\u003e\u003cp\u003e\u0026#34;Whether this is anything to do with that I don\u0026#39;t know. It\u0026#39;s one of the few times I\u0026#39;ve disagreed with the BBC since I left,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;I thought that he was a sports presenter, and therefore what he was saying about politics was irrelevant to his performance as as a presenter.\u003c/p\u003e\u003cp\u003e\u0026#34;But it\u0026#39;s there in the background. So it must have been a thought in the mind of of whoever took the decision.\u0026#34;\u003c/p\u003e\u003cp\u003eDyke said losing the presenter was \u0026#34;a big loss\u0026#34;, but \u0026#34;in the end people watch Match of the Day for the football\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003e\u0026#39;Very hard act to follow\u0026#39;\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLineker told Esquire magazine in an interview published earlier this month that he accepted he will \u0026#34;have to slow down at some point\u0026#34;.\u003c/p\u003e\u003cp\u003eDyke also said the BBC is \u0026#34;in difficulties financially\u0026#34;, referring to recent job cuts being made as part of wider BBC efforts to save £700m a year, adding that losing Lineker \u0026#34;would be a saving on a sports budget, which you could use elsewhere\u0026#34;.\u003c/p\u003e\u003cp\u003eLineker is one of the corporation\u0026#39;s best-known presenters and its highest-paid star, of those whose salaries are declared, earning more than £1.3m a year.\u003c/p\u003e\u003cp\u003eHe has also presented coverage of major tournaments like World Cups and European Championships for the BBC, as well as BBC Sports Personality of the Year ceremonies.\u003c/p\u003e\u003cp\u003eLineker has worked for other sports networks during his time at the BBC, including US network NBC and BT Sport (now TNT Sport). \u003c/p\u003e\u003cp\u003eAlastair Campbell, who co-presents The Rest Is Politics podcast, said Lineker would be \u0026#34;a very hard act to follow\u0026#34;, Sky News reported.\u003c/p\u003e\u003cp\u003e\u0026#34;He is an excellent broadcaster and a very good guy,\u0026#34; Campbell said.\u003c/p\u003e\u003cp\u003eLineker\u0026#39;s new contract has now been agreed and he will leave on a high at the biggest tournament in world football. But replacing a star presenter on a high profile show is always a risk.\u003c/p\u003e\u003cp\u003eLineker was briefly suspended by bosses last year after an outcry over his social media post about the UK\u0026#39;s asylum policy.\u003c/p\u003e\u003cp\u003eThe incident led to a review of BBC social media guidelines, which concluded that high-profile presenters should be allowed to express views on issues and policies but stop short of political campaigning.\u003c/p\u003e\u003cp\u003eLineker described the new rules at the time as \u0026#34;all very sensible\u0026#34;.\u003c/p\u003e\u003cp\u003eBefore becoming a TV presenter, Lineker had a hugely successful career as a striker for England as well as Leicester, Everton, Tottenham Hotspur and Barcelona.\u003c/p\u003e\u003cp\u003e\u003ci id=\"additional-reporting-by-mallory-moench,-katie-razzall-and-steven-mcintosh.\"\u003eAdditional reporting by Mallory Moench, Katie Razzall and Steven McIntosh.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-12T10:22:14.78Z",
  "modifiedTime": null
}
