{
  "id": "4cf4aae7-b8ae-4d52-988c-b8be7f45f4d9",
  "title": "'My father thinks I'm a disgrace' - Eubank reveals pain",
  "link": "https://www.bbc.com/sport/boxing/articles/cj0zddrerd3o",
  "description": "Chris Eubank Jr opens up on the pain of his estranged relationship with his father at a news conference.",
  "author": "",
  "published": "Thu, 24 Apr 2025 20:18:07 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Kal Sajad",
  "length": 3500,
  "excerpt": "Chris Eubank Jr opens up on the pain of his estranged relationship with his father at a news conference.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Chris Eubank Jr opened up about the fractured relationship with his father and the death of his brother before Saturday's much-hyped fight with rival Conor Benn.The all-British grudge match will take place at the Tottenham Hotspur Stadium, more than 30 years after their fathers began their own iconic rivalry.Speaking at Thursday's news conference, Benn, 28, vowed to inflict \"pain\" on the 35-year-old Eubank Jr in their middleweight contest\"What is pain, though?\", retorted Eubank Jr, whose brother Sebastian died in 2021 aged 29. \"I have a brother who is buried in the desert in Dubai, that is pain.\"I have his son, three years old, he asks, 'why can't I see my daddy? why can't he take me to school?'. That is pain.\"It is becoming increasingly unlikely Chris Eubank Sr, who beat Nigel Benn in 1990 before a contentious draw three years later, will be at Saturday's bout.Eubank Sr has fallen out with his son and not been involved in any of the fight build-up.\"My own father, a man I idolised for my entire life, and he doesn't speak to me,\" added Eubank Jr.\"We haven't spoken for years and he thinks I'm a disgrace. These things are what pain is to me.\"Eubank Jr and Benn were scheduled to fight in October 2022, before Benn failed a voluntary drugs test.A long and intense stare down ensued at the face-off, although there was no repeat of February's infamous news conference when Eubank Jr slapped Benn with an egg.Eubank Jr took his seat 15 minutes after the scheduled start time, leaving Benn and a few hundred of the boxing media waiting in a conference room overlooking the pitch at the fight night venue.Just like he did in February, Eubank Jr heckled promoter Eddie Hearn the moment the Matchroom boss began to speak.\"I can't wait for him to smash you to pieces on Saturday,\" Hearn said, raising his voice to be heard.Hearn swapped places with Matchroom chief executive Frank Smith, but Eubank Jr did not back down.He then accused Benn, who based his training camp in Spain, of \"fleeing\" the United Kingdom.\"He knew he couldn't handle the pressure of the UK streets and have people shouting drug cheat and egg jokes,\" added Eubank Jr.Benn, who has always maintained his innocence, had his suspension lifted in November after a two-year-battle with anti-doping authorities.With his father sat beside him, he refused to bite back and felt \"no pressure\" in a bid to extend his 23-fight unbeaten record.Former world-title challenger Eubank Jr has won 34 fights and lost three, but competed at a much higher level than his opponent.Benn has operated the majority of his career two divisions below the middleweight limit.Both fighters will weigh in on Friday and are prohibited from adding more than 10lbs by a second weigh-in on Saturday morning.Eubank Jr remains favourite with bookmakers, but those in Benn's inner circle say he looks in phenomenal shape.Nigel Benn, as he has done throughout camp and in every media event, was by his son's side and predicted the fight \"won't go past four rounds\".He raved about his son \"bullying\" sparring partners as he spoke of a session in which Benn supposedly got the better of undefeated IBF world super-middleweight champion William Scull, who fights Saul 'Canelo' Alvarez on 4 May.\"He couldn't take no more after eight rounds, he was meant to be doing 10 rounds,\" added the 61-year-old former two-weight world champion.Whether where is any truth to all the noise, or if it's just smoke and mirrors and the usual pre-fight hype, remains to be seen.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/060e/live/0ef74690-2142-11f0-bbf4-5bf36dcdd2a6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eChris Eubank Jr opened up about the fractured relationship with his father and the death of his brother before Saturday\u0026#39;s much-hyped fight with rival Conor Benn.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe all-British grudge match will take place at the Tottenham Hotspur Stadium, more than 30 years after their fathers began their own iconic rivalry.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.com/sport/boxing/live/c4g30k1yvvqt\"\u003eSpeaking at Thursday\u0026#39;s news conference,\u003c/a\u003e Benn, 28, vowed to inflict \u0026#34;pain\u0026#34; on the 35-year-old Eubank Jr in their middleweight contest\u003c/p\u003e\u003cp\u003e\u0026#34;What is pain, though?\u0026#34;, retorted Eubank Jr, \u003ca href=\"https://www.bbc.com/news/uk-57828270\"\u003ewhose brother Sebastian died in 2021\u003c/a\u003e aged 29. \u0026#34;I have a brother who is buried in the desert in Dubai, that is pain.\u003c/p\u003e\u003cp\u003e\u0026#34;I have his son, three years old, he asks, \u0026#39;why can\u0026#39;t I see my daddy? why can\u0026#39;t he take me to school?\u0026#39;. That is pain.\u0026#34;\u003c/p\u003e\u003cp\u003eIt is becoming increasingly unlikely Chris Eubank Sr, who beat Nigel Benn in 1990 before a contentious draw three years later, will be at Saturday\u0026#39;s bout.\u003c/p\u003e\u003cp\u003eEubank Sr has fallen out with his son and not been involved in any of the fight build-up.\u003c/p\u003e\u003cp\u003e\u0026#34;My own father, a man I idolised for my entire life, and he doesn\u0026#39;t speak to me,\u0026#34; added Eubank Jr.\u003c/p\u003e\u003cp\u003e\u0026#34;We haven\u0026#39;t spoken for years and he thinks I\u0026#39;m a disgrace. These things are what pain is to me.\u0026#34;\u003c/p\u003e\u003cp\u003eEubank Jr and Benn were scheduled to fight in October 2022, before \u003ca href=\"https://www.bbc.com/sport/boxing/63158856\"\u003eBenn failed a voluntary drugs test\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eA long and intense stare down ensued at the face-off, although there was no repeat of February\u0026#39;s \u003ca href=\"https://www.bbc.com/sport/boxing/articles/cm2jje58rdvo\"\u003einfamous news conference \u003c/a\u003e when Eubank Jr slapped Benn with an egg.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEubank Jr took his seat 15 minutes after the scheduled start time, leaving Benn and a few hundred of the boxing media waiting in a conference room overlooking the pitch at the fight night venue.\u003c/p\u003e\u003cp\u003eJust like he did in February, Eubank Jr heckled promoter Eddie Hearn the moment the Matchroom boss began to speak.\u003c/p\u003e\u003cp\u003e\u0026#34;I can\u0026#39;t wait for him to smash you to pieces on Saturday,\u0026#34; Hearn said, raising his voice to be heard.\u003c/p\u003e\u003cp\u003eHearn swapped places with Matchroom chief executive Frank Smith, but Eubank Jr did not back down.\u003c/p\u003e\u003cp\u003eHe then accused Benn, who based his training camp in Spain, of \u0026#34;fleeing\u0026#34; the United Kingdom.\u003c/p\u003e\u003cp\u003e\u0026#34;He knew he couldn\u0026#39;t handle the pressure of the UK streets and have people shouting drug cheat and egg jokes,\u0026#34; added Eubank Jr.\u003c/p\u003e\u003cp\u003eBenn, who has always maintained his innocence, had \u003ca href=\"https://www.bbc.com/sport/boxing/articles/c7482kn2gngo\"\u003ehis suspension lifted in November\u003c/a\u003e after a two-year-battle with anti-doping authorities.\u003c/p\u003e\u003cp\u003eWith his father sat beside him, he refused to bite back and felt \u0026#34;no pressure\u0026#34; in a bid to extend his 23-fight unbeaten record.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFormer world-title challenger Eubank Jr has won 34 fights and lost three, but competed at a much higher level than his opponent.\u003c/p\u003e\u003cp\u003eBenn has operated the majority of his career two divisions below the middleweight limit.\u003c/p\u003e\u003cp\u003eBoth fighters will weigh in on Friday and are prohibited from adding more than 10lbs by a second weigh-in on Saturday morning.\u003c/p\u003e\u003cp\u003eEubank Jr remains favourite with bookmakers, but those in Benn\u0026#39;s inner circle say he looks in phenomenal shape.\u003c/p\u003e\u003cp\u003eNigel Benn, as he has done throughout camp and in every media event, was by his son\u0026#39;s side and predicted the fight \u0026#34;won\u0026#39;t go past four rounds\u0026#34;.\u003c/p\u003e\u003cp\u003eHe raved about his son \u0026#34;bullying\u0026#34; sparring partners as he spoke of a session in which Benn supposedly got the better of undefeated IBF world super-middleweight champion William Scull, who fights Saul \u0026#39;Canelo\u0026#39; Alvarez on 4 May.\u003c/p\u003e\u003cp\u003e\u0026#34;He couldn\u0026#39;t take no more after eight rounds, he was meant to be doing 10 rounds,\u0026#34; added the 61-year-old former two-weight world champion.\u003c/p\u003e\u003cp\u003eWhether where is any truth to all the noise, or if it\u0026#39;s just smoke and mirrors and the usual pre-fight hype, remains to be seen.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-24T20:18:07.603Z",
  "modifiedTime": null
}
