{
  "id": "5b57cafc-673e-4e31-8116-9165605ef246",
  "title": "OSU police probing use of pepper spray in melee",
  "link": "https://www.espn.com/college-football/story/_/id/42703166/police-probing-use-pepper-spray-ohio-state-michigan-melee",
  "description": "A brawl broke out between Michigan and Ohio State players Saturday after the Wolverines planted their flag at midfield in the Horseshoe following their upset of the second-ranked Buckeyes.",
  "author": "Jake Trotter",
  "published": "Sat, 30 Nov 2024 19:54:33 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Jake Trotter",
  "length": 3566,
  "excerpt": "A brawl broke out between Michigan and Ohio State players Saturday after the Wolverines planted their flag at midfield in the Horseshoe following their upset of the second-ranked Buckeyes.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Michigan, Ohio State brawl after Wolverines' upset win (0:56)Michigan and Ohio State get into it after the Wolverines' upset victory in Columbus. (0:56)Jake Trotter, ESPN Senior WriterNov 30, 2024, 05:43 PM ETCloseJake Trotter covers college football for ESPN. He joined ESPN in 2011. Before that, he worked at The Oklahoman, Austin American-Statesman and Middletown (Ohio) Journal newspapers. You can follow him @Jake_Trotter.COLUMBUS, Ohio -- A brawl exploded Saturday between Michigan and Ohio State when the Wolverines planted their flag at midfield in The Horseshoe following their stunning 13-10 upset of the second-ranked Buckeyes.Police eventually used pepper spray to quash the scuffle that lasted roughly five minutes. Players and coaches from both sides were left bloodied, and Ohio State University police said one officer was injured.As the Wolverines gathered on the Block O logo in celebration, several Ohio State players rushed in throwing punches. Michigan players punched back.Wolverines coach Sherrone Moore and Ohio State athletic director Ross Bjork were among those who tried to break up the multiple skirmishes that broke out. Several police officers eventually stepped in and attempted to form a line separating the two teams.Ohio State University police said in a statement that \"officers from multiple law enforcement agencies assisted in breaking up an on-field altercation. During the scuffle, multiple officers representing Ohio and Michigan deployed pepper spray.\"They added that one officer was injured during the altercation and \"transported for medical attention.\"Ohio State police said it will continue to investigate the incident.Buckeyes coach Ryan Day later blamed Michigan for starting the melee by planting the flag.\"I don't know all the details of it, but I know these guys are looking to put a flag on our field and our guys weren't going to let that happen,\" Day said. \"I'll find out exactly what happened. But this is our field and certainly we're embarrassed of the fact that we lost the game, but there's some prideful guys in this team that weren't going to just let that happen.\"Moore said he wished both teams managed the incident better.\"It was emotions on both sides,\" Moore said. \"I did see they had the flag and guys were waving it around and their guys charged us. There's emotion on both sides. It can't happen. Rivalry games get heated, especially this one, it's the biggest one in the country, so we got to handle that one better.\"The Wolverines came in as 20.5-point underdogs, the second-biggest spread in the rivalry dating to 1978. But after a scoreless second half, Dominic Zvada nailed a 21-yard field goal with 45 seconds remaining, giving Michigan its fourth straight win in the series.Wolverines All-American defensive tackle Mason Graham and Ohio State defensive end Jack Sawyer emphatically traded insults as the incident finally waned, with several Michigan players waving bye to the Buckeyes as they finally walked away.Kalel Mullings, who rushed for 116 yards and scored the Wolverines' only touchdown, called the Buckeyes \"classless\" for trying to fight afterward.\"For such a great game, you hate to see stuff like that after the game,\" he said. \"This is bad for the sport and bad for college football, but at the end of the day, some people have got to learn how to lose. You can't be fighting and stuff just because you lost a game. All that fighting -- we had 60 minutes, we had four quarters to do all that fighting, and now, people want to talk and fight. ... People have got to be better.\"",
  "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1130%2Fr1421783_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-video=\"watch,640,360,42702182\" data-cerebro-id=\"674b888445a32839d8026894\" data-title=\"Michigan, Ohio State brawl after Wolverines\u0026#39; upset win\" data-source=\"espn\"\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMichigan, Ohio State brawl after Wolverines\u0026#39; upset win (0:56)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eMichigan and Ohio State get into it after the Wolverines\u0026#39; upset victory in Columbus. (0:56)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/trotter_jake.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eJake Trotter, ESPN Senior Writer\u003cspan\u003eNov 30, 2024, 05:43 PM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003eJake Trotter covers college football for ESPN. He joined ESPN in 2011. Before that, he worked at The Oklahoman, Austin American-Statesman and Middletown (Ohio) Journal newspapers. You can follow him @Jake_Trotter.\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eCOLUMBUS, Ohio -- A brawl exploded Saturday between \u003ca href=\"https://www.espn.com/college-football/team/_/id/130/michigan-wolverines\"\u003eMichigan\u003c/a\u003e and \u003ca href=\"https://www.espn.com/college-football/team/_/id/194/ohio-state-buckeyes\"\u003eOhio State\u003c/a\u003e when the Wolverines planted their flag at midfield in The Horseshoe following their stunning 13-10 upset of the second-ranked Buckeyes.\u003c/p\u003e\u003cp\u003ePolice eventually used pepper spray to quash the scuffle that lasted roughly five minutes. Players and coaches from both sides were left bloodied, and Ohio State University police said one officer was injured.\u003c/p\u003e\u003cp\u003eAs the Wolverines gathered on the Block O logo in celebration, several Ohio State players rushed in throwing punches. Michigan players punched back.\u003c/p\u003e\u003cp\u003eWolverines coach Sherrone Moore and Ohio State athletic director Ross Bjork were among those who tried to break up the multiple skirmishes that broke out. Several police officers eventually stepped in and attempted to form a line separating the two teams.\u003c/p\u003e\u003cp\u003eOhio State University police said in a statement that \u0026#34;officers from multiple law enforcement agencies assisted in breaking up an on-field altercation. During the scuffle, multiple officers representing Ohio and Michigan deployed pepper spray.\u0026#34;\u003c/p\u003e\u003cp\u003eThey added that one officer was injured during the altercation and \u0026#34;transported for medical attention.\u0026#34;\u003c/p\u003e\u003cp\u003eOhio State police said it will continue to investigate the incident.\u003c/p\u003e\u003cp\u003eBuckeyes coach Ryan Day later blamed Michigan for starting the melee by planting the flag.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t know all the details of it, but I know these guys are looking to put a flag on our field and our guys weren\u0026#39;t going to let that happen,\u0026#34; Day said. \u0026#34;I\u0026#39;ll find out exactly what happened. But this is our field and certainly we\u0026#39;re embarrassed of the fact that we lost the game, but there\u0026#39;s some prideful guys in this team that weren\u0026#39;t going to just let that happen.\u0026#34;\u003c/p\u003e\u003cp\u003eMoore said he wished both teams managed the incident better.\u003c/p\u003e\u003cp\u003e\u0026#34;It was emotions on both sides,\u0026#34; Moore said. \u0026#34;I did see they had the flag and guys were waving it around and their guys charged us. There\u0026#39;s emotion on both sides. It can\u0026#39;t happen. Rivalry games get heated, especially this one, it\u0026#39;s the biggest one in the country, so we got to handle that one better.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Wolverines came in as 20.5-point underdogs, the second-biggest spread in the rivalry dating to 1978. But after a scoreless second half, \u003ca data-player-guid=\"8e010484-8877-3842-ae87-42849d9f9135\" href=\"http://www.espn.com/college-football/player/_/id/5082424/dominic-zvada\"\u003eDominic Zvada\u003c/a\u003e nailed a 21-yard field goal with 45 seconds remaining, giving Michigan its fourth straight win in the series.\u003c/p\u003e\u003cp\u003eWolverines All-American defensive tackle \u003ca data-player-guid=\"9167867c-52d4-3d9e-982c-f4b7ad9f259b\" href=\"https://www.espn.com/college-football/player/_/id/4873232/mason-graham\"\u003eMason Graham\u003c/a\u003e and Ohio State defensive end \u003ca data-player-guid=\"a810e96c-0c76-30c2-aa9f-16d54b53a1a4\" href=\"https://www.espn.com/college-football/player/_/id/4431590/jack-sawyer\"\u003eJack Sawyer\u003c/a\u003e emphatically traded insults as the incident finally waned, with several Michigan players waving bye to the Buckeyes as they finally walked away.\u003c/p\u003e\u003cp\u003e\u003ca data-player-guid=\"a60f68fe-960f-3e0d-92a4-4aa05d6d139f\" href=\"https://www.espn.com/college-football/player/_/id/4429121/kalel-mullings\"\u003eKalel Mullings\u003c/a\u003e, who rushed for 116 yards and scored the Wolverines\u0026#39; only touchdown, called the Buckeyes \u0026#34;classless\u0026#34; for trying to fight afterward.\u003c/p\u003e\u003cp\u003e\u0026#34;For such a great game, you hate to see stuff like that after the game,\u0026#34; he said. \u0026#34;This is bad for the sport and bad for college football, but at the end of the day, some people have got to learn how to lose. You can\u0026#39;t be fighting and stuff just because you lost a game. All that fighting -- we had 60 minutes, we had four quarters to do all that fighting, and now, people want to talk and fight. ... People have got to be better.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-30T22:43:00Z",
  "modifiedTime": null
}
