{
  "id": "62e07fe2-0cd6-4e23-a80a-10ae1c31f0cc",
  "title": "Clark, Fever back investigation: No place for hate",
  "link": "https://www.espn.com/wnba/story/_/id/45229280/fever-players-back-probe-comments-angel-reese",
  "description": "Fever players on Monday supported the WNBA's investigation into allegations of \"hateful fan comments\" toward the Sky's Angel Reese.",
  "author": "Michael Voepel",
  "published": "Mon, 19 May 2025 21:06:32 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Michael Voepel",
  "length": 2969,
  "excerpt": "Fever players on Monday supported the WNBA's investigation into allegations of \"hateful fan comments\" toward the Sky's Angel Reese.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "playCaitlin Clark: 'No place' for hate comments toward Angel Reese (0:31)Caitlin Clark voices her support for the WNBA investigation into hateful fan comments toward Angel Reese in the season opener between the Fever and Sky. (0:31)Michael VoepelMay 19, 2025, 07:09 PM ETCloseMichael Voepel is a senior writer who covers the WNBA, women's college basketball and other college sports. Voepel began covering women's basketball in 1984, and has been with ESPN since 1996.INDIANAPOLIS -- Indiana Fever players spoke Monday after practice about the WNBA investigating allegations of \"hateful fan comments\" toward Chicago Sky player Angel Reese during Saturday's season opener for the teams.No one on the Fever said they heard anything specific from the sellout crowd during Indiana's 93-58 victory. But they added that they understood the need for an investigation.\"There's no place for that in our game, there's no place for that in society,\" Fever guard Caitlin Clark said. \"Certainly, we want every person who comes into our arena -- whether player or fan -- to have a great experience. I appreciate the league doing that [investigation]. I appreciate that the Fever organization has been at the forefront of that.\"Social media posts during Saturday's game said hateful remarks or noises were made toward Reese after a third-quarter incident involving her and Clark. Clark fouled Reese to prevent an open layup attempt. Reese objected to the foul and tried to confront Clark, but Indiana's Aliyah Boston kept the players apart.Clark's foul was upgraded to a flagrant foul 1, and both Reese and Boston received technical fouls. Boston was stunned when told after the game that she had received a technical despite being the player who quickly defused the situation.On Monday, Boston said it was important for players to keep reiterating the message that fans need to maintain decorum while still enjoying the game.\"No type of hate is ever welcomed here,\" Boston said. \"As a player you just have to stay strong and be able to call it out if something happens.\"We, as athletes, have to make sure that fans know it's OK to be passionate, to cheer us on, to get loud. But at the end of the day, it's about respect. If it was your daughter out on the court, you would want that respect being shown. That has to be the mindset for every fan when they step into an arena.\"DeWanna Bonner, in her 16th season in the WNBA but first with the Fever, said that the team briefly discussed the situation and that everyone was on the same page.\"We keep uplifting each other and speaking out on these things when that is needed,\" Bonner said. \"That's not what we as players stand for, not what the Indiana Fever organization stands for. It's zero tolerance.\"Of course, we want a tough environment for opposing teams to play in. But a basketball environment where people can still just enjoy the game.\"The Fever next play Tuesday against the visiting Atlanta Dream at Gainbridge Fieldhouse.",
  "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0519%2Fr1495476_2_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-feed\" data-behavior=\"author_overlay article_header_news_feed_item_meta article_legal_footer\"\u003e\u003carticle data-id=\"45229280\" data-behavior=\"story_scroll story_progress\" data-src=\"/wnba/story/_/id/45229280/fever-players-back-probe-comments-angel-reese\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003c/header\u003e\u003cfigure data-video=\"watch,640,360,45229581,url-https://watch.auth.api.espn.com/video/auth/brightcove/f57705b6-00f6-4617-9200-82626f76bdf3/asset?UMADPARAMreferer=https://www.espn.com/video/clip?id=45229581,poster-https://media.video-cdn.espn.com/motion/2025/0519/dm_250519_clark_on_reese_hate_investigation/dm_250519_clark_on_reese_hate_investigation.jpg\" data-cerebro-id=\"682bc3185515fe108cf09b05\" data-title=\"Caitlin Clark: \u0026#39;No place\u0026#39; for hate comments toward Angel Reese\" data-video-mobile-bloom=\"true\" data-source=\"espn\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource srcset=\"https://a.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0519%2Fdm_250519_clark_on_reese_hate_investigation%2Fdm_250519_clark_on_reese_hate_investigation.jpg\u0026amp;w=943\u0026amp;h=530\u0026amp;cquality=80\u0026amp;format=jpg\" media=\"(min-width: 376px)\"/\u003e\u003csource srcset=\"https://a.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0519%2Fdm_250519_clark_on_reese_hate_investigation%2Fdm_250519_clark_on_reese_hate_investigation.jpg\u0026amp;w=375\u0026amp;cquality=80, https://a.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0519%2Fdm_250519_clark_on_reese_hate_investigation%2Fdm_250519_clark_on_reese_hate_investigation.jpg\u0026amp;w=750\u0026amp;cquality=40\u0026amp;format=jpg 2x\" media=\"(max-width: 375px)\"/\u003e\u003c/picture\u003e\u003cp\u003e\u003cspan data-id=\"45229581\"\u003eplay\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eCaitlin Clark: \u0026#39;No place\u0026#39; for hate comments toward Angel Reese (0:31)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eCaitlin Clark voices her support for the WNBA investigation into hateful fan comments toward Angel Reese in the season opener between the Fever and Sky. (0:31)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/voepel_m.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eMichael Voepel\u003cspan\u003eMay 19, 2025, 07:09 PM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003eMichael Voepel is a senior writer who covers the WNBA, women\u0026#39;s college basketball and other college sports. Voepel began covering women\u0026#39;s basketball in 1984, and has been with ESPN since 1996.\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eINDIANAPOLIS -- \u003ca data-clubhouse-guid=\"bfef1bdd-c2d1-310d-dd9f-645b90575da9\" href=\"https://www.espn.com/wnba/team/_/name/ind/indiana-fever\"\u003eIndiana Fever\u003c/a\u003e players spoke Monday after practice about the WNBA investigating allegations of \u0026#34;hateful fan comments\u0026#34; toward \u003ca data-clubhouse-guid=\"3b4b0e25-5d0c-1ce2-ab25-580273be43e4\" href=\"https://www.espn.com/wnba/team/_/name/chi/chicago-sky\"\u003eChicago Sky\u003c/a\u003e player \u003ca data-player-guid=\"198d799e-9709-3062-8402-34f309bf151e\" href=\"https://www.espn.com/wnba/player/_/id/4433402/angel-reese\"\u003eAngel Reese\u003c/a\u003e during Saturday\u0026#39;s season opener for the teams.\u003c/p\u003e\u003cp\u003eNo one on the Fever said they heard anything specific from the sellout crowd during Indiana\u0026#39;s \u003ca href=\"https://www.espn.com/wnba/boxscore/_/gameId/401736115\"\u003e93-58\u003c/a\u003e victory. But they added that they understood the need for an investigation.\u003c/p\u003e\u003cp\u003e\u0026#34;There\u0026#39;s no place for that in our game, there\u0026#39;s no place for that in society,\u0026#34; Fever guard \u003ca data-player-guid=\"5ec40e1c-3104-322e-b80f-f358ea26aad4\" href=\"https://www.espn.com/wnba/player/_/id/4433403/caitlin-clark\"\u003eCaitlin Clark\u003c/a\u003e said. \u0026#34;Certainly, we want every person who comes into our arena -- whether player or fan -- to have a great experience. I appreciate the league doing that [investigation]. I appreciate that the Fever organization has been at the forefront of that.\u0026#34;\u003c/p\u003e\u003cp\u003eSocial media posts during Saturday\u0026#39;s game said hateful remarks or noises were made toward Reese after a third-quarter incident involving her and Clark. Clark fouled Reese to prevent an open layup attempt. Reese objected to the foul and tried to confront Clark, but Indiana\u0026#39;s \u003ca data-player-guid=\"bcc663d0-9e0f-34d5-8298-d1922f84e7d2\" href=\"https://www.espn.com/wnba/player/_/id/4432831/aliyah-boston\"\u003eAliyah Boston\u003c/a\u003e kept the players apart.\u003c/p\u003e\u003cp\u003eClark\u0026#39;s foul was upgraded to a flagrant foul 1, and both Reese and Boston received technical fouls. Boston was stunned when told after the game that she had received a technical despite being the player who quickly defused the situation.\u003c/p\u003e\u003cp\u003eOn Monday, Boston said it was important for players to keep reiterating the message that fans need to maintain decorum while still enjoying the game.\u003c/p\u003e\u003cp\u003e\u0026#34;No type of hate is ever welcomed here,\u0026#34; Boston said. \u0026#34;As a player you just have to stay strong and be able to call it out if something happens.\u003c/p\u003e\u003cp\u003e\u0026#34;We, as athletes, have to make sure that fans know it\u0026#39;s OK to be passionate, to cheer us on, to get loud. But at the end of the day, it\u0026#39;s about respect. If it was your daughter out on the court, you would want that respect being shown. That has to be the mindset for every fan when they step into an arena.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ca data-player-guid=\"74bfe609-0fcb-e955-df3e-e206e06a3a6a\" href=\"https://www.espn.com/wnba/player/_/id/869/dewanna-bonner\"\u003eDeWanna Bonner\u003c/a\u003e, in her 16th season in the WNBA but first with the Fever, said that the team briefly discussed the situation and that everyone was on the same page.\u003c/p\u003e\u003cp\u003e\u0026#34;We keep uplifting each other and speaking out on these things when that is needed,\u0026#34; Bonner said. \u0026#34;That\u0026#39;s not what we as players stand for, not what the Indiana Fever organization stands for. It\u0026#39;s zero tolerance.\u003c/p\u003e\u003cp\u003e\u0026#34;Of course, we want a tough environment for opposing teams to play in. But a basketball environment where people can still just enjoy the game.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Fever next play Tuesday against the visiting \u003ca data-clubhouse-guid=\"bceea196-4263-d338-17a7-9ae40f3aed3f\" href=\"https://www.espn.com/wnba/team/_/name/atl/atlanta-dream\"\u003eAtlanta Dream\u003c/a\u003e at Gainbridge Fieldhouse.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-19T23:09:00Z",
  "modifiedTime": null
}
