{
  "id": "74fdab3e-bc24-4c5d-a557-afa91570fd5d",
  "title": "Villa make refereeing complaint after missing out on Champions League",
  "link": "https://www.bbc.com/sport/football/articles/cp85wj92yg8o",
  "description": "Aston Villa have made an official complaint after a \"big mistake\" by referee Thomas Bramall during a 2-0 loss at Manchester United.",
  "author": "",
  "published": "Sun, 25 May 2025 22:22:28 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Michael Emons, Kieran Maguire, Nick Mashiter",
  "length": 9012,
  "excerpt": "Aston Villa have made an official complaint after a \"big mistake\" by referee Thomas Bramall during a 2-0 loss at Manchester United.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Villa issue complaint after refereeing 'big mistake'Media caption, 'The ref's blown too early' - How error may have cost Villa Champions League footballAston Villa have complained to referees' body Professional Game Match Officials Limited after a \"big mistake\" by official Thomas Bramall contributed to them losing 2-0 at Manchester United and missing out on the Champions League.With the match goalless and Villa down to 10 men after goalkeeper Emiliano Martinez was correctly sent off, the visitors thought Morgan Rogers had given them the lead.Rogers nudged the ball away from United goalkeeper Altay Bayindir as he attempted to gather and slotted home.However, Bramall blew for a foul, thinking Bayindir had two hands on the ball, though television footage showed otherwise.Because Bramall stopped play before the ball entered the net, the video assistant referee (VAR) could not intervene.Moments later, Amad Diallo headed United in front - and Christian Eriksen's late penalty condemned Villa to a defeat that meant they finished sixth and missed out on Champions League football on goal difference.In Villa's post-match news conference, director of football operations Damian Vidagany said the club were unhappy 35-year-old Bramall had been given such an important game.\"We are going to send a complaint,\" said Vidagany. \"The complaint is not about the decision, it is about the selection of the referee - one of the most inexperienced referees in the Premier League.\"It's not about the decision, clearly it was a mistake. The complaint is about the referee. The problem is why the international referees were not here today.\"Media caption, 'We have to accept the mistake of the referees'It was initially indicated that Villa would complain to the Premier League, but they later said they had written to PGMOL.Villa stated their belief a \"more experienced referee\" should have been appointed to a game \"with such high stakes\".\"Of the 10 referees to officiate across the Premier League today, Mr Bramall was the second least experienced,\" the club said.\"The decision to disallow Morgan Rogers' goal, which would have given the club a 1-0 lead with 17 minutes remaining in the match, was a major contributing factor to the club not qualifying for the Champions League.\"We acknowledge the outcome will not change, but we believe it is important to address the selection methodology to ensure high-stakes matches are treated as such with regards to officiating and to ensure the implemented VAR technology is allowed to be effective.\"Bramall first refereed in the Premier League in August 2022 and his games this season have largely been in either the top flight or the second tier, with 11 in the Premier League and 12 in the Championship.Villa manager Unai Emery was visibly furious with the decision to disallow Rogers' goal - and award United their late penalty.Speaking after the game, he said: \"The TV is clear but, of course, we have to accept it. It was a mistake. A big mistake.\"PGMOL - the body responsible for refereeing games in English professional football - declined to comment.'It's so, so hard to take' - McGinn on 'costly' error So, what do the Football Association (FA) laws say?Law 5 states: \"The referee may be assisted by a video assistant referee only in the event of a 'clear and obvious error' or 'serious missed incident' in relation to: goal/no goal, penalty/no penalty, direct red card (not second caution), mistaken identity when the referee cautions or sends off the wrong player of the offending team.\"A message on social media from the Premier League match centre read: \"The referee's call was a free-kick to Manchester United with Bayindir deemed to be in control of the ball before Rogers gained possession.\"The whistle was blown by the referee before the ball entered the goal, therefore the incident was not reviewable by the VAR.\"Villa captain John McGinn, speaking to TNT Sports, admitted United deserved to win but said the decision to not give the goal was \"incredible\".He added: \"Everyone wanted the correct decisions when the VAR was implemented. You watch rugby... even if the referee has awarded a try and it's wrong, it's overturned.\"It's so, so hard to take, especially when the impact it has on us - as a club and a team - is so big. If you were 1-0 up at that point and all you need is a point to get to the Champions League, it's costly.\"The referee didn't really know what to say. He is a young referee who has progressed very quickly. Maybe we could look at having more experienced referees.\"Law 12 states a goalkeeper is considered to be in control of the ball with the hand when:The ball is between the hands or between the hand and any surface or by touching it with any part of the hands or arms, except if the ball rebounds from the goalkeeper or the goalkeeper has made a saveHolding the ball in the outstretched open handBouncing it on the ground or throwing it in the airBBC Match of the Day pundits Alan Shearer and Micah Richards were in agreement with Aston Villa, that Bayindir was not in control of the ball.Former England striker Shearer said: \"You would be absolutely raging if you were Aston Villa and rightly so. \"It is an error and the referee has blown too early so VAR can't intervene. A huge error when you look at the ramifications. \"The keeper makes a mess of it, never has control of the ball. Morgan Rogers has every right to get the ball. I understand the anger, I really do.\"Former Manchester City defender Richards added: \"It is a howler. If you look, he is not in control of the ball. The referee has made a mistake and it should have been a goal.\"He has made a mistake, as simple as that, and the problem was because the ref blew too early he couldn't go to VAR. \"For Aston Villa to be so close, it is just not good enough. Referees make mistakes, we know they do, but he just needed to calm down.\"Image source, Getty ImagesImage caption, Emery approached Bramall as he left the field at the end of the gameHow costly will not making the Champions League be?Kieran MaguireFootball finance expertVilla were probably the club in greatest need of qualify for the Champions League next season because they have made the second highest losses in Premier League history (£678m) - only exceeded by Chelsea (£1.257bn).While Villa will have earned record revenues in 2024-25 (after revenue of £276m in 2023-24), they are still substantially behind the 'Big Six' - Manchester City, Manchester United, Arsenal, Liverpool, Tottenham and Chelsea - the clubs their owners want to challenge for Champions League places on a regular basis.Since being promoted to the Premier League in 2019, Villa - under new owners Wes Edens and Nas Sawiris - have been one of the bigger spenders in terms of transfer fees - investing more than £868m on players. The owners have backed a series of managers - Steve Bruce, Dean Smith, Steven Gerrard and Unai Emery - but at a significant cost.The good news for Villa fans is the funding for the transfers has come from the owners' pockets in the form of shares, instead of borrowing and incurring interest costs.A lot of the transfers have been on credit terms which, while not unusual in the Premier League, means Villa owe more than £150m in previous purchases. Champions League qualification would have helped the club deal with the cash requirements in respect of some of these former player purchases.Villa have only managed to break even once in the past 15 years, and that was solely because of the sale of Jack Grealish. Former owners Randy Lerner and Tony Xia both walked away from the club having lost over £100m.Which players might Villa struggle to keep hold of?Nick MashiterBBC Sport football news reporter Villa's wages-to-revenue ratio last year was 96% and only the last-gasp £42m sale of Douglas Luiz to Juventus ensured they would comply with financial regulations.Champions League football was again crucial to Villa's immediate financial future this year, with the revenue in that competition four times as much as the Europa League.It is therefore likely sales will be needed this summer, but who could go?Martinez's emotional reaction at the end of Villa's final home game of the season suggested he feels his time at the club is over.Forward Leon Bailey is a likely departure, but academy graduate Jacob Ramsey would generate the most profit if Villa need to claw back cash before the 30 June accounting deadline.Villa have a £40m option to turn Marcus Rashford's loan from Manchester United permanent but it is difficult to see that happening in the Europa League. Barcelona have publicly stated their interest in the England international, and while Rashford has enjoyed his time at Villa, there have been no talks over a permanent deal and a move to Spain would be difficult to resist.Real Madrid loanee Marco Asensio has made a bigger impact, and reports have suggested talks over a move from PSG have begun. A place in the Champions League would have helped that.More on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a82/live/85b19870-399e-11f0-8947-7d6241f9fce9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eVilla issue complaint after refereeing \u0026#39;big mistake\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;The ref\u0026#39;s blown too early\u0026#39; - How error may have cost Villa Champions League football\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAston Villa have complained to referees\u0026#39; body Professional Game Match Officials Limited after a \u0026#34;big mistake\u0026#34; by official Thomas Bramall contributed to them\u003c/b\u003e\u003ca href=\"https://www.bbc.com/sport/football/live/cvgvvkegl42t\"\u003e\u003cb\u003e losing 2-0 at Manchester United\u003c/b\u003e\u003c/a\u003e\u003cb\u003e and missing out on the Champions League.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eWith the match goalless and Villa down to 10 men after goalkeeper Emiliano Martinez was correctly sent off, the visitors thought Morgan Rogers had given them the lead.\u003c/p\u003e\u003cp\u003eRogers nudged the ball away from United goalkeeper Altay Bayindir as he attempted to gather and slotted home.\u003c/p\u003e\u003cp\u003eHowever, Bramall blew for a foul, thinking Bayindir had two hands on the ball, though television footage showed otherwise.\u003c/p\u003e\u003cp\u003eBecause Bramall stopped play before the ball entered the net, the video assistant referee (VAR) could not intervene.\u003c/p\u003e\u003cp\u003eMoments later, Amad Diallo headed United in front - and Christian Eriksen\u0026#39;s late penalty condemned Villa to a defeat that meant they finished sixth and missed out on Champions League football on goal difference.\u003c/p\u003e\u003cp\u003eIn Villa\u0026#39;s post-match news conference, director of football operations Damian Vidagany said the club were unhappy 35-year-old Bramall had been given such an important game.\u003c/p\u003e\u003cp\u003e\u0026#34;We are going to send a complaint,\u0026#34; said Vidagany. \u0026#34;The complaint is not about the decision, it is about the selection of the referee - one of the most inexperienced referees in the Premier League.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s not about the decision, clearly it was a mistake. The complaint is about the referee. The problem is why the international referees were not here today.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;We have to accept the mistake of the referees\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIt was initially indicated that Villa would complain to the Premier League, but they  later said they had written to PGMOL.\u003c/p\u003e\u003cp\u003eVilla stated their belief a \u0026#34;more experienced referee\u0026#34; should have been appointed to a game \u0026#34;with such high stakes\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Of the 10 referees to officiate across the Premier League today, Mr Bramall was the second least experienced,\u0026#34; the club said.\u003c/p\u003e\u003cp\u003e\u0026#34;The decision to disallow Morgan Rogers\u0026#39; goal, which would have given the club a 1-0 lead with 17 minutes remaining in the match, was a major contributing factor to the club not qualifying for the Champions League.\u003c/p\u003e\u003cp\u003e\u0026#34;We acknowledge the outcome will not change, but we believe it is important to address the selection methodology to ensure high-stakes matches are treated as such with regards to officiating and to ensure the implemented VAR technology is allowed to be effective.\u0026#34;\u003c/p\u003e\u003cp\u003eBramall first refereed in the Premier League in August 2022 and his games this season have largely been in either the top flight or the second tier, with 11 in the Premier League and 12 in the Championship.\u003c/p\u003e\u003cp\u003eVilla manager Unai Emery was visibly furious with the decision to disallow Rogers\u0026#39; goal - and award United their late penalty.\u003c/p\u003e\u003cp\u003eSpeaking after the game, he said: \u0026#34;The TV is clear but, of course, we have to accept it. It was a mistake. A big mistake.\u0026#34;\u003c/p\u003e\u003cp\u003ePGMOL - the body responsible for refereeing games in English professional football - declined to comment.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Its-so-so-hard-to-take-McGinn-on-costly-error-\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;It\u0026#39;s so, so hard to take\u0026#39; - McGinn on \u0026#39;costly\u0026#39; error \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSo, what do the Football Association (FA) laws say?\u003c/p\u003e\u003cp\u003eLaw 5 states: \u0026#34;The referee may be assisted by a video assistant referee only in the event of a \u0026#39;clear and obvious error\u0026#39; or \u0026#39;serious missed incident\u0026#39; in relation to: goal/no goal, penalty/no penalty, direct red card (not second caution), mistaken identity when the referee cautions or sends off the wrong player of the offending team.\u0026#34;\u003c/p\u003e\u003cp\u003eA message on social media from the Premier League match centre read: \u0026#34;The referee\u0026#39;s call was a free-kick to Manchester United with Bayindir deemed to be in control of the ball before Rogers gained possession.\u003c/p\u003e\u003cp\u003e\u0026#34;The whistle was blown by the referee before the ball entered the goal, therefore the incident was not reviewable by the VAR.\u0026#34;\u003c/p\u003e\u003cp\u003eVilla captain John McGinn, speaking to TNT Sports, admitted United deserved to win but said the decision to not give the goal was \u0026#34;incredible\u0026#34;.\u003c/p\u003e\u003cp\u003eHe added: \u0026#34;Everyone wanted the correct decisions when the VAR was implemented. You watch rugby... even if the referee has awarded a try and it\u0026#39;s wrong, it\u0026#39;s overturned.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s so, so hard to take, especially when the impact it has on us - as a club and a team - is so big. If you were 1-0 up at that point and all you need is a point to get to the Champions League, it\u0026#39;s costly.\u003c/p\u003e\u003cp\u003e\u0026#34;The referee didn\u0026#39;t really know what to say. He is a young referee who has progressed very quickly. Maybe we could look at having more experienced referees.\u0026#34;\u003c/p\u003e\u003cp\u003eLaw 12 states a goalkeeper is considered to be in control of the ball with the hand when:\u003c/p\u003e\u003cdiv\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003cp\u003eThe ball is between the hands or between the hand and any surface or by touching it with any part of the hands or arms, except if the ball rebounds from the goalkeeper or the goalkeeper has made a save\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHolding the ball in the outstretched open hand\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eBouncing it on the ground or throwing it in the air\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eBBC Match of the Day pundits Alan Shearer and Micah Richards were in agreement with Aston Villa, that Bayindir was not in control of the ball.\u003c/p\u003e\u003cp\u003eFormer England striker Shearer said: \u0026#34;You would be absolutely raging if you were Aston Villa and rightly so. \u003c/p\u003e\u003cp\u003e\u0026#34;It is an error and the referee has blown too early so VAR can\u0026#39;t intervene. A huge error when you look at the ramifications. \u003c/p\u003e\u003cp\u003e\u0026#34;The keeper makes a mess of it, never has control of the ball. Morgan Rogers has every right to get the ball. I understand the anger, I really do.\u0026#34;\u003c/p\u003e\u003cp\u003eFormer Manchester City defender Richards added: \u0026#34;It is a howler. If you look, he is not in control of the ball. The referee has made a mistake and it should have been a goal.\u003c/p\u003e\u003cp\u003e\u0026#34;He has made a mistake, as simple as that, and the problem was because the ref blew too early he couldn\u0026#39;t go to VAR. \u003c/p\u003e\u003cp\u003e\u0026#34;For Aston Villa to be so close, it is just not good enough. Referees make mistakes, we know they do, but he just needed to calm down.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg.webp 624w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Unai Emery\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/674/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/9b32/live/29884970-39a5-11f0-8947-7d6241f9fce9.jpg 624w\" width=\"674\" height=\"380\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eEmery approached Bramall as he left the field at the end of the game\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"How-costly-will-not-making-the-Champions-League-be\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHow costly will not making the Champions League be?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"sub-byline-block\"\u003e\u003cp\u003eKieran Maguire\u003c/p\u003e\u003cp\u003eFootball finance expert\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVilla were probably the club in greatest need of qualify for the Champions League next season because they have made the second highest losses in Premier League history (£678m) - only exceeded by Chelsea (£1.257bn).\u003c/p\u003e\u003cp\u003eWhile Villa will have earned record revenues in 2024-25 (after revenue of £276m in 2023-24), they are still substantially behind the \u0026#39;Big Six\u0026#39; - Manchester City, Manchester United, Arsenal, Liverpool, Tottenham and Chelsea - the clubs their owners want to challenge for Champions League places on a regular basis.\u003c/p\u003e\u003cp\u003eSince being promoted to the Premier League in 2019, Villa - under new owners Wes Edens and Nas Sawiris - have been one of the bigger spenders in terms of transfer fees - investing more than £868m on players. The owners have backed a series of managers - Steve Bruce, Dean Smith, Steven Gerrard and Unai Emery - but at a significant cost.\u003c/p\u003e\u003cp\u003eThe good news for Villa fans is the funding for the transfers has come from the owners\u0026#39; pockets in the form of shares, instead of borrowing and incurring interest costs.\u003c/p\u003e\u003cp\u003eA lot of the transfers have been on credit terms which, while not unusual in the Premier League, means Villa owe more than £150m in previous purchases. Champions League qualification would have helped the club deal with the cash requirements in respect of some of these former player purchases.\u003c/p\u003e\u003cp\u003eVilla have only managed to break even once in the past 15 years, and that was solely because of the sale of Jack Grealish. Former owners Randy Lerner and Tony Xia both walked away from the club having lost over £100m.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Which-players-might-Villa-struggle-to-keep-hold-of\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhich players might Villa struggle to keep hold of?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"sub-byline-block\"\u003e\u003cp\u003eNick Mashiter\u003c/p\u003e\u003cp\u003eBBC Sport football news reporter \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVilla\u0026#39;s wages-to-revenue ratio last year was 96% and only the last-gasp \u003ca href=\"https://www.bbc.com/sport/football/articles/cd19nn3dgzno\"\u003e£42m sale of Douglas Luiz to Juventus\u003c/a\u003e ensured they would comply with financial regulations.\u003c/p\u003e\u003cp\u003eChampions League football was again crucial to Villa\u0026#39;s immediate financial future this year, with the revenue in that competition four times as much as the Europa League.\u003c/p\u003e\u003cp\u003eIt is therefore likely sales will be needed this summer, but who could go?\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.com/sport/football/articles/c861pwl9g64o\"\u003eMartinez\u0026#39;s emotional reaction\u003c/a\u003e at the end of Villa\u0026#39;s final home game of the season suggested he feels his time at the club is over.\u003c/p\u003e\u003cp\u003eForward Leon Bailey is a likely departure, but academy graduate Jacob Ramsey would generate the most profit if Villa need to claw back cash before the 30 June accounting deadline.\u003c/p\u003e\u003cp\u003eVilla have a £40m option to turn \u003ca href=\"https://www.bbc.com/sport/football/articles/cjdejvxvk29o\"\u003eMarcus Rashford\u0026#39;s loan from Manchester United\u003c/a\u003e permanent but it is difficult to see that happening in the Europa League. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.com/sport/football/articles/c93ykkj827jo\"\u003eBarcelona have publicly stated their interest\u003c/a\u003e in the England international, and while Rashford has enjoyed his time at Villa, there have been no talks over a permanent deal and a move to Spain would be difficult to resist.\u003c/p\u003e\u003cp\u003eReal Madrid loanee \u003ca href=\"https://www.bbc.com/sport/football/articles/cdxnz40exxpo\"\u003eMarco Asensio\u003c/a\u003e has made a bigger impact, and reports have suggested talks over a move from PSG have begun. A place in the Champions League would have helped that.\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-25T18:59:02.013Z",
  "modifiedTime": null
}
