{
  "id": "7aae0e35-b059-40f6-a896-162aeb05780f",
  "title": "Mahomes: Refs not giving favorable calls to Chiefs",
  "link": "https://www.espn.com/nfl/story/_/id/43523067/patrick-mahomes-disagrees-chiefs-getting-favorable-calls",
  "description": "Patrick Mahomes said the Chiefs aren't getting favorable treatment from officials, who are \"doing their best to call the game as fair and as proper as they possibly can.\"",
  "author": "Adam Teicher",
  "published": "Wed, 22 Jan 2025 18:21:13 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Adam Teicher",
  "length": 3787,
  "excerpt": "Patrick Mahomes said the Chiefs aren't getting favorable treatment from officials, who are \"doing their best to call the game as fair and as proper as they possibly can.\"",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Mahomes disagrees that refs give Chiefs favorable calls (0:43)Patrick Mahomes responds to a question on whether he thinks NFL referees treat the Chiefs more favorably than other teams. (0:43)Adam TeicherJan 22, 2025, 03:41 PM ETCloseCovered Chiefs for 20 seasons for Kansas City Star Joined ESPN in 2013KANSAS CITY, Mo. -- The Houston Texans might think Patrick Mahomes and the Kansas City Chiefs receive favorable calls from the game officials, but Mahomes doesn't agree.\"I don't feel that way,'' Mahomes said Wednesday as the Chiefs began preparations for Sunday's AFC Championship Game against the Buffalo Bills at Arrowhead Stadium. \"At the end of the day, the referees are doing their best to call the game as fair and as proper as they possibly can. And all you can do is go out there and play the game that you love as hard as you can and live with the results. ... I think that's what we preach here in Kansas City.\"You get new referees every year, you get new circumstances, and you never can really tell because every play's different and that's what makes the NFL so special. I feel like I've just continued to play the game, and I just try to win, and whatever happens kind of happens.''The Texans were twice penalized for hits against Mahomes in last week's divisional round game. Both happened on Chiefs scoring drives, with one being on third down to extend the drive.\"We knew it was going to be us versus the refs going into this game,\" Texans defensive end Will Anderson Jr. said after the 23-14 loss.Chiefs versus Bills has developed into one of the NFL's top rivalries. This will be the fourth time in five seasons that the teams have met in the playoffs and their second matchup in the AFC Championship Game. The Chiefs won the first three, but the Bills have won the regular-season matchup between the teams in each of the past four seasons.The Bills handed the Chiefs one of their two losses this season, winning 30-21 in Week 11 in Buffalo.\"It's just two really good football teams going up against each other,'' Mahomes said. \"They have great players at every level on both sides of the ball and they're well coached. And so, when you play great football teams like that, it kind of usually ends with that split type of deal there. We've been able to beat them in the playoffs and they've got us in the regular season. If you look at the games, every game's close, so it just comes out to a play here or there that makes an impact on the outcome.\"When you look at the great rivalries of the NFL, it comes with this. It comes with playing each other every year in the regular season and it comes with playing in the playoffs.''Mahomes and his Buffalo counterpart, Josh Allen, have had some classic duels. None was better than the divisional round game in 2021, when the quarterbacks combined for seven touchdown throws and more than 700 passing yards as the Chiefs won 42-36 in overtime to advance to the AFC Championship Game.\"I've played against Josh enough times to know that he's going to come out there and play great football, especially in those big moments,'' Mahomes said. \"I have to play my best football whenever I get the opportunity to and try to put our team in the best position to succeed. If that's limiting turnovers, if that's changing the field position, whatever that is, you have to find a way that day to win.\"Wide receiver Mecole Hardman, one of last year's playoff stars for the Chiefs as they won their second consecutive Super Bowl, will not get a chance for a repeat performance. Coach Andy Reid said Hardman, who has a knee injury, will not be activated off the injured reserve list, meaning his season is over.Hardman caught the winning touchdown in overtime in the Chiefs' Super Bowl LVIII win over the San Francisco 49ers last year.",
  "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0122%2Fr1441974_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-video=\"watch,640,360,43523670\" data-cerebro-id=\"679164016dbf784a05d76858\" data-title=\"Mahomes disagrees that refs give Chiefs favorable calls\" data-source=\"espn\"\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMahomes disagrees that refs give Chiefs favorable calls (0:43)\u003c/span\u003e\u003c/p\u003e\u003cp\u003ePatrick Mahomes responds to a question on whether he thinks NFL referees treat the Chiefs more favorably than other teams. (0:43)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/teicher_adam.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eAdam Teicher\u003cspan\u003eJan 22, 2025, 03:41 PM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eCovered Chiefs for 20 seasons for Kansas City Star\u003c/li\u003e\n\u003cli\u003eJoined ESPN in 2013\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eKANSAS CITY, Mo. -- The \u003ca data-clubhouse-guid=\"595690b3-2161-4913-a7a7-814af2fd2621\" href=\"https://www.espn.com/nfl/team/_/name/hou/houston-texans\"\u003eHouston Texans\u003c/a\u003e might think \u003ca data-player-guid=\"37d87523-280a-9d4a-0adb-22cfc6d3619c\" href=\"https://www.espn.com/nfl/player/_/id/3139477/patrick-mahomes\"\u003ePatrick Mahomes\u003c/a\u003e and the \u003ca data-clubhouse-guid=\"f68f2343-8ceb-7a02-740d-af6338be21d2\" href=\"https://www.espn.com/nfl/team/_/name/kc/kansas-city-chiefs\"\u003eKansas City Chiefs\u003c/a\u003e receive favorable calls from the game officials, but Mahomes doesn\u0026#39;t agree.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t feel that way,\u0026#39;\u0026#39; Mahomes said Wednesday as the Chiefs began preparations for Sunday\u0026#39;s AFC Championship Game against the \u003ca data-clubhouse-guid=\"232afaf2-01ac-fcc2-8bd6-66550df1703a\" href=\"https://www.espn.com/nfl/team/_/name/buf/buffalo-bills\"\u003eBuffalo Bills\u003c/a\u003e at Arrowhead Stadium. \u0026#34;At the end of the day, the referees are doing their best to call the game as fair and as proper as they possibly can. And all you can do is go out there and play the game that you love as hard as you can and live with the results. ... I think that\u0026#39;s what we preach here in Kansas City.\u003c/p\u003e\u003cp\u003e\u0026#34;You get new referees every year, you get new circumstances, and you never can really tell because every play\u0026#39;s different and that\u0026#39;s what makes the NFL so special. I feel like I\u0026#39;ve just continued to play the game, and I just try to win, and whatever happens kind of happens.\u0026#39;\u0026#39;\u003c/p\u003e\u003cp\u003eThe Texans were twice penalized for hits against Mahomes in last week\u0026#39;s divisional round game. Both happened on Chiefs scoring drives, with one being on third down to extend the drive.\u003c/p\u003e\u003cp\u003e\u0026#34;\u003ca href=\"https://www.espn.com/nfl/story/_/id/43472843/will-anderson-jr-irked-penalty-calls-texans-loss\"\u003eWe knew it was going to be us versus the refs\u003c/a\u003e going into this game,\u0026#34; Texans defensive end \u003ca data-player-guid=\"d08ac2e7-518c-3ca3-b3b8-9262906e6a27\" href=\"https://www.espn.com/nfl/player/_/id/4685724/will-anderson-jr\"\u003eWill Anderson Jr\u003c/a\u003e. said after the 23-14 loss.\u003c/p\u003e\u003cp\u003eChiefs versus Bills has developed into one of the NFL\u0026#39;s top rivalries. This will be the fourth time in five seasons that the teams have met in the playoffs and their second matchup in the AFC Championship Game. The Chiefs won the first three, but the Bills have won the regular-season matchup between the teams in each of the past four seasons.\u003c/p\u003e\u003cp\u003eThe Bills handed the Chiefs one of their two losses this season, winning 30-21 in Week 11 in Buffalo.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s just two really good football teams going up against each other,\u0026#39;\u0026#39; Mahomes said. \u0026#34;They have great players at every level on both sides of the ball and they\u0026#39;re well coached. And so, when you play great football teams like that, it kind of usually ends with that split type of deal there. We\u0026#39;ve been able to beat them in the playoffs and they\u0026#39;ve got us in the regular season. If you look at the games, every game\u0026#39;s close, so it just comes out to a play here or there that makes an impact on the outcome.\u003c/p\u003e\u003cp\u003e\u0026#34;When you look at the great rivalries of the NFL, it comes with this. It comes with playing each other every year in the regular season and it comes with playing in the playoffs.\u0026#39;\u0026#39;\u003c/p\u003e\u003cp\u003eMahomes and his Buffalo counterpart, \u003ca data-player-guid=\"237b9f2a-4701-8fc3-60eb-250978af9893\" href=\"https://www.espn.com/nfl/player/_/id/3918298/josh-allen\"\u003eJosh Allen\u003c/a\u003e, have had some classic duels. None was better than the divisional round game in 2021, when the quarterbacks combined for seven touchdown throws and more than 700 passing yards as the Chiefs won 42-36 in overtime to advance to the AFC Championship Game.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve played against Josh enough times to know that he\u0026#39;s going to come out there and play great football, especially in those big moments,\u0026#39;\u0026#39; Mahomes said. \u0026#34;I have to play my best football whenever I get the opportunity to and try to put our team in the best position to succeed. If that\u0026#39;s limiting turnovers, if that\u0026#39;s changing the field position, whatever that is, you have to find a way that day to win.\u0026#34;\u003c/p\u003e\u003cp\u003eWide receiver \u003ca data-player-guid=\"6189b3f7-b774-362d-ca5f-9edf211e55f9\" href=\"https://www.espn.com/nfl/player/_/id/4035004/mecole-hardman\"\u003eMecole Hardman\u003c/a\u003e, one of last year\u0026#39;s playoff stars for the Chiefs as they won their second consecutive Super Bowl, will not get a chance for a repeat performance. Coach Andy Reid said Hardman, who has a knee injury, will not be activated off the injured reserve list, meaning his season is over.\u003c/p\u003e\u003cp\u003eHardman caught the winning touchdown in overtime in the Chiefs\u0026#39; Super Bowl LVIII win over the \u003ca data-clubhouse-guid=\"985a261f-296c-c95c-32a5-addc4df75001\" href=\"https://www.espn.com/nfl/team/_/name/sf/san-francisco-49ers\"\u003eSan Francisco 49ers\u003c/a\u003e last year.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-22T20:41:00Z",
  "modifiedTime": null
}
