{
  "id": "7e7dae10-ab0a-481b-ac76-f604525d048d",
  "title": "Saints QB Derek Carr set to start vs. Panthers after missing 3 games with oblique injury",
  "link": "https://sports.yahoo.com/saints-qb-derek-carr-set-to-start-vs-panthers-after-missing-3-games-with-oblique-injury-233239165.html",
  "description": "Derek Carr went down with an oblique injury after taking a hard hit near the end of their loss to the Chiefs earlier this month.",
  "author": "Yahoo Sports",
  "published": "Wed, 30 Oct 2024 23:32:39 GMT",
  "source": "https://sports.yahoo.com/rss/",
  "categories": [
    "Sports"
  ],
  "byline": "Ryan Young",
  "length": 2462,
  "excerpt": "Derek Carr went down with an oblique injury after taking a hard hit near the end of their loss to the Chiefs earlier this month.",
  "siteName": "Yahoo Sports",
  "favicon": "",
  "text": "After missing three games with an oblique injury, Derek Carr is ready to make his return.The New Orleans Saints expect Carr to start on Sunday in their matchup with the Carolina Panthers, head coach Dennis Allen said on Wednesday. Jake Haener will serve as his backup despite the fact that rookie Spencer Rattler started the last several games in Carr’s absence.\"We felt like Rattler gave us the best chance at the time, and so I think we'll see where we're at come this weekend, what the expectation is. My expectation is that Derek's going to be ready to go,\" Allen said, via ESPN’s Katherine Terrell. \"In that case, Jake will be the backup ... I don't want to get into the specifics of the reasons why, but I feel like that's the best thing for our team.\"Carr went down in the Saints’ loss to the Kansas City Chiefs earlier this month after he took a hard hit near the end of that contest. He hasn’t played since, which marks the longest stretch of time he’s missed since he broke his ankle in 2017 when he was with the Raiders.The Saints, who started the season 2-0 with a pair of blowout wins, have not won a game since. Rattler led the Saints to a 51-27 loss to the Tampa Bay Buccaneers in his first start, and the Saints will enter Sunday’s contest in North Carolina on a six-game losing streak. It’s the longest losing streak the team has had since 2005.Carr has thrown for 989 yards with eight touchdowns and four interceptions while completing just better than 70% of his passes in five games this season, his second with the Saints.\"I am no savior. There's only been one of those and that is not me,\" Carr said. \"I am here to be a great leader and to be a great teammate and to do my job to the best of my ability. And do I feel confident in what I can do? Absolutely. I feel confident in what I can do. I feel confident in what I can bring to our team. And that's exciting, right? But to save us or anything like that, that's not me, I'm going to come in and do what my guys expect me to do. Bring energy, bring effort, be a great teammate. Encourage our guys, get everybody on the same page, lock in the details, hold each other accountable.\"The Panthers, on the other hand, hold a 1-7 record entering Sunday’s game. The Saints beat the Panthers 47-10 in Week 1, too. Carolina said on Wednesday that Bryce Young will start at quarterback again while veteran Andy Dalton continues to recover from a thumb injury he sustained in a car crash last week.",
  "image": "https://s.yimg.com/ny/api/res/1.2/ppFE1eVTYrcKMS4JB4jCiA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/fcaf89b0-9713-11ef-9a3e-9fcf9a5a72f7",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-wf-sticky-boundary=\"caas-body-section\" data-wf-sticky-offset=\"165px   10px\" data-wf-sticky-target=\".caas-share-buttons\"\u003e\u003cp\u003eAfter missing three games with an oblique injury, Derek Carr is ready to make his return.\u003c/p\u003e\u003cp\u003eThe New Orleans Saints expect Carr to start on Sunday in their matchup with the Carolina Panthers, head coach Dennis Allen said on Wednesday. Jake Haener will serve as his backup despite the fact that rookie Spencer Rattler started the last several games in Carr’s absence.\u003c/p\u003e\u003cdiv data-src=\"\"\u003e\u003cblockquote\u003e\u003cp\u003e\u0026#34;We felt like Rattler gave us the best chance at the time, and so I think we\u0026#39;ll see where we\u0026#39;re at come this weekend, what the expectation is. My expectation is that Derek\u0026#39;s going to be ready to go,\u0026#34; Allen said, \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.espn.com/nfl/story/_/id/42097499/saints-qb-derek-carr-expected-return-says-no-savior\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:via ESPN’s Katherine Terrell;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003evia ESPN’s Katherine Terrell\u003c/ins\u003e\u003c/a\u003e. \u0026#34;In that case, Jake will be the backup ... I don\u0026#39;t want to get into the specifics of the reasons why, but I feel like that\u0026#39;s the best thing for our team.\u0026#34;\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e\u003cp\u003e\u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/derek-carr-will-reportedly-miss-multiple-games-with-oblique-injury-saints-eyeing-spencer-rattler-as-replacement-211237568.html\" data-ylk=\"slk:Carr went down in the Saints’ loss to the Kansas City Chiefs;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cins\u003eCarr went down in the Saints’ loss to the Kansas City Chiefs\u003c/ins\u003e\u003c/a\u003e earlier this month after he took a hard hit near the end of that contest. He hasn’t played since, which marks the longest stretch of time he’s missed since he broke his ankle in 2017 when he was with the Raiders.\u003c/p\u003e\u003cp\u003eThe Saints, who started the season 2-0 with a pair of blowout wins, have not won a game since. Rattler led the Saints to a 51-27 loss to the Tampa Bay Buccaneers in his first start, and the Saints will enter Sunday’s contest in North Carolina on a six-game losing streak. It’s the longest losing streak the team has had since 2005.\u003c/p\u003e\u003cp\u003eCarr has thrown for 989 yards with eight touchdowns and four interceptions while completing just better than 70% of his passes in five games this season, his second with the Saints.\u003c/p\u003e\u003cdiv data-src=\"\"\u003e\u003cblockquote\u003e\u003cp\u003e\u0026#34;I am no savior. There\u0026#39;s only been one of those and that is not me,\u0026#34; Carr said. \u0026#34;I am here to be a great leader and to be a great teammate and to do my job to the best of my ability. And do I feel confident in what I can do? Absolutely. I feel confident in what I can do. I feel confident in what I can bring to our team. And that\u0026#39;s exciting, right? But to save us or anything like that, that\u0026#39;s not me, I\u0026#39;m going to come in and do what my guys expect me to do. Bring energy, bring effort, be a great teammate. Encourage our guys, get everybody on the same page, lock in the details, hold each other accountable.\u0026#34;\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e\u003cp\u003eThe Panthers, on the other hand, hold a 1-7 record entering Sunday’s game. The Saints beat the Panthers 47-10 in Week 1, too. Carolina said on Wednesday that \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/panthers-qb-bryce-young-to-start-vs-saints-as-andy-dalton-returns-to-practice-from-car-crash-thumb-injury-193927951.html\" data-ylk=\"slk:Bryce Young will start at quarterback again;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cins\u003eBryce Young will start at quarterback again\u003c/ins\u003e\u003c/a\u003e while veteran \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://sports.yahoo.com/panthers-qb-bryce-young-to-start-vs-saints-as-andy-dalton-returns-to-practice-from-car-crash-thumb-injury-193927951.html\" data-ylk=\"slk:Andy Dalton continues to recover from a thumb injury;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cins\u003eAndy Dalton continues to recover from a thumb injury\u003c/ins\u003e\u003c/a\u003e he sustained in a car crash last week.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-30T23:32:39Z",
  "modifiedTime": null
}
