{
  "id": "9cbc3a9a-c3b3-44b5-b171-385970e0eeac",
  "title": "Norris says he's 'not quite at Verstappen's level'",
  "link": "https://www.bbc.com/sport/formula1/articles/cp359d20zyyo",
  "description": "Lando Norris says he is \"not quite at the level\" of title rival Max Verstappen when it comes to race-craft.",
  "author": "",
  "published": "Thu, 24 Oct 2024 22:48:54 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Andrew Benson",
  "length": 4821,
  "excerpt": "Lando Norris says he is \"not quite at the level\" of title rival Max Verstappen when it comes to race-craft.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Lando Norris says he is \"not quite at the level\" of title rival Max Verstappen when it comes to race-craft.The Briton was controversially penalised at Sunday's United States Grand Prix, demoting him from third to fourth behind Verstappen, for overtaking off track.Norris said: \"Max is the best in the world in this style of defence and attacking. So I have to be at his level and at the moment I am not quite at the level I need to be at.\"It's a shame to say, but it's probably the truth. At the same time, it's a chance for me to learn and progress.\"However, Norris said he did not believe he deserved the penalty and Verstappen's driving in the incident was \"not how racing should be\".Norris was among a number of drivers who questioned Verstappen's approach to the corner, essentially saying it complied with the rules, but was not fair racing.But in response, Verstappen said: \"It's how the rules are written. I don't make the rules. I just follow the rules as much as I can. I just implement the rules and play with them.\"Seven-time champion Lewis Hamilton added: \"You shouldn't be able to come off the brakes and run more speed in and go off the track and still hold your place.\"The Mercedes driver felt a change had been needed for some time, and pointed out Verstappen had used the same tactic in their 2021 title fight.Hamilton's team-mate George Russell said he would ask the FIA whether, following a review, they believed Verstappen should have been penalised for his manoeuvre.\"In my view, he should have been penalised, therefore there isn't really a loophole,\" added the Briton. \"If they say he shouldn't have been, then he is exploiting a loophole.\"But he is in a title battle with Lando the same way as he was with Lewis and I don't think he would have done the same manoeuvre if it was any other driver, same as in Brazil 2021. It was a bit do or die, and he is happy to drive in that manner against his title rival, which I totally understand.\"Ferrari driver Charles Leclerc, who won the race in Austin, said Verstappen's defence of his position from Norris was \"a bit too extreme\".Leclerc added the Dutchman \"has always been on the limit of the regulations and sometimes it goes over a little, but that's what makes those fights exciting\".Many drivers want to talk to governing body, the FIA, at this weekend's Mexico City Grand Prix about F1's rules on racing.Verstappen used these to his advantage in Austin in a move at Turn 12 in which Norris was trying to overtake him around the outside.The rules say if the driver on the inside has his front axle ahead of the car outside him at the apex of the corner, he does not need to give his rival any room on the exit.But a number of drivers feel Verstappen is exploiting that rule by braking so late that he complies with the regulation, but then goes off the track himself.Another rule says drivers are not allowed to force a rival off the track, but this was not applied in this case.Several drivers feel defending in that way makes it almost impossible to overtake Verstappen.Norris, who is 57 points behind the three-time world champion with five races to go and 146 available, said: \"The fact of getting off the brakes just to be ahead at apex, no matter how wide you run on the exit, is incorrect and I don't believe that's how racing should be.\"So I think there are some tweaks [that need making]. But Max races hard, I expect that. I just don't think I was in the wrong last weekend. I don't believe either of us were necessarily in the wrong.\"It's not that I believe he should have got a penalty and I shouldn't. I don't believe either of us should have got a penalty.\"The stewards have a tough job because every race is different. You have to understand the driver's mindset. He has nothing to lose, I have a lot to lose. So he can afford to take bigger risks than I can and that's just the unfortunate position I'm in at the moment.\"Asked whether the rules give too much incentive to brake late and have the front axle ahead of a rival's when defending a corner on the inside in the way Verstappen did, Leclerc added: \"It's a very complex subject. I don't have the right answer here. Common sense has to be applied in certain situations.\"When a driver does that multiple times in the same way…we have to still create overtaking opportunities. What I have seen in Austin was maybe a bit too extreme.\"Williams driver Alex Albon felt there needed to be an addition to that specific rule that covers the scenario when both drivers go off track, as happened between Verstappen and Norris.\"It's tricky because he's still in control but he's still off the circuit,\" he said. \"So there probably needs to be some kind of sentence around, 'if you then end up going off the track yourself, there should be some kind of fall back or give back position'.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/22f6/live/8b2e5680-9255-11ef-9303-4f3343461132.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eLando Norris says he is \u0026#34;not quite at the level\u0026#34; of title rival Max Verstappen when it comes to race-craft.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Briton was \u003ca href=\"https://www.bbc.com/sport/formula1/articles/cvgl23y73v8o\"\u003econtroversially penalised\u003c/a\u003e at Sunday\u0026#39;s United States Grand Prix, demoting him from third to fourth behind Verstappen, for overtaking off track.\u003c/p\u003e\u003cp\u003eNorris said: \u0026#34;Max is the best in the world in this style of defence and attacking. So I have to be at his level and at the moment I am not quite at the level I need to be at.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a shame to say, but it\u0026#39;s probably the truth. At the same time, it\u0026#39;s a chance for me to learn and progress.\u0026#34;\u003c/p\u003e\u003cp\u003eHowever, Norris said he did not believe he deserved the penalty and Verstappen\u0026#39;s driving in the incident was \u0026#34;not how racing should be\u0026#34;.\u003c/p\u003e\u003cp\u003eNorris was among a number of drivers who questioned Verstappen\u0026#39;s approach to the corner, essentially saying it complied with the rules, but was not fair racing.\u003c/p\u003e\u003cp\u003eBut in response, Verstappen said: \u0026#34;It\u0026#39;s how the rules are written. I don\u0026#39;t make the rules. I just follow the rules as much as I can. I just implement the rules and play with them.\u0026#34;\u003c/p\u003e\u003cp\u003eSeven-time champion Lewis Hamilton added: \u0026#34;You shouldn\u0026#39;t be able to come off the brakes and run more speed in and go off the track and still hold your place.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Mercedes driver felt a change had been needed for some time, and pointed out Verstappen had used the same tactic in their 2021 title fight.\u003c/p\u003e\u003cp\u003eHamilton\u0026#39;s team-mate George Russell said he would ask the FIA whether, following a review, they believed Verstappen should have been penalised for his manoeuvre.\u003c/p\u003e\u003cp\u003e\u0026#34;In my view, he should have been penalised, therefore there isn\u0026#39;t really a loophole,\u0026#34; added the Briton. \u0026#34;If they say he shouldn\u0026#39;t have been, then he is exploiting a loophole.\u003c/p\u003e\u003cp\u003e\u0026#34;But he is in a title battle with Lando the same way as he was with Lewis and I don\u0026#39;t think he would have done the same manoeuvre if it was any other driver, same as in Brazil 2021. It was a bit do or die, and he is happy to drive in that manner against his title rival, which I totally understand.\u0026#34;\u003c/p\u003e\u003cp\u003eFerrari driver Charles Leclerc, who won the race in Austin, said Verstappen\u0026#39;s defence of his position from Norris was \u0026#34;a bit too extreme\u0026#34;.\u003c/p\u003e\u003cp\u003eLeclerc added the Dutchman \u0026#34;has always been on the limit of the regulations and sometimes it goes over a little, but that\u0026#39;s what makes those fights exciting\u0026#34;.\u003c/p\u003e\u003cp\u003eMany drivers want to talk to governing body, the FIA, at this weekend\u0026#39;s Mexico City Grand Prix about F1\u0026#39;s rules on racing.\u003c/p\u003e\u003cp\u003eVerstappen used these to his advantage in Austin in a move at Turn 12 in which Norris was trying to overtake him around the outside.\u003c/p\u003e\u003cp\u003eThe rules say if the driver on the inside has his front axle ahead of the car outside him at the apex of the corner, he does not need to give his rival any room on the exit.\u003c/p\u003e\u003cp\u003eBut a number of drivers feel Verstappen is exploiting that rule by braking so late that he complies with the regulation, but then goes off the track himself.\u003c/p\u003e\u003cp\u003eAnother rule says drivers are not allowed to force a rival off the track, but this was not applied in this case.\u003c/p\u003e\u003cp\u003eSeveral drivers feel defending in that way makes it almost impossible to overtake Verstappen.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eNorris, who is 57 points behind the three-time world champion with five races to go and 146 available, said: \u0026#34;The fact of getting off the brakes just to be ahead at apex, no matter how wide you run on the exit, is incorrect and I don\u0026#39;t believe that\u0026#39;s how racing should be.\u003c/p\u003e\u003cp\u003e\u0026#34;So I think there are some tweaks [that need making]. But Max races hard, I expect that. I just don\u0026#39;t think I was in the wrong last weekend. I don\u0026#39;t believe either of us were necessarily in the wrong.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s not that I believe he should have got a penalty and I shouldn\u0026#39;t. I don\u0026#39;t believe either of us should have got a penalty.\u003c/p\u003e\u003cp\u003e\u0026#34;The stewards have a tough job because every race is different. You have to understand the driver\u0026#39;s mindset. He has nothing to lose, I have a lot to lose. So he can afford to take bigger risks than I can and that\u0026#39;s just the unfortunate position I\u0026#39;m in at the moment.\u0026#34;\u003c/p\u003e\u003cp\u003eAsked whether the rules give too much incentive to brake late and have the front axle ahead of a rival\u0026#39;s when defending a corner on the inside in the way Verstappen did, Leclerc added: \u0026#34;It\u0026#39;s a very complex subject. I don\u0026#39;t have the right answer here. Common sense has to be applied in certain situations.\u003c/p\u003e\u003cp\u003e\u0026#34;When a driver does that multiple times in the same way…we have to still create overtaking opportunities. What I have seen in Austin was maybe a bit too extreme.\u0026#34;\u003c/p\u003e\u003cp\u003eWilliams driver Alex Albon felt there needed to be an addition to that specific rule that covers the scenario when both drivers go off track, as happened between Verstappen and Norris.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s tricky because he\u0026#39;s still in control but he\u0026#39;s still off the circuit,\u0026#34; he said. \u0026#34;So there probably needs to be some kind of sentence around, \u0026#39;if you then end up going off the track yourself, there should be some kind of fall back or give back position\u0026#39;.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-24T22:48:54.043Z",
  "modifiedTime": null
}
