{
  "id": "aed3f792-ce23-45fe-9e59-42ef0d773785",
  "title": "3 Week 17 games that will determine fantasy football championships",
  "link": "https://sports.yahoo.com/3-week-17-games-that-will-determine-fantasy-football-championships-150317756.html",
  "description": "With fantasy football championships on the line in most leagues, Matt Harmon outlines the three matchups most likely to determine winners and losers.",
  "author": "Yahoo Sports",
  "published": "Fri, 27 Dec 2024 15:03:17 GMT",
  "source": "https://sports.yahoo.com/rss/",
  "categories": [
    "Sports"
  ],
  "byline": "Matt Harmon",
  "length": 10354,
  "excerpt": "With fantasy football championships on the line in most leagues, Matt Harmon outlines the three matchups most likely to determine winners and losers.",
  "siteName": "Yahoo Sports",
  "favicon": "",
  "text": "Atlanta Falcons at Washington CommandersWhen the Falcons have the ball: The focus will once again be on Michael Penix Jr. one week after he started his first NFL game. The competition could almost not have been any easier than drawing the Giants but I’d say Penix largely passed his initial test. The rookie was pressured on nearly 50% of his dropbacks last week, but didn’t put the ball in harm's way and took zero sacks. The ball came out of his hands well, and he didn’t make classic rookie errors. You also saw his arm strength right away, as Penix was able to drive the ball from the far hash on deep out routes to the field.The ability to make those throws is key for Darnell Mooney, who has run those routes for this offense all season. He’s back on the high-end WR3 radar with Penix under center, especially as this game could get high-scoring. The rookie quarterback also showed a nice connection with Drake London before the wideout left the game early with an injury. It sounds like London will be able to play in this game, and we should expect him to get a significant workload. London has been a key chain-mover on slot routes against man coverage for the new Falcons offense. The Commanders play man at the fifth-highest rate on third and fourth down this season.Bijan Robinson is one of the five best backs in the league right now, so the following isn't exactly a piping hot take, but I anticipate him being a huge title-game swinger. Robinson touched the ball 24 times in Penix’s first start as the engine of the offense. According to Fantasy Points Data, Washington has allowed the ninth-highest success rate on zone runs this season, which is the meat and potatoes of the Atlanta run game. He should be able to keep the offense on schedule and rip off big plays in Week 17.When the Commanders have the ball: We are dealing with hyper-small sample sizes here but the Falcons defense has been on a weird mini-heater lately. Since Week 14, Atlanta has ranked sixth in EPA per play since Week 14. They’ve caused chaos and created big plays on defense. They’ve also played Desmond Ridder and Drew Lock in that stretch. That might have something to do with this recent surge. The Washington Commanders offense will provide a much more difficult test.Last week, Washington reminded us why it is still such a dangerous offense. Going against one of the premier defenses in the league, you can’t say that Jayden Daniels and the offense were mistake-free, but they made big plays to offset the errors and eventually won the contest. Hunting downfield on outside-the-numbers vertical routes will be key once again this week. Per NFL Pro, Jayden Daniels and Terry McLaurin (140.0) have the highest passer rating among quarterback and pass-catcher duos since Tom Brady and Rob Gronkowski with the Patriots in 2012 (140.1). Atlanta is vulnerable to the exact plays this duo has been so excellent at creating in 2024.It’ll be interesting to see if Washington can get its run game going again, after a nightmare outing from Brian Robinson Jr. last week. On balance, the Falcons rush defense has been a problem, ranking 25th in success rate allowed. It’ll help to create a more stable offense if Robinson can get rolling early.Green Bay Packers at Minnesota VikingsWhen the Packers have the ball: Nothing will come easy for the Packers in this matchup, as Minnesota is one of the most dangerous defenses in the league. Jordan Love posted big numbers in a negative game script last time these two teams faced off but so much has changed since then that it’s not overly instructive.The most significant difference between the Packers then and now is their intense commitment to the ground game. The Packers are among the bottom teams in neutral pass rate in the back half of the season and no one can blame them for it. Josh Jacobs and a conceptually diverse run game have been every bit of good enough to be the engine of this passing attack. The Vikings' run defense has been a tough unit to go against, ranking third in success rate allowed on the season. However, given the team’s deserved commitment to Jacobs as they try to keep Love out of long down-and-distance blitz situations, we should still expect the RB1 to get the ball 20-plus times on the ground.In the passing game, it looks like the Packers may be without Christian Watson on Sunday. If Watson misses the game, it will create the target concentration fantasy gamers will need to get Jayden Reed closer to the circle of trust. Per Fantasy Points Data, the Vikings play two-high coverage at the second-highest rate on late downs. When the Packers face two-high, Reed has 24% of the team yardage and 2.26 yards per route run. Those plays bring his layup route running and yards-after-the-catch skills into focus.He won’t get the same level of volume but Tucker Kraft is another name to watch. He’s second to Reed in YAC when facing two-high this season because he’s been an answer for Love out in the flat when he gets pressured.When the Vikings have the ball: The Vikings defense isn’t the only quality stop unit in this matchup. Green Bay ranks third in EPA per play allowed since Week 10. It's had some layup matchups in the mix lately, but this is an overall sound defense that’s settling into a well-designed system under Jeff Hafley. This will be one of their biggest tests as the Vikings' passing game is cooking.Sam Darnold has thrown 15 touchdowns to just one pick since Week 11. He’s been exceptionally clean, even when playing under duress. The Vikings are littered with playmakers and Kevin O’Connell is one of the top offensive minds in the league but they have injuries up on the offensive line. That hasn’t bothered Darnold. Since Week 11, he has a near-equal passer rating when under pressure (110.6) compared to when he’s kept clean (115.0), per Pro Football Focus. Considering how Darnold’s career has played out, that is just so huge. It’ll be even more critical since Green Bay has really cranked up their blitz concepts.We know what Justin Jefferson brings to the table but getting Jordan Addison going has been a huge boost for this offense down the stretch. Fantasy managers should feel confident that Addison can get rolling again in this matchup. He’s typically been the Vikings' answer in pre-snap single coverage looks that turn into zones post-snap. The Packers are 11th in zone coverage rate on late downs, where we usually see more man. Addison should find plenty of the looks against which he typically thrives.Denver Broncos at Cincinnati BengalsWhen the Broncos have the ball: The Broncos are in the driver’s seat for the AFC’s final playoff spot if they win this game. If Denver lets it slip, things get a little interesting for current 7-8 teams like Indianapolis, Miami and this Bengals team on the other side.The Broncos have to control the action in this contest and they're facing the right opposition for it. The Bengals defense had some great moments last week against the Browns but that team is not running a real offense under Dorian Thompson-Robinson. For most of the season, this Cincinnati defense has been a complete mess. Sean Payton’s Broncos offense has been extremely well-designed and takes advantage of the middle of the field. The Bengals' defense is weak down the spine of the defense with personnel departures and draft misses at linebacker and safety.Subscribe to Yahoo Fantasy Forecast on Apple Podcasts, Spotify, YouTube or wherever you listen.The only thing that gives me some pause is that we’re in the middle of an erratic stretch of Bo Nix games. Nix is 24th in EPA per play the last three weeks since returning from the bye. That includes that electric Monday Night Football win over the Browns where both Nix and Jameis Winston were letting their freak flags fly on downfield throws.Lately, Nix has had a bad case of happy feet under pressure. Payton has responded by trying to take the air out of the ball and giving the rookie good answers on check-down passes. He’s averaged 5.3 and 2.9 air yards per attempt the last two games. Nix has been accurate and decisive on those check-downs, and last week was a good example of how the passing offense can still be productive when he gets to those plays. However, if the Broncos are going to hang with the Bengals, they will need Nix to settle in the pocket and push the ball over the middle to Courtland Sutton and co.The matchup is right for him to do just that.When the Bengals have the ball: The matchup is the exact opposite on the other side of the ball. The Broncos defense is No. 1 in EPA per play allowed this season and is at full health right now with corner Riley Moss back in the fold. Meanwhile, the Bengals offense is firmly in the circle of trust and may own a top-three spot in those rankings.Joe Burrow has been one of the best quarterbacks in the league this season. It’s not his fault this team sits below .500 and could miss the playoffs. The Bengals offense basically doesn’t miss. We’re even to the point where Chase Brown is a can’t-miss running back. He is a much-improved runner this season who has created a big-play element that hasn’t been present in the Bengals backfield for quite some time. He’s also an ideal layup target on check-downs and designer backfield routes for Burrow. That helps him reach a high statistical ceiling every week, even when the run-defense matchup is difficult, as it is this week.The No. 1 individual faceoff of note will be Patrick Surtain II in coverage. Tee Higgins is questionable with ankle/knee injuries and isn't a lock to play this week. We’ve seen that none of the depth wide receivers like Andre Iosivas or Jermaine Burton get a consequential boost when Higgins misses. Just expect to see more of Ja’Marr Chase, who has the kind of usage that will get him away from Surtain. We typically don’t see the All-Pro cornerback travel into the slot (6% of pass routes, per PFF) but the Bengals have used Chase inside on a career-high 34% of his routes this season. That will be a little more complicated to sprinkle in if Higgins misses and makes the outside wide receiver options weaker but Cincy has been intentional about Chase’s slot targets even when his running mate misses time.It only takes a small handful of plays away from Surtain to make a wide receiver’s week, as Jerry Jeudy showed us not long ago.",
  "image": "https://s.yimg.com/ny/api/res/1.2/cgqr.Bd.zV4q4MfuFxBA3w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-12/2f98ab30-c410-11ef-976e-3f4ccdaaeec6",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-wf-sticky-boundary=\"caas-body-section\" data-wf-sticky-offset=\"165px   10px\" data-wf-sticky-target=\".caas-share-buttons\"\u003e\u003ch2 id=\"atlanta-falcons-at-washington-commanders\"\u003eAtlanta Falcons at Washington Commanders\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eWhen the Falcons have the ball:\u003c/strong\u003e The focus will once again be on Michael Penix Jr. one week after he started his first NFL game. The competition could almost not have been any easier than drawing the Giants but I’d say Penix largely passed his initial test. The rookie was pressured on nearly 50% of his dropbacks last week, but didn’t put the ball in harm\u0026#39;s way and took zero sacks. The ball came out of his hands well, and he didn’t make classic rookie errors. You also saw his arm strength right away, as Penix was able to drive the ball from the far hash on deep out routes to the field.\u003c/p\u003e\u003cp\u003eThe ability to make those throws is key for Darnell Mooney, who has run those routes for this offense all season. He’s back on the high-end WR3 radar with Penix under center, especially as this game could get high-scoring. The rookie quarterback also showed a nice connection with Drake London before the wideout left the game early with an injury. It sounds like London will be able to play in this game, and we should expect him to get a significant workload. London has been a key chain-mover on slot routes against man coverage for the new Falcons offense. The Commanders play man at the fifth-highest rate on third and fourth down this season.\u003c/p\u003e\u003cp\u003eBijan Robinson is one of the five best backs in the league right now, so the following isn\u0026#39;t exactly a piping hot take, but I anticipate him being a huge title-game swinger. Robinson touched the ball 24 times in Penix’s first start as the engine of the offense. According to Fantasy Points Data, Washington has allowed the ninth-highest success rate on zone runs this season, which is the meat and potatoes of the Atlanta run game. He should be able to keep the offense on schedule and rip off big plays in Week 17.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWhen the Commanders have the ball: \u003c/strong\u003eWe are dealing with hyper-small sample sizes here but the Falcons defense has been on a weird mini-heater lately. Since Week 14, Atlanta has ranked sixth in EPA per play since Week 14. They’ve caused chaos and created big plays on defense. They’ve also played Desmond Ridder and Drew Lock in that stretch. That might have something to do with this recent surge. The Washington Commanders offense will provide a much more difficult test.\u003c/p\u003e\u003cp\u003eLast week, Washington reminded us why it is still such a dangerous offense. Going against one of the premier defenses in the league, you can’t say that Jayden Daniels and the offense were mistake-free, but they made big plays to offset the errors and eventually won the contest. Hunting downfield on outside-the-numbers vertical routes will be key once again this week. Per NFL Pro, Jayden Daniels and Terry McLaurin (140.0) have the highest passer rating among quarterback and pass-catcher duos since Tom Brady and Rob Gronkowski with the Patriots in 2012 (140.1). Atlanta is vulnerable to the exact plays this duo has been so excellent at creating in 2024.\u003c/p\u003e\u003cp\u003eIt’ll be interesting to see if Washington can get its run game going again, after a nightmare outing from Brian Robinson Jr. last week. On balance, the Falcons rush defense has been a problem, ranking 25th in success rate allowed. It’ll help to create a more stable offense if Robinson can get rolling early.\u003c/p\u003e\u003ch2 id=\"green-bay-packers-at-minnesota-vikings\"\u003eGreen Bay Packers at Minnesota Vikings\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eWhen the Packers have the ball: \u003c/strong\u003eNothing will come easy for the Packers in this matchup, as Minnesota is one of the most dangerous defenses in the league. Jordan Love posted big numbers in a negative game script last time these two teams faced off but so much has changed since then that it’s not overly instructive.\u003c/p\u003e\u003cp\u003eThe most significant difference between the Packers then and now is their intense commitment to the ground game. The Packers are among the bottom teams in neutral pass rate in the back half of the season and no one can blame them for it. Josh Jacobs and a conceptually diverse run game have been every bit of good enough to be the engine of this passing attack. The Vikings\u0026#39; run defense has been a tough unit to go against, ranking third in success rate allowed on the season. However, given the team’s deserved commitment to Jacobs as they try to keep Love out of long down-and-distance blitz situations, we should still expect the RB1 to get the ball 20-plus times on the ground.\u003c/p\u003e\u003cp\u003eIn the passing game, it looks like the Packers \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/packers-wr-christian-watson-is-questionable-with-door-open-for-him-to-play\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:may be without;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003emay be without\u003c/a\u003e Christian Watson on Sunday. If Watson misses the game, it will create the target concentration fantasy gamers will need to get Jayden Reed closer to the circle of trust. Per Fantasy Points Data, the Vikings play two-high coverage at the second-highest rate on late downs. When the Packers face two-high, Reed has 24% of the team yardage and 2.26 yards per route run. Those plays bring his layup route running and yards-after-the-catch skills into focus.\u003c/p\u003e\u003cp\u003eHe won’t get the same level of volume but Tucker Kraft is another name to watch. He’s second to Reed in YAC when facing two-high this season because he’s been an answer for Love out in the flat when he gets pressured.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWhen the Vikings have the ball: \u003c/strong\u003eThe Vikings defense isn’t the only quality stop unit in this matchup. Green Bay ranks third in EPA per play allowed since Week 10. It\u0026#39;s had some layup matchups in the mix lately, but this is an overall sound defense that’s settling into a well-designed system under Jeff Hafley. This will be one of their biggest tests as the Vikings\u0026#39; passing game is cooking.\u003c/p\u003e\u003cp\u003eSam Darnold has thrown 15 touchdowns to just one pick since Week 11. He’s been exceptionally clean, even when playing under duress. The Vikings are littered with playmakers and Kevin O’Connell is one of the top offensive minds in the league but they have injuries up on the offensive line. That hasn’t bothered Darnold. Since Week 11, he has a near-equal passer rating when under pressure (110.6) compared to when he’s kept clean (115.0), per Pro Football Focus. Considering how Darnold’s career has played out, that is just so huge. It’ll be even more critical since Green Bay has really cranked up their blitz concepts.\u003c/p\u003e\u003cp\u003eWe know what Justin Jefferson brings to the table but getting Jordan Addison going has been a huge boost for this offense down the stretch. Fantasy managers should feel confident that Addison can get rolling again in this matchup. He’s typically been the Vikings\u0026#39; answer in pre-snap single coverage looks that turn into zones post-snap. The Packers are 11th in zone coverage rate on late downs, where we usually see more man. Addison should find plenty of the looks against which he typically thrives.\u003c/p\u003e\u003ch2 id=\"denver-broncos-at-cincinnati-bengals\"\u003eDenver Broncos at Cincinnati Bengals\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eWhen the Broncos have the ball: \u003c/strong\u003eThe Broncos are in the driver’s seat for the AFC’s final playoff spot \u003cem\u003eif \u003c/em\u003ethey win this game. If Denver lets it slip, things get a little interesting for current 7-8 teams like Indianapolis, Miami and this Bengals team on the other side.\u003c/p\u003e\u003cp\u003eThe Broncos have to control the action in this contest and they\u0026#39;re facing the right opposition for it. The Bengals defense had some great moments last week against the Browns but that team is not running a real offense under Dorian Thompson-Robinson. For most of the season, this Cincinnati defense has been a complete mess. Sean Payton’s Broncos offense has been extremely well-designed and takes advantage of the middle of the field. The Bengals\u0026#39; defense is weak down the spine of the defense with personnel departures and draft misses at linebacker and safety.\u003c/p\u003e\u003cp\u003e\u003cem\u003eSubscribe to \u003c/em\u003e\u003cstrong\u003e\u003cem\u003eYahoo Fantasy Forecast\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e on \u003c/em\u003e\u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://podcasts.apple.com/us/podcast/yahoo-fantasy-football-forecast/id1031567659\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:Apple Podcasts;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eApple Podcasts\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003c/em\u003e\u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://open.spotify.com/show/70E33T64jsqzqr9V0L9CFr\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:Spotify;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eSpotify\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003c/em\u003e\u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.youtube.com/playlist?list=PLtAg01865jDdovghurIyNM7qZFwSJCnyD\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:YouTube;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eYouTube\u003c/em\u003e\u003c/a\u003e\u003cem\u003e or \u003c/em\u003e\u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://pod.link/1031567659\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:wherever you listen.;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003ewherever you listen.\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe only thing that gives me some pause is that we’re in the middle of an erratic stretch of Bo Nix games. Nix is 24th in EPA per play the last three weeks since returning from the bye. That includes that electric Monday Night Football win over the Browns where both Nix and Jameis Winston were letting their freak flags fly on downfield throws.\u003c/p\u003e\u003cp\u003eLately, Nix has had a bad case of happy feet under pressure. Payton has responded by trying to take the air out of the ball and giving the rookie good answers on check-down passes. He’s averaged 5.3 and 2.9 air yards per attempt the last two games. Nix has been accurate and decisive on those check-downs, and last week was a good example of how the passing offense can still be productive when he gets to those plays. However, if the Broncos are going to hang with the Bengals, they will need Nix to settle in the pocket and push the ball over the middle to Courtland Sutton and co.\u003c/p\u003e\u003cp\u003eThe matchup is right for him to do just that.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWhen the Bengals have the ball: \u003c/strong\u003eThe matchup is the exact opposite on the other side of the ball. The Broncos defense is No. 1 in EPA per play allowed this season and is at full health right now with corner Riley Moss back in the fold. Meanwhile, the Bengals offense is firmly in the circle of trust and may own a top-three spot in those rankings.\u003c/p\u003e\u003cp\u003eJoe Burrow has been one of the best quarterbacks in the league this season. It’s not his fault this team sits below .500 and could miss the playoffs. The Bengals offense basically doesn’t miss. We’re even to the point where Chase Brown is a can’t-miss running back. He is a much-improved runner this season who has created a big-play element that hasn’t been present in the Bengals backfield for quite some time. He’s also an ideal layup target on check-downs and designer backfield routes for Burrow. That helps him reach a high statistical ceiling every week, even when the run-defense matchup is difficult, as it is this week.\u003c/p\u003e\u003cp\u003eThe No. 1 individual faceoff of note will be Patrick Surtain II in coverage. Tee Higgins is \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://sports.yahoo.com/bengals-wr-tee-higgins-injury-210026285.html\" data-ylk=\"slk:questionable;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003equestionable\u003c/a\u003e with ankle/knee injuries and isn\u0026#39;t a lock to play this week. We’ve seen that none of the depth wide receivers like Andre Iosivas or Jermaine Burton get a consequential boost when Higgins misses. Just expect to see more of Ja’Marr Chase, who has the kind of usage that will get him away from Surtain. We typically don’t see the All-Pro cornerback travel into the slot (6% of pass routes, per PFF) but the Bengals have used Chase inside on a career-high 34% of his routes this season. That will be a little more complicated to sprinkle in if Higgins misses and makes the outside wide receiver options weaker but Cincy has been intentional about Chase’s slot targets even when his running mate misses time.\u003c/p\u003e\u003cp\u003eIt only takes a small handful of plays away from Surtain to make a wide receiver’s week, as Jerry Jeudy showed us not long ago.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-27T21:45:24Z",
  "modifiedTime": null
}
