{
  "id": "b39bf718-38e1-4cac-b985-bb4c75b2bc73",
  "title": "Yes, yes, yes: Man Utd sure on Amorim, transfers and the future",
  "link": "https://www.bbc.com/sport/football/articles/ce9vxrm1ke2o",
  "description": "A look at what's next for Manchester United after their Europa League final defeat - with focus on transfer plans, finances and the future of their head coach Ruben Amorim.",
  "author": "",
  "published": "Thu, 22 May 2025 18:27:46 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Simon Stone",
  "length": 9893,
  "excerpt": "A look at what's next for Manchester United after their Europa League final defeat - with focus on transfer plans, finances and the future of their head coach Ruben Amorim.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Image source, Getty ImagesManchester United were putting on the bravest of brave faces as they headed out of Bilbao at lunchtime on Thursday.Yes, the club remain solidly behind head coach Ruben Amorim - who had said after the match that if the ownership or the fans did not want him, he would leave \"the next day\", without talking about compensation.Yes, the club have a Plan B when it comes to transfers and will be in a position to reshape Amorim's squad this summer.And yes, the club still believe they will return towards the upper end of the English game in the not-too-distant future.But there are some basic realities words alone will not solve.After losing 1-0 to Tottenham in Bilbao, knowing there will be no European football of any kind next season and with losses still high despite a second round of redundancies, there are significant questions for United to answer.Here we assess what the defeat means for their finances, transfer plans, on who might leave and for Amorim.What does it mean for their finances?At some point between now and the beginning of July, United will announce their third quarter financial results to the New York Stock Exchange.This will be an opportunity to address any monetary issues for the 2025-26 season that have arisen because of the defeat in Spain.We know for certain United will experience a £10m reduction in payments from their £900m, 10-year sponsorship deal with Adidas because they have missed out on the Champions League. As that penalty is spread over the length of the contract, which runs to 2035, the damage on an annual basis is not onerous. But few would look at this season and be confident of United returning to the Champions League in 2026-27 and therefore avoiding another penalty.Beyond that, there is the issue of Premier League prize money. Each place in the table is worth £3m. That means, in their current position of 16th, United would receive £33m less than for finishing fifth.The club make about £4.3m in gate receipts for every home game at Old Trafford - and there would have been at least four more of those in the league phase of the Champions League.Add in the generous prize money on offer in Europe's elite competition, and that is how we have calculated that Wednesday's defeat by Tottenham has, at a conservative estimate, cost United £100m.As has been widely reported, a second round of redundancies is on the way, this time affecting the football department. The reductions are like to affect the scouting, medical and science teams. There has been no word on whether that is likely to be the end of the matter. But it is clear, from axing of staff trips, free lunches and other perks, nothing is off limits in Sir Jim Ratcliffe's determination to make United a leaner organisation.But these cost-cutting initiatives can only do so much. As with any Premier League club, by far the biggest expenditure is on transfer fees and player wages. If this season is any guide, United, who have spent in excess of £900m on transfers over the past five years and whose last annual wage bill they confirmed at £365m, have been awful at both of these fundamental elements.Media caption, Man Utd players reflect on Europa League final defeatWhat does it mean for their transfer budget?United say funds will be available, but what does that mean?There are a few factors at play. As Ratcliffe outlined in March, they owe £272m in outstanding transfer fees, a significant percentage of which - £156m - is due this summer.Overall losses to June 2024 were £113.2m. Since then, United spent £14.5m sacking former manager Erik ten Hag and his staff.Despite this, no-one at United is rejecting the widespread belief Wolves forward Matheus Cunha is going to join in the summer.The Brazilian has a release clause of £62.5m. Quite how much of that has to be paid immediately is not known. However, it is difficult to see how it cannot at least in part be funded by player sales.Now for the unquantifiable bit. The better - and faster - United can sell, the more flexibility they will have to buy. The longer it goes, the less easy it becomes to strike deals for the right price and the potential for mistakes grows.Arguably, United are still paying massively for the summer of 2022 when Ten Hag arrived and demanded the club bring in Frenkie de Jong from Barcelona.United officials quickly concluded it was an impossible deal to complete. Ten Hag argued otherwise.After the attempt was eventually aborted, the season started with a home defeat by Brighton and a four-goal hammering at Brentford. United were panicked into spending £150m on Casemiro and Antony, neither of whom has come close to providing value for money and remain under contract heading into next season.What does it mean for who might leave?There is an ideal and a realistic view of this.In the past, United have ringfenced players who they regarded as off-limits to other clubs. I doubt there is anyone in that bracket now - and that includes captain Bruno Fernandes, even though the club did say they weren't interested in selling the 30-year-old Portugal playmaker when recent interest from the Saudi Pro League surfaced.First, the easy bit. The contracts of Victor Lindelof and Christian Eriksen run out in the summer. They will not be renewed.After that, it gets harder.Marcus Rashford accepts he will not play for United again while Amorim remains in charge. But he is in no rush to decide his future and is not interested in taking a wage cut. Barcelona have declared their interest but are hardly cash rich. Rashford might be keen on a move to the Nou Camp but it is difficult to imagine a deal could be concluded swiftly.What happens if Chelsea activate the £5m clause in their deal with United over Jadon Sancho and send him back to Old Trafford?After controversial social media posts around the final, Alejandro Garnacho and his family appear to have put themselves on a collision course with Amorim. Chelsea were keen on the Argentina forward in January. United are bound to listen if they come back.There have been murmurings around Andre Onana from the Saudi Pro League but nothing concrete has materialised. Onana's deputy Altay Bayindir knows he will remain as second choice and is likely to move on.But what of established highly-paid stars such as Casemiro, Harry Maguire and Luke Shaw? Or more recent recruits such as Manuel Ugarte and Mason Mount? Or players who have been forgotten about, such as Tyrell Malacia or Antony, who has enjoyed a successful loan at Real Betis? And that is without mentioning the underperforming, expensive striking duo Rasmus Hojlund and Joshua Zirkzee. Returns to Italy have been suggested for them. But both are earning more than they did when they were at Atalanta and Bologna respectively.Logic says only a minority of these players will leave, much as United might wish otherwise.What does it mean for Amorim?Media caption, I’ll leave without compensation if board feel I'm not right – AmorimThe speed with which United issued support for Amorim in the wake of his post-match declaration was telling but the former Sporting coach knows the spotlight on him is fierce now.He has said he feels his players are getting to grips with what he wants from them and there are definite signs of a structure and tactical patterns that were not evident in his first few weeks at the club.In one first-half move on Wednesday, United manipulated a situation that allowed Casemiro to deliver a 60-yard crossfield pass, from right to left, over to Patrick Dorgu, who was in space by the touchline. Nothing came of the attack but it was an example of what Amorim is looking for.But he knows, as does everyone else, that clubs of United's size cannot lose consistently without consequence. A tally of six league wins in 26 games is simply not good enough.There is no league with the strength in depth of the Premier League, underlined by what has happened to United this season.However, if Real Madrid, Barcelona, Bayern Munich or any of the big Italian clubs had a comparable campaign, it is pretty certain that, not only would the guy who started the season get axed, in all probability, the person who followed him would as well.Amorim seems safe from that fate. But unsubstantiated rumours hang around of players not being happy with his methods. A couple of thoughtful trophy-winning former United players wonder how effective it can be having a coaching staff that, in some cases, is both younger and less experienced than the players they are attempting to work with.Having the support of the ownership is one thing. The reality is Amorim must start winning quickly next season. The vultures are circling now. It will not take much for them to go for their prey.What happens next?Once Sunday's game with Aston Villa is over, United leave for a two-game tour of Asia.I cannot for one second think that any of the club's established first-team players are relishing the prospect.But Amorim has said, and others acknowledge, that the first team can have no argument over United taking unpopular decisions to generate more income - up to £10m in this instance - to make up for this season's shortfall.There is another 'Super League' club who have failed to secure European qualification for next season - Italian giants AC Milan. Do not be surprised if at least one friendly is arranged in a neutral country at some convenient point in the calendar.The positive spin of no Europe means more chance to work on the training ground.The negative, potentially, is that more of what is going on behind the scenes will make its way into the media because the season is not being punctuated by regular midweek matches and press conferences.That is the thing with Manchester United. They are big news. They generate debate. Even when they are not very good, people still talk about them.Manchester UnitedFootballMore on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d515/live/68b4de00-373a-11f0-96c3-cf669419a2b0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/400/cpsprodpb/9616/live/d0911040-3729-11f0-8519-3b5a01ebe413.jpg.webp 400w, https://ichef.bbci.co.uk/ace/standard/640/cpsprodpb/9616/live/d0911040-3729-11f0-8519-3b5a01ebe413.jpg.webp 640w\" type=\"image/webp\" sizes=\"(min-width: 900px) 50vw, 100vw\"/\u003e\u003cimg alt=\"Amorim crouches disconsolately during Europa League final.\" sizes=\"(min-width: 900px) 50vw, 100vw\" src=\"https://ichef.bbci.co.uk/ace/standard/692/cpsprodpb/9616/live/d0911040-3729-11f0-8519-3b5a01ebe413.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/400/cpsprodpb/9616/live/d0911040-3729-11f0-8519-3b5a01ebe413.jpg 400w, https://ichef.bbci.co.uk/ace/standard/640/cpsprodpb/9616/live/d0911040-3729-11f0-8519-3b5a01ebe413.jpg 640w\" width=\"692\" height=\"692\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/header\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eManchester United were putting on the bravest of brave faces as they headed out of Bilbao at lunchtime on Thursday.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eYes, the club remain solidly behind head coach Ruben Amorim - who had said after the match that if the ownership or the fans did not want him, he would leave \u0026#34;the next day\u0026#34;, without talking about compensation.\u003c/p\u003e\u003cp\u003eYes, the club have a Plan B when it comes to transfers and will be in a position to reshape Amorim\u0026#39;s squad this summer.\u003c/p\u003e\u003cp\u003eAnd yes, the club still believe they will return towards the upper end of the English game in the not-too-distant future.\u003c/p\u003e\u003cp\u003eBut there are some basic realities words alone will not solve.\u003c/p\u003e\u003cp\u003eAfter losing 1-0 to Tottenham in Bilbao, knowing there will be no European football of any kind next season and with losses still high despite a second round of redundancies, there are significant questions for United to answer.\u003c/p\u003e\u003cp\u003eHere we assess what the defeat means for their finances, transfer plans, on who might leave and for Amorim.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-does-it-mean-for-their-finances\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat does it mean for their finances?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAt some point between now and the beginning of July, United will announce their third quarter financial results to the New York Stock Exchange.\u003c/p\u003e\u003cp\u003eThis will be an opportunity to address any monetary issues for the 2025-26 season that have arisen because of the defeat in Spain.\u003c/p\u003e\u003cp\u003eWe know for certain United will experience a £10m reduction in payments from their £900m, 10-year sponsorship deal with Adidas because they have missed out on the Champions League. As that penalty is spread over the length of the contract, which runs to 2035, the damage on an annual basis is not onerous. But few would look at this season and be confident of United returning to the Champions League in 2026-27 and therefore avoiding another penalty.\u003c/p\u003e\u003cp\u003eBeyond that, there is the issue of Premier League prize money. Each place in the table is worth £3m. That means, in their current position of 16th, United would receive £33m less than for finishing fifth.\u003c/p\u003e\u003cp\u003eThe club make about £4.3m in gate receipts for every home game at Old Trafford - and there would have been at least four more of those in the league phase of the Champions League.\u003c/p\u003e\u003cp\u003eAdd in the generous prize money on offer in Europe\u0026#39;s elite competition, and that is how we have calculated that Wednesday\u0026#39;s defeat by Tottenham has, at a conservative estimate, cost United £100m.\u003c/p\u003e\u003cp\u003eAs has been widely reported, a second round of redundancies is on the way, this time affecting the football department. The reductions are like to affect the scouting, medical and science teams. \u003c/p\u003e\u003cp\u003eThere has been no word on whether that is likely to be the end of the matter. But it is clear, from axing of staff trips, free lunches and other perks, nothing is off limits in Sir Jim Ratcliffe\u0026#39;s determination to make United a leaner organisation.\u003c/p\u003e\u003cp\u003eBut these cost-cutting initiatives can only do so much. As with any Premier League club, by far the biggest expenditure is on transfer fees and player wages. If this season is any guide, United, who have spent in excess of £900m on transfers over the past five years and whose last annual wage bill they confirmed at £365m, have been awful at both of these fundamental elements.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eMan Utd players reflect on Europa League final defeat\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-does-it-mean-for-their-transfer-budget\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat does it mean for their transfer budget?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUnited say funds will be available, but what does that mean?\u003c/p\u003e\u003cp\u003eThere are a few factors at play. As Ratcliffe outlined in March, they owe £272m in outstanding transfer fees, a significant percentage of which - £156m - is due this summer.\u003c/p\u003e\u003cp\u003eOverall losses to June 2024 were £113.2m. Since then, United spent £14.5m sacking former manager Erik ten Hag and his staff.\u003c/p\u003e\u003cp\u003eDespite this, no-one at United is rejecting the widespread belief Wolves forward Matheus Cunha is going to join in the summer.\u003c/p\u003e\u003cp\u003eThe Brazilian has a release clause of £62.5m. Quite how much of that has to be paid immediately is not known. However, it is difficult to see how it cannot at least in part be funded by player sales.\u003c/p\u003e\u003cp\u003eNow for the unquantifiable bit. The better - and faster - United can sell, the more flexibility they will have to buy. The longer it goes, the less easy it becomes to strike deals for the right price and the potential for mistakes grows.\u003c/p\u003e\u003cp\u003eArguably, United are still paying massively for the summer of 2022 when Ten Hag arrived and demanded the club bring in Frenkie de Jong from Barcelona.\u003c/p\u003e\u003cp\u003eUnited officials quickly concluded it was an impossible deal to complete. Ten Hag argued otherwise.\u003c/p\u003e\u003cp\u003eAfter the attempt was eventually aborted, the season started with a home defeat by Brighton and a four-goal hammering at Brentford. United were panicked into spending £150m on Casemiro and Antony, neither of whom has come close to providing value for money and remain under contract heading into next season.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-does-it-mean-for-who-might-leave\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat does it mean for who might leave?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThere is an ideal and a realistic view of this.\u003c/p\u003e\u003cp\u003eIn the past, United have ringfenced players who they regarded as off-limits to other clubs. I doubt there is anyone in that bracket now - and that includes captain Bruno Fernandes, even though the club did say they weren\u0026#39;t interested in selling the 30-year-old Portugal playmaker when recent interest from the Saudi Pro League surfaced.\u003c/p\u003e\u003cp\u003eFirst, the easy bit. The contracts of Victor Lindelof and Christian Eriksen run out in the summer. They will not be renewed.\u003c/p\u003e\u003cp\u003eAfter that, it gets harder.\u003c/p\u003e\u003cp\u003eMarcus Rashford accepts he will not play for United again while Amorim remains in charge. But he is in no rush to decide his future and is not interested in taking a wage cut. Barcelona have declared their interest but are hardly cash rich. Rashford might be keen on a move to the Nou Camp but it is difficult to imagine a deal could be concluded swiftly.\u003c/p\u003e\u003cp\u003eWhat happens if Chelsea activate the £5m clause in their deal with United over Jadon Sancho and send him back to Old Trafford?\u003c/p\u003e\u003cp\u003eAfter controversial social media posts around the final, Alejandro Garnacho and his family appear to have put themselves on a collision course with Amorim. Chelsea were keen on the Argentina forward in January. United are bound to listen if they come back.\u003c/p\u003e\u003cp\u003eThere have been murmurings around Andre Onana from the Saudi Pro League but nothing concrete has materialised. Onana\u0026#39;s deputy Altay Bayindir knows he will remain as second choice and is likely to move on.\u003c/p\u003e\u003cp\u003eBut what of established highly-paid stars such as Casemiro, Harry Maguire and Luke Shaw? Or more recent recruits such as Manuel Ugarte and Mason Mount? Or players who have been forgotten about, such as Tyrell Malacia or Antony, who has enjoyed a successful loan at Real Betis? And that is without mentioning the underperforming, expensive striking duo Rasmus Hojlund and Joshua Zirkzee. Returns to Italy have been suggested for them. But both are earning more than they did when they were at Atalanta and Bologna respectively.\u003c/p\u003e\u003cp\u003eLogic says only a minority of these players will leave, much as United might wish otherwise.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-does-it-mean-for-Amorim\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat does it mean for Amorim?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eI’ll leave without compensation if board feel I\u0026#39;m not right – Amorim\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe speed with which United issued support for Amorim in the wake of his post-match declaration was telling but the former Sporting coach knows the spotlight on him is fierce now.\u003c/p\u003e\u003cp\u003eHe has said he feels his players are getting to grips with what he wants from them and there are definite signs of a structure and tactical patterns that were not evident in his first few weeks at the club.\u003c/p\u003e\u003cp\u003eIn one first-half move on Wednesday, United manipulated a situation that allowed Casemiro to deliver a 60-yard crossfield pass, from right to left, over to Patrick Dorgu, who was in space by the touchline. Nothing came of the attack but it was an example of what Amorim is looking for.\u003c/p\u003e\u003cp\u003eBut he knows, as does everyone else, that clubs of United\u0026#39;s size cannot lose consistently without consequence. A tally of six league wins in 26 games is simply not good enough.\u003c/p\u003e\u003cp\u003eThere is no league with the strength in depth of the Premier League, underlined by what has happened to United this season.\u003c/p\u003e\u003cp\u003eHowever, if Real Madrid, Barcelona, Bayern Munich or any of the big Italian clubs had a comparable campaign, it is pretty certain that, not only would the guy who started the season get axed, in all probability, the person who followed him would as well.\u003c/p\u003e\u003cp\u003eAmorim seems safe from that fate. But unsubstantiated rumours hang around of players not being happy with his methods. A couple of thoughtful trophy-winning former United players wonder how effective it can be having a coaching staff that, in some cases, is both younger and less experienced than the players they are attempting to work with.\u003c/p\u003e\u003cp\u003eHaving the support of the ownership is one thing. The reality is Amorim must start winning quickly next season. The vultures are circling now. It will not take much for them to go for their prey.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-happens-next\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat happens next?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOnce Sunday\u0026#39;s game with Aston Villa is over, United leave for a two-game tour of Asia.\u003c/p\u003e\u003cp\u003eI cannot for one second think that any of the club\u0026#39;s established first-team players are relishing the prospect.\u003c/p\u003e\u003cp\u003eBut Amorim has said, and others acknowledge, that the first team can have no argument over United taking unpopular decisions to generate more income - up to £10m in this instance - to make up for this season\u0026#39;s shortfall.\u003c/p\u003e\u003cp\u003eThere is another \u0026#39;Super League\u0026#39; club who have failed to secure European qualification for next season - Italian giants AC Milan. Do not be surprised if at least one friendly is arranged in a neutral country at some convenient point in the calendar.\u003c/p\u003e\u003cp\u003eThe positive spin of no Europe means more chance to work on the training ground.\u003c/p\u003e\u003cp\u003eThe negative, potentially, is that more of what is going on behind the scenes will make its way into the media because the season is not being punctuated by regular midweek matches and press conferences.\u003c/p\u003e\u003cp\u003eThat is the thing with Manchester United. They are big news. They generate debate. Even when they are not very good, people still talk about them.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"topic-list\"\u003e\u003cul role=\"list\" spacing=\"2\"\u003e\u003cli\u003e\u003ca href=\"https://www.bbc.com/sport/football/teams/manchester-united\"\u003eManchester United\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.bbc.com/sport/football\"\u003eFootball\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-05-22T18:27:46.157Z",
  "modifiedTime": null
}
