{
  "id": "b42331f8-0955-441d-a115-fca409629de4",
  "title": "IOC needs to 'protect female sport', says Lord Coe",
  "link": "https://www.bbc.com/sport/athletics/articles/cq6l0qgp935o",
  "description": "The IOC needs to improve rules on transgender athletes to \"protect female sport\", says World Athletics president Lord Coe.",
  "author": "",
  "published": "Wed, 13 Nov 2024 20:37:02 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 5501,
  "excerpt": "The IOC needs to improve rules on transgender athletes to \"protect female sport\", says World Athletics president Lord Coe.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "The International Olympic Committee (IOC) needs to improve rules on transgender and DSD (differences in sex development) athletes to \"protect female sport\", says World Athletics president Lord Coe.Britain's two-time Olympic 1500m champion Coe, 68, is one of seven confirmed candidates hoping to succeed Thomas Bach as IOC president next March. His comments come after Algeria's Imane Khelif won women's welterweight boxing gold at the Paris Games in the summer, a year after being disqualified from the World Championships for reportedly failing gender eligibility tests.\"I think the International Olympic Committee needs a very, very clear policy in this space,\" Coe told BBC sports editor Dan Roan.\"And the protection of the female category, for me, is absolutely non-negotiable. \"If you are not prepared to do that, and that is where the international federations expect a lead to be taken, then you really will lose female sport and I'm not prepared to see that happen. \"I'm not sure that policy is clear enough at the moment.\"The gender eligibility tests were conducted by the Russian-led International Boxing Association (IBA), which was later stripped of its world governing body status by the IOC over integrity and governance issues.The IBA said Khelif \"failed to meet the eligibility criteria for participating in women's competition\". The IOC questioned the legitimacy and credibility of the IBA's tests, saying they could not be relied upon.Khelif and Taiwan's Lin Yu-ting, who was also banned by the IBA, were both cleared to compete at the Olympics by the IOC. Both have insisted they are women. There is no suggestion they are transgender.In a wide-ranging interview, Coe also spoke of how he has been \"in training for life\" for the presidency of the IOC, the fundamental challenges facing the Olympic movement, prize money in sport and building a relationship with US President-elect Donald Trump - with the next Games scheduled to take place in Los Angeles in 2028.Coe oversaw the London 2012 Games before taking charge of World Athletics, and has also enjoyed a successful commercial and political career.Under Coe, World Athletics has banned transgender women from competing in the female category at international events.He will also be able to point to his experience, achievements and his willingness to establish the Athletics Integrity Unit - which has a strong reputation for catching dopers - in the competition to replace Bach and become the first Briton to head up the IOC.\"It's a movement I spent my whole life in,\" he added. \"I feel as though actually I’ve probably been in training for life for this so yes, it'd be a huge honour. I don't know if it's the toughest race I've ever run, but it's the one I'm best prepared for.\"The new IOC president will be elected in March 2025 and will take over in June.\"I think there are some changes that need to be made and fundamentally around just enabling the membership, the athletes, the National Olympic Committees, the international federations, partners, broadcasters, to have greater skin in the game and to help structure the future,\" he said.\"This isn't the efforts of just one person. I think it needs a collaborative, team-building transition.\"It would be a mistake to conclude that everything is rosy, the red carpet is out in front of us, but we do have to travel down it. I'm very keen to provide structures, governance structures, particularly that allow talented members to be able to shape the direction of the movement, and their voices to be not just heard but acted upon.\"There are some big fundamental challenges that [the Olympics] confronts. Geopolitically, commercially, the relevance of the Games… you don't want to be so disruptive, but I do think it needs to change.\"In a controversial move, World Athletics introduced prize money for gold medallists at Paris 2024 under Coe's leadership. Asked if he would encourage other sports to do the same if he becomes IOC president, he added: \"Yes, but I also have to recognise that some sports are not going to be best placed to create those budgets. That's why it is important that there is a readjustment in the way sport is being funded, the way National Olympic Committees are being funded.\"Over the next four years, the incoming IOC president is likely to have to show diplomacy to contend with tensions between the US and China over a doping case involving 23 Chinese swimmers. However, they will also likely have an in tray that includes developing strong relationships with the Trump administration prior to Los Angeles 2028, negotiating lucrative new TV deals and replacing key sponsors like Toyota, Panasonic and Bridgestone., external\"I know the realities of politics and I've almost felt that I've been involved in geopolitical politics for probably the last 15 or 20 years,\" Coe added.\"I cannot imagine that any president of the United States would not want that [the 2028 Games] to be a hugely successful showcase for both his own country and, more importantly, global integration and having everybody there.\"I've competed in Olympic Games, and Olympic Games impacted by a boycott. I've chaired a National Olympic Committee. I've helped deliver a Games in London, where, you know, not every country was universally excited about - at that stage - our foreign policy. \"This is the world that I've lived in, and in World Athletics I've had to confront the integrity around Russian sport and DSD and transgender, this is the world that I've lived in.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/966d/live/6624ed50-a1ea-11ef-a4fe-a3e9a6c5d640.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eThe International Olympic Committee (IOC) needs to improve rules on transgender and DSD (differences in sex development) athletes to \u0026#34;protect female sport\u0026#34;, says World Athletics president Lord Coe.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBritain\u0026#39;s two-time Olympic 1500m champion Coe, 68, is one of \u003ca href=\"https://www.bbc.com/sport/olympics/articles/cx2mmldmjnno\"\u003eseven confirmed candidates\u003c/a\u003e hoping to succeed Thomas Bach as IOC president next March. \u003c/p\u003e\u003cp\u003eHis comments come after Algeria\u0026#39;s Imane Khelif \u003ca href=\"https://www.bbc.com/sport/olympics/articles/c4gp8evl009o\"\u003ewon women\u0026#39;s welterweight boxing gold\u003c/a\u003e at the Paris Games in the summer, a year after being disqualified from the World Championships for reportedly failing gender eligibility tests.\u003c/p\u003e\u003cp\u003e\u0026#34;I think the International Olympic Committee needs a very, very clear policy in this space,\u0026#34; Coe told BBC sports editor Dan Roan.\u003c/p\u003e\u003cp\u003e\u0026#34;And the protection of the female category, for me, is absolutely non-negotiable. \u003c/p\u003e\u003cp\u003e\u0026#34;If you are not prepared to do that, and that is where the international federations expect a lead to be taken, then you really will lose female sport and I\u0026#39;m not prepared to see that happen. \u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m not sure that policy is clear enough at the moment.\u0026#34;\u003c/p\u003e\u003cp\u003eThe gender eligibility tests were conducted by the Russian-led International Boxing Association (IBA), which was later stripped of its world governing body status by the IOC over integrity and governance issues.\u003c/p\u003e\u003cp\u003eThe IBA said Khelif \u0026#34;failed to meet the eligibility criteria for participating in women\u0026#39;s competition\u0026#34;. \u003c/p\u003e\u003cp\u003eThe IOC questioned the legitimacy and credibility of the IBA\u0026#39;s tests, saying they could not be relied upon.\u003c/p\u003e\u003cp\u003eKhelif and Taiwan\u0026#39;s Lin Yu-ting, who was also banned by the IBA, were both cleared to compete at the Olympics by the IOC. Both have insisted they are women. There is no suggestion they are transgender.\u003c/p\u003e\u003cp\u003eIn a wide-ranging interview, Coe also spoke of how he has been \u0026#34;in training for life\u0026#34; for the presidency of the IOC, the fundamental challenges facing the Olympic movement, prize money in sport and building a relationship with US President-elect Donald Trump - with the next Games scheduled to take place in Los Angeles in 2028.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eCoe oversaw the London 2012 Games before taking charge of World Athletics, and has also enjoyed a successful commercial and political career.\u003c/p\u003e\u003cp\u003eUnder Coe, World Athletics has banned transgender women from \u003ca href=\"https://www.bbc.com/sport/athletics/65051900\"\u003ecompeting in the female category at international events.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHe will also be able to point to his experience, achievements and his willingness to establish the Athletics Integrity Unit - which has a strong reputation for catching dopers - in the competition to replace Bach and become the first Briton to head up the IOC.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a movement I spent my whole life in,\u0026#34; he added. \u003c/p\u003e\u003cp\u003e\u0026#34;I feel as though actually I’ve probably been in training for life for this so yes, it\u0026#39;d be a huge honour. I don\u0026#39;t know if it\u0026#39;s the toughest race I\u0026#39;ve ever run, but it\u0026#39;s the one I\u0026#39;m best prepared for.\u0026#34;\u003c/p\u003e\u003cp\u003eThe new IOC president will be elected in March 2025 and will take over in June.\u003c/p\u003e\u003cp\u003e\u0026#34;I think there are some changes that need to be made and fundamentally around just enabling the membership, the athletes, the National Olympic Committees, the international federations, partners, broadcasters, to have greater skin in the game and to help structure the future,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;This isn\u0026#39;t the efforts of just one person. I think it needs a collaborative, team-building transition.\u003c/p\u003e\u003cp\u003e\u0026#34;It would be a mistake to conclude that everything is rosy, the red carpet is out in front of us, but we do have to travel down it. I\u0026#39;m very keen to provide structures, governance structures, particularly that allow talented members to be able to shape the direction of the movement, and their voices to be not just heard but acted upon.\u003c/p\u003e\u003cp\u003e\u0026#34;There are some big fundamental challenges that [the Olympics] confronts. Geopolitically, commercially, the relevance of the Games… you don\u0026#39;t want to be so disruptive, but I do think it needs to change.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a controversial move, World Athletics \u003ca href=\"https://www.bbc.com/sport/athletics/68778225\"\u003eintroduced prize money\u003c/a\u003e for gold medallists at Paris 2024 under Coe\u0026#39;s leadership. \u003c/p\u003e\u003cp\u003eAsked if he would encourage other sports to do the same if he becomes IOC president, he added: \u0026#34;Yes, but I also have to recognise that some sports are not going to be best placed to create those budgets. That\u0026#39;s why it is important that there is a readjustment in the way sport is being funded, the way National Olympic Committees are being funded.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOver the next four years, the incoming IOC president is likely to have to show diplomacy to contend \u003ca href=\"https://www.bbc.com/news/articles/cv2gygj1d28o\"\u003ewith tensions\u003c/a\u003e between the US and China over a doping case involving 23 Chinese swimmers. \u003c/p\u003e\u003cp\u003eHowever, they will also likely have an in tray that includes developing strong relationships with the Trump administration prior to Los Angeles 2028, negotiating lucrative new TV deals and replacing key sponsors like \u003ca href=\"https://www.mirror.co.uk/news/business/major-blow-olympics-three-key-33799814\"\u003eToyota, Panasonic and Bridgestone.\u003cspan\u003e, external\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I know the realities of politics and I\u0026#39;ve almost felt that I\u0026#39;ve been involved in geopolitical politics for probably the last 15 or 20 years,\u0026#34; Coe added.\u003c/p\u003e\u003cp\u003e\u0026#34;I cannot imagine that any president of the United States would not want that [the 2028 Games] to be a hugely successful showcase for both his own country and, more importantly, global integration and having everybody there.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve competed in Olympic Games, and Olympic Games impacted by a boycott. I\u0026#39;ve chaired a National Olympic Committee. I\u0026#39;ve helped deliver a Games in London, where, you know, not every country was universally excited about - at that stage - our foreign policy. \u003c/p\u003e\u003cp\u003e\u0026#34;This is the world that I\u0026#39;ve lived in, and in World Athletics I\u0026#39;ve had to confront the integrity around Russian sport and DSD and transgender, this is the world that I\u0026#39;ve lived in.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-13T18:40:38.571Z",
  "modifiedTime": null
}
