{
  "id": "b540c146-2ccf-4159-bb77-b6779d0ca613",
  "title": "'I didn't like what was being said' - Postecoglou on fan confrontation",
  "link": "https://www.bbc.com/sport/football/articles/c878xrw894eo",
  "description": "Tottenham manager Ange Postecoglou says he \"didn't like what was being said\" by some Spurs fans after their defeat by Bournemouth.",
  "author": "",
  "published": "Thu, 05 Dec 2024 23:21:55 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 3023,
  "excerpt": "Tottenham manager Ange Postecoglou says he \"didn't like what was being said\" by some Spurs fans after their defeat by Bournemouth.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "'I didn't like what was being said' - Postecoglou on fan confrontationImage source, Getty ImagesImage caption, Ange Postecoglou confronted a group of Spurs fans after Tottenham's loss to BournemouthTottenham manager Ange Postecoglou says he \"didn't like what was being said\" by some Spurs supporters after their defeat by Bournemouth - but that \"you've got to cop it\".In the immediate aftermath of their 1-0 loss at Vitality Stadium, Postecoglou pointed at a group of Tottenham fans who were voicing their anger and marched across the pitch towards the away end to confront them.Words were exchanged before a steward attempted to defuse the situation by waving the 59-year-old Australian away.\"They're disappointed and rightly so,\" said Postecoglou in his post-match news conference. \"They gave me some direct feedback, which I've taken on board.\"I didn't like what was being said because I'm a human being but you've got to cop it.\"I've been around long enough to know that when things don't go well you've got to understand the frustration and disappointment. And they're rightly disappointed because we let a game of football get away from us. But that's OK. I'm OK with all that.\"All I can say is I'm really disappointed and I'm determined to get it right and will keep fighting until we do.\"Tottenham's defeat by Bournemouth leaves them 10th in the Premier League table, one place below the Cherries.It was Spurs' sixth league defeat this season, with only five sides in the top flight having lost more games than them.\"It comes down to us as a collective being a lot more determined to control a game of football and not let the opposition take control,\" added Postecoglou.'Jekyll and Hyde' Tottenham were 'terrible'Media caption, Bournemouth 1-0 Tottenham: Ange Postecoglou disappointed by 'really poor goal'Tottenham have only won one of their past six matches, a 4-0 victory at Manchester City - which now feels like an outlier.\"I now know what people mean when they say Tottenham are like Jekyll and Hyde,\" said former Stoke boss Tony Pulis on BBC Radio 5 Live. \"They have been really poor tonight.\"Spurs managed 12 shots, four on target - about half the total of Bournemouth - but their expected goals was only 0.58, compared to Bournemouth's 3.31.Former England striker Les Ferdinand, who played for Spurs between 1997 and 2003, said on Amazon Prime: \"Tottenham didn't look like they could score today.\"I thought Spurs could only be better in the second half and they were slightly better, but there was no urgency. We didn't know what Spurs was going to turn up tonight - and that wasn't the Spurs we wanted.\"Bournemouth also had a goal disallowed for offside and hit the post in a game they should really have won by more.Former England striker Alan Shearer called it \"a terrible performance\" from Spurs.\"I was really surprised they came out with the same team after half-time because they needed some energy and freshening up,\" he said. \"I never felt they were ever going to score tonight.\"More on this story",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;I didn\u0026#39;t like what was being said\u0026#39; - Postecoglou on fan confrontation\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Ange Postecoglou\" loading=\"eager\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5f3e/live/f95197b0-b359-11ef-b339-1bd0bde64a2c.jpg 976w\" width=\"3840\" height=\"2159.7889182058047\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eAnge Postecoglou confronted a group of Spurs fans after Tottenham\u0026#39;s loss to Bournemouth\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eTottenham manager Ange Postecoglou says he \u0026#34;didn\u0026#39;t like what was being said\u0026#34; by some Spurs supporters after their defeat by Bournemouth - but that \u0026#34;you\u0026#39;ve got to cop it\u0026#34;.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIn the immediate aftermath of their \u003ca href=\"https://www.bbc.com/sport/football/live/cjr2dnddj8qt\"\u003e1-0 loss at Vitality Stadium\u003c/a\u003e, Postecoglou pointed at a group of Tottenham fans who were voicing their anger and marched across the pitch towards the away end to confront them.\u003c/p\u003e\u003cp\u003eWords were exchanged before a steward attempted to defuse the situation by waving the 59-year-old Australian away.\u003c/p\u003e\u003cp\u003e\u0026#34;They\u0026#39;re disappointed and rightly so,\u0026#34; said Postecoglou in his post-match news conference. \u0026#34;They gave me some direct feedback, which I\u0026#39;ve taken on board.\u003c/p\u003e\u003cp\u003e\u0026#34;I didn\u0026#39;t like what was being said because I\u0026#39;m a human being but you\u0026#39;ve got to cop it.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve been around long enough to know that when things don\u0026#39;t go well you\u0026#39;ve got to understand the frustration and disappointment. And they\u0026#39;re rightly disappointed because we let a game of football get away from us. But that\u0026#39;s OK. I\u0026#39;m OK with all that.\u003c/p\u003e\u003cp\u003e\u0026#34;All I can say is I\u0026#39;m really disappointed and I\u0026#39;m determined to get it right and will keep fighting until we do.\u0026#34;\u003c/p\u003e\u003cp\u003eTottenham\u0026#39;s defeat by Bournemouth leaves them 10th in the Premier League table, one place below the Cherries.\u003c/p\u003e\u003cp\u003eIt was Spurs\u0026#39; sixth league defeat this season, with only five sides in the top flight having lost more games than them.\u003c/p\u003e\u003cp\u003e\u0026#34;It comes down to us as a collective being a lot more determined to control a game of football and not let the opposition take control,\u0026#34; added Postecoglou.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Jekyll-and-Hyde-Tottenham-were-terrible\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Jekyll and Hyde\u0026#39; Tottenham were \u0026#39;terrible\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eBournemouth 1-0 Tottenham: Ange Postecoglou disappointed by \u0026#39;really poor goal\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eTottenham have only won one of their past six matches, a 4-0 victory at Manchester City - which now feels like an outlier.\u003c/p\u003e\u003cp\u003e\u0026#34;I now know what people mean when they say Tottenham are like Jekyll and Hyde,\u0026#34; said former Stoke boss Tony Pulis on BBC Radio 5 Live. \u0026#34;They have been really poor tonight.\u0026#34;\u003c/p\u003e\u003cp\u003eSpurs managed 12 shots, four on target - about half the total of Bournemouth - but their expected goals was only 0.58, compared to Bournemouth\u0026#39;s 3.31.\u003c/p\u003e\u003cp\u003eFormer England striker Les Ferdinand, who played for Spurs between 1997 and 2003, said on Amazon Prime: \u0026#34;Tottenham didn\u0026#39;t look like they could score today.\u003c/p\u003e\u003cp\u003e\u0026#34;I thought Spurs could only be better in the second half and they were slightly better, but there was no urgency. We didn\u0026#39;t know what Spurs was going to turn up tonight - and that wasn\u0026#39;t the Spurs we wanted.\u0026#34;\u003c/p\u003e\u003cp\u003eBournemouth also had a goal disallowed for offside and hit the post in a game they should really have won by more.\u003c/p\u003e\u003cp\u003eFormer England striker Alan Shearer called it \u0026#34;a terrible performance\u0026#34; from Spurs.\u003c/p\u003e\u003cp\u003e\u0026#34;I was really surprised they came out with the same team after half-time because they needed some energy and freshening up,\u0026#34; he said. \u0026#34;I never felt they were ever going to score tonight.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-05T23:21:55.726Z",
  "modifiedTime": null
}
