{
  "id": "d1a71c8e-c922-4f1d-b5f0-38ca4cef5643",
  "title": "Liverpool will 'stay humble' - but lead at top 'feels different'",
  "link": "https://www.bbc.com/sport/football/articles/clygzr8qvzvo",
  "description": "Mohamed Salah says it \"feels different\" as Liverpool come from behind to beat Leicester and move seven points clear at the top.",
  "author": "",
  "published": "Fri, 27 Dec 2024 00:08:49 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Neil Johnston",
  "length": 4015,
  "excerpt": "Mohamed Salah says it \"feels different\" as Liverpool come from behind to beat Leicester and move seven points clear at the top.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Media caption, 'It doesn't feel like Christmas' - SlotAt first it was just a small section of fans singing it.'Liverpool, Liverpool, top of the league... Liverpool, top of the league' they chanted after Curtis Jones marked his 100th Premier League appearance by sweeping his side into a 2-1 lead against struggling Leicester.It was much louder after Mohamed Salah scored his 19th club goal of the season in the 82nd minute to seal a 3-1 win.Having fallen behind in the fifth minute, Liverpool were well on their way to a win that propelled them seven points clear at the top with one game in hand on their nearest rivals.Of course, Liverpool have been here before.In the 2018-19 season, they led by 10 points only for Manchester City to win the title.\"It feels different,\" Salah, who is out of contract in the summer, told Amazon Prime about Liverpool's advantage at the top after overcoming Leicester.\"But the most important thing is we need to stay humble.\"This one is very special, hopefully we win the Premier League and for this club it is something I dream of.\"The most important thing is the team winning - hopefully we win the Premier League.\"It is great, but we focus on each game and hopefully we carry on like that.\"'Far too early to be celebrating'Liverpool will move 10 points clear of nearest rivals Chelsea if they win at West Ham on Sunday as Enzo Maresca's side do not play until the following day at Ipswich.It is turning into an extraordinary first season in charge for Arne Slot, who left Feyenoord to take charge of Liverpool.Not only do Liverpool have a strong lead at the top of the Premier League, they are also top of the Champions League table and in the semi-finals of the Carabao Cup.Liverpool have won 22 of Slot's first 26 matches in charge in all competitions.\"It's a bit of a boring answer but as a manager you go game by game - you know how many games you have to play,\" said Slot when asked about his side being favourites for the title.\"So many teams have so much quality. \"The league table is something we are aware of but we also understand how many games there are still to play.\"Twenty one games from the end [of the season]... it's far too early to already be celebrating.\"Media caption, Analysis: How Salah leads 'hungry' Liverpool attackHome sweet homeThursday's match was Liverpool's last home game of the calendar year.They started 2024 with a 4-2 win over Newcastle which sent Klopp's side three points clear at the top before the Reds faded and finished third - nine points behind champions Manchester City.They ended the calendar year at home with a 3-1 win which leaves them in a strong position to win the league for the first time in five years.Liverpool have won 15 of their 19 league games at Anfield in 2024, dropping just 10 points.The Reds now boast the best home record in the Premier League - yet Slot is not getting carried away with Liverpool still two games from reaching the halfway point of the season.\"So many challenges are still ahead,\" added the Liverpool boss.\"Two months ago we were one point behind Manchester City and look what has happened there in terms of injuries, then you have a bit of bad luck, and then suspensions... this can happen to any team.\"Klopp's message of congratulations to JonesJones became the first player to score on his 100th Premier League appearance for Liverpool since Alex Oxlade-Chamberlain in January 2023 - and at 23 years and 331 days he was the youngest to do so for the Reds since Michael Owen in September 2000.The England midfielder was handed his Liverpool debut by Jurgen Klopp five years ago and came back to the dressing room after full-time to find a text message from his former boss.\"I normally text family and I saw a text off [Jurgen] Klopp saying 'congratulations on 100 games and here's to 500,\" added Jones.\"I was like what is he on about?' I just checked then and I am proud.\"It was him who set up the team we have now. The foundation was there and Arne Slot has carried it on.\"More on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd80/live/671ed0c0-c3e3-11ef-a2ca-e99d0c9a24e3.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003c/header\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;It doesn\u0026#39;t feel like Christmas\u0026#39; - Slot\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAt first it was just a small section of fans singing it.\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#39;Liverpool, Liverpool, top of the league... Liverpool, top of the league\u0026#39; they chanted after Curtis Jones marked his 100th Premier League appearance by sweeping his side into a 2-1 lead against struggling Leicester.\u003c/p\u003e\u003cp\u003eIt was much louder after Mohamed Salah scored his 19th club goal of the season in the 82nd minute to seal a 3-1 win.\u003c/p\u003e\u003cp\u003eHaving fallen behind in the fifth minute, Liverpool were well on their way to a win that propelled them seven points clear at the top with one game in hand on their nearest rivals.\u003c/p\u003e\u003cp\u003eOf course, Liverpool have been here before.\u003c/p\u003e\u003cp\u003eIn the 2018-19 season, they led by 10 points only for Manchester City to win the title.\u003c/p\u003e\u003cp\u003e\u0026#34;It feels different,\u0026#34; Salah, who is out of contract in the summer, told Amazon Prime about Liverpool\u0026#39;s advantage at the top after overcoming Leicester.\u003c/p\u003e\u003cp\u003e\u0026#34;But the most important thing is we need to stay humble.\u003c/p\u003e\u003cp\u003e\u0026#34;This one is very special, hopefully we win the Premier League and for this club it is something I dream of.\u003c/p\u003e\u003cp\u003e\u0026#34;The most important thing is the team winning - hopefully we win the Premier League.\u003c/p\u003e\u003cp\u003e\u0026#34;It is great, but we focus on each game and hopefully we carry on like that.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Far-too-early-to-be-celebrating\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Far too early to be celebrating\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLiverpool will move 10 points clear of nearest rivals Chelsea if they win at West Ham on Sunday as Enzo Maresca\u0026#39;s side do not play until the following day at Ipswich.\u003c/p\u003e\u003cp\u003eIt is turning into an extraordinary first season in charge for Arne Slot, who left Feyenoord to take charge of Liverpool.\u003c/p\u003e\u003cp\u003eNot only do Liverpool have a strong lead at the top of the Premier League, they are also top of the Champions League table and in the semi-finals of the Carabao Cup.\u003c/p\u003e\u003cp\u003eLiverpool have won 22 of Slot\u0026#39;s first 26 matches in charge in all competitions.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a bit of a boring answer but as a manager you go game by game - you know how many games you have to play,\u0026#34; said Slot when asked about his side being favourites for the title.\u003c/p\u003e\u003cp\u003e\u0026#34;So many teams have so much quality. \u003c/p\u003e\u003cp\u003e\u0026#34;The league table is something we are aware of but we also understand how many games there are still to play.\u003c/p\u003e\u003cp\u003e\u0026#34;Twenty one games from the end [of the season]... it\u0026#39;s far too early to already be celebrating.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eAnalysis: How Salah leads \u0026#39;hungry\u0026#39; Liverpool attack\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Home-sweet-home\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHome sweet home\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThursday\u0026#39;s match was Liverpool\u0026#39;s last home game of the calendar year.\u003c/p\u003e\u003cp\u003eThey started 2024 with a 4-2 win over Newcastle which sent Klopp\u0026#39;s side three points clear at the top before the Reds faded and finished third - nine points behind champions Manchester City.\u003c/p\u003e\u003cp\u003eThey ended the calendar year at home with a 3-1 win which leaves them in a strong position to win the league for the first time in five years.\u003c/p\u003e\u003cp\u003eLiverpool have won 15 of their 19 league games at Anfield in 2024, dropping just 10 points.\u003c/p\u003e\u003cp\u003eThe Reds now boast the best home record in the Premier League - yet Slot is not getting carried away with Liverpool still two games from reaching the halfway point of the season.\u003c/p\u003e\u003cp\u003e\u0026#34;So many challenges are still ahead,\u0026#34; added the Liverpool boss.\u003c/p\u003e\u003cp\u003e\u0026#34;Two months ago we were one point behind Manchester City and look what has happened there in terms of injuries, then you have a bit of bad luck, and then suspensions... this can happen to any team.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Klopps-message-of-congratulations-to-Jones\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eKlopp\u0026#39;s message of congratulations to Jones\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eJones became the first player to score on his 100th Premier League appearance for Liverpool since Alex Oxlade-Chamberlain in January 2023 - and at 23 years and 331 days he was the youngest to do so for the Reds since Michael Owen in September 2000.\u003c/p\u003e\u003cp\u003eThe England midfielder was handed his Liverpool debut by Jurgen Klopp five years ago and came back to the dressing room after full-time to find a text message from his former boss.\u003c/p\u003e\u003cp\u003e\u0026#34;I normally text family and I saw a text off [Jurgen] Klopp saying \u0026#39;congratulations on 100 games and here\u0026#39;s to 500,\u0026#34; added Jones.\u003c/p\u003e\u003cp\u003e\u0026#34;I was like what is he on about?\u0026#39; I just checked then and I am proud.\u003c/p\u003e\u003cp\u003e\u0026#34;It was him who set up the team we have now. The foundation was there and Arne Slot has carried it on.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-27T00:08:49.703Z",
  "modifiedTime": null
}
