{
  "id": "d9d35058-b509-45f4-b51d-fcf82e2610e8",
  "title": "'Some Man Utd players not good enough \u0026 overpaid'",
  "link": "https://www.bbc.com/sport/football/articles/c7571gng06wo",
  "description": "Some Manchester United players are \"not good enough\" and some are \"overpaid\", the club's co-owner Sir Jim Ratcliffe tells BBC sports editor Dan Roan.",
  "author": "",
  "published": "Mon, 10 Mar 2025 19:17:47 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Dan Roan",
  "length": 14938,
  "excerpt": "Some Manchester United players are \"not good enough\" and some are \"overpaid\", the club's co-owner Sir Jim Ratcliffe tells BBC sports editor Dan Roan.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Media caption, 'Club is in period of change' - Ratcliffe on United's finances \u0026 inherited playersSome Manchester United players are \"not good enough\" and some are \"overpaid\", the club's co-owner Sir Jim Ratcliffe says.Midfielder Casemiro, striker Rasmus Hojlund, goalkeeper Andre Onana, and wingers Antony and Jadon Sancho - who are on loan at other clubs - were namechecked by the billionaire in an interview with BBC Sport as players his regime had \"inherited\".Ratcliffe, a lifelong Manchester United fan, is the chairman of petrochemicals company Ineos, which has a strong sport investment arm.The 72-year-old last year spent £1.3bn for a 28.94% stake in the club in a deal which saw Ineos take control of football operations.In a wide-ranging interview, Ratcliffe addressed the side's recent struggles on the pitch - they are 14th in the Premier League table - and repeated a pledge to deliver silverware by 2028.And talking just a day after fans protested against United's ownership, he also spoke of the club's financial difficulties, saying it was set to run out of money by the end of the year without taking actions he admitted were \"unpopular\".Ratcliffe also spoke about:Marcus Rashford's departure from the club on loan to Aston VillaHow backing then sacking ex-manager Erik ten Hag - and hiring sporting director Dan Ashworth, who left after five months - were \"errors\"How he believes the club had \"come off the rails\"How he believes head coach Ruben Amorim will be at the club for \"a long time\"How he plans to make Manchester United \"the most profitable club in the world\"Plans to deliver a new world-class stadiumHis challenging first year at the clubHis sympathy with fans for some of the changes he felt needed to be madeAnd how he felt criticism over a perceived lack of support for the women's team was \"unfair\"Some players 'not good enough and probably overpaid'Image source, Getty ImagesImage caption, Sir Jim Ratcliffe's Ineos company also has sporting interests in cycling, Formula 1, athletics and sailingRatcliffe lamented the fact the club still had payments owed on players signed before he took control, citing what he said was a £17m payment still to be made for Sancho this summer.The England winger was a £73m signing from Borussia Dortmund in 2021 but returned to the German club on loan after falling out with then-United boss Ten Hag and was loaned to Chelsea at the start of the current season.\"If you look at the players we are buying this summer, that we didn't buy, we're buying Antony, we're buying Casemiro, we're buying Onana, we're buying Hojlund, we're buying Sancho. These are all things from the past, whether we like it or not, we've inherited those things and have to sort that out.\"For Sancho, who now plays for Chelsea and we pay half his wages, we're paying £17m to buy him in the summer.\"Brazil winger Antony is another on loan, at Spanish club Real Betis, after struggling at Old Trafford following an £81.5m move from Ajax.Compatriot Casemiro arrived in 2022 in a £70m deal, while Denmark striker Hojlund arrived the following year for £72m.Cameroon international Onana joined the club in the same summer for £47.2m.All those players have drawn criticism during their time at the club.\"It takes time for us to move away from the past into a new place in the future,\" Ratcliffe said.When asked whether he was suggesting those players were not good enough for Manchester United, he said: \"Some are not good enough and some probably are overpaid, but for us to mould the squad that we are fully responsible for, and accountable for, will take time.\"We've got this period of transformation where we move from the past to the future.\"There are some great players in the squad as we know, the captain is a fabulous footballer. We definitely need Bruno, he's a fantastic footballer.\"'Amorim will be there a long time'Portuguese head coach Ruben Amorim was appointed in November following the sacking of Ten Hag.The change has done little for the side's fortunes in league table terms - United have lost nine of their 26 games under him and are 36 points behind league leaders and rivals Liverpool.However a win at home to Real Sociedad this week will see them in the quarter-finals of the Europa League - and a step nearer to possible Champions League qualification, the prize for winning the competition. And Ratcliffe has given the 40-year-old his unwavering backing.He said \"a long list of injuries\" had hampered a coach who arrived mid-season into a tough league and with English as his second language.\"If I actually look at the squad which is available to Ruben, I think he is doing a really good job to be honest,\" Ratcliffe said.\"I think Ruben is an outstanding young manager. I really do. He's an excellent manager and I think he will be there for a long time.\"You are beginning to see a glimpse of what Ruben can produce. I think you saw a glimpse of it against Arsenal. How many players against Arsenal on the bench did you recognise? How many have ever worn a Manchester United shirt for [the first team]… as there's no squad left. We are down to the last 10 or 11 men in the squad really, of proper first-team players. Ruben is doing a super job.\"He also praised Amorim for attempting to put his stamp on the squad - England forward Rashford was sent on loan to Aston Villa after it became clear he was not part of the new manager's plans.\"He is, as most great coaches are, an emotional character. Ruben is not perfect but I am a great supporter of Ruben,\" he said.\"He wants a dressing room that is full of people who are totally committed to winning football matches. He won't tolerate people who don't have 100% of that attitude. The players have to be in the same box.\"Ratcliffe added he was \"pleased\" to see Rashford performing well at Villa.\"He's moved out of Manchester and maybe that's a good thing for him,\" Ratcliffe said. \"I am very pleased he is doing well. It's good to see because he has got tremendous talent, but for whatever reason it wasn't working in Manchester for the past couple of seasons. But he is a very talented footballer, Rashford.\"Ratcliffe also said players such as Rashford leaving permanently in the summer could help Amorim, who will have money to spend in the summer - despite the financial issues at the club.\"Obviously that budget changes based upon who we may choose to sell because that would supplement the budget,\" he said.And he stressed young talents such as midfielder Kobbie Mainoo and winger Alejandro Garnacho would not be up for sale just to bring in finances. \"No no. We won't be selling players because of the state we are in financially,\" he said.\"The club had got bloated so we reduced that and will finish it with a lean and efficient organisation. That's how we will address the costs. The player decisions will all be focused on how we are going to improve performance. That's all.\"'Club runs out of money at Christmas if we don't make changes'Image source, Getty ImagesImage caption, Thousands of Manchester United fans protested against the club's ownership before Sunday's Premier League fixture against ArsenalWhen Ratcliffe and Ineos joined the Old Trafford hierarchy, many fans welcomed the arrival of a boyhood fan and billionaire to help restore the club's former glories.However, a year on, the relationship with some supporters has soured.A mid-season rise in some ticket prices affecting under-16s and pensioners, and hundreds of redundancies are among the moves taken by the club which have attracted criticism, with cost-cutting measures including the removal of free lunches for staff.Ratcliffe admitted he knew moving into the club would have challenges, \"but the scale of it is probably slightly bigger\" than he expected.\"I don't enjoy reading the newspaper very much these days I have to say,\" he added. \"I know it's unpopular, and this period of change is uncomfortable for people, and some of the decisions we have to make are unpleasant. But they are necessary to put Manchester United back on to a stable footing. If people want to see Manchester United winning trophies again then we have do all this stuff.\"I recognise I'm unpopular at the moment - but I am prepared to be, and I can deal with being unpopular for a period of time because I believe that what we're doing is the right thing.\"Manchester United has come off the rails - we need to get it back on the rails, and I believe what we are doing will put it back on the rails and we'll finish up being where Liverpool or Real Madrid are today in the future.\"When the going gets tough people need to show a bit of resilience, a bit of grit - don't wilt - and come out the other side fighting and that's what we will do.\"And he revealed just how stark the financial situation at the club had been: \"Manchester United would have run out of cash by the end of this year - by the end of 2025 - after having me put $300m (£232.72m) in and if we buy no new players in the summer. \"We are in the process of change and it's an uncomfortable period and disruptive and I do feel sympathy with the fans.\"The simple answer is the club runs out of money at Christmas if we don't do those things.\"He said costs had risen and the club had been spending more than it earned for seven seasons. \"If you spend more than you earn eventually that's the road to ruin,\" he said.It was suggested to Ratcliffe that the club's level of debt and serving that debt - in the last financial year £37m was paid in interest - was a more pressing issue for fans.\"Interest is one of the costs but it isn't the biggest cost in this club,\" he said.\"And the club needs to get its house back into order so it's on a good financial footing for the future.\"Most clubs in the UK - most companies - have debt of some form. But if the club is really profitable, which I think it will be in years to come, then you can do the reverse. You can start paying down the debt. That's where I think Manchester United should be.\"Ultimately, if you look at running the club the size of Manchester United with an income of about £650m you spend a part of that £650m on operating the club and part of it on the squad.\"Where do you want to spend the money? Do you want to spend it on operating the club, or do you want to spend it on the squad? Because if you spend it on the squad you get better results. And at the end of the day what's Manchester United here for if it's not to win trophies and silverware? What we want to do is invest in the best players in the world if we can, rather than spend it on, I'm afraid, free lunches.\"My only interest here is returning Manchester United back to greatness again.\"He also said financial pressures on Ineos which led to the ending of a sponsorship deal with New Zealand All Blacks would not impact on Manchester United.'We've made errors - but can win Premier League in three years'Media caption, Sir Jim Ratcliffe talks Man Utd finances, stadium plans \u0026 Ruben AmorimRatcliffe does, though, admit not every decision taken has been the right one.\"We are not perfect, and we are on a journey, and there have been a couple of errors along the way, but I think in the main all the things we are doing are the right things for the club,\" he said.One of those errors was the hiring of sporting director Dan Ashworth - who then left the role after just five months.Ratcliffe said the \"chemistry\" was not right, leading to his departure.Backing Ten Hag in the summer, only for the Dutch coach to leave a few months later, he admitted was another mistake - it cost the club around £20m to compensate Ten Hag and his team and then bring in Amorim.\"I agree the Erik ten Tag and Dan Ashworth decisions were errors. I think there were some mitigating circumstances, but ultimately they were errors. I accept that and I apologise for that.\"If you look at the time we made the decision about Erik the management team hadn't been in place more than five minutes,\" he explained, adding that it was difficult to judge the Dutchman's performance under the previous regime.\"It became clearer three months later and we got it wrong, but we'd moved on. I think we corrected it and we are in a very different place today,\" he added.Ratcliffe believes those changes, coupled with the operational changes, will help the club to move forward and repeated his target of winning the Premier League by 2028 - the club's 150th anniversary.\"I don't think it's mission impossible. I think it's good to have goals and objectives, Ratcliffe said.\"If you look at Arsenal, if you look at Liverpool, if you look at the period of time it took them to get the house in order and get back to winning ways, that's probably slightly on the short end of the spectrum. But it's not impossible.\"The club is also preparing to announce plans that could see \"the most iconic football stadium in the world\" being built to replace the existing stadium, as part of a wider regeneration scheme.An announcement is expected on Tuesday.\"The club's going to finish up in a very very different place in three years' time to where its been in the past, in my view,\" Ratcliffe added.\"I think it will become the most profitable club in the world. I think we may well finish up with the most iconic football stadium in the world, and I think we will finish up winning silverware again.\"Women's team 'every bit as important as men's team'During his tenure, another area for criticism Ratcliffe has faced has been for how much support the women's team is receiving from the Old Trafford hierarchy.Speaking to the United We Stand fanzine last year, he described the men's team as the \"main issue\" and referred to the women's side as \"girls\" and \"an opportunity\".Such quotes were compounded by not being present as the women lifted the FA Cup, while it has been claimed he asked women's captain Katie Zelem what her role was at the club during a tour of raining facilities.So what does he make of the criticism?\"It's a bit unfair,\" Ratcliffe said.\"What I said at the beginning was my main focus is on the men's team because that, at the end of the day, is what moves the needle at Manchester United. The women's team is much smaller than the men's team.\"Of our £650m of income, £640m of that comes from the men's team and £10m comes from the women's team. With my business background you tend to focus on the bigger issues before you focus on the smaller issues.\"But the women's team wear the Manchester United brand, the Manchester United logo, so in that sense they are every bit as important as the men's team. And frankly, they are doing better than the men's team - they are second in the league and won the FA Cup last season. Marc Skinner is doing a great job as the coach and the new captain Maya [le Tissier] is doing a great job.When asked if he wanted to clear up the Zelem reports, he answered: \"No, not really. I did ask Maya if she was related to Matt [le Tissier] but the answer was no.\"More on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003c/header\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;Club is in period of change\u0026#39; - Ratcliffe on United\u0026#39;s finances \u0026amp; inherited players\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eSome Manchester United players are \u0026#34;not good enough\u0026#34; and some are \u0026#34;overpaid\u0026#34;, the club\u0026#39;s co-owner Sir Jim Ratcliffe says.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eMidfielder Casemiro, striker Rasmus Hojlund, goalkeeper Andre Onana, and wingers Antony and Jadon Sancho - who are on loan at other clubs - were namechecked by the billionaire in an interview with BBC Sport as players his regime had \u0026#34;inherited\u0026#34;.\u003c/p\u003e\u003cp\u003eRatcliffe, a lifelong Manchester United fan, is the chairman of petrochemicals company Ineos, which has a strong sport investment arm.\u003c/p\u003e\u003cp\u003eThe 72-year-old last year spent £1.3bn for a 28.94% stake in the club in a deal which saw Ineos take control of football operations.\u003c/p\u003e\u003cp\u003eIn a wide-ranging interview, Ratcliffe addressed the side\u0026#39;s recent struggles on the pitch - they are 14th in the Premier League table - and repeated a pledge to deliver silverware by 2028.\u003c/p\u003e\u003cp\u003eAnd talking just a day after fans protested against United\u0026#39;s ownership, he also spoke of the club\u0026#39;s financial difficulties, saying it was set to run out of money by the end of the year without taking actions he admitted were \u0026#34;unpopular\u0026#34;.\u003c/p\u003e\u003cp\u003eRatcliffe also spoke about:\u003c/p\u003e\u003cdiv\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003cp\u003eMarcus Rashford\u0026#39;s departure from the club on loan to Aston Villa\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHow backing then sacking ex-manager Erik ten Hag - and hiring sporting director Dan Ashworth, who left after five months - were \u0026#34;errors\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHow he believes the club had \u0026#34;come off the rails\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHow he believes head coach Ruben Amorim will be at the club for \u0026#34;a long time\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHow he plans to make Manchester United \u0026#34;the most profitable club in the world\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ePlans to deliver a new world-class stadium\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHis challenging first year at the club\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHis sympathy with fans for some of the changes he felt needed to be made\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAnd how he felt criticism over a perceived lack of support for the women\u0026#39;s team was \u0026#34;unfair\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Some-players-not-good-enough-and-probably-overpaid\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eSome players \u0026#39;not good enough and probably overpaid\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg.webp 800w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Manchester United part-owner Sir Jim Ratcliffe\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/964/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/640e/live/b69aa330-fdaa-11ef-9dc2-07adf4375293.jpg 800w\" width=\"964\" height=\"542\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eSir Jim Ratcliffe\u0026#39;s Ineos company also has sporting interests in cycling, Formula 1, athletics and sailing\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRatcliffe lamented the fact the club still had payments owed on players signed before he took control, citing what he said was a £17m payment still to be made for Sancho this summer.\u003c/p\u003e\u003cp\u003eThe England winger was \u003ca href=\"https://www.bbc.com/sport/football/57827831\"\u003ea £73m signing\u003c/a\u003e from Borussia Dortmund in 2021 but returned to the German club on loan after falling out with then-United boss Ten Hag and was loaned to Chelsea at the start of the current season.\u003c/p\u003e\u003cp\u003e\u0026#34;If you look at the players we are buying this summer, that we didn\u0026#39;t buy, we\u0026#39;re buying Antony, we\u0026#39;re buying Casemiro, we\u0026#39;re buying Onana, we\u0026#39;re buying Hojlund, we\u0026#39;re buying Sancho. These are all things from the past, whether we like it or not, we\u0026#39;ve inherited those things and have to sort that out.\u003c/p\u003e\u003cp\u003e\u0026#34;For Sancho, who now plays for Chelsea and we pay half his wages, we\u0026#39;re paying £17m to buy him in the summer.\u0026#34;\u003c/p\u003e\u003cp\u003eBrazil winger Antony is another on loan, at Spanish club Real Betis, after struggling at Old Trafford following an \u003ca href=\"https://www.bbc.com/sport/football/62718027\"\u003e£81.5m  move from Ajax.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCompatriot Casemiro \u003ca href=\"https://www.bbc.com/sport/football/62608356\"\u003earrived in 2022 in a £70m deal,\u003c/a\u003e while Denmark striker Hojlund \u003ca href=\"https://www.bbc.com/sport/football/66414526\"\u003earrived the following year\u003c/a\u003e for £72m.\u003c/p\u003e\u003cp\u003eCameroon international \u003ca href=\"https://www.bbc.com/sport/football/66254472\"\u003eOnana joined the club\u003c/a\u003e in the same summer for £47.2m.\u003c/p\u003e\u003cp\u003eAll those players have drawn criticism during their time at the club.\u003c/p\u003e\u003cp\u003e\u0026#34;It takes time for us to move away from the past into a new place in the future,\u0026#34; Ratcliffe said.\u003c/p\u003e\u003cp\u003eWhen asked whether he was suggesting those players were not good enough for Manchester United, he said: \u0026#34;Some are not good enough and some probably are overpaid, but for us to mould the squad that we are fully responsible for, and accountable for, will take time.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve got this period of transformation where we move from the past to the future.\u003c/p\u003e\u003cp\u003e\u0026#34;There are some great players in the squad as we know, the captain is a fabulous footballer. We definitely need Bruno, he\u0026#39;s a fantastic footballer.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Amorim-will-be-there-a-long-time\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Amorim will be there a long time\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePortuguese head coach Ruben Amorim was \u003ca href=\"https://www.bbc.com/sport/football/articles/cn9xv2e1199o\"\u003eappointed in November\u003c/a\u003e following the sacking of Ten Hag.\u003c/p\u003e\u003cp\u003eThe change has done little for the side\u0026#39;s fortunes in league table terms - United have lost nine of their 26 games under him and are 36 points behind league leaders and rivals Liverpool.\u003c/p\u003e\u003cp\u003eHowever a win at home to Real Sociedad this week will see them in the quarter-finals of the Europa League - and a step nearer to possible Champions League qualification, the prize for winning the competition. \u003c/p\u003e\u003cp\u003eAnd Ratcliffe has given the 40-year-old his unwavering backing.\u003c/p\u003e\u003cp\u003eHe said \u0026#34;a long list of injuries\u0026#34; had hampered a coach who arrived mid-season into a tough league and with English as his second language.\u003c/p\u003e\u003cp\u003e\u0026#34;If I actually look at the squad which is available to Ruben, I think he is doing a really good job to be honest,\u0026#34; Ratcliffe said.\u003c/p\u003e\u003cp\u003e\u0026#34;I think Ruben is an outstanding young manager. I really do. He\u0026#39;s an excellent manager and I think he will be there for a long time.\u003c/p\u003e\u003cp\u003e\u0026#34;You are beginning to see a glimpse of what Ruben can produce. I think you saw a glimpse of it against Arsenal. How many players against Arsenal on the bench did you recognise? How many have ever worn a Manchester United shirt for [the first team]… as there\u0026#39;s no squad left. We are down to the last 10 or 11 men in the squad really, of proper first-team players. Ruben is doing a super job.\u0026#34;\u003c/p\u003e\u003cp\u003eHe also praised Amorim for attempting to put his stamp on the squad - England forward Rashford was sent on loan to Aston Villa after it became clear he was not part of the new manager\u0026#39;s plans.\u003c/p\u003e\u003cp\u003e\u0026#34;He is, as most great coaches are, an emotional character. Ruben is not perfect but I am a great supporter of Ruben,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;He wants a dressing room that is full of people who are totally committed to winning football matches. He won\u0026#39;t tolerate people who don\u0026#39;t have 100% of that attitude. The players have to be in the same box.\u0026#34;\u003c/p\u003e\u003cp\u003eRatcliffe added he was \u0026#34;pleased\u0026#34; to see Rashford performing well at Villa.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s moved out of Manchester and maybe that\u0026#39;s a good thing for him,\u0026#34; Ratcliffe said. \u0026#34;I am very pleased he is doing well. It\u0026#39;s good to see because he has got tremendous talent, but for whatever reason it wasn\u0026#39;t working in Manchester for the past couple of seasons. But he is a very talented footballer, Rashford.\u0026#34;\u003c/p\u003e\u003cp\u003eRatcliffe also said players such as Rashford leaving permanently in the summer could help Amorim, who will have money to spend in the summer - despite the financial issues at the club.\u003c/p\u003e\u003cp\u003e\u0026#34;Obviously that budget changes based upon who we may choose to sell because that would supplement the budget,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eAnd he stressed young talents such as midfielder Kobbie Mainoo and winger Alejandro Garnacho would not be up for sale just to bring in finances. \u003c/p\u003e\u003cp\u003e\u0026#34;No no. We won\u0026#39;t be selling players because of the state we are in financially,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;The club had got bloated so we reduced that and will finish it with a lean and efficient organisation. That\u0026#39;s how we will address the costs. The player decisions will all be focused on how we are going to improve performance. That\u0026#39;s all.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Club-runs-out-of-money-at-Christmas-if-we-dont-make-changes\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Club runs out of money at Christmas if we don\u0026#39;t make changes\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Fans of Manchester United march and protest against the club\u0026#39;s ownership, The Glazers and Sir Jim Ratcliffe, ahead of the Premier League match between Manchester United and Arsenal at Old Trafford on 9 March.\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/8547/live/f7fc8b20-fdac-11ef-9dc2-07adf4375293.jpg 976w\" width=\"1024\" height=\"576\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eThousands of Manchester United fans protested against the club\u0026#39;s ownership before Sunday\u0026#39;s Premier League fixture against Arsenal\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWhen Ratcliffe and Ineos joined the Old Trafford hierarchy, many fans welcomed the arrival of a boyhood fan and billionaire to help restore the club\u0026#39;s former glories.\u003c/p\u003e\u003cp\u003eHowever, a year on, the relationship with some supporters has soured.\u003c/p\u003e\u003cp\u003eA mid-season \u003ca href=\"https://www.bbc.com/sport/football/articles/cvgw6y6p19eo\"\u003erise in some ticket prices\u003c/a\u003e affecting under-16s and pensioners, and \u003ca href=\"https://www.bbc.com/sport/football/articles/cx28ve6ynydo\"\u003ehundreds of redundancies\u003c/a\u003e are among the moves taken by the club which have attracted criticism, with cost-cutting measures including the removal of free lunches for staff.\u003c/p\u003e\u003cp\u003eRatcliffe admitted he knew moving into the club would have challenges, \u0026#34;but the scale of it is probably slightly bigger\u0026#34; than he expected.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t enjoy reading the newspaper very much these days I have to say,\u0026#34; he added. \u0026#34;I know it\u0026#39;s unpopular, and this period of change is uncomfortable for people, and some of the decisions we have to make are unpleasant. But they are necessary to put Manchester United back on to a stable footing. If people want to see Manchester United winning trophies again then we have do all this stuff.\u003c/p\u003e\u003cp\u003e\u0026#34;I recognise I\u0026#39;m unpopular at the moment - but I am prepared to be, and I can deal with being unpopular for a period of time because I believe that what we\u0026#39;re doing is the right thing.\u003c/p\u003e\u003cp\u003e\u0026#34;Manchester United has come off the rails - we need to get it back on the rails, and I believe what we are doing will put it back on the rails and we\u0026#39;ll finish up being where Liverpool or Real Madrid are today in the future.\u003c/p\u003e\u003cp\u003e\u0026#34;When the going gets tough people need to show a bit of resilience, a bit of grit - don\u0026#39;t wilt - and come out the other side fighting and that\u0026#39;s what we will do.\u0026#34;\u003c/p\u003e\u003cp\u003eAnd he revealed just how stark the financial situation at the club had been: \u0026#34;Manchester United would have run out of cash by the end of this year - by the end of 2025 - after having me put $300m (£232.72m) in and if we buy no new players in the summer. \u003c/p\u003e\u003cp\u003e\u0026#34;We are in the process of change and it\u0026#39;s an uncomfortable period and disruptive and I do feel sympathy with the fans.\u003c/p\u003e\u003cp\u003e\u0026#34;The simple answer is the club runs out of money at Christmas if we don\u0026#39;t do those things.\u0026#34;\u003c/p\u003e\u003cp\u003eHe said costs had risen and the club had been spending more than it earned for seven seasons. \u003c/p\u003e\u003cp\u003e\u0026#34;If you spend more than you earn eventually that\u0026#39;s the road to ruin,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eIt was suggested to Ratcliffe that the club\u0026#39;s level of debt and serving that debt - in the last financial year £37m was paid in interest - was a more pressing issue for fans.\u003c/p\u003e\u003cp\u003e\u0026#34;Interest is one of the costs but it isn\u0026#39;t the biggest cost in this club,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;And the club needs to get its house back into order so it\u0026#39;s on a good financial footing for the future.\u003c/p\u003e\u003cp\u003e\u0026#34;Most clubs in the UK - most companies - have debt of some form. But if the club is really profitable, which I think it will be in years to come, then you can do the reverse. You can start paying down the debt. That\u0026#39;s where I think Manchester United should be.\u003c/p\u003e\u003cp\u003e\u0026#34;Ultimately, if you look at running the club the size of Manchester United with an income of about £650m you spend a part of that £650m on operating the club and part of it on the squad.\u003c/p\u003e\u003cp\u003e\u0026#34;Where do you want to spend the money? Do you want to spend it on operating the club, or do you want to spend it on the squad? Because if you spend it on the squad you get better results. And at the end of the day what\u0026#39;s Manchester United here for if it\u0026#39;s not to win trophies and silverware? What we want to do is invest in the best players in the world if we can, rather than spend it on, I\u0026#39;m afraid, free lunches.\u003c/p\u003e\u003cp\u003e\u0026#34;My only interest here is returning Manchester United back to greatness again.\u0026#34;\u003c/p\u003e\u003cp\u003eHe also said financial pressures on Ineos which led to the \u003ca href=\"https://www.bbc.com/sport/rugby-union/articles/cn57nvklnypo\"\u003eending of a sponsorship deal\u003c/a\u003e with New Zealand All Blacks would not impact on Manchester United.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Weve-made-errors-but-can-win-Premier-League-in-three-years\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;We\u0026#39;ve made errors - but can win Premier League in three years\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eSir Jim Ratcliffe talks Man Utd finances, stadium plans \u0026amp; Ruben Amorim\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRatcliffe does, though, admit not every decision taken has been the right one.\u003c/p\u003e\u003cp\u003e\u0026#34;We are not perfect, and we are on a journey, and there have been a couple of errors along the way, but I think in the main all the things we are doing are the right things for the club,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eOne of those errors was the hiring of sporting director Dan Ashworth - who then left the role after just five months.\u003c/p\u003e\u003cp\u003eRatcliffe said the \u0026#34;chemistry\u0026#34; was not right, leading to his departure.\u003c/p\u003e\u003cp\u003eBacking Ten Hag in the summer, only for the Dutch coach to leave a few months later, he admitted was another mistake - it cost the club around £20m to compensate Ten Hag and his team and then bring in Amorim.\u003c/p\u003e\u003cp\u003e\u0026#34;I agree the Erik ten Tag and Dan Ashworth decisions were errors. I think there were some mitigating circumstances, but ultimately they were errors. I accept that and I apologise for that.\u003c/p\u003e\u003cp\u003e\u0026#34;If you look at the time we made the decision about Erik the management team hadn\u0026#39;t been in place more than five minutes,\u0026#34; he explained, adding that it was difficult to judge the Dutchman\u0026#39;s performance under the previous regime.\u003c/p\u003e\u003cp\u003e\u0026#34;It became clearer three months later and we got it wrong, but we\u0026#39;d moved on. I think we corrected it and we are in a very different place today,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eRatcliffe believes those changes, coupled with the operational changes, will help the club to move forward and repeated his target of winning the Premier League by 2028 - the club\u0026#39;s 150th anniversary.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t think it\u0026#39;s mission impossible. I think it\u0026#39;s good to have goals and objectives, Ratcliffe said.\u003c/p\u003e\u003cp\u003e\u0026#34;If you look at Arsenal, if you look at Liverpool, if you look at the period of time it took them to get the house in order and get back to winning ways, that\u0026#39;s probably slightly on the short end of the spectrum. But it\u0026#39;s not impossible.\u0026#34;\u003c/p\u003e\u003cp\u003eThe club is also preparing to announce plans that could see \u0026#34;the most iconic football stadium in the world\u0026#34; being built to replace the existing stadium, as part of a wider regeneration scheme.\u003c/p\u003e\u003cp\u003eAn announcement is expected on Tuesday.\u003c/p\u003e\u003cp\u003e\u0026#34;The club\u0026#39;s going to finish up in a very very different place in three years\u0026#39; time to where its been in the past, in my view,\u0026#34; Ratcliffe added.\u003c/p\u003e\u003cp\u003e\u0026#34;I think it will become the most profitable club in the world. I think we may well finish up with the most iconic football stadium in the world, and I think we will finish up winning silverware again.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Womens-team-every-bit-as-important-as-mens-team\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWomen\u0026#39;s team \u0026#39;every bit as important as men\u0026#39;s team\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDuring his tenure, another area for criticism Ratcliffe has faced has been for how much support the women\u0026#39;s team is receiving from the Old Trafford hierarchy.\u003c/p\u003e\u003cp\u003eSpeaking to the United We Stand fanzine last year, he described the men\u0026#39;s team as the \u0026#34;main issue\u0026#34; and referred to the women\u0026#39;s side as \u0026#34;girls\u0026#34; and \u0026#34;an opportunity\u0026#34;.\u003c/p\u003e\u003cp\u003eSuch quotes were compounded by not being present as the women lifted the FA Cup, while it has been claimed he asked women\u0026#39;s captain Katie Zelem what her role was at the club during a tour of raining facilities.\u003c/p\u003e\u003cp\u003eSo what does he make of the criticism?\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a bit unfair,\u0026#34; Ratcliffe said.\u003c/p\u003e\u003cp\u003e\u0026#34;What I said at the beginning was my main focus is on the men\u0026#39;s team because that, at the end of the day, is what moves the needle at Manchester United. The women\u0026#39;s team is much smaller than the men\u0026#39;s team.\u003c/p\u003e\u003cp\u003e\u0026#34;Of our £650m of income, £640m of that comes from the men\u0026#39;s team and £10m comes from the women\u0026#39;s team. With my business background you tend to focus on the bigger issues before you focus on the smaller issues.\u003c/p\u003e\u003cp\u003e\u0026#34;But the women\u0026#39;s team wear the Manchester United brand, the Manchester United logo, so in that sense they are every bit as important as the men\u0026#39;s team. And frankly, they are doing better than the men\u0026#39;s team - they are second in the league and won the FA Cup last season. Marc Skinner is doing a great job as the coach and the new captain Maya [le Tissier] is doing a great job.\u003c/p\u003e\u003cp\u003eWhen asked if he wanted to clear up the Zelem reports, he answered: \u0026#34;No, not really. I did ask Maya if she was related to Matt [le Tissier] but the answer was no.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2025-03-10T18:00:08.907Z",
  "modifiedTime": null
}
