{
  "id": "67733040-32d4-4644-9c1d-1c1c9e61f658",
  "title": "9-1-1 Season 8 Episode 12 Sees Maddie Facing Her Fears \u0026 Eddie Caught In a Lie",
  "link": "https://www.tvfanatic.com/9-1-1-season-8-episode-12-review-disconnected/",
  "description": "Maddie loses her voice while taking a call at work, while Eddie adjusts to life in Texas during 9-1-1 Season 8 Episode 12. Our review! The post 9-1-1 Season 8 Episode 12 Sees Maddie Facing Her Fears \u0026 Eddie Caught In a Lie appeared first on TV Fanatic.",
  "author": "Whitney Evans",
  "published": "Fri, 28 Mar 2025 01:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Episode Preview"
  ],
  "byline": "Whitney Evans",
  "length": 16479,
  "excerpt": "Maddie loses her voice while taking a call at work, while Eddie adjusts to life in Texas during 9-1-1 Season 8 Episode 12.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "“How do you kill a monster that’s already dead?” It’s a powerful question that Maddie must face during 9-1-1 Season 8 Episode 12 when the effects of what happened to her manifest and rob her of one of her most prized possessions. It was a heavy hour for Maddie, but it also marked the start of something new for Eddie as he started his Texas journey and reconnected with Christopher. And we got another solid hour in the back half of this entertaining eighth season. (Disney/Ray Mickshaw) 9-1-1 tends to move on very quickly from storyline to storyline, and in some ways, that can be a good thing because your show will never become stagnant when new stories are popping up at every turn. But considering the high-stakes situations this show thrives on, there are times when more exploration is necessary, and unfortunately, sometimes that is bypassed for the next big thing. We see that often, in the aftermath of traumatic situations in which characters are emotionally scarred or physically harmed, they are back to work the next episode, and nary a mention is made of what they previously endured. Thankfully, the series explored the fallout from Maddie’s kidnapping during 9-1-1 Season 8 Episode 10 because Maddie was almost killed, and it would have been doing the storyline a significant disservice not to explore Maddie’s trauma in the aftermath. Night terrors are extremely common after experiencing traumatic events. Maddie was upfront with Chimney eventually about what she was going through, and that’s been a lovely aspect of the Madney relationship to see addressed this season. (Disney/Christopher Willard) While Maddie may not have told Chimney right away about the terrors, she did tell him as a means of transparency. Since Maddie left during 9-1-1 Season 5, there has been a concentrated effort between the pair to be open and honest, especially as it relates to Maddie’s mental health. As odd as it may sound, Maddie has found the call center to be a safe place overall because it’s where she can help people. As a former nurse and now dispatcher, Maddie’s helped countless people in the worst moments of their lives, and it’s not an exaggeration to say that her voice is one of her gifts. Maddie wanted to return to work to get back to doing the job she loves, but was it too soon? Honestly, whether she’d gone back sooner or later, there was no way to prepare for her reaction to being back in the seat and on a call that would bring back into focus the last time she took a call and what happened to her as a result of that. The fact that it was a young child as well seeking help elicited its own set of fears with Maddie, and as the call progressed, her voice gradually disappeared, only exacerbating the fear until she couldn’t speak at all. (Disney/Ray Mickshaw) It was a devastating moment for Maddie, who’s been the recipient of so many devasting moments in this series, but finding out she had Psychogenic aphonia was a true kick to the gut because of everything she’d endured. She escaped a serial killer and was instrumental in Amber never being able to hurt anyone else ever again, yet even in her death, she was taking something from Maddie. She was taking her gift. You could see the pure pain on Maddie’s face as she had to sit there with Chimney and the doctor, listening to them discuss her and not being able to jump in and ask questions or advocate for herself in that moment by using her voice. Jennifer Love Hewitt was so good during this hour when she had to rely solely on her facial expressions to show the audience what the pain of losing her voice was doing to her. She was at a complete loss, and I appreciated that Chimney was right beside her, but he also didn’t have all the answers because that’s real. (Disney/Ray Mickshaw) Yes, you want to support your wife and do everything you can to help them deal with their pain, but you’re also at a loss, and all you can do is just be there so they know they’re not alone, even if you can’t fix it. For Maddie, the loss of her voice just made her even more angry on top of what she’d already been feeling about the entire situation, and to feel like there’s nothing you can do about it? Well, that has to be hell. I wasn’t sure how long they were going to have Maddie in this state because, as previously stated, there are times the series hangs onto storylines, but there are other times they work overtime to wrap things up within the hour. Were we going to see Maddie back in therapy, or could she work through this on her own? Athena stopping by to talk with Maddie was a lovely scene, and considering Maddie often doesn’t have that connection to the rest of the characters, it’s always nice when these two get together. (Disney/Ray Mickshaw) Considering Athena was closest to the situation, having worked with Amber and then succeeded in bringing her down, she was the perfect person to spend time with Maddie and help her process some of the situation. Athena has her own regrets about what happened, while Maddie certainly has hers, but it was important for her to hear from Athena of all people, who often seems like the most fearless person on the planet, that there’s a way to push through any fear or doubt she may have. Fear will only win if you let it, and Maddie may not have felt like fear was holding her back, but it certainly did play a part. Her first call back was triggering, and her fear and anxiety about what could go wrong this time left her speechless. But it did not have to be the end of it. Athena helped Maddie realize that it won’t be because she’s a fighter and stronger than maybe even she knows. I had a feeling after the conversation with Athena that this would be a case of something happening that would breakthrough Maddie’s anxiety essentially, something so big that she would be able to speak without even thinking about it. (Disney/Ray Mickshaw) And that did happen when she couldn’t spot Jee for a few minutes while out at the park, which is every parent’s worst nightmare. Jee was safe and sound within a few seconds, but that fear? The all-encompassing feeling like your heart is about to rip out of your chest fear? Maddie pushed through it all to scream out for her little girl, and it was an impactful scene for Maddie and the audience. The scars from that day with Amber and everything that came before it will take time to heal. Maddie got her voice back, but she’s still healing and will continue to. Being back at dispatch and helping people does bring her peace, and ending the hour with her back at her desk, with a deep breath in and out, was a nice way to end this part of Maddie’s healing journey. Maddie wasn’t the only one on a journey during this hour. (Disney/Ray Mickshaw) Eddie made it to Texas, and we finally got into his Texas arc, which has been teased since 9-1-1 Season 8 Episode 8. Is it odd to say that this particular storyline was entertaining but simultaneously disappointing? I have wanted to see progression in the Eddie and Christopher story all season, but they’ve never given us much. Eddie’s journey this season has been chiefly about him missing Christopher, with a side journey to starting to forgive himself. But aside from that, we saw two wildly different FaceTime calls between the father and son bookending the start of the season and the midseason point, and that was it. Christopher was still upset and standoffish with his father when we saw him briefly during 9-1-1 Season 8 Episode 1. The next time we saw him talking to Eddie, his emotions had cooled, but we never saw any of that. (Disney/Ray Mickshaw) All we saw was Eddie feeling like his son was slipping away from him. And in that moment, he knew that he’d given Christopher long enough and needed to be where he was. Eddie left Los Angeles to be there for Christopher and more present in his life than he had been in the last few months. Uprooting his whole world was necessary for him to be the present father he has strived so hard to be. So, now we get Eddie in Texas, but we don’t get a single conversation about anything that preceded Christopher’s decision to live with his grandparents. Am I asking them to continuously discuss what happened with Kim? Absolutely not, but we haven’t even seen Eddie have an honest conversation with Christopher about his feelings surrounding Shannon and why he started a friendship with Kim. If those types of conversations have occurred or are occurring, they have all been conducted off-screen, which greatly undermines the integrity of this storyline. (Disney/Ray Mickshaw) Eddie has apologized but Christopher’s not a seven-year-old kid anymore. He’s old enough to listen to his father explain why he made certain decisions and his recognition of the pain it caused him. If those kinds of conversations have taken place or are taking place, they’ve all been off-screen. When we meet Eddie in Texas, not much time has passed, but from the first time we see Eddie and Christopher interact, there’s another noticeable shift between the pair, and you can’t help but wonder how they got from point A to point B. Eddie was doing his Eddie thing in Texas, which was trying to find work and doing whatever he could to get Christopher to like him again. And as sad as that may sound, it’s not uncommon for a parent to feel like they’ve let down their child. Eddie has been in a fog ever since Christopher left, but being back with him physically didn’t automatically lift it. There was still a chasm, probably because they still hadn’t had those tough conversations. (Disney/Ray Mickshaw) Buying the PS5 felt like bribery, but not so much for his love as just a semblance of affection. Christopher has always been so proud of and reverent of his father, and suddenly, having your son start to feel like a stranger and wonder whether they even like you much anymore is a devastating feeling. Eddie wasn’t ready to face any of that head-on, so he chose to lean into a lie rather than be honest with Christopher—and his folks, for that matter. 9-1-1 has a serious parent issue, as in a lot of the adult characters’ parents are just messy people with a variety of issues and questionable parenting skills, and the Diaz parents have always fit into that mold. And while we’ve seen Ramon and Eddie start to repair their relationship over the years, we can’t say the same for Eddie and Helena, and you could tell at that dinner that she was more than ready to overstep Eddie the minute the opportunity arose. (Disney/Ray Mickshaw) She’s always wanted to parent Christopher the way she saw fit and the way she thought he needed, bypassing her son. She’s seemingly unaware (or maybe all too aware) of how her meddling comes across, but she seems uncaring because she thinks she’s always right. Helena has always presented as knowing better than Eddie, like she had a leg up because she was there at the beginning when Eddie was away and trying to provide for his family. And instead of being supportive upon his return, she felt to assert herself as the better option for his own son. So, these past months in Texas have been about Helena living her best life and getting to parent Christopher the way she’s always thought he should be parented. There’s a lot of good story to mine there, especially with Ramon seemingly in the middle, but also not because he never actually says anything to Helena when it’s needed, but we took a huge detour from any of that to get into Eddie’s Uber arc, which was fun but also extremely random. Eddie not getting to be a firefighter was obviously devastating from a professional standpoint because he was banking on that job, but it also devastated him because he felt like it was one more way to disappoint Christopher. (Disney/Ray Mickshaw) Did he think he would get away with lying to Christopher and his parents until Captain Morales came around in a few months and told him the hiring freeze was up? Eddie was so desperate to prevent himself from failing that he didn’t think beyond his limited scope of what he could do in the moment to prevent the rift with Christopher from growing even further. Obviously, with his main support system in Los Angeles, Eddie took every opportunity to FaceTime Buck when he was feeling down, and he needed Buck’s reassurance and advice perhaps more than he needed anything. When Eddie mentioned packing up his ball and going home after not getting the firefighter job, he needed Buck’s gentle but firm reminder that he wasn’t there to do anything but be Christopher’s father, and that was to remain his number one priority. Eddie felt so bad for himself that he really needed someone who understood him better than anyone to tell it to him straight and not hold back. (Disney/Christopher Willard) And that’s always been the beauty of Buck and Eddie’s relationship. There’s a trust there that allows them to be vulnerable in a way they aren’t always with others in their life. Eddie going from that conversation to doubling down on the lie and becoming the best Uber driver he could be was a highlight of the hour. There’s a misconception about Eddie that he’s stoic and just walking sarcasm, but there’s a talkative, personable oversharer buried deep down in there, and it came out in full force while driving people around. The poor guy was incapable of reading the room, and it was embarrassing but also a little endearing because you’d swear he’d never been around people in his life with the way he was acting. Getting his act together and basically becoming an Uber driver chameleon was the only way he would ever excel at that job, and it was good to see him finding some joy, even if it was somewhat fleeting and tied to a lie. Joy is joy sometimes, people! (Disney/Ray Mickshaw) It was always going to come crashing down because you can’t tell a lie as elaborate as having a whole job you don’t have and assume you’ll never get caught. While I was fearful that this would cause a setback in Christopher and Eddie’s relationship, it doing the opposite was a nice surprise, but once again, it felt like a missed opportunity for the two of them to talk about the past. Their talk was sweet, don’t get me wrong, and it was good to see Christopher vocalize his desire to have his father there with him, but it felt like, again, we missed so many steps to get there. Christopher moving away, and Eddie subsequently moving away, WAS a BIG deal. Of course, we wanted to get to the point of seeing them reunite again, but we missed so much of what actually got them there. That’s why this was an entertaining story overall, but it also left me wanting so much more in the end. (Disney/Ray Mickshaw) Loose Ends RIP Denali, and hello, Toyota Prius! That truck has been a part of Eddie since the fight club days, so it seemed fitting that he got rid of it now when he was back in Texas and purging so much of his LA life. No truck, no firefighting. God, I hate to think what could be next. There was no follow-up on last week’s development of the Buck and Eddie of it all. But we still have six more hours to go this season! The pizza guy in the parking garage was an acceptable emergency, but it didn’t really fit in the rest of the hour. It was like they forgot there was no real emergency outside of the one with Maddie and just threw it in there for giggles. Eddie’s wardrobe morphing back into a spread from Texas Digest was jarring! And that Texas house is a hot mess. Can Buck visit so Eddie can get a second opinion on how to make that place really pop? (Disney/Ray Mickshaw) Even if I was disappointed with certain choices, it was another fun hour, and you can’t take that away from it! As always, I would love to hear what you thought about this one and what you’re looking forward to seeing over the rest of the season! Please drop your comments below so we can discuss. You can watch 9-1-1 on ABC at 8/7c on Thursdays. Username or Email AddressPassword Watch 9-1-1 Online TV Fanatic is searching for passionate contributors to share their voices across various article types. Think you have what it takes to be a TV Fanatic? Click here for more information and next steps.",
  "image": "https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-841178\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003e“How do you kill a monster that’s already dead?”\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s a powerful question that Maddie must face during \u003ca href=\"https://www.tvfanatic.com/shows/9-1-1/\"\u003e9-1-1\u003c/a\u003e Season 8 Episode 12 when the effects of what happened to her manifest and rob her of one of her most prized possessions.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was a heavy hour for Maddie, but it also marked the start of something new for Eddie as he started his Texas journey and reconnected with Christopher. And we got another solid hour in the back half of this entertaining eighth season.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-819x1024.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-1639x2048.jpg 1639w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1.jpg 1921w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0745-1.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e9-1-1 tends to move on very quickly from storyline to storyline, and in some ways, that can be a good thing because your show will never become stagnant when new stories are popping up at every turn.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut considering the high-stakes situations this show thrives on, there are times when more exploration is necessary, and unfortunately, sometimes that is bypassed for the next big thing.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe see that often, in the aftermath of traumatic situations in which characters are emotionally scarred or physically harmed, they are back to work the next episode, and nary a mention is made of what they previously endured.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThankfully, the series explored the fallout from Maddie’s kidnapping during \u003ca href=\"https://www.tvfanatic.com/9-1-1-season-8-episode-10-review-voices/\"\u003e9-1-1 Season 8 Episode 10\u003c/a\u003e because Maddie was almost killed, and it would have been doing the storyline a significant disservice not to explore Maddie’s trauma in the aftermath.\u003c/p\u003e\n\n\n\n\u003cp\u003eNight terrors are extremely common after experiencing traumatic events. Maddie was upfront with Chimney eventually about what she was going through, and that’s been a lovely aspect of the Madney relationship to see addressed this season.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/175814_0039.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/175814_0039-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/175814_0039-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/175814_0039-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/175814_0039-1638x2048.jpg 1638w, https://cdn.tvfanatic.com/uploads/2025/03/175814_0039-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/175814_0039-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/175814_0039.jpg 1915w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/175814_0039.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Christopher Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWhile Maddie may not have told Chimney right away about the terrors, she did tell him as a means of transparency. Since Maddie left during \u003ca href=\"https://www.tvfanatic.com/shows/9-1-1/?season=season-5\"\u003e9-1-1 Season 5\u003c/a\u003e, there has been a concentrated effort between the pair to be open and honest, especially as it relates to Maddie’s mental health.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs odd as it may sound, Maddie has found the call center to be a safe place overall because it’s where she can help people. As a former nurse and now dispatcher, Maddie’s helped countless people in the worst moments of their lives, and it’s not an exaggeration to say that her voice is one of her gifts.\u003c/p\u003e\n\n\n\n\u003cp\u003eMaddie wanted to return to work to get back to doing the job she loves, but was it too soon?\u003c/p\u003e\n\n\n\n\u003cp\u003eHonestly, whether she’d gone back sooner or later, there was no way to prepare for her reaction to being back in the seat and on a call that would bring back into focus the last time she took a call and what happened to her as a result of that.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe fact that it was a young child as well seeking help elicited its own set of fears with Maddie, and as the call progressed, her voice gradually disappeared, only exacerbating the fear until she couldn’t speak at all.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"820\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176090_0179.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176090_0179-820x1024.jpg 820w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0179-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0179-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0179-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0179-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0179.jpg 1600w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176090_0179.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt was a devastating moment for Maddie, who’s been the recipient of so many devasting moments in this series, but finding out she had Psychogenic aphonia was a true kick to the gut because of everything she’d endured.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe escaped a serial killer and was instrumental in Amber never being able to hurt anyone else ever again, yet even in her death, she was taking something from Maddie. She was taking her gift.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eYou could see the pure pain on Maddie’s face as she had to sit there with Chimney and the doctor, listening to them discuss her and not being able to jump in and ask questions or advocate for herself in that moment by using her voice.\u003c/p\u003e\n\n\n\n\u003cp\u003eJennifer Love Hewitt was so good during this hour when she had to rely solely on her facial expressions to show the audience what the pain of losing her voice was doing to her.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe was at a complete loss, and I appreciated that Chimney was right beside her, but he also didn’t have all the answers because that’s real.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176090_0017.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176090_0017-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0017-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0017-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0017-1638x2048.jpg 1638w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0017-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0017-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176090_0017.jpg 1920w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176090_0017.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eYes, you want to support your wife and do everything you can to help them deal with their pain, but you’re also at a loss, and all you can do is just be there so they know they’re not alone, even if you can’t fix it.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor Maddie, the loss of her voice just made her even more angry on top of what she’d already been feeling about the entire situation, and to feel like there’s nothing you can do about it? Well, that has to be hell.\u003c/p\u003e\n\n\n\n\u003cp\u003eI wasn’t sure how long they were going to have Maddie in this state because, as previously stated, there are times the series hangs onto storylines, but there are other times they work overtime to wrap things up within the hour.\u003c/p\u003e\n\n\n\n\u003cp\u003eWere we going to see Maddie back in therapy, or could she work through this on her own?\u003c/p\u003e\n\n\n\n\u003cp\u003eAthena stopping by to talk with Maddie was a lovely scene, and considering Maddie often doesn’t have that connection to the rest of the characters, it’s always nice when these two get together.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"683\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-683x1024.jpg 683w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-768x1152.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-1365x2048.jpg 1365w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-640x960.jpg 640w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-720x1080.jpg 720w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-800x1200.jpg 800w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-scaled.jpg 1707w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176209_0221-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eConsidering Athena was closest to the situation, having worked with Amber and then succeeded in bringing her down, she was the perfect person to spend time with Maddie and help her process some of the situation.\u003c/p\u003e\n\n\n\n\u003cp\u003eAthena has her own regrets about what happened, while Maddie certainly has hers, but it was important for her to hear from Athena of all people, who often seems like the most fearless person on the planet, that there’s a way to push through any fear or doubt she may have.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eFear will only win if you let it, and Maddie may not have felt like fear was holding her back, but it certainly did play a part.\u003c/p\u003e\n\n\n\n\u003cp\u003eHer first call back was triggering, and her fear and anxiety about what could go wrong this time left her speechless. But it did not have to be the end of it. Athena helped Maddie realize that it won’t be because she’s a fighter and stronger than maybe even she knows.\u003c/p\u003e\n\n\n\n\u003cp\u003eI had a feeling after the conversation with Athena that this would be a case of something happening that would breakthrough Maddie’s anxiety essentially, something so big that she would be able to speak without even thinking about it.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176208_0632.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176208_0632-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0632-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0632-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0632-1638x2048.jpg 1638w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0632-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0632-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0632.jpg 2000w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176208_0632.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAnd that did happen when she couldn’t spot Jee for a few minutes while out at the park, which is every parent’s worst nightmare.\u003c/p\u003e\n\n\n\n\u003cp\u003eJee was safe and sound within a few seconds, but that fear? The all-encompassing feeling like your heart is about to rip out of your chest fear? Maddie pushed through it all to scream out for her little girl, and it was an impactful scene for Maddie and the audience.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe scars from that day with Amber and everything that came before it will take time to heal.\u003c/p\u003e\n\n\n\n\u003cp\u003eMaddie got her voice back, but she’s still healing and will continue to. Being back at dispatch and helping people does bring her peace, and ending the hour with her back at her desk, with a deep breath in and out, was a nice way to end this part of Maddie’s healing journey.\u003c/p\u003e\n\n\n\n\u003cp\u003eMaddie wasn’t the only one on a journey during this hour.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176192_0066.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176192_0066-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0066-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0066-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0066-1638x2048.jpg 1638w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0066-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0066-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0066.jpg 1920w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176192_0066.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEddie made it to Texas, and we finally got into his Texas arc, which has been teased since \u003ca href=\"https://www.tvfanatic.com/9-1-1-season-8-episode-8-review-wannabes/\"\u003e9-1-1 Season 8 Episode 8.\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIs it odd to say that this particular storyline was entertaining but simultaneously disappointing?\u003c/p\u003e\n\n\n\n\u003cp\u003eI have wanted to see progression in the Eddie and Christopher story all season, but they’ve never given us much. Eddie’s journey this season has been chiefly about him missing Christopher, with a side journey to starting to forgive himself.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eBut aside from that, we saw two wildly different FaceTime calls between the \u003ca href=\"https://www.tvfanatic.com/tvs-most-complicated-father-son-relationships/\"\u003efather and son\u003c/a\u003e bookending the start of the season and the midseason point, and that was it.\u003c/p\u003e\n\n\n\n\u003cp\u003eChristopher was still upset and standoffish with his father when we saw him briefly during \u003ca href=\"https://www.tvfanatic.com/9-1-1-season-8-episode-1-review-buzzkill/\"\u003e9-1-1 Season 8 Episode 1\u003c/a\u003e. The next time we saw him talking to Eddie, his emotions had cooled, but we never saw any of that.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"819\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0896.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-1024x819.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-300x240.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-768x614.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-2048x1638.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-960x768.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-1080x864.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0896-1200x960.jpg 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0896.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAll we saw was Eddie feeling like his son was slipping away from him. And in that moment, he knew that he’d given Christopher long enough and needed to be where he was.\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie left Los Angeles to be there for Christopher and more present in his life than he had been in the last few months. Uprooting his whole world was necessary for him to be the present father he has strived so hard to be.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, now we get Eddie in Texas, but we don’t get a single conversation about anything that preceded Christopher’s decision to live with his grandparents.\u003c/p\u003e\n\n\n\n\u003cp\u003eAm I asking them to continuously discuss what happened with Kim? Absolutely not, but we haven’t even seen Eddie have an honest conversation with Christopher about his feelings surrounding Shannon and why he started a friendship with Kim. \u003c/p\u003e\n\n\n\n\u003cp\u003eIf those types of conversations have occurred or are occurring, they have all been conducted off-screen, which greatly undermines the integrity of this storyline.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"682\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-682x1024.jpg 682w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-768x1153.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-1365x2048.jpg 1365w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-640x960.jpg 640w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-720x1080.jpg 720w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-800x1200.jpg 800w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-scaled.jpg 1706w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0821-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEddie has apologized but Christopher’s not a seven-year-old kid anymore. He’s old enough to listen to his father explain why he made certain decisions and his recognition of the pain it caused him.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf those kinds of conversations have taken place or are taking place, they’ve all been off-screen.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen we meet Eddie in Texas, not much time has passed, but from the first time we see Eddie and Christopher interact, there’s another noticeable shift between the pair, and you can’t help but wonder how they got from point A to point B.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eEddie was doing his Eddie thing in Texas, which was trying to find work and doing whatever he could to get Christopher to like him again. And as sad as that may sound, it’s not uncommon for a parent to feel like they’ve let down their child.\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie has been in a fog ever since Christopher left, but being back with him physically didn’t automatically lift it. There was still a chasm, probably because they still hadn’t had those tough conversations.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"731\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-1024x731.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-300x214.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-768x549.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-2048x1463.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-960x686.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-1080x771.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-1200x857.jpg 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0721-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBuying the PS5 felt like bribery, but not so much for his love as just a semblance of affection.\u003c/p\u003e\n\n\n\n\u003cp\u003eChristopher has always been so proud of and reverent of his father, and suddenly, having your son start to feel like a stranger and wonder whether they even like you much anymore is a devastating feeling.\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie wasn’t ready to face any of that head-on, so he chose to lean into a lie rather than be honest with Christopher—and his folks, for that matter.\u003c/p\u003e\n\n\n\n\u003cp\u003e9-1-1 has a serious parent issue, as in a lot of the adult characters’ parents are just messy people with a variety of issues and questionable parenting skills, and the Diaz parents have always fit into that mold.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd while we’ve seen Ramon and Eddie start to repair their relationship over the years, we can’t say the same for Eddie and Helena, and you could tell at that dinner that she was more than ready to overstep Eddie the minute the opportunity arose.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-1638x2048.jpg 1638w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-scaled.jpg 2047w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176208_0432-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eShe’s always wanted to parent Christopher the way she saw fit and the way she thought he needed, bypassing her son. She’s seemingly unaware (or maybe all too aware) of how her meddling comes across, but she seems uncaring because she thinks she’s always right.\u003c/p\u003e\n\n\n\n\u003cp\u003eHelena has always presented as knowing better than Eddie, like she had a leg up because she was there at the beginning when Eddie was away and trying to provide for his family. And instead of being supportive upon his return, she felt to assert herself as the better option for his own son.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, these past months in Texas have been about Helena living her best life and getting to parent Christopher the way she’s always thought he should be parented.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThere’s a lot of good story to mine there, especially with Ramon seemingly in the middle, but also not because he never actually says anything to Helena when it’s needed, but we took a huge detour from any of that to get into Eddie’s Uber arc, which was fun but also extremely random.\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie not getting to be a firefighter was obviously devastating from a professional standpoint because he was banking on that job, but it also devastated him because he felt like it was one more way to disappoint Christopher.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-1638x2048.jpg 1638w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-scaled.jpg 2047w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176192_0071-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eDid he think he would get away with lying to Christopher and his parents until Captain Morales came around in a few months and told him the hiring freeze was up?\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie was so desperate to prevent himself from failing that he didn’t think beyond his limited scope of what he could do in the moment to prevent the rift with Christopher from growing even further.\u003c/p\u003e\n\n\n\n\u003cp\u003eObviously, with his main support system in Los Angeles, Eddie took every opportunity to FaceTime Buck when he was feeling down, and he needed Buck’s reassurance and advice perhaps more than he needed anything.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Eddie mentioned packing up his ball and going home after not getting the firefighter job, he needed Buck’s gentle but firm reminder that he wasn’t there to do anything but be Christopher’s father, and that was to remain his number one priority.\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie felt so bad for himself that he really needed someone who understood him better than anyone to tell it to him straight and not hold back.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"819\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176322_0814.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176322_0814-819x1024.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0814-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0814-768x960.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0814-864x1080.jpg 864w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0814-960x1200.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0814.jpg 1600w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176322_0814.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Christopher Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAnd that’s always been the beauty of Buck and Eddie’s relationship. There’s a trust there that allows them to be vulnerable in a way they aren’t always with others in their life.\u003c/p\u003e\n\n\n\n\u003cp\u003eEddie going from that conversation to doubling down on the lie and becoming the best Uber driver he could be was a highlight of the hour.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s a misconception about Eddie that he’s stoic and just walking sarcasm, but there’s a talkative, personable oversharer buried deep down in there, and it came out in full force while driving people around.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe poor guy was incapable of reading the room, and it was embarrassing but also a little endearing because you’d swear he’d never been around people in his life with the way he was acting.\u003c/p\u003e\n\n\n\n\u003cp\u003eGetting his act together and basically becoming an Uber driver chameleon was the only way he would ever excel at that job, and it was good to see him finding some joy, even if it was somewhat fleeting and tied to a lie. Joy is joy sometimes, people!\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"731\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-1024x731.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-300x214.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-768x548.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-2048x1463.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-960x686.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-1080x771.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-1200x857.jpg 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176086_0808-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt was always going to come crashing down because you can’t tell a lie as elaborate as having a whole job you don’t have and assume you’ll never get caught.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile I was fearful that this would cause a setback in Christopher and Eddie’s relationship, it doing the opposite was a nice surprise, but once again, it felt like a missed opportunity for the two of them to talk about the past.\u003c/p\u003e\n\n\n\n\u003cp\u003eTheir talk was sweet, don’t get me wrong, and it was good to see Christopher vocalize his desire to have his father there with him, but it felt like, again, we missed so many steps to get there.\u003c/p\u003e\n\n\n\n\u003cp\u003eChristopher moving away, and Eddie subsequently moving away, WAS a BIG deal. Of course, we wanted to get to the point of seeing them reunite again, but we missed so much of what actually got them there.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s why this was an entertaining story overall, but it also left me wanting so much more in the end.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"819\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-1024x819.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-300x240.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-768x614.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-2048x1638.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-960x768.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-1080x864.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-1200x960.jpg 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176209_0088-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eLoose Ends\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eRIP Denali, and hello, Toyota Prius! That truck has been a part of Eddie since the fight club days, so it seemed fitting that he got rid of it now when he was back in Texas and purging so much of his LA life. No truck, no firefighting. God, I hate to think what could be next.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThere was no follow-up on last week’s development of the Buck and Eddie of it all. But we still have six more hours to go this season!\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe pizza guy in the parking garage was an acceptable emergency, but it didn’t really fit in the rest of the hour. It was like they forgot there was no real emergency outside of the one with Maddie and just threw it in there for giggles.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eEddie’s wardrobe morphing back into a spread from Texas Digest was jarring! And that Texas house is a hot mess. Can Buck visit so Eddie can get a second opinion on how to make that place really pop?\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"821\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-821x1024.jpg 821w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-241x300.jpg 241w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-768x958.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-1642x2048.jpg 1642w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-770x960.jpg 770w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-866x1080.jpg 866w, https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-962x1200.jpg 962w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/176322_0382-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Ray Mickshaw)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEven if I was disappointed with certain choices, it was another fun hour, and you can’t take that away from it!\u003c/p\u003e\n\n\n\n\u003cp\u003eAs always, I would love to hear what you thought about this one and what you’re looking forward to seeing over the rest of the season!\u003c/p\u003e\n\n\n\n\u003cp\u003ePlease drop your comments below so we can discuss.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eYou can watch 9-1-1 on ABC at 8/7c on Thursdays.\u003c/strong\u003e\u003c/p\u003e\n\n\n\u003cdiv data-id=\"749\" data-temp=\"basic\" data-skin=\"minimal\" data-cscheme=\"black\" data-cap=\"0\" data-access=\"guest,wordpress\" data-tid=\"\" data-uid=\"b47a3bce0a9cfa0fca0c577489fab247\" data-pid=\"841178\" data-resdet=\"percentages\" data-show-results-to=\"guest,registered\" data-show-results-moment=\"after-vote\" data-show-results-only=\"false\" data-show-message=\"true\" data-show-results-as=\"bar\" data-sort-results-by=\"as-defined\" data-sort-results-rule=\"asc\" data-is-ended=\"0\" data-gdpr=\"no\" data-gdpr-sol=\"consent\" data-css=\".basic-yop-poll-container[data-uid] .basic-vote { text-align: center; }\" data-counter=\"0\" data-load-with=\"1\" data-notification-section=\"top\"\u003e\u003cp\u003e\u003clabel\u003eUsername or Email Address\u003c/label\u003e\u003c/p\u003e\u003cp\u003e\u003clabel\u003ePassword\u003c/label\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch 9-1-1 Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eTV Fanatic is searching for passionate contributors to share their voices across various article types. Think you have what it takes to be a TV Fanatic? \u003ca href=\"https://www.tvfanatic.com/writers-wanted-tv-fanatic-passion-enthusiasm/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eClick here\u003c/a\u003e for more information and next steps.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-03-28T01:00:00Z",
  "modifiedTime": "2025-03-26T23:57:58Z"
}
