{
  "id": "7e6061cd-3442-49ca-8426-7e12cf4d5a93",
  "title": "Jeanine Pirro Exits Fox News to Be President Trump’s Interim U.S. Attorney in Washington",
  "link": "https://tvline.com/news/jeanine-pirro-leaving-the-five-fox-news-us-attorney-dc-1235447411/",
  "description": "Jeanine Pirro has stepped down from her roles at Fox News Channel — her bio page is already removed — after being tapped by President Donald Trump on Thursday to serve as Interim U.S. Attorney in Washington. “I am pleased to announce that Judge Jeanine Pirro will be appointed interim United States Attorney for the […]",
  "author": "Matt Webb Mitovich",
  "published": "Fri, 09 May 2025 01:09:08 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "News",
    "Donald Trump",
    "Fox News Channel",
    "Jeanine Pirro"
  ],
  "byline": "Matt Webb Mitovich",
  "length": 1630,
  "excerpt": "Jeanine Pirro has stepped down from her roles at Fox News after being tapped by President Trump to serve as Interim U.S. Attorney in Washington.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Jeanine Pirro has stepped down from her roles at Fox News Channel — her bio page is already removed — after being tapped by President Donald Trump on Thursday to serve as Interim U.S. Attorney in Washington. “I am pleased to announce that Judge Jeanine Pirro will be appointed interim United States Attorney for the District of Columbia,” President trump announced Thursday on Truth Social. “Jeanine is incredibly well qualified for this position, and is considered one of the Top District Attorneys in the History of the State of New York. She is in a class by herself. Congratulations Jeanine!” In a statement, a Fox News spokesperson said, “Jeanine Pirro has been a wonderful addition to The Five over the last three years and a longtime beloved host across Fox News Media who contributed greatly to our success throughout her 14-year tenure. We wish her all the best in her new role in Washington.” A rotation of Fox News personalities will fill Pirro’s seat on The Five until a new, full-time co-host is named.  Trump had originally chosen Ed Martin Jr. to serve as Interim U.S. Attorney in Washington. But when Sen. Thom Tillis, a key Republican on the Senate Judiciary Committee, said earlier this week that he would not support Martin’s nomination — because of his defense of January 6th rioters — Trump pulled his pick and switched it to Pirro, a former Republican district attorney of Westchester County, N.Y. Martin “seems like a good man,” Tillis told reporters on Tuesday, but “anybody that breached the perimeter” of the Capitol on Jan. 6, 2021 “should have been imprisoned for some period of time.”",
  "image": "https://tvline.com/wp-content/uploads/2025/05/jeanine-pirro-1.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003e\u003ca href=\"https://tvline.com/t/jeanine-pirro/\" id=\"auto-tag_jeanine-pirro_1\" data-tag=\"jeanine-pirro\"\u003eJeanine Pirro\u003c/a\u003e has stepped down from her roles at \u003ca href=\"https://tvline.com/t/fox-news-channel/\" id=\"auto-tag_fox-news-channel_1\" data-tag=\"fox-news-channel\"\u003eFox News Channel\u003c/a\u003e — her bio page is already removed — after being tapped by President \u003ca href=\"https://tvline.com/t/donald-trump/\" id=\"auto-tag_donald-trump_1\" data-tag=\"donald-trump\"\u003eDonald Trump\u003c/a\u003e on Thursday to serve as Interim U.S. Attorney in Washington.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I am pleased to announce that Judge Jeanine Pirro will be appointed interim United States Attorney for the District of Columbia,” President trump announced Thursday on Truth Social. “Jeanine is incredibly well qualified for this position, and is considered one of the Top District Attorneys in the History of the State of New York. She is in a class by herself. Congratulations Jeanine!”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eIn a statement, a Fox News spokesperson said, “Jeanine Pirro has been a wonderful addition to \u003cem\u003eThe Five\u003c/em\u003e over the last three years and a longtime beloved host across Fox News Media who contributed greatly to our success throughout her 14-year tenure. We wish her all the best in her new role in Washington.”\u003c/p\u003e\n\n\n\n\u003cp\u003eA rotation of Fox News personalities will fill Pirro’s seat on \u003cem\u003eThe Five\u003c/em\u003e until a new, full-time co-host is named. \u003c/p\u003e\n\n\n\n\u003cp\u003eTrump had originally chosen Ed Martin Jr. to serve as Interim U.S. Attorney in Washington. But when Sen. Thom Tillis, a key Republican on the Senate Judiciary Committee, said earlier this week that he would not support Martin’s nomination — because of his defense of January 6th rioters — Trump pulled his pick and switched it to Pirro, a former Republican district attorney of Westchester County, N.Y.\u003c/p\u003e\n\n\n\n\u003cp\u003eMartin “seems like a good man,” Tillis told reporters on Tuesday, but “anybody that breached the perimeter” of the Capitol on Jan. 6, 2021 “should have been imprisoned for some period of time.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-09T01:09:08Z",
  "modifiedTime": "2025-05-09T01:09:13Z"
}
