{
  "id": "8b5e09fa-5a6a-4f1f-b83d-c73fa8e989e8",
  "title": "Casting News: A Hallmark Movie Reunion, Animal Control Addition and More",
  "link": "https://tvline.com/casting-news/erin-krakow-hallmark-christmas-movie-tyler-hynes-1235478164/",
  "description": "Erin Krakow (When Calls the Heart) and Tyler Hynes (the Groomsmen franchise) — who previously starred in the 2021 Hallmark Channel telepic It Was Always You — will reunite for the cabler’s Christmas Above the Clouds holiday movie, which is described as “a comedic, modern day reimagining of A Christmas Carol.” The premise: When a […]",
  "author": "Matt Webb Mitovich",
  "published": "Fri, 25 Jul 2025 00:40:18 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "Casting News",
    "Animal Control",
    "Brandy Norwood",
    "casting-news",
    "erin krakow",
    "Finding Mr. Christmas",
    "Hallmark Channel",
    "Tyler Hynes"
  ],
  "byline": "Matt Webb Mitovich",
  "length": 1877,
  "excerpt": "A Hallmark Channel reunion and 'Finding Mr. Christmas' Season 2 news are among the latest casting updates.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Erin Krakow (When Calls the Heart) and Tyler Hynes (the Groomsmen franchise) — who previously starred in the 2021 Hallmark Channel telepic It Was Always You — will reunite for the cabler’s Christmas Above the Clouds holiday movie, which is described as “a comedic, modern day reimagining of A Christmas Carol.” The premise: When a workaholic CEO (played by Krakow) tries to skip Christmas by flying to Australia, “she’s in for the flight of her life,” the synopsis tells us. “Haunted by her past, present, and future, she’s forced to confront the choices that led to her success yet left her flying solo. With the help of three quirky spirits and a surprise reunion with her ex (Hynes), she might just rediscover the magic of Christmas — and the love she thought she’d lost.” We’re all rooting for her, to be sure! In other recent casting news: *Speaking of Hallmark…. Season 2 of its Finding Mr. Christmas reality competition will feature as guest judges Janel Parrish (Pretty Little Liars), Heather Hemmens (Roswell, New Mexico), Alison Sweeney (Days of Our Lives, Hannah Swensen Mysteries), Hunter King (Holiday Touchdown: A Chiefs Love Story), Ashley Williams, Sharon Lawrence, Hallmark superfans Gail and Alicia (both featured in Christmas at Sea) and Erin Krakow (When Calls the Heart). * Fox’s Animal Control has added Kyla Pratt (Call Me Kat) in the Season 4 role of Daisy, a new member of the Seattle Animal Control squad who serves as Templeton Dudge’s partner, Variety reports. * Brandy Norwood will star in the Lifetime holiday movie Christmas Everyday along with her real-life daughter Sy’Rai Smith. Brandy plays Francine “Fancy” Ballantine, a fashion designer who is determined to uphold her family’s Christmas traditions while planning her baby sister’s (Smith) wedding. Hit the comments with your thoughts on the castings above!",
  "image": "https://tvline.com/wp-content/uploads/2025/07/krakow-hynes-hallmark-it-was-always-you.png?w=350",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003e\u003ca href=\"https://tvline.com/t/erin-krakow/\" id=\"auto-tag_erin-krakow\" data-tag=\"erin-krakow\"\u003eErin Krakow\u003c/a\u003e (\u003cem\u003eWhen Calls the Heart\u003c/em\u003e) and \u003ca href=\"https://tvline.com/t/tyler-hynes/\" id=\"auto-tag_tyler-hynes\" data-tag=\"tyler-hynes\"\u003eTyler Hynes\u003c/a\u003e (the \u003cem\u003eGroomsmen\u003c/em\u003e franchise) — who previously starred in the 2021 \u003ca href=\"https://tvline.com/t/hallmark-channel/\" id=\"auto-tag_hallmark-channel\" data-tag=\"hallmark-channel\"\u003eHallmark Channel\u003c/a\u003e telepic \u003cem\u003eIt Was Always You\u003c/em\u003e — will reunite for the cabler’s \u003cem\u003eChristmas Above the Clouds\u003c/em\u003e holiday movie, which is described as “a comedic, modern day reimagining of \u003cem\u003eA Christmas Carol\u003c/em\u003e.”\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eThe premise: When a workaholic CEO (played by Krakow) tries to skip Christmas by flying to Australia, “she’s in for the flight of her life,” the synopsis tells us. “Haunted by her past, present, and future, she’s forced to confront the choices that led to her success yet left her flying solo. With the help of three quirky spirits and a surprise reunion with her ex (Hynes), she might just rediscover the magic of Christmas — and the love she thought she’d lost.”\n\n\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eWe’re all rooting for her, to be sure!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eIn other recent casting news:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e*Speaking of Hallmark…. Season 2 of its\u003cem\u003e \u003ca href=\"https://tvline.com/t/finding-mr-christmas/\" id=\"auto-tag_finding-mr-christmas\" data-tag=\"finding-mr-christmas\"\u003eFinding Mr. Christmas\u003c/a\u003e \u003c/em\u003ereality competition will feature as guest judges Janel Parrish (\u003cem\u003ePretty Little Liars\u003c/em\u003e), Heather Hemmens (\u003cem\u003eRoswell, New Mexico\u003c/em\u003e), Alison Sweeney (\u003cem\u003eDays of Our Lives\u003c/em\u003e, \u003cem\u003eHannah Swensen Mysteries\u003c/em\u003e), Hunter King (\u003cem\u003eHoliday Touchdown: A Chiefs Love Story\u003c/em\u003e), Ashley Williams, Sharon Lawrence, Hallmark superfans Gail and Alicia (both featured in \u003cem\u003eChristmas at Sea\u003c/em\u003e) and Erin Krakow (\u003cem\u003eWhen Calls the Heart\u003c/em\u003e).\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e* Fox’s \u003cem\u003e\u003ca href=\"https://tvline.com/t/animal-control/\" id=\"auto-tag_animal-control\" data-tag=\"animal-control\"\u003eAnimal Control\u003c/a\u003e\u003c/em\u003e has added Kyla Pratt (\u003cem\u003eCall Me Kat\u003c/em\u003e) in the Season 4 role of Daisy, a new member of the Seattle Animal Control squad who serves as Templeton Dudge’s partner, Variety reports.\u003c/p\u003e\n\n\n\n\u003cp\u003e* \u003ca href=\"https://tvline.com/t/brandy-norwood/\" id=\"auto-tag_brandy-norwood\" data-tag=\"brandy-norwood\"\u003eBrandy Norwood\u003c/a\u003e will star in the Lifetime holiday movie \u003cem\u003eChristmas Everyday\u003c/em\u003e along with her real-life daughter Sy’Rai Smith. Brandy plays Francine “Fancy” Ballantine, a fashion designer who is determined to uphold her family’s Christmas traditions while planning her baby sister’s (Smith) wedding.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHit the comments with your thoughts on the castings above!\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-25T00:40:18Z",
  "modifiedTime": "2025-07-25T00:41:38Z"
}
