{
  "id": "97fe9eaf-805f-4fd9-a58b-af9946e61dff",
  "title": "1923 Season 2 Episode 2 Review: Spencer Makes it to America, and the Montana Winter Ravages the Duttons",
  "link": "https://www.tvfanatic.com/1923-season-2-episode-2-review-the-rapist-is-winter/",
  "description": "Winter takes another bite out of the Dutton family on 1923 Season 2 Episode 2, as danger attacks on all fronts. Read our review for more. The post 1923 Season 2 Episode 2 Review: Spencer Makes it to America, and the Montana Winter Ravages the Duttons appeared first on TV Fanatic.",
  "author": "Carissa Pavlica",
  "published": "Sun, 02 Mar 2025 20:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Reviews"
  ],
  "byline": "Carissa Pavlica",
  "length": 7209,
  "excerpt": "Winter takes another bite out of the Dutton family on 1923 Season 2 Episode 2, as danger attacks on all fronts. Read our review for more.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "Critic's Rating: 3.5 / 5.03.5 Well, we can say this much: Spencer and Alexandra’s individual journeys home are continuing, and their love remains unabated. Everyone else isn’t faring so well. I’ve linked to a full recap of 1923 Season 2 Episode 2, just like the old days of TV Fanatic, so if you want to check it out, be sure to click. Don’t expect anything fancy, though! (Lo Smith/Paramount+) Winter in the north can be dismal and depressing no matter where (or when) you live, but it’s much worse when you’re so far off the beaten path that even a trip to the henhouse or the root cellar is perilous. Cara and Elizabeth have been left to fend for themselves, and I can only imagine that their fate was sealed by the bad weather. (Trae Patton/Paramount+) Things have gotten bad enough with Donald Whitfield that leaving them alone seems foolish, but it’s more likely that Whitfield and his posse would wait out the winter before daring to take the fight outside of their home turf again. I don’t know much about Montana in 1923, but I can say that even in suburban Pittsburgh in 1977, winter was brutal. The outskirts of Denver in 2009? Not a fan of the chest-high snow. If you put me in the middle of nowhere like the Yellowstone, I’d feel about as delighted to be there as Elizabeth. You know things are particularly bad when the animals, which in 1923 still had a healthy fear of humans, are squatting on porches and raiding henhouses. If they’re more afraid of dying than of humans, then humans wind up on the menu. It’s not even unfair if you think about it. People consume animals, so expecting animals not to consume humans gives them a bit more agency than they have. Fear is the only factor keeping humans on top of the food chain, and it seems to have run out this Montana winter. (Trae Patton/Paramount+) But what about Elizabeth? Did the wolf do her in, or will she survive? If that was Elizabeth in the middle of the cold floor with a wolf chewing on her gut, it would take a miracle for her to survive. You don’t survive something like that, especially when you’ve already lost the will to fight. She was beside herself about receiving rabies shots (not that I blame her), so picking herself up after an attack like that would push her to the brink. Elizabeth wasn’t made for the Dutton life. When she said yes to Jack’s proposal, she was still young and carefree with two parents who loved her. Donald Whitfield wasn’t on the prowl, and people in town weren’t picking people off the street for loving the “wrong” person. It takes a certain fighting spirit to survive in the West, and even when you ask for it, survival, let alone prospering, is not guaranteed. (Trae Patton/Paramount+) We watched the Dutton family embrace the West beginning in 1883. We also saw it eat them alive, beginning with James Dutton’s sister on the series premiere, sucking the life out of Elsa, and then James and Margaret. John and Emma were next, and now, Elizabeth. Many of them possessed the fiery spirit needed to survive in the West, and they still found death earlier than most. We’ve long wondered where the modern family line began, and if Elizabeth is dead, we can stop wondering. It would make more sense that Alexandra and Spencer gave life to the Duttons we knew so well from Yellowstone, with Beth a perfect combination of their essence. Still, Elizabeth’s death would put the family in a darker frame of mind. The best that can be said if she is gone is that they’ll need to take their grief out on someone, and they may not even wait out the winter to do it. Banner is afraid of Whitfield, but he’d best fear the Duttons first. They could find a reason to let him live. I doubt Whitfield would do the same. (Lo Smith/Paramount+) If Elizabeth’s arc wasn’t bad enough, Zane and his family are no better off. Jacob offered to take them in and protect them, but restoring Zane to health after what happened to Elizabeth would take a lot out of the family. They’ll need allies, though, and if Zane can pull through mentally and physically, he’ll prove his worth. Spencer and Luca made it to Galveston, but Spencer’s good deed of saving Luca and delivering him to his family came with a price. Luca’s cousin Cugino has pulled Spencer into the bootleg business, asking him to deliver a truck of whiskey to Fort Worth. He gets to keep the truck for his trouble, but if we know anything about 1923, it’s that nothing is ever as easy as it seems. (Lo Smith/Paramount+) My favorite scene of the hour was watching Spencer experience pizza for the first time. That’s not enough enjoyment to pull him away from his mission to return home and save the family, but it’s all I’ve got. Alex is in the belly of a ship as it tosses and turns with the savage sea. She’s holding tight to Spencer’s love, imagining him gazing into her eyes, pulling her close, and making more babies. I was surprised she looked so well compared to the other passengers, especially since she’s pregnant. That’s the power of love for you. With all of this misery, she’s a beacon of light, clinging to the possibilities before her, blissfully unaware of the realities. We also got our first look at Jennifer Carpenter as Mamie Fossett. Mamie wasn’t impressed with Father Renaud and Marshal Kent, but she didn’t fuss about their search for Teonna, either. Father Renaud showed signs of humanity again, talking about interracial marriages and assuring Kent he had no issue with the Natives other than their willingness to accept God and their place in his plan. (Lo Smith/Paramount+) It’s not exactly a rousing endorsement of his humanity, but he possesses more than a sliver, while Kent and Whitfield possess none. Teonna was wisely reticent to visit another reservation, knowing they all come embedded with police and priests. Runs His Horse will take that into consideration, but he’ll probably spy the flyers with her face on them anyway. I’m pinning Thomas Rainwater’s future on Teonna, so I’m not overly concerned for her life. Pete and Runs His Horse could discover trouble, and Teonna’s happiness is surely on the line, but hopefully, not her life. And, of course, Jacob, Jack, and Zane’s family are far from home in a blizzard, hiding under an overturned wagon. All I could think of was the wagon getting covered in snow, with all of them dying of oxygen deprivation. (Ryan Green/Paramount+) If the blizzard drops a good amount of snow, there could be more death on the horizon. Zane looked like death warmed over before the trip. It doesn’t seem like it will take much for him to meet his maker. Was Elizabeth really just eaten alive by a rabid wolf? Have the Duttons just experienced another vibrant young woman taken down by the West? It’s not looking good. So, yeah, it’s another joyful episode of 1923. What did we expect from “The Rapist Is Winter”? Let’s just say “Wrap Thee in Terror” is unlikely to pull us out of this darkness. Be sure to grade the episode in our poll and share your thoughts in the comments below! Username or Email AddressPassword Watch 1923 Online",
  "image": "https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-835217\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\u003cp\u003e\u003cstrong\u003eCritic\u0026#39;s Rating:\u003c/strong\u003e 3.5 / 5.0\u003c/p\u003e\u003cp\u003e3.5\u003c/p\u003e\n\u003cp\u003eWell, we can say this much: Spencer and Alexandra’s individual journeys home are continuing, and their love remains unabated.\u003c/p\u003e\n\n\n\n\u003cp\u003eEveryone else isn’t faring so well.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’ve linked to a full recap of \u003ca href=\"https://www.tvfanatic.com/1923-season-2-episode-2-recap-the-rapist-is-winter/\"\u003e1923 Season 2 Episode 2\u003c/a\u003e, just like the old days of TV Fanatic, so if you want to check it out, be sure to click. Don’t expect anything fancy, though!\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"579\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-1024x579.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-1024x579.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-300x170.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-768x435.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-960x543.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-1080x611.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f-1200x679.jpg 1200w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f.jpg 1944w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0181_RT_f.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Lo Smith/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWinter in the north can be dismal and depressing no matter where (or when) you live, but it’s much worse when you’re so far off the beaten path that even a trip to the henhouse or the root cellar is perilous.\u003c/p\u003e\n\n\n\n\u003cp\u003eCara and Elizabeth have been left to fend for themselves, and I can only imagine that their fate was sealed by the bad weather.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"947\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f-947x1024.jpg 947w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f-278x300.jpg 278w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f-768x830.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f-888x960.jpg 888w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f-999x1080.jpg 999w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f-1110x1200.jpg 1110w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f.jpg 1201w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1115_02477_RT_f.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Trae Patton/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThings have gotten bad enough with Donald Whitfield that leaving them alone seems foolish, but it’s more likely that Whitfield and his posse would wait out the winter before daring to take the fight outside of their home turf again.\u003c/p\u003e\n\n\n\n\u003cp\u003eI don’t know much about Montana in 1923, but I can say that even in suburban Pittsburgh in 1977, winter was brutal. The outskirts of Denver in 2009? Not a fan of the chest-high snow. If you put me in the middle of nowhere like the Yellowstone, I’d feel about as delighted to be there as Elizabeth.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eYou know things are particularly bad when the animals, which in 1923 still had a healthy fear of humans, are squatting on porches and raiding henhouses. If they’re more afraid of dying than of humans, then humans wind up on the menu.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s not even unfair if you think about it. \u003c/p\u003e\n\n\n\n\u003cp\u003ePeople consume animals, so expecting animals not to consume humans gives them a bit more agency than they have. Fear is the only factor keeping humans on top of the food chain, and it seems to have run out this Montana winter.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"953\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f-953x1024.jpg 953w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f-279x300.jpg 279w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f-768x825.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f-893x960.jpg 893w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f-1005x1080.jpg 1005w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f-1117x1200.jpg 1117w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f.jpg 1209w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1008_00530_RT_f.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Trae Patton/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut what about Elizabeth? Did the wolf do her in, or will she survive? \u003c/p\u003e\n\n\n\n\u003cp\u003eIf that was Elizabeth in the middle of the cold floor with a wolf chewing on her gut, it would take a miracle for her to survive. You don’t survive something like that, especially when you’ve already lost the will to fight.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe was beside herself about receiving rabies shots (not that I blame her), so picking herself up after an attack like that would push her to the brink.\u003c/p\u003e\n\n\n\n\u003cp\u003eElizabeth wasn’t made for the Dutton life. When she said yes to Jack’s proposal, she was still young and carefree with two parents who loved her. Donald Whitfield wasn’t on the prowl, and people in town weren’t picking people off the street for loving the “wrong” person.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt takes a certain fighting spirit to survive in the West, and even when you ask for it, survival, let alone prospering, is not guaranteed.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f-1024x683.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f-960x640.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f-1080x720.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f-1200x800.jpg 1200w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f.jpg 1950w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_TP_1009_00703_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Trae Patton/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWe watched the Dutton family embrace the West beginning in \u003ca href=\"https://www.tvfanatic.com/shows/1883/\"\u003e1883\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe also saw it eat them alive, beginning with James Dutton’s sister on the series premiere, sucking the life out of Elsa, and then James and Margaret. John and Emma were next, and now, Elizabeth.\u003c/p\u003e\n\n\n\n\u003cp\u003eMany of them possessed the fiery spirit needed to survive in the West, and they still found death earlier than most.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eWe’ve long wondered where the modern family line began, and if Elizabeth is dead, we can stop wondering. It would make more sense that Alexandra and Spencer gave life to the Duttons we knew so well from \u003ca href=\"https://www.tvfanatic.com/shows/yellowstone/\"\u003eYellowstone\u003c/a\u003e, with Beth a perfect combination of their essence.\u003c/p\u003e\n\n\n\n\u003cp\u003eStill, Elizabeth’s death would put the family in a darker frame of mind. The best that can be said if she is gone is that they’ll need to take their grief out on someone, and they may not even wait out the winter to do it.\u003c/p\u003e\n\n\n\n\u003cp\u003eBanner is afraid of Whitfield, but he’d best fear the Duttons first. They could find a reason to let him live. I doubt Whitfield would do the same.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"899\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f-899x1024.jpg 899w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f-264x300.jpg 264w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f-768x874.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f-843x960.jpg 843w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f-949x1080.jpg 949w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f-1054x1200.jpg 1054w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f.jpg 1141w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0926_0205_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Lo Smith/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIf Elizabeth’s arc wasn’t bad enough, Zane and his family are no better off. Jacob offered to take them in and protect them, but restoring Zane to health after what happened to Elizabeth would take a lot out of the family.\u003c/p\u003e\n\n\n\n\u003cp\u003eThey’ll need allies, though, and if Zane can pull through mentally and physically, he’ll prove his worth.\u003c/p\u003e\n\n\n\n\u003cp\u003eSpencer and Luca made it to Galveston, but Spencer’s good deed of saving Luca and delivering him to his family came with a price.\u003c/p\u003e\n\n\n\n\u003cp\u003eLuca’s cousin Cugino has pulled Spencer into the bootleg business, asking him to deliver a truck of whiskey to Fort Worth. He gets to keep the truck for his trouble, but if we know anything about \u003ca href=\"https://www.tvfanatic.com/shows/1923/\"\u003e1923\u003c/a\u003e, it’s that nothing is ever as easy as it seems.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"808\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f-808x1024.jpg 808w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f-237x300.jpg 237w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f-768x974.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f-757x960.jpg 757w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f-852x1080.jpg 852w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f-947x1200.jpg 947w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f.jpg 1300w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_BTS_0724_0038_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Lo Smith/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMy favorite scene of the hour was watching Spencer experience pizza for the first time. That’s not enough enjoyment to pull him away from his mission to return home and save the family, but it’s all I’ve got.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlex is in the belly of a ship as it tosses and turns with the savage sea. She’s holding tight to Spencer’s love, imagining him gazing into her eyes, pulling her close, and making more babies.\u003c/p\u003e\n\n\n\n\u003cp\u003eI was surprised she looked so well compared to the other passengers, especially since she’s pregnant. That’s the power of love for you. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eWith all of this misery, she’s a beacon of light, clinging to the possibilities before her, blissfully unaware of the realities.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe also got our first look at \u003ca href=\"https://www.tvfanatic.com/jennifer-carpenter-exclusive-interview-1923-mamie-fossett/\"\u003eJennifer Carpenter as Mamie Fossett\u003c/a\u003e. Mamie wasn’t impressed with Father Renaud and Marshal Kent, but she didn’t fuss about their search for Teonna, either.\u003c/p\u003e\n\n\n\n\u003cp\u003eFather Renaud showed signs of humanity again, talking about interracial marriages and assuring Kent he had no issue with the Natives other than their willingness to accept God and their place in his plan.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f-1024x683.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f-960x640.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f-1080x720.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f-1200x800.jpg 1200w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f.jpg 1950w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_LS_0719_0004_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Lo Smith/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt’s not exactly a rousing endorsement of his humanity, but he possesses more than a sliver, while Kent and Whitfield possess none.\u003c/p\u003e\n\n\n\n\u003cp\u003eTeonna was wisely reticent to visit another reservation, knowing they all come embedded with police and priests. Runs His Horse will take that into consideration, but he’ll probably spy the flyers with her face on them anyway.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m pinning Thomas Rainwater’s future on Teonna, so I’m not overly concerned for her life. Pete and Runs His Horse could discover trouble, and Teonna’s happiness is surely on the line, but hopefully, not her life.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd, of course, Jacob, Jack, and Zane’s family are far from home in a blizzard, hiding under an overturned wagon. All I could think of was the wagon getting covered in snow, with all of them dying of oxygen deprivation.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"882\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f-882x1024.jpg 882w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f-258x300.jpg 258w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f-768x892.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f-827x960.jpg 827w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f-930x1080.jpg 930w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f-1033x1200.jpg 1033w, https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f.jpg 1117w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/02/1923_202_RG_0802_0035_RT_f.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Ryan Green/Paramount+)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIf the blizzard drops a good amount of snow, there could be more death on the horizon. Zane looked like death warmed over before the trip. It doesn’t seem like it will take much for him to meet his maker.\u003c/p\u003e\n\n\n\n\u003cp\u003eWas Elizabeth really just eaten alive by a rabid wolf? Have the Duttons just experienced another vibrant young woman taken down by the West? It’s not looking good.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, yeah, it’s another joyful episode of 1923. What did we expect from “The Rapist Is Winter”? Let’s just say “Wrap Thee in Terror” is unlikely to pull us out of this darkness.\u003c/p\u003e\n\n\n\n\u003cp\u003eBe sure to grade the episode in our poll and share your thoughts in the comments below!\u003c/p\u003e\n\n\n\n\u003cdiv data-id=\"650\" data-temp=\"basic\" data-skin=\"minimal\" data-cscheme=\"black\" data-cap=\"0\" data-access=\"guest,wordpress\" data-tid=\"\" data-uid=\"bcb83c003b36ffd2baaa881ff9691e3b\" data-pid=\"835217\" data-resdet=\"percentages\" data-show-results-to=\"guest,registered\" data-show-results-moment=\"after-vote\" data-show-results-only=\"false\" data-show-message=\"true\" data-show-results-as=\"bar\" data-sort-results-by=\"as-defined\" data-sort-results-rule=\"asc\" data-is-ended=\"0\" data-gdpr=\"no\" data-gdpr-sol=\"consent\" data-css=\".basic-yop-poll-container[data-uid] .basic-vote { text-align: center; }\" data-counter=\"0\" data-load-with=\"1\" data-notification-section=\"top\"\u003e\u003cp\u003e\u003clabel\u003eUsername or Email Address\u003c/label\u003e\u003c/p\u003e\u003cp\u003e\u003clabel\u003ePassword\u003c/label\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch 1923 Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-02T20:00:00Z",
  "modifiedTime": "2025-02-28T15:10:35Z"
}
