{
  "id": "a7432f88-7f03-4a45-88c9-cd4479930594",
  "title": "The Blue Bloods Family Dinners: A Labor Of Love for Viewers and the Cast; Tom Selleck and Donnie Wahlberg In Tears on The Talk",
  "link": "https://www.tvfanatic.com/the-blue-bloods-family-dinners-a-labor-of-love/",
  "description": "We all loved the Blue Bloods family dinners, and it's amazing how much work went into them. Thank you to the cast and crew for these scenes! The post The Blue Bloods Family Dinners: A Labor Of Love for Viewers and the Cast; Tom Selleck and Donnie Wahlberg In Tears on The Talk appeared first on TV Fanatic.",
  "author": "Jack Ori",
  "published": "Fri, 13 Dec 2024 19:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Editorials"
  ],
  "byline": "Jack Ori",
  "length": 6256,
  "excerpt": "We all loved the Blue Bloods family dinners, and it's amazing how much work went into them. Thank you to the cast and crew for these scenes!",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "In 293 episodes, Blue Bloods has never missed a family dinner. Sometimes, the iconic dinner scenes were in a hotel, hospital, or diner, but there was guaranteed to be a scene where the Reagans got together, put all their problems aside, and spent time together as a family. These Blue Bloods family dinners were as important to the cast and writers as they were to the audience, and they were a true labor of love, considering how much work went into them. (John Paul Filo/CBS) The Iconic Blue Bloods Family Dinners Were The Intentional Centerpiece Of The Series The family dinner scenes are more associated with Blue Bloods than any other aspect of the police/family drama, and that was on purpose. From the beginning, late producer Leonard Goldberg wanted the dinners to be central because he intended the show to be about a family of cops, not just a police procedural. It’s a sentiment that Tom Selleck so heartily endorsed that when the series drifted away from family scenes in the first few episodes, he put his foot down about what needed to happen if he was to continue with the project. Thus, it makes sense that the first scene the actors filmed was the debut of the Reagan family dinner. Amazingly, the cast didn’t know each other well then; other than Bridget Moynahan and Donnie Wahlberg, they had all just met. The fact that they were able to make the Reagans seem like a real family at that early juncture speaks not only to the actors’ talents but also to how dedicated they all were to making family front and center in their new show. That first dinner took several hours to film, and the producers weren’t even sure what the final structure of the show would be, but everyone jumped in and did it, and the results were nothing short of brilliant. The Blue Bloods Family Dinners Were The Longest Scenes To Film Although it’s hard to tell from the finished product, the iconic dinner scenes were a huge commitment. CBS’ special, Blue Bloods: Celebrating A Family Legacy, went behind the scenes at the dinner table. I knew that these scenes were long because I’d read about them elsewhere, but some of the other facts about them showed what a labor of love they were. These scenes took at least three hours to shoot, with multiple takes where the Reagans had to appear to be eating the same food on their plates the same way. (CBS / Patrick Harbron) It’s a joke among the crew that Donnie Wahlberg is the only one who eats all the food during each scene. When Danny said on Blue Bloods Season 14 Episode 17 that he couldn’t wait for that pork chop, it didn’t seem that far off from how Wahlberg is in real life, judging from the anecdotes about him and food! I was impressed by several things about how hard everyone works to make those Blue Bloods family dinners come alive. The actors sit on soft cushions to ensure they’re high enough for the cameras and comfortable after sitting for long periods. A chef is employed behind the scenes to ensure the food is edible (for those who choose to eat during multiple takes), and everyone stays for hours, doing the scene over and over so that there are enough different takes to edit into a polished, fun, and love-filled Reagan family dinner. (Courtesy of CBS) The actors have to find inventive ways to make it look like they’re eating, while behind the scenes, a prop person must refill each plate between takes and put food items in exactly the same location so nothing looks weird when they edit multiple takes together. Talk about dedication! Considering how much work went into them, these scenes were truly a labor of love. It’s not surprising that they are usually the first thing people discuss when they’re asked why they love Blue Bloods. The family love shines through, and it’s hard to believe that it took so much work to get them on the air. The Blue Bloods Family Dinner Scenes Allowed The Cast To Bond (CBS / John Paul Filo) In some ways, the family dinner scenes didn’t involve acting at all, at least not by Blue Bloods Season 14. The cast got to know each other at these dinners, especially once Eddie (Vanessa Ray) became part of the family. According to multiple interviews, Ray and Donnie Wahlberg constantly joke around and crack everyone else up during the dinner scenes. This is an amazing testimonial to how life imitates art. The fictional Reagans became like a real family off-screen the more time they spent together on these Blue Bloods family dinner scenes, and doubly so when you consider that they were all strangers when they filmed their first one. Everyone on set embraced the family values at the center of the series, and it shows on-screen and off, which you can see in more detail below when Tom Selleck and Donnie Wahlberg joined The Talk Today. Despite the effort required for the Blue Bloods family dinner scenes, Tom Selleck mentioned on the special that there was never a bad one. (Craig Blankenhorn/CBS) We have done many articles about the cancelation of Blue Bloods, but nothing hits home as much as seeing the stars weep, knowing they will never be a part of the Reagan family dinners again. When Selleck and Wahlberg joined The Talk today on CBS, they discussed filming their last dinner scene and what 14 years of friendship and on-set camaraderie have meant to them. Selleck feels that the last dinner scene, whether it was the final scene filmed or not, was truly the last for them all. He said of filming the scene, “You know, we’re trying to stay professional and stay focused on the scene and ignore the fact that we’re all going to feel emotional. “And when they said cut on the final take of the final dinner scene, it was silence…We all knew as soon as somebody spoke, we’re all going to lose it.” Tonight, we will be in the same boat. Grab those tissues; we’re going to need them. Over to you, Blue Bloods fanatics. Did you love the Blue Bloods family dinners? Were you aware of how much effort went into them? Hit the comments with your thoughts. Blue Bloods’ series finale will air on CBS on December 13, 2024, at 10/9c and on Paramount+ on December 14. Watch Blue Bloods Online",
  "image": "https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-828249\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003eIn 293 episodes, Blue Bloods has never missed a family dinner.\u003c/p\u003e\n\n\n\n\u003cp\u003eSometimes, the iconic dinner scenes were in a hotel, hospital, or diner, but there was guaranteed to be a scene where the Reagans got together, put all their problems aside, and spent time together as a family.\u003c/p\u003e\n\n\n\n\u003cp\u003eThese \u003ca href=\"http://tvfanatic.com/shows/blue-bloods\"\u003eBlue Bloods\u003c/a\u003e family dinners were as important to the cast and writers as they were to the audience, and they were a true labor of love, considering how much work went into them.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"681\" src=\"https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods-1024x681.jpg\" alt=\"Family Dinner - Blue Bloods\" srcset=\"https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods-1024x681.jpg 1024w, https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods-768x511.jpg 768w, https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods-960x638.jpg 960w, https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods-1080x718.jpg 1080w, https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2022/05/family-dinner-blue-bloods.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (John Paul Filo/CBS)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-the-iconic-blue-bloods-family-dinners-were-the-intentional-centerpiece-of-the-series\"\u003eThe Iconic Blue Bloods Family Dinners Were The Intentional Centerpiece Of The Series\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe family dinner scenes are more associated with Blue Bloods than any other aspect of the police/family drama, and that was on purpose.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom the beginning, late producer Leonard Goldberg wanted the dinners to be central because he intended the show to be about a family of cops, not just a police procedural.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s a sentiment that Tom Selleck so heartily endorsed that when the series drifted away from family scenes in the first few episodes, he put his foot down about what needed to happen if he was to continue with the project.\u003c/p\u003e\n\n\n\n\u003cp\u003eThus, it makes sense that the first scene the actors filmed was the debut of the Reagan family dinner. Amazingly, the cast didn’t know each other well then; other than Bridget Moynahan and Donnie Wahlberg, they had all just met.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe fact that they were able to make the Reagans seem like a real family at that early juncture speaks not only to the actors’ talents but also to how dedicated they all were to making family front and center in their new show.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat first dinner took several hours to film, and the producers weren’t even sure what the final structure of the show would be, but everyone jumped in and did it, and the results were nothing short of brilliant.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"The Pilot: Reagan Family Dinner Scene\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/VZWslXXKzpA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" loading=\"lazy\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-the-blue-bloods-family-dinners-were-the-longest-scenes-to-film\"\u003eThe Blue Bloods Family Dinners Were The Longest Scenes To Film\u003c/h2\u003e\n\n\n\n\u003cp\u003eAlthough it’s hard to tell from the finished product, the iconic dinner scenes were a huge commitment.\u003c/p\u003e\n\n\n\n\u003cp\u003eCBS’ special, Blue Bloods: Celebrating A Family Legacy, went behind the scenes at the dinner table. I knew that these scenes were long because I’d read about them elsewhere, but some of the other facts about them showed what a labor of love they were.\u003c/p\u003e\n\n\n\n\u003cp\u003eThese scenes took at least three hours to shoot, with multiple takes where the Reagans had to appear to be eating the same food on their plates the same way.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"755\" height=\"800\" src=\"https://cdn.tvfanatic.com/uploads/2021/03/reagan-family-dinner-blue-bloods-s11e8.jpg\" alt=\"Reagan Family Dinner - Blue Bloods Season 11 Episode 8\" srcset=\"https://cdn.tvfanatic.com/uploads/2021/03/reagan-family-dinner-blue-bloods-s11e8.jpg 755w, https://cdn.tvfanatic.com/uploads/2021/03/reagan-family-dinner-blue-bloods-s11e8-283x300.jpg 283w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2021/03/reagan-family-dinner-blue-bloods-s11e8.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (CBS / Patrick Harbron)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt’s a joke among the crew that Donnie Wahlberg is the only one who eats all the food during each scene. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Danny said on \u003ca href=\"https://www.tvfanatic.com/blue-bloods-se1417-review-entitlement-stood-out-because-of-the-thing-well-miss-most/\"\u003eBlue Bloods Season 14 Episode 17\u003c/a\u003e that he couldn’t wait for that pork chop, it didn’t seem that far off from how Wahlberg is in real life, judging from the anecdotes about him and food!\u003c/p\u003e\n\n\n\n\u003cp\u003eI was impressed by several things about how hard everyone works to make those Blue Bloods family dinners come alive. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe actors sit on soft cushions to ensure they’re high enough for the cameras and comfortable after sitting for long periods.\u003c/p\u003e\n\n\n\n\u003cp\u003eA chef is employed behind the scenes to ensure the food is edible (for those who choose to eat during multiple takes), and everyone stays for hours, doing the scene over and over so that there are enough different takes to edit into a polished, fun, and love-filled Reagan family dinner.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"800\" height=\"752\" src=\"https://cdn.tvfanatic.com/uploads/2024/09/henry-feels-blessed-blue-bloods-s9e6.jpg\" alt=\"Blue Bloods Henry Reagan sitting at the family dinner table with a glass of wine in front of him\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/09/henry-feels-blessed-blue-bloods-s9e6.jpg 800w, https://cdn.tvfanatic.com/uploads/2024/09/henry-feels-blessed-blue-bloods-s9e6-300x282.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/09/henry-feels-blessed-blue-bloods-s9e6-768x722.jpg 768w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/09/henry-feels-blessed-blue-bloods-s9e6.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Courtesy of CBS)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe actors have to find inventive ways to make it look like they’re eating, while behind the scenes, a prop person must refill each plate between takes and put food items in exactly the same location so nothing looks weird when they edit multiple takes together.\u003c/p\u003e\n\n\n\n\u003cp\u003eTalk about dedication!\u003c/p\u003e\n\n\n\n\u003cp\u003eConsidering how much work went into them, these scenes were truly a labor of love.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s not surprising that they are usually the first thing people discuss when they’re asked why they love Blue Bloods.  The family love shines through, and it’s hard to believe that it took so much work to get them on the air.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-blue-bloods-family-dinner-scenes-allowed-the-cast-to-bond\"\u003eThe Blue Bloods Family Dinner Scenes Allowed The Cast To Bond \u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"609\" height=\"777\" src=\"https://cdn.tvfanatic.com/uploads/2022/03/happy-250th-episode-blue-bloods-s12e16.jpg\" alt=\"Happy 250th Episode - Blue Bloods Season 12 Episode 16\" srcset=\"https://cdn.tvfanatic.com/uploads/2022/03/happy-250th-episode-blue-bloods-s12e16.jpg 609w, https://cdn.tvfanatic.com/uploads/2022/03/happy-250th-episode-blue-bloods-s12e16-235x300.jpg 235w\" sizes=\"(max-width: 609px) 100vw, 609px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2022/03/happy-250th-episode-blue-bloods-s12e16.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (CBS / John Paul Filo)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn some ways, the family dinner scenes didn’t involve acting at all, at least not by \u003ca href=\"https://www.tvfanatic.com/?show=blue-bloods\u0026amp;season=season-14\"\u003eBlue Bloods Season 14\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe cast got to know each other at these dinners, especially once Eddie (Vanessa Ray) became part of the family. According to multiple interviews, Ray and Donnie Wahlberg constantly joke around and crack everyone else up during the dinner scenes.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThis is an amazing testimonial to how life imitates art. The fictional Reagans became like a real family off-screen the more time they spent together on these Blue Bloods family dinner scenes, and doubly so when you consider that they were all strangers when they filmed their first one.\u003c/p\u003e\n\n\n\n\u003cp\u003eEveryone on set embraced the family values at the center of the series, and it shows on-screen and off, which you can see in more detail below when Tom Selleck and Donnie Wahlberg joined The Talk Today.\u003c/p\u003e\n\n\n\n\u003cp\u003eDespite the effort required for the Blue Bloods family dinner scenes, Tom Selleck mentioned on the special that there was never a bad one.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"743\" height=\"787\" src=\"https://cdn.tvfanatic.com/uploads/2018/11/enjoying-family-dinner-blue-bloods-s9e8.jpg\" alt=\"Enjoying Family Dinner - Blue Bloods Season 9 Episode 8\" srcset=\"https://cdn.tvfanatic.com/uploads/2018/11/enjoying-family-dinner-blue-bloods-s9e8.jpg 743w, https://cdn.tvfanatic.com/uploads/2018/11/enjoying-family-dinner-blue-bloods-s9e8-283x300.jpg 283w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2018/11/enjoying-family-dinner-blue-bloods-s9e8.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Craig Blankenhorn/CBS)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWe have done many articles about the \u003ca href=\"https://www.tvfanatic.com/why-the-cancelation-of-blue-bloods-is-one-of-tvs-biggest-mistakes/\"\u003ecancelation of Blue Bloods\u003c/a\u003e, but nothing hits home as much as seeing the stars weep, knowing they will never be a part of the Reagan family dinners again.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Selleck and Wahlberg joined The Talk today on CBS, they discussed filming their last dinner scene and what 14 years of friendship and on-set camaraderie have meant to them.\u003c/p\u003e\n\n\n\n\u003cp\u003eSelleck feels that the last dinner scene, whether it was the final scene filmed or not, was truly the last for them all. He said of filming the scene, “You know, we’re trying to stay professional and stay focused on the scene and ignore the fact that we’re all going to feel emotional.\u003c/p\u003e\n\n\n\n\u003cp\u003e“And when they said cut on the final take of the final dinner scene, it was silence…We all knew as soon as somebody spoke, we’re all going to lose it.”\u003c/p\u003e\n\n\n\n\u003cp\u003eTonight, we will be in the same boat. Grab those tissues; we’re going to need them.\u003c/p\u003e\n\n\n\n\u003ccenter\u003e\u003c/center\u003e\n\n\n\n\u003cp\u003eOver to you, Blue Bloods fanatics.\u003c/p\u003e\n\n\n\n\u003cp\u003eDid you love the Blue Bloods family dinners? Were you aware of how much effort went into them?\u003c/p\u003e\n\n\n\n\u003cp\u003eHit the comments with your thoughts.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eBlue Bloods’ series finale will air on CBS on December 13, 2024, at 10/9c and on Paramount+ on December 14.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch Blue Bloods Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-13T19:00:00Z",
  "modifiedTime": "2024-12-13T13:57:58Z"
}
