{
  "id": "bebb2f7d-717b-4dbc-b4cf-3162adafb6bd",
  "title": "Law \u0026 Order: Organized Crime Season 5 Episode 5 Brings Back A Familiar Face After The Most Disturbing Scene Of The Season",
  "link": "https://www.tvfanatic.com/law-and-order-organized-crime-s05e05-review-lago-daverno/",
  "description": "Yes! When they mentioned ME Warner on Law \u0026 Order: Organized Crime Season 5 Episode 4, I was disappointed she wasn’t … The post Law \u0026 Order: Organized Crime Season 5 Episode 5 Brings Back A Familiar Face After The Most Disturbing Scene Of The Season appeared first on TV Fanatic.",
  "author": "Jack Ori",
  "published": "Thu, 08 May 2025 21:22:07 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Reviews"
  ],
  "byline": "Jack Ori",
  "length": 6155,
  "excerpt": "Law \u0026 Order: Organized Crime Season 5 Episode 5 was deliciously intense, but the best part was the cameo from the franchise's past.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "Critic's Rating: 4.5 / 5.04.5 Yes! When they mentioned ME Warner on Law \u0026 Order: Organized Crime Season 5 Episode 4, I was disappointed she wasn’t on-screen. I didn’t expect her to ever be, given Tamara Tunie’s commitment to Beyond the Gates, but I was thrilled about her cameo on Law \u0026 Order: Organized Crime Season 5 Episode 5. It was exactly what we needed after a disturbing, violent, and all too realistic episode that resulted in multiple deaths. (Virginia Sherwood/Peacock) The Story About The Spezzano Family Took A Grisly Turn (And That’s A Good Thing) Mob families are violent. Law \u0026 Order: Organized Crime had to be careful when it was on network TV so that it didn’t run afoul of the rules, but even then, it depicted levels of violence usually reserved for cable-only or streaming series. (Anyone remember that cut-off ear during Law \u0026 Order: Organized Crime Season 2?) Now that the show is on streaming, there’s no holds barred. I couldn’t look at the scenes of that nun cutting off Isabella’s fingers, but I appreciated they were included. Bloody and disturbing? Yes. But this is the kind of gritty, scary content I expect from a show about people attempting to rein in a dangerous organized crime family. (David Holloway/Peacock) Is Isabella Really Dead? Her story is tragic. She ratted out her brother in exchange for a new life in America — only to be murdered in a particularly gruesome way when said brother escaped from prison. Law \u0026 Order: Organized Crime isn’t a soap opera, so I don’t expect many back-from-the-dead type stories, and I was in denial when Gina died at the end of Law \u0026 Order: Organized Crime Season 1. (Side note: Why can’t Charlotte Sullivan’s characters on Dick Wolf shows ever stay alive?) (Virginia Sherwood/Peacock) Still, Stabler was expecting to see a hand with fingers missing, and in the morgue, he didn’t. That could mean that Isabella ran away or was kidnapped, and another body was placed in the barn to make her appear dead. I don’t want to get my hopes up too much, but the intact fingers at the end of the episode seemed like they should mean something. Did We Need IAB Agent Warren? I was as un-thrilled about Agent Warren’s return as I was excited about Warner’s. I don’t enjoy obviously biased cops. Warren didn’t even try to hide that he’s on a mission to get Stabler. He must have attended the same criminal justice program as Days of Our Lives‘ Melinda Trask. He was almost as subtle in his single-minded determination to use Eli to take Eli’s father down. (Virginia Sherwood/Peacock) Everyone pretty much held their own, so Agent Warren will likely come up empty-handed again. I’d like him to evolve past being a mustache-twirling villain. Love this show? We do too — and we want to keep writing about it.Your comment or share can help make sure we get to. That’s the magic of supporting indie media. Biased cops exist and should be part of stories, but there’s no need for him to be so obvious and one-note about it. I hope he listens for once and investigates Eli’s Field Training Officer instead. I didn’t like the way that man discouraged Eli from asking for representation and told him to lie to ensure he didn’t get in trouble. (Virginia Sherwood/Peacock) Maybe he’s just a hardnosed, old school cop, but something seems off about him. Eli’s Baby Drama Was Close To Real Life For Me As soon as Eli told Agent Warren that Becky wasn’t due for another six weeks, I knew she’d gone into labor. My sister went into labor six weeks early almost 15 years ago, so I was sure it was the same situation. I’m thrilled for an actual NICU storyline. Too many times, shows act like premature birth is no big deal. Preemies on TV often look like full-term babies and have no significant problems requiring them to be in the NICU. I don’t know how Eli is going to focus on taking care of his girlfriend and stay in the loop with the baby, though. (Virginia Sherwood/Peacock) He’s too nervous about the investigation, plus he’s still not fully comfortable with Stabler being in his life — and he’s gonna need his dad more right now while he has a baby in the NICU and a career on life support. His demeanor also makes it questionable whether he’s meant to be a cop. Bernie’s question at the end of the episode gave me chills. Bernie: What is Eli going to be? Elliot: I don’t understand what that means. Bernie: Is he gonna be a cop like you… or a cop like your father? Although Bernie seemed to be lost in the past for most of the episode, she was surprisingly with it when she spoke to Elliot about her grandson. Finally, A Good Use For Vargas I’m not a fan of Vargas and I don’t know if I ever will be. (Virginia Sherwood/Peacock) But Vargas and Randall are a good combination. I liked them on Law \u0026 Order: Organized Crime Season 4 Episode 10 when Vargas expected Randall to fit in his tiny electric car, but that was pure humor. This time, there was a point to it. Vargas helped Randall find out about the calls from Europe coming to Bernie’s phone that might or might not be Joe, Jr. (Randomly, this would have been a perfect time for a cameo appearance from FBI: International’s Smitty as the Europol agent Vargas contacts.) Vargas wasn’t so great with Stabler — he shouldn’t have been surprised that his job duties included hacking into foreign feeds. Sheesh. (Virginia Sherwood/Peacock) Your Turn, Organized Crime Fanatics It’s like yelling into the void sometimes — so if you’re out there, holler back.Vote in our poll to rank the episode, share your thoughts below, and share this review with your friends so they can join in. Law \u0026 Order: Organized Crime streams on Peacock. New episodes drop on Thursdays at 6/5c. Watch Law \u0026 Order: Organized Crime Online TV Fanatic is searching for passionate writers to share their voices across various article types. Think you have what it takes to be a TV Fanatic? Click here for more information and next steps.",
  "image": "https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-846473\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\u003cp\u003e\u003cstrong\u003eCritic\u0026#39;s Rating:\u003c/strong\u003e 4.5 / 5.0\u003c/p\u003e\u003cp\u003e4.5\u003c/p\u003e\n\u003cp\u003eYes! When they mentioned ME Warner on \u003ca href=\"http://tvfanatic.com/shows/law-and-order-organized-crime\"\u003eLaw \u0026amp; Order: Organized Crime\u003c/a\u003e Season 5 Episode 4, I was disappointed she wasn’t on-screen.\u003c/p\u003e\n\n\n\n\u003cp\u003eI didn’t expect her to ever be, given Tamara Tunie’s commitment to Beyond the Gates, but I was thrilled about her cameo on Law \u0026amp; Order: Organized Crime Season 5 Episode 5.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was exactly what we needed after a disturbing, violent, and all too realistic episode that resulted in multiple deaths.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-1024x576.jpg\" alt=\"Stabler and Warner discuss a tragic death on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-1024x576.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-300x169.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-768x432.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-2048x1152.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-728x410.jpg 728w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-960x540.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-1080x608.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05-1200x675.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/Tamara-Tunie-Guest-Stars-Law-Order-Organized-Crime-S05E05.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-the-story-about-the-spezzano-family-took-a-grisly-turn-and-that-s-a-good-thing\"\u003eThe Story About The Spezzano Family Took A Grisly Turn (And That’s A Good Thing)\u003c/h2\u003e\n\n\n\n\u003cp\u003eMob families are violent.\u003c/p\u003e\n\n\n\n\u003cp\u003eLaw \u0026amp; Order: Organized Crime had to be careful when it was on network TV so that it didn’t run afoul of the rules, but even then, it depicted levels of violence usually reserved for cable-only or streaming series.\u003c/p\u003e\n\n\n\n\u003cp\u003e(Anyone remember that cut-off ear during \u003ca href=\"https://www.tvfanatic.com/?show=law-and-order-organized-crime\u0026amp;season=season-2\"\u003eLaw \u0026amp; Order: Organized Crime Season 2\u003c/a\u003e?)\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eNow that the show is on streaming, there’s no holds barred. \u003c/p\u003e\n\n\n\n\u003cp\u003eI couldn’t look at the scenes of that nun cutting off Isabella’s fingers, but I appreciated they were included.\u003c/p\u003e\n\n\n\n\u003cp\u003eBloody and disturbing? Yes.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut this is the kind of gritty, scary content I expect from a show about people attempting to rein in a dangerous organized crime family.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"500\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205828_00023_lowRes-edited.jpg\" alt=\"Rocco and the evil nun launch an attack on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205828_00023_lowRes-edited.jpg 500w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205828_00023_lowRes-edited-225x300.jpg 225w\" sizes=\"(max-width: 500px) 100vw, 500px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205828_00023_lowRes-edited.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (David Holloway/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-is-isabella-really-dead\"\u003eIs Isabella Really Dead?\u003c/h2\u003e\n\n\n\n\u003cp\u003eHer story is tragic.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe ratted out her brother in exchange for a new life in America — only to be murdered in a particularly gruesome way when said brother escaped from prison.\u003c/p\u003e\n\n\n\n\u003cp\u003eLaw \u0026amp; Order: Organized Crime isn’t a soap opera, so I don’t expect many back-from-the-dead type stories, and I was in denial when Gina died at the end of \u003ca href=\"https://www.tvfanatic.com/?show=law-and-order-organized-crime\u0026amp;season=season-1\"\u003eLaw \u0026amp; Order: Organized Crime Season 1.\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e(Side note: Why can’t Charlotte Sullivan’s characters on Dick Wolf shows ever stay alive?)\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01479_lowRes.jpg\" alt=\"Warner investigates a dead body on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01479_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01479_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01479_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01479_lowRes-960x640.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01479_lowRes.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eStill, Stabler was expecting to see a hand with fingers missing, and in the morgue, he didn’t.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat could mean that Isabella ran away or was kidnapped, and another body was placed in the barn to make her appear dead.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eI don’t want to get my hopes up too much, but the intact fingers at the end of the episode seemed like they should mean something.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-did-we-need-iab-agent-warren\"\u003eDid We Need IAB Agent Warren?\u003c/h2\u003e\n\n\n\n\u003cp\u003eI was as un-thrilled about Agent Warren’s return as I was excited about Warner’s.\u003c/p\u003e\n\n\n\n\u003cp\u003eI don’t enjoy obviously biased cops. Warren didn’t even try to hide that he’s on a mission to get Stabler.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe must have attended the same criminal justice program as \u003ca href=\"http://tvfanatic.com/shows/days-of-our-lives\"\u003eDays of Our Lives\u003c/a\u003e‘ Melinda Trask. He was almost as subtle in his single-minded determination to use Eli to take Eli’s father down.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01467_lowRes.jpg\" alt=\"Stabler examines a body while Warner watches on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01467_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01467_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01467_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01467_lowRes-960x640.jpg 960w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01467_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEveryone pretty much held their own, so Agent Warren will likely come up empty-handed again.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’d like him to evolve past being a mustache-twirling villain. \u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eLove this show? We do too — and we want to keep writing about it.\u003cbr/\u003e\u003c/strong\u003eYour comment or share can help make sure we get to. That’s the magic of supporting indie media.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003eBiased cops exist and should be part of stories, but there’s no need for him to be so obvious and one-note about it.\u003c/p\u003e\n\n\n\n\u003cp\u003eI hope he listens for once and investigates Eli’s Field Training Officer instead. I didn’t like the way that man discouraged Eli from asking for representation and told him to lie to ensure he didn’t get in trouble.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01396_lowRes.jpg\" alt=\"Stabler and Isabella talk on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01396_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01396_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01396_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01396_lowRes-960x640.jpg 960w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01396_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMaybe he’s just a hardnosed, old school cop, but something seems off about him.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-eli-s-baby-drama-was-close-to-real-life-for-me\"\u003eEli’s Baby Drama Was Close To Real Life For Me\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs soon as Eli told Agent Warren that Becky wasn’t due for another six weeks, I knew she’d gone into labor.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eMy sister went into labor six weeks early almost 15 years ago, so I was sure it was the same situation.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m thrilled for an actual NICU storyline. \u003c/p\u003e\n\n\n\n\u003cp\u003eToo many times, shows act like premature birth is no big deal. Preemies on TV often look like full-term babies and have no significant problems requiring them to be in the NICU.\u003c/p\u003e\n\n\n\n\u003cp\u003eI don’t know how Eli is going to focus on taking care of his girlfriend and stay in the loop with the baby, though. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01157_lowRes.jpg\" alt=\"Stabler is concerned about his mother on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01157_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01157_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01157_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01157_lowRes-960x640.jpg 960w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_01157_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHe’s too nervous about the investigation, plus he’s still not fully comfortable with Stabler being in his life — and he’s gonna need his dad more right now while he has a baby in the NICU and a career on life support.\u003c/p\u003e\n\n\n\n\u003cp\u003eHis demeanor also makes it questionable whether he’s meant to be a cop. Bernie’s question at the end of the episode gave me chills.\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eBernie: What is Eli going to be?\u003c/p\u003e\n\n\n\n\u003cp\u003eElliot: I don’t understand what that means.\u003c/p\u003e\n\n\n\n\u003cp\u003eBernie: Is he gonna be a cop like you… or a cop like your father?\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eAlthough Bernie seemed to be lost in the past for most of the episode, she was surprisingly with it when she spoke to Elliot about her grandson.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-finally-a-good-use-for-vargas\"\u003eFinally, A Good Use For Vargas\u003c/h2\u003e\n\n\n\n\u003cp\u003eI’m not a fan of Vargas and I don’t know if I ever will be.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00431_lowRes.jpg\" alt=\"Stabler arrives at a crime scene on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00431_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00431_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00431_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00431_lowRes-960x640.jpg 960w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00431_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut Vargas and Randall are a good combination. \u003c/p\u003e\n\n\n\n\u003cp\u003eI liked them on \u003ca href=\"https://www.tvfanatic.com/law-and-order-organized-crime-season-4-episode-10-s-suspenseful/\"\u003eLaw \u0026amp; Order: Organized Crime Season 4 Episode 10\u003c/a\u003e when Vargas expected Randall to fit in his tiny electric car, but that was pure humor.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis time, there was a point to it.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eVargas helped Randall find out about the calls from Europe coming to Bernie’s phone that might or might not be Joe, Jr.\u003c/p\u003e\n\n\n\n\u003cp\u003e(Randomly, this would have been a perfect time for a cameo appearance from FBI: International’s Smitty as the Europol agent Vargas contacts.)\u003c/p\u003e\n\n\n\n\u003cp\u003eVargas wasn’t so great with Stabler — he shouldn’t have been surprised that his job duties included hacking into foreign feeds. Sheesh.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00232_lowRes.jpg\" alt=\"Isabella confronts Rocco on Law \u0026amp; Order: Organized Crime Season 5 Episode 5\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00232_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00232_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00232_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00232_lowRes-960x640.jpg 960w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_205800_00232_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/Peacock)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-your-turn-organized-crime-fanatics\"\u003eYour Turn, Organized Crime Fanatics\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eIt’s like yelling into the void sometimes — so if you’re out there, holler back.\u003cbr/\u003e\u003c/strong\u003eVote in our poll to rank the episode, share your thoughts below, and share this review with your friends so they can join in.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eLaw \u0026amp; Order: Organized Crime\u003c/strong\u003e \u003c/em\u003e\u003cstrong\u003e\u003cem\u003estreams on Peacock. New episodes drop on Thursdays at 6/5c.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch Law \u0026amp; Order: Organized Crime Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cbr/\u003e\u003cstrong\u003e\u003cem\u003eTV Fanatic is searching for passionate writers to share their voices across various article types. Think you have what it takes to be a TV Fanatic? \u003c/em\u003e\u003c/strong\u003e\u003ca href=\"https://www.tvfanatic.com/writers-wanted-tv-fanatic-passion-enthusiasm/\"\u003e\u003cstrong\u003e\u003cem\u003eClick here\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e\u003cem\u003e for more information and next steps.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-08T21:22:07Z",
  "modifiedTime": "2025-05-08T17:22:12Z"
}
