{
  "id": "cc24952c-cfbe-4613-8207-0224ebaf7fc9",
  "title": "AEW Dynamite: Full Lineup for Tonight's Special Winter is Coming Show",
  "link": "https://bleedingcool.com/tv/aew-dynamite-full-lineup-for-tonights-special-winter-is-coming-show/",
  "description": "The Chadster runs down the card for tonight's episode of AEW Dynamite and lists all the precautions he's taking to prevent Tony Khan from mind-controlling him.",
  "author": "Chad McMahon",
  "published": "Wed, 14 Dec 2022 17:08:10 -0600",
  "source": "https://www.bleedingcool.com/tv/feed/",
  "categories": [
    "AEW",
    "Sports",
    "TV",
    "aew",
    "dynamite",
    "winter is coming",
    "wrestling"
  ],
  "byline": "Chad McMahon",
  "length": 3386,
  "excerpt": "Winter is Coming to AEW Dynamite tonight, which means Winter is Coming to The Chadster's life because tonight's episode of Dynamite is going to TOTALLY RUIN IT! The Chadster has had enough of Tony Khan and his personal vendetta against The Chadster, but Tony Khan keeps coming. Just look at all the things Tony Khan […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: AEW, Sports, TV | Tagged: aew, dynamite, winter is coming, wrestlingWinter is Coming to AEW Dynamite tonight, which means Winter is Coming to The Chadster's life because tonight's episode of Dynamite is going to TOTALLY RUIN IT! The Chadster has had enough of Tony Khan and his personal vendetta against The Chadster, but Tony Khan keeps coming. Just look at all the things Tony Khan has done this week. He convinced Vince McMahon to try to return to WWE, causing the stock to drop. He convinced Triple H to fire Mandy Rose for posting naught pictures on the internet, even though Triple H once had sex with a corpse on live TV. And now, with WWE in chaos, the coup de grace is tonight's episode of AEW Dynamite and the action-packed card Tony Khan has put together. Auughh man! So unfair! Tonight's episode of AEW Dynamite will be an exciting one for AEW's deranged fanbase, as the main event will be a Winner Takes All match for the AEW World Title and the Dynamite Diamond Ring. MJF will take on Ricky Starks for those prizes. The Best of 7 Series continues with The Elite facing off against Death Triangle, with the score currently at 2-1. Chris Jericho will also be in action, and Ruby Soho and Tay Melo will face off in a match. Finally, House of Black will make their return to the ring. And that's just what we know about so far. Knowing Tony Khan, he probably has more tricks up his sleeve that will royally CHEESE THE CHADSTER OFF! The Chadster is preparing to survive through tonight's episode of AEW Dynamite in the only way he knows how – by stocking up on his favorite snacks, locking his door, and cocooning himself in a blanket fort. The Chadster will also be wearing his special \"Tony Khan-proof\" helmet, because he knows Tony Khan will be using some of his mind control tricks to try and ruin The Chadster's life. The Chadster has also loaded up his DVR with a few hours of WWE matches, just in case he needs a break from Tony Khan's mind games. With all of these precautions in place, The Chadster is ready to brave the night and survive AEW Dynamite. The Chadster will also be taking one final precaution to ensure his survival – expressing his disdain for Tony Khan and AEW Dynamite during the show. The Chadster will be taking out the phone book an making cold calls to everyone in the book, one-by-one, alphabetically, to tell them about Tony Khan's evil plans, talking up WWE, and generally try to do whatever he can to make Tony Khan look bad in the eyes of the public. The Chadster is hoping his phone canvasing will somehow make Tony Khan give up on his mission to ruin The Chadster's life, because The Chadster is tired of being the victim of Tony Khan's vendetta. AEW Dynamite: Winter is Coming airs tonight at 8/7C on TBS, but if you care about The Chadster at all, you won't tune in. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Chad McMahonChad McMahon, otherwise known as The Chadster, is a lifelong professional wrestling fan and now journalist. Chad’s interests also include comic books, movies, netflix, and other sports including football, baseball and basketball, both college and professional. Chad drives a Miata and is married to Keighleyanne. He loves WWE with all his heart and soul.",
  "image": "https://bleedingcool.com/wp-content/uploads/2022/12/Fj5QdmNWYAAidzP-1200x628.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"1723365\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/tv/sports/aew/\" rel=\"category\"\u003eAEW\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tv/sports/\" rel=\"category\"\u003eSports\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tv/\" rel=\"category\"\u003eTV\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/aew/\" rel=\"tag\"\u003eaew\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/dynamite/\" rel=\"tag\"\u003edynamite\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/winter-is-coming/\" rel=\"tag\"\u003ewinter is coming\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/wrestling/\" rel=\"tag\"\u003ewrestling\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cem\u003eWinter is Coming\u003c/em\u003e to \u003cem\u003eAEW Dynamite\u003c/em\u003e tonight, which means \u003cem\u003eWinter is Coming\u003c/em\u003e to The Chadster\u0026#39;s life because tonight\u0026#39;s episode of \u003cem\u003eDynamite\u003c/em\u003e is going to TOTALLY RUIN IT! The Chadster has had enough of \u003cstrong\u003eTony Khan\u003c/strong\u003e and his personal vendetta against The Chadster, but Tony Khan keeps coming. Just look at all the things Tony Khan has done this week. He convinced \u003cstrong\u003eVince McMahon\u003c/strong\u003e to try to return to WWE, causing the stock to drop. He convinced \u003cstrong\u003eTriple H\u003c/strong\u003e to fire \u003cstrong\u003eMandy Rose\u003c/strong\u003e for posting naught pictures on the internet, even though Triple H once had sex with a corpse on live TV. And now, with WWE in chaos, the coup de grace is tonight\u0026#39;s episode of \u003cem\u003eAEW Dynamite\u003c/em\u003e and the action-packed card Tony Khan has put together. Auughh man! So unfair!\u003c/p\u003e\n\u003cp\u003eTonight\u0026#39;s episode of \u003cem\u003eAEW Dynamite\u003c/em\u003e will be an exciting one for AEW\u0026#39;s deranged fanbase, as the main event will be a Winner Takes All match for the AEW World Title and the Dynamite Diamond Ring. \u003cstrong\u003eMJF\u003c/strong\u003e will take on \u003cstrong\u003eRicky Starks\u003c/strong\u003e for those prizes. The Best of 7 Series continues with \u003cstrong\u003eThe Elite\u003c/strong\u003e facing off against \u003cstrong\u003eDeath Triangle,\u003c/strong\u003e with the score currently at 2-1. \u003cstrong\u003eChris Jericho\u003c/strong\u003e will also be in action, and \u003cstrong\u003eRuby Soho\u003c/strong\u003e and \u003cstrong\u003eTay Melo\u003c/strong\u003e will face off in a match. Finally, \u003cstrong\u003eHouse of Black\u003c/strong\u003e will make their return to the ring. And that\u0026#39;s just what we know about so far. Knowing Tony Khan, he probably has more tricks up his sleeve that will royally CHEESE THE CHADSTER OFF!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2022/12/Fj5QdmNWYAAidzP.jpeg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2022/12/Fj5QdmNWYAAidzP.jpeg\" alt=\"AEW Dynamite Preview\" width=\"600\" height=\"338\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2022/12/Fj5QdmNWYAAidzP.jpeg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20338%22%20width%3D%22600%22%20height%3D%22338%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Chadster is preparing to survive through tonight\u0026#39;s episode of \u003cem\u003eAEW Dynamite\u003c/em\u003e in the only way he knows how – by stocking up on his favorite snacks, locking his door, and cocooning himself in a blanket fort. The Chadster will also be wearing his special \u0026#34;Tony Khan-proof\u0026#34; helmet, because he knows Tony Khan will be using some of his mind control tricks to try and ruin The Chadster\u0026#39;s life. The Chadster has also loaded up his DVR with a few hours of WWE matches, just in case he needs a break from Tony Khan\u0026#39;s mind games. With all of these precautions in place, The Chadster is ready to brave the night and survive \u003cem\u003eAEW Dynamite.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Chadster will also be taking one final precaution to ensure his survival – expressing his disdain for Tony Khan and \u003cem\u003eAEW Dynamite\u003c/em\u003e during the show. The Chadster will be taking out the phone book an making cold calls to everyone in the book, one-by-one, alphabetically, to tell them about Tony Khan\u0026#39;s evil plans, talking up WWE, and generally try to do whatever he can to make Tony Khan look bad in the eyes of the public. The Chadster is hoping his phone canvasing will somehow make Tony Khan give up on his mission to ruin The Chadster\u0026#39;s life, because The Chadster is tired of being the victim of Tony Khan\u0026#39;s vendetta.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAEW Dynamite: Winter is Coming\u003c/em\u003e airs tonight at 8/7C on TBS, but if you care about The Chadster at all, you won\u0026#39;t tune in.\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Ftv%2Faew-dynamite-full-lineup-for-tonights-special-winter-is-coming-show%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Faew-dynamite-full-lineup-for-tonights-special-winter-is-coming-show%2F\u0026amp;text=AEW+Dynamite%3A+Full+Lineup+for+Tonight%27s+Special+Winter+is+Coming+Show\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Faew-dynamite-full-lineup-for-tonights-special-winter-is-coming-show%2F\u0026amp;description=AEW+Dynamite%3A+Full+Lineup+for+Tonight%27s+Special+Winter+is+Coming+Show\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Faew-dynamite-full-lineup-for-tonights-special-winter-is-coming-show%2F\u0026amp;title=AEW+Dynamite%3A+Full+Lineup+for+Tonight%27s+Special+Winter+is+Coming+Show\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/7bfdd4245627909a7479e40b1ee099f3?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Chad McMahon\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/cmcmahon/\"\u003eChad McMahon\u003c/a\u003e\u003c/h2\u003eChad McMahon, otherwise known as The Chadster, is a lifelong professional wrestling fan and now journalist. Chad’s interests also include comic books, movies, netflix, and other sports including football, baseball and basketball, both college and professional. Chad drives a Miata and is married to Keighleyanne. He loves WWE with all his heart and soul.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2022-12-14T17:08:10-06:00",
  "modifiedTime": "2022-12-14T17:08:10-06:00"
}
