{
  "id": "d26f2333-28d7-4905-950c-21821f44e810",
  "title": "Days Of Our Lives Spoilers For The Week of 1-13-25 Suggest Holly Has Choices To Make While Tate Gets Closer To Sophia",
  "link": "https://www.tvfanatic.com/days-of-our-lives-spoilers-week-1-13-25-holly-has-choices-to-make/",
  "description": "Tate has grand romantic gestures, while Doug III's sketchy past and secret could break Juile’s heart. No wonder Days of Our Lives spoilers for the week of 1-13-25 say Holly needs to make a choice! The post Days Of Our Lives Spoilers For The Week of 1-13-25 Suggest Holly Has Choices To Make While Tate Gets Closer To Sophia appeared first on TV Fanatic.",
  "author": "Jack Ori",
  "published": "Sat, 11 Jan 2025 16:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Spoilers"
  ],
  "byline": "Jack Ori",
  "length": 8180,
  "excerpt": "Tate has grand romantic gestures, while Doug III's sketchy past and secret could break Juile’s heart. No wonder Holly needs to make a choice!",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "It’s a lot to ask of a teenager to stay in a relationship with a boy who is having a baby with another girl. It’s doubly hard when the girl in question is Sophia. Holly’s ex-BFF has done nothing but cause trouble for Holly and Tate. It’s unsurprising that Days of Our Lives spoilers for the week of 1-13-25 suggest Holly is debating moving on from Tate. (Peacock/Screenshot) Tate’s Grand Romantic Gesture Won’t Be Enough For Holly Tate is still pretending he’s not about to go through a life-changing event with a girl he isn’t interested in. If Sophia weren’t pregnant, wooing Holly back with grand romantic gestures would make sense, and the scenes would be sweet. This Tate baby story is mostly for the sake of drama (we all know Tate and Holly will be back together eventually!), but pretending he’s not about to be a father isn’t going to do Tate any favors, nor will it impress Holly. If Tate wants to be with Holly, what he needs to do is explain to her how this is going to work, but it’s not reasonable to expect a 17-year-old who recently got caught taking his ex across state lines to get an abortion to think that rationally. In any case, Tate’s gesture might make Holly think twice about her decision to break all ties with him, but it won’t ultimately win her over. (Peacock/Screenshot) Days of Our Lives spoilers for the week of 1-13-25 say that Holly will be thinking about Doug III.  Holly doesn’t have great choices in this love triangle. Tate’s a decent guy who is trying to do the right thing but doesn’t fully understand the extent to which his life is about to change. He is soon going to be tied to his ex-girlfriend, who hates Holly. Doug III has a capacity for decency, as demonstrated by his genuine concern for Julie, but he stole Alice Horton’s necklace and sold it to pay off debts to unsavory people, and God only knows what else is in his past. Holly is already keeping secrets for him, and she’s planning on lying to Maggie.  No good can come from her going down this path, especially only a year after she lied to everyone about her drug problem. Philip’s Been Cornered, But His Forgery Storyline Is Far From Over (Peacock/Screenshot) Stephanie breaks up with Philp and seems poised to tell Sarah the truth, but that doesn’t mean that Philip’s forgery will be exposed any time soon. Sarah had hoped that Philip and Xander working together would curb Xander’s worse impulses — and she knows Philip is the only thing standing between Xander and a hostile takeover of Dimera Enterprises. Since she doesn’t like that idea, she might decide to go along with Philip’s subterfuge because she wants that guardrail to stand firm against Xander’s potentially terrible idea. I know. My eyes are rolling so hard at that idea that it hurts. Sarah’s usually one of those upstanding moral-to-a-flaw characters (though she did run away with baby Rachel after learning she was Kristen’s, which is one of the reasons Kristen hates her.) That could be why Days of Our Lives spoilers for the week of 1-13-25 say that Sarah is going to swear Stephanie to secrecy. Are Days of Our Lives Spoilers For The Week of 1-13-25 Suggesting That Sarah Will Betray Xander? (Peacock/Screenshot) It makes sense for Sarah to keep the truth secret, even though it’s a bad idea. Sarah’s worst fear is Xander breaking the law in some significant way and getting sent to prison. Still, how many times has Xander complained that the only thing standing between him and absolute control of Titan is that “stupid bloody letter from Victor”?  If Sarah knows that the letter is fake and keeps Xander from knowing the truth, in his eyes, she is no better than Philip. She’s complicit with stealing what’s rightfully Xander’s from him. It’s the same thing Theresa did when she forged a (different) letter to deny Xander his inheritance. Xander was ready to kill Theresa for that, so how will he feel when he learns that his wife did the same thing? (Peacock/Screenshot) That’s not something that’s easy to come back from, and with new writers coming in soon, I’m not sure that Sarah and Xander are going to make it as a couple. Sorry, Xarah fans! This could be the beginning of the end for this couple, and it sucks. Please Don’t Tell Me That Ava’s Going To Give In To Rachel’s Nonsense Days of Our Lives spoilers for the week of 1-13-25 say that Rachel will continue misbehaving — and that Ava wants to break things off with Brady. I hate when Ava is written as weak.  The woman is a former Mafia princess who brought down Shawn Sr.’s plane, used Kayla as leverage to force Steve to have sex with her on multiple occasions, and was unafraid to kidnap EJ’s mother to mess with him. (Peacock/Screenshot) She should be one of TV’s most badass women, not someone who’s going to back down because a pre-teen is messing with her in vague, childish ways. Ava might also go the same stupid direction Chloe did and decide she has to break up with Brady “for Rachel’s sake.” That kind of nonsense is exactly why Rachel has the problems that she does.  Brady and Kristen are united in their idea that they want better for her than a life spent using her money and power to manipulate, break laws with impunity, and make enemies out of all of Salem. It starts by denying Rachel any power over her parents’ relationships. Rachel acts out every time Brady is with someone other than her mother, and Brady and his girlfriend of the moment agree that they’ll break up because it makes Rachel unhappy. That’s terrible parenting. Rachel needs to learn for once and all that she cannot manipulate Brady and Kristen back into a relationship. (Peacock/Screenshot) She needs to face her heartbreak over her parents’ divorce and process it, and she also needs firm boundaries and the message that while her pain is understandable, it is not a license to act any way she feels like. Days of Our Lives spoilers for the week of 1-13-25 don’t say what Rachel does now, but Kristen will catch her misbehaving again, and it’s 50-50 whether she’ll do anything about it. I rarely have any love for Kristen, but I was impressed that she punished Rachel for the first batch of threatening texts. That’s more than Brady has ever done; he usually spends half an hour reassuring Rachel he’s not angry when he sends her to her room or otherwise punishes her. Does Anyone Care About This Silly Lady Whistleblower Storyline? Leo is involved in two stories this week, according to Days of Our Lives spoilers for the week of 1-13-25. He and Javi will reconcile. Unfortunately, Gabi will react more or less the same way Julie did to JJ’s interest in Gabi. (Peacock/Screenshot) Even worse, Leo is determined to set a trap for Lady Whistleblower, aka Kerry, Javi’s newest ex who Leo already rejected. This story is based on such a weak sauce premise. I’m sorry, but an anonymous columnist writing spoilers about a soap opera is not a scandal, nor is it something that will end a show or a writer’s career. I shouldn’t have to devote time in my own spoiler article to explaining that a real-life soap producer who tried to shut down all such articles would be violating the First Amendment for no reason whatsoever. Days of Our Lives is twisting beloved characters like Abe out of shape by demanding Lady Whistleblower be canceled for publishing a scathingly negative review on top of sharing spoilers. This whole story seems like outgoing head writer Ron Carlivati’s fantasy revenge against critics and other entertainment journalists — and it’s only making fans count down the days until the new writing team’s material starts airing. (Peacock/Screenshot) Let’s hope whatever trap Leo sets works and we can get rid of this nonsensical storyline. Over to you, Days of Our Lives fanatics! What Days of Our Lives spoilers for the week of 12-13-25 are you most looking forward to?  Vote in our poll for your favorite, and then hit the comments with your thoughts. Username or Email AddressPassword Watch Days of Our Lives Online",
  "image": "https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-830507\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003eIt’s a lot to ask of a teenager to stay in a relationship with a boy who is having a baby with another girl.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s doubly hard when the girl in question is Sophia. Holly’s ex-BFF has done nothing but cause trouble for Holly and Tate.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s unsurprising that\u003ca href=\"https://tvfanatic.com/shows/days-of-our-lives\"\u003e Days of Our Lives\u003c/a\u003e spoilers for the week of 1-13-25 suggest Holly is debating moving on from Tate.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1024x576.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1024x576.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-300x169.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-768x432.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-2048x1152.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-728x410.jpg 728w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-960x540.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1080x608.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1200x675.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-scaled.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-tate-s-grand-romantic-gesture-won-t-be-enough-for-holly\"\u003eTate’s Grand Romantic Gesture Won’t Be Enough For Holly\u003c/h2\u003e\n\n\n\n\u003cp\u003eTate is still pretending he’s not about to go through a life-changing event with a girl he isn’t interested in.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf Sophia weren’t pregnant, wooing Holly back with grand romantic gestures would make sense, and the scenes would be sweet.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThis Tate baby story is mostly for the \u003ca href=\"https://www.tvfanatic.com/lists/23-couples-who-split-for-the-sake-of-drama/\"\u003esake of drama\u003c/a\u003e (we all know Tate and Holly will be back together eventually!), but pretending he’s not about to be a father isn’t going to do Tate any favors, nor will it impress Holly.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf Tate wants to be with Holly, what he needs to do is explain to her how this is going to work, but it’s not reasonable to expect a 17-year-old who recently got caught taking his ex across state lines to get an abortion to think that rationally.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn any case, Tate’s gesture might make Holly think twice about her decision to break all ties with him, but it won’t ultimately win her over.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"752\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-752x1024.jpg 752w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-220x300.jpg 220w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-768x1046.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-705x960.jpg 705w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-793x1080.jpg 793w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-881x1200.jpg 881w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325.jpg 1153w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eDays of Our Lives spoilers for the week of 1-13-25 say that Holly will be thinking about Doug III. \u003c/p\u003e\n\n\n\n\u003cp\u003eHolly doesn’t have great choices in this love triangle.\u003c/p\u003e\n\n\n\n\u003cp\u003eTate’s a decent guy who is trying to do the right thing but doesn’t fully understand the extent to which his life is about to change. He is soon going to be tied to his ex-girlfriend, who hates Holly.\u003c/p\u003e\n\n\n\n\u003cp\u003eDoug III has a capacity for decency, as demonstrated by his genuine concern for Julie, but he stole Alice Horton’s necklace and sold it to pay off debts to unsavory people, and God only knows what else is in his past.\u003c/p\u003e\n\n\n\n\u003cp\u003eHolly is already keeping secrets for him, and she’s planning on lying to Maggie. \u003c/p\u003e\n\n\n\n\u003cp\u003eNo good can come from her going down this path, especially only a year after she lied to everyone about her drug problem.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-philip-s-been-cornered-but-his-forgery-storyline-is-far-from-over\"\u003ePhilip’s Been Cornered, But His Forgery Storyline Is Far From Over\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"731\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325-731x1024.jpg 731w, https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325-214x300.jpg 214w, https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325-768x1075.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325-686x960.jpg 686w, https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325-771x1080.jpg 771w, https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325-857x1200.jpg 857w, https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325.jpg 1154w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Philip-Kiriakis-John-Paul-Lavoisier-is-cornered-DOOL-011325.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eStephanie breaks up with Philp and seems poised to tell Sarah the truth, but that doesn’t mean that Philip’s forgery will be exposed any time soon.\u003c/p\u003e\n\n\n\n\u003cp\u003eSarah had hoped that Philip and Xander working together would curb Xander’s worse impulses — and she knows Philip is the only thing standing between Xander and a hostile takeover of Dimera Enterprises.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince she doesn’t like that idea, she might decide to go along with Philip’s subterfuge because she wants that guardrail to stand firm against Xander’s potentially terrible idea.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eI know. My eyes are rolling so hard at that idea that it hurts. Sarah’s usually one of those upstanding moral-to-a-flaw characters (though she did run away with baby Rachel after learning she was Kristen’s, which is one of the reasons Kristen hates her.)\u003c/p\u003e\n\n\n\n\u003cp\u003eThat could be why Days of Our Lives spoilers for the week of 1-13-25 say that Sarah is going to swear Stephanie to secrecy.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-are-days-of-our-lives-spoilers-for-the-week-of-1-13-25-suggesting-that-sarah-will-betray-xander\"\u003eAre Days of Our Lives Spoilers For The Week of 1-13-25 Suggesting That Sarah Will Betray Xander?\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"890\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325-890x1024.jpg 890w, https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325-261x300.jpg 261w, https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325-768x884.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325-834x960.jpg 834w, https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325-939x1080.jpg 939w, https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325-1043x1200.jpg 1043w, https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325.jpg 1428w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Chad-and-Cat-literally-bump-into-each-other-DOOL-011325.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt makes sense for Sarah to keep the truth secret, even though it’s a bad idea.\u003c/p\u003e\n\n\n\n\u003cp\u003eSarah’s worst fear is Xander breaking the law in some significant way and getting sent to prison.\u003c/p\u003e\n\n\n\n\u003cp\u003eStill, how many times has Xander complained that the only thing standing between him and absolute control of Titan is that “stupid bloody letter from Victor”? \u003c/p\u003e\n\n\n\n\u003cp\u003eIf Sarah knows that the letter is fake and keeps Xander from knowing the truth, in his eyes, she is no better than Philip.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe’s complicit with stealing what’s rightfully Xander’s from him. It’s the same thing Theresa did when she forged a (different) letter to deny Xander his inheritance.\u003c/p\u003e\n\n\n\n\u003cp\u003eXander was ready to kill Theresa for that, so how will he feel when he learns that his wife did the same thing?\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"794\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635-794x1024.jpg 794w, https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635-233x300.jpg 233w, https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635-768x990.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635-745x960.jpg 745w, https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635-838x1080.jpg 838w, https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635-931x1200.jpg 931w, https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635.jpg 1290w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Rachel-DImera-Finley-Rose-Slater-continues-misbehaving-DOOL-011635.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThat’s not something that’s easy to come back from, and with new writers coming in soon, I’m not sure that Sarah and Xander are going to make it as a couple.\u003c/p\u003e\n\n\n\n\u003cp\u003eSorry, Xarah fans! This could be the beginning of the end for this couple, and it sucks.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-please-don-t-tell-me-that-ava-s-going-to-give-in-to-rachel-s-nonsense\"\u003ePlease Don’t Tell Me That Ava’s Going To Give In To Rachel’s Nonsense\u003c/h2\u003e\n\n\n\n\u003cp\u003eDays of Our Lives spoilers for the week of 1-13-25 say that Rachel will continue misbehaving — and that Ava wants to break things off with Brady.\u003c/p\u003e\n\n\n\n\u003cp\u003eI hate when Ava is written as weak. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe woman is a former Mafia princess who brought down Shawn Sr.’s plane, used Kayla as leverage to force Steve to have sex with her on multiple occasions, and was unafraid to kidnap EJ’s mother to mess with him.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"820\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325-820x1024.jpg 820w, https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325-240x300.jpg 240w, https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325-768x959.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325-769x960.jpg 769w, https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325-865x1080.jpg 865w, https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325-961x1200.jpg 961w, https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325.jpg 1365w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Holly-Jonas-Ashley-Puzemis-DOOL-011325.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eShe should be one of \u003ca href=\"https://www.tvfanatic.com/lists/tvs-badass-and-inspirational-women/\"\u003eTV’s most badass women\u003c/a\u003e, not someone who’s going to back down because a pre-teen is messing with her in vague, childish ways.\u003c/p\u003e\n\n\n\n\u003cp\u003eAva might also go the same stupid direction Chloe did and decide she has to break up with Brady “for Rachel’s sake.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThat kind of nonsense is exactly why Rachel has the problems that she does. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eBrady and Kristen are united in their idea that they want better for her than a life spent using her money and power to manipulate, break laws with impunity, and make enemies out of all of Salem. It starts by denying Rachel any power over her parents’ relationships.\u003c/p\u003e\n\n\n\n\u003cp\u003eRachel acts out every time Brady is with someone other than her mother, and Brady and his girlfriend of the moment agree that they’ll break up because it makes Rachel unhappy.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s terrible parenting. Rachel needs to learn for once and all that she cannot manipulate Brady and Kristen back into a relationship.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"907\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625-907x1024.jpg 907w, https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625-266x300.jpg 266w, https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625-768x867.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625-850x960.jpg 850w, https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625-957x1080.jpg 957w, https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625-1063x1200.jpg 1063w, https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625.jpg 1473w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Johns-Absence-Bothers-Marlena-Evans-Deidre-Hall-DOOL-011625.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eShe needs to face her heartbreak over her parents’ divorce and process it, and she also needs firm boundaries and the message that while her pain is understandable, it is not a license to act any way she feels like.\u003c/p\u003e\n\n\n\n\u003cp\u003eDays of Our Lives spoilers for the week of 1-13-25 don’t say what Rachel does now, but Kristen will catch her misbehaving again, and it’s 50-50 whether she’ll do anything about it.\u003c/p\u003e\n\n\n\n\u003cp\u003eI rarely have any love for Kristen, but I was impressed that she punished Rachel for the first batch of threatening texts.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s more than Brady has ever done; he usually spends half an hour reassuring Rachel he’s not angry when he sends her to her room or otherwise punishes her.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-does-anyone-care-about-this-silly-lady-whistleblower-storyline\"\u003eDoes Anyone Care About This Silly Lady Whistleblower Storyline?\u003c/h2\u003e\n\n\n\n\u003cp\u003eLeo is involved in two stories this week, according to Days of Our Lives spoilers for the week of 1-13-25.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe and Javi will reconcile. Unfortunately, Gabi will react more or less the same way Julie did to JJ’s interest in Gabi.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"874\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo-874x1024.jpg 874w, https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo-256x300.jpg 256w, https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo-768x900.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo-819x960.jpg 819w, https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo-921x1080.jpg 921w, https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo-1024x1200.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo.jpg 1335w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Javi-Al-Calderon-is-about-to-get-an-earful-about-Leo.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEven worse, Leo is determined to set a trap for Lady Whistleblower, aka Kerry, Javi’s newest ex who Leo already rejected.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis story is based on such a weak sauce premise.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m sorry, but an anonymous columnist writing spoilers about a soap opera is not a scandal, nor is it something that will end a show or a writer’s career.\u003c/p\u003e\n\n\n\n\u003cp\u003eI shouldn’t have to devote time in my own spoiler article to explaining that a real-life soap producer who tried to shut down all such articles would be violating the First Amendment for no reason whatsoever.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eDays of Our Lives is twisting beloved characters like Abe out of shape by demanding Lady Whistleblower be canceled for publishing a scathingly negative review on top of sharing spoilers.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis whole story seems like outgoing head writer Ron Carlivati’s fantasy revenge against critics and other entertainment journalists — and it’s only making fans count down the days until the new writing team’s material starts airing.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"752\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-752x1024.jpg 752w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-220x300.jpg 220w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-768x1046.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-705x960.jpg 705w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-793x1080.jpg 793w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325-881x1200.jpg 881w, https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325.jpg 1153w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Leo-wants-to-trap-Lady-Whistleblower-DOOL-011325.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peacock/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eLet’s hope whatever trap Leo sets works and we can get rid of this nonsensical storyline.\u003c/p\u003e\n\n\n\n\u003cp\u003eOver to you, Days of Our Lives fanatics!\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat Days of Our Lives spoilers for the week of 12-13-25 are you most looking forward to? \u003c/p\u003e\n\n\n\n\u003cp\u003eVote in our poll for your favorite, and then hit the comments with your thoughts.\u003c/p\u003e\n\n\n\n\u003cdiv data-id=\"486\" data-temp=\"basic\" data-skin=\"minimal\" data-cscheme=\"black\" data-cap=\"0\" data-access=\"guest,wordpress\" data-tid=\"\" data-uid=\"25f95e69c2e3ed28cb20a3497f879569\" data-pid=\"830507\" data-resdet=\"percentages\" data-show-results-to=\"registered\" data-show-results-moment=\"after-vote\" data-show-results-only=\"false\" data-show-message=\"true\" data-show-results-as=\"bar\" data-sort-results-by=\"as-defined\" data-sort-results-rule=\"asc\" data-is-ended=\"0\" data-gdpr=\"no\" data-gdpr-sol=\"consent\" data-css=\"\" data-counter=\"0\" data-load-with=\"1\" data-notification-section=\"top\"\u003e\u003cp\u003e\u003clabel\u003eUsername or Email Address\u003c/label\u003e\u003c/p\u003e\u003cp\u003e\u003clabel\u003ePassword\u003c/label\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch Days of Our Lives Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\n\n\u003cdiv\u003e\u003cfigure\u003e\u003ca href=\"https://www.tvfanatic.com/days-of-our-lives-spoilers-week-1-13-25-holly-has-choices-to-make/\" target=\"_self\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"728\" height=\"410\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-728x410.jpg\" alt=\"Days Of Our Lives Spoilers For The Week of 1-13-25 Suggest Holly Has Choices To Make While Tate Gets Closer To Sophia\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-728x410.jpg 728w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-300x169.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1024x576.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-768x432.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-2048x1152.jpg 2048w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-960x540.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1080x608.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/01/Lead-Photo-Holly-Jonas-Ashley-Puzemis-confronts-Doug-Williams-III-Peyton-Meyer-about-his-secret-DOOL-011625-1200x675.jpg 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-trellis-processed=\"1\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\u003c/li\u003e\u003cli\u003e\n\n\n\n\u003c/li\u003e\u003cli\u003e\n\n\n\n\u003c/li\u003e\u003cli\u003e\n\n\n\n\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-11T16:00:00Z",
  "modifiedTime": "2025-01-10T17:32:18Z"
}
