{
  "id": "fa7d3466-987a-475b-a15f-71752f983307",
  "title": "Bee-nado and Beyond: Peter Krause Talks ‘9-1-1’ Season 8’s Thrilling Start",
  "link": "https://www.tvfanatic.com/bee-nado-and-beyond-peter-krause-talks-9-1-1-season-8s-thrilling-start/",
  "description": "The decision to kick off 9-1-1 Season 8 with a bee-nado and midair plane collision turned out to be one of … The post Bee-nado and Beyond: Peter Krause Talks ‘9-1-1’ Season 8’s Thrilling Start appeared first on TV Fanatic.",
  "author": "Whitney Evans",
  "published": "Fri, 11 Oct 2024 01:30:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Interviews"
  ],
  "byline": "Whitney Evans",
  "length": 9130,
  "excerpt": "Peter Krause talks the 9-1-1 opening emergency and the evolution of Bobby and Athena's relationship. Don't miss this fun interview!",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "The decision to kick off 9-1-1 Season 8 with a bee-nado and midair plane collision turned out to be one of the greatest feats the notoriously ambitious series has ever accomplished. The three-part opening emergency had a little bit of everything. It came to an emotionally charged and action-filled end during 9-1-1 Season 8 Episode 3, when Athena Grant, with the help of devoted hubby Bobby Nash, landed a plane on the Los Angeles freeway. (Disney/Kevin Estrada) The hour was a showcase for Angela Bassett and Peter Krause, who continue to build upon the legend that is super-couple Bathena. And coming out of the moving hour, we had to talk to Krause about it. Chatting with Peter Krause is guaranteed to leave you with a smile. The veteran actor loves the show he’s been a part of for eight seasons and counting, has a loving respect for his on-screen wife, and has excellent insight into Bobby. This chat left this writer smiling, hopefully leaving you feeling the same way. Enjoy this one, 9-1-1 fanatics! (Disney/Kevin Estrada) Hi Peter. How are you? I’m good, Whitney. How are you doing? I’m good, thank you. I wanted to ask you about the evolution of Bobby and Athena’s relationship. When we started season seven, we saw them having some issues in their marriage, which they obviously worked through, but this season, they seem to have to be stronger than ever. So, talk to me about the evolution of their relationship to this point and what we can expect to continue to see from them this season. Whitney, what issues do you think Bobby and Athena had in season seven? Aside from the fact that she didn’t want to go on a cruise. (Disney/Chris Willard) They weren’t communicating very well, and the question of, ‘Why does she not want to be alone with him?’ Some of those issues were present. Yeah. She didn’t want to disappoint Bobby. Yes. I guess she did. She had that fear of, ‘What are they going to do?’ You have to refresh my memory a little bit. I just remember she didn’t want to go on the cruise, but there was that whole thing. Not to be alone. Exactly. So, can you talk to me about their evolution? This season, they’re strong. Will we continue to see them seem to rely on and lean on each other as the season continues? (Disney/Chris Willard) Yeah, they’ve always relied on each other. They’re there for each other. What the show does very well is show them relying on each other in extreme circumstances. I liked the end of that last season when they came back from the cruise and were sitting in tourist clothes briefly on the sofa. They had that bag of burgers and fries, and then they realized they were finally alone, alone at last, after saving that ragtag group of people aboard the ship. They’re also there for each other in those ways too, simple ways. And then, of course, what Bobby goes through with Amir, Athena’s there for Bobby throughout that. I think she also helped him let go in the same way, or she kind of underlined that Amir was able to let go and see Bobby as a person who didn’t maliciously start the fire and all that. But Bobby had some more letting go, too. So they’re there for each other in those more relatable ways or the way that people are in a relationship emotionally. They’re there for each other emotionally, as well as in those extreme circumstances. Yes, like in this last episode. (Disney/Kevin Estrada) And it goes back and forth like a seesaw. Athena will save Bobby; Bobby will save Athena. Bobby and Athena will save a bunch of other people. And that’s a lot of fun. This season, Tim Minear did an excellent job weaving together the bee-nado, the flight, Bobby being off on Hotshots, the show within the show. I love that Bobby and Athena come together with the plane landing on the freeway and Bobby there on this stolen fire engine, or borrowed, as we say. That’s a great, great scene. It’s been great working with Angela over the years. When Tim Minear brought them together in season two and had them get married, I thought that was a genius move on his part to say, ‘Let’s not draw this out; let’s just smash them together and then take it from there.’ That was a really good move. (Disney/Christopher Willard) I agree. I really enjoy the capers, so I also enjoyed this episode when they found the red sports car. They’re on the trail like Robert Wagner and Stefanie Powers in a Hart to Hart-style TV series, doing crimes together. That’s another fun element of our sprawling show. Yes, for sure. And you brought up Hotshots, which I have been raving about in my writings. It’s genius. It’s a perfect way to get Bobby outside of his comfort zone. What did you think about that when it was brought to you that this was what Bobby would be doing away from the 118? And how does that role challenge Bobby? It’s challenging in that he doesn’t want to be there, but he wants to do a good job and also wants to take care of Brad Torrance, the actor. (FOX) He’s sort of a man-child, and I think Bobby sees through his actor exterior; there’s a good person in there, and he wants to help him out. But he becomes rather obsessed with Bobby as time goes on. It was also really fun to have Brad jump in the fire engine and be with us out there on the freeway, stopping traffic and then later watching him wheeled out on the stretcher was a lot of fun. Since he’s been at Hotshots, it seems Bobby’s a little bit out of the loop on things happening at the 118. Do you think Bobby’s been putting some distance because he’s feeling the effects of just not being there around his team? Well, I think that Bobby’s a pretty honorable guy. Gerrard is the captain there, and they’ve got to work their things out. Obviously, he’d rather be there than on the TV show. But given his level of guilt over his past and wanting to walk away from being a fire captain, however briefly, feeling like he shouldn’t be doing that, he’s certainly longing to return to the firehouse. (Disney/Christopher Willard) I like that in this episode, he steps right in when he gets to the scene to give orders. It’s just what he does. Yeah, it’s his nature. It’s his team. It’s his team. This is how they work well together. It’s his natural place being their leader. I like that too. Tim did, again, a fantastic job with the first three episodes. It’s one of our best. I’ve started to look at them like movies now, our first three episodes. And that’s something that’s evolved over time, and I think that’s part of the reason why the show is a hit again. Suddenly, we’re as popular as we were when we first came out. It’s very interesting. But to relaunch on ABC, and then I think getting better at evolving as a show, and Tim coming back has certainly done a big boom, and we just did the ten episodes last year. But again, weaving together all these different elements — Bobby working at Hotshots, Athena traveling with the witness and the aircraft, the bee-nado, and the small plane getting smothered in bees — it’s just done really nicely. (Disney/Kevin Estrada ) I think this is one of our most tightly put-together first three episodes. It’s really good. I agree. I hope you enjoyed it. I’ve been ranting and raving about it. I really, really enjoyed it. Once we get past these three episodes, obviously without spoilers, what can you tease us about what to expect? I don’t know. I don’t know if I can tease anything. I would tell you everything if I didn’t have to have phone calls about it later. I totally get it. Last one for me because it was touched on a little bit in the opening hour about Bobby and Athena house hunting. What do you think is the top thing Bobby is looking for when he and Athena go house hunting? Oh, honestly, I think Bobby wants a home that Athena will be happy in. (Disney/Christopher Willard) I’m not sure exactly what Tim has planned in that arena. We haven’t really discussed it, but that’s also a storyline that hasn’t had as much momentum. So, as we head deeper into the season, what will happen there? Gotcha. Or if they’ll make some other decision. I don’t know. All right. Well, we’ll have to stay tuned, right? If they’re going to go live on a cruise ship. Oh, no, no, no. Gosh, what were those characters’ names? I want to say Romy and Michelle because one of the actors’ names is Romy. Lola! (Disney/Mike Taing) Lola, yes. Lola and whatever his name was. I remember Dan, the actor. But yeah, they’re going to go live on cruise ships like them. Wow. I don’t know. You didn’t have such great luck next time. I don’t see that happening. No, me neither. Well, thank you so much for your time, Peter. I appreciate it. Sure, yeah. But the Halloween episode is a lot of fun. I can’t tell you anything about it, but the Halloween episode is going to be really good. This interview has been edited for length and clarity. You can watch 9-1-1 on Thursdays at 8/7c on ABC. Watch 9-1-1 Online",
  "image": "https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-814815\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003eThe decision to kick off \u003ca href=\"https://www.tvfanatic.com/shows/9-1-1/\"\u003e9-1-1\u003c/a\u003e Season 8 with a bee-nado and midair plane collision turned out to be one of the greatest feats the notoriously ambitious series has ever accomplished.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe three-part opening emergency had a little bit of everything.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt came to an emotionally charged and action-filled end during \u003ca href=\"https://www.tvfanatic.com/9-1-1-season-8-episode-3-review-final-approach/\"\u003e9-1-1 Season 8 Episode 3\u003c/a\u003e, when Athena Grant, with the help of devoted hubby Bobby Nash, landed a plane on the Los Angeles freeway.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-1024x576.jpg\" alt=\"Bobby won\u0026#39;t let anyone stop him from getting to Athena on 9-1-1 Season 8 Episode 3.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-1024x576.jpg 1024w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-300x169.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-768x432.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-2048x1152.jpg 2048w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-728x410.jpg 728w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-960x540.jpg 960w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-1080x608.jpg 1080w, https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-1200x675.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/174385_0277-scaled.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Kevin Estrada)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe hour was a showcase for Angela Bassett and Peter Krause, who continue to build upon the legend that is super-couple Bathena. And coming out of the moving hour, we had to talk to Krause about it.\u003c/p\u003e\n\n\n\n\u003cp\u003eChatting with Peter Krause is guaranteed to leave you with a smile.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe veteran actor loves the show he’s been a part of for eight seasons and counting, has a loving respect for his on-screen wife, and has excellent insight into Bobby.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis chat left this writer smiling, hopefully leaving you feeling the same way.\u003c/p\u003e\n\n\n\n\u003cp\u003eEnjoy this one, 9-1-1 fanatics!\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"683\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0102.jpg\" alt=\"Bobby longs to help his wife during 9-1-1 Season 8 Episode 3.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-683x1024.jpg 683w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-768x1152.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-1365x2048.jpg 1365w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-640x960.jpg 640w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-720x1080.jpg 720w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102-800x1200.jpg 800w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0102.jpg 1600w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0102.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Kevin Estrada)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHi Peter. How are you?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m good, Whitney. How are you doing?\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI’m good, thank you. I wanted to ask you about the evolution of Bobby and Athena’s relationship. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhen we started season seven, we saw them having some issues in their marriage, which they obviously worked through, but this season, they seem to have to be stronger than ever.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\u003cstrong\u003eSo, talk to me about the evolution of their \u003ca href=\"https://www.tvfanatic.com/memorable-tv-relationships-that-were-worth-the-wait/\"\u003erelationship\u003c/a\u003e to this point and what we can expect to continue to see from them this season.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWhitney, what issues do you think Bobby and Athena had in season seven? Aside from the fact that she didn’t want to go on a cruise.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"680\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1.jpg\" alt=\"Bathena Dances - 9-1-1 Season 7 Episode 1\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1-680x1024.jpg 680w, https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1-199x300.jpg 199w, https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1-768x1156.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1-638x960.jpg 638w, https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1-717x1080.jpg 717w, https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1.jpg 797w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/03/bathena-dances-9-1-1-season-7-episode-1.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Chris Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThey weren’t communicating very well, and the question of, ‘Why does she not want to be alone with him?’ Some of those issues were present.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eYeah. She didn’t want to disappoint Bobby.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eYes.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI guess she did. She had that fear of, ‘What are they going to do?’ You have to refresh my memory a little bit.\u003c/p\u003e\n\n\n\n\u003cp\u003eI just remember she didn’t want to go on the cruise, but there was that whole thing. Not to be alone.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eExactly. So, can you talk to me about their evolution? This season, they’re strong. Will we continue to see them seem to rely on and lean on each other as the season continues?\u003c/strong\u003e\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"817\" src=\"https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8.jpg\" alt=\"Desert Bobby - 9-1-1 Season 7 Episode 8\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8-1024x817.jpg 1024w, https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8-300x240.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8-768x613.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8-960x766.jpg 960w, https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8-1080x862.jpg 1080w, https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/05/desert-bobby-9-1-1-season-7-episode-8.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Chris Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eYeah, they’ve always relied on each other. They’re there for each other. What the show does very well is show them relying on each other in extreme circumstances. \u003c/p\u003e\n\n\n\n\u003cp\u003eI liked the end of that last season when they came back from the cruise and were sitting in tourist clothes briefly on the sofa.\u003c/p\u003e\n\n\n\n\u003cp\u003eThey had that bag of burgers and fries, and then they realized they were finally alone, alone at last, after saving that ragtag group of people aboard the ship.\u003c/p\u003e\n\n\n\n\u003cp\u003eThey’re also there for each other in those ways too, simple ways. And then, of course, what Bobby goes through with Amir, Athena’s there for Bobby throughout that.\u003c/p\u003e\n\n\n\n\u003cp\u003eI think she also helped him let go in the same way, or she kind of underlined that Amir was able to let go and see Bobby as a person who didn’t maliciously start the fire and all that. But Bobby had some more letting go, too.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo they’re there for each other in those more relatable ways or the way that people are in a relationship emotionally. They’re there for each other emotionally, as well as in those extreme circumstances.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eYes, like in this last episode.\u003c/strong\u003e\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"682\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0339.jpg\" alt=\"Bobby looks back at Brad in the truck during 9-1-1 Season 8 Episode 3.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0339-682x1024.jpg 682w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0339-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0339-768x1152.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0339-640x960.jpg 640w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0339-720x1080.jpg 720w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0339-800x1200.jpg 800w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0339.jpg 1333w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0339.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Kevin Estrada)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAnd it goes back and forth like a seesaw. Athena will save Bobby; Bobby will save Athena. Bobby and Athena will save a bunch of other people. And that’s a lot of fun. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis season, \u003ca href=\"https://www.tvfanatic.com/from-bee-nado-to-emotional-depth-9-1-1-ep-showrunner-tim-minear-talks-new-season/\"\u003eTim Minear\u003c/a\u003e did an excellent job weaving together the bee-nado, the flight, Bobby being off on Hotshots, the show within the show. \u003c/p\u003e\n\n\n\n\u003cp\u003eI love that Bobby and Athena come together with the plane landing on the freeway and Bobby there on this stolen fire engine, or borrowed, as we say.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThat’s a great, great scene.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s been great working with Angela over the years. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Tim Minear brought them together in season two and had them get married, I thought that was a genius move on his part to say, ‘Let’s not draw this out; let’s just smash them together and then take it from there.’ \u003c/p\u003e\n\n\n\n\u003cp\u003eThat was a really good move.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-scaled.jpg\" alt=\"Bobby gives orders on the set of his new job during 9-1-1 Season 8 Episode 1.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-1024x576.jpg 1024w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-300x169.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-768x432.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-2048x1152.jpg 2048w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-728x410.jpg 728w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-480x270.jpg 480w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-320x180.jpg 320w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-960x540.jpg 960w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-1080x608.jpg 1080w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-1200x675.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0247-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Christopher Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI agree.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI really enjoy the capers, so I also enjoyed this episode when they found the red sports car. \u003c/p\u003e\n\n\n\n\u003cp\u003eThey’re on the trail like Robert Wagner and Stefanie Powers in a Hart to Hart-style TV series, doing crimes together. That’s another fun element of our sprawling show.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eYes, for sure. And you brought up Hotshots, which I have been raving about in my writings. It’s genius. It’s a perfect way to get Bobby outside of his comfort zone. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat did you think about that when it was brought to you that this was what Bobby would be doing away from the 118? And how does that role challenge Bobby?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s challenging in that he doesn’t want to be there, but he wants to do a good job and also wants to take care of Brad Torrance, the actor. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"663\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2.jpg\" alt=\"Looking Up - 9-1-1 Season 4 Episode 2\" srcset=\"https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2-663x1024.jpg 663w, https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2-194x300.jpg 194w, https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2-768x1187.jpg 768w, https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2-621x960.jpg 621w, https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2-699x1080.jpg 699w, https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2-776x1200.jpg 776w, https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2.jpg 1294w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2021/01/looking-up-9-1-1-season-4-episode-2.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (FOX)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHe’s sort of a man-child, and I think Bobby sees through his actor exterior; there’s a good person in there, and he wants to help him out. But he becomes rather obsessed with Bobby as time goes on. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt was also really fun to have Brad jump in the fire engine and be with us out there on the freeway, stopping traffic and then later watching him wheeled out on the stretcher was a lot of fun.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSince he’s been at Hotshots, it seems Bobby’s a little bit out of the loop on things happening at the 118. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eDo you think Bobby’s been putting some distance because he’s feeling the effects of just not being there around his team?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWell, I think that Bobby’s a pretty honorable guy. Gerrard is the captain there, and they’ve got to work their things out. Obviously, he’d rather be there than on the TV show. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut given his level of guilt over his past and wanting to walk away from being a fire captain, however briefly, feeling like he shouldn’t be doing that, he’s certainly longing to return to the firehouse.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"684\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0530.jpg\" alt=\"Bobby is on the set of his new job during 9-1-1 Season 8 Episode 1.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-684x1024.jpg 684w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-201x300.jpg 201w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-768x1149.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-1369x2048.jpg 1369w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-642x960.jpg 642w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-722x1080.jpg 722w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530-802x1200.jpg 802w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0530.jpg 1600w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0530.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Christopher Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI like that in this episode, he steps right in when he gets to the scene to give orders. It’s just what he does.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eYeah, it’s his nature. It’s his team. It’s his team. This is how they work well together. It’s his natural place being their leader. I like that too. Tim did, again, a fantastic job with the first three episodes. It’s one of our best. \u003c/p\u003e\n\n\n\n\u003cp\u003eI’ve started to look at them like movies now, our first three episodes. And that’s something that’s evolved over time, and I think that’s part of the reason why the show is a hit again. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eSuddenly, we’re as popular as we were when we first came out. It’s very interesting.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut to relaunch on ABC, and then I think getting better at evolving as a show, and Tim coming back has certainly done a big boom, and we just did the ten episodes last year. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut again, weaving together all these different elements — Bobby working at Hotshots, Athena traveling with the witness and the aircraft, the \u003ca href=\"https://www.tvfanatic.com/9-1-1-has-us-buzzing-how-can-bees-become-a-three-episode-sting-operation/\"\u003ebee-nado\u003c/a\u003e, and the small plane getting smothered in bees — it’s just done really nicely. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-scaled.jpg\" alt=\"Bobby is focused as he heads to Athena during 9-1-1 Season 8 Episode 3.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-1024x768.jpg 1024w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-300x225.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-768x576.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-2048x1536.jpg 2048w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-728x546.jpg 728w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-960x720.jpg 960w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-1080x810.jpg 1080w, https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-1200x900.jpg 1200w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/10/174348_0460-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Kevin Estrada )\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eI think this is one of our most tightly put-together first three episodes. It’s really good.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI agree.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI hope you enjoyed it.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI’ve been ranting and raving about it. I really, really enjoyed it.\u003c/strong\u003e \u003cstrong\u003eOnce we get past these three episodes, obviously without spoilers, what can you tease us about what to expect?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI don’t know. I don’t know if I can tease anything. I would tell you everything if I didn’t have to have phone calls about it later.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI totally get it. Last one for me because it was touched on a little bit in the opening hour about Bobby and Athena house hunting. What do you think is the top thing Bobby is looking for when he and Athena go house hunting?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOh, honestly, I think Bobby wants a home that Athena will be happy in. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"675\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0560.jpg\" alt=\"Bobby takes a lunch break at work during 9-1-1 Season 8 Episode 1.\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0560-675x1024.jpg 675w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0560-198x300.jpg 198w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0560-768x1165.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0560-633x960.jpg 633w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0560-712x1080.jpg 712w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0560-791x1200.jpg 791w, https://cdn.tvfanatic.com/uploads/2024/09/173825_0560.jpg 1319w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/09/173825_0560.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Christopher Willard)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eI’m not sure exactly what Tim has planned in that arena. We haven’t really discussed it, but that’s also a storyline that hasn’t had as much momentum. So, as we head deeper into the season, what will happen there?\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGotcha.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOr if they’ll make some other decision. I don’t know.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAll right. Well, we’ll have to stay tuned, right?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIf they’re going to go live on a \u003ca href=\"https://www.tvfanatic.com/did-9-1-1-s-three-episode-ship-disaster-sink-or-swim/\"\u003ecruise ship\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eOh, no, no, no.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eGosh, what were those characters’ names? I want to say Romy and Michelle because one of the actors’ names is Romy. Lola!\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"683\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3.jpg\" alt=\"Bobby Makes His Way - 9-1-1 Season 7 Episode 3\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3-683x1024.jpg 683w, https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3-768x1152.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3-640x960.jpg 640w, https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3-720x1080.jpg 720w, https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3.jpg 800w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/03/bobby-makes-his-way-9-1-1-season-7-episode-3.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Disney/Mike Taing)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eLola, yes.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eLola and whatever his name was. I remember Dan, the actor. But yeah, they’re going to go live on cruise ships like them.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWow. I don’t know. You didn’t have such great luck next time.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI don’t see that happening.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eNo, me neither. Well, thank you so much for your time, Peter. I appreciate it.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eSure, yeah. But the Halloween episode is a lot of fun. I can’t tell you anything about it, but the Halloween episode is going to be really good.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eThis interview has been edited for length and clarity.\u003c/em\u003e\u003c/strong\u003e \u003cstrong\u003e\u003cem\u003eYou can watch 9-1-1 on Thursdays at 8/7c on \u003ca href=\"https://www.tvfanatic.com/networks/abc/\"\u003eABC\u003c/a\u003e.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cp\u003eWatch 9-1-1 Online\u003c/p\u003e\n\t\t\t\u003cspan\u003e\n\t\t\t\u003ca target=\"_blank\" data-original=\"https://www.justwatch.com\" href=\"https://www.justwatch.com/us\" rel=\"noopener\"\u003e\n\t\t\t\u003cimg decoding=\"async\" alt=\"JustWatch\" height=\"10px\" width=\"66px\" src=\"https://www.tvfanatic.com/wp-content/themes/tvf-trellis/images/just-watch.png\" id=\"mv-trellis-img-1\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\n\t\t\t\u003c/a\u003e\u003c/span\u003e\n            \u003c/span\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-11T01:30:00Z",
  "modifiedTime": "2024-10-10T18:00:13Z"
}
