{
  "id": "2d386b42-6210-48d7-9bd4-ad39ed25a0e5",
  "title": "Four rules for how design influences technology",
  "link": "https://uxdesign.cc/four-rules-for-how-design-influences-technology-44b2c1948135?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Andy Proehl",
  "published": "Wed, 02 Apr 2025 11:26:24 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "technology",
    "design",
    "product-design",
    "trends",
    "ux"
  ],
  "byline": "Andy Proehl",
  "length": 15617,
  "excerpt": "I’ve been a designer for more than 3 decades. I believe in the power of design. There are a lot of posts on Medium these days about the challenges in UX design. The reasons vary: layoffs in tech…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "Four rules for how design influences technologyEarly products tend to have a technical focus. But technologies mature and can become commodified. This is where design becomes the key differentiator.I’ve been a designer for more than 3 decades. I believe in the power of design. There are a lot of posts on Medium these days about the challenges in UX design. The reasons vary: layoffs in tech, failure to clearly demonstrate the ROI of design, the challenges of agile, and the emerging creative threat of AI. I share these concerns but history suggests that this could just be a cycle we’re going through. The influence of design has risen and fallen multiple times in the last century as products and industries evolve. It tends to follow a consistent pattern.The 4 RulesThe importance and influence of design ebbs and flows. James Harrison discusses this in his Crisis of Meaning post. Nowhere is this more apparent than when technology is involved. Not every designed object involves technology, but most do when viewed through the right lens. As products evolve and grow, design and technology influence each other. Here are 4 rules for how design \u0026 technology influence each other. They were partially inspired by Marshall McLuhan’s ‘Laws of Media’.Rule 1 — Technology dominates in early product life cyclesEarly on in a product’s history, technology tends to dominate. There are usually many technical problems to solve. How will something be built? Does it meet the technical challenges of daily usage? Will it be of an appropriate size and cost to address the problem it’s trying to solve?New technologies also tend to start as expensive private offerings. Early users are typically more willing to put up with technical challenges. As access costs come down, services migrate toward public availability. The designer Edwin Schlossberg, an early experience design pioneer, advocated for looking to private offerings as inspiration for what should become public. Stock trading started on proprietary systems, evolved to Bloomberg terminals and finally to the era of Schwab, eTrade and consumer trading platforms. Each transition typically requires a new design experience to suit the needs of the broadening consumer base.Rule #2 — Then design \u0026 technology interact to create more human-centered solutionsEarly solutions may be functional but not usable. They may be too raw or, sometimes, a solution looking for a problem. Design can help bridge the gap between raw technology and daily use. Designers help the technology evolve into something that is more familiar, usable and desirable.Rule #3 — Design becomes the differentiator in well established technologiesAs a given technology matures, components become standardized resulting in cost efficiencies and commodification. As this happens, competing offerings evolved towards sharing underlying technology and parts. This is when design becomes the key differentiator in the market. The single best example of this is MP3 players prior to the iPod. There were multiple MP3 players in the market well before Apple introduced the iPod. Apple didn’t invent the MP3 player. They saw the opportunity and designed a significantly better experience, one that included hardware, software, and content.Rule #4 — As new technologies emerge, the cycle restartsAs technical innovation continues, bigger gains tend to reinvent the category and start a new cycle. This has happened multiple times in the auto industry but is best exemplified by the move from internal combustion engines to electric vehicles to the service models of Uber and Waymo.Examples of the rules in actionTransportationCars have been through all 4 stages starting with the technical focus on the first Model T, to the golden age of car design in the 1950s, to the paradigm shifts of Uber and Waymo“You can have it in any color you want as long as it’s black” — Henry FordWhen the Ford Model T was introduced in 1908, Henry Ford made that famous quip about the lack of color choice. It was the perfect example of a new technology early in its lifecycle. Henry Ford was too busy inventing the car and the assembly line to worry about custom options like paint colors.Early production focused on solving technical issues, the essence of the first rule. There were competing engine technologies. Early owners needed to be both mechanic and driver. Wheels needed to be redesigned to accommodate the increased forces of motorized travel. Safety concerns needed to be solved. That changed as the number of competitors and car models expanded.The post war 1950s featured a boom in the market for cars. Car manufacturers had been restricted in the making and selling of new cars in the 1940s as part of the WWII War effort. The end of the war and return of soldiers from overseas led to a boom in demand. This increased the importance of car design in meeting consumer demand. Car design took many forms from the tail fins of the Chevy Bel Air, the muscular stance of the Chevy Corvette to the simple lines of the Ford Thunderbird. But engines, cylinders, and cc’s were still a key focus and selling point. This is Rule 2 in action. It was a crowded market so style and performance were both differentiators.Since then, there has been a steady expansion of form factors beyond the original sedan: compacts, minivans, SUVs, crossovers, and a wide variety of pickup trucks. The fact that many models are built on the same chassis is a sign that the differences are primarily a matter of design. There was a related trend in car interiors that was design focused. “Bucket seats” used to be a selling point. Now there are cup holders, heated seats, charging ports, seatback displays, and “sun” and “moon” roofs.. When the number of cup holders gets counted more than the number of cylinders, you know this is no longer a technology focused product. This is Rule 3.The growth of electric cars represents a new product generation. The ongoing focus on battery range and lifespan suggests that we are still in the technology phase. Similarly, the growth of Uber and its competitors should be seen as an example of Rule 4 where new technologies tend to restart the cycle. There were many challenges (technical, regulatory, safety) in getting Uber’s initial service launched. Uber is also the result of deep design. The app UX is critical to key service elements like transparency, safety, and customer communication. It also redefined the transportation category. Do I even need a car if I have Uber? Finally, we have Waymo questioning the need for drivers in the car experience.FurnitureThe Wassily Chair by Marcel Breuer — image courtesy of KnollThe Wassily Chair was designed by Marcel Breuer for Wassily Kandinsky’s house when they were both teaching at the Bauhaus. I admire the idea of this chair as much as its design. Visually, it was supposed to evoke the intersecting planes of cubism. From a form and function perspective, Breuer’s concept was,Anywhere a person and the chair touch, the material should be warm and flexible against the body.The rest of the chair should be a material that is more efficient for structure, like metal.Before the Bauhaus, chairs were typically made 1 at a time by craftsmen and caprenters. The Bauhaus introduced the idea that chairs could be mass produced using industrial practices. This opened the door to design innovation.It was a brilliant design concept particularly given that it was designed in the early 1900s. Furniture back then looked like what we see in historic mansions and museums. The Bauhaus wanted its students to embrace the industrial age and modern materials. Breur’s design for the Wassily chair fit this bill perfectly. But the design created a challenge. None of the furniture factories at the time were making chairs out of metal. Breur eventually turned to a bicycle maker who knew how to bend and weld steel tubing.The design of the Wassily chair is the perfect example of Rule 2. The chair embraces new materials and manufacturing techniques but it is also designed with a close attention to how that technology meets the user. It is modern but it is also comfortable and ergonomic. Breur made the technology more humane.Consumer ElectronicsThe original 1979 Sony Walkman — Source: Walkman ArchiveIt’s hard to imagine a time when audio was not available on the go. But there was a time when this was not a thing. There were transistor radios in the 70s but you were at the mercy of the local radio station. Then, in 1979, Akio Morita, the cofounder of Sony proposed a new product category. Sony was already shipping handheld tape recorders for journalists which included a playback option. Morita proposed that Sony sell a tape recorder that could only play recordings as a handheld music device. The Walkman was born.Paul Kunkel’s “Sunrise to Sunset” diagram — Source: ‘Digital Dreams’ — The work of the Sony Design CenterAt first, there was only one Walkman model. The focus at Sony was on engineering (Rule 1). Making the tape mechanisms better, smaller and cheaper. Battery life needed to be good. The product became a hit. As the category took off, there were higher-end innovations and a push to make the low end more affordable. This is Rule 2 in action. But eventually, all critical technical issues were solved. That is when models and form factors started to take off. There were minimalist designs, sports models, even kids models. There is a great diagram of how this unfolded over time in Paul Kunkel’s, “Digital Dreams’ book. He called it the Sunrise to Sunset diagram. Paul’s diagram helped inspire this post. In it, you can see the early engineering focus and Rule 1 on the left, the sunrise phase. Rule 2 is at high noon. Technical issues are still being addressed but you see design variations starting to emerge. On the right, you see the design phase where models and form factors proliferate (Rule 3). Finally, on the lower right, you see the sunset when one category gives way to the next generation of products (Rule 4). Sony enjoyed a strong lead in the portable audio category for more than 20 years. There were CD, MiniDisc, and hard drive versions. But then the category was largely taken over by Apple with their introduction of the iPod.Cell PhonesThe evolution of cell phone hardware design starting with the Motorola DynaTac and ending with the first Apple iPhone.The earliest cell phones looked like something the US Army would have used in WWII. They were large and bulky but showed the promise of what was to come. This was the era of technology focus addressing cell range, power, cost, and size. The critical first step. Then came the boom of form factors from many companies. There were candy bars and flip phones, the beautifully thin Motorola Razr, Blackberries, and Sidekicks. This was Rule 2. Many of the devices were a healthy balance of engineering and design from the elegant thinness of the Razr to the integration with corporate email of the Blackberry. The market was also supported by a broad range of companies across the globe, Nokia, Sony-Erikkson, Motorola, Palm, and Samsung. In this era, cell phones became as much about personal fashion statements as communication devices. This evolved into Rule 3 from a form factor perspective. Design dominated. The technology was largely solved and the same across companies. Product design became the primary way to differentiate your offering.Then came Apple.iPhone as hardware deviceNot too long after the iPhone launched, I was riding on Caltrain from San Francisco to Silicon Valley. I remember looking around and noticing that almost everyone on the train had an iPhone. It was almost like overnight, we went from many form factors to one. It felt that sudden. The massive success of the iPod and iTunes helped propel Apple into the consumer space. Before the iPhone, hardware companies and service providers all struggled to define their own apps and look and feel. This led to a balkanization of apps and UX patterns. Apple broke through the logjam and defined a better way forward.iPhone as an apps ecosystemThe launch of the iPhone represented the end of a rich marketplace of hardware design and the beginning of a new cycle (Rule 4). There was now only 1 hardware paradigm. But of course it also led to the flourishing of app design (Rule 3). This trend continues in the consumer space and extends into the B2B space.Apps \u0026 SaaSThe ongoing evolution of software experiences from the DOS “C/ prompt” to the latest SaaS apps and ChatGPT.The stand out design of the iPhone experience also led to the ‘Bring Your Own Device’ (BYOD) trend for corporate users. Everyone wanted to use an iPhone at work even if the company still wanted to use their Blackberries. iPhone apps taught corporate users that apps did not need to suck. This created the push for better designed SaaS applications. I started my UX career on the consumer side but switched to a focus on SaaS applications. The design problems were more interesting and there were so many companies in need of design overhauls. It was a target rich environment. The state of SaaS companies and design makes me think of this quote,“The future is already here — it’s just not evenly distributed.” – William GibsonSaaS applications cut across almost every industry. The cost of building a quality SaaS software and experience can be quite high. So even though the field has been around at least 20 years, there are still likely companies exhibiting each of the 4 rules…Rule 1 — Companies that are still mostly focused on technology issues. Electronic Health Records (EHR) strikes me as an example of this but there are probably better examples in the IT, security and cloud storage spaces.Rule 2 — Companies that are straddling the technology and design space. Workday might be an example of this. They are still trying to enable a broad range of HR and payroll technologies while also making small improvements to the user experience.Rule 3 — Asana, Slack, Monday, Product Board seem like examples of Rule 3. They are all highly aware of the importance of design and often have a keen focus on user experience.Rule 4 — Any company that is actively shipping and integrating AI into their workflows is probably in the early days of Rule 4. A new technology has emerged creating both an innovation but also a renewed focus on technology. Design is playing a role but not central to the innovation (yet). Microsoft and Google would be good examples of Rule 4 but there are too many companies here to list. Salesforce practically invented the SaaS category with their “no software” campaign in 2000. So they have likely been through all 4 stages since then.QuestionsThis post was meant to share a little bit of design history as it relates to the current situation in UX. History suggests we might be nearing the end of a design cycle but there will be others in the future. Agent-based AI experiences are mentioned as an area in need of design. There are only a small number of examples for the design of self-driving taxis. Food and dining seems ripe for more innovation. Climate solutions and healthcare will need more design help. But I still have many questions.Where is design headed in today’s SaaS applications?Where will the next rise of design prominence occur and when?What’s your opinion?Sources and Related PostsDigital Dreams — The work of the Sony Design Center — Paul KunkelThe Rise of SaaS: How Salesforce and Marc Benioff Revolutionized Marketing Strategy — Moe MizonoA bright future for strategic thinkers — This article by Eric Orozco has a good list of posts at the end.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*baRYBYwAW2sjawAg1RXD7g.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2 id=\"ceb7\" data-testid=\"storyTitle\"\u003eFour rules for how design influences technology\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2 id=\"0461\"\u003e\u003cem\u003eEarly products tend to have a technical focus. But technologies mature and can become commodified. This is where design becomes the key differentiator.\u003c/em\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/@amproehl?source=post_page---byline--44b2c1948135---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Andy Proehl\" src=\"https://miro.medium.com/v2/resize:fill:88:88/0*u9QkcdzXULjfGEv8.jpeg\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://uxdesign.cc/?source=post_page---byline--44b2c1948135---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"UX Collective\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*mDhF9X4VO0rCrJvWFatyxg.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp id=\"383f\"\u003eI’ve been a designer for more than 3 decades. I believe in the power of design. There are a lot of posts on Medium these days about the\u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/a-crisis-of-meaning-in-ux-design-0831b85a3fb5\"\u003e challenges in UX design\u003c/a\u003e. The reasons vary: \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/designer-layoff-stories-a8c6365a5f82\"\u003elayoffs in tech\u003c/a\u003e,\u003ca href=\"https://www.fastcompany.com/91299152/future-of-design-leaders-executives\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e failure to clearly demonstrate the ROI of design\u003c/a\u003e, \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/agile-ux-a-failed-marriage-bd0db1182e5a\"\u003ethe challenges of agile\u003c/a\u003e, and \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/is-this-the-death-or-dawn-of-human-creativity-29acaa0f7ad1\"\u003ethe emerging creative threat of AI\u003c/a\u003e. I share these concerns but history suggests that this could just be a cycle we’re going through. The influence of design has risen and fallen multiple times in the last century as products and industries evolve. It tends to follow a consistent pattern.\u003c/p\u003e\u003ch2 id=\"fd0b\"\u003eThe 4 Rules\u003c/h2\u003e\u003cp id=\"f21d\"\u003eThe importance and influence of design ebbs and flows. James Harrison discusses this in his \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/a-crisis-of-meaning-in-ux-design-0831b85a3fb5\"\u003eCrisis of Meaning\u003c/a\u003e post. Nowhere is this more apparent than when technology is involved. Not every designed object involves technology, but most do when viewed through the right lens. As products evolve and grow, design and technology influence each other. Here are 4 rules for how design \u0026amp; technology influence each other. They were partially inspired by \u003ca href=\"https://www.amazon.com/Laws-Media-Science-Marshall-McLuhan/dp/0802077153\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eMarshall McLuhan’s ‘Laws of Media’\u003c/a\u003e.\u003c/p\u003e\u003ch2 id=\"2b40\"\u003e\u003cstrong\u003eRule 1 — Technology dominates in early product life cycles\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"4851\"\u003eEarly on in a product’s history, technology tends to dominate. There are usually many technical problems to solve. How will something be built? Does it meet the technical challenges of daily usage? Will it be of an appropriate size and cost to address the problem it’s trying to solve?\u003c/p\u003e\u003cp id=\"63d5\"\u003eNew technologies also tend to start as expensive private offerings. Early users are typically more willing to put up with technical challenges. As access costs come down, services migrate toward public availability. The designer Edwin Schlossberg, an early experience design pioneer, advocated for looking to private offerings as inspiration for what should become public. Stock trading started on proprietary systems, evolved to Bloomberg terminals and finally to the era of Schwab, eTrade and consumer trading platforms. Each transition typically requires a new design experience to suit the needs of the broadening consumer base.\u003c/p\u003e\u003ch2 id=\"464b\"\u003e\u003cstrong\u003eRule #2 — Then design \u0026amp; technology interact to create more human-centered solutions\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"a2fe\"\u003eEarly solutions may be functional but not usable. They may be too raw or, sometimes, a solution looking for a problem. Design can help bridge the gap between raw technology and daily use. Designers help the technology evolve into something that is more familiar, usable and desirable.\u003c/p\u003e\u003ch2 id=\"74dc\"\u003e\u003cstrong\u003eRule #3 — D\u003c/strong\u003eesign becomes the differentiator i\u003cstrong\u003en well established technologies\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"516b\"\u003eAs a given technology matures, components become standardized resulting in cost efficiencies and commodification. As this happens, competing offerings evolved towards sharing underlying technology and parts. This is when design becomes the key differentiator in the market. The single best example of this is MP3 players prior to the iPod. There were multiple MP3 players in the market well before Apple introduced the iPod. Apple didn’t invent the MP3 player. They saw the opportunity and designed a significantly better experience, one that included hardware, software, and content.\u003c/p\u003e\u003ch2 id=\"2ce9\"\u003e\u003cstrong\u003eRule #4 — As new technologies emerge, the cycle restarts\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"c019\"\u003eAs technical innovation continues, bigger gains tend to reinvent the category and start a new cycle. This has happened multiple times in the auto industry but is best exemplified by the move from internal combustion engines to electric vehicles to the service models of Uber and Waymo.\u003c/p\u003e\u003ch2 id=\"d3ef\"\u003eExamples of the rules in action\u003c/h2\u003e\u003ch2 id=\"20bc\"\u003eTransportation\u003c/h2\u003e\u003c/div\u003e\u003cp\u003e\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://miro.medium.com/v2/resize:fit:640/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 640w, https://miro.medium.com/v2/resize:fit:720/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 720w, https://miro.medium.com/v2/resize:fit:750/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 750w, https://miro.medium.com/v2/resize:fit:786/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 786w, https://miro.medium.com/v2/resize:fit:828/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 828w, https://miro.medium.com/v2/resize:fit:1100/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 1100w, https://miro.medium.com/v2/resize:fit:4800/format:webp/1*6WPZSxJi5slaa6QtWrC3WQ.png 4800w\" sizes=\"(min-resolution: 4dppx) and (max-width: 700px) 50vw, (-webkit-min-device-pixel-ratio: 4) and (max-width: 700px) 50vw, (min-resolution: 3dppx) and (max-width: 700px) 67vw, (-webkit-min-device-pixel-ratio: 3) and (max-width: 700px) 65vw, (min-resolution: 2.5dppx) and (max-width: 700px) 80vw, (-webkit-min-device-pixel-ratio: 2.5) and (max-width: 700px) 80vw, (min-resolution: 2dppx) and (max-width: 700px) 100vw, (-webkit-min-device-pixel-ratio: 2) and (max-width: 700px) 100vw, 100vw\" type=\"image/webp\"/\u003e\u003csource data-testid=\"og\" srcset=\"https://miro.medium.com/v2/resize:fit:640/1*6WPZSxJi5slaa6QtWrC3WQ.png 640w, https://miro.medium.com/v2/resize:fit:720/1*6WPZSxJi5slaa6QtWrC3WQ.png 720w, https://miro.medium.com/v2/resize:fit:750/1*6WPZSxJi5slaa6QtWrC3WQ.png 750w, https://miro.medium.com/v2/resize:fit:786/1*6WPZSxJi5slaa6QtWrC3WQ.png 786w, https://miro.medium.com/v2/resize:fit:828/1*6WPZSxJi5slaa6QtWrC3WQ.png 828w, https://miro.medium.com/v2/resize:fit:1100/1*6WPZSxJi5slaa6QtWrC3WQ.png 1100w, https://miro.medium.com/v2/resize:fit:4800/1*6WPZSxJi5slaa6QtWrC3WQ.png 4800w\" sizes=\"(min-resolution: 4dppx) and (max-width: 700px) 50vw, (-webkit-min-device-pixel-ratio: 4) and (max-width: 700px) 50vw, (min-resolution: 3dppx) and (max-width: 700px) 67vw, (-webkit-min-device-pixel-ratio: 3) and (max-width: 700px) 65vw, (min-resolution: 2.5dppx) and (max-width: 700px) 80vw, (-webkit-min-device-pixel-ratio: 2.5) and (max-width: 700px) 80vw, (min-resolution: 2dppx) and (max-width: 700px) 100vw, (-webkit-min-device-pixel-ratio: 2) and (max-width: 700px) 100vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eCars have been through all 4 stages starting with the technical focus on the first Model T, to the golden age of car design in the 1950s, to the paradigm shifts of Uber and Waymo\u003c/figcaption\u003e\u003c/figure\u003e\u003c/p\u003e\u003cdiv\u003e\u003cblockquote\u003e\u003cp id=\"37bc\"\u003e“You can have it in any color you want as long as it’s black” — Henry Ford\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"a027\"\u003eWhen the Ford Model T was introduced in 1908, Henry Ford made that famous quip about the lack of color choice. It was the perfect example of a new technology early in its lifecycle. Henry Ford was too busy inventing the car and the assembly line to worry about custom options like paint colors.\u003c/p\u003e\u003cp id=\"a84c\"\u003eEarly production focused on solving technical issues, the essence of the first rule. There were competing engine technologies. Early owners needed to be both mechanic and driver. Wheels needed to be redesigned to accommodate the increased forces of motorized travel. Safety concerns needed to be solved. That changed as the number of competitors and car models expanded.\u003c/p\u003e\u003cp id=\"cd98\"\u003eThe post war 1950s featured a boom in the market for cars. Car manufacturers had been restricted in the making and selling of new cars in the 1940s as part of the WWII War effort. The end of the war and return of soldiers from overseas led to a boom in demand. This increased the importance of car design in meeting consumer demand. Car design took many forms from the tail fins of the Chevy Bel Air, the muscular stance of the Chevy Corvette to the simple lines of the Ford Thunderbird. But engines, cylinders, and cc’s were still a key focus and selling point. This is Rule 2 in action. It was a crowded market so style and performance were both differentiators.\u003c/p\u003e\u003cp id=\"410e\"\u003eSince then, there has been a steady expansion of form factors beyond the original sedan: compacts, minivans, SUVs, crossovers, and a wide variety of pickup trucks. The fact that many models are built on the same chassis is a sign that the differences are primarily a matter of design. There was a related trend in car interiors that was design focused. “Bucket seats” used to be a selling point. Now there are cup holders, heated seats, charging ports, seatback displays, and “sun” and “moon” roofs.. When the number of cup holders gets counted more than the number of cylinders, you know this is no longer a technology focused product. This is Rule 3.\u003c/p\u003e\u003cp id=\"74ad\"\u003eThe growth of electric cars represents a new product generation. The ongoing focus on battery range and lifespan suggests that we are still in the technology phase. Similarly, the growth of Uber and its competitors should be seen as an example of Rule 4 where new technologies tend to restart the cycle. There were many challenges (technical, regulatory, safety) in getting Uber’s initial service launched. Uber is also the result of deep design. The app UX is critical to key service elements like transparency, safety, and customer communication. It also redefined the transportation category. Do I even need a car if I have Uber? Finally, we have Waymo questioning the need for drivers in the car experience.\u003c/p\u003e\u003ch2 id=\"6d3d\"\u003eFurniture\u003c/h2\u003e\u003cfigure\u003e\u003cfigcaption\u003eThe Wassily Chair by Marcel Breuer — image courtesy of \u003ca href=\"https://www.knoll.com/shop/en_us/living-lounge-chairs/wassily-chair/100562144.html?sku=100562144\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eKnoll\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"161d\"\u003eThe Wassily Chair was designed by Marcel Breuer for Wassily Kandinsky’s house when they were both teaching at the Bauhaus. I admire the idea of this chair as much as its design. Visually, it was supposed to evoke the intersecting planes of cubism. From a form and function perspective, Breuer’s concept was,\u003c/p\u003e\u003cul\u003e\u003cli id=\"3b73\"\u003eAnywhere a person and the chair touch, the material should be warm and flexible against the body.\u003c/li\u003e\u003cli id=\"16ed\"\u003eThe rest of the chair should be a material that is more efficient for structure, like metal.\u003c/li\u003e\u003c/ul\u003e\u003cfigure\u003e\u003cfigcaption\u003eBefore the Bauhaus, chairs were typically made 1 at a time by craftsmen and caprenters. The Bauhaus introduced the idea that chairs could be mass produced using industrial practices. This opened the door to design innovation.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"f3c5\"\u003eIt was a brilliant design concept particularly given that it was designed in the early 1900s. Furniture back then looked like what we see in historic mansions and museums. The Bauhaus wanted its students to embrace the industrial age and modern materials. Breur’s design for the Wassily chair fit this bill perfectly. But the design created a challenge. None of the furniture factories at the time were making chairs out of metal. Breur eventually turned to a bicycle maker who knew how to bend and weld steel tubing.\u003c/p\u003e\u003cp id=\"1b67\"\u003eThe design of the Wassily chair is the perfect example of Rule 2. The chair embraces new materials and manufacturing techniques but it is also designed with a close attention to how that technology meets the user. It is modern but it is also comfortable and ergonomic. Breur made the technology more humane.\u003c/p\u003e\u003ch2 id=\"e708\"\u003eConsumer Electronics\u003c/h2\u003e\u003cfigure\u003e\u003cfigcaption\u003eThe original 1979 Sony Walkman — Source: \u003ca href=\"https://www.walkman-archive.com/gadgets/walkman_sony_01_tps-l2_eng_v3.htm\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eWalkman Archive\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"f4ed\"\u003eIt’s hard to imagine a time when audio was not available on the go. But there was a time when this was not a thing. There were transistor radios in the 70s but you were at the mercy of the local radio station. Then, in 1979, Akio Morita, the cofounder of Sony proposed a new product category. Sony was already shipping handheld tape recorders for journalists which included a playback option. Morita proposed that Sony sell a tape recorder that could only play recordings as a handheld music device. The Walkman was born.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003ePaul Kunkel’s “Sunrise to Sunset” diagram — Source: \u003ca href=\"https://www.amazon.com/Digital-Dreams-Work-Design-Center/dp/0789302624/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e‘Digital Dreams’ — The work of the Sony Design Center\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"15e9\"\u003eAt first, there was only one Walkman model. The focus at Sony was on engineering (Rule 1). Making the tape mechanisms better, smaller and cheaper. Battery life needed to be good. The product became a hit. As the category took off, there were higher-end innovations and a push to make the low end more affordable. This is Rule 2 in action. But eventually, all critical technical issues were solved. That is when models and form factors started to take off. There were minimalist designs, sports models, even kids models. There is a great diagram of how this unfolded over time in Paul Kunkel’s, “Digital Dreams’ book. He called it the Sunrise to Sunset diagram. Paul’s diagram helped inspire this post. In it, you can see the early engineering focus and Rule 1 on the left, the sunrise phase. Rule 2 is at high noon. Technical issues are still being addressed but you see design variations starting to emerge. On the right, you see the design phase where models and form factors proliferate (Rule 3). Finally, on the lower right, you see the sunset when one category gives way to the next generation of products (Rule 4). Sony enjoyed a strong lead in the portable audio category for more than 20 years. There were CD, MiniDisc, and hard drive versions. But then the category was largely taken over by Apple with their introduction of the iPod.\u003c/p\u003e\u003ch2 id=\"c8da\"\u003eCell Phones\u003c/h2\u003e\u003cfigure\u003e\u003cfigcaption\u003eThe evolution of cell phone hardware design starting with the Motorola DynaTac and ending with the first Apple iPhone.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"0ee7\"\u003eThe earliest cell phones looked like something the US Army would have used in WWII. They were large and bulky but showed the promise of what was to come. This was the era of technology focus addressing cell range, power, cost, and size. The critical first step. Then came the boom of form factors from many companies. There were candy bars and flip phones, the beautifully thin Motorola Razr, Blackberries, and Sidekicks. This was Rule 2. Many of the devices were a healthy balance of engineering and design from the elegant thinness of the Razr to the integration with corporate email of the Blackberry. The market was also supported by a broad range of companies across the globe, Nokia, Sony-Erikkson, Motorola, Palm, and Samsung. In this era, cell phones became as much about personal fashion statements as communication devices. This evolved into Rule 3 from a form factor perspective. Design dominated. The technology was largely solved and the same across companies. Product design became the primary way to differentiate your offering.\u003c/p\u003e\u003cp id=\"5b23\"\u003eThen came Apple.\u003c/p\u003e\u003cp id=\"9e2d\"\u003e\u003cstrong\u003eiPhone as hardware device\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"1d3b\"\u003eNot too long after the iPhone launched, I was riding on Caltrain from San Francisco to Silicon Valley. I remember looking around and noticing that almost everyone on the train had an iPhone. It was almost like overnight, we went from many form factors to one. It felt that sudden. The massive success of the iPod and iTunes helped propel Apple into the consumer space. Before the iPhone, hardware companies and service providers all struggled to define their own apps and look and feel. This led to a balkanization of apps and UX patterns. Apple broke through the logjam and defined a better way forward.\u003c/p\u003e\u003cp id=\"d4d5\"\u003e\u003cstrong\u003eiPhone as an apps ecosystem\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"4236\"\u003eThe launch of the iPhone represented the end of a rich marketplace of hardware design and the beginning of a new cycle (Rule 4). There was now only 1 hardware paradigm. But of course it also led to the flourishing of app design (Rule 3). This trend continues in the consumer space and extends into the B2B space.\u003c/p\u003e\u003ch2 id=\"9aba\"\u003eApps \u0026amp; SaaS\u003c/h2\u003e\u003cfigure\u003e\u003cfigcaption\u003eThe ongoing evolution of software experiences from the DOS “C/ prompt” to the latest SaaS apps and ChatGPT.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"ab18\"\u003eThe stand out design of the iPhone experience also led to the ‘Bring Your Own Device’ (BYOD) trend for corporate users. Everyone wanted to use an iPhone at work even if the company still wanted to use their Blackberries. iPhone apps taught corporate users that apps did not need to suck. This created the push for better designed SaaS applications. I started my UX career on the consumer side but switched to a focus on SaaS applications. The design problems were more interesting and there were so many companies in need of design overhauls. It was a target rich environment. The state of SaaS companies and design makes me think of this quote,\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"1c3f\"\u003e“The future is already here — it’s just not evenly distributed.” – William Gibson\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"9307\"\u003eSaaS applications cut across almost every industry. The cost of building a quality SaaS software and experience can be quite high. So even though the field has been around at least 20 years, there are still likely companies exhibiting each of the 4 rules…\u003c/p\u003e\u003cul\u003e\u003cli id=\"8c65\"\u003e\u003cstrong\u003eRule 1\u003c/strong\u003e — Companies that are still mostly focused on technology issues. Electronic Health Records (EHR) strikes me as an example of this but there are probably better examples in the IT, security and cloud storage spaces.\u003c/li\u003e\u003cli id=\"6380\"\u003e\u003cstrong\u003eRule 2\u003c/strong\u003e — Companies that are straddling the technology and design space. Workday might be an example of this. They are still trying to enable a broad range of HR and payroll technologies while also making small improvements to the user experience.\u003c/li\u003e\u003cli id=\"3383\"\u003e\u003cstrong\u003eRule 3\u003c/strong\u003e — Asana, Slack, Monday, Product Board seem like examples of Rule 3. They are all highly aware of the importance of design and often have a keen focus on user experience.\u003c/li\u003e\u003cli id=\"a783\"\u003e\u003cstrong\u003eRule 4\u003c/strong\u003e — Any company that is actively shipping and integrating AI into their workflows is probably in the early days of Rule 4. A new technology has emerged creating both an innovation but also a renewed focus on technology. Design is playing a role but not central to the innovation (yet). Microsoft and Google would be good examples of Rule 4 but there are too many companies here to list. Salesforce practically invented the SaaS category with their “no software” campaign in 2000. So they have likely been through all 4 stages since then.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"9911\"\u003eQuestions\u003c/h2\u003e\u003cp id=\"3cf0\"\u003eThis post was meant to share a little bit of design history as it relates to the current situation in UX. History suggests we might be nearing the end of a design cycle but there will be others in the future. Agent-based AI experiences are mentioned as an area in need of design. There are only a small number of examples for the design of self-driving taxis. Food and dining seems ripe for more innovation. Climate solutions and healthcare will need more design help. But I still have many questions.\u003c/p\u003e\u003cul\u003e\u003cli id=\"8eca\"\u003eWhere is design headed in today’s SaaS applications?\u003c/li\u003e\u003cli id=\"8dce\"\u003eWhere will the next rise of design prominence occur and when?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"2c07\"\u003eWhat’s your opinion?\u003c/p\u003e\u003ch2 id=\"f001\"\u003e\u003cstrong\u003eSources and Related Posts\u003c/strong\u003e\u003c/h2\u003e\u003cul\u003e\u003cli id=\"0e5c\"\u003e\u003ca href=\"https://www.amazon.com/Digital-Dreams-Work-Design-Center/dp/0789302624/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eDigital Dreams — The work of the Sony Design Center\u003c/a\u003e — Paul Kunkel\u003c/li\u003e\u003cli id=\"9a28\"\u003e\u003ca href=\"https://route06.com/insights/10\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eThe Rise of SaaS: How Salesforce and Marc Benioff Revolutionized Marketing Strategy\u003c/a\u003e — Moe Mizono\u003c/li\u003e\u003cli id=\"86e7\"\u003e\u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/a-bright-future-for-strategic-thinkers-4e9c7aafe65f\"\u003eA bright future for strategic thinkers\u003c/a\u003e — This article by \u003ca href=\"https://edorozco.medium.com/\" rel=\"noopener\"\u003eEric Orozco\u003c/a\u003e has a good list of posts at the end.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-03-31T18:09:30.026Z",
  "modifiedTime": null
}
