{
  "id": "4f3eb10a-4a9a-484b-9617-8e775216dee9",
  "title": "Fostering An Accessibility Culture",
  "link": "https://smashingmagazine.com/2025/04/fostering-accessibility-culture/",
  "description": "While there’s no definitive playbook for building an accessibility culture, Dani shares lessons from his experience in shaping it through habits rather than mandates.",
  "author": "Daniel Devesa Derksen-Staats",
  "published": "Thu, 17 Apr 2025 08:00:00 GMT",
  "source": "https://www.smashingmagazine.com/feed",
  "categories": null,
  "byline": "About The Author",
  "length": 19686,
  "excerpt": "While there’s no definitive playbook for building an accessibility culture, Dani shares lessons from his experience in shaping it through habits rather than mandates.",
  "siteName": "Smashing Magazine",
  "favicon": "https://smashingmagazine.com/images/favicon/apple-touch-icon.png",
  "text": "15 min readAccessibility, Web Design, UXBuilding an accessibility culture isn’t easy, and there’s no clear playbook. But Dani offers insights from his own journey, where small, consistent habits made a big difference.A year ago, I learned that my role as an accessibility engineer was at risk of redundancy. It was a tough moment, both professionally and personally. For quite some time, my mind raced with guilt, self-doubt, plain sadness… But as I sat with these emotions, I found one line of thought that felt productive: reflection. What did I do well? What could I have done better? What did I learn?Looking back, I realized that as part of a small team in a massive organization, we focused on a long-term goal that we also believed was the most effective and sustainable path: gradually shaping the organization’s culture to embrace accessibility.Around the same time, I started listening to “Atomic Habits” by James Clear. The connection was immediate. Habits and culture are tightly linked concepts, and fostering an accessibility culture was really about embedding accessibility habits into everyone’s processes. That’s what we focused on. It took us time (and plenty of trial and error) to figure this out, and while there’s no definitive playbook for creating an accessibility program at a large organization, I thought it might help others if I shared my experiences.Before we dive in, here’s a quick note: This is purely my personal perspective, and you’ll find a bias towards culture and action in big organizations. I’m not speaking on behalf of any employer, past or present. The progress we made was thanks to the incredible efforts of every member of the team and beyond. I hope these reflections resonate with those looking to foster an accessibility culture at their own companies.Goals Vs. SystemsTo effectively shape habits, it’s crucial to focus on systems and processes (who we want to become) rather than obsessing over a final goal (or what we want to achieve). This perspective is especially relevant in accessibility.Take the goal of making your app accessible. If you focus solely on achieving compliance without changing your systems (embedding accessibility into processes and culture), progress will be temporary.For example, you might request an accessibility audit and fix the flagged issues to achieve compliance. While this can provide “quick” results, it’s often a short-lived solution.Software evolves constantly: features are rewritten, old code is removed, and new functionality is added. Without an underlying system in place, accessibility issues can quickly resurface. Worse, this approach may reinforce the idea that accessibility is something external, checked by someone else, and fixed only when flagged. Not to mention that it becomes increasingly expensive the later accessibility issues are addressed in the process. It can also feel demoralizing when accessibility becomes synonymous with a long list of last-minute tickets when you are busiest.Image source: BrowserStack. (Large preview)Despite this, companies constantly focus on the goal rather than the systems.“Accessibility is both a state and a practice.”— Sommer Panage, SwiftTO talk, “Building Accessibility into Your Company, Team, and Culture”I’ll take the liberty of tweaking that to an aspirational state. Without recognizing the importance of the practice, any progress made is at risk of regression.Instead, I encourage organizations to focus on building habits and embedding good accessibility practices into their workflows. A strong system not only ensures lasting progress but also fosters a culture where accessibility becomes second nature.What Is Your Actual Goal?That doesn’t mean goals are useless — they’re very effective in setting up direction.In my team, we often said (only half-jokingly) that our ultimate goal was to put ourselves out of a job. This mindset reflects an important principle: accessibility is a cross-organizational responsibility, not the task of a single person or team.That’s why, in my opinion, focusing solely on compliance rather than culture transformation (or prioritizing the “state” of accessibility over the “practice”) is a flawed strategy.The real goal should be to build a user-centric culture where accessibility is embedded in every workflow, decision, and process. By doing so, companies can create products where accessibility is not about checking boxes and closing tickets but delivering meaningful and inclusive experiences to all users.How Do We Get There?Different companies (of various sizes, structures, and cultures) will approach accessibility differently, depending on where they are in their journey. I still have to meet, though, an accessibility team that ever felt they had enough resources. This makes careful resource allocation a cornerstone of your strategy. And while there’s no one-size-fits-all solution, shifting left (addressing issues earlier in the development process) tends to be the most effective approach in most cases.Design SystemsIf your company has a design system, partnering with the team that owns it can be one of your biggest wins. Fixing a single component used across dozens of places improves the experience everywhere it’s used. This approach scales beautifully.Involvement in foundational decisions and discussions, like choosing color palettes, typography, and component interactions, and so on, can also be very valuable. Contributing to documentation and guidelines tailored to accessibility can help teams across the organization make informed decisions.For a deeper dive, I recommend Feli Bernutz’s excellent talk, “Designing APIs: How to Ensure Accessibility in Design Systems.”It is worth repeating, you’ll need as many allies as possible. The more limited your resources, the more important this becomes. Something as simple as a Slack channel that becomes a safe space where people can ask questions and share tips can go a long way. Other ideas include lunch-and-learns, regular meetups, office hours, or building a more formal champions network. And, very importantly, it is about finding ways of recognising and celebrating wins and everyone’s good work.If you’re exploring this, I highly recommend joining the Champions of Accessibility Network (CAN) group. It’s a great way to learn and connect with others who are passionate about accessibility.EducationEducation is key for scaling accessibility efforts. While not everyone needs to be an expert, we should strive for everyone to know the basics. Repeatedly raising basic issues like missing accessibility labels, small target sizes, poor color contrast, and so on, can’t be productive.Consider periodic training for different roles (PMs, designers, engineers…), embedding accessibility into onboarding sessions and documentation. You’ll need to find what works for you.At Spotify, I found onboarding sessions for designers highly effective, as most features start with design. A Deque case study found that 67% of automatically detectable accessibility issues originate with design, reinforcing the importance of this approach. If your company has an education or training programme, partner with them. At Spotify, they were our biggest allies. They’ll help you get it right.AutomationEverything that can be automated should eventually be automated. We know there’s already a lot on your plate, and automation should help lighten the load. This is especially true in larger organizations, where it can help scale efforts more efficiently. However, automated accessibility checks are not the silver bullet some might hope for.One key issue is viewing automation as the solution rather than a safety net. Some companies claim automated tools catch as much as 57% of all issues or even 80% of issues by volume (PDF), though it is widely accepted that the figure is about 30%. Native mobile apps present greater challenges, making it likely that the real number is significantly lower for iOS and Android. These tools, and the high expectations around them, can create a false sense of security or reduce efforts to merely appease an automated tool of choice.Automation doesn’t (and shouldn’t) replace intentionality. We should aim to deliver great accessible experiences from the start rather than wait for a tool to flag issues after the fact.Whether your focus is on compliance or customer satisfaction, manual testing remains an essential part of the process. Whenever possible, you should also be testing with real users.For me, the greatest value of automation is in catching basic regressions before release and serving as a gentle nudge to developers, reminding them to consider accessibility more thoughtfully. Ideally, they don’t just fix an issue and move on but take a moment to reflect:How did this issue arise in the first place?Did we consider accessibility during development?Did we skip manual testing with a screen reader?When it comes to shaping habits, the environment matters. A strong accessibility culture isn’t built on willpower alone. It thrives on systems that encourage good practices and make bad ones harder to fall into. Nudges like automated checks, documentation, and proactive education are invaluable for keeping accessibility at the top of the mind.RemediationI won’t lie; the moment I was first told my new job was to work on accessibility, I immediately jumped in, doing what I knew best, trying to fix as many issues as possible myself. While rewarding at first, this approach isn’t scalable in larger organizations. It can quickly lead to burnout. It also sets an expectation within the company that it’s your team’s responsibility to get it done, an expectation that becomes increasingly difficult to reset as time goes on.Not saying you shouldn’t be hands-on, though! But you need to be strategic. Try to focus on supporting teams with complex issues, pair programming with colleagues, code reviews, or implementing cross-app improvements, ideally in partnership with the design system teams. This way, your efforts can have a broader impact.AuditingAccessibility audits are another tool in your toolbox. Audits can be valuable but are often overused. They’re most effective after teams have done their best to make the product accessible, serving as a validation step rather than the starting point. After all, how useful is an audit if a significant portion of the flagged issues are basic problems that automated tools could have detected?Alternatively, audits might help when you need quick results but don’t have the time or resources to upskill your workforce in time for a timely and necessary remediation.While audits have their place and, as mentioned, can be valuable in certain situations, I wouldn’t rely on them to be the cornerstone of your strategy.And So Much More​​Try to find what works for your team, and, most importantly, adapt as circumstances change. Beyond the strategies mentioned, you might explore other initiatives:Collecting accessibility metrics,Conducting user research and testing,Improving procurement practices,Ensuring accessible content and communications,Supporting accessible hiring, workplace platforms, and tools.It doesn’t mean one area of action is more important than another. Actually, in my view, one of the biggest reasons cultural change around accessibility takes longer than other areas is the lack of diversity in the workforce. Contributing to lines of action to address this issue might not be as immediately obvious as others.The industry hasn’t done enough to hire people with disabilities, leaving them underrepresented in building products that truly work for them. Worse yet, they face more barriers in the hiring process. And even when they do get hired, they may find that the tools meant to enable us to do our work and be productive don’t work for them.The key is to identify and lay out your areas of action first, then prioritize strategically while staying flexible as circumstances evolve. A thoughtful, adaptive approach ensures that no matter the challenge, your efforts remain impactful, avoiding stretching your team too thin and losing focus.Valley Of DespairHere’s the truth that everyone working in accessibility inevitably and unfortunately faces sooner rather than later: accessibility done right, as we’ve seen so far, takes time. And that goes against the “move fast and break things” culture of quick results and short-termism that many companies still follow, even if they won’t openly admit it.The slow-cooking nature of the process can, therefore, work against us. Being patient and trusting that small changes will aggregate and compound over time is incredibly challenging and sometimes nerve-racking. On top of that, if there’s a misalignment with leadership about what the ultimate goal is, or if there’s pressure to deliver quick results, it’s easy to feel like throwing in the towel, or worse, to experience burnout.Unfortunately, burnout is an all-too-common issue in the accessibility community.If you’d like to learn more about it, I highly recommend Shell Little’s talk, “The Accessibility to Burnout Pipeline.”In those moments of doubt, it is useful to remember the quote embraced by the San Antonio Spurs NBA team, originally from social reformer Jacob Riis:“When nothing seems to help, I go and look at a stonecutter hammering away at his rock perhaps a hundred times without as much as a crack showing in it. Yet at the hundred and first blow it will split in two, and I know it was not that blow that did it — but all that had gone before.”— Jacob RiisThis serves as a powerful reminder that every small effort contributes to the eventual breakthrough, even when progress feels invisible.An Uncomfortable TruthTop-down approaches are easier, and yet, most accessibility initiatives start from the bottom. For a sustainable strategy, however, you’ll need both. If necessary, you’ll have to get buy-in from leadership or risk feeling like you’re constantly swimming upstream. Surprisingly, this is often harder than it seems. This topic could easily be an article on its own, but Vitaly Friedman offers some useful pointers in his piece “How To Make A Strong Case For Accessibility.”In my experience, leadership buy-in is crucial to fostering an accessibility culture. Leaders often want to see how accessibility impacts the bottom line and whether investing in it is profitable. The hardest part is getting started, so if you can make a convincing case this way, do it.I once watched a talk by Dave Dame titled “Stakeholders Agree That Accessibility Is Important, But That Does Not Mean They Will Invest In Accessibility.” He made an excellent point: You may need to speak the business language to get their attention. As Dave put it, “I have Cerebral Palsy, but my money doesn’t.”There is also data out there suggesting that accessibility can be a worthwhile investment.Image source: Hidden Disabilities Sunflower. (Large preview)Still, I would encourage everyone to strive to change that mindset.Doing accessibility for economic or legal reasons is valid, but it can lead to perverse incentives, where the bare minimum and compliance become the strategy, or where teams constantly need to prove their return on investment.It is better to do it for the “wrong” reasons than not to do it at all. But ultimately, those aren’t the reasons we should be doing it.The “13 Letters” podcast opened with an incredibly interesting two-part episode featuring Mike Shebanek. In it, Mike explains how Apple eventually renewed its commitment to accessibility because, in the state of Maine, schools were providing Macs and needed a screen reader for students who required one. It seems like a somewhat business-driven decision. But years later, Tim Cook famously stated, “When we work on making our devices accessible by the blind, I don’t consider the bloody ROI.” He also remarked, “Accessibility rights are human rights.”That’s the mindset I wish more CEOs and leaders had. It is a story of how a change of mindset from “we have to do it” to “it is a core part of what we do” leads to a lasting and successful accessibility culture. Going beyond the bare minimum, Apple has become a leader in accessibility. An innovative company that consistently makes products more accessible and pushes the entire industry forward.The Good NewsOnce good habits are established, they tend to stick around. When I was let go, some people (I’m sure trying to comfort me) said the accessibility of the app would quickly regress and that the company would soon realize their mistake. Unexpectedly for them, I responded that I actually hoped it wouldn’t regress anytime soon. That, to me, would be the sign that I had done my job well.And honestly, I felt confident it wouldn’t. Incredible people with deep knowledge and a passion for accessibility and building high-quality products stayed at the company. I knew the app was in good hands.But it’s important not to fall into complacency. Cultures can be taken for granted, but they need constant nurturing and protection. A company that hires too fast, undergoes a major layoff, gets acquired, experiences high turnover, or sees changes in leadership or priorities… Any of these can pretty quickly destabilize something that took years to build.Wrapping UpThis might not be your experience, and what we did may not work for you, but I hope you find this insight useful. I have, as they say, strong opinions, but loosely held. So I’m looking forward to knowing what you think and learning about your experiences too.There’s no easy way or silver bullet! It’s actually very hard! The odds are against you. And we tend to constantly be puzzled about why the world is against us doing something that seems so obviously the right thing to do: to invite and include as many people as possible to use your product, to remove barriers, to avoid exclusion. It is important to talk about exclusion, too, when we talk about accessibility.“Even though we were all talking about inclusion, we each had a different understanding of that word. Exclusion, on the other hand, is unanimously understood as being left out (...) Once we learn how to recognize exclusion, we can begin to see where a product or experience that works well for some might have barriers for someone else. Recognizing exclusion sparks a new kind of creativity on how a solution can be better.”— Kat HolmesSomething that might help: always assume goodwill and try to meet people where they are. I need to remind myself of this quite often.“It is all about understanding where people are, meeting them where they’re at (...) People want to fundamentally do the right thing (...) They might not know what they don’t know (...) It might mean stepping back and going to the fundamentals (...) I know some people get frustrated about having to re-explain accessibility over and over again, but I believe that if we are not willing to do that, then how are we gonna change the hearts and minds of people?”— Jennison AsuncionI’d encourage you to:If you haven’t, just start. No matter what.Play the long game, and focus more on systems and processes than just goals.Build a network: rally allies around you and secure buy-in from leadership by showing that accessibility is not extra work; if considered after the fact, they’re actually missed steps.Shift left and be strategic: reflect on where your limited resources can have the biggest, most lasting impact.Be persistent. Be resilient.But honestly, anything you can do is progress. And progress is all we need, just for things to be a little better every day. Your job is incredibly important. Thanks for all you do!Accessibility: This is the way! (yk)",
  "image": "https://files.smashing.media/articles/fostering-accessibility-culture/fostering-accessibility-culture.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article__content\"\u003e\u003cul\u003e\u003cli\u003e15 min read\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://smashingmagazine.com/category/accessibility\"\u003eAccessibility\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/web-design\"\u003eWeb Design\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/ux\"\u003eUX\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003csection aria-label=\"Quick summary\"\u003eBuilding an accessibility culture isn’t easy, and there’s no clear playbook. But Dani offers insights from his own journey, where small, consistent habits made a big difference.\u003c/section\u003e\u003c/p\u003e\u003cp\u003eA year ago, I learned that my role as an accessibility engineer was at risk of redundancy. It was a tough moment, both professionally and personally. For quite some time, my mind raced with guilt, self-doubt, plain sadness… But as I sat with these emotions, I found one line of thought that felt productive: reflection. What did I do well? What could I have done better? What did I learn?\u003c/p\u003e\u003cp\u003eLooking back, I realized that as part of a small team in a massive organization, we focused on a long-term goal that we also believed was the most effective and sustainable path: gradually shaping the organization’s culture to embrace accessibility.\u003c/p\u003e\u003cp\u003eAround the same time, I started listening to \u003ca href=\"https://jamesclear.com/atomic-habits\"\u003e“Atomic Habits” by James Clear\u003c/a\u003e. The connection was immediate. Habits and culture are tightly linked concepts, and fostering an accessibility culture was really about \u003cstrong\u003eembedding accessibility habits into everyone’s processes\u003c/strong\u003e. That’s what we focused on. It took us time (and plenty of trial and error) to figure this out, and while there’s no definitive playbook for creating an accessibility program at a large organization, I thought it might help others if I shared my experiences.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBefore we dive in, here’s a quick note\u003c/strong\u003e: \u003cem\u003eThis is purely my personal perspective, and you’ll find a bias towards culture and action in big organizations. I’m not speaking on behalf of any employer, past or present. The progress we made was thanks to the incredible efforts of every member of the team and beyond. I hope these reflections resonate with those looking to foster an accessibility culture at their own companies.\u003c/em\u003e\u003c/p\u003e\u003ch2 id=\"goals-vs-systems\"\u003eGoals Vs. Systems\u003c/h2\u003e\u003cp\u003eTo effectively shape habits, it’s crucial to focus on systems and processes (who we want to become) rather than obsessing over a final goal (or what we want to achieve). This perspective is especially relevant in accessibility.\u003c/p\u003e\u003cp\u003eTake the goal of making your app accessible. If you focus solely on achieving compliance without changing your systems (embedding accessibility into processes and culture), progress will be temporary.\u003c/p\u003e\u003cp\u003eFor example, you might request an accessibility audit and fix the flagged issues to achieve compliance. While this can provide “quick” results, it’s often a short-lived solution.\u003c/p\u003e\u003cp\u003eSoftware evolves constantly: features are rewritten, old code is removed, and new functionality is added. Without an underlying system in place, accessibility issues can quickly resurface. Worse, this approach may reinforce the idea that accessibility is something external, checked by someone else, and fixed only when flagged. Not to mention that \u003ca href=\"https://www.browserstack.com/guide/what-is-shift-left-testing\"\u003eit becomes increasingly expensive the later accessibility issues are addressed in the process\u003c/a\u003e. It can also feel demoralizing when accessibility becomes synonymous with a long list of last-minute tickets when you are busiest.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"400\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg\" sizes=\"100vw\" alt=\"A graph showing a relative cost to fix bugs based on time of detection\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eImage source: \u003ca href=\"https://www.browserstack.com/guide/what-is-shift-left-testing\"\u003eBrowserStack\u003c/a\u003e. (\u003ca href=\"https://files.smashing.media/articles/fostering-accessibility-culture/bug-fix-cost.jpg\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eDespite this, companies constantly focus on the goal rather than the systems.\u003c/p\u003e\u003cblockquote\u003e“Accessibility is both a state and a practice.”\u003cp\u003e— Sommer Panage, SwiftTO talk, “\u003ca href=\"https://youtu.be/sb_fhIa3PKg?si=YUKpoxB31-yhv7yD\"\u003eBuilding Accessibility into Your Company, Team, and Culture\u003c/a\u003e”\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eI’ll take the liberty of tweaking that to an aspirational state. Without recognizing the importance of the practice, any progress made is at risk of regression.\u003c/p\u003e\u003cp\u003eInstead, I encourage organizations to focus on building habits and embedding good accessibility practices into their workflows. A strong system not only ensures lasting progress but also fosters a culture where accessibility becomes second nature.\u003c/p\u003e\u003ch2 id=\"what-is-your-actual-goal\"\u003eWhat Is Your Actual Goal?\u003c/h2\u003e\u003cp\u003eThat doesn’t mean goals are useless — they’re very effective in setting up direction.\u003c/p\u003e\u003cp\u003eIn my team, we often said (only half-jokingly) that our ultimate goal was to put ourselves out of a job. This mindset reflects an important principle: \u003cstrong\u003eaccessibility is a cross-organizational responsibility\u003c/strong\u003e, not the task of a single person or team.\u003c/p\u003e\u003cp\u003eThat’s why, in my opinion, focusing solely on compliance rather than culture transformation (or prioritizing the “state” of accessibility over the “practice”) is a flawed strategy.\u003c/p\u003e\u003cp\u003eThe real goal should be to build \u003cstrong\u003ea user-centric culture\u003c/strong\u003e where accessibility is embedded in every workflow, decision, and process. By doing so, companies can create products where accessibility is not about checking boxes and closing tickets but delivering \u003cstrong\u003emeaningful and inclusive experiences\u003c/strong\u003e to all users.\u003c/p\u003e\u003ch2 id=\"how-do-we-get-there\"\u003eHow Do We Get There?\u003c/h2\u003e\u003cp\u003eDifferent companies (of various sizes, structures, and cultures) will approach accessibility differently, depending on where they are in their journey. I still have to meet, though, an accessibility team that ever felt they had enough resources. This makes careful resource allocation a cornerstone of your strategy. And while there’s no one-size-fits-all solution, shifting left (addressing issues earlier in the development process) tends to be the most effective approach in most cases.\u003c/p\u003e\u003ch3 id=\"design-systems\"\u003eDesign Systems\u003c/h3\u003e\u003cp\u003eIf your company has a design system, partnering with the team that owns it can be one of your biggest wins. Fixing a single component used across dozens of places improves the experience everywhere it’s used. This approach scales beautifully.\u003c/p\u003e\u003cp\u003eInvolvement in foundational decisions and discussions, like choosing color palettes, typography, and component interactions, and so on, can also be very valuable. Contributing to documentation and guidelines tailored to accessibility can help teams across the organization make informed decisions.\u003c/p\u003e\u003cp\u003eFor a deeper dive, I recommend Feli Bernutz’s excellent talk, “\u003ca href=\"https://youtu.be/tHYtjAXnQcI?si=FpkSxJ3QQ86aaOu6\"\u003eDesigning APIs: How to Ensure Accessibility in Design Systems\u003c/a\u003e.”\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp\u003eIt is worth repeating, you’ll need as many allies as possible. The more limited your resources, the more important this becomes. Something as simple as a Slack channel that becomes a safe space where people can ask questions and share tips can go a long way. Other ideas include lunch-and-learns, regular meetups, office hours, or building a more formal champions network. And, very importantly, it is about finding ways of recognising and celebrating wins and everyone’s good work.\u003c/p\u003e\u003cp\u003eIf you’re exploring this, I highly recommend joining the \u003ca href=\"https://www.linkedin.com/groups/12499821/\"\u003eChampions of Accessibility Network (CAN) group\u003c/a\u003e. It’s a great way to learn and connect with others who are passionate about accessibility.\u003c/p\u003e\u003ch3 id=\"education\"\u003eEducation\u003c/h3\u003e\u003cp\u003eEducation is key for scaling accessibility efforts. While not everyone needs to be an expert, \u003cstrong\u003ewe should strive for everyone to know the basics\u003c/strong\u003e. Repeatedly raising basic issues like missing accessibility labels, small target sizes, poor color contrast, and so on, can’t be productive.\u003c/p\u003e\u003cp\u003eConsider periodic training for different roles (PMs, designers, engineers…), embedding accessibility into onboarding sessions and documentation. You’ll need to find what works for you.\u003c/p\u003e\u003cp\u003eAt Spotify, I found onboarding sessions for designers highly effective, as most features start with design. \u003ca href=\"https://www.deque.com/blog/auditing-design-systems-for-accessibility/#design-should-consider-accessibility\"\u003eA Deque case study found that 67% of automatically detectable accessibility issues originate with design\u003c/a\u003e, reinforcing the importance of this approach. If your company has an education or training programme, partner with them. \u003ca href=\"https://makeitfable.com/article/how-to-scale-accessibility-knowledge-from-experts-at-spotify/\"\u003eAt Spotify, they were our biggest allies\u003c/a\u003e. They’ll help you get it right.\u003c/p\u003e\u003ch3 id=\"automation\"\u003eAutomation\u003c/h3\u003e\u003cp\u003eEverything that can be automated should eventually be automated. We know there’s already a lot on your plate, and automation should help lighten the load. This is especially true in larger organizations, where it can help scale efforts more efficiently. However, automated accessibility checks are not the silver bullet some might hope for.\u003c/p\u003e\u003cp\u003eOne key issue is viewing automation as the solution rather than a safety net. Some companies claim automated tools catch as much as \u003ca href=\"https://www.deque.com/automated-accessibility-testing-coverage/\"\u003e57% of all issues\u003c/a\u003e or even \u003ca href=\"https://accessibility.deque.com/hubfs/Semi-Automated-Accessibility-Testing-Coverage-Report.pdf\"\u003e80% of issues by volume\u003c/a\u003e (PDF), though it is widely accepted that the figure is about 30%. Native mobile apps present greater challenges, making it likely that the real number is significantly lower for iOS and Android. These tools, and the high expectations around them, can create a false sense of security or reduce efforts to merely appease an automated tool of choice.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aAutomation%20doesn%e2%80%99t%20%28and%20shouldn%e2%80%99t%29%20replace%20intentionality.%20We%20should%20aim%20to%20deliver%20great%20accessible%20experiences%20from%20the%20start%20rather%20than%20wait%20for%20a%20tool%20to%20flag%20issues%20after%20the%20fact.%0a\u0026amp;url=https://smashingmagazine.com%2f2025%2f04%2ffostering-accessibility-culture%2f\"\u003eAutomation doesn’t (and shouldn’t) replace intentionality. We should aim to deliver great accessible experiences from the start rather than wait for a tool to flag issues after the fact.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eWhether your focus is on compliance or customer satisfaction, manual testing remains an essential part of the process. Whenever possible, you should also be testing with real users.\u003c/p\u003e\u003cp\u003eFor me, the greatest value of automation is in \u003cstrong\u003ecatching basic regressions before release\u003c/strong\u003e and serving as \u003cstrong\u003ea gentle nudge\u003c/strong\u003e to developers, reminding them to consider accessibility more thoughtfully. Ideally, they don’t just fix an issue and move on but take a moment to reflect:\u003c/p\u003e\u003cul\u003e\u003cli\u003eHow did this issue arise in the first place?\u003c/li\u003e\u003cli\u003eDid we consider accessibility during development?\u003c/li\u003e\u003cli\u003eDid we skip manual testing with a screen reader?\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eWhen it comes to shaping habits, the environment matters. A strong accessibility culture isn’t built on willpower alone. It thrives on systems that encourage good practices and make bad ones harder to fall into. Nudges like automated checks, documentation, and proactive education are invaluable for keeping accessibility at the top of the mind.\u003c/p\u003e\u003ch3 id=\"remediation\"\u003eRemediation\u003c/h3\u003e\u003cp\u003eI won’t lie; the moment I was first told my new job was to work on accessibility, I immediately jumped in, doing what I knew best, trying to fix as many issues as possible myself. While rewarding at first, this approach isn’t scalable in larger organizations. It can quickly lead to burnout. It also sets an expectation within the company that it’s your team’s responsibility to get it done, an expectation that becomes increasingly difficult to reset as time goes on.\u003c/p\u003e\u003cp\u003eNot saying you shouldn’t be hands-on, though! But you need to be \u003cstrong\u003estrategic\u003c/strong\u003e. Try to focus on supporting teams with complex issues, pair programming with colleagues, code reviews, or implementing cross-app improvements, ideally in partnership with the design system teams. This way, your efforts can have a broader impact.\u003c/p\u003e\u003ch3 id=\"auditing\"\u003eAuditing\u003c/h3\u003e\u003cp\u003eAccessibility audits are another tool in your toolbox. Audits can be valuable but are often overused. They’re most effective after teams have done their best to make the product accessible, serving as \u003cstrong\u003ea validation step rather than the starting point\u003c/strong\u003e. After all, how useful is an audit if a significant portion of the flagged issues are basic problems that automated tools could have detected?\u003c/p\u003e\u003cp\u003eAlternatively, audits might help when you need quick results but don’t have the time or resources to upskill your workforce in time for a timely and necessary remediation.\u003c/p\u003e\u003cp\u003eWhile audits have their place and, as mentioned, can be valuable in certain situations, I wouldn’t rely on them to be the cornerstone of your strategy.\u003c/p\u003e\u003ch3 id=\"and-so-much-more\"\u003eAnd So Much More\u003c/h3\u003e\u003cp\u003e​​Try to find what works for your team, and, most importantly, adapt as circumstances change. Beyond the strategies mentioned, you might explore other initiatives:\u003c/p\u003e\u003cul\u003e\u003cli\u003eCollecting accessibility metrics,\u003c/li\u003e\u003cli\u003eConducting user research and testing,\u003c/li\u003e\u003cli\u003eImproving procurement practices,\u003c/li\u003e\u003cli\u003eEnsuring accessible content and communications,\u003c/li\u003e\u003cli\u003eSupporting accessible hiring, workplace platforms, and tools.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIt doesn’t mean one area of action is more important than another. Actually, in my view, one of the biggest reasons cultural change around accessibility takes longer than other areas is the \u003cstrong\u003elack of diversity in the workforce\u003c/strong\u003e. Contributing to lines of action to address this issue might not be as immediately obvious as others.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bcs.org/policy-and-influence/equity-diversity-and-inclusion/bcs-diversity-report-2023-disability/disability-and-it-employment/\"\u003eThe industry hasn’t done enough to hire people with disabilities\u003c/a\u003e, leaving them underrepresented in building products that truly work for them. Worse yet, they face more barriers in the hiring process. And even when they do get hired, they may find that the tools meant to enable us to do our work and be productive don’t work for them.\u003c/p\u003e\u003cp\u003eThe key is to identify and lay out your areas of action first, then prioritize strategically while staying flexible as circumstances evolve. A thoughtful, adaptive approach ensures that no matter the challenge, your efforts remain impactful, avoiding stretching your team too thin and losing focus.\u003c/p\u003e\u003ch2 id=\"valley-of-despair\"\u003eValley Of Despair\u003c/h2\u003e\u003cp\u003eHere’s the truth that everyone working in accessibility inevitably and unfortunately faces sooner rather than later: \u003cstrong\u003eaccessibility done right, as we’ve seen so far, takes time\u003c/strong\u003e. And that goes against the “move fast and break things” culture of quick results and short-termism that many companies still follow, even if they won’t openly admit it.\u003c/p\u003e\u003cp\u003eThe slow-cooking nature of the process can, therefore, work against us. Being patient and trusting that small changes will aggregate and compound over time is incredibly challenging and sometimes nerve-racking. On top of that, if there’s a misalignment with leadership about what the ultimate goal is, or if there’s pressure to deliver quick results, it’s easy to feel like throwing in the towel, or worse, to experience burnout.\u003c/p\u003e\u003cp\u003eUnfortunately, burnout is an all-too-common issue in the accessibility community.\u003c/p\u003e\u003cp\u003eIf you’d like to learn more about it, I highly recommend Shell Little’s talk, “\u003ca href=\"https://www.youtube.com/watch?v=5gs54WDVBIw\"\u003eThe Accessibility to Burnout Pipeline\u003c/a\u003e.”\u003c/p\u003e\u003cp\u003eIn those moments of doubt, it is useful to remember the \u003ca href=\"https://www.cbssports.com/nba/news/nba-finals-a-rock-hammer-and-cracking-of-spurs-majesty-in-game-7/\"\u003equote embraced by the San Antonio Spurs NBA team, originally from social reformer Jacob Riis\u003c/a\u003e:\u003c/p\u003e\u003cblockquote\u003e“When nothing seems to help, I go and look at a stonecutter hammering away at his rock perhaps a hundred times without as much as a crack showing in it. Yet at the hundred and first blow it will split in two, and I know it was not that blow that did it — but all that had gone before.”\u003cp\u003e— Jacob Riis\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eThis serves as a powerful reminder that every small effort contributes to the eventual breakthrough, even when progress feels invisible.\u003c/p\u003e\u003ch2 id=\"an-uncomfortable-truth\"\u003eAn Uncomfortable Truth\u003c/h2\u003e\u003cp\u003eTop-down approaches are easier, and yet, most accessibility initiatives start from the bottom. For a sustainable strategy, however, you’ll need both. If necessary, you’ll have to get buy-in from leadership or risk feeling like you’re constantly swimming upstream. Surprisingly, this is often harder than it seems. This topic could easily be an article on its own, but Vitaly Friedman offers some useful pointers in his piece “\u003ca href=\"https://www.smashingmagazine.com/2024/06/how-make-strong-case-accessibility/\"\u003eHow To Make A Strong Case For Accessibility\u003c/a\u003e.”\u003c/p\u003e\u003cp\u003eIn my experience, \u003cstrong\u003eleadership buy-in is crucial to fostering an accessibility culture\u003c/strong\u003e. Leaders often want to see how accessibility impacts the bottom line and whether investing in it is profitable. The hardest part is getting started, so if you can make a convincing case this way, do it.\u003c/p\u003e\u003cp\u003eI once watched a talk by \u003ca href=\"https://www.linkedin.com/in/daviddame?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAA5GpQBnIE99fhtGBHhwX8OG8mUW2SqBaI\u0026amp;lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3Bhd0Q7%2BvrQGKtdxtNjXHe6w%3D%3D\"\u003eDave Dame\u003c/a\u003e titled “Stakeholders Agree That Accessibility Is Important, But That Does Not Mean They Will Invest In Accessibility.” He made an excellent point: You may need to speak the business language to get their attention. As Dave put it, “\u003ca href=\"https://www.linkedin.com/posts/daviddame_accessibility-activity-7291902787003551745-ZUDt?utm_source=share\u0026amp;utm_medium=member_desktop\u0026amp;rcm=ACoAAAddFqsBZwIBQzaaJzWCPkPlL5CFAxXi5Rc\"\u003eI have Cerebral Palsy, but my money doesn’t\u003c/a\u003e.”\u003c/p\u003e\u003cp\u003eThere is also \u003ca href=\"https://hdsunflower.com/uk/insights/post/who-is-purple\"\u003edata out there suggesting that accessibility can be a worthwhile investment\u003c/a\u003e.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"533\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg\" sizes=\"100vw\" alt=\"Inforgraphic showing stats of the Purple pound\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eImage source: \u003ca href=\"https://hdsunflower.com/uk/insights/post/who-is-purple\"\u003eHidden Disabilities Sunflower\u003c/a\u003e. (\u003ca href=\"https://files.smashing.media/articles/fostering-accessibility-culture/inforgraphic-showing-stats-purple-pound.jpg\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eStill, I would encourage everyone to strive to change that mindset.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aDoing%20accessibility%20for%20economic%20or%20legal%20reasons%20is%20valid,%20but%20it%20can%20lead%20to%20perverse%20incentives,%20where%20the%20bare%20minimum%20and%20compliance%20become%20the%20strategy,%20or%20where%20teams%20constantly%20need%20to%20prove%20their%20return%20on%20investment.%0a\u0026amp;url=https://smashingmagazine.com%2f2025%2f04%2ffostering-accessibility-culture%2f\"\u003eDoing accessibility for economic or legal reasons is valid, but it can lead to perverse incentives, where the bare minimum and compliance become the strategy, or where teams constantly need to prove their return on investment.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eIt is better to do it for the “wrong” reasons than not to do it at all. But ultimately, those aren’t the reasons we should be doing it.\u003c/p\u003e\u003cp\u003eThe “\u003ca href=\"https://www.bemyeyes.com/podcasts/who-invented-voiceover/\"\u003e13 Letters\u003c/a\u003e” podcast opened with an incredibly interesting two-part episode featuring Mike Shebanek. In it, Mike explains how Apple eventually renewed its commitment to accessibility because, in the state of Maine, schools were providing Macs and needed a screen reader for students who required one. It seems like a somewhat business-driven decision. But years later, Tim Cook famously stated, “\u003ca href=\"https://www.forbes.com/sites/stevedenning/2014/03/07/why-tim-cook-doesnt-care-about-the-bloody-roi/\"\u003eWhen we work on making our devices accessible by the blind, I don’t consider the bloody ROI.\u003c/a\u003e” He also remarked, “\u003ca href=\"https://x.com/tim_cook/status/624584736862679040\"\u003eAccessibility rights are human rights.\u003c/a\u003e”\u003c/p\u003e\u003cp\u003eThat’s the mindset I wish more CEOs and leaders had. It is a story of how a change of mindset from “we have to do it” to “it is a core part of what we do” leads to a lasting and successful accessibility culture. Going beyond the bare minimum, Apple has become a leader in accessibility. An innovative company that consistently makes products more accessible and pushes the entire industry forward.\u003c/p\u003e\u003ch2 id=\"the-good-news\"\u003eThe Good News\u003c/h2\u003e\u003cp\u003eOnce good habits are established, they tend to stick around. When I was let go, some people (I’m sure trying to comfort me) said the accessibility of the app would quickly regress and that the company would soon realize their mistake. Unexpectedly for them, I responded that I actually hoped it wouldn’t regress anytime soon. That, to me, would be the sign that I had done my job well.\u003c/p\u003e\u003cp\u003eAnd honestly, I felt confident it wouldn’t. Incredible people with deep knowledge and a passion for accessibility and building high-quality products stayed at the company. I knew the app was in good hands.\u003c/p\u003e\u003cp\u003eBut it’s important not to fall into complacency. Cultures can be taken for granted, but they need constant \u003cstrong\u003enurturing\u003c/strong\u003e and \u003cstrong\u003eprotection\u003c/strong\u003e. A company that hires too fast, undergoes a major layoff, gets acquired, experiences high turnover, or sees changes in leadership or priorities… Any of these can pretty quickly destabilize something that took years to build.\u003c/p\u003e\u003ch2 id=\"wrapping-up\"\u003eWrapping Up\u003c/h2\u003e\u003cp\u003eThis might not be your experience, and what we did may not work for you, but I hope you find this insight useful. I have, as they say, strong opinions, but loosely held. So I’m looking forward to knowing what you think and learning about your experiences too.\u003c/p\u003e\u003cp\u003eThere’s no easy way or silver bullet! It’s actually very hard! The odds are against you. And we tend to constantly be puzzled about why the world is against us doing something that seems so obviously the right thing to do: to invite and include as many people as possible to use your product, to remove barriers, to avoid exclusion. It is important to talk about \u003cstrong\u003eexclusion\u003c/strong\u003e, too, when we talk about accessibility.\u003c/p\u003e\u003cblockquote\u003e“Even though we were all talking about inclusion, we each had a different understanding of that word. Exclusion, on the other hand, is unanimously understood as being left out (...) Once we learn how to recognize exclusion, we can begin to see where a product or experience that works well for some might have barriers for someone else. Recognizing exclusion sparks a new kind of creativity on how a solution can be better.”\u003cp\u003e— \u003ca href=\"https://www.campaignlive.com/article/recognizing-exclusion-key-inclusive-design-conversation-kat-holmes/1488872\"\u003eKat Holmes\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eSomething that might help: always assume goodwill and try to meet people where they are. I need to remind myself of this quite often.\u003c/p\u003e\u003cblockquote\u003e“It is all about understanding where people are, meeting them where they’re at (...) People want to fundamentally do the right thing (...) They might not know what they don’t know (...) It might mean stepping back and going to the fundamentals (...) I know some people get frustrated about having to re-explain accessibility over and over again, but I believe that if we are not willing to do that, then how are we gonna change the hearts and minds of people?”\u003cp\u003e— \u003ca href=\"https://www.linkedin.com/posts/bencongleton_ndeam-goodjobsforall-inclusionworks-activity-7257013809737789440-CRwS?utm_source=share\u0026amp;utm_medium=member_desktop\u0026amp;rcm=ACoAAAddFqsBZwIBQzaaJzWCPkPlL5CFAxXi5Rc\"\u003eJennison Asuncion\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eI’d encourage you to:\u003c/p\u003e\u003cul\u003e\u003cli\u003eIf you haven’t, just start. No matter what.\u003c/li\u003e\u003cli\u003ePlay the long game, and focus more on systems and processes than just goals.\u003c/li\u003e\u003cli\u003eBuild a network: rally allies around you and secure buy-in from leadership by showing that accessibility is not extra work; if considered after the fact, they’re actually missed steps.\u003c/li\u003e\u003cli\u003eShift left and be strategic: reflect on where your limited resources can have the biggest, most lasting impact.\u003c/li\u003e\u003cli\u003eBe persistent. Be resilient.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBut honestly, anything you can do is progress. And progress is all we need, just for things to be a little better every day. Your job is incredibly important. Thanks for all you do!\u003c/p\u003e\u003cp\u003eAccessibility: This is the way!\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"/\u003e\n\u003cspan\u003e(yk)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "21 min read",
  "publishedTime": "2025-04-17T08:00:00Z",
  "modifiedTime": "2025-04-17T08:00:00Z"
}
