{
  "id": "7c729eaa-1504-4fd8-8ac4-5f5db84c452f",
  "title": "The future of content design in an AI world",
  "link": "https://uxdesign.cc/the-future-of-content-design-in-an-ai-world-bb58ba26455c?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Andrew Tipp",
  "published": "Mon, 16 Jun 2025 11:44:24 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "ux",
    "content-design",
    "design",
    "future",
    "ai"
  ],
  "byline": "Andrew Tipp",
  "length": 16117,
  "excerpt": "My conclusion at the time was ‘no’. But generative AI continues to develop. Rapidly. And I feel like my article needs a follow-up. A spiritual sequel, looking at the bigger picture. Because if you…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "The future of content design in an AI worldIn a nutshell? It’s a bit scary. But full of possibilities. For now.Content design is integral to UX. Image: GOV.UKLast year I asked a very direct question: can AI replace content designers?My conclusion at the time was ‘no’. But generative AI continues to develop. Rapidly. And I feel like my article needs a follow-up. A spiritual sequel, looking at the bigger picture.Because if you spend enough time online, the internet can feel like an unrelenting tsunami of designer anxiety, fuelled by AI accelerationists and doom-mongers proclaiming our days are numbered.On the other hand, there are optimists (delusionists?) painting a utopian vision of designers and AI embracing the future hand-in-hand.So what’s the truth? Who’s right?There are plenty of think-pieces about content design and AI, looking at what it all means and how to adapt to it. But I’ve got a few points to make that I haven’t seen anywhere else. (Or at least, not explained this way.)So let’s get into it; starting with predictions of full-blown, wholesale replacement of content designers with AI itself…The problem with predictionsIt seems like every day there’s a new forecast from big tech CEOs predicting human obsolescence due to AI. These projections tend to include seemingly arbitrary dates and percentages, e.g. ‘half of all entry level jobs being replaced by AI in the next 5 years’.Anthropic CEO Dario Amodei has predicted huge AI-related job losses. Image: WikipediaAside from the obvious flaw that there’s an incentive for anyone working in AI to hype the future capability of their products, the other problem with these predictions is that they’re made by people who don’t actually know what people do in these jobs every day. Take design:There’s an assumption that design jobs consist entirely of their outputs. As a result, projections are based on the ability of AI to produce outputs replicating the hard skills of these professions.But this is a mistake. Design isn’t just about the end product visible in the public domain, but all the work around it required to ensure it’s effective. It’s a process, not an output.The reality of content designLike all design-related professions, the bulk of content design is about activity leading up to designing, such as:researching and empathising with users to understand their lives, goals and frustrations and learn what problems we need to solve, as well as engaging with stakeholders to discover their objectivesplanning how to meet user needs and business goals for a specific context, which requires human judgement, collaboration and negotiation over trade-offs (e.g. aesthetics versus usability)In fact, it’s not until over two-thirds of the way through the seminal Content Design (2024) that authors Sarah Winters and Rachel Edwards explain: “Now, finally, you are ready to write.”And it doesn’t end there. The bit of content design no-one likes talking about is maintaining content. Because it’s boring. But it’s also important, and requires human validation, accountability and relationships with team members, colleagues, senior stakeholders and user groups.Content design is much more than a UX writer sitting at a desk bashing out copy; it’s a dynamic, human process, working strategically with different types of people, in different environments, and across non-interoperable technologies.Context is also key: a good content designer understands the ripple effect of how every design decision impacts everyone and everything else. As explained in Megan Casey’s Content Strategy Toolkit (2023), understanding your business environment is critical. And it’s context you can only get from having human agency and experience in the world.Finally, content design requires strong soft skills, such as interpersonal communication, empathy, and social and emotional intelligence. In fact, a 2024 review into AI, workers, and future of work skills emphasised the importance of these abilities for what the authors describe as the emergence of the new “feeling economy” in an AI world.Why technology isn’t a replacementI’m not shying away from the fact that AI can do a lot of hard skills required in content design, and even some of the soft ones. AI can be creative. It can imitate empathy. It can simulate a relationship. It can even solve problems — to a point. But here’s the hard limit:AI can’t act autonomously, pro-actively and with the context of a human content designer who builds real relationships and operates in the real world across a myriad environments, systems and processes.AI remains inert until used, follows instructions and its knowledge is constrained by the data it’s trained on. It can’t use initiative in an area like content design, it doesn’t have awareness of in-person meetings, organisation politics, stakeholder motivations or offline user interactions, and it can’t seamlessly hop between tools like CMS platforms, quality assurance tools and communication technologies.Content designer versus AI limitations. Image: AuthorThis means AI is still just a tool, which as Senior Content Designer Jenny Williams explains, can mimic the topmost layer of content design but not the underlying framework that supports the foundation for good user experience. Which sounds reassuring, right?But don’t relax. AI itself won’t take your job, but there is still an AI-related threat to content designers…The (actual) big, scary threat of AIThe threat from AI in content design is two-fold:The perception that fewer content designers are needed.The idea that anyone can ‘do’ content design using an AI assistant.Let’s examine them in turn…1. Fewer content designers are neededThe problem with this idea is the flawed assumption that there’s a finite amount of work for content designers to do.You can test this easily enough: write down all the things you could be working on next to what you’re actually doing. Most content designers workstacks are simply a prioritised list of what they’ve got capacity for.Current versus potential work. Image: AuthorAdditionally, the idea that you need fewer designers because ‘one person can do the work of 5 people’ doesn’t make sense, because what’s considered ‘one person’s work’ is changing. ‘Super-powered’ productivity using AI will simply become the new normal. In the words of Syndrome from The Incredibles: if everyone’s super, no one is.This means reducing the number of content designers in an organisation is actually just undermining the level of service expected in the new world of AI-supported workers.Fewer content designers means products and services will simply be worse, because our job is more than just the end product and ‘one person’s work’ has been redefined by AI.2. Anyone can do content design with AIThis one is more disturbing, because it imagines a future where employers assume skilled disciplines can be carried out by people who don’t really know what they’re doing.The main issue with this approach is that there’s no actual expertise on hand:qualified to advise organisation leadership and the workforce on their legal and ethical responsibilities around content, e.g. web accessibility (you can’t rely on an AI summary)knowledgeable enough to validate AI content — is the content actually good? Does it follow principles, guidelines and established best practices? How do you know without content specialists on hand?skilled enough to independently carry out things like user research, planning workshops, content creation and other design activities where AI assistance might not be availableexperienced enough to interact with users, engage stakeholders (including persuading, challenging and negotiating) or train and support colleagues on best practices in a real-world context.Content designers need to advise stakeholders. Image: AuthorIt’s entirely self-defeating if organisations decide a random employee with a AI subscription is a viable alternative to a content designer — or any skilled practitioner.How to solve this ‘AI problem’We can see that the real problem for content designers isn’t actually AI: it’s a misperception of content design and why knowledgeable, skilled and experienced practitioners are needed.But that doesn’t make this someone else’s problem.The responsibility for solving this issue goes both ways: you can’t expect everyone to recognise your value. You have to advocate for yourself.It’s no good reassuring each other in our design echo chambers about how important we are. We need to convince the people who decide whether they need to hire content designers (and how many they need). We need to:empathise — that means listening, observing and understanding their perspective, pressures and awareness of content designcommunicate our process effectively — using their language, simplifying concepts and clearly visualising how it works (like the four pillars model of content design)demonstrate the impact of content design — not only how it helps users but how it benefits the organisation (and individual stakeholders!)If you can’t quantify the positive impact of having content designers, focus on the negative impact of not having them (or fewer of them), such as:non-compliance with regulations (e.g. website and mobile app accessibility), which would exclude disabled users and could possibly result in legal action and financial penaltiesnon-inclusive products and services through lack of engagement and understanding of diverse user needs — failing communities but also corporate objectives around equality and social responsibilityuser experience getting worse leading to lower conversions, decline in customer satisfaction and loyalty, increase in customer complaints and ultimately brand reputation damage.Content designer + AI = the futureIf we make sure the right people understand we’re strategically important assets and not dispensable copy scribblers, we’ve got a future. And it could be a bright future, with AI helping us to become more efficient, creative and ensure better UX.Strengths of content designers, AI and shared activities. Image: Author.That’s probably why more than 80% of content designers already use AI for day-to-day work, to assist them with activities like:user research, e.g. identifying themes and recommendations from user interview transcriptsideation and drafting content (which content designers can then edit to ensure it’s fit for purpose in context)producing resources like guidelines, templates and presentations as internal assets to embed good practicescustomising AI assistants based on our own specific content guidelines as a supporting tool.There’s also the generic day-to-day office admin which AI can reduce drastically, e.g. summarising meetings and email threads, or drafting boring reports and other documentation.While few content designers have never used AI tools, getting the most out of them will make you a better practitioner — and give you an employability advantage over those using AI rarely or haphazardly.AI assistance is a powerful content design resource. Image: AuthorIt’s an encouraging vision, the AI-empowered content designer.But remember: this positive future isn’t guaranteed. It won’t just happen organically. We need to play our part to manifest it.The far future of content designOkay, so if we adapt to AI and advocate for our profession the short-to-medium term future could be bright.But what about the long-term future? Is there any scenario where AI could actually make content designers obsolete?Potentially, yes.There’s a plausible hypothetical future where artificial general intelligence (AGI) could replace human content designers.Definitions of AGI vary and there’s no consensus among experts over when it’ll arrive, or whether it’s even possible. But in a nutshell: AGI is a type of super-advanced AI that’s capable of performing any intellectual task that humans can do — including operating autonomously to solve complex problems across different environments.Example: You task an AGI to improve your website. It then creates its own sub-goals, plans and tasks, then carries them out and reports back. This would involve actually interacting with people in the real world, adapting and operating across different technologies and systems to achieve its objectives — all independently and self-governed.This kind of proactive AI agent would be an entirely different proposition. It may not be sentient, but it would be more than a tool. It may even be capable of understanding local, contextual situations comparable to a human. How? Well, the idea with AGI is that intelligence is a rock face, not a ladder, and that humans and AI will take different routes to reach the summit (see below).100% non-scientific model of intelligence. Image: AuthorWould this futuristic AGI be accepted over a human designer using AI? Would users accept an AI researcher? Would stakeholders and employees accept AI colleagues? The answer to these questions might be ‘no’, but then again the AGI might also be so good that there’s just no rational (financial) justification for organisations to employ humans.It’s an unnerving thought.But we’re probably looking so far ahead into an unknowable future there’s no point worrying about it. All we can do is stay up to date, adopt AI into our work and be adaptable.The rest is out of our control.SummaryThis is how I see the state of things, what we need to do and where things could be headed:AI is powerful, impressive and useful. It’s a game-changer. But it’s not a replacement for human content designers. For all its knowledge and skills, it’s still a tool that lacks context, real-world agency and can’t operate autonomously, pro-actively or across complex environments.The real threat is organisations thinking they don’t need as many content designers, or that they can replace us with non-specialists relying on AI for everything a content designer would do. This is flawed thinking that will negatively impact users, businesses and stakeholders.As content designers, we need to advocate for ourselves. We need to continually make the positive case for content design specialists through empathy, clear communication and demonstrating tangible benefits of our work (or what’ll happen without content designers)Content designers who leverage AI for everyday work — both design specific and generic admin — will be more effective, efficient and employable over designers who refuse to engage with it; AI-assisted content designers will seem super-powered by comparison.There’s a hypothetical future where AI becomes so advanced there genuinely won’t be a need to employ human content designers, or it simply won’t make financially sense. Either way, it doesn’t make any sense expending time or energy worrying about this. For now.Further readingDaugherty, P.R. and Wilson, H.J. (2024) Human + machine, updated and expanded: reimagining work in the age of AI. Harvard Business Press.Eng, P. H. and Liu, R.L. (2024) ‘Will intelligent technologies replace humans in the future? An exploratory study for likelihood of intelligent technologies to replace humans in the future’, in Studies in Computational Intelligence, pp. 171–202. Available at: https://link.springer.com/chapter/10.1007/978-3-031-61463-7_9Farhan, A. (2023) ‘The impact of artificial intelligence on human workers’, Journal of Communication Education, 17(2). Available at: https://jurnal.unipem.ac.id/index.php/joce-ip/article/view/350George, A. S. (2024) ‘Automated futures: examining the promise and peril of AI on jobs, productivity, and work-life balance’, Partners Universal Innovative Research Publication. Available at: https://zenodo.org/records/14544519Montgomery, B. (2025) Will AI wipe out the first rung of the career ladder? Available at: https://www.theguardian.com/global/2025/jun/02/artificial-intelligence-jobs-techscapeMorandini, S., et al. (2023) ‘The impact of artificial intelligence on workers’ skills: upskilling and reskilling in organisations’, Informing Science the International Journal of an Emerging Transdiscipline, 26, pp. 39–68. Available at: https://doi.org/10.28945/5078",
  "image": "https://miro.medium.com/v2/resize:fit:799/0*7nysBjkDNxq4dV5D.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2 id=\"2253\" data-testid=\"storyTitle\"\u003eThe future of content design in an AI world\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2 id=\"2edc\"\u003eIn a nutshell? It’s a bit scary. But full of possibilities. For now.\u003c/h2\u003e\u003cdiv tabindex=\"-1\" aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/@andrewtipp?source=post_page---byline--bb58ba26455c---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Andrew Tipp\" src=\"https://miro.medium.com/v2/resize:fill:64:64/1*djeBm-XZEDXIVuZLWgvEyA.png\" width=\"32\" height=\"32\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigure\u003e\u003cfigcaption\u003eContent design is integral to UX. Image: GOV.UK\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"7aa6\"\u003eLast year I asked a very direct question: \u003ca href=\"https://medium.com/user-experience-design-1/can-ai-replace-human-content-designers-b04231810ee7\" rel=\"noopener\"\u003ecan AI replace content designers\u003c/a\u003e?\u003c/p\u003e\u003cp id=\"b77e\"\u003eMy conclusion at the time was ‘no’. But generative AI continues to develop. Rapidly. And I feel like my article needs a follow-up. A spiritual sequel, looking at the bigger picture.\u003c/p\u003e\u003cp id=\"9d64\"\u003eBecause if you spend enough time online, the internet can feel like an unrelenting tsunami of designer anxiety, fuelled by AI accelerationists and doom-mongers proclaiming our days are numbered.\u003c/p\u003e\u003cp id=\"790a\"\u003eOn the other hand, there are optimists (delusionists?) painting a utopian vision of designers and AI embracing the future hand-in-hand.\u003c/p\u003e\u003cp id=\"2a5c\"\u003eSo what’s the truth? Who’s right?\u003c/p\u003e\u003cp id=\"b4d4\"\u003eThere are plenty of think-pieces about content design and AI, looking at what it all means and how to adapt to it. But I’ve got a few points to make that I haven’t seen anywhere else. (Or at least, not explained this way.)\u003c/p\u003e\u003cp id=\"fc08\"\u003eSo let’s get into it; starting with predictions of full-blown, wholesale replacement of content designers with AI itself…\u003c/p\u003e\u003ch2 id=\"6939\"\u003eThe problem with predictions\u003c/h2\u003e\u003cp id=\"af2e\"\u003eIt seems like every day there’s a new forecast from big tech CEOs predicting human obsolescence due to AI. These projections tend to include seemingly arbitrary dates and percentages, e.g. ‘\u003ca href=\"https://www.businessinsider.com/anthropic-ceo-warning-ai-could-eliminate-jobs-2025-5\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehalf of all entry level jobs being replaced by AI in the next 5 years\u003c/a\u003e’.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eAnthropic CEO Dario Amodei has predicted huge AI-related job losses. Image: Wikipedia\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"b71b\"\u003eAside from the obvious flaw that there’s an incentive for anyone working in AI to hype the future capability of their products, the other problem with these predictions is that they’re made by people who \u003cem\u003edon’t actually know what people do\u003c/em\u003e in these jobs every day. Take design:\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"c199\"\u003eThere’s an assumption that design jobs consist entirely of their outputs. As a result, projections are based on the ability of AI to produce outputs replicating the hard skills of these professions.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"8ba3\"\u003eBut this is a mistake. Design isn’t just about the end product visible in the public domain, but all the work \u003cem\u003earound \u003c/em\u003eit required to ensure it’s effective. It’s a process, not an output.\u003c/p\u003e\u003ch2 id=\"8e62\"\u003eThe reality of content design\u003c/h2\u003e\u003cp id=\"1cd4\"\u003eLike all design-related professions, the bulk of content design is about activity leading \u003cem\u003eup \u003c/em\u003eto designing, such as:\u003c/p\u003e\u003cul\u003e\u003cli id=\"03a7\"\u003e\u003cstrong\u003eresearching \u003c/strong\u003eand empathising with users to understand their lives, goals and frustrations and learn what problems we need to solve, as well as engaging with stakeholders to discover their objectives\u003c/li\u003e\u003cli id=\"231b\"\u003e\u003cstrong\u003eplanning \u003c/strong\u003ehow to meet user needs and business goals for a \u003cem\u003especific context, \u003c/em\u003ewhich requires human judgement, collaboration and negotiation over trade-offs (e.g. aesthetics versus usability)\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"8dd0\"\u003eIn fact, it’s not until over two-thirds of the way through the seminal \u003ca href=\"https://contentdesign.london/shop/content-design-by-sarah-winters-and-rachel-edwards\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cem\u003eContent Design\u003c/em\u003e\u003c/a\u003e (2024) that authors Sarah Winters and Rachel Edwards explain: “Now, finally, you are ready to write.”\u003c/p\u003e\u003cp id=\"fba5\"\u003eAnd it doesn’t end there. The bit of content design no-one likes talking about is \u003cstrong\u003e\u003cem\u003emaintaining \u003c/em\u003e\u003c/strong\u003econtent. Because it’s boring. But it’s also important, and requires human validation, accountability and relationships with team members, colleagues, senior stakeholders and user groups.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"4c27\"\u003eContent design is much more than a UX writer sitting at a desk bashing out copy; it’s a dynamic, human process, working strategically with different types of people, in different environments, and across non-interoperable technologies.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"3810\"\u003eContext is also key: a good content designer understands the ripple effect of how every design decision impacts everyone and everything else. As explained in Megan Casey’s \u003ca href=\"https://www.oreilly.com/library/view/the-content-strategy/9780134105116/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cem\u003eContent Strategy Toolkit\u003c/em\u003e\u003c/a\u003e (2023), understanding your business environment is critical. And it’s context you can only get from having human agency and experience in the world.\u003c/p\u003e\u003cp id=\"4637\"\u003eFinally, content design requires strong soft skills, such as interpersonal communication, empathy, and social and emotional intelligence. In fact, a \u003ca href=\"https://doi.org/10.1016/j.copsyc.2024.101828\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e2024 review into AI, workers, and future of work skills\u003c/a\u003e emphasised the importance of these abilities for what the authors describe as the emergence of the new “feeling economy” in an AI world.\u003c/p\u003e\u003ch2 id=\"3a7c\"\u003eWhy technology isn’t a replacement\u003c/h2\u003e\u003cp id=\"c162\"\u003eI’m not shying away from the fact that AI can do a lot of hard skills required in content design, and even some of the soft ones. AI \u003cem\u003ecan \u003c/em\u003ebe creative. It can \u003cem\u003eimitate \u003c/em\u003eempathy. It can \u003cem\u003esimulate \u003c/em\u003ea relationship. It can even solve problems — to a point. But here’s the hard limit:\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"43c6\"\u003eAI can’t act autonomously, pro-actively and with the context of a human content designer who builds real relationships and operates in the real world across a myriad environments, systems and processes.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"b5b5\"\u003eAI remains inert until used, follows instructions and its knowledge is constrained by the data it’s trained on. It can’t use initiative in an area like content design, it doesn’t have awareness of in-person meetings, organisation politics, stakeholder motivations or offline user interactions, and it can’t seamlessly hop between tools like CMS platforms, quality assurance tools and communication technologies.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eContent designer versus AI limitations. Image: Author\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"705b\"\u003eThis means AI is still \u003cem\u003ejust \u003c/em\u003ea tool, which \u003ca href=\"https://microsoft.design/articles/in-the-age-of-ai-will-content-designers-become-extinct/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eas Senior Content Designer Jenny Williams explains\u003c/a\u003e, can mimic the topmost layer of content design but not the underlying framework that supports the foundation for good user experience. Which sounds reassuring, right?\u003c/p\u003e\u003cp id=\"a2eb\"\u003eBut don’t relax. AI \u003cem\u003eitself \u003c/em\u003ewon’t take your job, but there \u003cem\u003eis \u003c/em\u003estill an AI-related threat to content designers…\u003c/p\u003e\u003ch2 id=\"ffed\"\u003eThe (actual) big, scary threat of AI\u003c/h2\u003e\u003cp id=\"1fcf\"\u003eThe threat from AI in content design is two-fold:\u003c/p\u003e\u003col\u003e\u003cli id=\"c892\"\u003eThe perception that fewer content designers are needed.\u003c/li\u003e\u003cli id=\"d452\"\u003eThe idea that anyone can ‘do’ content design using an AI assistant.\u003c/li\u003e\u003c/ol\u003e\u003cp id=\"6f45\"\u003eLet’s examine them in turn…\u003c/p\u003e\u003ch2 id=\"59ac\"\u003e1. Fewer content designers are needed\u003c/h2\u003e\u003cp id=\"7103\"\u003eThe problem with this idea is the \u003cstrong\u003eflawed assumption that there’s a finite amount of work\u003c/strong\u003e for content designers to do.\u003c/p\u003e\u003cp id=\"92f3\"\u003eYou can test this easily enough: write down all the things you \u003cem\u003ecould \u003c/em\u003ebe working on next to what you’re \u003cem\u003eactually\u003c/em\u003e doing. Most content designers workstacks are simply a prioritised list of what they’ve got capacity for.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eCurrent versus potential work. Image: Author\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"6887\"\u003eAdditionally, the idea that you need fewer designers because ‘one person can do the work of 5 people’ doesn’t make sense, because what’s considered ‘one person’s work’ is changing. ‘Super-powered’ productivity using AI will simply become the new normal. In the words of Syndrome from The Incredibles: if everyone’s super, no one is.\u003c/p\u003e\u003cp id=\"5b06\"\u003eThis means reducing the number of content designers in an organisation is actually just undermining the level of service expected in the new world of AI-supported workers.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"c5f5\"\u003eFewer content designers means products and services will simply be worse, because our job is more than just the end product and ‘one person’s work’ has been redefined by AI.\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"7518\"\u003e2. Anyone can do content design with AI\u003c/h2\u003e\u003cp id=\"0524\"\u003eThis one is more disturbing, because it imagines a future where employers assume skilled disciplines can be carried out by \u003cstrong\u003epeople who don’t really know what they’re doing\u003c/strong\u003e.\u003c/p\u003e\u003cp id=\"a814\"\u003eThe main issue with this approach is that there’s no actual \u003cem\u003eexpertise \u003c/em\u003eon hand:\u003c/p\u003e\u003cul\u003e\u003cli id=\"2e6c\"\u003e\u003cstrong\u003equalified \u003c/strong\u003eto advise organisation leadership and the workforce on their legal and ethical responsibilities around content, e.g. web accessibility (you can’t rely on an AI summary)\u003c/li\u003e\u003cli id=\"8f8d\"\u003e\u003cstrong\u003eknowledgeable \u003c/strong\u003eenough to validate AI content — is the content actually good? Does it follow principles, guidelines and established best practices? How do you know without content specialists on hand?\u003c/li\u003e\u003cli id=\"6be8\"\u003e\u003cstrong\u003eskilled \u003c/strong\u003eenough to independently carry out things like user research, planning workshops, content creation and other design activities where AI assistance might not be available\u003c/li\u003e\u003cli id=\"f293\"\u003e\u003cstrong\u003eexperienced \u003c/strong\u003eenough to interact with users, engage stakeholders (including persuading, challenging and negotiating) or train and support colleagues on best practices in a real-world context.\u003c/li\u003e\u003c/ul\u003e\u003cfigure\u003e\u003cfigcaption\u003eContent designers need to advise stakeholders. Image: Author\u003c/figcaption\u003e\u003c/figure\u003e\u003cblockquote\u003e\u003cp id=\"d3e7\"\u003eIt’s entirely self-defeating if organisations decide a random employee with a AI subscription is a viable alternative to a content designer — or any skilled practitioner.\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"beed\"\u003eHow to solve this ‘AI problem’\u003c/h2\u003e\u003cp id=\"9af2\"\u003eWe can see that the real problem for content designers isn’t actually AI: it’s a \u003cem\u003emisperception \u003c/em\u003eof content design and why knowledgeable, skilled and experienced practitioners are needed.\u003c/p\u003e\u003cp id=\"4a5d\"\u003eBut that doesn’t make this someone else’s problem.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"6b6e\"\u003eThe responsibility for solving this issue goes both ways: you can’t expect everyone to recognise your value. You have to advocate for yourself.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"762a\"\u003eIt’s no good reassuring each other in our design echo chambers about how important we are. We need to \u003cem\u003econvince the people who decide \u003c/em\u003ewhether they need to hire content designers (and how many they need)\u003cem\u003e. \u003c/em\u003eWe need to:\u003c/p\u003e\u003cul\u003e\u003cli id=\"5f49\"\u003e\u003cstrong\u003eempathise \u003c/strong\u003e— that means listening, observing and understanding their perspective, pressures and awareness of content design\u003c/li\u003e\u003cli id=\"22f9\"\u003e\u003cstrong\u003ecommunicate \u003c/strong\u003eour process effectively — using their language, simplifying concepts and clearly visualising how it works (like the \u003ca href=\"https://medium.com/design-bootcamp/the-four-pillars-model-of-content-design-1b49364298b4\" rel=\"noopener\"\u003efour pillars model of content design\u003c/a\u003e)\u003c/li\u003e\u003cli id=\"2772\"\u003e\u003cstrong\u003edemonstrate \u003c/strong\u003ethe impact of content design — not only how it helps users but how it benefits the organisation (and individual stakeholders!)\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"4fa1\"\u003eIf you can’t quantify the positive impact of \u003cem\u003ehaving \u003c/em\u003econtent designers, focus on the negative impact of \u003cem\u003enot \u003c/em\u003ehaving them (or fewer of them), such as:\u003c/p\u003e\u003cul\u003e\u003cli id=\"bf6e\"\u003e\u003cstrong\u003enon-compliance with regulations\u003c/strong\u003e (e.g. website and mobile app accessibility), which would exclude disabled users and could possibly result in legal action and financial penalties\u003c/li\u003e\u003cli id=\"66b8\"\u003e\u003cstrong\u003enon-inclusive products and services\u003c/strong\u003e through lack of engagement and understanding of diverse user needs — failing communities but also corporate objectives around equality and social responsibility\u003c/li\u003e\u003cli id=\"5eb3\"\u003e\u003cstrong\u003euser experience getting worse \u003c/strong\u003eleading to lower conversions, decline in customer satisfaction and loyalty, increase in customer complaints and ultimately brand reputation damage.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"8603\"\u003eContent designer + AI = the future\u003c/h2\u003e\u003cp id=\"e1cd\"\u003eIf we make sure the right people understand we’re strategically important assets and not dispensable copy scribblers, we’ve got a future. And it \u003cem\u003ecould\u003c/em\u003e be a bright future, with AI helping us to become \u003ca href=\"https://uxwritinghub.com/ai-content-design/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003emore efficient, creative and ensure better UX\u003c/a\u003e.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eStrengths of content designers, AI and shared activities. Image: Author.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"57a5\"\u003eThat’s probably why more than \u003ca href=\"https://uxcontent.com/wp-content/uploads/2024/02/AI-in-Content-Design-Report-UX-Content-Collective.pdf\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e80% of content designers already use AI\u003c/a\u003e for day-to-day work, to assist them with activities like:\u003c/p\u003e\u003cul\u003e\u003cli id=\"103a\"\u003e\u003cstrong\u003euser research\u003c/strong\u003e, e.g. identifying themes and recommendations from user interview transcripts\u003c/li\u003e\u003cli id=\"67a1\"\u003e\u003cstrong\u003eideation \u003c/strong\u003eand\u003cstrong\u003e drafting content\u003c/strong\u003e (which content designers can then edit to ensure it’s fit for purpose in context)\u003c/li\u003e\u003cli id=\"a939\"\u003e\u003cstrong\u003eproducing resources \u003c/strong\u003elike guidelines, templates and presentations as internal assets to embed good practices\u003c/li\u003e\u003cli id=\"3c56\"\u003e\u003cstrong\u003ecustomising AI assistants\u003c/strong\u003e based on our own specific content guidelines as a supporting tool.\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"cafd\"\u003eThere’s also the generic day-to-day office admin which AI can reduce drastically, e.g. summarising meetings and email threads, or drafting boring reports and other documentation.\u003c/p\u003e\u003cp id=\"2109\"\u003eWhile few content designers have never used AI tools, getting the most out of them will make you a better practitioner — and give you an \u003cem\u003eemployability advantage\u003c/em\u003e over those using AI rarely or haphazardly.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eAI assistance is a powerful content design resource. Image: Author\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"9e62\"\u003eIt’s an encouraging vision, the AI-empowered content designer.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"c327\"\u003eBut remember: this positive future isn’t guaranteed. It won’t just happen organically. We need to play our part to manifest it.\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"4c30\"\u003eThe far future of content design\u003c/h2\u003e\u003cp id=\"8a7f\"\u003eOkay, so if we adapt to AI \u003cem\u003eand \u003c/em\u003eadvocate for our profession the short-to-medium term future could be bright.\u003c/p\u003e\u003cp id=\"5440\"\u003eBut what about the \u003cem\u003elong\u003c/em\u003e-term future? Is there any scenario where AI \u003cem\u003ecould \u003c/em\u003eactually make content designers obsolete?\u003c/p\u003e\u003cp id=\"3fdf\"\u003ePotentially, yes.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"23c4\"\u003eThere’s a plausible hypothetical future where artificial general intelligence (AGI) could replace human content designers.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"c733\"\u003eDefinitions of AGI vary and there’s no consensus among experts over when it’ll arrive, or whether it’s even possible. But in a nutshell: AGI is a type of super-advanced AI that’s \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S295016282300005X\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ecapable of performing any intellectual task that humans can do\u003c/a\u003e — including operating autonomously to solve complex problems across different environments.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"01c1\"\u003e\u003cstrong\u003e\u003cem\u003eExample: \u003c/em\u003e\u003c/strong\u003e\u003cem\u003eYou task an AGI to improve your website. It then creates its own sub-goals, plans and tasks, then carries them out and reports back. This would involve actually interacting with people in the real world, adapting and operating across different technologies and systems to achieve its objectives — all independently and self-governed.\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"79dd\"\u003eThis kind of proactive AI agent would be an entirely different proposition. It may not be sentient, but it would be \u003cem\u003emore \u003c/em\u003ethan a tool. It may even be capable of understanding local, contextual situations comparable to a human. How? Well, the idea with AGI is that \u003cstrong\u003eintelligence is a rock face, not a ladder, \u003c/strong\u003eand that\u003cstrong\u003e \u003c/strong\u003ehumans and AI will take different routes to reach the summit (see below).\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003e100% non-scientific model of intelligence. Image: Author\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"4426\"\u003eWould this futuristic AGI be accepted over a human designer \u003cem\u003eusing\u003c/em\u003e AI? Would users accept an AI researcher? Would stakeholders and employees accept AI colleagues? The answer to these questions might be ‘no’, but then again the AGI might also be \u003cem\u003eso \u003c/em\u003egood that there’s just no rational (financial) justification for organisations to employ humans.\u003c/p\u003e\u003cp id=\"ac95\"\u003eIt’s an unnerving thought.\u003c/p\u003e\u003cp id=\"8ef5\"\u003eBut we’re probably looking so far ahead into an unknowable future there’s no point worrying about it. All we can do is stay up to date, adopt AI into our work and be adaptable.\u003c/p\u003e\u003cp id=\"9f67\"\u003eThe rest is out of our control.\u003c/p\u003e\u003ch2 id=\"de1e\"\u003eSummary\u003c/h2\u003e\u003cp id=\"62ba\"\u003eThis is how I see the state of things, what we need to do and where things could be headed:\u003c/p\u003e\u003cul\u003e\u003cli id=\"f7c4\"\u003eAI is powerful, impressive and useful. It’s a game-changer. But it’s \u003cstrong\u003enot a replacement\u003c/strong\u003e for human content designers. For all its knowledge and skills, it’s still a tool that lacks context, real-world agency and can’t operate autonomously, pro-actively or across complex environments.\u003c/li\u003e\u003cli id=\"01aa\"\u003eThe \u003cstrong\u003ereal threat\u003c/strong\u003e is organisations thinking they don’t need as \u003cem\u003emany \u003c/em\u003econtent designers, or that they can \u003cem\u003ereplace \u003c/em\u003eus with non-specialists relying on AI for everything a content designer would do. This is flawed thinking that will negatively impact users, businesses and stakeholders.\u003c/li\u003e\u003cli id=\"7c97\"\u003eAs content designers, we need to \u003cstrong\u003eadvocate for ourselves. \u003c/strong\u003eWe need to continually make the positive case for content design specialists through empathy, clear communication and demonstrating tangible benefits of our work (or what’ll happen \u003cem\u003ewithout \u003c/em\u003econtent designers)\u003c/li\u003e\u003cli id=\"10e5\"\u003eContent designers who \u003cstrong\u003eleverage AI for everyday work\u003c/strong\u003e — both design specific and generic admin — will be more effective, efficient and \u003cem\u003eemployable \u003c/em\u003eover designers who refuse to engage with it; AI-assisted content designers will seem super-powered by comparison.\u003c/li\u003e\u003cli id=\"3cbd\"\u003eThere’s a \u003cstrong\u003e\u003cem\u003ehypothetical \u003c/em\u003efuture\u003c/strong\u003e where AI becomes so advanced there genuinely won’t be a need to employ human content designers, or it simply won’t make financially sense. Either way, it doesn’t make any sense expending time or energy worrying about this. For now.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"4039\"\u003eFurther reading\u003c/h2\u003e\u003cp id=\"5a13\"\u003eDaugherty, P.R. and Wilson, H.J. (2024) \u003cem\u003eHuman + machine, updated and expanded: reimagining work in the age of AI\u003c/em\u003e. Harvard Business Press.\u003c/p\u003e\u003cp id=\"8c11\"\u003eEng, P. H. and Liu, R.L. (2024) ‘Will intelligent technologies replace humans in the future? An exploratory study for likelihood of intelligent technologies to replace humans in the future’, in \u003cem\u003eStudies in Computational Intelligence\u003c/em\u003e, pp. 171–202. Available at: \u003ca href=\"https://link.springer.com/chapter/10.1007/978-3-031-61463-7_9\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://link.springer.com/chapter/10.1007/978-3-031-61463-7_9\u003c/a\u003e\u003c/p\u003e\u003cp id=\"6fb9\"\u003eFarhan, A. (2023) ‘The impact of artificial intelligence on human workers’, \u003cem\u003eJournal of Communication Education\u003c/em\u003e, 17(2). Available at: \u003ca href=\"https://jurnal.unipem.ac.id/index.php/joce-ip/article/view/350\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://jurnal.unipem.ac.id/index.php/joce-ip/article/view/350\u003c/a\u003e\u003c/p\u003e\u003cp id=\"01cc\"\u003eGeorge, A. S. (2024) ‘Automated futures: examining the promise and peril of AI on jobs, productivity, and work-life balance’, \u003cem\u003ePartners Universal Innovative Research Publication\u003c/em\u003e. Available at: \u003ca href=\"https://zenodo.org/records/14544519\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://zenodo.org/records/14544519\u003c/a\u003e\u003c/p\u003e\u003cp id=\"6700\"\u003eMontgomery, B. (2025) \u003cem\u003eWill AI wipe out the first rung of the career ladder? \u003c/em\u003eAvailable at: \u003ca href=\"https://www.theguardian.com/global/2025/jun/02/artificial-intelligence-jobs-techscape\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.theguardian.com/global/2025/jun/02/artificial-intelligence-jobs-techscape\u003c/a\u003e\u003c/p\u003e\u003cp id=\"e31b\"\u003eMorandini, S., et al. (2023) ‘The impact of artificial intelligence on workers’ skills: upskilling and reskilling in organisations’, \u003cem\u003eInforming Science the International Journal of an Emerging Transdiscipline\u003c/em\u003e, 26, pp. 39–68. Available at: \u003ca href=\"https://doi.org/10.28945/5078\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://doi.org/10.28945/5078\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-06-16T11:44:24.755Z",
  "modifiedTime": null
}
