{
  "id": "a8986f55-2ca0-42fc-ae66-1ee35552a502",
  "title": "Icon Usability: When and How to Evaluate Digital Icons",
  "link": "https://www.nngroup.com/articles/how-to-test-digital-icons/",
  "description": "Effective icons depend on recognizability and interpretation. Evaluate them with methods appropriate for your specific research questions",
  "author": "Kate Kaplan",
  "published": "Fri, 04 Oct 2024 17:00:00 +0000",
  "source": "https://www.nngroup.com/feed/rss/",
  "categories": [
    "Article"
  ],
  "byline": "Kate Kaplan",
  "length": 10050,
  "excerpt": "Effective icons depend on recognizability and interpretation. Evaluate them with methods appropriate for your specific research questions",
  "siteName": "Nielsen Norman Group",
  "favicon": "",
  "text": "Summary:  Effective icons depend on recognizability and interpretation. Evaluate them with methods appropriate for your specific research questions Icon Usability Icon Recognizability Icon Interpretation Other Factors Influencing Icon Usability Choosing Methods for Icon Evaluation Learn More in The Book: Digital Icons That Work Icon Usability Effective icons can increase usability by helping users understand and interpret available functionality. However, when poorly implemented, they harm usability and introduce confusion. In Digital Icons That Work, I emphasize the importance of two variables that affect overall icon usability: icon recognizability and icon interpretation.  Icon recognizability is concerned with whether people can identify the shape or symbol that the icon depicts.  (Does the star look like a star?) Icon interpretation is concerned with the meaning that users assign to the icon’s shape or symbol within a given context. (What does the star indicate in this particular interface?) Icon Recognizability When it comes to recognizability, you don’t have to look far to find icons that use complicated, overly detailed symbols and shapes that are difficult to decipher. But even seemingly simple shapes are often difficult for users to recognize. In fact, it might surprise you how often users struggle to recognize icons depicting simple, everyday objects. Consider the following icons. If you had to guess, what would you say they are? Don’t try to predict the action or idea they represent; just take a guess at what physical object is depicted. (Guess before scrolling down for the answers!) When we showed users these icons without labels, but within the context of the interface where they were used, recognition of these simple shapes varied greatly! #1 #2 #3 #4 Ribbon or keyhole? The website for Ramp, a financial platform, used a ribbon to represent rewards, but some users thought it was as a keyhole. Shopping bag or briefcase? The Outnet’s ecommerce mobile application used this icon to represent a shopping bag, but some users thought it was a briefcase for storing files. Shopping bag, lock, or clipboard? The YouTube mobile application used this icon to  represent a shopping bag, but some users saw either a clipboard or a padlock. Menu or document? The Saks Fifth Avenue mobile application used this icon to represent a navigation menu, but it was recognized as a document (e.g., a shopping list, record of past orders, or privacy statement) by many users. Achieving high icon recognizability is the first step in making your icons usable. As one study participant trying to deduce an icon’s shape wisely complained: “I’m not sure what that icon is, and when you are unsure of what the icon looks like, you are unsure of the meaning behind it!” Well said! Understanding the intended message behind an icon is often difficult enough. That challenge escalates to near impossible when the shape is cryptic or unidentifiable. Icon Interpretation Icon interpretation is the second, sometimes even trickier part of the equation. (Remember, icon interpretation is concerned with the meaning that users attribute to the icon.) Part of what makes icon interpretation a challenge is that recognition and interpretation do not always go hand in hand. Even when an icon is recognized as intended, it can be interpreted in a way that was not intended. In other words, even when people accurately identify the depicted object or idea, they might not be able to accurately predict the action or function that the icon represents. For example, in one of our studies, four applications used some version of a storefront icon to represent various actions. Find a physical store Nordstrom mobile app Find a physical store Sephora mobile app View and search vendors Ramp website View shopping categories (menu) DSW mobile app While almost all users recognized each of these variations as a storefront, interpretations varied greatly. When asked what the icons would do (without showing them the icon label, if there was one), users predicted a variety of functionalities: going to the homepage (perhaps because of the icon’s similarity with a typical home icon), viewing a list of store locations, finding the nearest physical store, accessing in-store deals, or even viewing other related retailers and brands. Why is it so difficult to communicate a simple idea? Are users daft? No, of course not! Nor are they being exceedingly difficult. It’s just that even considerably targeted user populations have great diversity of ages, lived experiences, experience levels with any given domain, cultural backgrounds, educational backgrounds, socioeconomic status, geographic locations, or accessibility needs. All these factors (and more) influence how people interpret meaning. Because of all these complications, it’s critical to test your icons for both recognition and interpretation early in the design process. Don’t assume that simple objects will always be easily recognized, and don’t take for granted that, even when users can recognize an object, they’ll correctly interpret the intended idea, action, or meaning behind it. Other Factors Influencing Icon Usability In addition to interpretation and recognizability, a few other factors affect the usability of icons in a user interface and should be evaluated in user testing. They include: Relevance: How applicable does the icon appear to be for the task at hand or the goal the user wants to achieve? Findability: Can people find the icon on the page when they are looking for it?  Discoverability: Is the icon salient and noticeable enough for people to discover it in the interface? Tappability or clickability: Is the icon large enough to tap or click? Or, is it prone to target-acquisition errors? Visual appeal: Does the icon look good? All these attributes are important and work in concert to achieve high icon usability. Choosing Methods for Icon Evaluation Choosing the most appropriate method begins with formulating clear research questions. Before doing any testing, establish clear research goals and questions. Then, align those questions to the methods best suited to answer them. Icon-testing methods can be separated into two main categories: out-of-context and in-context testing, depending on whether the icon is shown to the user in isolation or in the context of the actual interface. Here’s an example of how we might align specific research questions about the attributes above to various methods across the design process. Imagine that you work on an ecommerce mobile website, and you need to feature a direct pathway to new products in the home-screen navigation. You’ve designed this icon, hoping that the timer depicted is a good visual metaphor for recency and just-in products. Here’s how you might address some sample research questions related to this icon. Research Question Related Attribute How to Evaluate When Does this icon look like a timer to users? Recognition Out-of-context recognition surveys: Show the icon to people in isolation, without a text label, and ask them what it is or represents. In-context screenshot testing: Show users a screenshot of the interface and ask them to describe any icons they see and what they think those icons do or represent in the context of the interface.  Early in the design process Do users understand and associate the timer with just-in products? Interpretation Out-of-context surveys: Show the icon to users in isolation and ask them to describe what the icon would do if they saw it within the context of an ecommerce website. In context of the interface (even if in a screenshot or static mockup): Ask users to describe any icons they notice and predict their functions while referencing the interface. Early in the design process or as soon as you have your first interface mockups Do users like how the icon looks? Visual appeal Out-of-context rating: Show the icons to users in isolation and ask them to rate attractiveness (or other attributes) using semantic differential or Likert scales. Out-of-context preference testing: Show users different versions of the same icon (with alternate visual styles) to understand which one they prefer.   Early in the design process or in a redesign Does the icon appear applicable to people looking for new products on the website? Relevance In-context usability testing: Provide users with a task related to finding a newly arrived product, and observe them interact with the interface: Do they use the icon? In-context A/B testing: Show users variations corresponding to different icon options. Once you have a prototype or a working interface or after the design has been launched Do users notice the icon in the interface? Can they find the icon in the interface when searching for new products? Discoverability Findability In-context usability testing or click tests: If users do not interact with icons or take too long to interact with them, they may not be noticeable. Once you have a prototype or a working interface or after the design has been launched Can users easily tap the icon without errors? Target acquisition In-context usability testing: Provide users with icon-related tasks and observe how easily they can tap the icon reliably, without accidentally selecting another nearby target. (In addition, follow general guidelines for touch-target sizes.) Once you have a prototype or a working interface or after the design has been launched Learn More in The Book: Digital Icons That Work If you enjoyed this discussion and want to deepen your understanding of icon design, Digital Icons That Work offers a wealth of icon-design guidelines based on my recent icon research. To explore more research insights and discover strategies to create effective iconography that enhances UX, get your copy here.",
  "image": "https://media.nngroup.com/media/articles/opengraph_images/Icon-Usability_Opengraph.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cspan\u003e\n                  Summary: \n                \u003c/span\u003eEffective icons depend on recognizability and interpretation. Evaluate them with methods appropriate for your specific research questions\n            \u003c/p\u003e\u003cdiv\u003e\n                \u003cdiv\u003e\n\n\u003cul\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-icon-usability-1\"\u003eIcon Usability\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-icon-recognizability-2\"\u003eIcon Recognizability\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-icon-interpretation-3\"\u003eIcon Interpretation\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-other-factors-influencing-icon-usability-4\"\u003eOther Factors Influencing Icon Usability\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-choosing-methods-for-icon-evaluation-5\"\u003eChoosing Methods for Icon Evaluation\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-learn-more-in-the-book-digital-icons-that-work-6\"\u003eLearn More in The Book: Digital Icons That Work\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003ch2 id=\"toc-icon-usability-1\"\u003eIcon Usability\u003c/h2\u003e\n\u003cp\u003eEffective icons can increase usability by helping users understand and interpret available functionality. However, when poorly implemented, they harm usability and introduce confusion.\u003c/p\u003e\n\u003cp\u003eIn \u003cem\u003eDigital Icons That Work\u003c/em\u003e, I emphasize the importance of two variables that affect overall icon usability: icon recognizability and icon interpretation.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e \u003c/em\u003e\u003cstrong\u003eIcon recognizability\u003c/strong\u003e is concerned with whether people can identify the shape or symbol that the icon depicts.  (Does the star look like a star?)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIcon interpretation\u003c/strong\u003e is concerned with the meaning that users assign to the icon’s shape or symbol within a given context. (What does the star indicate in this particular interface?)\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"A graphic titled \u0026#34;Icon Usability\u0026#34; compares two aspects: Icon Recognizability and Icon Interpretation. The left half, labeled \u0026#34;Icon Recognizability,\u0026#34; explains that it is concerned with whether people can identify the icon shape. Supporting text asks, \u0026#34;Is the shape recognizable as sparkles?\u0026#34; and \u0026#34;Do users see different forms?\u0026#34; The right half, labeled \u0026#34;Icon Interpretation,\u0026#34; focuses on the meaning users assign to the icon shape in a given context. Supporting text asks, \u0026#34;What does the sparkles icon indicate to users?\u0026#34; and \u0026#34;Is that the intended meaning?\u0026#34; At the center, there is a simple icon of two sparkles.\" height=\"2302\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/icon-usability_recognizability_vs_interpretation.jpg\" width=\"4110\"/\u003e\u003c/p\u003e\n\u003ch2 id=\"toc-icon-recognizability-2\"\u003eIcon Recognizability\u003c/h2\u003e\n\u003cp\u003eWhen it comes to recognizability, you don’t have to look far to find icons that use complicated, overly detailed symbols and shapes that are difficult to decipher. But even seemingly simple shapes are often difficult for users to recognize. In fact, it might surprise you how often users struggle to recognize icons depicting simple, everyday objects.\u003c/p\u003e\n\u003cp\u003eConsider the following icons. If you had to guess, what would you say they are? Don’t try to predict the action or idea they represent; just take a guess at what physical object is depicted.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e(Guess before scrolling down for the answers!)\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eWhen we showed users these icons without labels, but within the context of the interface where they were used, recognition of these simple shapes varied greatly!\u003c/p\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003e#1\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003e#2\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003e#3\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003e#4\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A simple gray ribbon or award badge icon on a light gray background. The design features a circle with two downward-pointing ribbon-like points at the bottom.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/1_ramp_ribbon_rewards_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A black-filled shopping bag icon with a single handle at the top. The bag has a rectangular, trapezoidal shape, wider at the bottom and narrowing slightly toward the top. \" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/2_outnet_shoppingbag_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A black-outlined shopping bag icon. The icon features two curved handles, one on the top of the bag curving upwards and the other in the center of the bag, curving downwards.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/youtube_shoppingbag_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A gray-outlined menu icon on a black background. The icon resembles a rectangular sheet with rounded corners, featuring three horizontal lines centered within.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/saksfifthavenue_menu_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eRibbon or keyhole?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe website for Ramp, a financial platform, used a ribbon to represent rewards, but some users thought it was as a keyhole.\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eShopping bag or briefcase?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Outnet’s ecommerce mobile application used this icon to represent a shopping bag, but some users thought it was a briefcase for storing files.\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eShopping bag, lock, or clipboard?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe YouTube mobile application used this icon to  represent a shopping bag, but some users saw either a clipboard or a padlock.\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eMenu or document?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Saks Fifth Avenue mobile application used this icon to represent a \u003ca href=\"https://www.nngroup.com/articles/hamburger-menus/\"\u003enavigation menu\u003c/a\u003e, but it was recognized as a document (e.g., a shopping list, record of past orders, or privacy statement) by many users.\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003cp\u003e\u003cstrong\u003eAchieving high icon recognizability is the first step in making your icons usable\u003c/strong\u003e. As one study participant trying to deduce an icon’s shape wisely complained:\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e“I’m not sure what that icon is, and when you are unsure of what the icon looks like, you are unsure of the meaning behind it!” \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWell said! Understanding the intended message behind an icon is often difficult enough. That challenge escalates to near impossible when the shape is cryptic or unidentifiable.\u003c/p\u003e\n\u003ch2 id=\"toc-icon-interpretation-3\"\u003eIcon Interpretation\u003c/h2\u003e\n\u003cp\u003eIcon interpretation is the second, sometimes even trickier part of the equation. (Remember, icon interpretation is concerned with the meaning that users attribute to the icon.) Part of what makes icon interpretation a challenge is that recognition and interpretation do not always go hand in hand. Even when an icon is recognized as intended, it can be interpreted in a way that was not intended.\u003c/p\u003e\n\u003cp\u003eIn other words, even when people accurately identify the depicted object or idea, they might not be able to accurately predict the action or function that the icon represents.\u003c/p\u003e\n\u003cp\u003eFor example, in one of our studies, four applications used some version of a storefront icon to represent various actions.\u003c/p\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A gray-outlined storefront icon on a light gray background, representing a building. The building has a central rectangular shape with two smaller rectangular sections on each side, resembling additional structures. In the center of the main building is the letter \u0026#39;N\u0026#39; above two smaller rectangles that represent doors.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/nordstrom_storefront_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A gray-outlined storefront icon on a light gray background, representing a building. The design shows a rectangular structure with three horizontal lines at the top, resembling an awning or signage. Below the lines are two rectangles symbolizing doors.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/sephora_storefront_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A gray-outlined storefront icon on a light gray background, representing a building. The icon shows a small building with a rounded top and a curved awning over the entrance. Below the awning is a rectangular door in the center, giving the appearance of a small shop or market.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/ramp_storefront_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A gray-outlined storefront icon on a light gray background, featuring a rectangular building with a striped awning at the top. The awning has alternating vertical lines, giving the appearance of a shaded covering over the store entrance.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/dsw_storefront_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eFind a physical store\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNordstrom mobile app\u003c/em\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eFind a physical store\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSephora mobile app\u003c/em\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eView and search vendors \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRamp website\u003c/em\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eView shopping categories (menu)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDSW mobile app\u003c/em\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003cp\u003eWhile almost all users recognized each of these variations as a storefront, interpretations varied greatly. When asked what the icons would do (without showing them the icon label, if there was one), users predicted a variety of functionalities: going to the homepage (perhaps because of the icon’s similarity with a typical home icon), viewing a list of store locations, finding the nearest physical store, accessing in-store deals, or even viewing other related retailers and brands.\u003c/p\u003e\n\u003cp\u003eWhy is it so difficult to communicate a simple idea? Are users daft? No, of course not! Nor are they being exceedingly difficult. It’s just that even considerably targeted user populations have great diversity of ages, lived experiences, experience levels with any given domain, cultural backgrounds, educational backgrounds, socioeconomic status, geographic locations, or accessibility needs. All these factors (and more) influence how people interpret meaning.\u003c/p\u003e\n\u003cp\u003eBecause of all these complications, it’s critical to \u003cstrong\u003etest your icons for both recognition and interpretation early i\u003c/strong\u003en the design process. Don’t assume that simple objects will always be easily recognized, and don’t take for granted that, even when users can recognize an object, they’ll correctly interpret the intended idea, action, or meaning behind it.\u003c/p\u003e\n\u003ch2 id=\"toc-other-factors-influencing-icon-usability-4\"\u003eOther Factors Influencing Icon Usability\u003c/h2\u003e\n\u003cp\u003eIn addition to interpretation and recognizability, a few other factors affect the usability of icons in a user interface and should be evaluated in \u003ca href=\"https://www.nngroup.com/articles/icon-testing/\"\u003euser testing\u003c/a\u003e. They include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eRelevance:\u003c/strong\u003e How applicable does the icon appear to be for the task at hand or the goal the user wants to achieve?\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eFindability:\u003c/strong\u003e Can people find the icon on the page when they are looking for it? \u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDiscoverability:\u003c/strong\u003e Is the icon salient and noticeable enough for people to discover it in the interface?\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eTappability or clickability:\u003c/strong\u003e Is the icon \u003ca href=\"https://www.nngroup.com/articles/touch-target-size/\"\u003elarge enough to tap or click\u003c/a\u003e? Or, is it prone to target-acquisition errors?\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eVisual appeal:\u003c/strong\u003e Does the icon look good?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAll these attributes are important and work in concert to achieve high icon usability.\u003c/p\u003e\n\u003ch2 id=\"toc-choosing-methods-for-icon-evaluation-5\"\u003eChoosing Methods for Icon Evaluation\u003c/h2\u003e\n\u003cp\u003eChoosing the most appropriate method begins with formulating clear research questions. Before doing any testing, establish clear research goals and questions. Then, align those questions to the methods best suited to answer them.\u003c/p\u003e\n\u003cp\u003eIcon-testing methods can be separated into two main categories: \u003cstrong\u003eout-of-context\u003c/strong\u003e and\u003cstrong\u003e in-context testing\u003c/strong\u003e, depending on whether the icon is shown to the user in isolation or in the context of the actual interface.\u003c/p\u003e\n\u003cp\u003eHere’s an example of how we might align specific research questions about the attributes above to various methods across the design process.\u003c/p\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cimg alt=\"A simple gray stopwatch icon on a black background. The stopwatch has a round shape with a single hand pointing at an angle, and a small button at the top and side, representing the start or stop mechanism.\" height=\"100\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/10/02/timer_icon.png\" width=\"100\"/\u003e\u003c/p\u003e\n\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eImagine that you work on an ecommerce mobile website, and you need to feature a direct pathway to new products in the home-screen navigation. You’ve designed this icon, hoping that the timer depicted is a good visual metaphor for recency and just-in products.\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003cp\u003eHere’s how you might address some sample research questions related to this icon.\u003c/p\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eResearch Question\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eRelated Attribute\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eHow to Evaluate\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eWhen\u003c/strong\u003e\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003eDoes this icon look like a timer to users?\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eRecognition\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eOut-of-context\u003c/strong\u003e recognition \u003ca href=\"https://www.nngroup.com/articles/surveys-design-cycle/\"\u003esurveys\u003c/a\u003e: Show the icon to people in isolation, without a text label, and ask them what it is or represents.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIn-context\u003c/strong\u003e screenshot testing: Show users a screenshot of the interface and ask them to describe any icons they see and what they think those icons do or represent in the context of the interface. \u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eEarly in the design process\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003eDo users understand and associate the timer with just-in products?\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eInterpretation\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eOut-of-context \u003c/strong\u003esurveys: Show the icon to users in isolation and ask them to describe what the icon would do if they saw it within the context of an ecommerce website.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIn context\u003c/strong\u003e of the interface (even if in a screenshot or static mockup): Ask users to describe any icons they notice and predict their functions while referencing the interface.\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eEarly in the design process or as soon as you have your first interface mockups\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003eDo users like how the icon looks?\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eVisual appeal\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eOut-of-context\u003c/strong\u003e rating: Show the icons to users in isolation and ask them to rate attractiveness (or other attributes) using \u003ca href=\"https://www.nngroup.com/articles/rating-scales/\"\u003esemantic differential or Likert scales\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOut-of-context\u003c/strong\u003e preference testing: Show users different versions of the same icon (with alternate visual styles) to understand which one they prefer.  \u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eEarly in the design process or in a redesign\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003eDoes the icon appear applicable to people looking for new products on the website?\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eRelevance\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003e\u003cstrong\u003eIn-context\u003c/strong\u003e \u003ca href=\"https://www.nngroup.com/articles/usability-testing-101/\"\u003eusability testing\u003c/a\u003e: Provide users with a task related to finding a newly arrived product, and observe them interact with the interface: Do they use the icon?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIn-context\u003c/strong\u003e \u003ca href=\"https://www.nngroup.com/articles/ab-testing/\"\u003eA/B testing\u003c/a\u003e: Show users variations corresponding to different icon options.\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eOnce you have a prototype or a working interface or after the design has been launched\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003eDo users notice the icon in the interface?\u003c/p\u003e\n\u003cp\u003eCan they find the icon in the interface when searching for new products?\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eDiscoverability\u003c/p\u003e\n\u003cp\u003eFindability\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eIn\u003cstrong\u003e-context\u003c/strong\u003e usability testing or click tests: If users do not interact with icons or take too long to interact with them, they may not be noticeable.\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eOnce you have a prototype or a working interface or after the design has been launched\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\n\u003cp\u003eCan users easily tap the icon without errors?\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eTarget acquisition\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eIn\u003cstrong\u003e-context\u003c/strong\u003e usability testing: Provide users with icon-related tasks and observe how easily they can tap the icon reliably, without accidentally selecting another nearby target. (In addition, follow general guidelines for \u003ca href=\"https://www.nngroup.com/articles/touch-target-size/\"\u003etouch-target sizes\u003c/a\u003e.)\u003c/p\u003e\n\u003c/td\u003e\n\u003ctd\u003e\n\u003cp\u003eOnce you have a prototype or a working interface or after the design has been launched\u003c/p\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003ch2 id=\"toc-learn-more-in-the-book-digital-icons-that-work-6\"\u003eLearn More in The Book: Digital Icons That Work\u003c/h2\u003e\n\u003cp\u003eIf you enjoyed this discussion and want to deepen your understanding of icon design, \u003ca href=\"https://www.amazon.com/Digital-Icons-That-Work-Comprehensive/dp/B0DFBLZ728/\"\u003e\u003cem\u003eDigital Icons That Work\u003c/em\u003e\u003c/a\u003e offers a wealth of icon-design guidelines based on my recent icon research.\u003c/p\u003e\n\u003cp\u003eTo explore more research insights and discover strategies to create effective iconography that enhances UX, \u003ca href=\"https://www.amazon.com/Digital-Icons-That-Work-Comprehensive/dp/B0DFBLZ728/\"\u003eget your copy here\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/Digital-Icons-That-Work-Comprehensive/dp/B0DFBLZ728/\"\u003e\u003cimg alt=\"An advertisement for a book titled \u0026#39;Digital Icons That Work\u0026#39; by Kate Kaplan, published by Nielsen Norman Group. The cover of the book is red with a variety of minimalistic icon designs. To the right of the book cover, the text reads: \u0026#39;The Ultimate Guide to Transformative Iconography for Digital Interfaces.\u0026#39; Below, it says \u0026#39;Published by Nielsen Norman Group, world leaders in research-based user experience.\u0026#39;\" height=\"623\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/08/28/digital_icons_that_work_nng_press_book_banner.jpg\" width=\"2000\"/\u003e\u003c/a\u003e\u003c/p\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-10-04T17:00:00Z",
  "modifiedTime": null
}
