[
  {
    "id": "6be8c8d2-bcd1-4f96-be89-cb69c5692474",
    "title": "Fortezza da Basso, Florence",
    "link": "https://www.thesartorialist.com/the-fortezza-florence-10/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 18:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Boots",
      "Dresses",
      "Florence",
      "Sunglasses"
    ]
  },
  {
    "id": "c3a562ab-e7ea-4963-8574-8c8f20ec0f7d",
    "title": "East Village, New York",
    "link": "https://www.thesartorialist.com/east-village-friday-new-york/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 14:00:39 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Black",
      "New York",
      "Shorts"
    ]
  },
  {
    "id": "e81c598c-339b-44d2-b32f-61738ff3dea5",
    "title": "Creating depth and drama with moody photography",
    "link": "https://iso.500px.com/creating-depth-and-drama-with-moody-photography/",
    "description": "Moody photography is a trend that captivates audiences, using rich shadows, dramatic lighting, and subdued tones to evoke emotion and tell powerful stories. The post Creating depth and drama with moody photography appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 16 Jan 2025 12:30:21 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2024/12/The-Dancer-By-David-Martín-Castan-2.jpeg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "compelling narratives",
      "composition",
      "depth",
      "emotion",
      "lighting",
      "Moody photography",
      "photo trends",
      "scenes",
      "storytelling",
      "tonal balance"
    ]
  },
  {
    "id": "142c7532-0589-4780-a519-fcb3d56af84d",
    "title": "Transforming ordinary scenes with vibrant colors",
    "link": "https://iso.500px.com/transforming-ordinary-scenes-with-vibrant-colors/",
    "description": "Bold and bright color photography is a trend that continues to captivate audiences with its ability to transform ordinary scenes into vibrant works of art. The post Transforming ordinary scenes with vibrant colors appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 09 Jan 2025 12:30:30 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2024/12/Red-Umbrella.jpeg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Featured",
      "Home Feed",
      "Bold and bright photography",
      "bright colors",
      "composition",
      "contrast",
      "creativity",
      "embrace the vibrancy",
      "extraordinary scenes",
      "light",
      "making a statement",
      "vivid"
    ]
  },
  {
    "id": "334a6dc1-22f9-40f9-be50-f3cc465128ea",
    "title": "Globe staff photos of the month, February 2020",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/04/globe-staff-photos-month-february/CDiztYMhad5stG0VBAvsjJ/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Here’s a look at some of the best images taken by Globe photographers last month: the New Hamphire primary, Ash Wednesday, living with progeria, the Beanpot Tournament, and Red Sox spring training.",
    "author": "",
    "published": "Wed, 04 Mar 2020 22:19:03 +0000",
    "image": "https://www.bostonglobe.com/resizer/v2/32PTLQSKVUI6VDICL5JAZBREOM.jpg?auth=32b6cce7791266809f447408c2a463dbacf449ce998434cdf179a6e6e3c05d5d\u0026smart=true\u0026width=3048\u0026height=2108",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "46031626-ae57-4819-9b81-f59988322df0",
    "title": "Life during the coronavirus pandemic",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/30/life-during-coronavirus-pandemic/wOmubnlrYaN8m2epe1FAHO/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Globe staff photographers document the Boston area and beyond during this unprecented time. The gallery is updated weekly throughout the crisis.",
    "author": "",
    "published": "Mon, 30 Mar 2020 22:49:52 +0000",
    "image": "https://www.bostonglobe.com/resizer/v2/A27O6IULEUI6VL32SQ7K27FODM.jpg?auth=fb7704ff9d568394fa7fb75960a3b3d08935641b422af48f2422539d95eeaed9\u0026smart=true\u0026width=5472\u0026height=3648",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "cec8976f-677b-4fe8-8c5d-df5744b4aa21",
    "title": "Canon Inc. Places in Top-10 in U.S. Patent Rankings for 41st Straight Year, Ranks First for U.S. patents granted among Japanese companies for 20th Consecutive Time",
    "link": "https://www.canonrumors.com/canon-inc-places-in-top-10-in-u-s-patent-rankings-for-41st-straight-year-ranks-first-for-u-s-patents-granted-among-japanese-companies-for-20th-consecutive-time/",
    "description": "In 2024, Canon ranked ninth in the number of patents registered in the United States Patent and Trademark Office (USPTO), placing it in the world’s top 10 for 41 consecutive years, according to IFI CLAIMS Patent Services, a US-based patent research firm. Moreover, Canon ranked first among Japanese companies for the 20th consecutive year. Canon emphasizes [...] The post Canon Inc. Places in Top-10 in U.S. Patent Rankings for 41st Straight Year, Ranks First for U.S. patents granted among Japanese companies for 20th Consecutive Time appeared first on Canon Rumors.",
    "author": "Craig",
    "published": "Mon, 20 Jan 2025 13:07:05 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Canon Business General",
      "canon",
      "patents"
    ]
  },
  {
    "id": "2ba44b86-7f77-4e7e-9a31-79f74c3c9880",
    "title": "BCN Awards 2025: Sony and Nikon make Significant Gains in Japan",
    "link": "https://www.canonrumors.com/bcn-awards-2025-sony-and-nikon-make-significant-gains/",
    "description": "BCN has released its awards for the year 2024. They call the awards “2025” even though the data is from January 1st, 2024 through December 31st, 2024. Don’t ask me why – I don’t run the company. As you may not be aware, BCN collects sales data from around 60% of all retailers in Japan, [...] The post BCN Awards 2025: Sony and Nikon make Significant Gains in Japan appeared first on Canon Rumors.",
    "author": "Richard",
    "published": "Mon, 20 Jan 2025 09:55:27 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Industry News",
      "BCN",
      "industry news",
      "spotlight"
    ]
  },
  {
    "id": "8969a039-841a-45f0-9d42-4c88930d5a8c",
    "title": "Delta Makes the Difference",
    "link": "https://lightroomkillertips.com/delta-makes-the-difference/",
    "description": "By Larry Tiefenbrunn, MD CEO and inventor, Platypod Pro LLC  Don’t get me wrong. I absolutely love tripods. I personally own about a half a dozen of them of all different brands. I use them for studio work, group portraiture, even some product shots.   However, when I’m out and about, the last thing I want to do is carry around unnecessarily heavy equipment. And I certainly don’t want to be told by security guards (#TripodPolice) that I can’t use a tripod to take long exposures for whatever reasons they conjure up. A compact flat tripod that slips into my camera bag, that doesn’t take up the space of a telephoto lens, is why I invented the very first Platypod, and that is why I have dedicated 10 years of time to this company… so that I can share my idea with like-minded photographers.   After several iterations of “the world‘s most compact tripod base” I have taken the very best features of our patented designs, and coalesced them into what I believe is going to be the most popular tripod of its kind, the Platypod Delta. The triangular design, flip out legs and adaptations to straps and 1/4” threaded accessories make this the fastest and most versatile Platypod to date. You just add on your own tripod head to this plate, and you are ready to shoot photo or video. Don’t have a spare tripod head? Look at any of our Platyball ballhead models or the Platypod grip for your smart phone.  What is new and different about Delta?  Δ Flip out hinged spikes – when we introduced the recent Platypod eXtreme, everyone was so happy that they no longer had to insert each spike individually. They could now simply pull out the hinges and flip the spikes into place. Our previous hand sized model, the Platypod ultra also required the spikes to be carried in a separate wallet which was not as convenient. For Delta, we designed all new heavy duty hinges with adjustable tension (with included 2 mm Allen wrench). Three 1/4 inch threaded spikes take three or four seconds to deploy.   They also incorporate our unique nylon/silicone retractable feet to reveal the sharp spikes for stone and concrete, or conversely, to cover them with a soft rubber tip to protect delicate surfaces.  Δ Triangular design – All our previous designs relied upon a primarily four legged system for added stability. The sacrifice however was speed since on almost any uneven surface some degree of leg adjustment was necessary for balance as well as to avoid jitter. The three legged system allows instant stability upon spike deployment.  Δ Super lightweight design – at only 4.2 ounces including spikes and tips this is our most lightweight and compact Platypod with a substantially smaller surface area due to the aircraft like cut out design. We bumped up the thickness of the metal from 5 mm to 6 mm to maintain maximum strength and stability. Fits beautifully into any camera bag or your pocket.  What remains the same?  It is compatible with our entire product line and maintains the Platypod features our users love:  …and yes, it really does open beer bottles.  Delta is available for discounted pre-order via Kickstarter now through February 15, 2025 and later on at platypod.com   Platypod®? Delta Travel Tripod by Larry Tiefenbrunn — Kickstarter  The post Delta Makes the Difference appeared first on Lightroom Killer Tips.",
    "author": "KelbyOne",
    "published": "Fri, 17 Jan 2025 08:16:00 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2025/01/157__DELTA__Kickstarter__KelbyOne__Blog_Img2_1040x684.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Gear",
      "News",
      "Sponsored",
      "innovation",
      "kickstarter",
      "photography",
      "Platypod",
      "Travel",
      "travel photography",
      "tripod",
      "tripod alternative"
    ]
  },
  {
    "id": "745c178b-6b40-49e3-9cb6-4c2ce43f0235",
    "title": "My New Book, “Crush The Composition” Is Now In Stock",
    "link": "https://lightroomkillertips.com/my-new-book-crush-the-composition-is-now-in-stock/",
    "description": "It just came out a few weeks ago, and it’s in bookstores now. Check out the short video below, where I explain what the book is all about. You can get your copy at Amazon (link), Barnes \u0026 Noble (link), or directly from the publisher, Rocky Nook (link). It’s available in Print [it’s beautiful in print] and eBook versions. Hope you give it a look. Have a great weekend, everybody. All of my teams are already out of the playoffs or College Championship, so I’ll be….well….rooting for some team I don’t really care about all that much. I guess I’m going in on the Lions since they’ve never won a Super Bowl, and I like their coach. So, #GoLions, I guess. -Scott P.S. If you’re not rooting for any teams this weekend, you know what might be a lot of fun instead? Reading a good photography technique book. (hint, hint). The post My New Book, “Crush The Composition” Is Now In Stock appeared first on Lightroom Killer Tips.",
    "author": "Scott Kelby",
    "published": "Fri, 17 Jan 2025 08:16:00 +0000",
    "image": "",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Featured",
      "Photography"
    ]
  },
  {
    "id": "f7736ce0-f13e-43ed-8e26-7f09ada8d1c0",
    "title": "A Guide to Octabox Lighting (+ 5 Easy Setups)",
    "link": "https://digital-photography-school.com/5-lighting-setups-using-octabox/",
    "description": "The post A Guide to Octabox Lighting (+ 5 Easy Setups) appeared first on Digital Photography School. It was authored by Neil Creek. Octaboxes are a great way to improve your portraits, still lifes, and product shots – but what exactly is an octabox, and how can you use one for beautiful results? In this article, I share everything you need to know about octabox photography, from the absolute basics (how do you pick the right octabox for […] The post A Guide to Octabox Lighting (+ 5 Easy Setups) appeared first on Digital Photography School. It was authored by Neil Creek.",
    "author": "Neil Creek",
    "published": "Sat, 11 Jan 2025 09:00:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2022/02/octabox-lighting-in-photography-1005.jpg?resize=1200%2C1209\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Cameras and Equipment",
      "intermediate",
      "lighting"
    ]
  },
  {
    "id": "177b9f0b-4b06-49ed-ae2c-0f0acb16bb65",
    "title": "8 Tips for Beautiful On-Camera Flash Photography",
    "link": "https://digital-photography-school.com/8-on-camera-flash-tips-how-to-get-better-lighting-from-your-on-camera-flash/",
    "description": "The post 8 Tips for Beautiful On-Camera Flash Photography appeared first on Digital Photography School. It was authored by Guest Contributor. On-camera flashes are surprisingly capable tools. Sure, many photographers prefer to work with natural light or an off-camera strobe, but natural light is unpredictable, while off-camera strobes are clunky and inconvenient. You can carry an on-camera flash in your bag at all times, and in my experience, you can capture pro-level, refined photos using a […] The post 8 Tips for Beautiful On-Camera Flash Photography appeared first on Digital Photography School. It was authored by Guest Contributor.",
    "author": "Guest Contributor",
    "published": "Fri, 10 Jan 2025 09:00:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?resize=1200%2C1254\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Cameras and Equipment",
      "beginner",
      "lighting"
    ]
  },
  {
    "id": "1d16f65c-4a80-41da-b075-5caa1a08cd66",
    "title": "Canon’s Surprising New App Offers Wireless Multi-Device Live Streaming",
    "link": "https://petapixel.com/2025/01/19/canons-surprising-new-app-offers-wireless-multi-device-live-streaming/",
    "description": "Canon Inc. announced Live Switcher Mobile, a new iOS and iPadOS application that delivers multi-device integration and switching for live streamers, including content creators and gamers. [Read More]",
    "author": "Jeremy Gray",
    "published": "Mon, 20 Jan 2025 04:00:10 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/01/canon-live-switcher-mobile-featured.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Mobile",
      "News",
      "Software",
      "app",
      "Canon",
      "canonliveswitchermobile",
      "contentcreator",
      "ios",
      "ipad",
      "ipados",
      "iphone",
      "iphoneapp",
      "mobile",
      "streaming"
    ]
  },
  {
    "id": "0d565d86-dc8d-4836-ab02-497bd03da420",
    "title": "TikTok to Return After Incoming President Trump Provides Assurances",
    "link": "https://petapixel.com/2025/01/19/tiktok-to-return-after-incoming-president-trump-provides-assurances/",
    "description": "TikTok, which is currently offline in the United States following a ban, says it will return online thanks to President Trump, who initiated the years-in-the-making ban in the first place via executive order in August 2020, years before he used the platform as part of his bid to return to the White House. [Read More]",
    "author": "Jeremy Gray",
    "published": "Sun, 19 Jan 2025 18:20:02 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/01/tiktok-restoration-featured.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Culture",
      "Law",
      "News",
      "app",
      "congress",
      "joebiden",
      "law",
      "socialmedia",
      "supremecourt",
      "tiktok",
      "trump"
    ]
  },
  {
    "id": "d433cf6d-8b29-4a3f-a950-ddbb40cea7e1",
    "title": "How the iPhone 16 Can Help You Be a Better Content Creator",
    "link": "http://onebigphoto.com/how-the-iphone-16-can-help-you-be-a-better-content-creator/",
    "description": "If you’re a content creator, you know the value of using tools that help you produce better quality content and make the entire editing process easy from start to finish. Whether you’re creating videos, podcasts, written content, or even graphics, the iPhone 16 just might be your new favorite tool. As long as you have […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:49:35 +0000",
    "image": "http://onebigphoto.com/uploads/2019/11/whystudentsneed1-300x200.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "df04ba19-7917-4908-a583-8d0c98fb0797",
    "title": "Wallet Management 101: How to Keep Your Wallet in Great Shape",
    "link": "http://onebigphoto.com/wallet-management-101-how-to-keep-your-wallet-in-great-shape/",
    "description": "Wallets aren’t incredibly expensive, but if you take good care of them, they can serve you well and last a lifetime. Thankfully, the most important strategies for keeping a wallet in good condition are both inexpensive and highly accessible.   How do you keep your wallet in great shape?   Choose the Right Wallet   […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:34:24 +0000",
    "image": "http://onebigphoto.com/uploads/2024/05/walletobp-300x150.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "e6f662b8-e018-4edf-b0fc-253317165767",
    "title": "I've Been Working on Something",
    "link": "http://strobist.blogspot.com/2024/06/ive-been-working-on-something.html",
    "description": "Hey gang, it’s David. It’s been a while! In 2021, I archived Strobist as a completed project. I can’t honestly say that I’ve missed the breakneck pace of running a solo site. But I’ve definitely missed interacting with so many cool people all of the time. That said, I am still teaching. X-Peditions gives me the twin advantages much smaller class sizes, plus being in Hanoi every fall. And that’s been wonderful. Better yet, my new schedule has given me the breathing room to be able build my current project. Like Strobist, this project is designed for photographers. But unlike this website, it has nothing at all to do with flash. Today I’m introducing my new book, The Traveling Photographer’s Manifesto. It aspires to be for traveling photographers what Strobist always tried to be for lighting photographers. The premise of the book is that your camera can, and should, be much more than just a pricey recording device when you travel. It can also serve as a passport, opening up new connections and possibilities that otherwise might not have happened. Using a photo trip to Southeast Asia as a framework, the book walks through many things that you can do to help this to happen. I have uploaded three documents to help you to know if TTPM might be suited for you: 1. A 5-minute summary: This will quickly give you a feel for the book. 2. A 27-page supplement: Only a small portion of the book, which is unillustrated, is about camera operation. This visual supplement is available for readers who are more visual learners. And it will give you a quick skim of parts 4 and 5. 3. A sample chapter: How to become more comfortable meeting and engaging with people as a photographer. As you'll see from the summary, most of the book is not about camera operation at all. It’s more about the countless little things that working photojournalists do while on assignment that an enthusiast might not think of. These little habits, taken together, can start to form the impression of a photographer being consistently, conspicuously lucky. When in reality, luck had very little to do with it. So, if this is the sort of thing that interests you, I hope you’ll give the book a spin. It is available now, on Amazon.com worldwide. Just as with Strobist, I welcome your feedback from this project as well. My email is listed on the copyright page and elsewhere. And of course, I will read and take to heart every Amazon review. Because my goal is for the project to continue to evolve and improve over time, just as the material on this website did. Thanks for your interest, and for your readership of Strobist. As always, please say hi at any time on Twitter at @Strobist. Cheers, David The Traveling Photographer’s Manifesto (Amazon.com)",
    "author": "David Hobby",
    "published": "Tue, 11 Jun 2024 22:22:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-W17q9tcAHlutYrIFGWU0YglpFYEfSkjZZWB7RouSVTQJtMvAy9WhRx5n4JMvFjiVVDTJ3P5qMC0Lp1MQ8SPj4ZFsA1RLw5j-6Mo9tBME3hR3nny3H3yn-foRWK-3kVYgYcIcjUFC5K-gQTa7-nMsJ_RgWyoVRxDT6SWAngTK7y7TaDoAEcBi/s400/Lede%20TTPM.JPG",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "3cab8091-953c-47ac-b4de-036e775ddc6d",
    "title": "So Long (for Now!) and Thank You.",
    "link": "http://strobist.blogspot.com/2021/07/so-long-for-now-and-thank-you.html",
    "description": "In 2006 I started a lighting blog while working full-time as a staffer at The Baltimore Sun. By early 2007, it became obvious that I didn't have the personal resources to give 100% to both Strobist and my job at the newspaper. That’s exactly the position I find myself in today. For the past year I have been working on a new project. It is photography-based, and will be as unique to the photo space as Strobist was back in 2006. But, as I found with Strobist in 2007, this project will require all of my focus. So I am shifting Strobist into archive mode to allow myself the time and mental space to do that. If I had more available brain cells/hours in the day, I would be happy to do both. Alas, I do not. So I am choosing the one I think can make a bigger difference to photographers. When the new project launches, I’ll do my best to make sure you hear about it. So please, stay tuned! For those of you who are interested in our in-person lighting workshops and/or our X-Peditions trips (both of which are currently on pause during the pandemic) we absolutely are planning to restart them once the coast is clear. Please make sure you are on the relevant notification list(s) by clicking through to the links above. Finally, I want to take this moment to say thank you to the countless people I have met, and new friendships made, as a result of publishing Strobist over the past 15 years. It is impossible to express how much you all have enriched my life, and that of my family. Thank you so much, David",
    "author": "David Hobby",
    "published": "Thu, 01 Jul 2021 15:26:00 +0000",
    "image": "http://farm1.static.flickr.com/171/447819702_778a34024c.jpg",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "b33b4ca0-efb1-4739-ab6e-5b3788e94bb3",
    "title": "The Next Gallery",
    "link": "https://stuckincustoms.com/2025/01/20/the-next-gallery-2/",
    "description": "More from my AI Insta over at @trairatcliff The post The Next Gallery appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Mon, 20 Jan 2025 22:49:50 +0000",
    "image": "https://i0.wp.com/stuckincustoms.com/wp-content/uploads/2025/01/Trey-Ratcliff-New-AI-batch-5-003-678x900.png?ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "artificial intelligence",
      "AI"
    ]
  },
  {
    "id": "e474b4ac-1080-4dc0-961d-372e38d2952a",
    "title": "Gallery No.13",
    "link": "https://stuckincustoms.com/2025/01/12/gallery-no-13/",
    "description": "The next batch of stuff from inside my brain… The post Gallery No.13 appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Sun, 12 Jan 2025 20:01:00 +0000",
    "image": "https://i0.wp.com/stuckincustoms.com/wp-content/uploads/2025/01/Trey-Ratcliff-New-AI-007-900x633.png?ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "artificial intelligence",
      "AI",
      "Midjourney"
    ]
  },
  {
    "id": "b432aece-a7d7-4264-b160-e980b37b5b17",
    "title": "Embracing Bad Weather Photography for Awesome Images",
    "link": "https://www.lightstalking.com/bad-weather-photography/",
    "description": "When you start reading about bad weather in photography, the articles or the videos you're watching invariably talk mainly about protecting your gear. And while that is very important because you don't want to ruin thousands of dollars worth of expensive gear, it also misses the main point of photographing in bad weather. And that […] The post Embracing Bad Weather Photography for Awesome Images appeared first on Light Stalking.",
    "author": "",
    "published": "Thu, 16 Jan 2025 13:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Landscape Photography"
    ]
  },
  {
    "id": "d1553e77-ce7a-4531-ab63-1228200ab188",
    "title": "December 2024 Photo Contest Winners: Light and Shadow Play",
    "link": "https://www.lightstalking.com/light-and-shadow-play-winners/",
    "description": "We're happy to announce the winner of December's competition “Light and Shadow Play.” The entries to the \"Light and Shadow Play\" photo contest were varied and it was quite interesting to see the participants' interpretation of the theme. Images submitted to the contest included still life, nature, landscape, architecture and some abstract. Here are December's winners: The post December 2024 Photo Contest Winners: Light and Shadow Play appeared first on Light Stalking.",
    "author": "",
    "published": "Thu, 16 Jan 2025 03:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Cool Photos \u0026 Photographers"
    ]
  }
]
