[
  {
    "id": "47e86849-81c4-43fc-8467-de6465c31b2c",
    "title": "´We will get there´ – Tuchel eyeing improvements despite perfect England start",
    "link": "https://www.soccernews.com/we-will-get-there-tuchel-eyeing-improvements-despite-perfect-england-start/383460/",
    "description": "Thomas Tuchel is still looking for improvements, insisting England “will get there” despite making a perfect start with two wins from his first two matches. England cruised to a comfortable 3-0 victory over Latvia on Tuesday, with Reece James and Eberechi Eze both scoring their first international goals on either side of Harry Kane’s 71st […] The post ´We will get there´ – Tuchel eyeing improvements despite perfect England start appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Mon, 24 Mar 2025 23:26:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  },
  {
    "id": "40b90754-d3e6-4da5-8a26-3de5fea1c1d0",
    "title": "England 3-0 Latvia: What Were The Main Talking Points As The Three Lions Open Their Qualifying Adventure With Consecutive Wins?",
    "link": "https://www.soccernews.com/england-3-0-latvia-what-were-the-main-talking-points-as-the-three-lions-open-their-qualifying-adventure-with-consecutive-wins/383459/",
    "description": "While England might have once again failed to find top gear for sustained periods on Monday night, the Three Lions did cruise their way to a 3-0 victory against Latvia at Wembley. With Thomas Tuchel’s new squad failing to find a breakthrough against a team currently ranked 140th in the world, the former Chelsea boss […] The post England 3-0 Latvia: What Were The Main Talking Points As The Three Lions Open Their Qualifying Adventure With Consecutive Wins? appeared first on Soccer News.",
    "author": "Tom Dunstan",
    "published": "Mon, 24 Mar 2025 22:57:02 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "Editorial",
      "World Cup"
    ]
  }
]
