[
  {
    "id": "f5d86147-8813-4208-a2b2-d649b41b13e7",
    "title": "Apple Intelligence | Imagine it. Genmoji it. | iPhone 16",
    "link": "https://www.youtube.com/watch?v=XROs4K67Y9Q",
    "description": "",
    "author": "Apple",
    "published": "2024-12-11T23:27:34+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "93c0f8e9-6181-4e90-accd-46f09b21b8cb",
    "title": "Recorded on iPhone 16 Pro | Michael Bublé, Carly Pearce “Maybe This Christmas” | Apple",
    "link": "https://www.youtube.com/watch?v=x88hdYjaBRo",
    "description": "",
    "author": "Apple",
    "published": "2024-12-11T18:02:41+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "29589302-3354-4562-8077-f37d92d486db",
    "title": "The best features to try on your new Apple Watch",
    "link": "https://9to5mac.com/2024/12/25/best-apple-watch-features/",
    "description": "If you just unwrapped a new Apple Watch this holiday season, there are a variety of tips and tricks that can help you get the most out of your new wearable. Read on for some guidance on our favorite Apple Watch features for health, activity, customization, and more. more…",
    "author": "Chance Miller",
    "published": "Wed, 25 Dec 2024 14:52:36 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/11/46mm-Apple-Watch-Series-10-GPS-Cell-with-the-Slate-Titanium-Case.webp?w=1200",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "afa0a1f9-5007-444d-94d6-af91a6d9e06c",
    "title": "Ottocast elevates the connected car experience with wireless CarPlay AI Box, CloudSIM, Car TV Mate Pro, more [20% off]",
    "link": "https://9to5mac.com/2024/12/25/ottocast-elevates-the-connected-car-experience-with-wireless-carplay-ai-box-cloudsim-car-tv-mate-pro-and-more-20-off/",
    "description": "We’re huge fans of the Ottocast suite of connected car accessories, and 9to5Mac readers can upgrade the car entertainment system while saving 20% for the holidays! From the wireless CarPlay AI box to the newly launched CloudSIM solution, Ottocast has the best solutions for enhancing your trip. more…",
    "author": "Sponsored Post",
    "published": "Wed, 25 Dec 2024 13:37:35 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/12/ottocast2.jpg?quality=82\u0026strip=all\u0026w=1500",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "cffcd9ca-6517-43c7-9348-36194af0d54b",
    "title": "Apple reveals 2024’s most downloaded apps and games on the App Store",
    "link": "https://www.apple.com/newsroom/2024/12/apple-reveals-2024s-most-downloaded-apps-and-games-on-the-app-store/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2024-12-16T14:00:14.337Z",
    "image": "https://www.apple.com/newsroom/images/logos/quick-reads-logos/Apple-App-Store.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "e2e805ec-e2c3-4cac-b419-97adfbdf422a",
    "title": "His Majesty King Charles III visits Apple’s U.K. headquarters",
    "link": "https://www.apple.com/newsroom/2024/12/his-majesty-king-charles-iii-visits-apples-uk-headquarters/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2024-12-12T19:07:54.930Z",
    "image": "https://www.apple.com/newsroom/images/2024/12/his-majesty-king-charles-iii-visits-apples-uk-headquarters/tile/Apple-Battersea-community-impact-Tim-Cook-and-King-Charles-III-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "PHOTOS"
    ]
  },
  {
    "id": "26544ab0-988c-4e4c-b3e8-653bea545ad9",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "97fcaeb7-33d8-4af7-a1ab-d6fedceeb61d",
    "title": "The Overcast Redesign: Part One",
    "link": "https://marco.org/2022/03/25/overcast-redesign-2022",
    "description": "Overcast’s latest update (2022.2) brings the largest redesign in its nearly-eight-year history, plus many of the most frequently requested features and lots of under-the-hood improvements. I’m pretty proud of this one. For this first and largest phase of the redesign, I focused on the home screen, playlist screen, typography, and spacing. (I plan to revamp the now-playing and individual-podcast screens in a later update.) The home screen is radically different: Home screen, before (left) and after (right). Playlists now have strong visual identities for nicer and easier navigation. Each playlist has a customizable color, and a custom icon can be selected from over 3,000 SF Symbols to match modern iOS design and the other icons within Overcast. And playlists can be manually reordered with drag-and-drop. Recently played and newly published episodes can now be displayed on the home screen for quick access, much like the widget and CarPlay experience. Podcasts can now be pinned to the top of the home-screen list. Pinned podcasts can also be manually reordered with drag-and-drop. I’ve also rethought the old stacked “Podcasts” and “Played Podcasts” sections to better match people’s needs and expectations. Now, the toggle atop the podcast list switches between three modes: podcasts with current episodes, all followed podcasts, and inactive podcasts (those that you don’t follow and therefore won’t get any more episodes from, or haven’t posted a new episode in a long time). The playlist screen’s structure remains mostly the same, while refining the design for the modern era: Playlist screen, before (left) and after (right). Here, it’s more apparent that I’ve replaced the system San Francisco font with an alternate variant, San Francisco Rounded, to increase legibility and better match the personality of the app. I’ve also added highly demanded features: By far, Overcast’s most-requested feature is a Mark as Played feature. That’s now available as a checkmark button on episode rows, as well as a left-side swipe action. The second-most-requested feature is a way to view all starred episodes. Special playlists for Starred, Downloaded, and In Progress can now be created. The light and dark themes now each have a customizable tint color from the modern iOS UI-color palette, including these favorites from beta testers: And throughout the app, I’ve made tons of tweaks and bug fixes, including: Notifications and background downloads are now much more reliable. Episode downloads can now be individually deleted or re-downloaded. Links can now be opened in Safari. (under Nitpicky Details) Performance is now significantly better with very large playlists and collections. Fixed bugs with episode-duration detection, CarPlay lists, Mac-app sharing, and much more. So much is better in this update that I can’t even remember it all. Thank you so much to everyone who helped me beta-test this massive update. As always, Overcast is free in the App Store. Go get it!",
    "author": "",
    "published": "Fri, 25 Mar 2022 10:57:51 EDT",
    "image": "https://marco.org/media/2022/03/ocredesign2022-1-after.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "0ab1d57a-7297-4343-b8d7-2e809693ba3d",
    "title": "Snag an M4 MacBook Pro 14-inch for $1,399 with free next day delivery",
    "link": "https://appleinsider.com/articles/24/12/25/snag-an-m4-macbook-pro-14-inch-for-1399-with-free-next-day-delivery?utm_medium=rss",
    "description": "Holiday price cuts are in effect for Christmas and Hanukkah, as Apple's latest MacBook Pro with an M4 chip has plunged to $1,399.Get Apple's M4 MacBook Pro for just $1,399 - Image credit: AppleThe $1,399 price at B\u0026H Photo and Amazon is thanks to a holiday price war between the two Apple Authorized Resellers. With the entry model now including 16GB of unified memory compared to last year's 8GB, the Late 2024 14-inch MacBook Pro offers additional value for the price.Buy for $1,399 Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Christine McKee",
    "published": "Wed, 25 Dec 2024 18:37:27 +0000",
    "image": "https://photos5.appleinsider.com/gallery/62140-128742-m4-macbook-pro-14-inch-1399-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "e3a3c8f1-f9be-4d55-a573-c19174b79621",
    "title": "How we work: Malcolm Owen's sprawling setup",
    "link": "https://appleinsider.com/articles/24/12/25/how-we-work-malcolm-owens-sprawling-setup?utm_medium=rss",
    "description": "Malcolm's workspace has handled his work, gaming, and photography lives for years. Here's how he spends his days working and most of his time off.Malcolm Owen's home working setupAfter working from home for a decade, and spending spare time on computers for far longer, you'd expect a person in that situation to have perfected their computing setup. In my case, it's not perfect, but it's more than capable of handling whatever I want to do.This is a setup primarily for working from home, rather than for portability. It's also one that has been constructed with budget being a major factor, and so changes have been very gradual over the years. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Malcolm Owen",
    "published": "Wed, 25 Dec 2024 14:09:21 +0000",
    "image": "https://photos5.appleinsider.com/gallery/62102-128667-malcolm1-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "6430c490-355c-4fd1-ad34-271f2c82dc98",
    "title": "We Fixed the iOS 18 Photos App: Try These Simple Tips!",
    "link": "https://www.youtube.com/watch?v=6vXFNxz01Us",
    "description": "",
    "author": "MacRumors",
    "published": "2024-12-23T17:56:28+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "b70fcca3-27d0-451c-a3df-1f7353848ca0",
    "title": "2024 Apple Apps of the Year!",
    "link": "https://www.youtube.com/watch?v=1vxaScUDYUI",
    "description": "",
    "author": "MacRumors",
    "published": "2024-12-19T18:58:45+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "5bb2b5e3-cad6-4f9a-a0cf-5f4d32aa15f4",
    "title": "AirTag sale drops Apple Bluetooth trackers to all-time lowest price [Still available!]",
    "link": "https://www.cultofmac.com/daily-deals/airtag-sale",
    "description": "You can get a stocking stuffer for a loved one or make the whole family a bit more organized thanks to a sale on Apple AirTag. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Ed Hardy",
    "published": "Wed, 25 Dec 2024 17:38:38 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2023/12/AirTag-Cat.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Daily deals",
      "AirTag",
      "Apple deals"
    ]
  },
  {
    "id": "99df12b0-3e5d-4004-b022-4e069b520bbe",
    "title": "Today in Apple history: Woz spends Christmas building Apple II disk drive",
    "link": "https://www.cultofmac.com/apple-history/woz-apple-ii-disk-drive",
    "description": "On December 25, 1977, Steve Wozniak spent the holiday building a prototype of the Disk II, the Apple II's revolutionary floppy disk drive. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Luke Dormehl",
    "published": "Wed, 25 Dec 2024 17:22:02 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2017/06/Disk_II.png",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Apple history",
      "Apple II",
      "Steve Wozniak",
      "TIAH: 1970s",
      "Today in Apple history"
    ]
  },
  {
    "id": "2afabf60-11a6-4432-8700-21a20ff56656",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 11:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "85c0db72-0716-4035-be36-5f69f206baf0",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 07:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "3fc3b522-319e-4d6d-856d-ccb8671f870f",
    "title": "The Talk Show: ‘A Professional Internet User’, With Kagi Founder and CEO Vlad Prelovac",
    "link": "https://daringfireball.net/thetalkshow/2024/12/24/ep-416",
    "description": "",
    "author": "John Gruber",
    "published": "2024-12-24T21:26:42Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "48e6a2d7-8466-4b3b-9663-b37d35f50e25",
    "title": "Coding Font Selection ‘Tournament’",
    "link": "https://www.codingfont.com/",
    "description": "",
    "author": "John Gruber",
    "published": "2024-12-24T18:31:42Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "03ce3c55-3f14-4a1b-9e83-b1fbfe7647cd",
    "title": "Got a new iPhone 16? Do these 7 things first",
    "link": "https://www.macworld.com/article/559534/new-iphone-cases-update-display-settings-dynamic-island.html",
    "description": "Macworld So you just got a brand new iPhone 16, transferred everything from your old phone, and now you’re ready to play with your shiny new toy. What do you do first? Obviously, you’re going to check out the apps you already have been using on your old iPhone for so long, probably marveling at how fast they load and how smooth and responsive everything is. Then what? Here are our suggestions for the next things you should do with your iPhone 16 or iPhone 16 Pro. And since the iPhone 16 will be the first iPhone most people will have that is capable of running Apple Intelligence, there’s lots of neat new stuff to try out. Update to iOS 18.2 If you have an iPhone 16-series handset it came with iOS 18, and might even be updated already to iOS 18.1. But you should check if it has the latest version of iOS on it already: iOS 18.2. It arrived in mid-December and adds features mainly for iPhone 16 users like Visual Intelligence, Image Playground, Genmoji, and ChatGPT integration. Plus there are numerous bug fixes and security updates, so you should install it ASAP. To get it, open up Settings, then tap General and Software Update. Enable Apple Intelligence You almost certainly got a pop-up screen during setup telling you about Apple Intelligence and giving you the option to turn it on. But it’s easy to just hit “next…next…next” on those screens and not really pay attention. If you need to enable Apple Intelligence, you can open Settings, select Apple Intelligence \u0026 Siri, and then tap Get Apple Intelligence. Apple Your iPhone will need to have its Device language and Siri language set to one of the supported languages for Apple Intelligence (as of iOS 18.2, that’s English (Australia), English (Canada), English (Ireland), English (New Zealand), English (South Africa), English (UK), and English (US)). You might enter a little waiting list but that typically lasts minutes or hours rather than days. Then your iPhone will download the Apple Intelligence models, and you’re be good to go in a jiff. All the Apple Intelligence features may not operate optimally until your phone has completed some background processing and indexing, so keeping it plugged in for a while while it updates is a good idea. Tweak Camera Control settings One of the iPhone 16’s hot new features is Camera Control, that new button on the lower right side that’s flush with the edge. It can launch your preferred camera app, act as a shutter button, and even adjust some camera features with swipes and taps. But it’s a little touchy, and with the default settings it might be more of an annoyance than a benefit. We have a guide to fixing the Camera Control button that describes the settings you can change in detail. One set of options is in Settings \u003e Camera \u003e Camera Control and the other is in Accessibility \u003e Camera Control. Dip into both of those menus to tune the Camera Control button and get it operating the way you like it. It will make a big difference! And don’t forget—you can turn the whole thing off if you can’t get it to work the way you’d like. Foundry Set an Emergency Contact and Medical ID You can do this on any iPhone, but many people haven’t yet and it could save your life one day. So setting up a new iPhone is the perfect time to open the Health app to enter important Medical ID info and set up an emergency contact. Medical ID info can display critical medical info or allergies on your lock screen to a first responder, and an emergency contact is someone who can be called in an emergency by pressing and holding the side and volume buttons. First, open the Health app.  Then tap on your profile picture in the upper right. Tap Medical ID. Enter any critical medical info a first responder would need to know if you’re in an accident, and an emergency contact you would want to reach. Customize your Home Screen and Control Center If this is your first iPhone, or if you just haven’t spent much time with iOS 18 yet, you may not know that you can now greatly customize both your Home Screen and Control Center. You can add widgets and position them anywhere, tint icons, make icons big with no text, and more. And you can add control center controls for all kinds of third-party apps now, and resize or reorder them. Check out our guide to customizing your Home Screen or Control Center in iOS 18, and give your fresh new iPhone 16 and fresh new look and feel. Foundry Tweak the new Photos app Speaking of customizing iOS 18, the new Photos app definitely needs a few tweaks. If you’re a longtime iPhone user, you’ll notice it’s completely overhauled, and if you’re new to the platform you might see a lot of things you don’t necessarily want. In just a few minutes you can change the Photos app to show only the categories you want, in the order you want, and you can make (and reorder) Pinned Collections that take you right where you go the most often. Our guide to customizing the Photos app tells you everything you need to know. Foundry Read the manual Did you know your iPhone actually has a manual? No, it didn’t come in the box…it would never fit in there. Apple keeps it online. But it’s super helpful, with a nicely organized, hyperlinked guide to your iPhone hardware and iOS 15 online at the iPhone User Guide. You’d be surprised at how many useful details are in there, and how much you’ll learn just by reading the instructions!",
    "author": "",
    "published": "Wed, 25 Dec 2024 19:00:00 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2024/12/iphone-16-and-iphone-16-plus.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "iPhone"
    ]
  },
  {
    "id": "627467fe-a451-419e-abef-dcf15fbb323d",
    "title": "These 13 tips will help you get your new Mac set up right",
    "link": "https://www.macworld.com/article/227083/mac-tips-setup-spotlight-time-machine-spotlight-dock-shortcuts.html",
    "description": "Macworld Got a new Mac? If this is the first one you’ve ever owned, a hearty congratulations! Your new Mac is easy to use and more powerful than it’s ever been. As easy as the Mac is to use, doing some things may not be instantly obvious (especially if you are coming from Windows). You owe it to yourself to make sure you’re getting the most out of your new investment. Here are 12 things that you should do right away that will help you get started down the path toward being a Mac power user. Most of these will cost you absolutely nothing except a bit of time to set up. We have a separate guide to how to set up your Mac, we also explain how to move everything from your old Mac to your new Mac. And if you are moving to Mac from a PC read: How to move from PC to Mac. 1. Enter your Apple Account and password Foundry There’s a good chance that even if this is your first Mac, you already use an iPhone or an iPad. Just like those other devices, your Mac wants you to enter your Apple Account and Apple Account password. Enter your Apple Account and password to connect to iCloud on your Mac when you first set it up or later through the Apple Account system setting. By connecting to iCloud with your Apple Account you can access all your photos, contacts, calendars, and much more on all your Apple devices without ever having to physically tether or sync them. Once all your Apple devices are linked this way you’ll also be able to take advantage of features like being able to cut and paste between devices, use a mouse and keyboard to control more than one Mac, and make purchases on the Mac App Store. Depending on whether you an an iCloud subscriber you will also be able to sync files to the cloud, including documents and everything you save to your Desktop. Because you can access everything in iCloud on any Apple device you own you won’t need to have your Mac handy to edit a Pages document you are working on, for example. Find out about iCloud here: How to use iCloud and What is iCloud Private Relay. To find out how much iCloud costs read: iCloud storage plans and prices. If you haven’t created an Apple Account yet, now is the time to do so. Think of your Apple Account as your keys to the kingdom. For help read: How to create an Apple ID. You can get to your Apple Account by going to System Settings and clicking Apple Account at the top. 2. Use the Help menu Foundry If you’ve ever wondered why the Mac doesn’t come with a thick owner’s manual explaining how it works and how all the apps work, wonder no more: That manual is actually built right into the computer. The Help menu is so obvious that most of us overlook it altogether. But we do so at our peril because it can be a huge help. The Help menu sits right there in the menu bar, and it’s contextual: Its contents will change depending on which app is open. Clicking on the Help menu will bring up a search field, table of contents, lists of shortcuts, and other helpful tips and step-by-step instructions, often with visual cues to show you which menus to click on and what menu items to select. Any time you get stuck in an app and don’t know what to do next, click on the Help menu to get out of a jam. 3. Get familiar with the Apple Menu Foundry The Apple menu is in the upper left corner of your Mac’s screen. Clicking on the Apple icon gives you instant access to your Mac’s System Settings, the Mac App Store, and apps and documents you’ve recently opened (see Recent Items). You can also use the Apple menu to restart your Mac and shut it down. If an app misbehaves and stops working, the Apple menu also sports a special function that’s worth knowing: Force Quit. Force quit will immediately quit a stubborn application, so you can restart your computer and get back to business. 4. Get to know Spotlight Foundry Built right into macOS, Spotlight helps you quickly find things on your computer: documents, apps, images, contacts, maps, and files. What’s more, it can connect to the internet to search places like Wikipedia, news sites, movie listings, and much more. You can even use Spotlight to do calculations, like converting feet to meters or any sort of simple arithmetic you’d rather trust to the computer. Spotlight lives on your Mac’s menu bar; it’s the icon that looks like a magnifying glass and clicking on it brings up the Spotlight search field. You can also open Spotlight by pressing Command and Space at the same time. Type anything into the search field and Spotlight will search for it. Once you get the hang of it, using Spotlight is the fastest way to launch apps, find documents, and do tons of other stuff on your Mac really quickly. Over the years it’s gained more and more features including robust web and image search, and quick actions like timers built right in. 5. Customize the Dock Apple The Dock is that bar of icons that sits at the bottom of your Mac’s screen. Docks on new Macs will be filled with Apple’s own built-in apps, like Safari, Mail, Contacts, Calendars, and Notes, but you can customize it to your liking. Your Dock is the most important part of your Mac Desktop, so spend some time getting it just the way you want. You can tailor your Dock to show you only the apps you care about. Don’t use Maps or FaceTime? Drag them out of the Dock until the word Remove appears and let go. Use Mail more than anything else? Move it over to the left or right, instead. You can also add applications, folders, and files you need frequently simply by dragging them and dropping them into the Dock. To further reduce the space taken up by the Dock you can change the size of icons. To resize the Dock, click and drag on the bar that separates applications from folders and stacks. You can also change the size of icons, change the magnification of icons as you pass your cursor over them, turn off the bouncing animation, reposition the Dock to the left, bottom or right edges of your screen, and much more in the Desktop \u0026 Dock settings (macOS Ventura and later) or Dock \u0026 Menu Bar settings (macOS Monterey and earlier). 6. Personalize the way your Mac looks Foundry This is your Mac. Make it look the way you want it to. Change the wallpaper: Right-click the desktop and select Change Wallpaper, or open System Settings and select the Wallpaper option. You can pick from the beautiful images Apple provides or choose one of your own. Customize the interface: Open System Settings and choose Appearance. You can choose things like highlight colors and whether your interface changes to light or dark depending on the time of day, and more. Change the screen saver: In System Settings \u003e Screen Saver you can pick from tons of screen savers including some beautiful views of the Earth from the space station, underwater video, and more. Use Desktop Stacks: If you want to keep your Mac’s desktop tidy we recommend switching on Desktop Stacks, which will group all the files on your Desktop by category (you can choose whether they are sorted by kind, date, or tags.) To switch on Stacks click on the Desktop and choose View \u003e Use Stacks from the menu. Now everything will be slotted into category-appropriate ‘Stacks’ on your Desktop rather than your Desktop being cluttered by thousands of screenshots and files. 7. Learn keyboard shortcuts and master gestures Foundry Apple’s user interface is set up with straightforward menus such as File and Edit, and most apps expose their major features through those menus as well. Need to print something? Just click on the File menu and select Print. But you can save yourself so much time by using keyboard shortcuts to do commonly used tasks instead. Instead of clicking on the File menu and selecting Print, for example, you can just hold down the Command key and press P. (If you are coming from a PC, mostly you will press Command where you used to press Control). Each app on the Mac has its own shortcuts. Opening Mac Help and searching for “keyboard shortcuts” will yield some references, we also recommend this article: These useful Mac keyboard shortcuts will help you work faster and smarter. If your new Mac includes a trackpad—either because it’s a laptop with a built-in pad, or you scored a Magic Trackpad to go with your new desktop—take some time to learn about the many gestures built into macOS, your new Mac’s operating system. One of the simplest ways to discover the various gestures available is right in System Settings. Once there, click on Trackpad. There, you’ll find three tabs’ worth of mouse shortcuts. Move the cursor over any of them, and you’ll get a video preview of how to trigger the gesture. Some may well improve your Mac computing experience; I, for one, love the three-finger double-tap on any word to bring up its definition. 8. Visit the Mac App Store Foundry The Mac App Store is a convenient and safe way to download software for your Mac, all using the same Apple Account and password you use for Music and iPhone apps. There are thousands of apps available, including many that won’t cost you a dime. The Mac App Store is much more important than just a way to download great new apps for your Mac. It’s also how Apple distributes essential app updates. To keep your Mac running in tip-top shape and to keep everything as secure as possible, download updates when you see notifications from the Mac App Store or set apps to automatically update like on your iPhone. On a new Mac, it’s right there in your Dock—the blue circle with a stylized A inside it. The Mac App Store offers thousands of apps, and downloading and installing those apps is straightforward. Many apps are free; others require a payment, ranging from $1 to a couple hundred bucks. While you can—and likely will—find plenty of apps outside the cozy confines of the Mac App Store, browsing it is a great way to discover interesting apps, read reviews, and get a sense of the Mac software marketplace. On the M-series Macs, you can even install iPhone and iPad apps. When you’re searching, just click over to the iPhone \u0026 iPad Apps tab to download iOS apps right on your desktop. 9. Start a backup Time Machine snapshots appear as volumes in the Finder. Foundry Setting up a backup is boring, un-fun, and doesn’t involve playing with any cool apps or doodads. But your future self will thank You-Of-Just-Past-Christmas, and with good reason: Having a good backup solution now means you won’t lose irreplaceable data later. We’ve covered numerous ways to back up your Mac with minimal fuss. Pick at least one and get started. Trust me. Probably the simplest solution is to use Apple’s own backup solution, Time Machine, which is part of the Mac operating system (see How to use Time Machine to back up your Mac). All you need is a separate external storage device that you can buy for a relatively small investment (see: Best external SSD for Mac or best external hard drives if you want something a bit cheaper/bigger). Time Machine makes recovering from big problems easy because it keeps a snapshot of your Mac and makes it a breeze to migrate to a new Mac when the time comes to replace or upgrade your system. The “time” in Time Machine is a timeline that you can review, restoring files or changes to files that were made at the points where Time Machine saved its backups. Time Machine backs up your Mac hourly, daily, weekly, and monthly, so you’ll always be able to recover to that point in time. As long as that drive is connected your Mac will be backed up. To set up Time Machine follow these steps: Plug in an external drive. Open System Settings and go to General. Find Time Machine in the column on the right. Click on Options to set the backup frequency. 10. Set up your email Foundry Are you still accessing your email using a web browser, going to Gmail or Microsoft’s website to see what new messages you have? There’s a better way: Apple gives you a Mail app that can connect to almost every email service. Using the Mail app is a lot more convenient especially if you check multiple email accounts, and it’s well-integrated with macOS’s other core applications, such as Contacts, Calendars, and Maps. You’ll find the Mail app in your Dock on new machines. Click it to open it and follow the instructions to set up your account. 11. Find your printer Foundry With so many of us working from home these days, printers are a big thing in many of our houses. In the past, you had to download and install drivers and software, but the Mac makes it way easier to set up. All you need to do is to connect your printer to one of your Mac’s USB-C ports or connect to a Wi-Fi network. Open System Settings Click on Printers \u0026 Scanners. Click on the Add Printer, Scanner, or Fax button. If your Mac recognizes the device (and it should), it’ll configure it as needed and download any applicable drivers from Apple’s servers. 12. FaceTime a friend Video chatting might not feel like the future anymore, but it’s still a delight. No software makes it easier to start (or receive) a video call than FaceTime, which is built right into macOS. Find FaceTime in your Applications folder, or use Spotlight to search for FaceTime by typing in the first few letters of the app’s name. Now all you need is the email address or phone number of another FaceTime user. Read more about using FaceTime on a Mac in our guide. 13. Check out Apple Intelligence Apple In macOS Sequoia 15.2, Apple Intelligence started to hit its stride with some new tricks, including Image Playground and ChatGPT integration. And that’s in addition to the features introduced with macOS 15.1, including Writing Tools and a smarter Photos app.",
    "author": "",
    "published": "Wed, 25 Dec 2024 17:15:00 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2024/12/mw-all-macs-bf-primary-5.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Mac, MacBook, MacOS"
    ]
  },
  {
    "id": "7b9fd591-6502-4b1d-baf8-1815c0409a8f",
    "title": "Use ChatGPT by Phone by Calling 1-800-ChatGPT for AI Voice Answers \u0026 Communication",
    "link": "https://osxdaily.com/2024/12/20/use-chatgpt-by-phone-1800-chatgpt/",
    "description": "OpenAI, the company behind the popular ChatGPT artificial intelligence tool, has introduced a new phone-based ChatGPT client experience. By calling 1-800-ChatGPT (1-800-242-8478), you are able to have a phone conversation with ChatGPT to get AI answers by phone. Essentially the phone line for ChatGPT means that you can access and use ChatGPT entirely by voice, ... Read More",
    "author": "Ali Khan",
    "published": "Fri, 20 Dec 2024 18:53:15 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Apple.com",
      "Firefox",
      "Fun",
      "Games",
      "Hackintosh",
      "Hardware",
      "iPhone",
      "Tips \u0026 Tricks",
      "AI",
      "ChatGPT",
      "tips",
      "tricks"
    ]
  },
  {
    "id": "b0b38882-76cb-4234-8d02-10ea68046482",
    "title": "How to Disable Mail Sender Icons on iPhone in iOS 18.2",
    "link": "https://osxdaily.com/2024/12/19/disable-mail-sender-icons-contact-photos-iphone/",
    "description": "Apple recently introduced a completely new redesign for Mail app on iPhone including a Mail Categories feature that many users have strong opinions about, and along with that design change are new large prominent sender profile icons, which sit next to every item in the inbox. These large prominent mail sender icons squeeze the Mail ... Read More",
    "author": "Jamie Cuevas",
    "published": "Thu, 19 Dec 2024 18:55:45 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Apple.com",
      "Firefox",
      "Games",
      "Hackintosh",
      "Hardware",
      "iPhone",
      "Tips \u0026 Tricks",
      "iOS",
      "iOS 18.2",
      "mail",
      "tips",
      "tricks"
    ]
  },
  {
    "id": "7cde5a7e-4d0f-4dd2-a45d-39355f15bbeb",
    "title": "∞ The Dalrymple Report: AirPods, iOS, and Best of 2024",
    "link": "https://www.loopinsight.com/2024/12/20/the-dalrymple-report-airpods-ios-and-best-of-2024/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-airpods-ios-and-best-of-2024",
    "description": "Dave and I talk about the AirPods Pro and a big feature that is missing from the AirPods Max—will it ever get updated. We also look at everything you can do with ChatGPT integration in Apple Intelligence, and talk about the rumors of a new Apple TV. Follow this podcast Show Notes: Some AirPods appreciation AirPods Max are missing a key feature on the new USB-C model iOS 18.2: Everything You Can Do With ChatGPT Integration New Apple TV Rumored to Launch Next Year With These Features Apple reveals 2024’s most downloaded apps and games on the App Store Shows and movies we're watching Three Body Problem, Netflix The Old Man, Hulu",
    "author": "Jim Dalrymple",
    "published": "Fri, 20 Dec 2024 20:46:04 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "94925369-208e-4e44-8d09-9dc259b62649",
    "title": "∞ The Dalrymple Report: HomePod, iOS 18.2, and Voice Memos",
    "link": "https://www.loopinsight.com/2024/12/13/the-dalrymple-report-homepod-ios-18-2-and-voice-memos/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-homepod-ios-18-2-and-voice-memos",
    "description": "Dave is having a problem with his HomePod not recognizing his voice all of a sudden. Apple released iOS 18.2 adding more Apple Intelligence features that aren't really that good. Voice Memos also received an update with some features that are really good, escpaically for musicians. Follow this podcast Show Notes: Apple officially launches iOS 18.2 Voice Memos update brings Layered Recording to iPhone 16 Pro lineup New iOS 18.2 feature will ‘change the way we make music forever,’ says Michael Bublé Apple Stock Hits Record High On Second Wave Of AI Features Shows and movies we're watching Day of the Jackal, Peacock",
    "author": "Jim Dalrymple",
    "published": "Fri, 13 Dec 2024 14:43:11 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "5ea73f47-4ad3-43ce-b3b5-c6ddd21aaf5e",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "8ff9c274-6c3f-439d-8396-4601b8b81358",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  },
  {
    "id": "37ba8d26-31b8-498d-9486-300910c975bb",
    "title": "Lux Reveals Plans for Halide Mark III",
    "link": "https://www.macstories.net/linked/lux-reveals-plans-for-halide-mark-iii/",
    "description": "Yesterday, the team at Lux announced that they are working on the next major release of their pro camera app, Halide, which will be dubbed Halide Mark III. The next iteration of Halide, which Lux hopes to release in 2025 will focus on three areas: Color Grades: Like Kino, their App Store iPhone App of […]",
    "author": "John Voorhees",
    "published": "Tue, 24 Dec 2024 13:00:34 +0000",
    "image": "",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "Linked",
      "apps",
      "camera",
      "Halide",
      "iOS",
      "Kino",
      "Lux",
      "photography"
    ]
  },
  {
    "id": "1802e145-b365-407a-b037-e3bdee1d861f",
    "title": "Astropad Bookcase Walkthrough",
    "link": "https://www.macstories.net/linked/astropad-bookcase-walkthrough/",
    "description": "In 2024, I came to grips with the fact that I’ll never be an E Ink-first reader. Most of my reading is web-based, and I like having all of my reading-adjacent apps available too much to use a Kindle, Boox Palma, or other reading-first device regularly. That’s why I was immediately intrigued by the Astropad […]",
    "author": "John Voorhees",
    "published": "Mon, 23 Dec 2024 17:03:28 +0000",
    "image": "https://cdn.macstories.net/img_0387-1734972460424-1734973316382.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "Linked",
      "accessory",
      "iPhone",
      "read-later",
      "RSS"
    ]
  }
]
