[
  {
    "id": "648135b5-600d-43d8-a968-b683f18bd953",
    "title": "Driving the game forward: iPad teams up with college football",
    "link": "https://www.apple.com/newsroom/2024/11/driving-the-game-forward-ipad-teams-up-with-college-football/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2024-11-01T14:59:15.571Z",
    "image": "https://www.apple.com/newsroom/images/2024/11/driving-the-game-forward-ipad-teams-up-with-college-football/tile/Apple-iPad-and-college-football-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "268e5359-deae-4373-8c78-7c07d597c8c7",
    "title": "Apple reports fourth quarter results",
    "link": "https://www.apple.com/newsroom/2024/10/apple-reports-fourth-quarter-results/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2024-10-31T20:30:26.901Z",
    "image": "https://www.apple.com/newsroom/images/default/apple-logo-og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "PRESS RELEASE"
    ]
  },
  {
    "id": "7e5a31f4-988e-4a3a-b570-59ef7c601958",
    "title": "iOS 18.2 lets iPhone and iPad users trust a new computer with Face ID",
    "link": "https://9to5mac.com/2024/11/06/ios-18-2-trust-computer-face-id/",
    "description": "As we’ve seen, iOS 18.2 adds a lot of new features, and there are more with the second beta released this week. Although most of them are related to Apple Intelligence, there are some other interesting changes too. One of them is the ability to trust a new computer with the and iPad using Face ID. more…",
    "author": "Filipe Espósito",
    "published": "Wed, 06 Nov 2024 23:44:53 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/11/trust-computer-ios-iphone-ipad.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "f0fe854b-a0ab-45b1-8fba-0ed0e0198f64",
    "title": "Mercury Weather can now provide notifications for rain and snow",
    "link": "https://9to5mac.com/2024/11/06/mercury-weather-notifications-rain-snow/",
    "description": "Mercury Weather is a cool indie app that works as an alternative to Apple’s Weather app. Following an update in August that added new features to the app, there’s now another update available – and this one provides notifications about weather conditions. more…",
    "author": "Filipe Espósito",
    "published": "Wed, 06 Nov 2024 23:11:38 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "c216d845-80dc-45e8-a546-73220afe43ec",
    "title": "Apple Intelligence | Change your tone | MacBook Pro",
    "link": "https://www.youtube.com/watch?v=deNzYrTvqCs",
    "description": "",
    "author": "Apple",
    "published": "2024-11-04T14:00:32+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "235bf173-5d3a-4d1f-ae39-0daaf636e0c0",
    "title": "Apple Intelligence | Catch up quick | MacBook Pro",
    "link": "https://www.youtube.com/watch?v=BK8bnkcT0Ng",
    "description": "",
    "author": "Apple",
    "published": "2024-11-04T14:00:11+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "1e6a9ea4-9c85-47c3-bbe1-aee6e0869020",
    "title": "‘In Defeat: Defiance’",
    "link": "https://www.thebulwark.com/p/what-will-trumps-win-mean",
    "description": "",
    "author": "John Gruber",
    "published": "2024-11-06T21:44:54Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "7b474c6e-0b23-48ba-a444-0bd8317bd6c8",
    "title": "‘Trump Has Won, but Democracy Is Not Over’",
    "link": "https://www.theatlantic.com/newsletters/archive/2024/11/trump-victory-democracy/680549/",
    "description": "",
    "author": "John Gruber",
    "published": "2024-11-06T21:35:52Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "b3afcfb6-2cdb-4193-953a-682facf73fac",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 11:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "36968d88-0b76-4673-8eec-552f793b3081",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 07:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "55ebdaa4-9df1-483c-a741-974b7c09886c",
    "title": "Apple's numerous internal projects led to the upcoming API-powered Siri with AI",
    "link": "https://appleinsider.com/articles/24/11/06/apples-numerous-internal-projects-led-to-the-upcoming-api-powered-siri-with-ai?utm_medium=rss",
    "description": "Siri could soon be able to view and process on-screen content thanks to new developer APIs based on technologies leaked by AppleInsider prior to WWDC.Share content found on screen within apps with Apple Intelligence thanks to upcoming APIsOn Monday, Apple released new documentation to help developers prepare for the arrival of upcoming Siri and Apple Intelligence features. The company's latest developer API reveals that Siri will gain significant contextual awareness and that the virtual assistant will, at some point, be able to use information from the content currently on screen.Siri will undoubtedly become much more useful due to Apple's changes. The company provided a list of examples, which offer some insight as to exactly what the new-and-improved, AI-infused Siri will be able to do in the future. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Marko Zivkovic",
    "published": "Wed, 06 Nov 2024 21:15:13 +0000",
    "image": "https://photos5.appleinsider.com/gallery/61671-127546-On-screen-API-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "ae0dab89-8b2e-472d-ad71-03dbd4058a5d",
    "title": "How to use iPad in portrait with Sidecar with macOS Sequoia",
    "link": "https://appleinsider.com/inside/ipados-18/tips/how-to-use-ipad-in-portrait-with-sidecar-with-macos-sequoia?utm_medium=rss",
    "description": "Apple has finally updated Sidecar to allow you to extend your Mac screen onto an iPad when it's in portrait, not just landscape. For now, though, it's fiddly, but here's how to do it.We've only waited five years for Sidecar to recognise an iPad in portraitFive years after Apple introduced Sidecar with macOS Catalina, it has given it a much-wanted update. Previously Sidecar would only extend a Mac's display onto an iPad in landscape, regardless of what way around the device was being held or mounted.There was a fairly contorted workaround that would make it happen with the use of a third-party app. But now with macOS Sequoia 15.1 and iPadOS 18.1, you can just turn on Sidecar and then physically rotate your iPad. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "William Gallagher",
    "published": "Wed, 06 Nov 2024 20:30:47 +0000",
    "image": "https://photos5.appleinsider.com/gallery/61672-127543-000-lede-Sidecar-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "0f57b386-9511-4c62-a52b-a78c669a8d89",
    "title": "Ultrawide Display in visionOS 2.2 Beta is CRAZY!",
    "link": "https://www.youtube.com/watch?v=x3_0kNLr3Ew",
    "description": "",
    "author": "MacRumors",
    "published": "2024-11-05T18:48:45+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "46b8487f-9903-46cf-a1f7-17fd924ff4e0",
    "title": "Listen to this iPad Mini 7 unboxing! #asmrsounds",
    "link": "https://www.youtube.com/watch?v=UShG2OdWfzM",
    "description": "",
    "author": "MacRumors",
    "published": "2024-11-03T19:11:14+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "ff72f11c-2397-4bdb-87d4-f07a6256e9ae",
    "title": "iOS 18.2 beta 2 is available with Genmoji, Image Playground, ChatGPT and more",
    "link": "https://www.macworld.com/article/2499054/ios-18-2-apple-intelligence-siri-genmoji-install-release-beta.html",
    "description": "Macworld Beta testing for iOS 18.2 is in progress. While iOS 18.1 was the first release with Apple Intelligence features for supported phones, many of the most exciting features are coming in iOS 18.2. This release includes Visual Intelligence, Genmoji, the Image Playground app, the new Mail app with AI-sorted categories, and integration with ChatGPT. While the AI features of iOS 18.1 might make the average iPhone 16 user say, “Is that it?” the Apple Intelligence features in 18.2 will be a little more sensational. However, while Siri’s interface changed in iOS 18.1, the new smarter Siri still isn’t a part of this release. That will likely be coming in iOS 18.3 or 18.4, due for release around March 2025. We have a list of the Apple Intelligence features coming to iOS 18 along with their expected release timeframes. This beta is available only to developers so far, but a public beta will likely come soon. Updated November 6: The first public beta release of iOS 18.2 is now available. It corresponds with developer beta 2, released two days ago. iOS 18.2: All the new features The iOS 18.2 beta release is only available for iPhones that can run Apple Intelligence: iPhone 15 Pro and Pro Max, or any iPhone 16. There is also a secondary waiting list to access certain features. If you were on the original waiting list for Apple Intelligence features in iOS 18.1 you will get access to ChatGPT integration, Visual Intelligence, and the new Writing Tools features. But you’ll have to hop onto a second waiting list for the image generation features—Genmoji, Image Playground, and the Image Wand tool. Here’s what’s available in the iOS 18.2 beta so far: Writing Tools updates: Instead of just choosing to make a selection of text more professional, causal, or concise, you will have a freeform field to describe how you want to transform text. Examples: make this a poem, include a lot of dad jokes, or use a lot of sarcasm. Genmoji: Create a new emoji right on the system keyboard. Image Playground: Generate new images based on text prompts. Apple will suggest new costumes, items, or locations, and will make suggestions based on the context of a Messages thread or note in the Notes app. Images can be based on people you know by using identified images in Photos. Images are limited to cartoon or illustrative styles rather than realistic. Visual Intelligence: For iPhone 16 owners with the Camera Control button. Press and hold Camera Control to get additional information about a location, translate a sign or poster, detect phone numbers and addresses to quickly add to Contacts, and more. You can also tap a button to ask ChatGPT about what’s on screen, or another to perform a Google image search. Image Wand: An offshoot of Image Playground, this uses Apple’s image generation tools to create an image in an open area on a note in the Notes app, using the context from the surrounding area and the rest of the note. Start with a blank area or a rough sketch you make yourself. ChatGPT integration: If Siri can’t answer a question, it now has the option to ask ChatGPT. You need to give permission for each request and only limited data is shared. You don’t need to log into ChatGPT, but you are able to if you want to, or have a premium ChatGPT account you wish to use. You can ask Siri to have ChatGPT generate images., and use ChatGPT in the Writing Tools to generate text, too. In addition to the new user-facing features, there are new developer tools for integrating image generation and writing tools into third-party apps. Apple Intelligence is localized into English for Australia, Canada, New Zealand, South Africa, and the UK in this release. Default Apps: Users worldwide have a new “Default Apps” section at the top Settings \u003e Apps, where you can choose your default email, messaging, calling, call filtering, browser, password app, and keyboard. The messaging and calling options are new, and the other options have all been brought under a single menu. EU-specific features: In the EU, third-party browser that use their own custom web engines can now add web apps. EU users will also be able to delete the App Store. AE/AF Lock: In Settings \u003e Camera, you’ll find a new toggle for a light press on the Camera Control button to lock exposure and focus. Find My share item location: Find My will let you share the location of an AirTag (or other Find My compatible item) with a trusted person. The link can be opened on a non-Apple device and expires after a week. iOS 18.2: How to install the iOS beta The iOS 18.2 beta is currently only available for developers, but anyone can get it. Since the introduction of iOS 17, it’s not necessary to be in the $99 per year developer program to access the developer beta, a free developer account will do. You can get one via Xcode or the Apple Developer app in iOS. Here’s how to do it via the Apple Developer app: Download the Apple Developer App from the App Store. Open the app. Tap on Account. Sign in using your usual Apple ID. Registered developers can choose to get the iOS 18.2 beta instead by going to the Settings app, then General \u003e Software Update, and selecting iOS Developer Beta in the Beta Updates tab. When you return to the main Software Update screen, you’ll Upgrade to iOS 18 at the bottom of the screen under the Also Available heading. Tap that and it’ll take you to the iOS 18.2 beta. As always, remember to back up your iPhone before you install the beta. If you want to run the public beta, follow these steps: Head to beta.apple.com and register your Apple ID for the beta. Go to Settings \u003e General \u003e Software Update \u003e Beta Updates and select the beta you wish to install. Follow the on-screen instructions to download and install the beta.",
    "author": "",
    "published": "Wed, 06 Nov 2024 23:44:51 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2024/11/ios18-2-hero-5.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "iOS"
    ]
  },
  {
    "id": "7ccd2b15-55bf-46e0-bdb2-42c8d152ec82",
    "title": "Best iPad for seniors 2024",
    "link": "https://www.macworld.com/article/678457/which-is-the-best-ipad-for-seniors.html",
    "description": "Macworld If you’re an older user looking to pick up an iPad or someone wanting to gift an Apple tablet to Grandad or Grandma, which is the best iPad to choose? There’s a fair selection in the current Apple catalog, from the diminutive iPad mini all the way up to the incredibly powerful (not to mention very expensive) iPad Pro. It can be intimidating, especially as different users have different needs. To help you make sense of it all, here’s our guide to finding the best iPad for seniors. What makes an iPad good for older users? iPad owners don’t magically transform into timid technophobes on their 70th birthdays, and there isn’t one right answer to this question. Any iPad model might turn out to be the right choice for a specific older user, depending on that user’s precise requirements. But there are a few criteria that tend to become more of a factor when our bodies begin to age. Screen size is one element, with eyes not being as strong as they once were. Weight/portability can also become more important; some older users have arthritis, while others find they tire more easily than they used to when using a tablet for extended periods of time. We will also want to think carefully about price versus power and features, since you don’t want to spend lots of money on a device with capabilities you’ll never really use. But, as we say, these can be true for any user, so it’s always best to talk to the person in question about their particular needs if you want to pick the perfect tablet. If you were to put us on the spot, however, we do have some thoughts about the iPads that are most likely to suit an older user. Here’s our selection. Best affordable option: iPad (2022, 10th generation) Pros Affordable A14 Bionic processor Support for Apple Pencil (USB and 1st Gen) Solid performance Cons No Home button Base 64GB storage is quite low Price When Reviewed: From $349 (64GB) | $499 (256GB) (was $449 and $599) Best Prices Today: $299 at Amazon$299 at Best Buy$299.99 at Target At $349, the 10th-gen iPad may well be the cheapest iPad model in Apple’s current lineup, but that doesn’t mean it’s a truly ‘budget’ device in the pejorative sense. For many (perhaps most) people, this iPad will deliver everything you want from a tablet and not cost you a small fortune in the process. Apple’s A14 Bionic chip powers the iPad and it’s ideal for surfing the web, watching streaming services, and shopping online. It’s an older processor–Apple is using more-recent M-series chips in the more-expensive iPad Air and iPad Pro, but it’s a chip that should be supported by Apple for a few more years. For FaceTime calls there’s a 12MP Ultra Wide front camera that offers advanced features such as Center Stage (which allows you to move around on video calls while the iPad tracks you so you don’t disappear out of view) and 1080p video. This iPad was the first to place the camera on the longer side of the iPad, so when you use it, the iPad should be in landscape mode. Why are these features particularly good for seniors? Well, having an excellent video-call experience will allow them to keep in touch with the grandkids, friends or family around the world, without looking grainy or like they’re calling from the early 2000s. The 10.9-inch display is also large enough for eyes that might be starting to diminish, while the touch targets on the screen will be easy to hit with unsteady hands. Of course, many seniors are full of more life and vigor than their grandchildren, and the ability to connect an Apple Smart keyboard and first-gen Apple Pencil makes this a perfect companion for traveling while writing memoirs or creating art. It’s also the only remaining iPad to feature a headphone jack, which could be very useful if the intended recipient hasn’t yet embraced the wireless charms of the AirPods or AirPod Pros. Another major change Apple made with the 10th-gen iPad (in addition to moving the front-facing camera) is that it no longer has a Home button. iPadOS features many great swipe gestures for navigating through apps and menus, and to get to the Home screen, you swipe up from the bottom center of the display. Touch ID is now located on the power button. The 10th-gen iPad comes in these storage options, priced as follows: 64GB: $349/£349 256GB: $499/£499 If you want to add cellular capabilities then those are also available: 64GB (cellular): $499/£499 256GB (cellular): $649/£649 It isn’t just the best choice for older users, but probably for most users. If you prefer an iPad with a Home button, you can probably find a 9th-generation iPad, which is the last one with a Home button, You may be able to find stock at a third-party retailer. Apple sells refurbished iPads in its Certified Refurbished Store (U.S. or U.K.) but the inventory availability fluctuates a lot, so it may not be in stock when you check. Be sure to check back at a later time. Read our full 10th-gen 10.9-inch iPad (2022) review Best lightweight option: iPad mini (A17 Pro) Pros Lightweight Modern design A17 Pro processor Cons Smaller screen size 128GB storage on base model Price When Reviewed: $499 (128GB; Wi-Fi only) | $599 (256GB; Wi-Fi only) | $799 (512GB; Wi-Fi only) Best Prices Today: $478 at Amazon$499 at Apple$499 at Apple United States It’s a sad fact that as we age our bodies can lose some of their strength or gain some conditions that we avoided when younger. If you’re looking for a lightweight iPad, and therefore easier to hold for longer periods, then the iPad mini (A17 Pro) is the one to choose. At around 0.65lbs/293g it’s roughly half the weight of the 10th gen iPad discussed above. This is made possible, as the name suggests, by the smaller display. But the 8.3-inch panel is still an excellent size for the web, not to mention better as an e-reader thanks to being easier to hold. Under the hood, the iPad mini is a powerhouse, with an A17 Pro chip (as seen in the iPhone 15 Pro), 5G capabilities on the LTE models, and powerful cameras with the same Ultra Wide front-facing module as on the 10th-gen iPad. It’s compatible with the Apple Pencil (USB-C) and the Apple Pencil Pro and various Bluetooth keyboards, so you can use it like a small laptop if you want to get stuff done. It’s a lovely package that offers the most portable solution for those who want to take their iPad with them. The iPad mini (A17 Pro) is available in these configurations: iPad mini (A17 Pro, Wi-Fi) 128GB: $499/£499 iPad mini (A17 Pro, Wi-Fi) 256GB: $599/£599 iPad mini (A17 Pro, Wi-Fi) 512GB: $799/£799 iPad mini (A17 Pro, Wi-Fi + cellular) 128GB: $649/£649 iPad mini (A17 Pro, Wi-Fi + cellular) 256GB: $749/£749 iPad mini (A17 Pro, Wi-Fi + cellular) 512GB: $949/£949 Check our guide to the best iPad mini deals to see if you can get one for a lower price.  Read our full Apple iPad mini (A17 Pro) review Best all-rounder: iPad (2022, 10th generation) Pros 10.9-inch Liquid Retina Display Modern design Landscape camera Various colors USB-C port Cons Higher price than previous generations 64GB of storage on base modell Price When Reviewed: From $449 Best Prices Today: $449 at Apple The newest device on this list is the 10th generation iPad, which arrived in October 2022 without the Home button design of its forebears and follows the aesthetic established by iPad mini and iPad Air. Although the Home button is gone, this iPad still features Touch ID, it’s just that the sensor is now part of the power button that resides on the top edge of the device. This allows Apple to fit a large 10.9-inch Liquid Retina Display into a chassis that’s almost the same size as the 9th generation iPad, which has a 10.2-inch screen. This increased screen real estate will be attractive to those who prefer larger fonts and should make tapping on-screen buttons a little easier for unsteady hands. One of the main new features, aside from the overall design, is that Apple has finally moved the front-facing camera from the traditional top bezel to the longer side one. This essentially turns it from portrait to landscape, hence the name Landscape Ultra Wide camera. The upside of this is that you can sit the iPad on its longer side when making FaceTime calls, which will have you looking into the middle of the camera rather than it being off to the side. There’s also support for Centre-Stage, so if you move around, the software will keep you in the center of the shot. This makes it the best iPad for FaceTime calls with family. The included A14 Bionic chip, which previously powered the iPhone 12 range (including the Pro models), means there’s plenty of performance available for most. You can use the 1st generation Apple Pencil on this device, and the new USB-C port opens up a world of peripherals you can plug into the iPad. These include keyboards, external storage, and even monitors if you want a pseudo-desktop PC. One drawback of this switch is that owners of a 1st generation Apple Pencil will need to buy an adaptor to be able to charge it from the iPad. If you buy a new Pencil from Apple, the adapter is now included in the box. The iPad comes in four attractive colors (Blue, Pink, Yellow, and Silver). These are the available configurations: 64GB: $349/£349 256GB: $499/£499 64GB (cellular): $499/£499 256GB (cellular): $649/£649 As with the other iPads on this list, you might want to consider opting for the 256GB storage variant, as 64GB can fill up pretty quickly if you like to store photos and videos on the device itself. Apple also offers a new keyboard case called the Magic Keyboard Folio, which is nice but costs an eye-watering $249/£279, so we’d advise looking for cheaper (and often just as good) third-party products instead. See our iPad keyboard roundup. Like the iPad mini the iPad may also get an update in 2024. For more information, take a look at our Everything you need to know about the iPad 10.9-inch (10th Generation) guide. Best performance option: 11-inch iPad Air (2024) Pros M2 processor USB-C port Apple Pencil (2nd Gen) support Smart connector Cons Getting expensive Price When Reviewed: $599 (128GB, Wi-Fi only) Best Prices Today: $551 at Amazon$599 at Apple$599 at Apple United States While it’s true that the iPad Pro models are the most powerful iPads available, for most people they are simply overkill. Also, they come with Pro-level prices, which isn’t great if you’re only going to use them to watch videos and FaceTime the grandkids. For the more discerning user who requires plenty of power but at a reasonable price, the iPad Air is an excellent solution. There’s not much to differentiate the 10th-gen iPad and the 11-inch iPad Air. but, when you look closely, you can see from where the extra expense comes. The two devices are around the same size, and both sport a Liquid Retina display, but the one on the Air is fully-laminated, so there’s no air-gap between the glass and digitizer, which makes it feel like you’re touching the actual pixels and makes using the compatible Apple Pencil (2nd gen) that much smoother. They feature the same 12MP cameras on the back and front on the longer side of the device. But, under the hood the Air has the incredibly powerful M2 processor, which was previously found in the last generation of iPad Pros, not to mention several recent Macs. This takes things to another level. If someone wants to play games, use graphically intensive apps or just wants a really fast user experience, then the M2 delivers that in spades. The iPad Air has often been called the iPad Pro for normal people, and that’s exactly what it is. The USB-C port allows you to connect various external devices, such as storage or monitors, so it can easily transform into a laptop with a processor that’s desktop-class. Apple offers the sleek Magic Keyboard folio case, but at $299/£319 it’s way overpriced, so we’d suggest a third-party Bluetooth keyboard and case as a more frugal option. The iPad Air base configuration has 128GB of storage, twice that of the base 10th-gen iPad. That should be plenty for most people; you can rely on iCloud storage if you’re worried that you’ll run out of space. You can also go with the more expensive 256GB configuration.   You can pick up the 11-inch iPad Air in the following configurations:  iPad Air (2024, Wi-Fi) 128GB: $599/£599 iPad Air (2024, Wi-Fi) 256GB: $699/£699 iPad Air (2024, Wi-Fi) 512GB: $899/£899 iPad Air (2024, Wi-Fi) 1TB: $1,099/£1,099 iPad Air (2024, Wi-Fi + Cellular) 128GB: $749/£749 iPad Air (2024, Wi-Fi + Cellular) 256GB: $849/£849 iPad Air (2024, Wi-Fi + Cellular) 512GB: $1,049/£1,049 iPad Air (2024, Wi-Fi + Cellular) 1TB: $1,249/£1,249 Also read our roundup of the best iPad Air deals too, so you don’t miss out on any great offers.  Read our full Apple iPad Air 11-inch (M2, 2024) review Best luxury option: iPad Pro (2024) Pros Insanely powerful Best iPads money can buy ProMotion displays Cons Very expensive Too much power for most people Price When Reviewed: $999 (Wi-Fi only) Best Prices Today: $999 at Apple$1099 at Best Buy$1,154.49 at Amazon For those to whom money is no object or require the highest-end performance an iPad can deliver, the iPad Pro is the only choice. Recently upgraded to the latest M4 processor, these are devices that absolutely fly. Every appointment is top-notch, from the Ultra Retina XDR display with super-smooth ProMotion technology to the USB-C ports that support Thunderbolt 4. These are Pro devices. With that is the caveat that most people won’t necessarily see these benefits unless they are using pro-level apps that push the device hard. The Pro comes in two sizes, 11-inch and 13-inch, with the latter being an absolute whopper. If you need a large screen then this is as big as it gets. Apple offers a 13-inch iPAd Air that’s cheaper, but its screen isn’t as nice as the Pro, and the Air is actually heavier than the Pro. (Go figure.) To anyone other than a professional designer, animator, or digital specialist who can harness the power of the iPad Pros, these are simply too much and your money would be better spent on the iPad Air. But, if that’s you or you just want a luxury iPad to enjoy, then this is the premium end of the street. The iPad Pro 11-inch (2024) is available in the following configurations: 256GB: $999/£999 512GB: $1,199/£1,199 1TB: $1,599/£1,599 2TB: $1,999/£1,999 If you want 5G cellular capabilities, then these are the options: 256GB (Cellular): $1,199/£1,199 512GB (Cellular): $1,399/£1,399 1TB (Cellular): $1,799/£1,799 2TB (Cellular): $2,199/£2,199 The iPad Pro 13-inch (2024) is available in these configurations: 256GB: $1,299/£1,299 512GB: $1,499/£1,499 1TB: $1,899/£1,899 2TB: $2,299/£2,299 Here are the prices for the cellular-equipped models: 256GB (Cellular): $1,499/£1,499 512GB (Cellular): $1,699/£1,699 1TB (Cellular): $2,099/£2,099 2TB (Cellular): $2,499/£2,499 Check out our roundup of the best iPad Pro deals to see if you can get a good bargain on these flagship devices. For more about how the iPad Pro and iPad Air compare read iPad Air (M2) vs iPad Pro (M4). Read our full Apple iPad Pro 11-inch (M4, 2024) review",
    "author": "",
    "published": "Wed, 06 Nov 2024 21:45:21 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2024/11/ipad-10th-gen-colors-1.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "iPad"
    ]
  },
  {
    "id": "0e946203-8218-4643-b12d-2ba68f442fc0",
    "title": "Touching up paint is tough, but not with a (cheap) RGB color sensor",
    "link": "https://www.cultofmac.com/daily-deals/nix-mini-3-rgb-color-sensor",
    "description": "Save time on your next paint job with the Nix Mini 3 RGB color sensor. This compact color sensor can identify colors on most surfaces. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Cult of Mac Deals",
    "published": "Wed, 06 Nov 2024 22:10:01 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2024/08/nix-mini-3.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Daily deals",
      "Cult of Mac",
      "Nix Mini"
    ]
  },
  {
    "id": "89384608-cf95-4660-9fdf-c03e949339a2",
    "title": "New 5K monitor comes with Studio Display specs at half the price",
    "link": "https://www.cultofmac.com/news/asus-5k-display",
    "description": "Asus just made waves with its new ProArt Display PA27JCV, launching the 5K monitor at an eye-catching $799 price point. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "David Snow",
    "published": "Wed, 06 Nov 2024 20:48:34 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2024/11/Asus-ProArt-Display-5K-PA27JCV_front-view.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "News",
      "5K displays",
      "Asus",
      "Pro Display XDR",
      "Studio Display"
    ]
  },
  {
    "id": "69d382b1-a45d-499a-bd29-370863b63957",
    "title": "Beta 2 of iOS 18.2, MacOS Sequoia 15.2, \u0026 iPadOS 18.2 Available for Testing",
    "link": "https://osxdaily.com/2024/11/05/beta-2-of-ios-18-2-macos-sequoia-15-2-ipados-18-2-available-for-testing/",
    "description": "The second beta versions of iOS 18.2, MacOS Sequoia 15.2, and iPadOS 18.2 are now available for users participating in the beta testing programs for Apple system software. The new betas continue to focus on additional Apple Intelligence features, expanding beyond the writing tools, smart replies, and summary features what was initially introduced in iOS ... Read More",
    "author": "Paul Horowitz",
    "published": "Tue, 05 Nov 2024 22:51:50 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "News",
      "beta",
      "iOS 18 beta",
      "iOS 18.2",
      "iPadOS 18 beta",
      "MacOS Sequoia beta"
    ]
  },
  {
    "id": "532696be-37f6-4453-bb27-fda9bce7f68b",
    "title": "How to Change iPhone Used by iPhone Mirroring on Mac",
    "link": "https://osxdaily.com/2024/11/05/how-to-change-iphone-used-by-iphone-mirroring-on-mac/",
    "description": "If you have several iPhone’s, as many people do when they buy a new iPhone, upgrade, get a hand-me-down, develop iPhone software, or develop mobile sites or apps where you test things on multiple devices, you might be in a situation where iPhone Mirroring on the Mac is using an iPhone that you do not ... Read More",
    "author": "Paul Horowitz",
    "published": "Tue, 05 Nov 2024 18:48:30 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "iPhone",
      "Mac OS",
      "Tips \u0026 Tricks",
      "iPhone mirroring",
      "Mac",
      "macOS",
      "tips",
      "tricks",
      "Troubleshooting"
    ]
  },
  {
    "id": "94e69ff3-13ed-4b74-b888-96edc94b261e",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "eb266bc4-5ff4-42bf-840e-3f9bd896f4aa",
    "title": "The Overcast Redesign: Part One",
    "link": "https://marco.org/2022/03/25/overcast-redesign-2022",
    "description": "Overcast’s latest update (2022.2) brings the largest redesign in its nearly-eight-year history, plus many of the most frequently requested features and lots of under-the-hood improvements. I’m pretty proud of this one. For this first and largest phase of the redesign, I focused on the home screen, playlist screen, typography, and spacing. (I plan to revamp the now-playing and individual-podcast screens in a later update.) The home screen is radically different: Home screen, before (left) and after (right). Playlists now have strong visual identities for nicer and easier navigation. Each playlist has a customizable color, and a custom icon can be selected from over 3,000 SF Symbols to match modern iOS design and the other icons within Overcast. And playlists can be manually reordered with drag-and-drop. Recently played and newly published episodes can now be displayed on the home screen for quick access, much like the widget and CarPlay experience. Podcasts can now be pinned to the top of the home-screen list. Pinned podcasts can also be manually reordered with drag-and-drop. I’ve also rethought the old stacked “Podcasts” and “Played Podcasts” sections to better match people’s needs and expectations. Now, the toggle atop the podcast list switches between three modes: podcasts with current episodes, all followed podcasts, and inactive podcasts (those that you don’t follow and therefore won’t get any more episodes from, or haven’t posted a new episode in a long time). The playlist screen’s structure remains mostly the same, while refining the design for the modern era: Playlist screen, before (left) and after (right). Here, it’s more apparent that I’ve replaced the system San Francisco font with an alternate variant, San Francisco Rounded, to increase legibility and better match the personality of the app. I’ve also added highly demanded features: By far, Overcast’s most-requested feature is a Mark as Played feature. That’s now available as a checkmark button on episode rows, as well as a left-side swipe action. The second-most-requested feature is a way to view all starred episodes. Special playlists for Starred, Downloaded, and In Progress can now be created. The light and dark themes now each have a customizable tint color from the modern iOS UI-color palette, including these favorites from beta testers: And throughout the app, I’ve made tons of tweaks and bug fixes, including: Notifications and background downloads are now much more reliable. Episode downloads can now be individually deleted or re-downloaded. Links can now be opened in Safari. (under Nitpicky Details) Performance is now significantly better with very large playlists and collections. Fixed bugs with episode-duration detection, CarPlay lists, Mac-app sharing, and much more. So much is better in this update that I can’t even remember it all. Thank you so much to everyone who helped me beta-test this massive update. As always, Overcast is free in the App Store. Go get it!",
    "author": "",
    "published": "Fri, 25 Mar 2022 10:57:51 EDT",
    "image": "https://marco.org/media/2022/03/ocredesign2022-1-after.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "429a4538-1567-4045-839b-7882b7a13a87",
    "title": "Raycast Overhauls Its Notes Feature",
    "link": "https://www.macstories.net/reviews/raycast-overhauls-its-notes-feature/",
    "description": "Raycast has always been more than an app launcher. From the start, it has included a multitude of other handy utilities, including Floating Notes. I’ve used Floating Notes now and then to park a bit of text where I knew I’d be able to find it later. Because the note floated above other windows, it […]",
    "author": "John Voorhees",
    "published": "Wed, 06 Nov 2024 14:52:16 +0000",
    "image": "https://cdn.macstories.net/cleanshot-2024-11-06-at-08-59-02-2x-1730901904653.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "reviews",
      "app",
      "mac",
      "Raycast",
      "utility"
    ]
  },
  {
    "id": "ee95ad59-edc1-48b3-93af-fea9c6471563",
    "title": "The Latest from NPC: Next Portable Console and AppStories",
    "link": "https://www.macstories.net/news/the-latest-from-npc-next-portable-console-and-appstories-7/",
    "description": "Enjoy the latest episodes from MacStories’ family of podcasts: AppStories This week, Federico and I are joined by Jonathan Reed to check in on the parts of watchOS 11 that he’s still using, talk about browsing the web from an Apple Watch, and dig into the apps he uses day-to-day. NPC: Next Portable Console On […]",
    "author": "John Voorhees",
    "published": "Wed, 06 Nov 2024 12:46:52 +0000",
    "image": "https://cdn.macstories.net/untitled-1723570559765.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "appstories",
      "NPC",
      "podcast"
    ]
  },
  {
    "id": "d98c67ae-3e7c-412d-99d9-d087bb47f1db",
    "title": "∞ The Dalrymple Report: New Macs, and On the Road Again",
    "link": "https://www.loopinsight.com/2024/11/01/the-dalrymple-report-new-macs-and-on-the-road-again/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-new-macs-and-on-the-road-again",
    "description": "As expected, Apple released a lot of new Mac models this week. iMacs, Mac minis and MacBook Pros were all refreshed with the M4 chips in additional to other changes. Just when you think I’m home, I show up in an expected location to record this week’s podcast. Follow this podcast Brought to you by: Incogni: Take your personal data back with Incogni! Use code DALRYMPLE and get 60% off an annual plan. Show Notes: Apple introduces new iMac supercharged by M4 and Apple Intelligence Apple’s new Mac mini is more mighty, more mini, and built for Apple Intelligence M4 Mac Mini's Power Button Has New Bottom Location Apple’s new MacBook Pro features the incredibly powerful M4 family of chips and ushers in a new era with Apple Intelligence Shows and movies we're watching Angel of Death, Max Bruce Springsteen, Road Diary, Disney+",
    "author": "Jim Dalrymple",
    "published": "Fri, 01 Nov 2024 14:43:14 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "79b606a4-4405-4780-9d0c-c0d2caa8f93d",
    "title": "∞ The Dalrymple Report: M4 Macs, Apple Behind on AI, and Genmoji",
    "link": "https://www.loopinsight.com/2024/10/25/the-dalrymple-report-m4-macs-apple-behind-on-ai-and-genmoji/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-m4-macs-apple-behind-on-ai-and-genmoji",
    "description": "Apple said on Thursday that next week will be big for the Mac. We expect new M4 Macs ro be released, but we're not quite sure which models will be upgraded. A number of people were invited to LA for a handson experience, but we'll have to wait for more details. Apple executives are disputing the fact they are behind in AI, which seems silly considering how far they are behind in AI. Apple released the next beta of iOS which includes Genmoji and ChatGPT integration. Follow this podcast Show Notes: Inside Apple's Audio Labs Apple and being behind on AI Tim Cook defends Apple coming late to AI with four words Joanna Stern interviews Craig Federighi You Can Now Try AT\u0026T's Network for Free Shows and movies we're watching Severance from Apple TV+ Green Wing, Amazon/FreeVee For All Mankind, Apple TV+",
    "author": "Jim Dalrymple",
    "published": "Fri, 25 Oct 2024 14:38:44 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "90a25a53-575f-4d0c-9367-ef81760641ef",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "82363437-7c0e-4a13-acbf-6e93a4aa950b",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  }
]
