[
  {
    "id": "c4aaf4ee-eac2-4716-9941-5cf2a47549a8",
    "title": "iPhone 16e users have been experiencing issues with Bluetooth audio",
    "link": "https://9to5mac.com/2025/03/13/iphone-16e-bluetooth-audio-issues/",
    "description": "It’s been two weeks since the iPhone 16e arrived in stores and in the hands of early adopters. Unfortunately, some of them have been experiencing issues with Bluetooth audio, especially when using wireless headphones. At least based on multiple reports from iPhone 16e owners. more…",
    "author": "Filipe Espósito",
    "published": "Fri, 14 Mar 2025 00:33:57 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/03/iPhone-16e-TrueDepth.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "af29c05a-b73a-4c17-a510-b7e2e5d832f6",
    "title": "Apple working on new live translation feature for AirPods with iOS 19",
    "link": "https://9to5mac.com/2025/03/13/live-translation-airpods-ios-19/",
    "description": "We’re only three months away from the next WWDC, when Apple will unveil iOS 19. According to recent rumors, the update will be a big one, focusing on introducing a new design for the iPhone and iPad operating system. But it seems that Apple has other cards up its sleeve, as a new report from Bloomberg says that iOS 19 will have a live translation feature for AirPods. more…",
    "author": "Filipe Espósito",
    "published": "Thu, 13 Mar 2025 20:17:18 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/11/Heartwarming-Apple-holiday-ad-showcases-AirPods-Pro-2-hearing-aid-feature.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "cc9734d6-9bfe-429b-b022-8eeb95c95134",
    "title": "💬 5 ways to text better with iPhone 16e #Shorts",
    "link": "https://www.youtube.com/watch?v=xIKJUzMvr_U",
    "description": "",
    "author": "Apple",
    "published": "2025-03-05T17:02:40+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "b667a7f8-e757-4315-899d-33881a9279d7",
    "title": "🥾 3 outdoorsy features on iPhone 16e #Shorts",
    "link": "https://www.youtube.com/watch?v=7FOyAAHF5lk",
    "description": "",
    "author": "Apple",
    "published": "2025-03-05T17:02:28+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "b94686ec-bec0-4494-bd44-0ed27551f189",
    "title": "Apple unveils immersive concert experience with Metallica for Apple Vision Pro",
    "link": "https://www.apple.com/newsroom/2025/03/apple-unveils-immersive-concert-experience-with-metallica-for-apple-vision-pro/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-03-11T22:26:38.833Z",
    "image": "https://www.apple.com/newsroom/images/2025/03/apple-unveils-immersive-concert-experience-with-metallica-for-apple-vision-pro/tile/Apple-Vision-Pro-Apple-Immersive-Video-Metallica-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "10887e9b-ce15-488d-b67c-4f61779a3264",
    "title": "Apple Arcade launches new Katamari and Space Invaders games in April",
    "link": "https://www.apple.com/newsroom/2025/03/apple-arcade-launches-new-katamari-and-space-invaders-games-in-april/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-03-11T13:59:25.997Z",
    "image": "https://www.apple.com/newsroom/images/2025/03/apple-arcade-launches-new-katamari-and-space-invaders-games-in-april/tile/Apple-Arcade-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "092fc507-3e04-4d64-a20f-169e2a150b74",
    "title": "Jabees Peace Speaker review: an inexpensive way to listen to audio while you sleep",
    "link": "https://appleinsider.com/articles/25/03/14/jabees-peace-speaker-review-an-inexpensive-way-to-listen-to-audio-while-you-sleep?utm_medium=rss",
    "description": "March 9 kicked off sleep awareness week, and Jabees has an interesting tool for soothing you to sleep — an under-pillow speaker.Jabees Peace Speaker reviewI have never, ever been what one would call \"a good sleeper.\" Even as an infant, I had difficulty catching the required amount of sleep.I've tried everything. Different beds, different pillows, yoga, breathing techniques, supplements — you name it, I've probably tried it. I can't take sleep medications like zolpidem as I'm one of the \"lucky few\" who tend to experience a wide swath of adverse reactions to drugs. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Amber Neely",
    "published": "Fri, 14 Mar 2025 00:04:34 +0000",
    "image": "https://photos5.appleinsider.com/gallery/62928-130627-FullSizeRender_VSCO-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "b7d65b49-fc4a-40c9-83a6-907e935030f1",
    "title": "OpenAI wants the US government to legalize theft to reach the AI promised land",
    "link": "https://appleinsider.com/articles/25/03/13/openai-wants-the-us-government-to-legalize-theft-to-reach-the-ai-promised-land?utm_medium=rss",
    "description": "OpenAI may have already crawled the internet for all the world's data to train ChatGPT, but it seems that isn't enough as it wants protection from copyright holders to allow it to continue stealing everything that both is and isn't nailed down.OpenAI proposes freedom of intelligence in United States. Image source: ChatGPTThe latest manufactured goalpost OpenAI has set dubbed \"AGI\" can't be reached unless the company is free to do whatever it takes to steal everything good and turn it into AI slop. At least, that's what the latest OpenAI submission to the United States Government suggests.An OpenAI proposal submitted regarding President Trump's executive order on sustaining America's global dominance explains how the administration's boogeyman might overtake the US in the AI race. It seems that the alleged theft of copyright material by Chinese-based LLMs put them at an advantage because OpenAI has to follow the law. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Wesley Hilliard",
    "published": "Thu, 13 Mar 2025 21:59:26 +0000",
    "image": "https://photos5.appleinsider.com/gallery/62964-130713-IMG_1884-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "764c1b25-ae17-471c-8087-94200b72124a",
    "title": "Discount code: This weather radar app gives you real-time data you can use",
    "link": "https://www.cultofmac.com/deals/weather-hi-def-radar-weather-app",
    "description": "Stay ahead of inclement weather events with Weather Hi-Def Radar, a weather radar app that goes beyond your phone's usual weather alerts. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Cult of Mac Deals",
    "published": "Thu, 13 Mar 2025 22:50:57 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2024/04/sale_324167_article_image.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Deals",
      "Cult of Mac Deals",
      "weather apps"
    ]
  },
  {
    "id": "2adb467c-7c7c-4220-a738-c4b5bad5b808",
    "title": "Here’s your introduction to Apple Music Classical",
    "link": "https://www.cultofmac.com/how-to/apple-music-classical",
    "description": "The Apple Music Classical iPhone app is specifically designed as a great experience for browsing and listening to instrumental music. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "D. Griffin Jones",
    "published": "Thu, 13 Mar 2025 18:10:36 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2023/03/Class-Up-The-Joint.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "How-To",
      "Apple Music",
      "iPhone",
      "Top stories"
    ]
  },
  {
    "id": "2876afdf-d84e-44c9-a9e2-7064dbdff756",
    "title": "M4 MacBook Air is Still Apple's BEST Laptop",
    "link": "https://www.youtube.com/watch?v=pdCUzCHcwIA",
    "description": "",
    "author": "MacRumors",
    "published": "2025-03-12T17:51:28+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "abe9c4f1-617e-4632-b558-891263903e0b",
    "title": "iOS 19 Will Bring Massive Design \u0026 UI Changes!",
    "link": "https://www.youtube.com/watch?v=RtVGKM3ykSQ",
    "description": "",
    "author": "MacRumors",
    "published": "2025-03-11T17:41:03+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "adcc6cf6-1d19-412c-9e8b-42b5b897189c",
    "title": "Swift Assist Hasn’t Shipped, and Isn’t Yet in Beta",
    "link": "https://mjtsai.com/blog/2025/03/12/whither-swift-assist/",
    "description": "",
    "author": "John Gruber",
    "published": "2025-03-13T16:15:39Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "e6c20524-0a98-48a1-8d37-e1b9f231f291",
    "title": "★ Something Is Rotten in the State of Cupertino",
    "link": "https://daringfireball.net/2025/03/something_is_rotten_in_the_state_of_cupertino",
    "description": "Who decided these personalized Siri features should go in the WWDC keynote, with a promise they’d arrive in the coming year, when, at the time, they were in such an unfinished state they could not be demoed to the media even in a controlled environment? Three months later, who decided Apple should double down and advertise these features in a TV commercial, and promote them as a selling point of the iPhone 16 lineup?",
    "author": "John Gruber",
    "published": "2025-03-12T23:37:14Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "370e6172-5d0a-4f9a-9cc4-951c0bd32a8d",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 10:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "83c953f0-bfef-41e4-8b60-a86b4f58ee5d",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 06:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "7f2a0d65-0d4b-40e1-849f-1bfe075f49e5",
    "title": "AirPods to get live translation feature as part of iOS 19 update",
    "link": "https://www.macworld.com/article/2636989/airpods-to-get-live-translation-feature-as-part-of-ios-19-update.html",
    "description": "Macworld According to Bloomberg’s Mark Gurman, who has a great track record for this sort of information, Apple is planning to update AirPods to offer live translation later this year. The feature will come as part of iOS 19 and necessitate a firmware update for the AirPods, too. It’s unclear which AirPods models will work with the live translation feature. It is said that Apple is preparing AirPods Pro 3 for debut later this year, but that doesn’t mean it will be limited to that model. If you speak English and someone talks to you in French, for example, your AirPods would send the audio to your iPhone where the Translate app would translate it in real time and send the resulting audio back to your AirPods. This is similar to how rival earbuds have worked for years—Google Buds have offered this feature since 2017, for example. Gurman says that Apple is “bolstering the translation technology in iOS 19, beyond the new AirPods feature” without expounding further. It’s possible that Apple will make enhanced, on-device, real-time translation a fundamental feature of iOS that can be used in any app; translating YouTube or TikTok videos, for example. We expect to hear more about iOS 19’s translation features at WWDC in June. AirPods Pro 2 USB-C Read our review Price When Reviewed: $249 Best Prices Today: $228 at Amazon | $249 at Apple",
    "author": "",
    "published": "Thu, 13 Mar 2025 21:49:56 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/03/airpods-pro-1.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Headphones, iOS"
    ]
  },
  {
    "id": "d72058b9-1621-43b0-bb51-cab6db930edd",
    "title": "The best iPhone deals this month",
    "link": "https://www.macworld.com/article/672801/best-iphone-deals.html",
    "description": "Macworld You don’t have to pay full price to buy an iPhone. If you shop around you can find a bargain. Every month the Macworld team hunts down the best prices on iPhones at all major retailers and cellphone operators, saving you the hassle of finding the best iPhone deals. In this article, we reveal the best iPhone deals, contracts, and bundles available right now. We’ll help you find a discounted iPhone suitable for any budget, and cover all the currently available models, including the brand-new iPhone 16e, as well as the iPhone 16, 16 Plus, 16 Pro and 16 Pro Max, and 2023’s iPhone 15 and 15 Plus. We also have the best prices for older iPhones, including models that Apple has removed from sale, but which you can still buy elsewhere. The iPhone 16e is the latest iPhone to arrive, launching in February 2025 and joining the iPhone 16 series, which debuted in September 2024. Later this year we expect Apple to launch the iPhone 17 series. For help deciding which iPhone to buy might like to read our detailed iPhone buying guide, and our comparison of every iPhone. We also look at the iPhone 16e vs iPhone 16 and the iPhone 16e vs the iPhone 15 to see if it’s worth saving money or spending more; plus you might be interested to read about the iPhone 14 and the iPhone 16e to see if it’s worth upgrading, and our thoughts on the same question regarding iPhone SE vs iPhone 16e. Alternatively, read: iPhone 16 vs iPhone 16 Pro and iPhone 15 vs iPhone 16. Best value iPhone deals right now U.S. In the U.S., the only big iPhone deals you can find come from carriers, and have a lot of strings attached. Typically, you have to buy a phone on a multi-year instalment plan and get your discount in the form of monthly bill credits. Optimum Mobile – New and existing Optimum Mobile customers on any plan can get the iPhone 16e 128 GB for free with a select trade-in; or they can get $400 off any iPhone 16e with any trade-in. Additionally, Optimum Mobile customers can enjoy two Unlimited lines for only $45 per month or one Unlimited line for only $25 per month Verizon – You can get up to $1,000 off on if you have the Unlimited Ultimate plan, up to $830 off with the Unlimited Plus plan, and up to $415 off with the Unlimited Welcome plan. Must trade in a phone. AT\u0026T – Offering up to $830 off iPhone 16 or $1,000 off iPhone 16 Pro, as bill credits over 36 months, you have to trade in an eligible phone, and you have to have a qualifying postpaid unlimited voice and data plan. T-Mobile – Offers up to $830 off iPhone 16 or $1,000 off iPhone 16 Pro, as bill credits over 24 months, with Go5G Next or Go5G Business Next plan. Must trade in phone for iPhone 16 Pro offer. Boost Infinite – Get $1,000 off the iPhone 16 lineup with Boost Mobile’s $65/month Infinite Access plan. No trade-in required. A full year of FREE Boost Mobile wireless service when purchasing the iPhone 16 at full price with the $25/mo Unlimited plan, or apply the offer to the $50/mo Unlimited+ or $60/mo Unlimited Premium plans. Best Buy – Best Buy will sell you an iPhone with AT\u0026T or Verizon. U.K. In the U.K., Apple-certified resellers discount unlocked iPhones frequently. Look for money off at Amazon, John Lewis, Currys, and Very. It’s currently possible to find small discounts on the 16-series iPhones. Since the iPhone 14 and iPhone SE have now been discontinued you can expect to see good deals on them as resellers clear out stock. You may also find discounts on older models such as the discontinued iPhone 15 Pro, iPhone 15 Pro Max and iPhone 14 Pro. Amazon, iPhone 16, 128GB: £739 (£60 off, RRP £799) Amazon, iPhone 16 Plus, 128GB: £849 (£50 off, RRP £899) AO.com, iPhone 16 Pro, 128GB: £949 (£50 off, RRP £999) Amazon, iPhone 16 Pro Max, 256GB: £1,129 (£70 off, RRP £1,199) Amazon, iPhone 15, 128GB: £639 (£60 off, RRP now £699) Amazon, iPhone 15 Plus, 128GB: £749 (£50 off, RRP now £799) Amazon, iPhone 15 Pro Max, 256GB: £1,049 (£150 off, RRP was £1,199–Clearance) For models that Apple no longer sells, bear in mind that we can only compare current prices against RRPs from before their discontinuation. It’s reasonable to assume that the price of the iPhone 15 Pro, for example, would have dropped in September 2024 if Apple hadn’t stopped selling it. There’s more information in the individual sections below. Also see our dedicated round-ups of the best iPhone deals: iPhone 16e, 16 \u0026 iPhone 16 Pro deals (US) and iPhone 16e, 16 \u0026 iPhone 16 Pro deals (UK) iPhone 15 \u0026 iPhone 15 Pro deals (US) and iPhone 15 \u0026 iPhone 15 Pro deals (UK) Where to buy an iPhone Apple is the obvious place to look for a new iPhone. You can purchase directly from Apple’s online store (there’s a separate U.K. store), which won’t give you savings, but does at least allow you to take advantage of trading in your old iPhone (see: How to sell or trade-in your old iPhone). We also have a complete guide to every iPhone Apple sells. Alternatively, Amazon U.K. regularly discounts iPhone models, so it’s well worth keeping an eye out there. If you think you’ll be doing lots of Amazon shopping, we’d recommend signing up to the 30-day free trial of Amazon Prime for free next-day delivery and access to deals 30 minutes early. You can sign up here. Amazon U.S. doesn’t always sell iPhones, and when it does it is usually in conjunction with one of the carriers. Some times we see Amazon savings on SIM-free iPhones. Amazon tends to sell refurbished iPhones in the U.S. It’s worth checking the price of the iPhones in the following U.S. stores, which occasionally provide solid savings: Amazon Walmart Best Buy And U.K. readers should try these shops: Amazon U.K. Argos AO Currys John Lewis Carphone Warehouse KRCS In addition, we recommend you check out our automatically updated price tables, embedded below, which gather the best prices from a wide range of retailers in your region. Where to buy an iPhone on contract Most of the major networks will offer the iPhone at a discount if you meet certain conditions (usually opening new lines, or buying on multi-year installment plans). Here are links to browse the latest deals: Optimum Mobile Verizon AT\u0026T T-Mobile Boost Infinite U.K. readers can browse contract deals using the tool embedded below. Click ‘Choose Smartphone’ to register which model you’re interested in. If you’d like to research deals for yourself, try the following U.K. providers: O2 Vodafone Three Virgin Mobile EE Sky Mobile Carphone Warehouse (use the comparison tool by clicking View Deals, and remember to tick the box labeled “Show total cost of ownership”) Trade-in discounts Don’t forget you can save when you trade in your old qualifying phone with Apple or other retailers participating in a trade-in program. Apple offers up to hundreds of dollars off your new iPhone when you trade in your old iPhone (but if your phone is older, you’ll likely get much less). You’ll have to select the trade-in option during purchase and answer a few questions about your existing phone model, storage capacity and condition. You’ll need to provide your IMEI number as well. Read about Apple’s Trade In scheme in the U.S. and U.K. In the U.K. you could get even more money off if you trade-in via Currys PC World. Head to Currys to see how much your device is worth. Amazon also offers some good trade-in values, so you should see if you can get more there. Check out Amazon’s Trade In program in the U.S. U.K. readers can see how Amazon trade-in process works here. Apple reseller KRCS also offers a trade-in scheme. Note that you can save money if you’ve got another iPhone to trade in, see: How to sell or trade in your old iPhone. Best iPhone deals right now iPhone 16e: From $599/£599 Retailer Price $599 View Deal Price comparison from over 24,000 stores worldwide Product Price Price comparison from Backmarket iPhone 16: From $799/£799 New Refurbished Retailer Price $829 View Deal $829.99 View Deal Price comparison from over 24,000 stores worldwide Product Price iPhone 16 128GB – Black – Unlocked – eSIM $717 View Deal iPhone 16 128GB – Ultramarine – Unlocked – eSIM $749 View Deal iPhone 16 128GB – Pink – Unlocked – eSIM $750 View Deal Price comparison from Backmarket iPhone 16 Plus: From $899/£899 New Refurbished Retailer Price $929 View Deal $929.99 View Deal Price comparison from over 24,000 stores worldwide Product Price iPhone 16 Plus 128GB – White – Unlocked – eSIM $799 View Deal iPhone 16 Plus 128GB – Black – Unlocked – eSIM $840.43 View Deal iPhone 16 Plus 128GB – Teal – Unlocked – eSIM $888 View Deal Price comparison from Backmarket iPhone 16 Pro: From $999/£999 New Refurbished Retailer Price $999 View Deal Apple $999 View Deal $999.99 View Deal Price comparison from over 24,000 stores worldwide Product Price iPhone 16 Pro 128GB – Natural Titanium – Unlocked – eSIM $879 View Deal iPhone 16 Pro 128GB – Desert Titanium – Unlocked – eSIM $909 View Deal iPhone 16 Pro 128GB – Black Titanium – Unlocked – eSIM $939.99 View Deal Price comparison from Backmarket iPhone 16 Pro Max: From $1,199/£1,199 New Refurbished Retailer Price $1199 View Deal $1199.99 View Deal Price comparison from over 24,000 stores worldwide Product Price iPhone 16 Pro Max 256GB – Desert Titanium – Unlocked – eSIM $1119 View Deal iPhone 16 Pro Max 256GB – Natural Titanium – Unlocked – eSIM $1145 View Deal iPhone 16 Pro Max 256GB – Black Titanium – Unlocked – eSIM $1155.61 View Deal Price comparison from Backmarket iPhone 15: Now from $699 / £699 Retailer Price $729 View Deal $729.99 View Deal Price comparison from over 24,000 stores worldwide Product Price Price comparison from Backmarket iPhone 15 Plus: Now from $799 / £799 Retailer Price $829 View Deal $829.99 View Deal Price comparison from over 24,000 stores worldwide Product Price Price comparison from Backmarket Deals on older/discontinued iPhones When Apple introduced the iPhone 16e it stopped selling the iPhone 14, 14 Plus and iPhone SE. When it introduced the iPhone 16 range it discontinued the iPhone 15 Pro and Pro Max. When Apple introduced the iPhone 15 range it discontinued the iPhone 14 Pro and iPhone 14 Pro Max, and so on… When Apple stops selling older iPhones in its store, however, that doesn’t mean they have disappeared entirely; you may find them in Apple’s refurbished store, for example. You may also find older handsets on sale at third-party stores and Apple resellers. Take a look at our round up of deals for the following discontinued iPhones: Best iPhone 14, 14 Plus, 14 Pro \u0026 Pro Max deals iBest Phone 13-series deals Best iPhone SE deals iPhone Refurbished deals If you want to save even more money you may want to consider buying a refurbished iPhone. Refurbished devices are thoroughly tested and repaired to work and look just like new. In the case of official Apple refurbished iPhones, you get a brand-new body and screen, box, accessories, battery, and warranty. It’s almost indistinguishable from buying a new iPhone. See our full guide to buying refurbished or second-hand iPhones for more. The first place to shop for a refurbished iPhone is at the Apple Refurbished Store. It will be a while before Apple offers refurbished iPhone 16 models for sale—they usually start showing up when the next model is released. Rest assured, the Apple Refurbished Store is where you can get the highest quality of refurbished iPhones. Apple’s not the only reseller to sell refurbished iPhones. You could also check the following stockists. Amazon BackMarket  Best Buy  Refurb.me  Gazelle  Reboxed",
    "author": "",
    "published": "Thu, 13 Mar 2025 17:42:46 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/03/IMG_5221-4.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "iPhone"
    ]
  },
  {
    "id": "fa5ad9cf-f7f2-4e03-ae32-beb2da6911d7",
    "title": "How to Disable Type to Siri on MacOS Sequoia",
    "link": "https://osxdaily.com/2025/03/13/disable-type-to-siri-macos-sequoia/",
    "description": "The latest versions of MacOS make it easier than ever to use Type to Siri, but many Mac users are finding themselves accidentally triggering the ‘Type to Siri’ feature on their Mac running the latest MacOS Sequoia releases. This can be frustrating, and if you don’t use Siri or Type To Siri you might not ... Read More",
    "author": "Paul Horowitz",
    "published": "Thu, 13 Mar 2025 20:41:36 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Mac OS",
      "Tips \u0026 Tricks",
      "Mac",
      "macOS",
      "Siri",
      "tips",
      "tricks",
      "Type to Siri"
    ]
  },
  {
    "id": "c253ccee-50c2-4605-a6bd-431314eb80ab",
    "title": "How Long Does Updating MacOS Take? Why Is MacOS Update Taking So Long?",
    "link": "https://osxdaily.com/2025/03/12/how-long-update-macos/",
    "description": "One of the questions many Mac users have when they see newly available system software updates for MacOS is “how long will updating MacOS take?” followed by “why is MacOS update taking forever?” These are both perfectly reasonable questions, and it’s important to remember the answers can vary. But, with modern MacOS, you can also ... Read More",
    "author": "Paul Horowitz",
    "published": "Wed, 12 Mar 2025 22:09:31 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Mac OS",
      "Tips \u0026 Tricks",
      "Troubleshooting",
      "Mac",
      "macOS",
      "software update",
      "tips",
      "tricks"
    ]
  },
  {
    "id": "8da047e0-3779-4e8b-9172-365cd2126930",
    "title": "∞ The Dalrymple Report: iPad, MacBook Air, and Mac Studio",
    "link": "https://www.loopinsight.com/2025/03/07/the-dalrymple-report-ipad-macbook-air-and-mac-studio/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-ipad-macbook-air-and-mac-studio",
    "description": "It was a big week for Apple with all kinds of new hardware announcements to fit every lifestyle and budget. We had a new iPad and a couple of models of the iPad Air; new MacBook Air M4; and the fastest Mac ever, the new Mac Studio. Follow this podcast Show Notes: Skype is dead. Long live Skype Fix for when your Apple TV remote stops changing the volume on your TV M3 iPad Air Apple unveils new Mac Studio, the most powerful Mac ever Apple reveals M3 Ultra, taking Apple silicon to a new extreme Apple announces new M4 MacBook Air, starting at $999 Shows and movies we're watching The Day of the Jackal, Peacock Boy Swallows Universe, Netflix Tracker, Paramount+",
    "author": "Jim Dalrymple",
    "published": "Fri, 07 Mar 2025 17:00:25 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "74174cd0-ef1c-459c-843a-f2a14afc479c",
    "title": "∞ The Dalrymple Report: Is iPhone 16e worth it?, WiFi QR code, and Alexa+",
    "link": "https://www.loopinsight.com/2025/02/28/the-dalrymple-report-is-iphone-16e-worth-it-wifi-qr-code-and-alexa/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-is-iphone-16e-worth-it-wifi-qr-code-and-alexa",
    "description": "The iPhone 16e was announced a little while ago so Dave and I take some time to look at the features of the new device and wonder if it fills the needs of its target market. Dave gives us a tip about giving visitors to your house a QR code to join the WiFi instead of sharing or telling everyone the password. Alexa+, Amazon's digital assistant is nearly complete and ready for primetime. Follow this podcast Show Notes: Steve Jobs' 70th birthday Jony Ive on the BBC’s Desert Island Discs Steve Jobs coin Is the iPhone 16e worth it? Passwords app and WiFi QR code Amazon Debuts Alexa+ Generative AI Shows and movies we're watching Disclaimer, Apple TV+ The Pitt, Noah Wiley, ER fame, Max",
    "author": "Jim Dalrymple",
    "published": "Fri, 28 Feb 2025 14:02:28 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "c4a3402c-e654-458c-93c5-566aa00200ba",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "64ecd41e-f56e-4f3d-9648-b3bc58d8d389",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  },
  {
    "id": "61b60398-179e-4367-8f0f-886c4249a311",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "f5b75b15-fa50-4bcf-b2e5-8c1580361f41",
    "title": "The Overcast Redesign: Part One",
    "link": "https://marco.org/2022/03/25/overcast-redesign-2022",
    "description": "Overcast’s latest update (2022.2) brings the largest redesign in its nearly-eight-year history, plus many of the most frequently requested features and lots of under-the-hood improvements. I’m pretty proud of this one. For this first and largest phase of the redesign, I focused on the home screen, playlist screen, typography, and spacing. (I plan to revamp the now-playing and individual-podcast screens in a later update.) The home screen is radically different: Home screen, before (left) and after (right). Playlists now have strong visual identities for nicer and easier navigation. Each playlist has a customizable color, and a custom icon can be selected from over 3,000 SF Symbols to match modern iOS design and the other icons within Overcast. And playlists can be manually reordered with drag-and-drop. Recently played and newly published episodes can now be displayed on the home screen for quick access, much like the widget and CarPlay experience. Podcasts can now be pinned to the top of the home-screen list. Pinned podcasts can also be manually reordered with drag-and-drop. I’ve also rethought the old stacked “Podcasts” and “Played Podcasts” sections to better match people’s needs and expectations. Now, the toggle atop the podcast list switches between three modes: podcasts with current episodes, all followed podcasts, and inactive podcasts (those that you don’t follow and therefore won’t get any more episodes from, or haven’t posted a new episode in a long time). The playlist screen’s structure remains mostly the same, while refining the design for the modern era: Playlist screen, before (left) and after (right). Here, it’s more apparent that I’ve replaced the system San Francisco font with an alternate variant, San Francisco Rounded, to increase legibility and better match the personality of the app. I’ve also added highly demanded features: By far, Overcast’s most-requested feature is a Mark as Played feature. That’s now available as a checkmark button on episode rows, as well as a left-side swipe action. The second-most-requested feature is a way to view all starred episodes. Special playlists for Starred, Downloaded, and In Progress can now be created. The light and dark themes now each have a customizable tint color from the modern iOS UI-color palette, including these favorites from beta testers: And throughout the app, I’ve made tons of tweaks and bug fixes, including: Notifications and background downloads are now much more reliable. Episode downloads can now be individually deleted or re-downloaded. Links can now be opened in Safari. (under Nitpicky Details) Performance is now significantly better with very large playlists and collections. Fixed bugs with episode-duration detection, CarPlay lists, Mac-app sharing, and much more. So much is better in this update that I can’t even remember it all. Thank you so much to everyone who helped me beta-test this massive update. As always, Overcast is free in the App Store. Go get it!",
    "author": "",
    "published": "Fri, 25 Mar 2022 10:57:51 EDT",
    "image": "https://marco.org/media/2022/03/ocredesign2022-1-after.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "ab8af721-7528-4644-a636-e7177a7ae6a1",
    "title": "The iPad’s “Sweet” Solution",
    "link": "https://www.macstories.net/stories/the-ipads-sweet-solution/",
    "description": "In working with my iPad Pro over the past few months, I’ve realized something that might have seemed absurd just a few years ago: some of the best apps I’m using – the ones with truly desktop-class layouts and experiences – aren’t native iPad apps. They’re web apps. Before I continue and share some examples, […]",
    "author": "Federico Viticci",
    "published": "Thu, 13 Mar 2025 15:50:42 +0000",
    "image": "https://cdn.macstories.net/image-1741863721676.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "stories",
      "browser",
      "iPad",
      "web"
    ]
  },
  {
    "id": "d8c7b6d6-41a6-4b7e-b8da-3be8da02e315",
    "title": "Where’s Swift Assist?",
    "link": "https://www.macstories.net/linked/wheres-swift-assist/",
    "description": "Last June at WWDC, Apple announced Swift Assist, a way to generate Swift code using natural language prompts. However, as Tim Hardwick writes for MacRumors, Swift Assist hasn’t been heard from since then: Unlike Apple Intelligence, Swift Assist never appeared in beta. Apple hasn’t announced that it’s been delayed or cancelled. The company has since […]",
    "author": "John Voorhees",
    "published": "Thu, 13 Mar 2025 13:16:27 +0000",
    "image": "",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "Linked",
      "developer tools",
      "developers",
      "Swift"
    ]
  }
]
