[
  {
    "id": "fcf6d37e-e4fa-49ca-b101-55f97922bb03",
    "title": "Apple Intelligence | Imagine it. Genmoji it. | iPhone 16",
    "link": "https://www.youtube.com/watch?v=XROs4K67Y9Q",
    "description": "",
    "author": "Apple",
    "published": "2024-12-11T23:27:34+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "61a71a92-6821-4e1b-a194-6ce879a2c3ee",
    "title": "Recorded on iPhone 16 Pro | Michael Bublé, Carly Pearce “Maybe This Christmas” | Apple",
    "link": "https://www.youtube.com/watch?v=x88hdYjaBRo",
    "description": "",
    "author": "Apple",
    "published": "2024-12-11T18:02:41+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "af6d7814-5ded-4327-b546-a063984c1089",
    "title": "Elevate your holiday entertainment with XGIMI’s projectors",
    "link": "https://9to5mac.com/2024/12/14/elevate-your-holiday-entertainment-with-xgimis-projectors/",
    "description": "This holiday season, XGIMI is offering an array of cutting-edge projectors that promise to transform your festive gatherings into unforgettable experiences. With limited-time discounts and special bundle deals, there’s never been a better time to upgrade your home entertainment system or find the perfect gift for the tech enthusiast in your life. more…",
    "author": "Sponsored Post",
    "published": "Sat, 14 Dec 2024 21:56:10 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/12/xgimi-holiday.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "fb80578a-a0ea-4011-bcef-d06afbcd0099",
    "title": "Indie App Spotlight: ‘TechniCalc’ is a comprehensive calculator with a clean interface",
    "link": "https://9to5mac.com/2024/12/14/indie-app-spotlight-technicalc-is-a-comprehensive-calculator-with-a-clean-interface/",
    "description": "Welcome to Indie App Spotlight. This is a weekly 9to5Mac series where we showcase the latest apps in the indie app world. If you’re a developer and would like your app featured, get in contact. TechniCalc is a fully featured calculator app, with all of the advanced features you’d need – but without a clunky or outdated UI. It focuses on being clean, easy to use, while being good for mathematicians. It’s available for iPhone, iPad, Mac. more…",
    "author": "Michael Burkhardt",
    "published": "Sat, 14 Dec 2024 20:30:00 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/12/TechniCalc.png?w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "5d844b4c-8279-4c93-b6f1-5bbd760807e3",
    "title": "His Majesty King Charles III visits Apple’s U.K. headquarters",
    "link": "https://www.apple.com/newsroom/2024/12/his-majesty-king-charles-iii-visits-apples-uk-headquarters/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2024-12-12T19:07:54.930Z",
    "image": "https://www.apple.com/newsroom/images/2024/12/his-majesty-king-charles-iii-visits-apples-uk-headquarters/tile/Apple-Battersea-community-impact-Tim-Cook-and-King-Charles-III-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "PHOTOS"
    ]
  },
  {
    "id": "e3c5bc3e-7a60-43e9-8764-5da018f8772e",
    "title": "Voice Memos update brings Layered Recording to iPhone 16 Pro lineup",
    "link": "https://www.apple.com/newsroom/2024/12/voice-memos-update-brings-layered-recording-to-iphone-16-pro-lineup/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2024-12-11T17:59:58.112Z",
    "image": "https://www.apple.com/newsroom/images/2024/12/voice-memos-update-brings-layered-recording-to-iphone-16-pro-lineup/tile/Apple-Voice-Memos-update-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "1afdf22c-9077-4696-a322-e8467dd985eb",
    "title": "This 14-inch MacBook Pro just fell to $1,299, an all-time low price",
    "link": "https://appleinsider.com/articles/24/12/15/this-14-inch-macbook-pro-just-fell-to-1299-an-all-time-low-price?utm_medium=rss",
    "description": "In an exclusive holiday blowout deal, Apple Authorized Reseller B\u0026H has dropped the price of a closeout M3 MacBook Pro 14-inch to just $1,299 when equipped with 16GB RAM.Get a 14-inch MacBook Pro for $1,299 just in time for the holidays.Save $500 on the M3 14-inch MacBook Pro with 16GB of RAM and 512GB of storage when you shop through the special pricing links in this post* from a laptop or desktop computer.Buy for $1,299 Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Christine McKee",
    "published": "Sun, 15 Dec 2024 01:12:42 +0000",
    "image": "https://photos5.appleinsider.com/gallery/62022-128449-m3-macbook-pro-1299-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "5a203988-06db-4f04-bc72-1b39963619ec",
    "title": "Apple may discontinue current iPhone SE \u0026 iPhone 14 models in EU",
    "link": "https://appleinsider.com/articles/24/12/14/apple-may-discontinue-current-iphone-se-iphone-14-models-in-eu?utm_medium=rss",
    "description": "If you are in the EU and were thinking of buying an iPhone SE or iPhone 14 from Apple, you might want to hurry.The iPhone SE, and remaining iPhone 14 models, may be discontinued soon.A new rumor suggests that Apple may discontinue selling the current iPhone SE and iPhone 14 models it still offers by the end of the year. The report is likely to turn out to be true, but for the wrong reasons.The theory behind the claim was originally posted by French site iGeneration. The claim posits that Apple does not want to run afoul of a European Union mandate that all smartphones sold there must use the USB-C connector as of January 2025. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Charles Martin",
    "published": "Sat, 14 Dec 2024 17:08:00 +0000",
    "image": "https://photos5.appleinsider.com/gallery/62050-128524-61458-126966-60686-124899-47545-92860-iPhone-SE-3-Starlight-On-Wrist-Rest-xl-xl-xl-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "5c2f5765-0d8a-4719-bab8-50a45ea08b77",
    "title": "Disable Mail Categories in iOS 18.2 👎",
    "link": "https://www.youtube.com/watch?v=BB0n22TE3e4",
    "description": "",
    "author": "MacRumors",
    "published": "2024-12-14T17:42:21+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "d310e5be-72f6-4d1e-bb67-16324c68edda",
    "title": "iOS 18.2 Mail Features: How to Use Categories (and How to Turn Them OFF)",
    "link": "https://www.youtube.com/watch?v=zfyIjRIPUcQ",
    "description": "",
    "author": "MacRumors",
    "published": "2024-12-13T20:05:34+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "207a6de9-7356-4be9-a878-1d6a6636c02c",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 11:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "071ff93e-1064-42c2-8de9-398a046bddf2",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 07:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "84d9b633-eb6a-45f6-9332-1917e1f3e785",
    "title": "Cool technology gifts [Last-minute gift guide]",
    "link": "https://www.cultofmac.com/buying-guides/cool-technology-gifts",
    "description": "Looking for cool technology gifts for Xmas? We have a few suggestions for last-minute shoppers. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Leander Kahney",
    "published": "Sat, 14 Dec 2024 18:15:48 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2024/12/Cult-of-Mac-gift-guide-2024.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Buying guides",
      "gift guide"
    ]
  },
  {
    "id": "5ddee7b9-af33-43f4-af59-08b061a4f58b",
    "title": "How to watch A Charlie Brown Christmas for free",
    "link": "https://www.cultofmac.com/how-to/how-to-watch-a-charlie-brown-christmas-for-free",
    "description": "The classic \"A Charlie Brown Christmas\" is free for all to stream later this month, whether you’re an Apple TV+ subscriber or not. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Ed Hardy",
    "published": "Sat, 14 Dec 2024 16:30:45 +0000",
    "image": "https://www.cultofmac.com/wp-content/uploads/2021/12/Peanuts-Charlie-Brown-Christmas.jpg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "How-To",
      "Apple TV+",
      "Christmas",
      "n11",
      "Peanuts"
    ]
  },
  {
    "id": "75e2622e-a3ec-4c41-94e3-3e8d214c2a94",
    "title": "How to watch ‘A Charlie Brown Christmas’ for free on Apple TV+",
    "link": "https://www.macworld.com/article/1423471/how-to-watch-a-charlie-brown-christmas-for-free-on-apple-tv.html",
    "description": "Macworld Christmas season is here, and there are lots of ways to get into the spirit of the season. One way is to watch a Christmas special on TV, and one of the best is A Charlie Brown Christmas. For decades, it aired on broadcast TV, but that’s no longer the case–it’s now an Apple TV+ exclusive. Now, the fact that this institution is on a streaming service may cause you to exclaim, “Bah! Humbug!” and send Apple a stocking full of coal, but stop, sip some egg nog, and relax–yes, I’m talking about you, Uncle Fred. Apple is making A Charlie Brown Christmas available to anyone to watch for free, for a limited time. If you are an Apple TV+ subscriber, however, you can watch it anytime. How to watch A Charlie Brown Christmas for free on Apple TV+ On December 14 and 15, anyone with an Apple ID can watch A Charlie Brown Christmas. Anyone who owns an Apple device has an Apple ID, but if you don’t, Apple IDs are free and you don’t need a credit card to sign up. Once you have signed up, you can watch in several ways: Through the TV app on an iPhone, iPad, or Mac. On smart TVs with the Apple TV app. On the web at tv.apple.com. On an Apple TV device. Apple has all the classic Peanuts specials for the holiday season that used to air over broadcast TV. There is one more holiday special left for the season, Happy New Year, Charlie Brown, but it doesn’t seem likely that it will be made available for free. In case you missed them and your holiday season isn’t complete without watching them, you can watch It’s the Great Pumpkin, Charlie Brown and A Charlie Brown Thanksgiving on Apple TV+–but they aren’t free anymore. You need to have an Apple TV+ subscription. Years ago, Apple acquired the rights to the Peanuts cartoon series that stars Charlie Brown, Snoopy, Linus, Lucy, and other memorable characters. Since then, Apple has aired new Peanuts shows such as The Snoopy Show and Snoopy in Space, and new movies, including Peanuts in Space: Secrets of Apollo 10, Lucy’s School, and It’s the Small Things, Charlie Brown. The Apple TV+ subscription television streaming service is $9.99/£9.99 per month. Apple TV+ is also included in the Apple One subscription bundles, which include other Apple services, such as Apple Music, Apple News+, and up to 2TB of iCloud storage. Apple One bundles are priced between $19.95/£19.95 and $37.95/£37.95 per month. There are ways to get Apple TV+ for free though–see: All the ways you can get Apple TV+ for free. For more information about Apple TV+, read our Apple TV+ FAQ. We also have a detailed list of current Apple TV+ shows and upcoming shows.",
    "author": "",
    "published": "Sat, 14 Dec 2024 08:15:00 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2024/12/charlie-brown-christmas-1.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Apple TV, Streaming Media"
    ]
  },
  {
    "id": "989dc6e3-a17a-4f89-b70e-13aca34776ad",
    "title": "How one WordPress plugin is changing professional websites forever",
    "link": "https://www.macworld.com/article/2553799/how-one-wordpress-plugin-is-changing-professional-websites-forever.html",
    "description": "Macworld Across industries, it’s hard to avoid needing to build your own website once in a while. Most of the time, you have two options: you can learn to code (hard), or you can use something like WordPress and create a website that looks like a million others. Why not try a third option? MaxiBlocks is a WordPress plugin that keeps the familiar parts of building a WordPress site and adds a robust customization toolkit, and you never need to write a line of code. Pick up a MaxiBlocks lifetime subscription for just $59 (reg. $447).  This powerful WordPress plugin offers over 2,300 block patterns and 280 page templates, making it easier than ever to build stunning websites without coding. The drag-and-drop interface is intuitive and seamless, letting you focus on creativity rather than technical hurdles. Advanced design options and full Gutenberg integration mean your websites work across devices and look good doing it.  MaxiBlocks doesn’t just give you templates. It provides a full toolkit, including 14,300 SVG icons and style cards for consistent, professional designs. Whether you’re a beginner or an experienced web developer, you’ll appreciate how effortlessly you can create unique layouts that stand out. Updates and additional assets are included so your designs stay fresh and modern. It’s like having a comprehensive design studio built into WordPress.  Get a MaxiBlocks No-Code Webpage Builder lifetime pro plan for $59.    MaxiBlocks No-Code Webpage Builder: Pro Plan Lifetime Subscription (3 Licenses) – $59 See Deal StackSocial prices subject to change.",
    "author": "",
    "published": "Sat, 14 Dec 2024 08:00:00 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2024/12/sale_327588_article_image-1-1.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Personal Software"
    ]
  },
  {
    "id": "3389ad56-3e50-4378-b332-8a5cdede28ec",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "e88db533-686a-4a1d-9afc-451cd59aae83",
    "title": "The Overcast Redesign: Part One",
    "link": "https://marco.org/2022/03/25/overcast-redesign-2022",
    "description": "Overcast’s latest update (2022.2) brings the largest redesign in its nearly-eight-year history, plus many of the most frequently requested features and lots of under-the-hood improvements. I’m pretty proud of this one. For this first and largest phase of the redesign, I focused on the home screen, playlist screen, typography, and spacing. (I plan to revamp the now-playing and individual-podcast screens in a later update.) The home screen is radically different: Home screen, before (left) and after (right). Playlists now have strong visual identities for nicer and easier navigation. Each playlist has a customizable color, and a custom icon can be selected from over 3,000 SF Symbols to match modern iOS design and the other icons within Overcast. And playlists can be manually reordered with drag-and-drop. Recently played and newly published episodes can now be displayed on the home screen for quick access, much like the widget and CarPlay experience. Podcasts can now be pinned to the top of the home-screen list. Pinned podcasts can also be manually reordered with drag-and-drop. I’ve also rethought the old stacked “Podcasts” and “Played Podcasts” sections to better match people’s needs and expectations. Now, the toggle atop the podcast list switches between three modes: podcasts with current episodes, all followed podcasts, and inactive podcasts (those that you don’t follow and therefore won’t get any more episodes from, or haven’t posted a new episode in a long time). The playlist screen’s structure remains mostly the same, while refining the design for the modern era: Playlist screen, before (left) and after (right). Here, it’s more apparent that I’ve replaced the system San Francisco font with an alternate variant, San Francisco Rounded, to increase legibility and better match the personality of the app. I’ve also added highly demanded features: By far, Overcast’s most-requested feature is a Mark as Played feature. That’s now available as a checkmark button on episode rows, as well as a left-side swipe action. The second-most-requested feature is a way to view all starred episodes. Special playlists for Starred, Downloaded, and In Progress can now be created. The light and dark themes now each have a customizable tint color from the modern iOS UI-color palette, including these favorites from beta testers: And throughout the app, I’ve made tons of tweaks and bug fixes, including: Notifications and background downloads are now much more reliable. Episode downloads can now be individually deleted or re-downloaded. Links can now be opened in Safari. (under Nitpicky Details) Performance is now significantly better with very large playlists and collections. Fixed bugs with episode-duration detection, CarPlay lists, Mac-app sharing, and much more. So much is better in this update that I can’t even remember it all. Thank you so much to everyone who helped me beta-test this massive update. As always, Overcast is free in the App Store. Go get it!",
    "author": "",
    "published": "Fri, 25 Mar 2022 10:57:51 EDT",
    "image": "https://marco.org/media/2022/03/ocredesign2022-1-after.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "c91b8220-60e7-4173-b775-ee9aa94b6b18",
    "title": "How to Check Battery Cycle Count on iPhone",
    "link": "https://osxdaily.com/2024/12/13/how-check-battery-cycle-count-iphone/",
    "description": "Some iPhone users may be interested in learning what the battery cycle count is on their iPhone. A battery cycle is counted when a full charge and discharge cycle has completed, and this number can help to determine battery usage, health, as well as longevity. Up until recently and with the latest model iPhone devices, ... Read More",
    "author": "Ali Khan",
    "published": "Fri, 13 Dec 2024 18:30:59 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "iPhone",
      "Tips \u0026 Tricks",
      "battery",
      "battery cycle",
      "battery health",
      "tips",
      "tricks",
      "Troubleshooting"
    ]
  },
  {
    "id": "8e1db9b2-2f0b-4fee-8786-cdc98510f7c1",
    "title": "How to Lock iPhone / iPad Apps with Face ID or Passcode",
    "link": "https://osxdaily.com/2024/12/12/how-to-lock-iphone-ipad-apps-with-face-id-or-passcode/",
    "description": "A handy app-specific security feature is available for iPhone and iPad that requires authentication with Face ID or a passcode before a chosen app can be launched. Essentially this lets you lock any iPhone or iPad app with Face ID or a passcode, and this lock applies even if your iPhone or iPad is already ... Read More",
    "author": "Jamie Cuevas",
    "published": "Thu, 12 Dec 2024 21:21:53 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "iPad",
      "iPhone",
      "Security",
      "Tips \u0026 Tricks",
      "App Lock",
      "iOS",
      "iPadOS",
      "lock apps",
      "privacy",
      "tips",
      "tricks"
    ]
  },
  {
    "id": "6899133c-148f-4d16-9f51-d305014bb61f",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "dc91ff89-2447-45ce-abce-28c8a0215243",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  },
  {
    "id": "6f7ced5b-2812-4b7c-b400-a93046b742a8",
    "title": "∞ The Dalrymple Report: HomePod, iOS 18.2, and Voice Memos",
    "link": "https://www.loopinsight.com/2024/12/13/the-dalrymple-report-homepod-ios-18-2-and-voice-memos/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-homepod-ios-18-2-and-voice-memos",
    "description": "Dave is having a problem with his HomePod not recognizing his voice all of a sudden. Apple released iOS 18.2 adding more Apple Intelligence features that aren't really that good. Voice Memos also received an update with some features that are really good, escpaically for musicians. Follow this podcast Show Notes: Apple officially launches iOS 18.2 Voice Memos update brings Layered Recording to iPhone 16 Pro lineup New iOS 18.2 feature will ‘change the way we make music forever,’ says Michael Bublé Apple Stock Hits Record High On Second Wave Of AI Features Shows and movies we're watching Day of the Jackal, Peacock",
    "author": "Jim Dalrymple",
    "published": "Fri, 13 Dec 2024 14:43:11 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "6dfd1881-53ca-4cd9-a225-457010cad4bd",
    "title": "∞ The Dalrymple Report: Live Activities on Watch, Intel CEO, and ChatGPT",
    "link": "https://www.loopinsight.com/2024/12/06/the-dalrymple-report-live-activities-on-watch-intel-ceo-and-chatgpt/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-live-activities-on-watch-intel-ceo-and-chatgpt",
    "description": "Have you noticed on your Apple Watch that Live Activities have taken over your screen. I noticed this a while ago, but couldn't figure out what was happening, but Dave knows and tells us how to stop it from happening. Intel removed its CEO and is looking for a replacement—it's not going to be an easy task to turn that company around. How is it that a man named David Mayer can break ChatGPT—Dave has the answer. Follow this podcast Show Notes: Stop Live Activities Taking Over Your Apple Watch Face U.S. Officials Urge Americans to Use Encrypted Apps Intel’s CEO is out Gruber on Intel Who is David Mayer, and why does he break ChatGPT? The Verge adds a paywall Shows and movies we're watching The Americans, Hulu Beatles ’64, Disney+ Yacht Rock: A Dockumentary, HBO",
    "author": "Jim Dalrymple",
    "published": "Fri, 06 Dec 2024 16:40:01 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "6dc0b6f7-6b82-427c-8652-db6e384d5e31",
    "title": "The Latest from Comfort Zone, Magic Rays of Light, and MacStories Unwind",
    "link": "https://www.macstories.net/news/the-latest-from-comfort-zone-magic-rays-of-light-and-macstories-unwind-12/",
    "description": "Enjoy the latest episodes from MacStories’ family of podcasts: Comfort Zone Matt felt like bringing an intentionally controversial topic, Niléane refuses to admit she’s created a sticky note-based task manager, and everyone gives the iPad some much needed love. Magic Rays of Light Sigmund and Devon discuss the Vision Pro’s gaming future, break down the […]",
    "author": "John Voorhees",
    "published": "Fri, 13 Dec 2024 20:34:29 +0000",
    "image": "https://cdn.macstories.net/untitled-1727463661405.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news"
    ]
  },
  {
    "id": "1c4734f9-07cd-4469-a10a-9e795afd752f",
    "title": "The Strange Case of Apple Intelligence’s iPhone-only Mail Sorting Feature",
    "link": "https://www.macstories.net/linked/the-strange-case-of-apple-intelligences-iphone-only-mail-sorting-feature/",
    "description": "Tim Hardwick, writing for MacRumors, on a strange limitation of the Apple Intelligence rollout earlier this week: Apple’s new Mail sorting features in iOS 18.2 are notably absent from both iPadOS 18.2 and macOS Sequoia 15.2, raising questions about the company’s rollout strategy for the email management system. The new feature automatically sorts emails into […]",
    "author": "Federico Viticci",
    "published": "Fri, 13 Dec 2024 17:14:17 +0000",
    "image": "",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "Linked",
      "Apple Intelligence",
      "mail"
    ]
  },
  {
    "id": "a228542c-fad6-4e9d-8cf7-413f7fdd4aa9",
    "title": "CoverSutra Is Back",
    "link": "https://sophiestication.com/CoverSutra/?utm_source=df\u0026utm_medium=rss\u0026utm_campaign=df-sponsorship-dec2024",
    "description": "",
    "author": "John Gruber",
    "published": "2024-12-14T20:23:54Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "2c38ce50-74ad-40f5-919e-d62f0335d89f",
    "title": "★ On the Accountability of Unnamed Public Relations Spokespeople",
    "link": "https://daringfireball.net/2024/12/on_the_accountability_of_unnamed_public_relations_spokespeople",
    "description": "This is why it’s more than vanity to put your name on your work, whatever your work is — it shows you take responsibility for its validity.",
    "author": "John Gruber",
    "published": "2024-12-14T20:08:32Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  }
]
