[
  {
    "id": "8f88ec81-d9ce-4849-8eea-8bfeca66cc03",
    "title": "NSO Group kept spying on WhatsApp users despite Meta lawsuit",
    "link": "https://9to5mac.com/2025/05/13/nso-group-kept-spying-despite-meta-lawsuit/",
    "description": "Last week, Israeli firm NSO Group, best known for its Pegasus spyware targeting iPhones and Android devices, was ordered to pay Meta more than $167M for targeting WhatsApp users. Now, TechCrunch has published an interesting report based on the 1,000+ page transcript of the trial. more…",
    "author": "Marcus Mendes",
    "published": "Wed, 14 May 2025 01:07:50 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2023/09/nso-pegasus.webp?w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "bccd2324-3f3f-4523-acdd-898cda5f6672",
    "title": "TikTok’s newest AI filter turns your photos into videos",
    "link": "https://9to5mac.com/2025/05/13/tiktok-ai-alive-filter-turns-photos-into-videos/",
    "description": "Today, TikTok announced AI Alive, an AI filter that will allow users to animate static photos through prompts. ByteDance says that this new image-to-video feature undergoes multiple checks to avoid misuse, and its output will be labeled as AI-generated. Here’s how to use it. more…",
    "author": "Marcus Mendes",
    "published": "Tue, 13 May 2025 23:19:42 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2024/12/TikTok-ban-–-Supreme-Court-asked-for-emergency-injunction.webp?w=1500",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "3a11b544-3090-4127-a4e1-1b8090e38edc",
    "title": "Mac | Mirrored | Apple",
    "link": "https://www.youtube.com/watch?v=pmyBHUIrQic",
    "description": "",
    "author": "Apple",
    "published": "2025-05-12T16:30:25+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "78394027-1aeb-48fe-8ea6-115944a63feb",
    "title": "Mac | Dropped In | Apple",
    "link": "https://www.youtube.com/watch?v=D-UGw9c-H64",
    "description": "",
    "author": "Apple",
    "published": "2025-05-12T16:30:20+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "eafdcf18-43ba-4069-a88c-d1dd914ea5d6",
    "title": "Universal Music Group and Apple Music announce Sound Therapy",
    "link": "https://www.apple.com/newsroom/2025/05/universal-music-group-and-apple-music-announce-sound-therapy/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-05-13T15:00:26.965Z",
    "image": "https://www.apple.com/newsroom/images/2025/05/universal-music-group-and-apple-music-announce-sound-therapy/tile/Apple-Music-Sound-Therapy-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "a50c9efc-6ec0-4a0c-9b01-73404243dae4",
    "title": "Apple unveils powerful accessibility features coming later this year",
    "link": "https://www.apple.com/newsroom/2025/05/apple-unveils-powerful-accessibility-features-coming-later-this-year/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-05-13T12:00:26.241Z",
    "image": "https://www.apple.com/newsroom/images/2025/05/apple-unveils-powerful-accessibility-features-coming-later-this-year/tile/Apple-accessibility-features-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "PRESS RELEASE"
    ]
  },
  {
    "id": "eb4b52f8-dbb0-4138-a251-edd575e85f75",
    "title": "GameSir Tarantula Pro review: A solid controller with a funky party trick",
    "link": "https://appleinsider.com/articles/25/05/14/gamesir-tarantula-pro-review-a-solid-controller-with-a-funky-party-trick?utm_medium=rss",
    "description": "I've used a lot of game controllers on my Mac and other platforms, but I've never seen one like this. GameSir fixed the controller layout problem by letting you change the Tarantula Pro's on the fly.Tarantula Pro review: The symmetrical stick layout is comfortable and familiar.There are tons of controllers that you can use with your iPhone, Mac, iPad, and even your Apple TV. GameSir makes some of my favorites, including the Xbox-like Cyclone 2 that I reviewed previously.But the Tarantula Pro is a different beast, not least because it's built more like a PS4 controller than an Xbox one. That means the joysticks are in the middle, laid out symmetrically. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Oliver Haslam",
    "published": "Wed, 14 May 2025 00:37:01 +0000",
    "image": "https://photos5.appleinsider.com/gallery/63578-132191-gamesir-tarantula-pro-hero-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "0d8c93fd-8698-4b55-a7f9-bcb9ddbba102",
    "title": "Apple research reveals potential of future Apple Intelligence tools",
    "link": "https://appleinsider.com/articles/25/05/13/apple-research-reveals-potential-of-future-apple-intelligence-tools?utm_medium=rss",
    "description": "Apple has published two new research papers on its Machine Learning blog, detailing an AI model for improved photogrammetry and another that acts as a video-related personal assistant.Apple's latest AI models could lead to new Apple Vision Pro and Apple Intelligence features.The iPhone maker has long been interested in machine learning, which evolved into its version of AI. The company has been publishing research papers publicly to showcase its advancements in future technologies.Apple Intelligence offers users access to new applications such as Image Playground, AI-generated Smart Replies in the Mail app, email and notification summaries, a new Writing Tools framework, and much more. Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Marko Zivkovic",
    "published": "Tue, 13 May 2025 23:21:34 +0000",
    "image": "https://photos5.appleinsider.com/gallery/63620-132275-62727-130166-VP-AI-xl-(1)-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "a243fb12-e7df-4014-929b-a558c2f21c82",
    "title": "Price drop: Apply for up to 150 jobs a day with just one click",
    "link": "https://www.cultofmac.com/deals/lazyapply-easy-way-to-apply-for-jobs",
    "description": "LazyApply saves you time by letting you apply for jobs with just a click -- hundreds of them. Get a lifetime sub now for just $59.97. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "Cult of Mac Deals",
    "published": "Tue, 13 May 2025 20:30:14 +0000",
    "image": "https://cdn.cultofmac.com/wp-content/uploads/2022/02/CoM-LazyApply.jpeg",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Deals",
      "Cult of Mac Deals"
    ]
  },
  {
    "id": "615947b2-6d79-4a6f-b83c-3009a1f5e9b5",
    "title": "Apple Music’s Sound Therapy enhances songs to help you focus, relax and sleep",
    "link": "https://www.cultofmac.com/news/apple-music-sound-therapy",
    "description": "Through a partnership with Universal Music Group, new Apple Music Sound Therapy turns tunes into wellness tools. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "author": "David Snow",
    "published": "Tue, 13 May 2025 19:22:03 +0000",
    "image": "https://cdn.cultofmac.com/wp-content/uploads/2025/05/Apple-Music-Sound-Therapy-hero_big.jpg.large_2x.jpg.webp",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "News",
      "Apple Music"
    ]
  },
  {
    "id": "924da6fa-9eac-46b1-9459-38fdbf4ad15f",
    "title": "[Sponsor] Bolt: What Do You Want to Build?",
    "link": "https://srv.buysellads.com/ads/long/x/THREKCSVTTTTTTTZHWQNETTTTTTDCFVJ2TTTTTTTADZJNBTTTTTTTRIV22DW47II2RZULYSCKY7FTBDDQ7QCCYPBG6BT",
    "description": "",
    "author": "Daring Fireball Department of Commerce",
    "published": "2025-05-12T23:07:20Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "52eaef59-3bea-4368-beba-9701f4911406",
    "title": "That Stupid Apple Notes ‘a’",
    "link": "https://www.engadget.com/apps/the-only-thing-i-want-from-apples-big-2025-redesign-is-a-120023531.html",
    "description": "",
    "author": "John Gruber",
    "published": "2025-05-12T17:14:25Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "11ed7999-79a1-4226-9c7e-24450aab6666",
    "title": "Samsung's S25 Edge First Look: Samsung Beat Apple to It!",
    "link": "https://www.youtube.com/watch?v=NiYt6CqoRFQ",
    "description": "",
    "author": "MacRumors",
    "published": "2025-05-13T00:00:19+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "d730085c-90af-4f9a-b42a-652df856eb97",
    "title": "M4 MacBook Air Review After 2 Months – Still Apple's Best for 2025?",
    "link": "https://www.youtube.com/watch?v=QkyfqirsrMo",
    "description": "",
    "author": "MacRumors",
    "published": "2025-05-07T19:41:25+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "7a4ce8d7-4a6b-4b48-adeb-423605dab989",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 10:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "858874c8-59b2-408e-bf43-d6acc7f806b4",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 06:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "7f1c2e22-7b2b-4afc-87d9-31b5f383219d",
    "title": "Apple teams up with Universal Music Group to add Sound Therapy to Apple Music",
    "link": "https://www.macworld.com/article/2780607/apple-teams-up-with-universal-music-group-to-add-sound-therapy-to-apple-music.html",
    "description": "Macworld May 15 is Global Accessibility Awareness Day, and Apple always uses the occasion to highlight some of the new accessibility features coming to iPhones and Macs. This year, Apple’s got another announcement to share: three new Sound Therapy playlists on Apple Music available now. The South Therapy experience consists of three playlists—Focus, Relax, and Sleep—that play music from UMG artists including Imagine Dragons, Katy Perry, Kacey Musgraves, and others. The songs are special versions, often extended, instrumental, or rearranged to be more soothing. Those songs are then blended seamlessly with specific sound waves that are said to help you get into a particular mental state. Gamma waves and white noise are supposed to help with focus, theta waves are to help you relax, and delta waves and pink noise are said to help you sleep. Apple has partnered with Universal Music Group and its music therapy science project, the Sollos initiative, on the feature. Apple’s press release says the feature is “Backed by scientific research and powered by UMG’s proprietary audio technologies,” but the science here is not by any means conclusive. Apple uses words like “could” and “might” in its press release whenever making a claim of effect, and includes a footnote that the feature is designed to “support a person’s overall wellbeing” rather than treat any specific medical condition. Similar claims have been made about similar therapies, such as “binaural beats,” for years, but research into the effects is often criticized for its lack of rigor or for making grandiose claims not supported by the evidence. Critics often point out that such therapies, when properly studied, show results no better than a placebo, or no better than using any other regular sounds to block out bothersome background noise. Still, there’s no harm in it, and it’s a new feature included with your existing Apple Music subscription. Regardless of whether there are special sound waves helping you achieve the focus or sleep you desire, you can give the playlists a listen the next time you can’t focus, relax, or sleep, and see if they work for you.",
    "author": "",
    "published": "Tue, 13 May 2025 17:05:45 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/05/apple-music-sound-therapy.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Apple Inc, Streaming Media"
    ]
  },
  {
    "id": "bf9b1d56-ab4a-4e07-bbb7-e0ce48cc26ee",
    "title": "macOS 16’s new Magnifier app uses an iPhone to see far-away objects up close",
    "link": "https://www.macworld.com/article/2780261/macos-16s-new-magnifier-app-uses-an-iphone-to-see-far-away-objects-up-close.html",
    "description": "Macworld Apple on Tuesday announced several new Accessibility features coming to macOS later this year. The features will be part of macOS 16, which will be revealed at WWDC25 on June 9. The features are highlighted by a new Magnifier app with Continuity Camera functionality. Mac users are already familiar with Continuity Camera and its ability to use the iPhone’s camera as a webcam. Now, with the Magnifier app, a Mac can use the iPhone camera (or any other USB camera) to view the surroundings and zoom in. For example, users in a lecture hall can use the Magnifier app and iPhone camera to get a closer look at a whiteboard at the front of the room. The Magnifier will also be able to display multiple live session windows where a user can watch a presentation and follow along in a book at the same time using Desk View. Brightness, contrast, color filters, and perspective are adjustable, and views can be captured, grouped, and saved to add to at a later time. The new Accessibility Reader is a system-wide feature for making text easier to read. Text can be customized for color, font, and spacing, and users can also switch to Spoken Content. Since Accessibility Reader is system-wide, it can be used in any app, including the new Magnifier. Other new Accessibility features coming to macOS 16 include: Braille Access: Users can use a built-in app launcher to open any app by typing with Braille Screen Input or a connected Braille device. Braille Access lets users take notes in Braille and do calculations using Nemeth Braille. Braille Ready Format (BRF) files can be opened directly from Braille Access. Live Captions integration lets users transcribe conversations directly on braille displays. Background Sounds: Can be personalized with new EQ settings, playback duration times, and new actions for automations in Shortcuts. Personal Voice: Uses on-device machine learning and artificial intelligence for a smoother, more natural-sounding voice. Support for Mexican Spanish will also be available. Vehicle Motion Cues: Available in the iPhone and coming to the Mac, this feature can help reduce motion sickness when riding in a moving vehicle by displaying animated dots that correspond to a vehicle’s movements. Vehicle Motion Cues can help prevent motion sickness for those times you’re using your Mac as a passenger on a bus, train, or car.Apple Apple is also updating iOS 19 and iPadOS 19 with several new Accessibility features. Apple often takes the opportunity to showcase new Accessibility features about a month before the WWDC keynote. Last year, the company highlighted Eye Tracking, Music Haptics, and other features in iOS 18.",
    "author": "",
    "published": "Tue, 13 May 2025 15:49:22 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/05/macos-16-Magnifier-1.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "MacOS"
    ]
  },
  {
    "id": "599ef687-ce11-448c-a59a-7b37978aacdf",
    "title": "MacOS Sonoma 14.7.6 \u0026 MacOS Ventura 13.7.6 Updates Released",
    "link": "https://osxdaily.com/2025/05/13/macos-sonoma-14-7-6-macos-ventura-13-7-6-updates-released/",
    "description": "macOS Sonoma 14.7.6 and MacOS Ventura 13.7.6 have been released by Apple for Mac users who are not running the MacOS Sequoia operating system. These updates focus exclusively on security updates, with no other changes or features. The release of MacOS 14.7.6 and 13.7.6 comes alongside the MacOS Sequoia 15.5 update that was simultaneously released. ... Read More",
    "author": "Paul Horowitz",
    "published": "Tue, 13 May 2025 15:52:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Mac OS",
      "News",
      "Mac",
      "macOS",
      "MacOS Sonoma",
      "macOS Sonoma 14.7.6",
      "MacOS Ventura",
      "MacOS Ventura 13.7.6",
      "software update"
    ]
  },
  {
    "id": "cd3a1ebf-8f7b-4f66-ad75-ecf1311ebc8f",
    "title": "MacOS Sequoia 15.5 Update Released with Bug Fixes \u0026 Security Enhancements",
    "link": "https://osxdaily.com/2025/05/12/macos-sequoia-15-5-update-download/",
    "description": "MacOS Sequoia 15.5 is now available as a software update for Mac users running the Sequoia operating system. The system software update includes bug fixes and security enhancements, but does not appear to include any new features or other major changes. Additionally, Apple has also released MacOS Ventura 13.7.6 and macOS Sonoma 14.7.6 for Mac, ... Read More",
    "author": "Paul Horowitz",
    "published": "Mon, 12 May 2025 17:55:02 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Mac OS",
      "News",
      "ipsw",
      "Mac",
      "macOS",
      "MacOS Sequoia",
      "MacOS Sequoia 15.5",
      "MacOS Sonoma",
      "macOS Sonoma 14.7.6",
      "MacOS Ventura",
      "MacOS Ventura 13.7.6",
      "software update"
    ]
  },
  {
    "id": "39c39a82-9993-499e-a521-4642f8cc04c4",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "33eb5ade-8890-4a55-bd68-a6d8ec015f56",
    "title": "The Overcast Redesign: Part One",
    "link": "https://marco.org/2022/03/25/overcast-redesign-2022",
    "description": "Overcast’s latest update (2022.2) brings the largest redesign in its nearly-eight-year history, plus many of the most frequently requested features and lots of under-the-hood improvements. I’m pretty proud of this one. For this first and largest phase of the redesign, I focused on the home screen, playlist screen, typography, and spacing. (I plan to revamp the now-playing and individual-podcast screens in a later update.) The home screen is radically different: Home screen, before (left) and after (right). Playlists now have strong visual identities for nicer and easier navigation. Each playlist has a customizable color, and a custom icon can be selected from over 3,000 SF Symbols to match modern iOS design and the other icons within Overcast. And playlists can be manually reordered with drag-and-drop. Recently played and newly published episodes can now be displayed on the home screen for quick access, much like the widget and CarPlay experience. Podcasts can now be pinned to the top of the home-screen list. Pinned podcasts can also be manually reordered with drag-and-drop. I’ve also rethought the old stacked “Podcasts” and “Played Podcasts” sections to better match people’s needs and expectations. Now, the toggle atop the podcast list switches between three modes: podcasts with current episodes, all followed podcasts, and inactive podcasts (those that you don’t follow and therefore won’t get any more episodes from, or haven’t posted a new episode in a long time). The playlist screen’s structure remains mostly the same, while refining the design for the modern era: Playlist screen, before (left) and after (right). Here, it’s more apparent that I’ve replaced the system San Francisco font with an alternate variant, San Francisco Rounded, to increase legibility and better match the personality of the app. I’ve also added highly demanded features: By far, Overcast’s most-requested feature is a Mark as Played feature. That’s now available as a checkmark button on episode rows, as well as a left-side swipe action. The second-most-requested feature is a way to view all starred episodes. Special playlists for Starred, Downloaded, and In Progress can now be created. The light and dark themes now each have a customizable tint color from the modern iOS UI-color palette, including these favorites from beta testers: And throughout the app, I’ve made tons of tweaks and bug fixes, including: Notifications and background downloads are now much more reliable. Episode downloads can now be individually deleted or re-downloaded. Links can now be opened in Safari. (under Nitpicky Details) Performance is now significantly better with very large playlists and collections. Fixed bugs with episode-duration detection, CarPlay lists, Mac-app sharing, and much more. So much is better in this update that I can’t even remember it all. Thank you so much to everyone who helped me beta-test this massive update. As always, Overcast is free in the App Store. Go get it!",
    "author": "",
    "published": "Fri, 25 Mar 2022 10:57:51 EDT",
    "image": "https://marco.org/media/2022/03/ocredesign2022-1-after.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "ca5596be-7395-4d1e-98e9-606e9f0bad78",
    "title": "Airbnb’s Redesigned App Combines Stays with Services and Unique Experiences",
    "link": "https://www.macstories.net/news/airbnbs-redesigned-app-combines-stays-with-services-and-unique-experiences/",
    "description": "Image: Airbnb. I’m in Los Angeles for Airbnb’s 2025 Summer Release, where the company just announced a major expansion to its offerings, paired with an entirely redesigned app. It’s an ambitious update that I’ll be trying and covering more soon, but for now, let’s dig into an overview of what’s been announced. Services. Image: Airbnb. In […]",
    "author": "John Voorhees",
    "published": "Tue, 13 May 2025 18:31:12 +0000",
    "image": "https://cdn.macstories.net/all-new-app-summer-release-2025-us-1747093569172.jpg",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "Airbnb",
      "app",
      "iOS",
      "travel"
    ]
  },
  {
    "id": "0f9d416e-a3fb-46ae-bb21-1249b3c38aa1",
    "title": "Apple Previews a Wide Range of Upcoming Accessibility Features to Mark Global Accessibility Awareness Day",
    "link": "https://www.macstories.net/news/apple-previews-a-wide-range-of-upcoming-accessibility-features-to-mark-global-accessibility-awareness-day/",
    "description": "Source: Apple. With Global Accessibility Awareness Day coming up this Thursday, May 15, Apple is back with its annual preview of accessibility features coming to its platforms later in the year. This year marks the 40th anniversary of the creation of the first office within Apple to address accessibility, and there’s no sign of any […]",
    "author": "Jonathan Reed",
    "published": "Tue, 13 May 2025 12:03:55 +0000",
    "image": "https://cdn.macstories.net/apple-accessibility-features-app-store-nutrition-labels-1747131462554.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "accessibility",
      "app store",
      "apple tv",
      "braille",
      "CarPlay",
      "Live Captions",
      "Live Listen",
      "Magnifier",
      "Nutrition Labels",
      "Personal Voice",
      "System Haptics",
      "Vision Pro",
      "visionOS"
    ]
  },
  {
    "id": "80f349e1-5373-4140-97d5-bc11ab050a26",
    "title": "∞ The Dalrymple Report: Things we love about Apple and cassettes",
    "link": "https://www.loopinsight.com/2025/05/09/the-dalrymple-report-things-we-love-about-apple-and-cassettes/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-things-we-love-about-apple-and-cassettes",
    "description": "Some people have never used a cassette tape to listen to music, my kids being among them. This week Dave takes a little side route into one of his thoughts on listening to cassettes. We have spent a lot of time talking about things that Apple has done wrong this past year in regards to AI and Siri, so this week we change things up and talk about the things we love about Apple and what they have done right. Follow this podcast Show Notes: Dan Moren (Six Colors, Host of Inconceivable podcast) was on Jeopardy last night! Meta is reportedly working on facial recognition for its AI glasses Apple files appeal Is LLM memory going to Become the New iMessage Lock-in? Apple's new \"Hands on with Apple Intelligence\" video Apple, Google, and possible Gemini deal Shows and movies we're watching Murder is Easy, BritBox Black Bag, Peacock",
    "author": "Jim Dalrymple",
    "published": "Fri, 09 May 2025 12:42:01 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "fea74608-65bc-4143-85d1-4a8355726f68",
    "title": "∞ The Dalrymple Report: Formula 1, Gemini, and Apple’s 30%",
    "link": "https://www.loopinsight.com/2025/05/02/the-dalrymple-report-formula-1-gemini-and-apples-30/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-formula-1-gemini-and-apples-30",
    "description": "I'm heading off to Miami this weekend to see the Formula 1 Grand Prix and take a tour of the pit lane. Dave tells us about his Formula 1 experience and his trip to Texas. We also talk about the rumored deal between Apple and Google to have Apple use Gemini in Apple Intelligence—this is probably the best news ever for Apple's AI efforts. If you haven't tried Gemini yet, you should—it's incredible. Apple is being forced to allow developers to get payment for their apps from outside the App Store, which means Apple doesn't get its 30% cut. Follow this podcast Show Notes: Miami Formula 1 Grand Prix Bono immersive movie Apple launches ‘Snapshot,’ a new way to discover artists, actors, and athletes Apple forced to give developers (almost) free reign to link out and avoid paying Apple’s 30% cut Apple Music Gets New Co-Heads in Latest Leadership Shuffle Apple, Google, and possible Gemini deal Shows and movies we're watching The Lorenskog Disappearance, Netflix Conclave, Prime Video",
    "author": "Jim Dalrymple",
    "published": "Fri, 02 May 2025 13:00:10 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "849d4966-46e5-4c54-acc8-d3ada69fa997",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "f5630a4c-16d1-4c64-af1c-46ee6625ca38",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  }
]
