{
  "id": "11119a78-6150-4131-8412-01cb79cdba90",
  "title": "FAMOUS LAST WORDS",
  "link": "https://www.kirkusreviews.com/book-reviews/gillian-mcallister/famous-last-words-2/",
  "description": "In the sweet—and sometimes challenging—blur of her first nine months of motherhood, bookworm Cam has found domestic joy with her daughter, Polly, and her husband, Luke, as well as enough downtime to do some pleasure reading, so she’s nervous about returning to her job at a London literary agency. Her first day back certainly doesn’t turn out as she imagines: Unable to find Luke, she drops Polly off at day care and goes to work. When Luke doesn’t answer her texts for hours, she starts to worry. Then, on a television in her office, she sees live footage of an ongoing siege at a nearby warehouse—and realizes her husband seems to have taken three people hostage. Several hours later, despite the intervention of Niall Thompson, a trained police hostage negotiator, two of those three people will be dead, and Luke will be in the wind. Seven years pass, and while both Cam and Niall seem to have moved on in various ways, they’re both tethered to the memories and pain of that June afternoon. Niall’s wife left him that same day, and ever since he’s been troubled with dreams of the gunshots that destroyed not only the lives of the hostages, but also his career. Cam finds joy in Polly’s growth, but she can’t let go of her love for her husband—and her deep-rooted belief that he must still be out there, and may have an explanation for everything. Cam’s fierce love for Luke is admirable, but it also feels somewhat naïve, even as she and Niall begin to uncover discrepancies and coincidences about that day and the weeks leading up to it, many of which seem like quite a narrative stretch. The sweet mundanity of Cam and Luke’s “before” relationship is the true treasure of the book, as is the tension of the early chapters. McAllister asks us to consider whether blind faith in those we love is always justified—and worth the cost.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Gillian McAllister",
  "length": 3961,
  "excerpt": "When her husband is accused—and seems guilty—of committing a violent crime, Camilla Deschamps must decide whether she truly believes in his goodness and innocence.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "THEN SHE WAS GONE by Lisa Jewell ‧ RELEASE DATE: April 24, 2018 Dark and unsettling, this novel’s end arrives abruptly even as readers are still moving at a breakneck speed. Ten years after her teenage daughter went missing, a mother begins a new relationship only to discover she can't truly move on until she answers lingering questions about the past. Laurel Mack’s life stopped in many ways the day her 15-year-old daughter, Ellie, left the house to study at the library and never returned. She drifted away from her other two children, Hanna and Jake, and eventually she and her husband, Paul, divorced. Ten years later, Ellie’s remains and her backpack are found, though the police are unable to determine the reasons for her disappearance and death. After Ellie’s funeral, Laurel begins a relationship with Floyd, a man she meets in a cafe. She's disarmed by Floyd’s charm, but when she meets his young daughter, Poppy, Laurel is startled by her resemblance to Ellie. As the novel progresses, Laurel becomes increasingly determined to learn what happened to Ellie, especially after discovering an odd connection between Poppy’s mother and her daughter even as her relationship with Floyd is becoming more serious. Jewell’s (I Found You, 2017, etc.) latest thriller moves at a brisk pace even as she plays with narrative structure: The book is split into three sections, including a first one which alternates chapters between the time of Ellie’s disappearance and the present and a second section that begins as Laurel and Floyd meet. Both of these sections primarily focus on Laurel. In the third section, Jewell alternates narrators and moments in time: The narrator switches to alternating first-person points of view (told by Poppy’s mother and Floyd) interspersed with third-person narration of Ellie’s experiences and Laurel’s discoveries in the present. All of these devices serve to build palpable tension, but the structure also contributes to how deeply disturbing the story becomes. At times, the characters and the emotional core of the events are almost obscured by such quick maneuvering through the weighty plot. Dark and unsettling, this novel’s end arrives abruptly even as readers are still moving at a breakneck speed. Pub Date: April 24, 2018 ISBN: 978-1-5011-5464-5 Page Count: 368 Publisher: Atria Review Posted Online: Feb. 5, 2018 Kirkus Reviews Issue: Feb. 15, 2018",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/766eace6ea7046739a1b3caa80559262/f97879db9b9f42b0a66dbfabf3714343.jpg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eTHEN SHE WAS GONE\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/lisa-jewell/\"\u003e\n                            Lisa Jewell\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: April 24, 2018\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Dark and unsettling, this novel’s end arrives abruptly even as readers are still moving at a breakneck speed.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eTen years after her teenage daughter went missing, a mother begins a new relationship only to discover she can\u0026#39;t truly move on until she answers lingering questions about the past.\u003c/p\u003e\n                                        \u003cp\u003eLaurel Mack’s life stopped in many ways the day her 15-year-old daughter, Ellie, left the house to study at the library and never returned. She drifted away from her other two children, Hanna and Jake, and eventually she and her husband, Paul, divorced. Ten years later, Ellie’s remains and her backpack are found, though the police are unable to determine the reasons for her disappearance and death. After Ellie’s funeral, Laurel begins a relationship with Floyd, a man she meets in a cafe. She\u0026#39;s disarmed by Floyd’s charm, but when she meets his young daughter, Poppy, Laurel is startled by her resemblance to Ellie. As the novel progresses, Laurel becomes increasingly determined to learn what happened to Ellie, especially after discovering an odd connection between Poppy’s mother and her daughter even as her relationship with Floyd is becoming more serious. Jewell’s (\u003ci\u003eI Found You\u003c/i\u003e, 2017, etc.) latest thriller moves at a brisk pace even as she plays with narrative structure: The book is split into three sections, including a first one which alternates chapters between the time of Ellie’s disappearance and the present and a second section that begins as Laurel and Floyd meet. Both of these sections primarily focus on Laurel. In the third section, Jewell alternates narrators and moments in time: The narrator switches to alternating first-person points of view (told by Poppy’s mother and Floyd) interspersed with third-person narration of Ellie’s experiences and Laurel’s discoveries in the present. All of these devices serve to build palpable tension, but the structure also contributes to how deeply disturbing the story becomes. At times, the characters and the emotional core of the events are almost obscured by such quick maneuvering through the weighty plot.\u003c/p\u003e\u003cp\u003e\n                                        Dark and unsettling, this novel’s end arrives abruptly even as readers are still moving at a breakneck speed.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e April 24, 2018\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-1-5011-5464-5\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 368\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Atria\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Feb. 5, 2018\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e Feb. 15, 2018\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
