{
  "id": "39a7c97e-c57b-44f9-bc63-6e27bc49ea85",
  "title": "COPE FIELD",
  "link": "https://www.kirkusreviews.com/book-reviews/tl-simpson/cope-field/",
  "description": "After Crawford Cope hits his father with a baseball bat, he’s sentenced to 300 hours of community service—working to revamp a baseball diamond that will be named Cope Field after his famous pops, a hometown hero who played in the major leagues. Craw, who’s white, is paired with Hannah Flores, a brown-skinned, bisexual punk rocker with bright blue, pink-tipped hair. They go to the same school, but he doesn’t know her; Craw’s reputation as the son of a wealthy local legend precedes him. Hannah has no interest in baseball, and Craw is initially annoyed by her constant talking, but as they learn more about each other and their respective difficult home lives, Craw falls for Hannah. His understandable anger toward his mercurial father fills him with shame, even when it’s provoked by his protective feelings toward his funny, precocious younger brother, Sutton, who doesn’t even remember their momma. Though he’s also tempted to play the hero for Hannah, who faces bullying at school and at home, Craw’s developing understanding that his well-intentioned barging in isn’t helping her, plus his willingness to listen to what she really wants from him, are refreshing. This heartbreaking, finely drawn story will keep readers engaged.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by T.L. Simpson",
  "length": 4321,
  "excerpt": "Years after his mother abandoned their family, a teen baseball star struggles with his feelings toward his abusive father in this contemporary novel set in small-town Arkansas.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "IF HE HAD BEEN WITH ME by Laura Nowlin ‧ RELEASE DATE: April 1, 2013 There’s not much plot here, but readers will relish the opportunity to climb inside Autumn’s head. Awards \u0026 Accolades Likes 97 Our Verdict GET IT New York Times Bestseller The finely drawn characters capture readers’ attention in this debut. Autumn and Phineas, nicknamed Finny, were born a week apart; their mothers are still best friends. Growing up, Autumn and Finny were like peas in a pod despite their differences: Autumn is “quirky and odd,” while Finny is “sweet and shy and everyone like[s] him.” But in eighth grade, Autumn and Finny stop being friends due to an unexpected kiss. They drift apart and find new friends, but their friendship keeps asserting itself at parties, shared holiday gatherings and random encounters. In the summer after graduation, Autumn and Finny reconnect and are finally ready to be more than friends. But on August 8, everything changes, and Autumn has to rely on all her strength to move on. Autumn’s coming-of-age is sensitively chronicled, with a wide range of experiences and events shaping her character. Even secondary characters are well-rounded, with their own histories and motivations. There’s not much plot here, but readers will relish the opportunity to climb inside Autumn’s head.   (Fiction. 14 \u0026 up) Pub Date: April 1, 2013 ISBN: 978-1-4022-7782-5 Page Count: 336 Publisher: Sourcebooks Fire Review Posted Online: Feb. 12, 2013 Kirkus Reviews Issue: March 1, 2013",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/905dc15cf1c04629b32b86ff31524408/a1594a1ece5142338b98d556914bf789.jpg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eIF HE HAD BEEN WITH ME\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/laura-nowlin/\"\u003e\n                            Laura Nowlin\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: April 1, 2013\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    There’s not much plot here, but readers will relish the opportunity to climb inside Autumn’s head.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                            \u003cdiv data-id=\"2000117828\" data-meta-len=\"3\"\u003e\n            \u003cp\u003eAwards \u0026amp; Accolades\u003c/p\u003e\n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eLikes\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/like.png\" alt=\"Readers Vote\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp id=\"2000117828-total-likes\"\u003e97\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eOur Verdict\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/check-ok.png\" alt=\"Our Verdict\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eGET IT\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eNew York Times Bestseller\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n            \n        \u003c/div\u003e\n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eThe finely drawn characters capture readers’ attention in this debut.\u003c/p\u003e\n                                        \u003cp\u003eAutumn and Phineas, nicknamed Finny, were born a week apart; their mothers are still best friends. Growing up, Autumn and Finny were like peas in a pod despite their differences: Autumn is “quirky and odd,” while Finny is “sweet and shy and everyone like[s] him.” But in eighth grade, Autumn and Finny stop being friends due to an unexpected kiss. They drift apart and find new friends, but their friendship keeps asserting itself at parties, shared holiday gatherings and random encounters. In the summer after graduation, Autumn and Finny reconnect and are finally ready to be more than friends. But on August 8, everything changes, and Autumn has to rely on all her strength to move on. Autumn’s coming-of-age is sensitively chronicled, with a wide range of experiences and events shaping her character. Even secondary characters are well-rounded, with their own histories and motivations.\u003c/p\u003e\u003cp\u003e\n                                        There’s not much plot here, but readers will relish the opportunity to climb inside Autumn’s head.  \n                                        \n                                        \u003cem\u003e(Fiction. 14 \u0026amp; up)\u003c/em\u003e\n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e April 1, 2013\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-1-4022-7782-5\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 336\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Sourcebooks Fire\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Feb. 12, 2013\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e March 1, 2013\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
