{
  "id": "4f59f5a6-85f5-4f4c-960f-e3bf7e8e86b1",
  "title": "2024 KidLit You Might Have Missed",
  "link": "https://bookriot.com/kid-lit-2024-childrens-books/",
  "description": "Great kids' books you might have missed this year, the NYT's top thrillers, true crime, and audiobooks of the year, and more.",
  "author": "Rebecca Joines Schinsky",
  "published": "Fri, 06 Dec 2024 17:20:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "Rebecca Joines Schinsky",
  "length": 3230,
  "excerpt": "Great kids' books you might have missed this year, the NYT's top thrillers, true crime, and audiobooks of the year, and more.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.The Lists Keep Coming and They Don’t Stop Coming Gone are the days when a publication could release one best-of-the-year list to rule them all. Algorithms and the increasingly fragmented media landscape they’ve wrought mean that bookish media outlets, including this one, need to try multiple avenues to reach readers. In best-of season, this results in not just The Best Books of the Year, but longlists that get whittled down to shortlists, big lists that get broken down into smaller genre-specific lists, and myriad attempts to package, theme, and spin a best-books list into something that looks new and interesting enough to compel some clicks. This year, the Washington Post started with the genre lists and worked up to the big best-of, while the New York Times has taken the opposite tack. After revealing the 10 best books of 2024, the Old Gray Lady is now offering the best thrillers, crime novels, and audiobooks of the year. I expect next week will bring sci-fi, fantasy, romance, and who knows what else. If you’d told me when I started working in book media 16 years ago that the internet would result in the NYT not just acknowledging genre fiction but covering it enthusiastically, I would have been elated, but I wouldn’t have been able to imagine what it would look like. A silver lining to the ever-increasing challenges of today’s media environment. KidLit Catch-UpAmong my favorite year-end lists are the many varieties of “the ones that got away.” Under-the-radar reads, hidden gems, and word-of-mouth slow burns can be such a delight, and they make great gifts because they’re so much less likely to be repeats than titles chosen from the best-of collections. While you’re making your list and checking it twice this holiday season, don’t miss Lit Hub‘s look at ten kids’ books you might have missed this year. Today In Books Newsletter Sign up to Today In Books to receive daily news and miscellany from the world of books. Thank you for signing up! Keep an eye on your inbox. Let’s Go to the Movies December may be slow on new releases, but it’s a big season for adaptations. The big-screen spins on Nightbitch and Nickel Boys are high atop my list for the month, and you better believe I’ll be lining up to see Ralph Fiennes as Odysseus in The Return. If a couch party is more your vibe, you’ll have no shortage of options, either, including Netflix’s take on One Hundred Years of Solitude and Parmount+’s The Road Trip, a rom-com by Beth O’Leary. Book Censorship Trends to Watch for in 2025As we round out another year and look ahead to the next, one thing is for certain: book censorship will continue to evolve and look different as we move into a new administration. Book Riot’s Kelly Jensen zeroes in on some of the biggest censorship trends to watch for in the new year. The comments section is moderated according to our community guidelines. Please check them out so we can maintain a safe and supportive community of readers!",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch.jpg.webp\" alt=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20620%20332\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch-300x161.jpg.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/child-reading-on-couch.jpg.webp\"/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-585726 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\n\t\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003c/p\u003e\u003ch2\u003eThe Lists Keep Coming and They Don’t Stop Coming\u003c/h2\u003e\u003cdiv\u003e\n\u003cp\u003eGone are the days when a publication could release one best-of-the-year list to rule them all. Algorithms and the increasingly fragmented media landscape they’ve wrought mean that bookish media outlets, including this one, need to try multiple avenues to reach readers. In best-of season, this results in not just The Best Books of the Year, but longlists that get whittled down to shortlists, big lists that get broken down into smaller genre-specific lists, and myriad attempts to package, theme, and spin a best-books list into something that looks new and interesting enough to compel some clicks. This year, the\u003cem\u003e Washington Post\u003c/em\u003e started with the genre lists and worked up to the big best-of, while the \u003cem\u003eNew York Times\u003c/em\u003e has taken the opposite tack. After revealing \u003ca href=\"https://www.nytimes.com/2024/12/03/books/best-books-2024.html\"\u003ethe 10 best books of 2024\u003c/a\u003e, the Old Gray Lady is now offering the best \u003ca href=\"https://www.nytimes.com/2024/12/04/books/review/best-thriller-novels-2024.html\"\u003ethrillers\u003c/a\u003e, \u003ca href=\"https://www.nytimes.com/2024/12/04/books/review/best-crime-novels-2024.html\"\u003ecrime novels\u003c/a\u003e, and \u003ca href=\"https://www.nytimes.com/2024/12/05/books/review/best-audiobooks-2024.html\"\u003eaudiobooks\u003c/a\u003e of the year. I expect next week will bring sci-fi, fantasy, romance, and who knows what else. \u003c/p\u003e\n\u003cp\u003eIf you’d told me when I started working in book media 16 years ago that the internet would result in the \u003cem\u003eNYT\u003c/em\u003e not just acknowledging genre fiction but covering it enthusiastically, I would have been elated, but I wouldn’t have been able to imagine what it would look like. A silver lining to the ever-increasing challenges of today’s media environment. \u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eKidLit Catch-Up\u003c/h2\u003e\u003cp\u003eAmong my favorite year-end lists are the many varieties of “the ones that got away.” Under-the-radar reads, hidden gems, and word-of-mouth slow burns can be such a delight, and they make great gifts because they’re so much less likely to be repeats than titles chosen from the best-of collections. While you’re making your list and checking it twice this holiday season, don’t miss \u003cem\u003eLit Hub\u003c/em\u003e‘s look at \u003ca href=\"https://lithub.com/ten-childrens-books-to-read-and-enjoy-before-the-year-ends/\"\u003eten kids’ books you might have missed this year. \u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eToday In Books Newsletter\u003c/p\u003e\n\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\n\u003ch2\u003eLet’s Go to the Movies\u003c/h2\u003e\n\u003cp\u003eDecember may be slow on new releases, but it’s \u003ca href=\"https://www.vulture.com/article/book-adaptations-tv-movie-2024.html\"\u003ea big season for adaptations\u003c/a\u003e. The big-screen spins on \u003ca title=\"Buy from Thriftbooks\" product-id=\"0593312147\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fnightbitch_rachel-yoder%2F27209693%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Nightbitch: A Novel\" data-publisher=\"Vintage\" data-releasedate=\"2022-07-05\" data-author=\"Yoder, Rachel\" data-ean=\"9780593312148\" data-asin=\"0593312147\" rel=\"noopener\"\u003eNightbitch\u003c/a\u003e and \u003ca title=\"Buy from Thriftbooks\" product-id=\"0345804341\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-nickel-boys-a-novel_colson-whitehead%2F19688638%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Nickel Boys: A Novel\" data-publisher=\"Vintage\" data-releasedate=\"2020-06-30\" data-author=\"Whitehead, Colson\" data-ean=\"9780345804341\" data-asin=\"0345804341\" rel=\"noopener\"\u003eNickel Boys\u003c/a\u003e are high atop my list for the month, and you better believe I’ll be lining up to see Ralph Fiennes as Odysseus in \u003cem\u003eThe Return\u003c/em\u003e. If a couch party is more your vibe, you’ll have no shortage of options, either, including Netflix’s take on \u003ca title=\"Buy from Thriftbooks\" product-id=\"0060883286\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fone-hundred-years-of-solitude-blooms-guide_gabriel-welsch%2F10868148%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"One Hundred Years of Solitude (Harper Perennial Modern Classics)\" data-publisher=\"Harper Perennial Modern Classics\" data-releasedate=\"2006-02-21\" data-author=\"Gabriel Garcia Marquez\" data-ean=\"\" data-asin=\"0060883286\" rel=\"noopener\"\u003eOne Hundred Years of Solitude\u003c/a\u003e and Parmount+’s \u003cem\u003e\u003ca product-id=\"0593335023\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-road-trip_beth-oleary%2F27388896%2Fitem%2F55491672%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"The Road Trip\" data-publisher=\"Berkley\" data-releasedate=\"2021-06-01\" data-ean=\"9780593335024\" data-asin=\"0593335023\" data-author=\"O\u0026#39;Leary, Beth\" rel=\"noopener\"\u003eThe Road Trip\u003c/a\u003e\u003c/em\u003e, a rom-com by Beth O’Leary.\u003c/p\u003e\n\n\u003c/div\u003e\u003ch2\u003eBook Censorship Trends to Watch for in 2025\u003c/h2\u003e\u003cp\u003eAs we round out another year and look ahead to the next, one thing is for certain: book censorship will continue to evolve and look different as we move into a new administration. Book Riot’s Kelly Jensen zeroes in on some of the \u003ca href=\"https://bookriot.com/censorship-trends-for-2025/\"\u003ebiggest censorship trends to watch for in the new year.\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003e\u003cem\u003eThe comments section is moderated according to our \u003ca href=\"https://bookriot.com/about/community-guidelines/\"\u003ecommunity guidelines\u003c/a\u003e. Please check them out so we can maintain a safe and supportive community of readers!\u003c/em\u003e\u003c/p\u003e\n\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-06T17:20:00Z",
  "modifiedTime": "2024-12-06T17:06:56Z"
}
