{
  "id": "507f609b-5703-42c1-bf0a-aa3ec033554b",
  "title": "Mud to the Rescue! How Animals use Mud to Thrive and Survive",
  "link": "https://www.kirkusreviews.com/book-reviews/tanya-konerman/mud-to-the-rescue-how-animals-use-mud-to-thrive-and-survive/",
  "description": "In these colorful pages, the author discusses the benefits of having plenty of mud around when you’re a member of the animal kingdom. Several types of birds need mud in their everyday lives to help keep their nests sturdy and safe from predators. Macaws eat mud to calm their stomachs and counter poisons—they’re just one of over 200 species that have been documented engaging in geophagia, or eating mud. Turtles all over the globe use mud to protect themselves from inclement weather, whether it’s too hot or too cold. Both elephants and hippos roll in mud to cool themselves off and protect their skin (“A nice layer of mud blocks pests and parasites that itch or make elephants and hippos sick”). The text’s layout pairs prey animals with natural predators that use mud in the same way; readers learn that alligators use mud to protect their eggs, just like the flamingos they hunt. At the back of the book, each of the animals mentioned in the main text receive a dedicated paragraph containing more detailed information. The book also includes a glossary, author’s note, and labeled examples of various species’ footprints. Konerman uses repetitive text to introduce problems that animals encounter for which mud is the solution. (The seminarrative text is lyrical but contains no fictional elements.) On some pages, there are additional, mud splattered text boxes providing more fun facts about the animals (“Duck-billed platypus has a rubbery snout that can sense its prey’s tiny electrical currents in the mud”). Cataldo depicts animals in their environments in realistic illustrations, including details to help readers develop a deeper understanding of the material.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "",
  "length": 4044,
  "excerpt": "Konerman’s illustrated children’s book details the ways in which mud can be helpful in the daily lives of animals all over the world.",
  "siteName": "Kirkus Reviews",
  "favicon": "",
  "text": "CECE LOVES SCIENCE From the Cece and the Scientific Method series by Kimberly Derting \u0026 Shelli R. Johannes ; illustrated by Vashti Harrison ‧ RELEASE DATE: June 19, 2018 A good introduction to observation, data, and trying again. Cece loves asking “why” and “what if.” Her parents encourage her, as does her science teacher, Ms. Curie (a wink to adult readers). When Cece and her best friend, Isaac, pair up for a science project, they choose zoology, brainstorming questions they might research. They decide to investigate whether dogs eat vegetables, using Cece’s schnauzer, Einstein, and the next day they head to Cece’s lab (inside her treehouse). Wearing white lab coats, the two observe their subject and then offer him different kinds of vegetables, alone and with toppings. Cece is discouraged when Einstein won’t eat them. She complains to her parents, “Maybe I’m not a real scientist after all….Our project was boring.” Just then, Einstein sniffs Cece’s dessert, leading her to try a new way to get Einstein to eat vegetables. Cece learns that “real scientists have fun finding answers too.” Harrison’s clean, bright illustrations add expression and personality to the story. Science report inserts are reminiscent of The Magic Schoolbus books, with less detail. Biracial Cece is a brown, freckled girl with curly hair; her father is white, and her mother has brown skin and long, black hair; Isaac and Ms. Curie both have pale skin and dark hair. While the book doesn’t pack a particularly strong emotional or educational punch, this endearing protagonist earns a place on the children’s STEM shelf. A good introduction to observation, data, and trying again. (glossary) (Picture book. 5-8) Pub Date: June 19, 2018 ISBN: 978-0-06-249960-8 Page Count: 40 Publisher: Greenwillow Books Review Posted Online: March 26, 2018 Kirkus Reviews Issue: April 15, 2018",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/530a79c14c8b4585b4d1fb774503f0e2/073d2cce405b453da57efbd9c51372ec.jpg.300x0_q85_autocrop.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eCECE LOVES SCIENCE\u003c/h2\u003e\n                                \n                                \n                                    \u003ca href=\"https://www.kirkusreviews.com/book-series/cece-and-scientific-method/\"\u003e\n                                        \u003ch2\u003e\n                                            From the Cece and the Scientific Method series\n                                            \n                                        \u003c/h2\u003e\n                                    \u003c/a\u003e\n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/kimberly-derting/\"\u003e\n                            Kimberly Derting\n                        \u003c/a\u003e\n                \n            \n                \n                     \u0026amp; \n                    \n                        \u003ca href=\"https://www.kirkusreviews.com/author/shelli-r-johannes/\"\u003e\n                            Shelli R. Johannes\n                        \u003c/a\u003e\n                \n            \n                \n                    ; \n                    illustrated by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/vashti-harrison/\"\u003e\n                            Vashti Harrison\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: June 19, 2018\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    A good introduction to observation, data, and trying again.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eCece loves asking “why” and “what if.” \u003c/p\u003e\n                                        \u003cp\u003eHer parents encourage her, as does her science teacher, Ms. Curie (a wink to adult readers). When Cece and her best friend, Isaac, pair up for a science project, they choose zoology, brainstorming questions they might research. They decide to investigate whether dogs eat vegetables, using Cece’s schnauzer, Einstein, and the next day they head to Cece’s lab (inside her treehouse). Wearing white lab coats, the two observe their subject and then offer him different kinds of vegetables, alone and with toppings. Cece is discouraged when Einstein won’t eat them. She complains to her parents, “Maybe I’m not a real scientist after all….Our project was boring.” Just then, Einstein sniffs Cece’s dessert, leading her to try a new way to get Einstein to eat vegetables. Cece learns that “real scientists have fun finding answers too.” Harrison’s clean, bright illustrations add expression and personality to the story. Science report inserts are reminiscent of The Magic Schoolbus books, with less detail. Biracial Cece is a brown, freckled girl with curly hair; her father is white, and her mother has brown skin and long, black hair; Isaac and Ms. Curie both have pale skin and dark hair. While the book doesn’t pack a particularly strong emotional or educational punch, this endearing protagonist earns a place on the children’s STEM shelf.\u003c/p\u003e\u003cp\u003e\n                                        A good introduction to observation, data, and trying again.  \n                                        (glossary)\n                                        \u003ci\u003e(Picture book. 5-8)\u003c/i\u003e\n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e June 19, 2018\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-0-06-249960-8\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 40\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Greenwillow Books\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e March 26, 2018\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e April 15, 2018\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
