{
  "id": "553caec5-cca4-4a16-8fac-69daebe06779",
  "title": "The Buzziest Books of December | 2024",
  "link": "https://www.newinbooks.com/the-buzziest-books-of-december-2024/",
  "description": "The Buzziest Books of December | 2024 Get ready to snuggle up with a literary wonderland this December! As the frosty winter air wraps the world in its icy embrace, our handpicked selection of must-read titles is here to fill your days with warmth and cheer. From heartwarming tales of... Read More The post The Buzziest Books of December | 2024 appeared first on NewInBooks.",
  "author": "meghan",
  "published": "Thu, 26 Dec 2024 15:28:14 +0000",
  "source": "https://www.newinbooks.com/feed/",
  "categories": [
    "eBook",
    "News"
  ],
  "byline": "meghan",
  "length": 6237,
  "excerpt": "The Buzziest Books of December | 2024 Get ready to snuggle up with a literary wonderland this December! As the frosty winter air wraps the world in its icy embrace, our handpicked selection of must-read titles is here to fill your days with warmth and cheer. From heartwarming tales of... Read More",
  "siteName": "NewInBooks",
  "favicon": "",
  "text": "26 Dec 2024 The Buzziest Books of December | 2024 Get ready to snuggle up with a literary wonderland this December! As the frosty winter air wraps the world in its icy embrace, our handpicked selection of must-read titles is here to fill your days with warmth and cheer. From heartwarming tales of holiday magic to enchanting stories that capture the season’s sparkle, these captivating reads are perfect for the month of celebration and joy. Curious about the books that are lighting up conversations this December? Don’t miss our roundup of this month’s most festive new releases. Happy reading and merry holiday vibes! Walking the Cat (A Louise Moscow Novel Book 4) by Lorraine Evanoff Release Date: November 30 2024 Former CIA operative, Louise Moscow, has received an all-access pass to Paris Fashion Week from an old friend. When a beautiful American photographer is murdered, Louise must use her spy skills to clear her friend’s name. But in the world of fashion and spies, nothing is ever as it seems. Buy on Amazon Bond of the Blood Moon (The Cursed Moon Chronicles Book 1) by Caelin Darkriver Release Date: December 3 2024 Under an ancient curse, werewolves Eira and Kaelen, bound by a Blood Moon prophecy, must choose between duty and desire. Eira, tasked with guarding her pack’s borders, never meant to trust Kaelen, the exiled heir of a fallen pack. But as dark forces rise, he may be her only chance at survival—and forbidden love. Buy on Amazon Lady Clementine and the Tears of Hathor (The Extraordinary Treasure Hunters Book 1) by Camilla Taipalvesi Release Date: November 29 2024 The Mummy meets Indiana Jones in Lady Clementine and the Tears of Hathor. Tasked by Queen Victoria, Lady Clementine must find her missing father and the magical Tears of Hathor. Rivals, deadly traps, ancient secrets, and a blossoming slow-burn romance will show her what she’s really made of. Perfect for fans of historical fantasy and romance. Buy on Amazon Death in the Kremlin (Michael Nicholas Book 5) by E.J. Simon Release Date: November 12 2024 Putin seeks to capture the secret to virtual immortality and the power to control any nation’s power grid and nuclear missiles. The answer remains with one man, living virtually in the cloud, who has already duplicated himself on a computer using a breakthrough in AI. Putin will risk anything, including a global nuclear war, to discover his secret. Buy on Amazon The Fallen Ones (A Holloway University Novel Book 1) by K.G. Reuss \u0026 J.A. Roles Release Date: November 28 2024 Three masked men. One night. One room. One goal. The plan? A party at Satan’s Hollow, an elite frat on the Holloway University campus where the hookups are plenty and secrets are hidden behind the masks we wear.⁣ Let’s just say I took a vow that won’t last long because my ex, my best friend, and my former stepbrother are making it their mission to change my mind. Buy on Amazon Cruel Promise (Sins of the Bratva Book One) by Ivy Davis Release Date: December 10 2024 I was given a deadly ultimatum: death or marriage to the ruthless Bratva leader, Nikolai Petrov. My father chose for me. Now I’m Nikolai’s property. But behind Nikolai’s cold exterior, secrets lurk… Will they destroy my heart or set it ablaze? Can I truly love the beast if he can’t even love at all? Buy on Amazon See You In Eden: The Short Stories of Leonid Pekarovsky by Leonid Pekarovksy Release Date: November 23 2024 “See You in Eden” is the first English collection of short stories by acclaimed Israeli author Leonid Pekarovsky. Blending the surreal, beautiful, and poignant, Pekarovsky draws on his immigrant experience, fusing European, Jewish, and Israeli traditions and merging the fantastic with the realistic to illuminate life’s struggles and triumphs. Buy on Amazon Mastering AI Prompt Engineering: The Ultimate Guide for ChatGPT Users by Adriano Damiao Release Date: September 15 2024 Mastering AI Prompt Engineering is your guide to unlocking AI’s full potential. Learn to craft precise, effective prompts for accurate results, creative content, and problem-solving. With practical tips and advanced techniques, this book empowers you to turn AI into a powerful collaborator. It all starts with the right prompt! Buy on Amazon Jake Fox: Ties That Blind by Michael Stockham Release Date: December 12 2024 If you’re a fan of thrillers that keep you guessing, you’ll love this book! Jake Fox, a once-celebrated big city lawyer, finds himself at rock bottom after his daughter’s death. Danger and deception collide as Jake is thrust into the midst of a sinister puzzle. He’s entangled in a deadly game that he cannot afford to lose. On KU and on sale now! Buy on Amazon Wrong Score (The Hawkeyes Hockey Series Book 9) by Kenna King Release Date: December 1 2024 **An age gap, enemies-to-lovers, steamy hockey coach romance** I’ve spent my entire career chasing the perfect story. But the plot twist I didn’t see coming… was him. When Rowan Summers receives the opportunity of a lifetime, she things her career is set. Right up again the grumpy coach Bexly Townsend sees her as a unnecessary distraction and a threat to his team. Buy on Amazon A Realm Of Dust And Sorrow (Elemental Realms) by H.M. Sandlin Release Date: December 25 2024 A dying world. Storms that bring death. And a girl determined to save her people. Senelow can’t stand it anymore. Her people are dying. The dryads are all but extinct. The storms keep coming, every year worse than the last. Can she discover the cause of the storms and save her people, or is this the end of Nadaira and the dryads? Buy on Amazon Talking About Adolescence (Book 2) by Eichin Chang-Lim OD MS MA Release Date: October 29 2024 Supercharge Your Body and Brain Power is more than just a book; it’s a toolkit for building a solid foundation for your future. You’ll graduate from adolescence feeling confident, empowered, and ready to take charge of your well-being and success. It is a valuable resource for parents, educators, and anyone who cares about a teen’s development. Buy on Amazon meghan Recommended Posts",
  "image": "https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/NIB-Buzziest-December-24.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n           \n\t  \t\t\u003ch6\u003e\u003cspan\u003e26 \u003c/span\u003eDec 2024 \u003c/h6\u003e\n\t\t          \n          \n\t\t\n\t\t\t\u003ch2\u003eThe Buzziest Books of December | 2024\u003c/h2\u003e\n\u003cp\u003eGet ready to snuggle up with a literary wonderland this December! As the frosty winter air wraps the world in its icy embrace, our handpicked selection of must-read titles is here to fill your days with warmth and cheer. From heartwarming tales of holiday magic to enchanting stories that capture the season’s sparkle, these captivating reads are perfect for the month of celebration and joy. Curious about the books that are lighting up conversations this December? Don’t miss our roundup of this month’s most festive new releases. Happy reading and merry holiday vibes!\u003c/p\u003e\n\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DM6NV3N4?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DM6NV3N4 cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41eBGzV3tL._SL500_-19.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41eBGzV3tL._SL500_-19.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eWalking the Cat (A Louise Moscow Novel Book 4)\u003c/h3\u003e\n\u003ch4\u003eby Lorraine Evanoff\u003c/h4\u003e\n\u003cp\u003eRelease Date: November 30 2024\u003c/p\u003e\n\u003cp\u003eFormer CIA operative, Louise Moscow, has received an all-access pass to Paris Fashion Week from an old friend. When a beautiful American photographer is murdered, Louise must use her spy skills to clear her friend’s name. But in the world of fashion and spies, nothing is ever as it seems.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DM6NV3N4?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DN8V47LH?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DN8V47LH cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51JeUGYEmlL._SL500_-4.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51JeUGYEmlL._SL500_-4.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eBond of the Blood Moon (The Cursed Moon Chronicles Book 1)\u003c/h3\u003e\n\u003ch4\u003eby Caelin Darkriver\u003c/h4\u003e\n\u003cp\u003eRelease Date: December 3 2024\u003c/p\u003e\n\u003cp\u003eUnder an ancient curse, werewolves Eira and Kaelen, bound by a Blood Moon prophecy, must choose between duty and desire. Eira, tasked with guarding her pack’s borders, never meant to trust Kaelen, the exiled heir of a fallen pack. But as dark forces rise, he may be her only chance at survival—and forbidden love.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DN8V47LH?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DKBZK7CM?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DKBZK7CM cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51BlZqPbtL._SL500_-21.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51BlZqPbtL._SL500_-21.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eLady Clementine and the Tears of Hathor (The Extraordinary Treasure Hunters Book 1)\u003c/h3\u003e\n\u003ch4\u003eby Camilla Taipalvesi\u003c/h4\u003e\n\u003cp\u003eRelease Date: November 29 2024\u003c/p\u003e\n\u003cp\u003eThe Mummy meets Indiana Jones in Lady Clementine and the Tears of Hathor. Tasked by Queen Victoria, Lady Clementine must find her missing father and the magical Tears of Hathor. Rivals, deadly traps, ancient secrets, and a blossoming slow-burn romance will show her what she’s really made of. Perfect for fans of historical fantasy and romance.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DKBZK7CM?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DJTD9B1R?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DJTD9B1R cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51eBrlQTSL._SL500_-7.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51eBrlQTSL._SL500_-7.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eDeath in the Kremlin (Michael Nicholas Book 5)\u003c/h3\u003e\n\u003ch4\u003eby E.J. Simon\u003c/h4\u003e\n\u003cp\u003eRelease Date: November 12 2024\u003c/p\u003e\n\u003cp\u003ePutin seeks to capture the secret to virtual immortality and the power to control any nation’s power grid and nuclear missiles. The answer remains with one man, living virtually in the cloud, who has already duplicated himself on a computer using a breakthrough in AI. Putin will risk anything, including a global nuclear war, to discover his secret.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DJTD9B1R?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0CN5HRCZ3?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0CN5HRCZ3 cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51hG8qsplyL._SL500_-15.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51hG8qsplyL._SL500_-15.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eThe Fallen Ones (A Holloway University Novel Book 1)\u003c/h3\u003e\n\u003ch4\u003eby K.G. Reuss \u0026amp; J.A. Roles\u003c/h4\u003e\n\u003cp\u003eRelease Date: November 28 2024\u003c/p\u003e\n\u003cp\u003eThree masked men. One night. One room. One goal. The plan? A party at Satan’s Hollow, an elite frat on the Holloway University campus where the hookups are plenty and secrets are hidden behind the masks we wear.⁣ Let’s just say I took a vow that won’t last long because my ex, my best friend, and my former stepbrother are making it their mission to change my mind.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0CN5HRCZ3?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0D9NB7PNJ?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0D9NB7PNJ cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51jkZ5R3NeL._SL500_-12.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51jkZ5R3NeL._SL500_-12.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eCruel Promise (Sins of the Bratva Book One)\u003c/h3\u003e\n\u003ch4\u003eby Ivy Davis\u003c/h4\u003e\n\u003cp\u003eRelease Date: December 10 2024\u003c/p\u003e\n\u003cp\u003eI was given a deadly ultimatum: death or marriage to the ruthless Bratva leader, Nikolai Petrov. My father chose for me. Now I’m Nikolai’s property. But behind Nikolai’s cold exterior, secrets lurk… Will they destroy my heart or set it ablaze? Can I truly love the beast if he can’t even love at all?\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0D9NB7PNJ?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DFCYJT5N?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DFCYJT5N cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51aAPf-w-XL._SL500_-13.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/51aAPf-w-XL._SL500_-13.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eSee You In Eden: The Short Stories of Leonid Pekarovsky\u003c/h3\u003e\n\u003ch4\u003eby Leonid Pekarovksy\u003c/h4\u003e\n\u003cp\u003eRelease Date: November 23 2024\u003c/p\u003e\n\u003cp\u003e“See You in Eden” is the first English collection of short stories by acclaimed Israeli author Leonid Pekarovsky. Blending the surreal, beautiful, and poignant, Pekarovsky draws on his immigrant experience, fusing European, Jewish, and Israeli traditions and merging the fantastic with the realistic to illuminate life’s struggles and triumphs.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DFCYJT5N?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DH649N4X?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DH649N4X cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41OlnX-XFTL._SL500_-13.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41OlnX-XFTL._SL500_-13.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eMastering AI Prompt Engineering: The Ultimate Guide for ChatGPT Users\u003c/h3\u003e\n\u003ch4\u003eby Adriano Damiao\u003c/h4\u003e\n\u003cp\u003eRelease Date: September 15 2024\u003c/p\u003e\n\u003cp\u003eMastering AI Prompt Engineering is your guide to unlocking AI’s full potential. Learn to craft precise, effective prompts for accurate results, creative content, and problem-solving. With practical tips and advanced techniques, this book empowers you to turn AI into a powerful collaborator. It all starts with the right prompt!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DH649N4X?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0CQQFZVJJ?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0CQQFZVJJ cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41shICP1V0L._SL500_-27.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41shICP1V0L._SL500_-27.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eJake Fox: Ties That Blind\u003c/h3\u003e\n\u003ch4\u003eby Michael Stockham\u003c/h4\u003e\n\u003cp\u003eRelease Date: December 12 2024\u003c/p\u003e\n\u003cp\u003eIf you’re a fan of thrillers that keep you guessing, you’ll love this book! Jake Fox, a once-celebrated big city lawyer, finds himself at rock bottom after his daughter’s death. Danger and deception collide as Jake is thrust into the midst of a sinister puzzle. He’s entangled in a deadly game that he cannot afford to lose. On KU and on sale now!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0CQQFZVJJ?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DGPSN7XV?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DGPSN7XV cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41AskyhnEWL._SL500_-9.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41AskyhnEWL._SL500_-9.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eWrong Score (The Hawkeyes Hockey Series Book 9)\u003c/h3\u003e\n\u003ch4\u003eby Kenna King\u003c/h4\u003e\n\u003cp\u003eRelease Date: December 1 2024\u003c/p\u003e\n\u003cp\u003e**An age gap, enemies-to-lovers, steamy hockey coach romance** I’ve spent my entire career chasing the perfect story. But the plot twist I didn’t see coming… was him. When Rowan Summers receives the opportunity of a lifetime, she things her career is set. Right up again the grumpy coach Bexly Townsend sees her as a unnecessary distraction and a threat to his team.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DGPSN7XV?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DNRHHL83?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DNRHHL83 cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/512rkP714L._SL500_-2.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/512rkP714L._SL500_-2.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eA Realm Of Dust And Sorrow (Elemental Realms)\u003c/h3\u003e\n\u003ch4\u003eby H.M. Sandlin\u003c/h4\u003e\n\u003cp\u003eRelease Date: December 25 2024\u003c/p\u003e\n\u003cp\u003eA dying world. Storms that bring death. And a girl determined to save her people. Senelow can’t stand it anymore. Her people are dying. The dryads are all but extinct. The storms keep coming, every year worse than the last. Can she discover the cause of the storms and save her people, or is this the end of Nadaira and the dryads?\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DNRHHL83?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca rel=\"nofollow\" target=\"_blank\" href=\"https://www.amazon.com/dp/B0DDDPGBYS?tag=newinbooks-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\"\u003e\u003cimg decoding=\"async\" alt=\"B0DDDPGBYS cover image\" src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41mzaiXQOHL._SL500_-2.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://www.newinbooks.com/wp-content/uploads/sites/9/2024/12/41mzaiXQOHL._SL500_-2.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003eTalking About Adolescence (Book 2)\u003c/h3\u003e\n\u003ch4\u003eby Eichin Chang-Lim OD MS MA\u003c/h4\u003e\n\u003cp\u003eRelease Date: October 29 2024\u003c/p\u003e\n\u003cp\u003eSupercharge Your Body and Brain Power is more than just a book; it’s a toolkit for building a solid foundation for your future. You’ll graduate from adolescence feeling confident, empowered, and ready to take charge of your well-being and success. It is a valuable resource for parents, educators, and anyone who cares about a teen’s development.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/gp/product/B0DDDPGBYS?tag=newinbooks-20\" title=\"\" target=\"_blank\"\u003eBuy on Amazon\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\n\n\t\t\t\t\t\n\t\t\t\t \n          \u003cbr/\u003e\n\t\t  \n\t\t\t  \n\t\t\t \n\t\t\t \n\n\t\t\n                  \u003cdiv\u003e\t\t  \n\t\n\t\t  \u003cp\u003e\u003cimg src=\"https://www.gravatar.com/avatar.php?gravatar_id=79cdacaf4ce2707b9b664da0ab6f8988\u0026amp;size=40\" height=\"64\" width=\"64\" alt=\"meghan@writtenwordmedia.com\u0026#39;\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%2064%2064\u0026#39;%3E%3C/svg%3E\"/\u003e\u003c/p\u003e\u003ch5\u003emeghan\u003c/h5\u003e\n\t\t   \n\t\t  \n\n\t\t  \n\t\t  \u003c/div\u003e\n\t\t  \t\t  \n\t\t  \n\t\t  \n\t\t  \n\t\u003cdiv\u003e\u003cp\u003e\u003ch3\u003eRecommended Posts\u003c/h3\u003e\u003c/p\u003e\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t  \n\t\t  \n\t\t  \n\n\t\t  \n        \u003c/div\u003e\n\t\t\t\t\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-26T10:28:14-05:00",
  "modifiedTime": "2024-12-26T15:28:14Z"
}
