{
  "id": "5feb5a15-939d-449e-a33a-0717319676eb",
  "title": "HORRIBLE WOMEN, WONDERFUL GIRLS",
  "link": "https://www.kirkusreviews.com/book-reviews/julie-ann-sipos-1/horrible-women-wonderful-girls/",
  "description": "Forty-year-old Jaycee Grayson, fresh from a stint in the Betty Ford rehab center after having been fired from her job at a big-name Hollywood studio, is about to embark on a new adventure. Her older sister Meredith Grayson-O’Cochlain, a high-powered attorney, has negotiated a contract for Jaycee to be the new executive producer and vice president of global entertainment at Wonderful Girls, a successful manufacturer of lifelike dolls that reflect individual personalities and aspirations. The company, run primarily by women, was founded by the now semi-retired Happy Lindstrom. It has recently been sold for a fortune to a Japanese company but still maintains its headquarters in Littleburgh, Wisconsin. “Pulled by this strange and wonderful concept of female unity,” Jaycee heads to Wisconsin, where she discovers a workplace brimming with an intoxicating sweetness that belies the back-stabbing manipulations of Wonderful Girls’ venomous staff. Amply funded by a new termination agreement with the Hollywood studio hammered out by Meredith, Jaycee buys a house in Littleburgh reportedly built by the late architect Frank Lloyd Wright for his mistress. Once she settles in, it does not take long for her to discover that duplicity runs rampant below Wonderful Girls’ saccharine surface; bad-mouthing and sabotage lurk around every corner. Sipos writes with wit, introducing a large cast of quirky characters hiding a trove of backstories and deceptions. The dialogue is filled with sharply focused sarcasm, and Jaycee, who narrates the tale, is a feisty protagonist relentlessly trudging through a chaotic swamp of miscreants. Abel Dreaux, the village police chief, adds a bit of offbeat romance, and the aging Happy Lindstrom proves to be a delightful, surprising powerhouse. The relationship between Jaycee and Meredith provides some needed poignancy, as does the developing friendship between Jaycee and the gently rebellious Mennonite couple that tends to her culinary and gardening needs. Even so, acerbic humor is never more than a paragraph or two away.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Kristin Hannah",
  "length": 4889,
  "excerpt": "A down-on-her-luck developer of products for the film and gaming industry leaves Los Angeles for a job in Wisconsin in Sipos’ spirited satire.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "THE WEDDING PEOPLE by Alison Espach ‧ RELEASE DATE: July 30, 2024 Uneven but fitfully amusing. Awards \u0026 Accolades Likes 16 Our Verdict GET IT New York Times Bestseller Betrayed by her husband, a severely depressed young woman gets drawn into the over-the-top festivities at a lavish wedding. Phoebe Stone, who teaches English literature at a St. Louis college, is plotting her own demise. Her husband, Matt, has left her for another woman, and Phoebe is taking it hard. Indeed, she's determined just where and how she will end it all: at an oceanfront hotel in Newport, where she will lie on a king-sized canopy bed and take a bottle of her cat’s painkillers. At the hotel, Phoebe meets bride-to-be Lila, a headstrong rich girl presiding over her own extravagant six-day wedding celebration. Lila thought she had booked every room in the hotel, and learning of Phoebe's suicidal intentions, she forbids this stray guest from disrupting the nuptials: “No. You definitely can’t kill yourself. This is my wedding week.” After the punchy opening, a grim flashback to the meltdown of Phoebe's marriage temporarily darkens the mood, but things pick up when spoiled Lila interrupts Phoebe's preparations and sweeps her up in the wedding juggernaut. The slide from earnest drama to broad farce is somewhat jarring, but from this point on, Espach crafts an enjoyable—if overstuffed—comedy of manners. When the original maid of honor drops out, Phoebe is persuaded, against her better judgment, to take her place. There’s some fun to be had here: The wedding party—including groom-to-be Gary, a widower, and his 11-year-old daughter—takes surfing lessons; the women in the group have a session with a Sex Woman. But it all goes on too long, and the humor can seem forced, reaching a low point when someone has sex with the vintage wedding car (you don’t want to know the details). Later, when two characters have a meet-cute in a hot tub, readers will guess exactly how the marriage plot resolves. Uneven but fitfully amusing. Pub Date: July 30, 2024 ISBN: 9781250899576 Page Count: 384 Publisher: Henry Holt Review Posted Online: Sept. 13, 2024",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/fc966d97014a4c4ca4125593df7cda69/734650d8ac35427e9905a846a19cad43.jpeg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eTHE WEDDING PEOPLE\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/alison-espach/\"\u003e\n                            Alison Espach\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: July 30, 2024\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Uneven but fitfully amusing.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                            \u003cdiv data-id=\"2000259235\" data-meta-len=\"3\"\u003e\n            \u003cp\u003eAwards \u0026amp; Accolades\u003c/p\u003e\n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eLikes\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/like.png\" alt=\"Readers Vote\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp id=\"2000259235-total-likes\"\u003e16\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eOur Verdict\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/check-ok.png\" alt=\"Our Verdict\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eGET IT\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eNew York Times Bestseller\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n            \n        \u003c/div\u003e\n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eBetrayed by her husband, a severely depressed young woman gets drawn into the over-the-top festivities at a lavish wedding. \u003c/p\u003e\n                                        \u003cp\u003ePhoebe Stone, who teaches English literature at a St. Louis college, is plotting her own demise. Her husband, Matt, has left her for another woman, and Phoebe is taking it hard. Indeed, she\u0026#39;s determined just where and how she will end it all: at an oceanfront hotel in Newport, where she will lie on a king-sized canopy bed and take a bottle of her cat’s painkillers. At the hotel, Phoebe meets bride-to-be Lila, a headstrong rich girl presiding over her own extravagant six-day wedding celebration. Lila thought she had booked every room in the hotel, and learning of Phoebe\u0026#39;s suicidal intentions, she forbids this stray guest from disrupting the nuptials: “No. You definitely can’t kill yourself. This is my \u003ci\u003ewedding \u003c/i\u003eweek.” After the punchy opening, a grim flashback to the meltdown of Phoebe\u0026#39;s marriage temporarily darkens the mood, but things pick up when spoiled Lila interrupts Phoebe\u0026#39;s preparations and sweeps her up in the wedding juggernaut. The slide from earnest drama to broad farce is somewhat jarring, but from this point on, Espach crafts an enjoyable—if overstuffed—comedy of manners. When the original maid of honor drops out, Phoebe is persuaded, against her better judgment, to take her place. There’s some fun to be had here: The wedding party—including groom-to-be Gary, a widower, and his 11-year-old daughter—takes surfing lessons; the women in the group have a session with a Sex Woman. But it all goes on too long, and the humor can seem forced, reaching a low point when someone has sex with the vintage wedding car (you don’t want to know the details). Later, when two characters have a meet-cute in a hot tub, readers will guess exactly how the marriage plot resolves.\u003c/p\u003e\u003cp\u003e\n                                        Uneven but fitfully amusing.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e July 30, 2024\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9781250899576\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 384\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Henry Holt\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Sept. 13, 2024\u003c/p\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
