{
  "id": "87c630f9-72c3-4c9a-94ec-6ecb38851481",
  "title": "New Iowa Bill Would Revoke Funding for Library Affiliation with the American Library Association",
  "link": "https://bookriot.com/iowa-hf-284/",
  "description": "Iowa public libraries may lose access to state funds for being affiliated by the American Library Association under a new anti-library bill floated by state republicans.",
  "author": "Kelly Jensen",
  "published": "Tue, 25 Feb 2025 18:20:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Literary Activism",
    "News"
  ],
  "byline": "Kelly Jensen",
  "length": 6490,
  "excerpt": "Iowa public libraries may lose access to state funds for being affiliated by the American Library Association under a new anti-library bill floated by state republicans.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "Kelly is a former librarian and a long-time blogger at STACKED. She's the editor/author of (DON'T) CALL ME CRAZY: 33 VOICES START THE CONVERSATION ABOUT MENTAL HEALTH and the editor/author of HERE WE ARE: FEMINISM FOR THE REAL WORLD. Her next book, BODY TALK, will publish in Fall 2020. Follow her on Instagram @heykellyjensen. View All posts by Kelly Jensen Iowa House Representative Helena Hayes, whose bill to criminalize librarians has moved rapidly through the legislature and which spawned a copycat bill in the Senate, has brought another anti-library bill to the House this week. House File 284 would cut off certain state funds to libraries if they are dues-paying members to the American Library Association (ALA) or the Iowa Library Association. Those funds are called Enrich Iowa and they provide around $2.1 million in aid to public libraries statewide. Most of those funds are in the form of direct grants. About 450 libraries in the state receive these funds, and while they are not significant, all libraries squeeze what they can out of every penny. Hayes claims the reason such a bill is needed is because the ALA opposes ratings placed on books in libraries. She’s frustrated that the ALA does not condone book censorship. The ALA is the largest organization for library workers. Libraries become members of the association because membership provides not only ongoing education and support, but it allows access to further funding for library projects. Iowa libraries have benefitted from these funds. ALA grant money has gone to help add Iowa public libraries add accessible meeting rooms to facilities, recover following devastating weather events, and provide mobility tools for patrons to maneuver their library. Lawmakers repeated the same lies about “inappropriate material” and “indoctrination” related to the ALA that have been spewed throughout the country over the last several years. When pressed to point to where and how specific books in public libraries are causing harm, legislators could not cite examples. Per reporting by the Iowa Capitol Dispatch, a state lobbyist for the Iowa Faith and Freedom Coalition claimed seeing a book called He’s My Mom at the Des Moines Public Library was objectionable. Literary Activism Newsletter News you can use plus tips and tools for the fight against censorship and other bookish activism! Thank you for signing up! Keep an eye on your inbox. Attempts to choke out libraries and librarians from affiliation with their professional organization are not new. This is fueled by misinformation peddled by the far right, who see the ALA as some kind of machine that encourages librarians to fill their shelves with “pornography,” “obscenity,” and “inappropriate material,” as well as one that trains library workers how to undermine parents through diversity, equity, and inclusion initiatives. As outrageous as that sentence sounds — do we see the same kinds of arguments lodged at, say, police professional organizations, despite the fact they, too, seek to educate law enforcement officers about diversity, equity, inclusion, social-emotional learning, and so forth? — it underscores what these book bans are actually about. It’s not the books. It’s about eliminating anything outside the far-right Christian agenda from American democracy. When the book bans themselves are not enough to get the job done, ALA is a prime next target. By demonizing a professional organization, these individuals and groups are able to further damage the actual professionalization of the field — one that goes back to 1876. Disaffiliation is harmful to the libraries themselves, too, as the ALA provides grants and projects that are available only to those who are affiliated with the group (something pretty standard across all professional organizations, as membership dues help fund these things). ALA also helps libraries follow policies, procedures, and standards to ensure that these institutions are strong stewards of public money, that they follow ethical and legal guidelines, and that they actually serve the whole of a community. ALA lobbies on behalf of its members, too, ensuring that libraries are being funded and respected as one of the few democratic institutions in America. Hayes’s bill plays into the ongoing moral panic around “inappropriate” material in libraries, and it seeks to further deprofessionalize libraries by setting up a system by which in order for Iowa libraries to get state-supported funding, they need to withdraw from their professional organization. Going a step further, House File 284 also applies to Iowa’s state library association, meaning that libraries would need to be completely unaffiliated with organizations that support their interests and development in order to receive Enrich Iowa funds. Without question, Hayes seeks to destroy public libraries statewide. She and her affiliated legislators are drafting bills based on a moral panic they themselves created and continue to stoke. There are no inappropriate nor obscene materials in public libraries, as those are illegal to publish and distribute. The Miller Test has been eschewed in favor of “just trust me” politics–and at the speed these bills are being written and pushed through Iowa’s legislature, the future for Iowa public libraries looks particularly grim. Just last spring, Louisiana legislators tried, but failed, to pass a bill that would criminalize librarians for being members of the American Library Association. It would not be out of the question for Hayes to draft a similar bill. House File 284 is written in a vague enough manner that while it seems as though it applies only to libraries with an American Library Association or Iowa Library Association membership, that vagueness is enough for those seeking to target public library workers to claim it also applies to anyone affiliated with the library, period. House File 284 was introduced on February 10 as part of Hayes’s flurry of anti-library bills, and it was referred to the House Education Committee. It passed out of the Committee with recommendation on February 24, 2025. If you live in Iowa, get on the phone, in the inboxes, and in the offices of your state Representatives and Senators. You can find who they are here. It is also crucial to keep an eye on the bills being pumped out at record speed in your state. You can do that via Legiscan, which allows you to subscribe to updates on each bill.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary.jpg.webp\" alt=\"image of the inside of a library with three black dollar signs crossed out laid on top\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20620%20332\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary-300x161.jpg.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2025/02/money-xed-out-lbrary.jpg.webp\"/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-591243 post type-post status-publish format-standard has-post-thumbnail hentry category-literary-activism category-news pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eKelly is a former librarian and a long-time blogger at STACKED. She\u0026#39;s the editor/author of (DON\u0026#39;T) CALL ME CRAZY: 33 VOICES START THE CONVERSATION ABOUT MENTAL HEALTH and the editor/author of HERE WE ARE: FEMINISM FOR THE REAL WORLD. Her next book, BODY TALK, will publish in Fall 2020. Follow her on Instagram \u003ca href=\"http://instagram.com/heykellyjensen\"\u003e@heykellyjensen\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://bookriot.com/author/kellyjensen/\"\u003eView All posts by Kelly Jensen\u003c/a\u003e\u003c/p\u003e\n\t\t\t\u003c/span\u003e\n\t\t\u003c/p\u003e\n\t\t\u003cdiv\u003e\u003cp\u003eIowa House Representative Helena Hayes, whose \u003ca href=\"https://bookriot.com/iowa-rushes-advances-librarian-criminalization-bill/\"\u003ebill to criminalize librarians\u003c/a\u003e has moved rapidly through the legislature and which \u003ca href=\"https://www.publishersweekly.com/pw/by-topic/industry-news/libraries/article/97125-new-bills-in-iowa-threaten-to-tighten-obscenity-provisions-for-libraries.html\"\u003espawned a copycat bill\u003c/a\u003e in the Senate, has brought another anti-library bill to the House this week. \u003ca href=\"https://www.legis.iowa.gov/legislation/BillBook?ba=HF284\"\u003eHouse File 284\u003c/a\u003e would cut off certain state funds to libraries if they are dues-paying members to the American Library Association (ALA) or the Iowa Library Association.\u003c/p\u003e\n\u003cp\u003eThose funds are called Enrich Iowa and they provide around $2.1 million in aid to public libraries statewide. Most of those funds are in the form of direct grants. About 450 libraries in the state receive these funds, and while they are not significant, all libraries squeeze what they can out of every penny. \u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eHayes claims the reason such a bill is needed is because the ALA opposes ratings placed on books in libraries. She’s frustrated that the ALA does not condone book censorship. \u003c/p\u003e\n\u003cp\u003eThe ALA is the largest organization for library workers. Libraries become members of the association because membership provides not only ongoing education and support, but it allows access to further funding for library projects. Iowa libraries have benefitted from these funds. ALA grant money has gone to help add Iowa public libraries add accessible meeting rooms to facilities, recover following devastating weather events, and provide mobility tools for patrons to maneuver their library. \u003c/p\u003e\n\n\u003cp\u003eLawmakers repeated the same lies about “inappropriate material” and “indoctrination” related to the ALA that have been spewed throughout the country over the last several years. When pressed to point to where and how specific books in public libraries are causing harm, legislators could not cite examples. \u003ca href=\"https://iowacapitaldispatch.com/2025/02/24/bill-would-strip-state-funds-from-public-libraries-based-on-association-membership/\"\u003ePer reporting by the Iowa Capitol Dispatch\u003c/a\u003e, a state lobbyist for the Iowa Faith and Freedom Coalition claimed seeing a book called \u003cem\u003eHe’s My Mom \u003c/em\u003eat the Des Moines Public Library was objectionable. \u003c/p\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eLiterary Activism Newsletter\u003c/p\u003e\n\u003cp\u003e\nNews you can use plus tips and tools for the fight against censorship and other bookish activism!\n\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\n\u003cp\u003eAttempts to choke out libraries and librarians from affiliation with their professional organization \u003ca href=\"https://bookriot.com/states-where-librarians-cannot-join-the-ala/\"\u003eare not new\u003c/a\u003e. This is fueled by misinformation peddled by the far right, who see the ALA as some kind of machine that encourages librarians to fill their shelves with “pornography,” “obscenity,” and “inappropriate material,” as well as one that trains library workers how to undermine parents through diversity, equity, and inclusion initiatives. As outrageous as that sentence sounds — do we see the same kinds of arguments lodged at, say, police professional organizations, despite the fact they, too, seek to educate law enforcement officers about diversity, equity, inclusion, social-emotional learning, and so forth? — it underscores what these book bans are actually about. It’s not the books. It’s about eliminating anything outside \u003ca href=\"https://bookriot.com/shiny-happy-people-and-book-bans/\"\u003ethe far-right Christian agenda\u003c/a\u003e from American democracy.\u003c/p\u003e\n\u003cp\u003eWhen the book bans themselves are not enough to get the job done, ALA is a prime next target. By demonizing a professional organization, these individuals and groups are able to further damage the actual professionalization of the field — one that goes back to 1876. Disaffiliation is harmful to the libraries themselves, too, as the ALA provides grants and projects that are available only to those who are affiliated with the group (something pretty standard across \u003cem\u003eall \u003c/em\u003eprofessional organizations, as membership dues help fund these things). ALA also helps libraries follow policies, procedures, and standards to ensure that these institutions are strong stewards of public money, that they follow ethical and legal guidelines, and that they actually serve the whole of a community. ALA lobbies on behalf of its members, too, ensuring that libraries are being funded and respected as one of the few democratic institutions in America.\u003c/p\u003e\n\n\n\n\n\u003cp\u003eHayes’s bill plays into the ongoing moral panic around “inappropriate” material in libraries, and it seeks to further deprofessionalize libraries by setting up a system by which in order for Iowa libraries to get state-supported funding, they need to withdraw from their professional organization. Going a step further, House File 284 also applies to Iowa’s state library association, meaning that libraries would need to be completely unaffiliated with organizations that support their interests and development in order to receive Enrich Iowa funds.\u003c/p\u003e\n\u003cp\u003eWithout question, Hayes seeks to destroy public libraries statewide. She and her affiliated legislators are drafting bills based on a moral panic they themselves created and continue to stoke. There are no inappropriate nor obscene materials in public libraries, as those are illegal to publish and distribute. The Miller Test has been eschewed in favor of “just trust me” politics–and at the speed these bills are being written and pushed through Iowa’s legislature, the future for Iowa public libraries looks particularly grim. \u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eJust last spring, Louisiana legislators tried, but failed, to pass a bill that would \u003ca href=\"https://bookriot.com/louisiana-hb-777/\"\u003ecriminalize librarians for being members of the American Library Association\u003c/a\u003e. It would not be out of the question for Hayes to draft a similar bill. House File 284 is written in a vague enough manner that while it seems as though it applies only to \u003cem\u003elibraries \u003c/em\u003ewith an American Library Association or Iowa Library Association membership, that vagueness is enough for those seeking to target public library workers to claim it also applies to anyone affiliated with the library, period. \u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.legis.iowa.gov/legislation/BillBook?ba=HF284\"\u003eHouse File 284\u003c/a\u003e was introduced on February 10 as part of Hayes’s flurry of anti-library bills, and it was referred to the House Education Committee. It passed out of the Committee with recommendation on February 24, 2025. \u003c/p\u003e\n\n\u003cp\u003eIf you live in Iowa, get on the phone, in the inboxes, and in the offices of your state Representatives and Senators. \u003ca href=\"https://www.legis.iowa.gov/legislators/find\"\u003eYou can find who they are here\u003c/a\u003e. It is also crucial to keep an eye on the bills being pumped out at record speed in your state. You can do that \u003ca href=\"https://legiscan.com/IA\"\u003evia Legiscan\u003c/a\u003e, which allows you to subscribe to updates on each bill. \u003c/p\u003e\n\u003c/div\u003e\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-25T18:20:00Z",
  "modifiedTime": null
}
