{
  "id": "a0713b0c-2be4-4890-a670-61ec4c796bff",
  "title": "The Biggest Book News of the Week",
  "link": "https://bookriot.com/the-biggest-book-news-of-the-week-9/",
  "description": "Here are the news stories from the week in books and reading worth knowing about",
  "author": "Jeff O'Neal",
  "published": "Sat, 09 Nov 2024 19:58:13 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "Jeff O'Neal",
  "length": 3049,
  "excerpt": "Here are the news stories from the week in books and reading worth knowing about",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. Here are the biggest headlines from the last week. Dorothy Allison, Author of Bastard Out of Carolina, Dies at Age 75 Though her second novel, Cavedweller was quite good and sold well, Allison will forever be known for Bastard Out of Carolina. The subject matter is a tough as it gets–abuse of all kinds is depicted with a steely resolve. Allison’s ear is particularly good, and the dialogue and language is sharp and grounding. It’s been awhile since I read it, but I think it still holds up as a good as a depiction of class, gender, and violence in America as you are going to find. Certainly more interesting than a certain best-selling book by a VP-elect I could name. Hachette’s Basic Books Launches New Conservative Imprint I wondered about more conservative imprints happening in the wake of Trump’s win, but clearly Basic had Liberty in the hopper. I wonder if this would have gone forward if things had gone the other way. There was a time that an announcement like this might have sparked a walkout or something from employees, but it’s not 2022 anymore, baby. Sales Surge for Dystopian Books The Handmaid’s Tale. On Tyranny. Men Explain Things to Me. These are the kinds of books folks are buying (at least those who are mortified by Trump’s win). 1984 was the book that flew off the shelves in 2016, when Trump’s habitual lying was terrifyingly novel. Seems like buyers now aren’t so much interested in a Big Brother comp as they are a Fascist one. Easy to see why. Barnes \u0026 Noble Opening 12 New Stores in November, Bringing 2024 Total to 60 I looked around a bit to see if these new stores opening in November, and from the whole year actually, are resulting in a net gain of locations for B\u0026N or are being offset by closings elsewhere. No real geographical concentration either: these new stories are all over the place (Utah, California, Kansas, New York, New Hampsire, etc). Still, five years ago if you would have told me that they would be averaging five new stores a month in 2024, I would wonder how we got here. And if you used the worlds Covid and TikTok, I would have understood even less. How to Fight Book Bans and Censorship in 2024 In October 2021, I put together the first comprehensive guide to fighting book bans and challenges at Book Riot during the rising wave of censorship. Despite linking to this again and again and despite it being the foundation from which Book Riot put together an entire ebook last February—How to Fight Book Bans and Censorship—and despite the fact that we are absolutely flooded with “how to” resources everywhere, I’m still asked for more. So let’s do just that. Here’s the most basic, boiled-down primer for how to fight book bans in 2024. It’s short, sweet, and to the point. Today In Books Newsletter Sign up to Today In Books to receive daily news and miscellany from the world of books. Thank you for signing up! Keep an eye on your inbox.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news.png.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news.png.webp\" alt=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news.png.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news-300x161.png.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20620%20332\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news.png.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news-300x161.png.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/07/book-news.png.webp\"/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-583545 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\n\t\t\u003cdiv\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. Here are the biggest headlines from the last week. \u003c/em\u003e\u003c/p\u003e\n\u003ch2\u003eDorothy Allison, Author of Bastard Out of Carolina, Dies at Age 75\u003c/h2\u003e\n\u003cp\u003eThough her second novel, \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcavedweller_dorothy-allison%2F450972%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCavedweller\u003c/a\u003e was quite good and sold well, Allison will forever be known for \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fbastard-out-of-carolina_dorothy-allison%2F246223%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBastard Out of Carolina\u003c/a\u003e. The subject matter is a tough as it gets–abuse of all kinds is depicted with a steely resolve. Allison’s ear is particularly good, and the dialogue and language is sharp and grounding. It’s been awhile since I read it, but I think it still holds up as a good as a depiction of class, gender, and violence in America as you are going to find. Certainly more interesting than a certain best-selling book by a VP-elect I could name.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003ch2\u003eHachette’s Basic Books Launches New Conservative Imprint\u003c/h2\u003e\n\u003cp\u003eI wondered about more conservative imprints happening in the wake of Trump’s win, but \u003ca href=\"https://www.hachettebookgroup.com/imprint/basic-books-group/basic-liberty/\"\u003eclearly Basic had Liberty in the hopper\u003c/a\u003e. I wonder if this would have gone forward if things had gone the other way. There was a time that an announcement like this might have sparked a walkout or something from employees, but it’s not 2022 anymore, baby.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch2\u003eSales Surge for Dystopian Books\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-handmaids-tale-by-margaret-atwood%2F247067%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Handmaid’s Tale\u003c/a\u003e. \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fon-tyranny-twenty-lessons-from-the-twentieth-century_timothy-snyder%2F13462819%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eOn Tyranny\u003c/a\u003e. \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fmen-explain-things-to-me_rebecca-solnit%2F8792611%2Fitem%2F18132067%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMen Explain Things to Me\u003c/a\u003e. These are the kinds of books \u003ca href=\"https://www.theguardian.com/books/2024/nov/07/sales-dystopian-books-trump-election-handmaids-tale-on-tyranny?CMP=twt_books_b-gdnbooks\"\u003efolks are buying\u003c/a\u003e (at least those who are mortified by Trump’s win). 1984 was the book that flew off the shelves in 2016, when Trump’s habitual lying was terrifyingly novel. Seems like buyers now aren’t so much interested in a Big Brother comp as they are a Fascist one. Easy to see why.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003ch2\u003eBarnes \u0026amp; Noble Opening 12 New Stores in November, Bringing 2024 Total to 60\u003c/h2\u003e\n\u003cp\u003eI looked around a bit to see if \u003ca href=\"https://www.shelf-awareness.com/issue.html?issue=4849\u0026amp;share=true#m65690\"\u003ethese new stores opening in November\u003c/a\u003e, and from the whole year actually, are resulting in a net gain of locations for B\u0026amp;N or are being offset by closings elsewhere. No real geographical concentration either: these new stories are all over the place (Utah, California, Kansas, New York, New Hampsire, etc). Still, five years ago if you would have told me that they would be averaging five new stores a month in 2024, I would wonder how we got here. And if you used the worlds Covid and TikTok, I would have understood even less.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://bookriot.com/how-to-fight-book-bans-and-censorship-in-2024/\"\u003eHow to Fight Book Bans and Censorship in 2024\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eIn October 2021, I put together the first comprehensive \u003ca href=\"https://bookriot.com/how-to-fight-book-bans-and-challenges/\"\u003eguide to fighting book bans and challenges\u003c/a\u003e at Book Riot during the rising wave of censorship. Despite linking to this again and again and despite it being the foundation from which Book Riot put together an entire ebook last February—\u003ca href=\"https://www.amazon.com/gp/product/B0BT8L8YL3/ref=as_li_tf_il?ie=UTF8\u0026amp;tag=rnmgnewsletter-20\u0026amp;linkCode=as2\u0026amp;camp=217145\u0026amp;creative=399349\u0026amp;creativeASIN=B0BT8L8YL3\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow to Fight Book Bans and Censorship\u003c/a\u003e—and despite the fact that we are absolutely flooded with “how to” resources everywhere, I’m still asked for more. So let’s do just that. Here’s the most basic, boiled-down primer for how to fight book bans in 2024. It’s short, sweet, and to the point.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eToday In Books Newsletter\u003c/p\u003e\n\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003c/div\u003e\n\t\n\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-09T19:58:13Z",
  "modifiedTime": "2024-11-09T19:58:15Z"
}
