{
  "id": "a3e06fdb-d679-45c8-8693-cd347321fe2d",
  "title": "BEYOND ARCHITECTURE",
  "link": "https://www.kirkusreviews.com/book-reviews/barbaralee-diamonstein-spielvogel/beyond-architecture/",
  "description": "In commemoration of the 60th anniversary of the New York City Landmarks Preservation Commission (LPC), Diamonstein-Spielvogel, former LPC commissioner and nationally renowned arts advocate, invited people knowledgeable about the city’s architecture and history to “write freely on any and all…aspects of the built environment, including the role of preservation in a changing city.” The result is a diverse set of essays ranging from the history of the Bowne House, the oldest house in Queens, to the engineering challenges of adaptive reuse and the need to design and construct buildings that will endure beyond their original use. The book’s value lies with those essayists who encourage the LPC to lessen its fixation on the aesthetics of individual buildings—particularly regarding historic districts—and its timidity in the face of real estate interests. They urge the LPC to preserve, as New York Times architecture critic Michael Kimmelman writes, the “things that give the city and its neighborhoods their character, distinction, vitality, social cohesion, and meaning.” The intent is to protect and preserve the city’s cultural history (its intangible heritage), sites of ecological value (i.e., living landmarks), historic signage, and structural and mechanical building systems. Yet the book excludes the voices of the many people who think “beyond architecture,” including urban planners, urbanists, sociologists, and cultural scholars, among others. Historic preservation in New York City seems unable to escape the gravitational pull of individual buildings and the architectural profession. The book would have benefited from an essay reflecting on the LPC’s political, bureaucratic, and financial limitations and unrealized potential. Well worth reading, nonetheless, are thoughtful essays by Kimmelman and fellow architecture critic Paul Goldberger, architect Lisa Switkin, and the historic preservation scholar Andrew Dolkart.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
