{
  "id": "05cc098a-71a8-44e9-a2c4-09c325cc57f8",
  "title": "#2274 1440: $20+mil / year newsletter",
  "link": "https://mixergy.com/interviews/1440-20mil-year-newsletter/",
  "description": "After closing a company that failed, Tim Huelskamp decided to keep it simple. He launched an email newsletter that briefed smart people about the day’s top news. Today his company, 1440, has over 4 million subscribers and generates over $20 million in annual revenue Tim Huelskamp is the co-founder of 1440, the fact-focused daily newsletter. Tim and his team are building 1440 into a trusted source for intellectually curious readers who want an inch-deep, mile-wide view of the world. More interviews -\u003e https://mixergy.com/moreint Rate this interview -\u003e https://mixergy.com/rateint",
  "author": "Andrew Warner",
  "published": "Tue, 29 Apr 2025 17:00:33 +0000",
  "source": "https://feeds.feedburner.com/Mixergy-main-podcast",
  "categories": [
    "startups",
    "ambition",
    "mix",
    "energy",
    "synergy",
    "mixology",
    "entrepreneur",
    "business",
    "tips",
    "motivation"
  ],
  "byline": "",
  "length": 59919,
  "excerpt": "After closing a company that failed, Tim Huelskamp decided to keep it simple. He launched an email newsletter that briefed smart people about the day’s top news. Today his company, 1440, has over 4 million subscribers and generates over $20 million in annual revenue",
  "siteName": "Business Podcast for Startups",
  "favicon": "https://mixergy.com/wp-content/themes/mixergy-2015-v2/assets/img/icons/apple-touch-icon-180x180.png",
  "text": "Andrew Warner: Hey there, freedom Fighters. My name is Andrew Warner. I’m the founder of Mixer G, where I interview entrepreneurs about how they built their businesses. Joining me is an entrepreneur who is building an email newsletter company. And to be honest with you, when my partner in bootstrap Giants, Jesse told me about 1440, and he kept getting excited about having had them as a client. I said, first of all, the name makes no sense to me. And second, why are you so excited about a newsletter company? This thing has existed forever in newsletters, it feels like, since the beginning of the internet. And what he kept saying to me was, this is different. It’s. It’s bigger than you realize. It’s the, it’s an example of what a bootstrap giant’s. Company can be built sustainably, built in a way that’s growing, built with, with heart and clarity, and not this idea of let’s raise a lot of money and try to figure something out and have a small chance at something that would work. And so I’ve looked into 1440 and it’s such an interesting business. It’s a fast growing, fact focused newsletter that curates the day’s most important news and the revenue is really exciting, but mostly the story behind how it’s. How it’s been built, I think is inspiring for what’s possible. And so I invited the founder, Tim Samp, to come on here and talk about how he’s doing it. And Tim, since my, I’m known for asking people their revenue. I’ll start off by asking you, what is the revenue at 1440? Tim Huelskamp: Yeah. First of all, thank you so much for the opportunity Austin to be here with you. Uh, we have, we do over a million in revenue per employee, and we have 22 employees. Andrew Warner: Wow. Tim Huelskamp: We don’t, how about this? We don’t do 2 million revenue per employee. It’s between one and 2 million and we have 22 employees. So I can let your, the readers do the math. Andrew Warner: it’s huge and it’s profitable. From what I understand. Tim Huelskamp: Yep. Very Andrew Warner: Several million dollars is what I think I’d read in, uh, Adweek. Tim Huelskamp: Yep. Very. Yep. Very, very much Andrew Warner: No outside funding. Tim Huelskamp: So we did take a little bit of like revenue based financing and kinda like debt, like features early on. Um, actually if you’re a, a fan of Shark Tank, you know how Mr. Wonderful is always like those royalty deals he talks about. We basically took like an equivalent of that early on and what it did, it allowed us to. It was, I’ll just give the five. It was $500,000 and basically at the time, I think we had something like 10, 20,000 subscribers, but we could figure out our unit economics. We could see ’em already working, right? Like we had retention, we had open rates. You could see it all working and we’re like, all right, thi this, this business is working. Let’s pour some fuel on the fire. So yeah, we raised this $500,000 round and the way it was structured was we got $500,000 and we paid back. Starting a year later. So it allowed it to like, you know, the flywheel to spin a little bit. We paid back 5% of our revenues until the investor got three x return on their capital and then they, and then they got like a slight little equity kicker as well in case like for schmuck insurance, like if we are worth hundreds of millions of dollars, they won’t be like, oh, how did I miss that? And only give them a royalty based financing. But yeah, it was actually this really cool company. Um, oh, I always forget the name of it. It was out in San Francisco and they basically realized that. There were a lot of companies kind of in no man’s land where like they were, they had great unit economics and they were profitable businesses, but they weren’t big enough for private equity. But then the venture capitalists looked at them and said, you guys aren’t like a deck of corn or a unicorn. Like I need 50 X my money. So they’re kind of stuck in no man’s land. And they came up with this solution, which. Provided, provided funding to founders and also for the investors, which was nice. What’s nice about it is, you know, a lot of times with like early stage investing, you either get a donut like zero or like some return, but like seven to 10 years later, and with this structure, it actually allowed you to start getting returns earlier. So like a year in, they started getting 5% of our revenues. And it’s, it’s, it’s flexible too because like we wouldn’t, um, it’s not like a piece of debt where you have a guaranteed payment. It was based on as a percentage of your revenues, which is really nice too. Andrew Warner: Um, I’ll follow up with you to get the name of the company. The thing that I’ve been discovering in this whole bootstrap world is today there are other funding options, Jesse, for Bloat. I forget the name of the company. Oh, it’s called Settle. He used. Settle to get money based on sales that they were making. And there are all these different ways to have cash without selling equity, and I’ve been trying to accumulate them, but there’s not an easy way to put together a list of all the possibilities. Let me ask you this though. How big can an email newsletter get? I mean, it’s so competitive, it’s so mature, and you are not doing a topic like AI with the cutting edge latest thing that’s coming out tomorrow or, or what came out a minute ago. It’s, it’s more news-based. Why is there big potential in that? Tim Huelskamp: Yeah, so our whole thesis and when we started this, we actually got a lot of feedback from a bunch of advisors and say like, this is not gonna work. Because what they told us was like, that whole thing there are rees and the niches, right? So like basically what we heard was. You gotta go niche. That’s the way that media works. What are you guys doing? This doesn’t make any sense. We heard that over and over again. But, so the whole reason we started though, is I was in private equity for a decade before this. My co-founder’s, a PhD scientist, super brilliant guy out in DC and we’re like, yeah, we hear that. But like, at the same time, you know, he’s in the, in the political world, science political world. I’m in the, the finance world and. We’re intellectually curious people. We love learning. We wanna know everything across all the different verticals, sports, politics, culture, technology, all these different things, ai, but like it’s so hard for the reader to go to 20 different sources of 30 different sources. And you’re also trying to build your career as well. Most people are parents. They don’t have like time and like we felt like to be an intellectually curious person and like have that inch deep, mile wide view of a little bit of everything. Like no one was really providing that. And that was our whole thesis is basically that market, like where you get, you, you help everyone with, like, you know, as an example, doctors read our product, engineers read our product lawyers read our product. Doctors are going very deep on the science stuff elsewhere and they’re reading the New England Journal of Medicine and like, you know, our private equity readers are going on Dan Primack and Fortune Term sheet and all these things. But then they come to us for what’s going on in Hollywood and what’s going on in the science world and what’s Andrew Warner: Essentially this is what the New York Times used to be about, or the local paper. Um, it’s giving, I guess, maybe not the local paper, but the New York Times used to do this, and that’s what we used to turn to them for, gimme an understanding of everything that’s going on in technology and politics and business. And then if I’m really deep into business, I might read the Wall Street Journal too. And I, I think that’s what you’re saying. It’s Tim Huelskamp: Yeah, exactly. Yeah. I I. think it got like the, I think it got over nichey and then like a white space opened up to be like, someone can come in and fill that. Yeah, that, that inch deep mile wide provider for the intellectually curious people and like that’s who we’re filling. So like we have four and a half million readers now. We think it’s like over a hundred million people is our total addressable market. A third of them have a graduate degree. They’re 50 50, may male female, they’re a third. We, we also try to be really. Just state what happened and be like a fact focused source and not do like the opinions and the bias and the left right thing. We think more and more, uh, Americans are getting, are struggled with that. Struggling, excuse me, with that as well. So our audience is roughly a third Democrat, a third Republican, and a third independent. So you, you look back and you’re like, oh wow. We have like the college and grad school educated class of America that’s, that are busy professionals, that are intellectually curious and love learning. And no one’s really helping them. And like, that’s who we serve every day. And that’s, that’s who Drew and I are. And were, and we’re just basically, we’re serving ourselves. And then we, like, we launched to 78 friends and family. Like, you know, we weren’t sure if people were gonna like it or like had the, our thesis was right and everyone was telling us, this doesn’t make any sense, but we just leaned into the gut feeling like, no, I don’t, but, but all of our friends are saying the same thing, Andrew Warner: I wanna understand this. Let’s get into the story and then at the end let’s do a little bit of analysis of what, why this worked and what other people can take away from it. So before we even get into the 78, I’d like to go a step back for a moment here and talk about what was that company called when in Rome that you launched? This Is, this is the business that you had before that didn’t work out. What was when in Rome? Tim Huelskamp: Correct. Yeah. So I was in the private equity world for about a decade, and then I left. We actually got acquired by a larger private equity fund. Um, I was a principal. There was a pretty high up for my age and they basically said, you know, you could stick around but it’s probably not gonna end well for you. Like, or, here’s a pretty cool exit package if you want to go start something. I. Uh, I’d always been very entrepreneurial and like, you know, did angel investing and was kinda like puttering around with, with ideas on the side. And at the time I think I was 32, I’d been on a bunch of boards, had been like, you know, seen a lot of cool stuff in finance and building companies and investing in successful businesses and basically said like they’re literally like the universe is paying you to start a company if you don’t do it now. Like, screw you Tim. Andrew Warner: money did you get from the exit package? How much money did you get on the exit? Tim Huelskamp: it was like a year and a half of salary basically. Like of, of ru or, or sorry. It was, it was like a year and a half of runway is like what my calculation was. Andrew Warner: got it. Meaning with savings and what you’d gotten, you could Tim Huelskamp: just from the, just from the, the, the package, it was Andrew Warner: from the package. Tim Huelskamp: for my rent and like everything I was, I wasn’t married. I, I am now. I wasn’t married, I don’t have kids. I was spending money on rent and beer at the time. Right. And like, basically it’s like I basically have 18 months from this package to, to figure this out. Andrew Warner: Okay, so you say, I’m gonna go and figure this out. You come up with When In Rome? When in Rome is something that I’ve wished existed and so I don’t know why that didn’t work out. That seems like a more innovative product. Here’s the thing. I wanna go on vacation. I don’t wanna go and figure out where am I gonna go? What am I gonna do? Usually what I do is I leave it up to my wife to figure out which feels unfair, or I leave it up to an assistant to figure out, which also means that I’m not getting anything customized to me. And so you created a tool where I forget what the price was, it was like $29. I saw it on the internet archive. Who real human beings will create a, uh, a. A, a tour for me, a package. Andrew flies to this place, he does this experience. The whole thing is, is taken care of. That feels like a decent price. If I’m gonna spend $3,000 on a vacation, $29 makes a lot of sense. My one issue with that is where’s the continuous revenue in that? And maybe you were thinking I could book, I could get booking feeds, but I get the idea, why didn’t it work out? Tim Huelskamp: Yeah. So yeah, I wish I would’ve found you a couple years ago. You could’ve been one of our customers. Um, yeah, no, you said exactly. So basically the big thing, the reason why it didn’t work out and the big learning there for me personally was, so when I was in the private equity world, we did late stage venture. And what I didn’t realize at the time was most of these companies coming to us already had 50 million in revenue and they had figured out the unit economics of their businesses and then we were just giving them money to pour gas on the fire and like go grow faster. What I didn’t realize at the time was I always say startups are three things at their core. It’s the search for product market fit, right? Everyone focuses on that at the as you should ’cause of, as Mark Andreessen says, if you don’t get that, nothing else matters. And it’s so true, and I think a lot of founders. Don’t always fo uh, focus on the right things there, but that’s a different story. The second one, which is what we hit at when in Rome, is basically the search for repeatable, profitable, scalable growth, like they call it product channel fit as well. Can someone give you a dollar and can you turn that into $3? And generally speaking, if you have unit economics, your lifetime value over your cost per acquisition. Of three to one people will give you money. Venture capitalists will give you money to scale the business, which is the third part scale. So it’s product market fit. Do you have profitable unit economics? And if you have those two, you can scale the business into a big Andrew Warner: Mm-hmm. Tim Huelskamp: And what I learned very quickly was, well, one, it was awesome. It was a great learning experience. I learned how to build a company and like how to build a product and like work with developers and, and that whole thing. But then very quickly we learned, to your point, it was $29. We were splitting the, the, the commission with the local concierge. These were guys like, you know, guys and girls at like the r the Ritz in Seattle and like, they were wonderful. They knew their Andrew Warner: mean like literally a concierge at the Tim Huelskamp: Literally, literally the best, some of the best concierges in the world. Right, right. Like in Andrew Warner: So you’re splitting the money with them, Tim Huelskamp: Say it again. Andrew Warner: so you’re splitting the money with them. That’s a Tim Huelskamp: with them and then we’re taking, you know, we’re paying the stripe fees and all that. So I think we made $12 in revenue, like for a company. And then to your point. Maybe people go on vacation once a year, right? A lot of people would use the thing one time and then not come back. So we were like, our lifetime value was 12 bucks, maybe for a sales person or someone on the road all the time, but you know, more, a higher frequency. But the lifetime value is, call it $12 on average or maybe a little higher, 50 bucks. And the acquisition cost was couple hundred. So what I, what I learned so quickly was. You know, there were, you know, if you think about you, you said a $3,000 trip or a $5,000 trip, like so many people want that customer. So like if you type in, you know what things to do in Seattle? Hertz wants that customer. Marriott wants that customer, right? All these local businesses want, so they have, and they have much higher margins. The hotel guys are making a couple hundred dollars in margin and we’re making 12. So like the unit economics were upside down and like we would acquire customers on Google and Facebook. It’d be like 200 bucks. So the, the thing I learned there, it was a blessing in disguise. It was very painful, but, uh, the blessing there was we had to go down every marketing channel to see if it would scale, and none of them worked. So basically P-P-C-S-E-O, the, uh, referral. I was, I would go to like, um, door to hand to hand combat at hotels that, that didn’t have a concierge, like let’s be your white label. We literally did every, there’s like 25 ways to grow a company, essentially marketing. We tried every one of them. None of them worked. And Peter Thiel always talks about this, going back to my three things. So like we had product market fit, people were using it. We had a couple thousand dollars in revenue a month, or maybe it was a thousand, like people were using the product and really liking it. But then we ran into this buzz saw and the using unit economics where it’s like, we’re paying $200 to acquire a customer that’s, that’s worth $12 to us. And it’s like, that doesn’t work. And like, you know, I, after I went through it, I read more about it and I was like, yeah, you know, he’s right. Like a lot of these companies, if you look at ’em Mo, most companies have like one or two. Really strong growth channels and like, that’s really it, how they get very big. And most company, a lot of these startups, like they’ll get through the product market fit stage and they don’t find this, they don’t find the, the unit economics and they go into business, right? So that’s what happened is I basically, I, I walked into that buzz saw and was like, oh my gosh, this is, we, we can’t scale this thing. It’s not gonna make it. So we basically, at the time I was like, Hey, you know, I was a year into it or nine months into it. I’m like, this isn’t. You know, respectfully, it’s not worth my, my, not my, not worth my time. And I feel like the smart move was like, we’re like, we just, we shut it down. ’cause it wasn’t gonna make it Andrew Warner: Meanwhile in email newsletters, the economics are the opposite. Tim, I graduated from college. I still somewhere in here, have my business plan for an email newsletter company, which I did start. It grew bigger than even the business plan, so it’s one of those situations where the business plan had a hockey stick, but the hockey stick was even bigger. I. And what I loved about it was if you put, if you put it out on a spreadsheet, it makes so much sense. I assumed I would pay 10 cents per email subscriber. It turns out, it might have been closer to a buck or so, or maybe even more. I. But you still make money on that subscriber. Every day. You will have, like in 1440, you’ll have, uh, a weight loss sub, a weight loss ad, which I clicked over into. Or you’ll have a finance thing and you’re making money on those subscribers every day because you get to keep coming back to them. And the economics are fantastic. When I talked with, uh, Sam Par of the Hustle, I said, where’d you come up with the idea? He said, I was listening to Mixergy interviews. You had interviewed all these people in newsletter spaces over the years, and he said, I see the math here. All I have to do is copy this and bring it into the business world with my taste. Where did you get your idea, Tim? Tim Huelskamp: Yeah. Well it’s funny you say that. ’cause actually a lot of it was from Sam. Like I, I’d watched him and seen him on YouTube videos and was talking about the, the business model, and I was Andrew Warner: Meaning the hustle was already established at the time. Tim Huelskamp: So when we launched the Hustles around for maybe like a year and a half before then, uh, skim was around to, morning Brew had just started, I believe. I think we launched very similar time to Axios, so it was kinda like before Axios, so right around Axios. But yeah, we were looking at, at the Hustle and we’re like, wow. Like to your point, Andrew, I had just come from a business that had literally upside down unit economics and it was like, wow, these, these newsletters, if you can find white space and delight a user and like know what you’re doing and like. To your point, it’s all about retention and having them come back to you. There’s a big business in here, and so like, we got a lot of inspiration from, from Sam and the Morning Brew Guys and the Skim the Skim team. So what’s wild is it actually came from you. So, uh, there, there’s, there’s a theme there, like, you know, yeah, I mean that, there’s a theme there. If you’ve studied like all the founders through history, they all borrow ideas from each other. So I think like you saw the same thing, same thing here. But yeah, I looked at that and I was like, wow, like, you know, Sam’s business, I think he was making, uh, making back. I, I, I’m, I don’t remember the exact numbers. I think he was making back the, the, the return on investment like in three or four months, right? Like you saw how his, his business was working and then he was fueling it, uh, fueling the flywheel. So I saw that I had my own Drew and I, my co-founder had our own pain as like, again, intellectually curious, busy professionals. And then we looked at the white space and we’re like, the big opportunity is actually up here, right? So again, like we love the hustle. They’ve taught us so much, but. There’s something, I’m swaging this number, but there’s something like, I don’t know, six to 8 million, kind of like finance tech bro enthusiasts in America, right? Like there’s something like that. The skim does millennial female, so the 20 to 35 females, that’s 30 million or 20 million. So there’s all these little pockets if you think about like a white space, right? But then we kept on being like, who’s this? Who’s the one up here that covers everything and no one does that? And that’s why we launched it. So like we were very calculated like. We weren’t sure if it was gonna work, but we did go in being like the unit economics on these businesses are incredible. If you can build them and delight the customer and we’re not going nichey, we’re going like the opposite. When everyone’s going niche, we wanna go as big as possible. And like as most of the VCs teach you, like one of the biggest mistakes you, you want, one of the biggest benefits of like a big market is you can make a lot of mistakes there and still have like such a big market. So. Yeah, like we think there’s a hundred million people plus that’s our tam, total addressable market. And we think like we’re just kind of get it going. And we already have four and a half million of ’em. Andrew Warner: Okay. And so you said the first thing you did was you emailed 78 of your friends. And this was you seeing does the format work? I remember that Sean, who created, uh, the crypto newsletter, uh, the, uh, Tim Huelskamp: Milk Road. Yeah. Andrew Warner: the, the Milk Road, which I freaking loved. Um, he did something similar and I think he might have even sent it to them in a Google Doc to get feedback, but I don’t remember. What’s the way that you got feedback and what did they tell you? Tim Huelskamp: Yeah, so we just, we were using MailChimp at the time. I think it was, I think it’s free up to 10,000 Andrew Warner: Something like that. Yeah. Tim Huelskamp: Yeah. So it was free, and I give Drew a lot of credit here. So we had like a thesis for what the product should have looked like and Drew was so awesome. And he’s not from like the fi, the startup world. He’s a scientist, which is a different type of startup. I think they’re all about experimentation. And he was like, let’s just write it and ship it out tomorrow. And I was like, yes. Right? So he like got us going and we ba if you, I, I should pull it up, but if I can find it quickly. But if you look at the original email, it’s probably it design, it’s a little different, but 85% of the same thing that we have today. Right. So it’s a very similar, like we knew what we wanted at as frustrated consumers that weren’t, you know, were going for the, the inch deep, mile wide news and. It’s pretty, I mean, there’s been some iterations to it, but it’s pretty close when you look at like the actual job to be done and the product that we’re delivering in the newsletter. So yeah, and then like we just shipped it out to 78 friends and family. Literally it was like my groomsmen, my uncles, like our friends from high school. Um, and then we basically said like, Hey, we’re working on this pro. I think we said like a day before we said, we have this thesis for this project. We’re working on this email, I’m gonna send it to you tomorrow. Act like nothing, just, just check it out and lemme know what you think. ’cause we didn’t want like people to overthink Andrew Warner: Mm-hmm. Tim Huelskamp: they checked it out and they, so we got some feedback. Why is this, what? That doesn’t make any sense, right? We took it iterated on the next send. So we were doing that once a week. But even while we were doing it only once a week, we could see the, the, the product market fit, like early signs of product market fit, because we always said two things because there’s so much, um, benchmark data in this space. Like literally you can see everyone’s open rates and click rates and growth rates. So we said, Hey guys, if, if we don’t have a 40% open rate in a 5% weekly organic growth rate, so people like it and then forward it like, we shouldn’t spend time on this project. I just. You know, at the time I was like, I just got burned on another one that took a year of my life. Like, we’re not gonna do that here, like if it’s not there. But we had like a 60 something percent open rate, which we still have today. We’ve always had a a north of 60% open rate. And then our 78, by the time we sent out the next one, the next week had 91 subscribers. So we didn’t ask anything, but people were like, check this out, right? And we’re like, wow, that’s really good signal. I remember saying that to Drew. I’m like, there’s something cool in there, like keep going. And then the next week we had, I think it was 104 and then it was 122 or something like that. And then we just kept on taking all the feedback and iterating on it and just going, going, going. We spent the first two or three quarters just doing nothing but that. Andrew Warner: Do you remember some of the early feedback that you got? Tim Huelskamp: Yeah. So, okay. We actually still get, not, not crap for this, but our, our newsletter is all words. Okay? And most people look at it, a lot of experts look at it and they say, not gonna work. There’s no pictures. Where’s the pictures? This Andrew Warner: Especially, I mean, I think on the web version you have iStock photos. But like I’m looking at today’s email, draft day arrives. That seems like something that’s juicy and meant for a photo. YouTube turns 20, it feels like there’s some photo that you could include. Yeah. So keep going with that, Tim Huelskamp: No. Yeah, so agreed. Agreed. However. When you talk to the users and actually ask them what they’re looking for, if you break down what we do really well, we curate 50 links across the internet. What’s going on in the Middle East? The latest company IPO-ing the NFL drafts tonight. Fall foliage schedules, Michelin stars, the best Airbnbs in the world. Like there’s so much knowledge in our newsletter, but what, what we wanted and what our users want is basically they don’t want all this stuff to get in the way of the knowledge. They want to see these different, like they, they want a menu of information and quickly scan it and be like, I wanna learn about that. Don’t care. Don’t care. I wanna learn that. Right? So what we find is actually, like, I still see this all the time. And again, like if it’s a, if it’s a, um, an art newsletter, like of course you have to have, you have to have piece of pictures of art. But I actually open a lot of newsletters and it’s like, ugh. Like this picture is in the way. Like I’m just trying to read like, why is that my way? And that’s what our readers told us. It’s like we, so we had a bunch of pictures in there and they like. The pictures don’t help me put knowledge efficiently in my brain. Get rid of ’em. So we actually took pictures out. So a lot of people look at it and like, you guys are lazy and you’re not like adding photos. And it’s like, no. It’s like we actually had them in there. We did the work and actually understood what our customer wanted and then took them out accordingly. And like a lot of people, we, we still get, uh, if, if you respond to any email, they still, they still come to me. I read every email or receive. And a lot of people love us about that. We do get one every once in a while where like from younger people, like, how do you not have pictures in this thing? But most people like, I love how it’s like boom, boom, boom, boom, boom. You know? Knowledge, knowledge, knowledge, knowledge. I get to choose my own adventure. That’s what I’m looking for. Thank you so much for cleaning it up for me. Andrew Warner: You know what I, I had a different assumption in my head when I looked at it. I said they probably can’t get copyright clearance for it and for everything else, what they, and you could, at this point, you’re big enough to, I, I figured maybe it was an early day thing. Um. At what point did you start hiring people to edit the stories? I mean, it’s, you’re not, you’re not sending out reporters into the field, but you do need somebody to summarize it properly. And this was before ai you launched, what, 2017? If I remember. Tim Huelskamp: 2017. Yeah, yeah, yeah. Uh, so Drew and I basically started it, and then we hired a, uh, like a biz dev salesperson, probably a year in. Um, and then if you break down our business model, it’s three things. It’s write a wonderful newsletter every day, which as we said, I have a 65% open rate. Delight the reader know exactly what they want. We sell ads to the, to the, um, because we have this audience of, you know, a third of ’em have a graduate degree. They like to be healthy, wealthy and wise. They love learning about finance products better for you. Wellness products, they like, they have a lot of money to spend, so they like learning about new products. So we sell ads to our partners and then we take a majority of our revenue and we reinvest it back into growth. So we’ve been doing that over and over again for six years. When we started, we were adding 2000 subscribers. Now we’re adding 300,000 a month. Th So our from, from zero to one, those three things, that’s all we focused on. And basically, drew was writing the thing, I was doing our business section and helping out a little bit, but he was writing most of it. Um, we had a, a, a co-founder, uh, doing the, the, the business and the selling, and then I was doing the growth. And like the CEO stuff basically. So that was just that over and over again. And we did that until we got up to, when did, so Sony is now our editor in chief. She’s amazing. She’s from, uh, she was from Bloomberg previously. Brilliant news writer. Um, so we hired her four years ago, I want to say. So she was like one of our, Andrew Warner: That means Drew was writing it for four years. Tim Huelskamp: So Drew, drew was, so the first year and a half, maybe two years, no year and a half. Drew, talk about grit, like I, every offsite we have as a company, I mentioned this, drew had a full-time job and was waking up at four in the morning to finish our newsletter and ship it out before he went to his work at in, in dc. And like you talk about grit and believing in your vision and mission. Like homeboy, I should say homeboy, but he, he was doing that for a long Yeah. Right. He was, he believed in our vision and like most people would not have kept going. Right? Like, are you kidding me? Like getting up at four in the morning to ship a newsletter to 500 people? Like, who would do that? Andrew Warner: Why not hire somebody earlier? Writers are Tim Huelskamp: we, we, we had no, we had no money. We had no money. Who we were gonna hire with, Andrew Warner: How long did it take you to reach the first a hundred thousand in? In revenue, Tim Huelskamp: in revenue. Andrew Warner: roughly. Tim Huelskamp: on a a on a month. I mean, we, we didn’t, we didn’t monetize until we were like a year and a half in. Andrew Warner: so for Why Tim Huelskamp: were like, just what? Because we, we had, we had 500 subscribers for the first quarter, Andrew Warner: Whoa, wait. So you were in the below 10,000 for over a year. Tim Huelskamp: We got to, I, I, I gotta check the numbers, but it was the first quarter two, we were doing nothing but just. Iterating on the product and understanding what the user wanted. That was the first two quarters. Then it was, okay, we have something here. We have evidence of product market fit, huge retention rates. People like our product are forwarding it. Now how do we disprove going back to our three models? How do we disprove? How do we, excuse me, de-risk the can we grow the thing? So then I started dribbling capital in as our angel investor. With Facebook ads to prove that we could go from whatever it was, 2,500 subscribers to like 20,000 subscribers. So we did that work and basically we were getting to your point, subs for like a dollar or whatever it was back then. Now it’s like 2 53 bucks, but back then it was a dollar and it was like, okay, can we acquire them? Are we retaining them? Same thing. So we proved that out and then once we had the retention proved out and the growth proved out, then we tried to prove out monetization when, which is when we brought on our third co-founder to do that work. But you know, we just, we were trying to, drew one is a brilliant writer. He likes what he does, and yeah, we like also, like we didn’t want to give it to someone. We couldn’t afford Sony at the time. Um, so we didn’t wanna like, outsource it to some excuse my friend, shitty writer that was gonna ruin our product experience. So basically, drew kept on going. He, he still writes for us today. He doesn’t do the daily as much, but he’s writing all of our, our, a lot of our content. He loves that. So we just leaned into those three, three things and said like, focus on the product, prove we can grow it, prove we can monetize it, and then let that flywheel spin as much as possible. Andrew Warner: That’s so shocking that that’s where it was. Speaking of, uh, ads, you figured out ads yourself in the beginning. ’cause I know ads from talking to Jesse are huge for you. Tim Huelskamp: Uh, on the, like the acquisition side or Andrew Warner: Buy, oh, sorry. Uh, buying ads for acquisition, Tim Huelskamp: So we, we were doing it very early on by ourselves, and then we quickly realized we needed an agency to help us, and then that’s when we partnered with the agencies. Andrew Warner: Okay. All right. Um, I could have sworn that I saw, here it is. I saw that you’re adding now 300,000 new subscribers a month and retaining about 150,000. Is that a good number? I’m trying to get a sense of what, what the economics look like. Tim Huelskamp: Yeah. It’s, it’s actually a great number, um, that, that we’ve been trying to get that, you know, what’s your long-term retention rate on newsletter subscribers? Numbers from a lot of people. It’s not widely shared, but from what we’ve heard. It’s one of the top if, if not the top in the industry. So the way we see that is it, it’s actually really cool. You can see it in our retention curves. So about 20 15% of people, like either we don’t do double opt-in, so sometimes it’s bad emails. Sometimes you go, don’t get through. So about 15% of emails never open. And then from 85 to 50, you see, um, some, some loss over about a quarter. So people are feeling us out. Some people read it and they’re like, not for me, and they unsubscribe right away. Some people take some like two or three months, but you see the curves flattening and then they hit about 50% and then like, they’re pretty flat in perpetuity. So it, it’s something like even our cohorts from like 2018, something like 40% of them are still around. Um, so there’s a little degradation. Like you have spam issues, you have people like changing jobs, so like people fall off, but yeah, you get like the first quarter and then it levels out. So, um, yeah, that, that’s, that’s a wonderful number. And you know, the way that we think about that is on the revenue side with our partners. Now that we’re scaled, we make about a nickel every time someone opens our email. If you break down the CPM Andrew Warner: each person. Tim Huelskamp: Each person opens an email, we make a nickel, now we have to deli, we have to deliver for the customer, the, the, you know, the, the advertiser, and they’re looking for returns, whether that’s signing up for a credit card or a mortgage or a new, um, vitamin or whatever the, the, you know, the product Andrew Warner: Noom seems like a big one. Tim Huelskamp: Yeah, that was, that was in today’s, um, and um, but yeah, so like, basically they pay a nickel every time someone opens the email. Again, we have to deliver for them, but so you start doing that math and it’s like, okay, we send. 25 emails a month. We have a 65% daily open rate, so call it 15. The average person that opens 15 emails a month, we make a nickel every time they do it. So they call, call it 70 cents a month. A user. We’re acquiring user for like two or three bucks, depending on the channel, and then half of them go away. But so it’s like, you know, about five to six month payback period. And then after that it’s just all revenue that we can just reinvest back into growth, and you start stacking those on top of each other. And that’s where you go from again, like 2000 a month to now. We have 300,000 a month ’cause we’re spending over about a million bucks a month on growth from our flywheel model Andrew Warner: You know, Jason Kanis was trying to create a newsletter, you know, I forget what it was called, but he was trying to create, what, what is Tim Huelskamp: In inside.com. Andrew Warner: Right? And the thing that he was doing was, he was the opposite of you. You wanna go broad? He wanted to go niche as niche as possible, and then he would even have people vote on what the next newsletter was. It seems like one of the things that you had done was by going broad. You could reduce your costs per acquisition and then by mastering, by mastering ads, you could get really good at bringing people in consistently. I don’t know that he ever did advertising, especially well, but he definitely was not going into that, into that, uh, broad market. He wanted as niche as possible, Tim Huelskamp: Yeah. Yeah, I do. It was brilliant that their, their strategy and launching it. I thought it was so, so smart to your point. Like they had wait lists and then once they got over 10,000 or 25,000, they would start building those. Um, yeah, I’m not in their boardroom and I don’t wanna wanna speculate, but, uh, I have some ideas Andrew Warner: Yeah, I, you know what? One of my favorite parts of going to business classes in college was. The Harvard business case because it forced you, even though you couldn’t make the decision for the CEO, who you were like reading the case study on it forced you to think about it to then, you know, strengthen your thought muscles. What would you say as someone who’s in the space without any inside information, what do you think about this space, about the way that they’re doing it or the way that they did it? It looks like now it’s a coming soon page. Tim Huelskamp: Um. Andrew Warner: Analyze the business without, without having any deep insight. Tim Huelskamp: I think the strategy was brilliant, which doesn’t surprise me. He’s like one of the best angel investors of all time and like very forward thinking, dude. Um, I think the problem was the product quality. So if you look at it like, I think they hired writers and they paid them hourly. And I don’t think there’s love in the product. I think that was one of the, the big, the big challenges. We talk about this every day. Like people you mentioned at the beginning of the call, people have so many places to get news and information. That you have to like pour your heart and soul and put your love into the product. And like we do that every day at 1440. It’s one of the reasons we only have, we’re working on another product now that’s going like we’re swinging for the fences. But it’s one of the reasons we have, we’ve been very disciplined and focused and said, we are not doing 50 products. Because when you start doing that, you get mediocre mediocrity. Excuse me. So we just have the one product our whole team’s thinking about every day. Our whole team’s looking for awesome resources to add to it. For tomorrow’s newsletter, to delight our reader, and again, I’m not in their boardroom, but from what I saw from the outside, I think it was, you know, it was paying people like an hourly rate. I. And a lot of the, I think a lot of the writers that were doing it were kinda like part-time people. They didn’t really care very much about it. They were just kinda shipping the thing. And I think that’s why their open rates were relatively low. I could be wrong, but that’s my, that was my take from the outside. But I think the model was brilliant, to your point. It’s like, it it, yeah, exactly. It’s the opposite of us. It’s like there’s all these niches, so like go create these little niches, you add them up and then you get like a very scaled company. But I just don’t think there was enough. Um. I, I, I love in the product, I think, Andrew Warner: Okay, I get that. And they were pretty spread out. Just Jason’s a killer editor and a great writer Tim Huelskamp: yeah. I mean, if he was writing what it would’ve crushed, right. But like, I. think he did, did he hire the right people? That’s, that’s my question. Andrew Warner: That would’ve been interesting actually, if he would’ve just done a startup only newsletter where he had a lot of deep insights where he can write it or have somebody he knows write it daily and he can edit it. Um, alright, I’m with you on that. Let’s then shift to, um, just analysis of the business and why it worked. I have a couple of notes here. Number one is. Old ideas. I think Cody Sanchez is killing it online right now talking about how you can buy boring businesses. And there are few people like that, but a lot of them are talking about how do you buy a laundromat? And I think Cody Sanchez literally owns a laundromat somewhere here in Austin. I think, um, what you’re taking old business ideas that are online and have the ability to scale much bigger than, than in-person businesses. That seems like one of the big takeaways for me. I’m looking at your face, and I don’t know if that feels as exciting to you as one, as some of the other takeaways that you have. Tim Huelskamp: No, I think, yeah, I think that’s, that’s good. Yeah. Like we, you know, digital businesses can scale like near infinitely, and these tams are massive. Right. And I think that’s one of the reasons we like our, our business model. We don’t have to go. You know, pick up quarters and clean up the laundromats, Right. We just have to deliver a wonderful product in bits and ship it out to people every day. And yeah, there’s a lot of advantages to that model. Andrew Warner: But I don’t see a lot of versions of this that a, a lot of online businesses that will work forever and are as easy to launch. Like you just started with a MailChimp email. I wouldn’t be surprised if Sam also used MailChimp in the beginning and others did too. If I’m thinking about CRMs, that we might all need CRMs and maybe you need a personal CRM and A CRM for car dealerships and so on, but they’re definitely not that easy to create and they get more and more competitive and so it gets harder. I can’t think of another online company or type of company that has the same economics as newsletters that you can keep coming back to and have it be easy. Can you not easy, but still have it still make sense. Tim Huelskamp: It’s a great question. Um, I. I have to think about it, but I, I agree. And that’s when we studied this space before we got into it. That’s one of the reasons we really liked it. Right? So, like, we weren’t sure if the product was gonna work in the white space and the, you know, the, the anti niche positioning. But I looked at it like a VC with my old private equity VC hat on. I was like, man, if you can, if you can deliver, these things are beautiful businesses. So yeah, we, we knew that coming in, Andrew Warner: The only other thing I might take that’s similar is agencies I will be interviewing if I want to. I can interview agency owners for the rest of my life who are doing tens of millions in revenue. Um, but you know, the work that they do keeps changing. So I might five years from now interview someone who started in an AI agency. Back in 2025, and I’ll go, how did you do it? And we’ll, we’ll get the whole story. All right, so Tim Huelskamp: I think there though you, like, I think the, the downside there is you’re always singing for your supper, right? Like you’re always like is there’s a renewal, someone’s always coming for you. I think like the long term, the, the lifetime value outta those customers is pretty low. So with us it’s like, it’s, I mean, we have the same challenges, but it’s like if you deliver for your customer every day, like they look for you in the inbox and you create a habit with them. And then again, that’s why we have some of our readers from 2020, uh, 2018, that’s still 40% of ’em are still with us. Andrew Warner: Okay. The other one is the focus on one. What a dramatic focus. I really did assume that I hadn’t discovered some other 1440 newsletter, and as I was skimming around and talking to chat GPT, I couldn’t find another one. I think on your homepage, it looks like there are different topics and it gives me the impression that there are a lot, but it’s still, from what I’m hearing from you to this day, just one newsletter. Tim Huelskamp: So it was until about a couple months ago and now we have a new product we’re going after, but yeah, to. Answer kinda the spirit of your question. Yeah. Like we, we looked at other, like launching like, you know, Drew’s a scientist. We could launch a science newsletter tomorrow. Um, we could have done that four years ago, but yeah, we always did the math on it. It’s like, okay. Because our TAM is so big. Again, I know I keep doing that, but it’s like, it’s such a big tam. It’s like we have the advantage that a lot of like the hustle and those guys, like, they hit their, they got to 2 million, which is like what, 30% of that market, and then they kind of hit a ceiling and they didn’t grow anymore, so they had to go outward with us. We had the advantage of like, because we’re going into this massive tam, like we could just keep going. So we were like, you know, we’d look at, should we launch a sports newsletter, a science newsletter, and you start doing the math on it and you’re like, okay, so maybe you get to a couple hundred thousand subscribers. You have to add an editor, a seller, a marketer, you like, rebuild your company basically with, you know, 10% of the revenue. And it’s like, okay, so maybe that thing does a couple hundred thousand dollars in EBITDA on year three. It’s like, who cares? I, I, I hate to say that, but it’s like, why are we thinking about this? It doesn’t matter. Like, why don’t we take all that energy and focus it on something bigger? When I was in private equity, one of my favorite stories is we had a candy company called Neco. You know those Neco wafers that have like the, I love you hearts on them. Oh, sorry. Ne Neco. Ne Sweethearts, they’re called, they have like little, you know, the, the little like, I love you hearts. Like they taste like chalk. We own that company and we were interviewing new CEOs and we interviewed everyone from Hershey’s and uh, Mars and all these wonderful companies. And I remember we had something like, uh, 40 SKUs and most of the SKUs did under a million in revenue. And all the, and we are always fighting to try to get a little bit more, and the, I remember, uh, the, the eventual CEO who was very senior at Mars came and he’s like, what the f are you guys doing? He’s like, why do you have 40 skews? And he’s like, he’s like, you know how we think about this at Mars? Or, uh, I’m like, he’s, he’s like, so you have, you have Reese’s that does 600 million in revenue. I’m totally making up these numbers or something like that. And you have bit of honey that does 10 million of revenue. Which one do you want to grow? 20% next year? Get, get rid of bit of, and that’s why those brands, they sell off those, those little brands to private equity. ’cause like, we don’t wanna deal with that. Like why is that? It’s, it’s just taking away our focus. So I just think a lot of companies, I learned that in private equity firsthand, they just, they focus on too many things that aren’t that big. Like don’t have big upside. And it’s like, why not only does it like, it makes your organization more difficult, you have to hire all these people. Like, it just, I just don’t get it. It’s like, so our whole thing is like, do one thing. We’re, we’re, we’re now doing another thing I can get into in a second, but do one thing. Do it really well. Keep it simple. Less is more the power of saying no. Focus, focus, focus. And when you do that, like magic happens. I think, and I think a lot of companies, and we’ve seen this in our industry too, like in the newsletter industry, a lot of these companies like launched all these products. They didn’t work. They fire 50 people, then they lay off another a hundred people and it’s like, like I think they, like did they? I don’t know. That was gonna happen. Like, did you not see that? So we just basically said, we’re not gonna do that here. We like, we’re gonna focus on what we’re good at and have like discipline and say no. And then also like, you know, at the end of the day this is all about like, it’s a people game and it’s a talent game. And like, we haven’t lo, we’ve lost one employee in four years and it was a good, a good exit on both sides. But like, I want to be able to hire the best people in the world. And like pay them very well. And everyone has equity in our company and like want them to be happy and like doing awesome work. And if you’re laying people off all the time, like if you’re the best person in the world at growth, are you gonna want to come to a company that lays its employees off every, every year? Like no. Like you’re afraid of that. So we’ve never done a layoff. Layoffs are not in our vocabulary. We do like a million in revenue per employee. And like we wanna keep the thing lean and mean and control our own destiny. And I think that’s one of the beau beautiful things about bootstrapping is if you do it the right way. The key thing here that not a lot of people talk about is you control your own destiny. We have a board and they’re wonderful and they’re really helpful, but we can do whatever the hell we want. It’s such a powerful move. Like most companies, if they wanna do like a little bit of a thing or try something new, you gotta go to your board and they’re like, no, get outta here. That’s not what you raise money on with us. We can like do whatever we want. It’s such a cool advantage to have. Andrew Warner: What’s a cool thing that you think an an investor wouldn’t let you do? Tim Huelskamp: Say it again. Andrew Warner: What’s a cool thing that you think an investor wouldn’t let you do? Tim Huelskamp: No, I’m saying we don’t have that Andrew Warner: I know I’m, but do you, do you have an idea that’s so wacky that an investor wouldn’t let you do it? Tim Huelskamp: Yeah, so I mean, so not wacky, but like our, our product that we’re launching right now, our, our new one, which again, like our one, one of our, one of our principles is Swing for the Fences. So again, like we don’t wanna launch like a little newsletter that can do a million in revenue. We, if we’re gonna spend our time on something, let’s go big. So our new product that we’ve launched, it’s basically. So, okay. What we hear from our readers over and over again is they see things in the news every day. Like the gut microbiome, CRISPR inflation burning man, the city of Chicago, right? They wanna learn about these things and they have this huge pain. It’s not too dissimilar from the pain Drew and I had when we started this, which is they go into search engine, they look for what is Burning man, and they get this SEO clickbait junk layer of the internet that doesn’t teach them anything. So they might go to a, a social network looking for a video. There’s good stuff on there. There’s also crazy Russian propaganda on there. You don’t know what to believe. It’s like, and a doctor with three kids just wants to know what the hell Burning Man is Like, literally, that’s all. Like I just, I hear about it all the time. I wanna spend a few minutes learning about it. Why is this so hard? So we hear that over and over again from our readers. And then on the flip side, because we’re, I would argue with our open rate, the best curator in the world, we’re constantly seeing all these wonderful resources. So for instance, like if you wanna learn about crispr, MIT has this 12 minute 1 0 1 video. That’s the single best place that you can learn about crispr, but no one can find it. It’s on the 80th page of Google and it’s buried deep on the internet. So what we’re trying to build is this, like, originally we called it Pinterest for knowledge. And that’s not totally fair. But now we kind of say it’s like if Reddit, Wikipedia, and Pinterest had a baby for knowledge. Um, and what we’re trying to do is basically all these terrific resources that are buried so deep on the internet. We’re trying to bring those into one place and just connect the intellectually curious person with all the best resources in the world so that they can efficiently learn about these topics. And then what we do so well is we not only curate it, but we explain it to you. So like, here’s a couple hundred word summary on. What Burning Man is and what the 10 core principles are and what black, the, the, the city looks like. And some awesome videos of like, walking through the, the playa and all these things, right? There’s, there’s all this wonderful content, but like, people bang their heads against their wall, the wall, trying to find them. So we’re trying to bring it together and create, like, the best place in the world when you wanna learn about a topic is on our website. So that’s what we’re doing. But like, you know. If we, so if we nail that, which we, we will, it’s gonna take time. It’s like that’s that’s a big company. It’s like a Reddit or a Pinterest or Wikipedia. So like we want to be saying like, if we’re gonna do another product, it shouldn’t be a 500,000 revenue product. If you’re gonna take a swing, if you’re a focused company, if you’re taking a swing, it better be a big swing. So we’ve been patient and studying this for a long time, and that’s what we’re going after, but we’re using it with our own profits. And we’re investing it with our own money and like that’s the huge thing. So like Yeah. If we Andrew Warner: that this would be an issue for an investor because what you’re really doing is. Tim Huelskamp: they’d be like, bro, what are you doing? Get back to operating the business. You’re being Andrew Warner: human curated search engine where the responses are all cur. That explains why when I go to Creator Economy on your site, I see a background on it. History, social impacts, future of it. I see, uh, references that you used, and then on the right, a newsletter, I assume that was for SEO purposes, so that people read the best thing that you can create on it, and then it links or then there’s a box to get them to sign up to the newsletter. That’s not what it’s about. It’s Tim Huelskamp: No. Andrew Warner: not your SEO play. Tim Huelskamp: we’re building this ecosystem. It’s called topics. We might change the name shortly, but yeah, this Reddit meets Wikipedia of our job to be done that we wanna serve is anytime you wanna learn about a topic, it’s the best place in the world to do that. We know that AI’s coming, we know that everyone asks that question to get out ahead of it. Like, but one of the things that we’ve learned is, and you know, I use perplexity every day, it’s, it’s amazing. It’s replaced Google for me. And we all use Chachi between all these different sources. But even then, like if you wanna learn about venture capital, right? You type in. What is venture capital? It gives you an answer and then you do that and, and, and we feel like it, it lacks the, like the human serendipity of like, Hey, here’s venture capital. Here’s some of the key themes. Here’s how carried interest works. Here’s what the Midas list is. Here’s Mark Andreessen, here’s all these like big, here’s the. Arguably it was invented in the whaling industry, venture capital or Queen Isabella in 14, in the 14th century from Spain, right? All these awesome resources that like, if you don’t know what to ask. A, a q and a search engine, you’re not gonna come across them. So we’re trying to actually be like proactive, which is what we’re really good at as a company, and being like, okay, someone went down this knowledge, uh, the, the rabbit hole, they learned about venture capital or Burning Man for 30 hours and they came back and they’re like, this is what I learned. Here’s some of the key insights and here’s the 30 to 50 best resources, podcasts, data visualizations, articles where if you want to go down the rabbit hole as well, they’re all right there for you and they’re all world class and they’re all ch FactCheck by a human. So you do not waste any time in your knowledge journey at 1440 where on all the other sites you’re just like, why am I sifting through Andrew Warner: This is a risky, bold bet. I mean, you really are going the opposite of where everything else is going, where everything else is going towards AI content. You are going towards human content where it might be about the community coming in and pitching in and adding information, like the Reddit example or Pinterest example, you’re saying, no, we’re gonna have a real editor come in and do this. Tim Huelskamp: Correct. Yeah, so we we’re using the, the human editors. Are using AI tools to be more efficient at their job. But yeah, at the end of the day it’s, it’s human curated. And we think there’s like a lot of beauty in that, right? Like, ’cause there’s human serendipity. Like when you go down the rabbit hole, it’s like, wait, why does this thing keep coming up? And what is this? And connecting the dots, like the human mind’s amazing. And AI is coming for everything, but we think there’s like a real beauty in like yeah, leaning into the humans. And that’s what we’re, yeah, that’s what we’re working on next. Andrew Warner: All right. I’ll close it out with something I probably should have opened up with. The reason the company’s called 1440 is. Tim Huelskamp: It is the year the printing press was invented when knowledge was exploded to the masses. So we’re a knowledge company and we’re trying to lean into that. It’s also the number of minutes in a day. So that’s our whole thing is like knowledge and time, knowledge efficiently. That’s where our name comes from. Andrew Warner: All right. Right on. Thanks so much, Tim. Tim Huelskamp: Yeah. Thanks so much for the opportunity. Appreciate Andrew so Andrew Warner: Hell yeah. Hope to see you in person. Bye. Tim Huelskamp: Thank you.",
  "image": "https://mixergy.com/interviews/1440-20mil-year-newsletter/?get-twitter-card=true\u0026v=14\u0026time=1745920919",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Hey there, freedom Fighters.\u003c/p\u003e\n\u003cp\u003eMy name is Andrew Warner. I’m the founder of Mixer G, where I interview entrepreneurs about how they built their businesses. Joining me is an entrepreneur who is building an email newsletter company. And to be honest with you, when my partner in bootstrap Giants, Jesse told me about 1440, and he kept getting excited about having had them as a client.\u003c/p\u003e\n\u003cp\u003eI said, first of all, the name makes no sense to me. And second, why are you so excited about a newsletter company? This thing has existed forever in newsletters, it feels like, since the beginning of the internet. And what he kept saying to me was, this is different. It’s. It’s bigger than you realize. It’s the, it’s an example of what a bootstrap giant’s.\u003c/p\u003e\n\u003cp\u003eCompany can be built sustainably, built in a way that’s growing, built with, with heart and clarity, and not this idea of let’s raise a lot of money and try to figure something out and have a small chance at something that would work. And so I’ve looked into 1440 and it’s such an interesting business.\u003c/p\u003e\n\u003cp\u003eIt’s a fast growing, fact focused newsletter that curates the day’s most important news and the revenue is really exciting, but mostly the story behind how it’s. How it’s been built, I think is inspiring for what’s possible. And so I invited the founder, Tim Samp, to come on here and talk about how he’s doing it.\u003c/p\u003e\n\u003cp\u003eAnd Tim, since my, I’m known for asking people their revenue. I’ll start off by asking you, what is the revenue at 1440?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. First of all, thank you so much for the opportunity Austin to be here with you. Uh, we have, we do over a million in revenue per employee, and we have 22 employees.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Wow.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: We don’t, how about this? We don’t do 2 million revenue per employee. It’s between one and 2 million and we have 22 employees.\u003c/p\u003e\n\u003cp\u003eSo I can let your, the readers do the math.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: it’s huge and it’s profitable. From what I understand.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yep. Very\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Several million dollars is what I think I’d read in, uh, Adweek.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yep. Very. Yep. Very, very much\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: No outside funding.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: So we did take a little bit of like revenue based financing and kinda like debt, like features early on. Um, actually if you’re a, a fan of Shark Tank, you know how Mr. Wonderful is always like those royalty deals he talks about. We basically took like an equivalent of that early on and what it did, it allowed us to. It was, I’ll just give the five. It was $500,000 and basically at the time, I think we had something like 10, 20,000 subscribers, but we could figure out our unit economics. We could see ’em already working, right? Like we had retention, we had open rates. You could see it all working and we’re like, all right, thi this, this business is working.\u003c/p\u003e\n\u003cp\u003eLet’s pour some fuel on the fire. So yeah, we raised this $500,000 round and the way it was structured was we got $500,000 and we paid back. Starting a year later. So it allowed it to like, you know, the flywheel to spin a little bit. We paid back 5% of our revenues until the investor got three x return on their capital and then they, and then they got like a slight little equity kicker as well in case like for schmuck insurance, like if we are worth hundreds of millions of dollars, they won’t be like, oh, how did I miss that?\u003c/p\u003e\n\u003cp\u003eAnd only give them a royalty based financing. But yeah, it was actually this really cool company. Um, oh, I always forget the name of it. It was out in San Francisco and they basically realized that. There were a lot of companies kind of in no man’s land where like they were, they had great unit economics and they were profitable businesses, but they weren’t big enough for private equity. But then the venture capitalists looked at them and said, you guys aren’t like a deck of corn or a unicorn. Like I need 50 X my money. So they’re kind of stuck in no man’s land. And they came up with this solution, which. Provided, provided funding to founders and also for the investors, which was nice.\u003c/p\u003e\n\u003cp\u003eWhat’s nice about it is, you know, a lot of times with like early stage investing, you either get a donut like zero or like some return, but like seven to 10 years later, and with this structure, it actually allowed you to start getting returns earlier. So like a year in, they started getting 5% of our revenues.\u003c/p\u003e\n\u003cp\u003eAnd it’s, it’s, it’s flexible too because like we wouldn’t, um, it’s not like a piece of debt where you have a guaranteed payment. It was based on as a percentage of your revenues, which is really nice too.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Um, I’ll follow up with you to get the name of the company. The thing that I’ve been discovering in this whole bootstrap world is today there are other funding options, Jesse, for Bloat. I forget the name of the company. Oh, it’s called Settle. He used. Settle to get money based on sales that they were making.\u003c/p\u003e\n\u003cp\u003eAnd there are all these different ways to have cash without selling equity, and I’ve been trying to accumulate them, but there’s not an easy way to put together a list of all the possibilities. Let me ask you this though. How big can an email newsletter get? I mean, it’s so competitive, it’s so mature, and you are not doing a topic like AI with the cutting edge latest thing that’s coming out tomorrow or, or what came out a minute ago.\u003c/p\u003e\n\u003cp\u003eIt’s, it’s more news-based. Why is there big potential in that?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah, so our whole thesis and when we started this, we actually got a lot of feedback from a bunch of advisors and say like, this is not gonna work. Because what they told us was like, that whole thing there are rees and the niches, right? So like basically what we heard was. You gotta go niche. That’s the way that media works.\u003c/p\u003e\n\u003cp\u003eWhat are you guys doing? This doesn’t make any sense. We heard that over and over again. But, so the whole reason we started though, is I was in private equity for a decade before this. My co-founder’s, a PhD scientist, super brilliant guy out in DC and we’re like, yeah, we hear that. But like, at the same time, you know, he’s in the, in the political world, science political world.\u003c/p\u003e\n\u003cp\u003eI’m in the, the finance world and. We’re intellectually curious people. We love learning. We wanna know everything across all the different verticals, sports, politics, culture, technology, all these different things, ai, but like it’s so hard for the reader to go to 20 different sources of 30 different sources.\u003c/p\u003e\n\u003cp\u003eAnd you’re also trying to build your career as well. Most people are parents. They don’t have like time and like we felt like to be an intellectually curious person and like have that inch deep, mile wide view of a little bit of everything. Like no one was really providing that. And that was our whole thesis is basically that market, like where you get, you, you help everyone with, like, you know, as an example, doctors read our product, engineers read our product lawyers read our product. Doctors are going very deep on the science stuff elsewhere and they’re reading the New England Journal of Medicine and like, you know, our private equity readers are going on Dan Primack and Fortune Term sheet and all these things. But then they come to us for what’s going on in Hollywood and what’s going on in the science world and what’s\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Essentially this is what the New York Times used to be about, or the local paper. Um, it’s giving, I guess, maybe not the local paper, but the New York Times used to do this, and that’s what we used to turn to them for, gimme an understanding of everything that’s going on in technology and politics and business.\u003c/p\u003e\n\u003cp\u003eAnd then if I’m really deep into business, I might read the Wall Street Journal too. And I, I think that’s what you’re saying. It’s\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah, exactly. Yeah. I I.\u003c/p\u003e\n\u003cp\u003ethink it got like the, I think it got over nichey and then like a white space opened up to be like, someone can come in and fill that. Yeah, that, that inch deep mile wide provider for the intellectually curious people and like that’s who we’re filling. So like we have four and a half million readers now.\u003c/p\u003e\n\u003cp\u003eWe think it’s like over a hundred million people is our total addressable market. A third of them have a graduate degree. They’re 50 50, may male female, they’re a third. We, we also try to be really. Just state what happened and be like a fact focused source and not do like the opinions and the bias and the left right thing.\u003c/p\u003e\n\u003cp\u003eWe think more and more, uh, Americans are getting, are struggled with that. Struggling, excuse me, with that as well. So our audience is roughly a third Democrat, a third Republican, and a third independent. So you, you look back and you’re like, oh wow. We have like the college and grad school educated class of America that’s, that are busy professionals, that are intellectually curious and love learning. And no one’s really helping them. And like, that’s who we serve every day. And that’s, that’s who Drew and I are. And were, and we’re just basically, we’re serving ourselves. And then we, like, we launched to 78 friends and family. Like, you know, we weren’t sure if people were gonna like it or like had the, our thesis was right and everyone was telling us, this doesn’t make any sense, but we just leaned into the gut feeling like, no, I don’t, but,\u003c/p\u003e\n\u003cp\u003ebut all of our friends are saying the same thing,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: I wanna understand this.\u003c/p\u003e\n\u003cp\u003eLet’s get into the story and then at the end let’s do a little bit of analysis of what, why this worked and what other people can take away from it. So before we even get into the 78, I’d like to go a step back for a moment here and talk about what was that company called when in Rome that you launched?\u003c/p\u003e\n\u003cp\u003eThis Is, this is the business that you had before that didn’t work out. What was when in Rome?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Correct. Yeah. So I was in the private equity world for about a decade, and then I left. We actually got acquired by a larger private equity fund. Um, I was a principal. There was a pretty high up for my age and they basically said, you know, you could stick around but it’s probably not gonna end well for you.\u003c/p\u003e\n\u003cp\u003eLike, or, here’s a pretty cool exit package if you want to go start something. I. Uh, I’d always been very entrepreneurial and like, you know, did angel investing and was kinda like puttering around with, with ideas on the side. And at the time I think I was 32, I’d been on a bunch of boards, had been like, you know, seen a lot of cool stuff in finance and building companies and investing in successful businesses and basically said like they’re literally like the universe is paying you to start a company if you don’t do it now.\u003c/p\u003e\n\u003cp\u003eLike, screw you\u003c/p\u003e\n\u003cp\u003eTim.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: money did you get from the exit package?\u003c/p\u003e\n\u003cp\u003eHow much money did you get on the exit?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: it was like a year and a half of salary basically. Like of, of ru or, or sorry. It was, it was like a year and a half of runway is like what my calculation was.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: got it. Meaning with savings and what you’d gotten, you could\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: just from the, just from the, the, the package, it was\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: from the package.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: for my rent and like everything I was, I wasn’t married.\u003c/p\u003e\n\u003cp\u003eI, I am now. I wasn’t married, I don’t have kids. I was spending money on rent and beer at the time. Right. And like, basically\u003c/p\u003e\n\u003cp\u003eit’s like I basically have 18 months from this package to, to figure this out.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay, so you say, I’m gonna go and figure this out. You come up with When In Rome? When in Rome is something that I’ve wished existed and so I don’t know why that didn’t work out. That seems like a more innovative product. Here’s the thing. I wanna go on vacation. I don’t wanna go and figure out where am I gonna go?\u003c/p\u003e\n\u003cp\u003eWhat am I gonna do? Usually what I do is I leave it up to my wife to figure out which feels unfair, or I leave it up to an assistant to figure out, which also means that I’m not getting anything customized to me. And so you created a tool where I forget what the price was, it was like $29. I saw it on the internet archive.\u003c/p\u003e\n\u003cp\u003eWho real human beings will create a, uh, a. A, a tour for me, a package. Andrew flies to this place, he does this experience. The whole thing is, is taken care of. That feels like a decent price. If I’m gonna spend $3,000 on a vacation, $29 makes a lot of sense. My one issue with that is where’s the continuous revenue in that?\u003c/p\u003e\n\u003cp\u003eAnd maybe you were thinking I could book, I could get booking feeds, but I get the idea, why didn’t it work out?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. So yeah, I wish I would’ve found you a couple years ago. You could’ve been one of our customers. Um, yeah, no, you said exactly. So basically the big thing, the reason why it didn’t work out and the big learning there for me personally was, so when I was in the private equity world, we did late stage venture. And what I didn’t realize at the time was most of these companies coming to us already had 50 million in revenue and they had figured out the unit economics of their businesses and then we were just giving them money to pour gas on the fire and like go grow\u003c/p\u003e\n\u003cp\u003efaster. What I didn’t realize at the time was I always say startups are three things at their core. It’s the search for product market fit, right? Everyone focuses on that at the as you should ’cause of, as Mark Andreessen says, if you don’t get that, nothing else matters. And it’s so true, and I think a lot of founders. Don’t always fo uh, focus on the right things there, but that’s a different story. The second one, which is what we hit at when in Rome, is basically the search for repeatable, profitable, scalable growth, like they call it product channel fit as well.\u003c/p\u003e\n\u003cp\u003eCan someone give you a dollar and can you turn that into $3? And generally speaking, if you have unit economics, your lifetime value over your cost per acquisition. Of three to one people will give you money. Venture capitalists will give you money to scale the business, which is the third part scale. So it’s product market fit.\u003c/p\u003e\n\u003cp\u003eDo you have profitable unit economics? And if you have those two, you can scale the business into a big\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Mm-hmm.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: And what I learned very quickly was, well, one, it was awesome. It was a great learning experience. I learned how to build a company and like how to build a product and like work with developers and, and that whole thing. But then very quickly we learned, to your point, it was $29. We were splitting the, the, the commission with the local concierge. These were guys like, you know, guys and girls at like the r the Ritz in Seattle and like, they were wonderful. They knew\u003c/p\u003e\n\u003cp\u003etheir\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: mean like literally a concierge at the\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Literally, literally the best, some of the best concierges in the world.\u003c/p\u003e\n\u003cp\u003eRight,\u003c/p\u003e\n\u003cp\u003eright. Like in\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: So you’re splitting the money with them,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Say it again.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: so you’re splitting the money with them. That’s a\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: with them and then we’re taking, you know, we’re paying the stripe fees and all that. So I think we made $12 in revenue, like for a company. And then to your point. Maybe people go on vacation once a year, right? A lot of people would use the thing one time and then not come back. So we were like, our lifetime value was 12 bucks, maybe for a sales person or someone on the road all the time, but you know, more, a higher frequency. But the lifetime value is, call it $12 on average or maybe a\u003c/p\u003e\n\u003cp\u003elittle higher, 50 bucks. And the acquisition cost was couple hundred. So what I, what I learned so quickly was. You know, there were, you know, if you think about you, you said a $3,000 trip or a $5,000 trip, like so many people want that customer. So like if you type in, you know\u003c/p\u003e\n\u003cp\u003ewhat things to do in Seattle? Hertz wants that\u003c/p\u003e\n\u003cp\u003ecustomer. Marriott wants that customer, right? All these local businesses want, so they have, and they have much higher margins.\u003c/p\u003e\n\u003cp\u003eThe hotel guys are making a couple hundred dollars in margin and we’re making 12. So like the unit economics were upside down and like we would acquire customers on Google and Facebook. It’d be like 200 bucks. So the, the thing I learned there, it was a blessing in disguise. It was very painful, but, uh, the blessing there was we had to go down every marketing channel to see if it would scale, and none of them worked. So basically P-P-C-S-E-O, the, uh, referral. I was, I would go to like, um, door to hand to hand combat at hotels that, that didn’t have a concierge, like let’s be your white label. We literally did every, there’s like 25 ways to grow a company,\u003c/p\u003e\n\u003cp\u003eessentially marketing. We tried every one of them. None of them worked.\u003c/p\u003e\n\u003cp\u003eAnd Peter Thiel always talks about this, going back to my three things.\u003c/p\u003e\n\u003cp\u003eSo like we had product market fit, people were using it. We had a couple thousand dollars in revenue a month, or maybe it was a thousand, like people were using the product and really liking it. But then we ran into this buzz saw and the using unit economics where it’s like, we’re paying $200 to acquire a customer that’s, that’s worth $12 to us.\u003c/p\u003e\n\u003cp\u003eAnd it’s like, that doesn’t work. And like, you know, I, after I went through it, I read more about it and I was like, yeah, you know, he’s right. Like a lot of these companies, if you look at ’em Mo, most companies have like one or two. Really strong growth channels and like, that’s really it, how they get very big.\u003c/p\u003e\n\u003cp\u003eAnd most company, a lot of these startups, like they’ll get through the product market fit stage and they don’t find this, they don’t find the, the unit economics and they go into business, right? So that’s what happened is I basically, I, I walked into that buzz saw and was like, oh my gosh, this is, we, we can’t scale this thing.\u003c/p\u003e\n\u003cp\u003eIt’s not gonna make it. So we basically, at the time I was like, Hey, you know, I was a year into it or nine months into it. I’m like, this isn’t. You know, respectfully, it’s not worth my, my, not my, not worth my\u003c/p\u003e\n\u003cp\u003etime. And I feel like the smart move was like, we’re like, we just, we shut it down. ’cause it wasn’t gonna make it\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Meanwhile in email newsletters, the economics are the opposite. Tim, I graduated from college. I still somewhere in here, have my business plan for an email newsletter company, which I did start. It grew bigger than even the business plan, so it’s one of those situations where the business plan had a hockey stick, but the hockey stick was even bigger.\u003c/p\u003e\n\u003cp\u003eI. And what I loved about it was if you put, if you put it out on a spreadsheet, it makes so much sense. I assumed I would pay 10 cents per email subscriber. It turns out, it might have been closer to a buck or so, or maybe even more. I.\u003c/p\u003e\n\u003cp\u003eBut you still make money on that subscriber. Every day. You will have, like in 1440, you’ll have, uh, a weight loss sub, a weight loss ad, which I clicked over into.\u003c/p\u003e\n\u003cp\u003eOr you’ll have a finance thing and you’re making money on those subscribers every day because you get to keep coming back to them. And the economics are fantastic. When I talked with, uh, Sam Par of the Hustle, I said, where’d you come up with the idea? He said, I was listening to Mixergy interviews. You had interviewed all these people in newsletter spaces over the years, and he said, I see the math here.\u003c/p\u003e\n\u003cp\u003eAll I have to do is copy this and bring it into the business world with my taste. Where did you get your idea, Tim?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. Well it’s funny you say that. ’cause actually a lot of it was from Sam. Like I, I’d watched him and seen him on YouTube videos and was talking about the, the business model, and I was\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Meaning the hustle was already established at the time.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: So when we launched the Hustles around for maybe like a year and a half before then, uh, skim was around to, morning Brew had just started, I believe. I think we launched very similar time to Axios, so it was kinda like before Axios, so right around Axios. But yeah, we were looking at, at the Hustle and we’re like, wow. Like to your point, Andrew, I had just come from a business that had literally upside down unit economics and it was like, wow, these, these newsletters, if you can find white space and delight a user and like know what you’re doing and like. To your point, it’s all about retention and having them come back to you. There’s a big business in here, and so like, we got a lot of inspiration from, from Sam and the Morning Brew Guys and the Skim the Skim team. So what’s wild is it actually came from you. So, uh, there, there’s,\u003c/p\u003e\n\u003cp\u003ethere’s a theme there, like, you know, yeah, I mean that, there’s a theme there.\u003c/p\u003e\n\u003cp\u003eIf you’ve studied like all the founders through history, they all borrow ideas from\u003c/p\u003e\n\u003cp\u003eeach other. So I think like you saw the same thing, same thing here. But yeah, I looked at that and I was like, wow, like, you know, Sam’s business, I think he was making, uh, making back. I, I, I’m, I don’t remember the exact numbers.\u003c/p\u003e\n\u003cp\u003eI think he was making back the, the, the return on investment like in three or four months, right? Like you saw how\u003c/p\u003e\n\u003cp\u003ehis, his business was working and then he was fueling it, uh, fueling the flywheel. So I saw that I had my own Drew and I, my co-founder had our own pain as like, again, intellectually curious, busy professionals.\u003c/p\u003e\n\u003cp\u003eAnd then we looked at the white space and we’re like, the big opportunity is actually up here, right? So again, like we love the hustle. They’ve taught us so much, but. There’s something, I’m swaging this number, but there’s something like, I don’t know, six to 8 million, kind of like finance tech bro enthusiasts\u003c/p\u003e\n\u003cp\u003ein America, right?\u003c/p\u003e\n\u003cp\u003eLike there’s something like that. The skim does millennial female, so the 20 to 35 females, that’s 30 million or 20 million. So there’s all these little pockets if you think about like a white space, right? But then we kept on being like, who’s this? Who’s the one up here that covers everything and no one does that? And that’s why we launched it. So like we were very calculated like. We weren’t sure if it was gonna work, but we did go in being like the unit economics on these businesses are incredible. If you can build them and delight the customer and we’re not going nichey, we’re going like the opposite. When everyone’s going niche, we wanna go as big as possible.\u003c/p\u003e\n\u003cp\u003eAnd like as most of the VCs teach you, like one of the biggest mistakes you, you want, one of the biggest benefits of like a big market is you can make a lot of mistakes there and still have like such a big market. So. Yeah, like we think there’s a hundred million people plus that’s our tam, total addressable market.\u003c/p\u003e\n\u003cp\u003eAnd we think like we’re just kind of get it going. And we already have four and a half million of ’em.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay. And so you said the first thing you did was you emailed 78 of your friends. And this was you seeing does the format work? I remember that Sean, who created, uh, the crypto newsletter, uh, the, uh,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Milk Road. Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: the, the Milk Road, which I freaking loved. Um, he did something similar and I think he might have even sent it to them in a Google Doc to get feedback, but I don’t remember.\u003c/p\u003e\n\u003cp\u003eWhat’s the way that you got feedback and what did they tell you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah, so we just, we were using MailChimp at the time. I think it was, I think it’s free up to 10,000\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Something like that. Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. So it was free, and I give Drew a lot of credit here. So we had like a thesis for what the product should have looked like and Drew was so awesome. And he’s not from like the fi, the startup world.\u003c/p\u003e\n\u003cp\u003eHe’s a scientist, which is a different type of startup. I think they’re all about experimentation. And he was like, let’s just write it and ship it out tomorrow. And I was like, yes. Right? So he like got us going and we ba if you, I, I should pull it up, but if I can find it quickly. But if you look at the original email, it’s probably it design, it’s a little different, but 85% of the same thing that we have today.\u003c/p\u003e\n\u003cp\u003eRight. So it’s a very similar, like we knew what we wanted at as frustrated consumers that weren’t, you know, were going for the, the inch deep, mile wide news and. It’s pretty, I mean, there’s been some iterations to it, but it’s pretty close when you look at like the actual job to be done and the product that we’re delivering in the newsletter. So yeah, and then like we just shipped it out to 78 friends and family. Literally it was like my groomsmen, my uncles, like our friends from high school. Um, and then we basically said like, Hey, we’re working on this pro. I think we said like a day before we said, we have this thesis for this project. We’re working on this email, I’m gonna send it to you tomorrow.\u003c/p\u003e\n\u003cp\u003eAct like nothing, just, just check it out and lemme know what you think. ’cause we didn’t want like people to overthink\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Mm-hmm.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: they checked it out and they, so we got some feedback. Why is this, what? That doesn’t make any sense, right? We took it iterated on the next send. So we were doing that once a week. But even while we were doing it only once a week, we could see the, the, the product market fit, like early signs of product market fit, because we always said two things because there’s so much, um, benchmark data in this space. Like literally you can see everyone’s open rates and click rates and growth rates.\u003c/p\u003e\n\u003cp\u003eSo we said, Hey guys, if, if we don’t have a 40% open rate in a 5% weekly organic growth rate, so people like it and then forward it like, we shouldn’t spend time on this project. I just. You know, at the time I was like, I just got burned on another one that took a year of my life. Like, we’re not gonna do that here, like if it’s not there. But we had like a 60 something percent open rate, which we still have today. We’ve always had\u003c/p\u003e\n\u003cp\u003ea a north of 60% open rate. And then our 78, by the time we sent out the next one, the next week had 91 subscribers. So we didn’t ask anything, but people were like, check this out, right? And we’re like, wow, that’s really good signal.\u003c/p\u003e\n\u003cp\u003eI remember saying that to Drew. I’m like, there’s something cool in there, like keep going. And then the next week we had, I think it was 104 and then it was 122 or something like that. And then we just kept on taking all the feedback and iterating on it and just going, going, going. We spent the first two or three quarters just doing nothing but that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Do you remember some of the early feedback that you got?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. So, okay. We actually still get, not, not crap for this, but our, our newsletter is all words. Okay? And most people look at it, a lot of experts look at it and they say, not gonna work. There’s no pictures. Where’s the pictures? This\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Especially, I mean, I think on the web version you have iStock photos. But like I’m looking at today’s email, draft day arrives. That seems like something that’s juicy and meant for a photo. YouTube turns 20, it feels like there’s some photo that you could include. Yeah. So keep going with that,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: No. Yeah, so agreed. Agreed. However. When you talk to the users and actually ask them what they’re looking for, if you break down what we do really well, we curate 50 links across the internet. What’s going on in the Middle East? The latest company IPO-ing the NFL drafts tonight. Fall foliage schedules, Michelin stars, the best Airbnbs in the world.\u003c/p\u003e\n\u003cp\u003eLike there’s so much knowledge in our newsletter, but what, what we wanted and what our users want is basically they don’t want all this stuff to get in the way of the knowledge. They want to see these different, like they, they want a menu of information and quickly scan it and be like, I wanna learn about that.\u003c/p\u003e\n\u003cp\u003eDon’t care. Don’t care. I wanna learn that. Right? So what we find is actually, like, I still see this all the time. And again, like if it’s a, if it’s a, um, an art newsletter, like of course you have to have, you have to have piece of pictures of art. But I actually open a lot of newsletters and it’s like, ugh.\u003c/p\u003e\n\u003cp\u003eLike this picture is in the way. Like I’m just trying to read like, why is that my way? And that’s what our readers told us. It’s like we, so we had a bunch of pictures in there and they like. The pictures don’t help me put knowledge efficiently in my brain. Get rid of ’em. So we actually took pictures out.\u003c/p\u003e\n\u003cp\u003eSo a lot of people look at it and like, you guys are lazy and you’re not like adding photos. And it’s like, no. It’s like we actually had them in there. We did the work and actually understood what our customer wanted and then took them out accordingly. And like a lot of people, we, we still get, uh, if, if you respond to any email, they still, they still come to me.\u003c/p\u003e\n\u003cp\u003eI read every email or receive. And a lot of people love us about that. We do get one every once in a while where like from younger people, like, how do you not have pictures in this thing? But most people like, I love how it’s like boom, boom, boom, boom, boom. You know? Knowledge, knowledge, knowledge, knowledge.\u003c/p\u003e\n\u003cp\u003eI get to choose my own adventure. That’s what I’m looking for. Thank you so much for cleaning it up for me.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You know what I, I had a different assumption in my head when I looked at it. I said they probably can’t get copyright clearance for it and for everything else, what they, and you could, at this point, you’re big enough to, I, I figured maybe it was an early day thing. Um. At what point did you start hiring people to edit the stories?\u003c/p\u003e\n\u003cp\u003eI mean, it’s, you’re not, you’re not sending out reporters into the field, but you do need somebody to summarize it properly. And this was before ai you launched, what, 2017? If I remember.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: 2017. Yeah, yeah, yeah. Uh, so Drew and I basically started it, and then we hired a, uh, like a biz dev salesperson, probably a year in. Um, and then if you break down our business model, it’s three things. It’s write a wonderful newsletter every day, which as we said, I have a 65% open rate. Delight the reader know exactly what they want. We sell ads to the, to the, um, because we have this audience of, you know, a third of ’em have a graduate degree. They like to be healthy, wealthy and wise. They love learning about finance products better for you. Wellness products, they like, they have a lot of money to spend, so they like learning about new products.\u003c/p\u003e\n\u003cp\u003eSo we sell ads to our partners and then we take a majority of our revenue and we reinvest it back into growth. So we’ve been doing that over and over again for six years. When we started, we were adding 2000 subscribers. Now we’re adding 300,000 a month. Th So our from, from zero to one, those three things, that’s all we focused on. And basically, drew was writing the thing, I was doing our business section and helping out a little bit, but he was writing most of it. Um, we had a, a, a co-founder, uh, doing the, the, the business and the selling, and then I was doing the growth. And like the CEO stuff basically. So that\u003c/p\u003e\n\u003cp\u003ewas just that over and over again. And we did that until we got up to, when did, so Sony is now our editor in chief. She’s amazing. She’s from, uh, she was from Bloomberg previously. Brilliant news writer. Um, so we hired her four years ago, I want to say. So she was like one of our,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That means Drew was writing it for four years.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: So Drew, drew was, so the first year and a half, maybe two years, no year and a half. Drew, talk about grit, like I, every offsite we have as a company, I mentioned this, drew had a full-time job and was waking up at four in the morning to finish our newsletter and ship it out before he went to his work at in, in dc. And like you talk about grit and believing in your vision and mission.\u003c/p\u003e\n\u003cp\u003eLike homeboy, I should say homeboy, but he, he was doing\u003c/p\u003e\n\u003cp\u003ethat for a long Yeah. Right. He was, he believed in our vision and like most people would not have kept going. Right? Like, are you kidding me? Like getting up at four in the morning to ship a newsletter to 500 people? Like, who would do that?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Why not hire somebody earlier? Writers are\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: we, we, we had no, we had no money. We had no money. Who we were gonna hire with,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: How long did it take you to reach the first a hundred thousand in? In revenue,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: in revenue.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: roughly.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: on a a on a month. I mean, we, we didn’t, we didn’t monetize until we were like a year and a half in.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: so for Why\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: were like, just what?\u003c/p\u003e\n\u003cp\u003eBecause we, we had, we had 500 subscribers for the first quarter,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Whoa, wait.\u003c/p\u003e\n\u003cp\u003eSo you were in the below 10,000 for over a year.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: We got to, I, I, I gotta check the numbers, but it was the first quarter two, we were doing nothing but just. Iterating on the product and understanding what the user wanted. That was the first two quarters. Then it was, okay, we have something here. We have evidence of product market fit, huge retention rates.\u003c/p\u003e\n\u003cp\u003ePeople like our product are forwarding it. Now how do we disprove going back to our three models? How do we disprove? How do we, excuse me, de-risk the can we grow the thing? So then I started dribbling capital in as our angel investor. With Facebook ads to prove that we could go from whatever it was, 2,500 subscribers to like 20,000 subscribers. So we did that work and basically we were getting to your point, subs for like a dollar or whatever it was back then. Now it’s like 2 53 bucks, but back then it was a dollar and it was like, okay, can we acquire them? Are we retaining them? Same thing. So we proved that out and then once we had the retention proved out and the growth proved out, then we tried to prove out monetization when, which is when we brought on our third co-founder to do that work. But you know, we just, we were trying to, drew one is a brilliant writer. He likes what he does, and yeah, we like also, like we didn’t want to give it to someone. We couldn’t afford Sony at the time. Um, so we didn’t wanna like, outsource it to some excuse my friend, shitty writer that was gonna ruin our product experience.\u003c/p\u003e\n\u003cp\u003eSo basically, drew kept on going. He, he still writes for us today. He doesn’t do the daily as much, but he’s writing all of our, our, a lot of our content. He loves that. So we just leaned into those\u003c/p\u003e\n\u003cp\u003ethree, three things and said like, focus on the product, prove we can grow it, prove we can monetize it, and then let that flywheel spin as much as possible.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That’s so shocking that that’s where it was. Speaking of, uh, ads, you figured out ads yourself in the beginning. ’cause I know ads from talking to Jesse are huge for you.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Uh, on the, like the acquisition side or\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Buy, oh, sorry. Uh, buying ads for acquisition,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: So\u003c/p\u003e\n\u003cp\u003ewe, we were doing it very early on by ourselves, and then we quickly realized we needed an agency to help us, and then that’s when we partnered with the agencies.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay. All right. Um, I could have sworn that I saw, here it is. I saw that you’re adding now 300,000 new subscribers a month and retaining about 150,000. Is that a good number? I’m trying to get a sense of what, what the economics look like.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. It’s, it’s actually a great number, um, that, that we’ve been trying to get that, you know, what’s your long-term retention rate on newsletter subscribers? Numbers from a lot of people. It’s not widely shared, but from what we’ve heard. It’s one of the top if, if not the top in the industry. So the way we see that is it, it’s actually really cool.\u003c/p\u003e\n\u003cp\u003eYou can see it in our retention curves. So about 20 15% of people, like either we don’t do double opt-in, so sometimes it’s bad emails. Sometimes you go, don’t get through. So about 15% of emails never open. And then from 85 to 50, you see, um, some, some loss over about a quarter. So people are feeling us out.\u003c/p\u003e\n\u003cp\u003eSome people read it and they’re like, not for me, and they\u003c/p\u003e\n\u003cp\u003eunsubscribe right away. Some people take some like two or three months, but you see the curves flattening and then they hit about 50% and then like, they’re pretty flat in perpetuity. So it, it’s something like even our cohorts from like 2018, something like 40% of them are still around. Um, so there’s a little degradation. Like you have spam issues, you have people like changing jobs, so like people fall off, but yeah, you get like the first quarter and then it levels out. So, um, yeah, that, that’s, that’s a wonderful number. And you know, the way that we think about that is on the revenue side with our partners.\u003c/p\u003e\n\u003cp\u003eNow that we’re scaled, we make about a nickel every time someone opens our email. If you break down the\u003c/p\u003e\n\u003cp\u003eCPM\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: each person.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Each person opens an email, we make a nickel,\u003c/p\u003e\n\u003cp\u003enow we have to deli, we have to deliver for the customer, the, the, you know, the, the advertiser, and they’re looking for returns, whether that’s signing up for a credit card or a mortgage or a new, um, vitamin or whatever the, the, you know, the product\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Noom seems like a big one.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah, that was, that was in today’s, um, and um, but yeah, so like, basically they pay a nickel every time someone opens the email. Again, we have to deliver for them, but so you start doing that math and it’s like, okay, we send. 25 emails a month. We have a 65% daily open rate, so call it 15. The average person that opens 15 emails a month, we make a nickel every time they do it.\u003c/p\u003e\n\u003cp\u003eSo they call, call it 70 cents a month. A user. We’re acquiring user for like two or three bucks, depending on the channel, and then half of them go away. But so it’s like, you know, about five to six month payback period. And then after that it’s just all revenue that we can just reinvest back into growth, and you start stacking those on top of each other. And that’s where you go from again, like 2000 a month to now. We have 300,000 a month ’cause we’re spending over about a million bucks a month on growth from our flywheel model\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You know, Jason Kanis was trying to create a newsletter, you know, I forget what it was called, but he was trying to create, what, what is\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: In inside.com.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Right? And the thing that he was doing was, he was the opposite of you. You wanna go broad? He wanted to go niche as niche as possible, and then he would even have people vote on what the next newsletter was.\u003c/p\u003e\n\u003cp\u003eIt seems like one of the things that you had done was by going broad. You could reduce your costs per acquisition and then by mastering, by mastering ads, you could get really good at bringing people in consistently. I don’t know that he ever did advertising, especially well, but he definitely was not going into that, into that, uh, broad market.\u003c/p\u003e\n\u003cp\u003eHe wanted as niche as possible,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. Yeah, I do. It was brilliant that their, their strategy and launching it. I thought it was so, so smart to your point. Like they had wait lists and then once they got over 10,000 or 25,000, they would start building those. Um, yeah, I’m not in their boardroom and I don’t wanna wanna speculate, but, uh, I have some ideas\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Yeah, I, you know what? One of my favorite parts of going to business classes in college was. The Harvard business case because it forced you, even though you couldn’t make the decision for the CEO, who you were like reading the case study on it forced you to think about it to then, you know, strengthen your thought muscles.\u003c/p\u003e\n\u003cp\u003eWhat would you say as someone who’s in the space without any inside information, what do you think about this space, about the way that they’re doing it or the way that they did it? It looks like now it’s a coming soon page.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Um.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Analyze the business without, without having any deep insight.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: I think the strategy was brilliant, which doesn’t surprise me. He’s like one of the best angel investors of all time and like very forward thinking, dude. Um, I think the problem was the product quality. So if you look at it like, I think they hired writers and they paid them hourly. And I don’t think there’s love in the product.\u003c/p\u003e\n\u003cp\u003eI think that was one of the, the big, the big challenges. We talk about this every day. Like people you mentioned at the beginning of the call, people have so many places to get news and information. That you have to like pour your heart and soul and put your love into the product. And like we do that every day at 1440.\u003c/p\u003e\n\u003cp\u003eIt’s one of the reasons we only have, we’re working on another product now that’s going like we’re swinging for the fences. But it’s one of the reasons we have, we’ve been very disciplined and focused and said, we are not doing 50 products. Because when you start doing that, you get mediocre mediocrity.\u003c/p\u003e\n\u003cp\u003eExcuse me. So we just have the one product our whole team’s thinking about every day. Our whole team’s looking for awesome resources to add to it. For tomorrow’s newsletter, to delight our reader, and again, I’m not in their boardroom, but from what I saw from the outside, I think it was, you know, it was paying people like an hourly rate.\u003c/p\u003e\n\u003cp\u003eI. And a lot of the, I think a lot of the writers that were doing it were kinda like part-time people. They didn’t really care\u003c/p\u003e\n\u003cp\u003every much about it. They were just kinda shipping the thing. And I think that’s why their open rates were relatively low. I could be wrong, but that’s my, that was my take from the outside.\u003c/p\u003e\n\u003cp\u003eBut I think the model was brilliant, to your point. It’s like, it it, yeah, exactly. It’s the opposite of us. It’s like there’s all these niches, so like go create these little niches, you add them up and then you get like a very scaled company. But I just don’t think there was enough. Um. I, I, I love in the product, I think,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay, I get that. And they were pretty spread out. Just Jason’s a killer editor and a great writer\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: yeah. I mean, if he was writing what it would’ve crushed, right. But like,\u003c/p\u003e\n\u003cp\u003eI.\u003c/p\u003e\n\u003cp\u003ethink he did, did he hire the right people? That’s, that’s my question.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That would’ve been interesting actually, if he would’ve just done a startup only newsletter where he had a lot of deep insights where he can write it or have somebody he knows write it daily and he can edit it. Um, alright, I’m with you on that. Let’s then shift to, um, just analysis of the business and why it worked.\u003c/p\u003e\n\u003cp\u003eI have a couple of notes here. Number one is. Old ideas. I think Cody Sanchez is killing it online right now talking about how you can buy boring businesses. And there are few people like that, but a lot of them are talking about how do you buy a laundromat? And I think Cody Sanchez literally owns a laundromat somewhere here in Austin.\u003c/p\u003e\n\u003cp\u003eI think, um, what you’re taking old business ideas that are online and have the ability to scale much bigger than, than in-person businesses. That seems like one of the big takeaways for me. I’m looking at your face, and I don’t know if that feels as exciting to you as one, as some of the other takeaways that you have.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: No, I think, yeah, I think that’s, that’s good. Yeah. Like we, you know, digital businesses can scale like near infinitely, and these tams are massive. Right. And I think that’s one of the reasons we like our, our business model. We don’t have to go. You know, pick up quarters and clean up the laundromats,\u003c/p\u003e\n\u003cp\u003eRight.\u003c/p\u003e\n\u003cp\u003eWe just have to deliver a wonderful product in bits and ship it out to people every day. And yeah, there’s a lot of advantages to that model.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: But I don’t see a lot of versions of this that a, a lot of online businesses that will work forever and are as easy to launch. Like you just started with a MailChimp email. I wouldn’t be surprised if Sam also used MailChimp in the beginning and others did too. If I’m thinking about CRMs, that we might all need CRMs and maybe you need a personal CRM and A CRM for car dealerships and so on, but they’re definitely not that easy to create and they get more and more competitive and so it gets harder.\u003c/p\u003e\n\u003cp\u003eI can’t think of another online company or type of company that has the same economics as newsletters that you can keep coming back to and have it be easy. Can you not easy, but still have it still make sense.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: It’s a great question. Um, I. I have to think about it, but I, I agree. And that’s when we studied this space before we got into it. That’s one of the reasons we really liked it. Right? So,\u003c/p\u003e\n\u003cp\u003elike, we weren’t sure if the product was gonna work in the white space and the, you know, the, the anti niche positioning. But I looked at it like a VC with my old private equity VC\u003c/p\u003e\n\u003cp\u003ehat on. I was like, man, if you can, if you can deliver, these things are beautiful businesses. So yeah, we, we knew that coming in,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: The only other thing I might take that’s similar is agencies I will be interviewing if I want to. I can interview agency owners for the rest of my life who are doing tens of millions in revenue. Um, but you know, the work that they do keeps changing. So I might five years from now interview someone who started in an AI agency.\u003c/p\u003e\n\u003cp\u003eBack in 2025, and I’ll go, how did you do it? And we’ll, we’ll get the whole story. All right, so\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: I think there though you, like, I think the, the downside there is you’re always singing for your supper, right? Like you’re always like is there’s a renewal, someone’s always coming for you. I think like the long term, the, the lifetime value outta those customers is pretty low. So with us it’s like, it’s, I mean, we have the same challenges, but it’s like if you deliver for your customer every day, like they look for you in the inbox and you create a habit with them.\u003c/p\u003e\n\u003cp\u003eAnd then again, that’s why we have some of our readers from 2020, uh, 2018, that’s still 40% of ’em are still with us.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay. The other one is the focus on one. What a dramatic focus. I really did assume that I hadn’t discovered some other 1440 newsletter, and as I was skimming around and talking to chat GPT, I couldn’t find another one. I think on your homepage, it looks like there are different topics and it gives me the impression that there are a lot, but it’s still, from what I’m hearing from you to this day, just one newsletter.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: So it was until about a couple months ago and now we have a new product we’re going after, but yeah, to. Answer kinda the spirit of your question. Yeah. Like we, we looked at other, like launching like, you know, Drew’s a scientist. We could launch a science newsletter tomorrow. Um, we could have done that four years ago, but yeah, we always did the math on it.\u003c/p\u003e\n\u003cp\u003eIt’s like, okay. Because our TAM is so big. Again, I know I keep doing that, but it’s\u003c/p\u003e\n\u003cp\u003elike, it’s such a big tam. It’s like we have the advantage that a lot of like the hustle and those guys, like, they hit their, they got to 2 million, which is like what, 30% of that market, and then they kind of hit a ceiling and they didn’t grow anymore, so they had to go outward with us.\u003c/p\u003e\n\u003cp\u003eWe had the advantage of like, because we’re going into this massive tam, like we could just keep going. So we were like, you know, we’d look at, should we launch a sports newsletter, a science newsletter, and you start doing the math on it and you’re like, okay, so maybe you get to a couple hundred thousand subscribers. You have to add an editor, a seller, a marketer, you like, rebuild your company basically with, you know, 10% of the revenue. And it’s like, okay, so maybe that thing does a couple hundred thousand dollars in EBITDA on year three. It’s like, who cares? I, I, I hate\u003c/p\u003e\n\u003cp\u003eto say that, but it’s like, why are we thinking about this?\u003c/p\u003e\n\u003cp\u003eIt doesn’t matter. Like, why don’t we take all that energy and focus it on something bigger? When I was in private equity, one of my favorite stories is we had a candy company called Neco. You know those Neco wafers that have like the, I love you hearts on them.\u003c/p\u003e\n\u003cp\u003eOh, sorry. Ne Neco. Ne Sweethearts, they’re called,\u003c/p\u003e\n\u003cp\u003ethey have like little, you know, the, the little like, I love you hearts.\u003c/p\u003e\n\u003cp\u003eLike they taste like chalk. We own that company and we were interviewing new CEOs and we interviewed everyone\u003c/p\u003e\n\u003cp\u003efrom Hershey’s and uh, Mars and all these wonderful companies. And I remember we had something like, uh, 40 SKUs and most of the SKUs did under a million in revenue. And all the, and we are always fighting to try to get a little bit more, and the, I remember, uh, the, the eventual CEO who was very senior at Mars came and he’s like, what the f are you guys doing?\u003c/p\u003e\n\u003cp\u003eHe’s like, why do you have 40 skews? And he’s like, he’s like, you know how we think about this at Mars? Or, uh, I’m like, he’s, he’s like, so you have, you have Reese’s that does 600 million in revenue. I’m totally making up these numbers or something\u003c/p\u003e\n\u003cp\u003elike that. And you have bit of honey that does 10 million of revenue.\u003c/p\u003e\n\u003cp\u003eWhich one do you want to grow? 20% next year? Get, get rid of bit of, and that’s why those brands, they sell off those, those little brands to private equity. ’cause like, we don’t wanna deal with that. Like why is that? It’s, it’s just taking away our focus. So I just think a lot of companies, I learned that in private equity firsthand, they just, they focus on too many things that aren’t that big.\u003c/p\u003e\n\u003cp\u003eLike don’t have big upside. And it’s like, why not only does it like, it makes your organization more difficult, you have to hire all these people. Like, it just, I just don’t get it. It’s like, so our whole thing is like, do one thing. We’re, we’re, we’re now doing another thing I can get into in a second, but do one thing.\u003c/p\u003e\n\u003cp\u003eDo it really well. Keep it simple. Less is more the power of saying no. Focus, focus, focus. And when you do that, like magic happens. I think, and I think a lot of companies, and we’ve seen this in our industry too, like in the newsletter industry, a lot of these companies like launched all these products.\u003c/p\u003e\n\u003cp\u003eThey didn’t work. They fire 50 people, then they lay off another a hundred people and it’s like, like I think they, like did they? I don’t know. That was gonna happen. Like, did you not see that? So we just basically said, we’re not gonna do that here. We like, we’re gonna focus on what we’re good at and have like discipline and say no.\u003c/p\u003e\n\u003cp\u003eAnd then also like, you know, at the end of the day this is all about like, it’s a people game and it’s a talent game. And like, we haven’t lo, we’ve lost one employee in four years and it was a good, a good exit on both sides. But like, I want to be able to hire the best people in the world. And like pay them very well.\u003c/p\u003e\n\u003cp\u003eAnd everyone has equity in our company and like want them to be happy and like doing awesome work. And if you’re laying people off all the time, like if you’re the best person in the world at growth, are you gonna want to come to a company that lays its employees off every, every year? Like no. Like you’re afraid of that.\u003c/p\u003e\n\u003cp\u003eSo we’ve never done a layoff. Layoffs are not in our vocabulary. We do like a million in revenue per employee. And like we wanna keep the thing lean and mean and control our own destiny. And I think that’s one of the beau beautiful things about bootstrapping is if you do it the right way. The key thing here that not a lot of people talk about is you control your own destiny. We have a board and they’re wonderful and they’re really helpful, but we can do whatever the hell we want. It’s such a powerful move. Like most companies, if they wanna do like a little bit of a thing or try something new, you gotta go to your board and they’re like, no, get outta here. That’s not what you raise money on with us.\u003c/p\u003e\n\u003cp\u003eWe can like do whatever we want. It’s such a cool advantage to have.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: What’s a cool thing that you think an an investor wouldn’t let you do?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Say it again.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: What’s a cool thing that you think an investor wouldn’t let you do?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: No, I’m saying we don’t have that\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: I know I’m, but do you, do you have an idea that’s so wacky that an investor wouldn’t let you do it?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah, so I mean, so not wacky, but like our, our product that we’re launching right now, our, our new one,\u003c/p\u003e\n\u003cp\u003ewhich again, like our one, one of our, one of our principles is Swing for the Fences. So again, like we don’t wanna launch like a little newsletter that can do a million in revenue. We, if we’re gonna spend our time on something, let’s go big. So our new product that we’ve launched, it’s basically. So, okay. What we hear from our readers over and over again is they see things in the news every day. Like the gut microbiome, CRISPR inflation burning man, the city of Chicago, right? They wanna learn about these things and they have this huge pain.\u003c/p\u003e\n\u003cp\u003eIt’s not too dissimilar from the pain Drew and I had when we started this, which is they go into search engine, they look for what is Burning man, and they get this SEO clickbait junk layer of the internet that doesn’t teach them anything. So they might go to a, a social network looking for a video. There’s good stuff on there. There’s also crazy Russian propaganda on there. You don’t know what to believe. It’s like, and a doctor with three kids just wants to know what the hell Burning Man is Like, literally, that’s all. Like I just, I hear about it all the time. I wanna spend a few minutes learning about it.\u003c/p\u003e\n\u003cp\u003eWhy is this so hard? So we hear that over and over again from our readers. And then on the flip side, because we’re, I would argue with our open rate, the best curator in the world, we’re constantly seeing all these wonderful resources. So for instance, like if you wanna learn about crispr, MIT has this 12 minute 1 0 1 video.\u003c/p\u003e\n\u003cp\u003eThat’s the single best place that you can learn about crispr, but no one can find it. It’s on the 80th page of Google and it’s buried deep on the internet. So what we’re trying to build is this, like, originally we called it Pinterest for knowledge. And that’s not totally fair. But now we kind of say it’s like if Reddit, Wikipedia, and Pinterest had a baby for knowledge. Um, and what we’re trying to do is basically all these terrific resources that are buried so deep on the internet. We’re trying to bring those into one place and just connect the intellectually curious person with all the best resources in the world so that they can efficiently learn about these topics.\u003c/p\u003e\n\u003cp\u003eAnd then what we do so well is we not only curate it, but we explain it to you. So like, here’s a couple hundred word summary on. What Burning Man is and what the 10 core principles are and what black, the, the, the city looks like. And some awesome videos of like, walking through the, the playa and all these things, right?\u003c/p\u003e\n\u003cp\u003eThere’s, there’s all this wonderful content, but like, people bang their heads against their wall, the wall, trying to find them. So we’re trying to bring it together and create, like, the best place in the world when you wanna learn about a topic is on our website. So that’s what we’re doing. But like, you know. If we, so if we nail that, which we, we will, it’s gonna take time. It’s like that’s that’s a big company. It’s like a Reddit or a Pinterest or Wikipedia. So like we want to be saying like, if we’re gonna do another product, it shouldn’t be a 500,000 revenue product. If you’re gonna take a swing, if you’re a focused company, if you’re taking a swing, it better be a big swing.\u003c/p\u003e\n\u003cp\u003eSo we’ve been patient and studying this for a long time, and that’s what we’re going after, but we’re using it with our own profits. And we’re investing it with our own money and like that’s the huge thing. So\u003c/p\u003e\n\u003cp\u003elike Yeah. If we\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: that this would be an issue for an investor because what you’re really doing is.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: they’d be like, bro, what are you doing?\u003c/p\u003e\n\u003cp\u003eGet back to operating the business.\u003c/p\u003e\n\u003cp\u003eYou’re being\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: human curated search engine where the responses are all cur. That explains why when I go to Creator Economy on your site, I see a background on it. History, social impacts, future of it. I see, uh, references that you used, and then on the right, a newsletter, I assume that was for SEO purposes, so that people read the best thing that you can create on it, and then it links or then there’s a box to get them to sign up to the newsletter.\u003c/p\u003e\n\u003cp\u003eThat’s not what it’s about. It’s\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: No.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: not your SEO play.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: we’re building this ecosystem. It’s called topics.\u003c/p\u003e\n\u003cp\u003eWe might change the name shortly, but yeah, this Reddit meets Wikipedia of our job to be done that we wanna serve is anytime you wanna learn about a topic, it’s the best place in the world to do that. We know that AI’s coming, we know that everyone asks that question to get out ahead of it.\u003c/p\u003e\n\u003cp\u003eLike, but one of the things that we’ve learned is, and you know, I use perplexity every day, it’s, it’s amazing. It’s replaced Google for me. And we all use Chachi between all these different sources. But even then, like if you wanna learn about venture capital, right? You type in. What is venture capital? It gives you an answer and then you do that and, and, and we feel like it, it lacks the, like the human serendipity of like, Hey, here’s venture capital.\u003c/p\u003e\n\u003cp\u003eHere’s some of the key themes. Here’s how carried interest works. Here’s what the Midas list is. Here’s Mark Andreessen, here’s all these like big, here’s the. Arguably it was invented in the whaling industry, venture capital or Queen Isabella in 14, in the 14th century from Spain, right? All these awesome resources that like, if you don’t know what to ask. A, a q and a search engine, you’re not gonna come across them. So we’re trying to actually be like proactive, which is what we’re really good at as a company, and being like, okay, someone went down this knowledge, uh, the, the rabbit hole, they learned about venture capital or Burning Man for 30 hours and they came back and they’re like, this is what I learned. Here’s some of the key insights and here’s the 30 to 50 best resources, podcasts, data visualizations, articles where if you want to go down the rabbit hole as well, they’re all right there for you and they’re all world class and they’re all ch FactCheck by a human. So you do not waste any time in your knowledge journey at 1440 where on all the other sites you’re just like, why am I sifting through\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: This is a risky, bold bet. I mean, you really are going the opposite of where everything else is going, where everything else is going towards AI content. You are going towards human content where it might be about the community coming in and pitching in and adding information, like the Reddit example or Pinterest example, you’re saying, no, we’re gonna have a real editor come in and do this.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Correct. Yeah, so we we’re using the, the human editors. Are using AI tools to be more efficient at their job. But yeah, at the end of the day it’s, it’s\u003c/p\u003e\n\u003cp\u003ehuman curated. And we think there’s like a lot of beauty in that, right? Like, ’cause there’s human serendipity. Like when you go down the rabbit hole, it’s like, wait,\u003c/p\u003e\n\u003cp\u003ewhy does this thing keep coming up?\u003c/p\u003e\n\u003cp\u003eAnd what is this? And connecting the dots, like the human mind’s amazing. And AI is coming for everything, but we think there’s like a real beauty in like yeah, leaning into the humans. And that’s what we’re, yeah, that’s what we’re working on next.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: All right. I’ll close it out with something I probably should have opened up with. The reason the company’s called 1440 is.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: It is the year the printing press was invented when knowledge was exploded to the masses. So we’re a\u003c/p\u003e\n\u003cp\u003eknowledge company and we’re trying to lean into that. It’s also the number of minutes in a day. So that’s our whole thing is like knowledge and time, knowledge efficiently. That’s where our name comes from.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: All right. Right on. Thanks so much, Tim.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Yeah. Thanks so much for the opportunity. Appreciate Andrew so\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Hell yeah. Hope to see you in person. Bye.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eTim Huelskamp\u003c/span\u003e\u003c/span\u003e: Thank you.\u003c/p\u003e\n\t\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "62 min read",
  "publishedTime": null,
  "modifiedTime": "2025-04-29T17:01:59Z"
}
