{
  "id": "08ee8d6a-f3a6-48dc-a62d-f3cb6fa1d127",
  "title": "Sweetgreen director Julie Bornstein sells shares worth $178,560",
  "link": "https://www.investing.com/news/insider-trading-news/sweetgreen-director-julie-bornstein-sells-shares-worth-178560-93CH-3736364",
  "description": "",
  "author": "Investing.com",
  "published": "2024-11-22 00:46:11",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 3301,
  "excerpt": "Sweetgreen director Julie Bornstein sells shares worth $178,560",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "Julie Bornstein, a director at Sweetgreen, Inc. (NYSE:SG), recently sold 4,464 shares of the company's Class A common stock. The shares were sold at a price of $40 each, resulting in a total transaction value of $178,560. Following this transaction, Bornstein holds 37,101 shares in the company. This sale was disclosed in a filing with the Securities and Exchange Commission, providing investors with insight into insider activity at the fast-casual restaurant chain. In other recent news, Sweetgreen Inc. has been maintaining a steady growth trajectory, as reflected in its Third Quarter 2024 Earnings Call. The company reported a 13% year-over-year increase in sales, reaching $173.4 million, and a 6% growth in same-store sales. Additionally, Sweetgreen saw an improvement in its margins and a decrease in its net loss to $20.8 million from $25.1 million year-over-year. TD Cowen, in its recent analysis, maintained a Buy rating for Sweetgreen, expressing a reinforced conviction in the company's growth strategy and the potential of its Infinite Kitchen concept. The firm sees the Infinite Kitchen as a key factor in margin expansion over the medium term, a detail they believe is currently underappreciated by the market. Sweetgreen has also demonstrated strategic expansions, opening five new restaurants in Q3, bringing the total to 236 locations. The company plans to open at least 40 new restaurants in FY 2025, half of which will feature the Infinite Kitchen technology. Despite a slight rise in general and administrative expenses to $36.8 million, Sweetgreen raised its fiscal 2024 guidance, projecting revenue between $675 million to $680 million and same-store sales growth of 6% to 7%. The company also has plans for menu expansions and enhanced marketing strategies to broaden its brand beyond salads. InvestingPro Insights The recent insider sale by Julie Bornstein comes at a time when Sweetgreen (NYSE:SG) is experiencing significant market momentum. According to InvestingPro data, the company's stock has shown a remarkable 331.94% price return over the past year, with a 23.1% surge in just the last week. This performance has brought the stock price to 96.45% of its 52-week high, indicating strong investor confidence. However, it's important to note that Sweetgreen's financial fundamentals present a mixed picture. The company's revenue growth stands at 21.72% for the last twelve months as of Q3 2023, demonstrating continued expansion. Yet, an InvestingPro Tip reveals that Sweetgreen is not currently profitable, with an adjusted operating income of -$90.05 million for the same period. Despite the lack of profitability, Sweetgreen's market capitalization of $4.38 billion suggests investors are betting on its future potential. The company's price-to-book ratio of 10.3 indicates that the stock is trading at a premium to its book value, which aligns with another InvestingPro Tip highlighting that Sweetgreen is trading at a high revenue valuation multiple. For investors seeking a more comprehensive analysis, InvestingPro offers 12 additional tips for Sweetgreen, providing a deeper understanding of the company's financial health and market position. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_9_800x533_L_1420026261.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\n\u003cp\u003eJulie Bornstein, a director at Sweetgreen, Inc. (NYSE:SG), recently sold 4,464 shares of the company\u0026#39;s Class A common stock. The shares were sold at a price of $40 each, resulting in a total transaction value of $178,560. Following this transaction, Bornstein holds 37,101 shares in the company. This sale was disclosed in a filing with the Securities and Exchange Commission, providing investors with insight into insider activity at the fast-casual restaurant chain.\u003c/p\u003e\n\n\n\u003cp\u003eIn other recent news, Sweetgreen Inc. has been maintaining a steady growth trajectory, as reflected in its Third Quarter 2024 Earnings Call. The company reported a 13% year-over-year increase in sales, reaching $173.4 million, and a 6% growth in same-store sales. Additionally, Sweetgreen saw an improvement in its margins and a decrease in its net loss to $20.8 million from $25.1 million year-over-year.\u003c/p\u003e\n\u003cp\u003eTD Cowen, in its recent analysis, maintained a Buy rating for Sweetgreen, expressing a reinforced conviction in the company\u0026#39;s growth strategy and the potential of its Infinite Kitchen concept. The firm sees the Infinite Kitchen as a key factor in margin expansion over the medium term, a detail they believe is currently underappreciated by the market. \u003c/p\u003e\n\u003cp\u003eSweetgreen has also demonstrated strategic expansions, opening five new restaurants in Q3, bringing the total to 236 locations. The company plans to open at least 40 new restaurants in FY 2025, half of which will feature the Infinite Kitchen technology. \u003c/p\u003e\n\u003cp\u003eDespite a slight rise in general and administrative expenses to $36.8 million, Sweetgreen raised its fiscal 2024 guidance, projecting revenue between $675 million to $680 million and same-store sales growth of 6% to 7%. The company also has plans for menu expansions and enhanced marketing strategies to broaden its brand beyond salads.\u003c/p\u003e\n\u003ch2\u003eInvestingPro Insights\u003c/h2\u003e\n\u003cp\u003eThe recent insider sale by Julie Bornstein comes at a time when Sweetgreen (NYSE:SG) is experiencing significant market momentum. According to InvestingPro data, the company\u0026#39;s stock has shown a remarkable 331.94% price return over the past year, with a 23.1% surge in just the last week. This performance has brought the stock price to 96.45% of its 52-week high, indicating strong investor confidence.\u003c/p\u003e\n\u003cp\u003eHowever, it\u0026#39;s important to note that Sweetgreen\u0026#39;s financial fundamentals present a mixed picture. The company\u0026#39;s revenue growth stands at 21.72% for the last twelve months as of Q3 2023, demonstrating continued expansion. Yet, an InvestingPro Tip reveals that Sweetgreen is not currently profitable, with an adjusted operating income of -$90.05 million for the same period.\u003c/p\u003e\n\u003cp\u003eDespite the lack of profitability, Sweetgreen\u0026#39;s market capitalization of $4.38 billion suggests investors are betting on its future potential. The company\u0026#39;s price-to-book ratio of 10.3 indicates that the stock is trading at a premium to its book value, which aligns with another InvestingPro Tip highlighting that Sweetgreen is trading at a high revenue valuation multiple.\u003c/p\u003e\n\u003cp\u003eFor investors seeking a more comprehensive analysis, \u003ca href=\"https://www.investing.com/pro/pricing?referral=inv_in_article_anchor\"\u003eInvestingPro\u003c/a\u003e offers 12 additional tips for Sweetgreen, providing a deeper understanding of the company\u0026#39;s financial health and market position.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-22T00:46:11Z",
  "modifiedTime": null
}
