{
  "id": "0bee9639-556b-4508-87c7-4fd768398929",
  "title": "The Saturday Spread: Statistical Signals Flash Green for CMG, TMUS and VALE",
  "link": "https://finance.yahoo.com/news/saturday-spread-statistical-signals-flash-143002665.html",
  "description": "",
  "author": "",
  "published": "2025-06-21T14:30:02Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Josh Enomoto",
  "length": 2767,
  "excerpt": "Using the proper mathematical framework, market participants can apply probabilistic analyses to extract highly compelling trading ideas.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: Buy enter button by Ardasavasciogullari via iStock Here’s a question you may have wondered about: if meteorologists frequently provide five-day weather forecasts, how come market analysts (within reason) don’t do the same for the equities sector? Granted, human behavior can be irrational at times and black swan events by nature are unpredictable. However, on the whole, humans generally think in predictable manners. At first glance, the problem should be easy to address. When forecasting weather, meteorologists utilize ensemble models, historical simulations and probability distributions. By converting the applications toward the equities space, market analysts can assess the three main factors that meteorologists use for the weather: Make Over a 2.4% One-Month Yield Shorting Nvidia Out-of-the-Money Puts Get exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else. Define what event they’re modeling for Determine when said event might occur. Calculate how likely the event will materialize based on past analogs. Unfortunately, both fundamental and technical analysis runs into a major structural wall when addressing past analogs. In both cases, the measurement metric is non-stationary; that is, the metric changes (often wildly) across time and context. For example, the share price for a hot growth stock may be vastly different from what it was ten years ago and the same can be said about its valuation ratio. With such discrepancies, past analogs are effectively impossible to calculate — unless you impose stationarity on the target dataset. This is the core reason why I’ve been focused on market breadth, which are sequences of accumulative and distributive sessions. Market breadth is a representation of demand and demand is a binary construct — it’s either happening or it’s not. As such, it’s easily categorizable and quantifiable, thus facilitating probabilistic analysis. Just as importantly, market breadth sequences are falsifiable. Anyone can peer review my work and arrive at the same conclusions. The same cannot be said for certain methodologies, such as interpretive chart patterns in technical analysis. Because of the falsifiability of demand profiles, I’m able to filter out statistically intriguing ideas among hundreds of stocks. Below are three names to watch closely this week. With the closing bell on Friday, Chipotle Mexican Grill (CMG) ended the session up nearly 2%. For the week, the security gained just under 5%, potentially reflecting a sentiment shift. It would be a welcome change of pace. Since the beginning of the year, CMG stock has dropped 12.47%.",
  "image": "https://s.yimg.com/ny/api/res/1.2/oHxC8tOC8YQ_K7HGxEK37w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE7Y2Y9d2VicA--/https://media.zenfs.com/en/barchart_com_477/d3b0735997823ab2c69af690f505d319",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e   \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"Buy enter button by Ardasavasciogullari via iStock\" loading=\"eager\" height=\"641\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eBuy enter button by Ardasavasciogullari via iStock  \u003c/figcaption\u003e \u003c/figure\u003e   \u003cp\u003eHere’s a question you may have wondered about: if meteorologists frequently provide five-day weather forecasts, how come market analysts (within reason) don’t do the same for the equities sector? Granted, human behavior can be irrational at times and black swan events by nature are unpredictable. However, on the whole, humans generally think in predictable manners.\u003c/p\u003e      \u003cp\u003eAt first glance, the problem should be easy to address. When forecasting weather, meteorologists utilize ensemble models, historical simulations and probability distributions. By converting the applications toward the equities space, market analysts can assess the three main factors that meteorologists use for the weather:\u003c/p\u003e      \u003cul\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.barchart.com/story/news/32991081/make-over-a-2-4-one-month-yield-shorting-nvidia-out-of-the-money-puts?utm_source=yahoo\u0026amp;utm_medium=syndication\u0026amp;utm_campaign=32986668\u0026amp;utm_content=read-more-link-1\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Make Over a 2.4% One-Month Yield Shorting Nvidia Out-of-the-Money Puts;elm:context_link;itc:0;sec:content-canvas\"\u003eMake Over a 2.4% One-Month Yield Shorting Nvidia Out-of-the-Money Puts\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.barchart.com/my/barchart-newsletters/barchart-brief?utm_source=yahoo\u0026amp;utm_medium=syndication\u0026amp;utm_campaign=32986668\u0026amp;utm_content=newsletter-cta\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Get exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won\u0026#39;t find anywhere else.;elm:context_link;itc:0;sec:content-canvas\"\u003eGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won\u0026#39;t find anywhere else.\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e   \u003cul\u003e\u003cli\u003e \u003cp\u003eDefine what event they’re modeling for\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eDetermine when said event might occur.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eCalculate how likely the event will materialize based on past analogs.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e      \u003cp\u003eUnfortunately, both fundamental and technical analysis runs into a major structural wall when addressing past analogs. In both cases, the measurement metric is non-stationary; that is, the metric changes (often wildly) across time and context. For example, the share price for a hot growth stock may be vastly different from what it was ten years ago and the same can be said about its valuation ratio.\u003c/p\u003e   \u003cp\u003eWith such discrepancies, past analogs are effectively impossible to calculate — unless you impose stationarity on the target dataset.\u003c/p\u003e      \u003cp\u003eThis is the core reason why I’ve been focused on market breadth, which are sequences of accumulative and distributive sessions. Market breadth is a representation of demand and demand is a binary construct — it’s either happening or it’s not. As such, it’s easily categorizable and quantifiable, thus facilitating probabilistic analysis.\u003c/p\u003e   \u003cp\u003eJust as importantly, market breadth sequences are falsifiable. Anyone can peer review my work and arrive at the same conclusions. The same cannot be said for certain methodologies, such as interpretive chart patterns in technical analysis.\u003c/p\u003e   \u003cp\u003eBecause of the falsifiability of demand profiles, I’m able to filter out statistically intriguing ideas among hundreds of stocks. Below are three names to watch closely this week.\u003c/p\u003e      \u003cp\u003eWith the closing bell on Friday, Chipotle Mexican Grill (CMG) ended the session up nearly 2%. For the week, the security gained just under 5%, potentially reflecting a sentiment shift. It would be a welcome change of pace. Since the beginning of the year, CMG stock has dropped 12.47%.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e      \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-21T14:30:02Z",
  "modifiedTime": null
}
