{
  "id": "0d37b74f-0d1c-44ad-abb1-936a42f0e581",
  "title": "There's an important jobs report coming Friday. Here's what to expect",
  "link": "https://www.cnbc.com/2024/12/05/theres-an-important-jobs-report-coming-friday-heres-what-to-expect.html",
  "description": "The jobs report due out Friday could provide a clearer picture of where the labor market is headed.",
  "author": "",
  "published": "Thu, 05 Dec 2024 21:40:45 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Jeff Cox",
  "length": 4754,
  "excerpt": "The jobs report due out Friday could provide a clearer picture of where the labor market is headed.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "A pedestrian walks by a 'hiring now' sign in front of a U-Haul store on December 03, 2024 in San Rafael, California. Justin Sullivan | Getty ImagesAfter a month in which hiring was essentially muted due to storms and strikes, the jobs report due out Friday could provide a clearer picture of where the labor market is headed.The Bureau of Labor Statistics is expected to report Friday at 8:30 a.m. ET that nonfarm payrolls increased by 214,000 in November, a significant step up from the meager 12,000 gain in October. That month's reading was the worst for job gains since December 2020.One of the things that will make the report so pivotal is it will be the last comprehensive look the Federal Reserve will get before its next policy meeting on Dec. 17-18. Markets are betting heavily that the Fed will approve another quarter-percentage-point interest rate cut, but that could change depending on how the jobs count plays out.\"Well, it should be a pretty healthy number, because it should bounce back from [October] when we had [Hurricane] Milton and the [Boeing strike] holding down jobs,\" said Kathy Jones, chief fixed income strategist at the Schwab Center for Financial Research.In fact, the October number could get pushed higher after BLS surveyors go back and recheck the month's data. Revisions to the payrolls reports sometimes have been massive in the post-Covid period.That could add to a messy couple of months with economic data and make the Fed's job more challenging.\"I would expect it to be over 200,000, and the risk would probably be to the upside if we get a real rebound,\" Jones said. \"But I'm not sure that this jobs report will tell us much, either, because of all the weather effects up and down. Is it really going to give us a clear view of the future, or is it just going to be more muddy data to deal with?\"Important for the FedGetting a clear picture for the Fed is essential now as policymakers look to recalibrate policy at a time when annual inflation rates are elevated but easing, and focus has increased on the labor market.Aside from the October report, the jobs picture has been showing a mostly slower trend since around April, with payroll gains averaging about 128,000 new jobs a month as the unemployment rate has drifted up to 4.1%. Fed policymakers want to take their benchmark short-term borrowing rate down to a more neutral level as they balance their focus between inflation and employment.\"This is absolutely going to be noisy, because a storm and strike disruption affects two months' worth of data, the data for the month in which people aren't working and the next month when they return to work,\" said BNY economist Vincent Reinhart, a former Fed official who served 24 years at the central bank.\"The way the Fed sees it is that the slowing in nonfarm payrolls over the course of 2024 was basically settling to trend — trend being something a little above 100,000 jobs created a month — and that was not worrisome,\" he added. \"It was actually welcome, because, you know, trend is sustainable.\"Indeed, the most recent signals point to a job market leveling off but not worsening.State of the labor marketInitial weekly unemployment insurance claims have held in a fairly steady range around 220,000, though continuing claims earlier in November had hit their highest level in about three years. Together, the numbers indicate that companies are not laying off workers en masse but also aren't rehiring those who do lose their jobs.A Fed economic report Wednesday — its \"Beige Book\" summary of current conditions — described hiring as \"subdued as worker turnover remained low and few firms reported increasing their headcount.\" The report said layoffs are \"low\" but employers indicated caution about the future pace of hiring, with more enthusiasm about entry-level workers and skilled trades.Job openings increased in October while the hiring rate fell and those leaving their jobs voluntarily increased, according to BLS data this week.The Fed will have to weigh all of those factors, plus worries about rising inflation, when it makes its rate decision and lays out its outlook for the future.If the labor market can remain steady, then it shouldn't put additional pressure on inflation, Reinhart said. \"So the strategy is, try to get demand at trend, because if growth and demand are at trend, then you should preserve the current state of the labor market, and the labor market is roughly in balance,\" he added.In addition to the headline payrolls gain, the unemployment rate is expected to nudge up to 4.2% as the labor force sees re-entrants from October. Also, average hourly earnings are expected to rise 0.3% on the month and 3.9% from a year ago, both down slightly from the previous month.",
  "image": "https://image.cnbcfm.com/api/v1/image/108071543-1733348234199-gettyimages-2160789034-economic448287_ymkwy32a.jpeg?v=1733348441\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108072139\" data-test=\"InlineImage\"\u003e\u003cp\u003eA pedestrian walks by a \u0026#39;hiring now\u0026#39; sign in front of a U-Haul store on December 03, 2024 in San Rafael, California. \u003c/p\u003e\u003cp\u003eJustin Sullivan | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAfter a month in which hiring was essentially muted due to storms and strikes, the jobs report due out Friday could provide a clearer picture of where the labor market is headed.\u003c/p\u003e\u003cp\u003eThe Bureau of Labor Statistics is expected to report Friday at 8:30 a.m. ET that nonfarm payrolls increased by 214,000 in November, a significant step up from \u003ca href=\"https://www.cnbc.com/2024/11/01/us-jobs-report-october-2024.html\"\u003ethe meager 12,000 gain in October\u003c/a\u003e. That month\u0026#39;s reading was the worst for job gains since December 2020.\u003c/p\u003e\u003cp\u003eOne of the things that will make the report so pivotal is it will be the last comprehensive look the Federal Reserve will get before its next policy meeting on Dec. 17-18. Markets are betting heavily that \u003ca href=\"https://www.cnbc.com/2024/12/02/markets-are-getting-comfortable-again-with-idea-of-december-rate-cut.html\"\u003ethe Fed will approve\u003c/a\u003e another quarter-percentage-point interest rate cut, but that could change depending on how the jobs count plays out.\u003c/p\u003e\u003cp\u003e\u0026#34;Well, it should be a pretty healthy number, because it should bounce back from [October] when we had [Hurricane] Milton and the [Boeing strike] holding down jobs,\u0026#34; said Kathy Jones, chief fixed income strategist at the Schwab Center for Financial Research.\u003c/p\u003e\u003cp\u003eIn fact, the October number could get pushed higher after BLS surveyors go back and recheck the month\u0026#39;s data. \u003ca href=\"https://www.cnbc.com/2024/08/21/nonfarm-payroll-growth-revised-down-by-818000-labor-department-says.html\"\u003eRevisions to the payrolls reports\u003c/a\u003e sometimes have been massive in the post-Covid period.\u003c/p\u003e\u003cp\u003eThat could add to a messy couple of months with economic data and make the Fed\u0026#39;s job more challenging.\u003c/p\u003e\u003cp\u003e\u0026#34;I would expect it to be over 200,000, and the risk would probably be to the upside if we get a real rebound,\u0026#34; Jones said. \u0026#34;But I\u0026#39;m not sure that this jobs report will tell us much, either, because of all the weather effects up and down. Is it really going to give us a clear view of the future, or is it just going to be more muddy data to deal with?\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eImportant for the Fed\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eGetting a clear picture for the Fed is essential now as policymakers look to \u003ca href=\"https://www.cnbc.com/2024/09/19/the-fed-has-set-out-on-a-recalibration-of-policy-heres-what-powells-new-buzzword-means.html\"\u003erecalibrate policy\u003c/a\u003e at a time when annual inflation rates are elevated but easing, and focus has increased on the labor market.\u003c/p\u003e\u003cp\u003eAside from the October report, the jobs picture has been showing a mostly slower trend since around April, with payroll gains averaging about 128,000 new jobs a month as the unemployment rate has drifted up to 4.1%. Fed policymakers want to take their benchmark short-term borrowing rate down to a more neutral level as they balance their focus between inflation and employment.\u003c/p\u003e\u003cp\u003e\u0026#34;This is absolutely going to be noisy, because a storm and strike disruption affects two months\u0026#39; worth of data, the data for the month in which people aren\u0026#39;t working and the next month when they return to work,\u0026#34; said BNY economist Vincent Reinhart, a former Fed official who served 24 years at the central bank.\u003c/p\u003e\u003cp\u003e\u0026#34;The way the Fed sees it is that the slowing in nonfarm payrolls over the course of 2024 was basically settling to trend — trend being something a little above 100,000 jobs created a month — and that was not worrisome,\u0026#34; he added. \u0026#34;It was actually welcome, because, you know, trend is sustainable.\u0026#34;\u003c/p\u003e\u003cp\u003eIndeed, the most recent signals point to a job market leveling off but not worsening.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eState of the labor market\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eInitial weekly unemployment insurance claims have held in a fairly steady range around 220,000, though continuing claims earlier in November had hit their highest level in about three years. Together, the numbers indicate that companies are not laying off workers en masse but also aren\u0026#39;t rehiring those who do lose their jobs.\u003c/p\u003e\u003cp\u003eA Fed economic report Wednesday — its \u0026#34;Beige Book\u0026#34; summary of current conditions — described hiring as \u0026#34;subdued as worker turnover remained low and few firms reported increasing their headcount.\u0026#34; The report said layoffs are \u0026#34;low\u0026#34; but employers indicated caution about the future pace of hiring, with more enthusiasm about entry-level workers and skilled trades.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.cnbc.com/2024/12/03/job-openings-jumped-and-hiring-slumped-in-october-key-labor-report-for-the-fed-shows.html\"\u003eJob openings increased\u003c/a\u003e in October while the hiring rate fell and those leaving their jobs voluntarily increased, according to BLS data this week.\u003c/p\u003e\u003cp\u003eThe Fed will have to weigh all of those factors, plus worries about rising inflation, when it makes its rate decision and lays out its outlook for the future.\u003c/p\u003e\u003cp\u003eIf the labor market can remain steady, then it shouldn\u0026#39;t put additional pressure on inflation, Reinhart said. \u0026#34;So the strategy is, try to get demand at trend, because if growth and demand are at trend, then you should preserve the current state of the labor market, and the labor market is roughly in balance,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eIn addition to the headline payrolls gain, the unemployment rate is expected to nudge up to 4.2% as the labor force sees re-entrants from October. Also, average hourly earnings are expected to rise 0.3% on the month and 3.9% from a year ago, both down slightly from the previous month.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-05T20:52:34Z",
  "modifiedTime": "2024-12-05T21:40:45Z"
}
