{
  "id": "15efbb30-777f-4402-b522-afa9d5c98676",
  "title": "History Says the Nasdaq Will Surge in 2025. 1 Stock-Split Stock to Buy Before It Does.",
  "link": "https://finance.yahoo.com/news/history-says-nasdaq-surge-2025-230100824.html",
  "description": "",
  "author": "",
  "published": "2024-12-07T23:01:00Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Danny Vena, The Motley Fool",
  "length": 2784,
  "excerpt": "This investor favorite has been on an epic run over the past couple of years and shows no signs of slowing.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "The Nasdaq Composite has been on fire over the past couple of years, driven higher by the advent of artificial intelligence (AI), improving economic conditions, an uncontested election, and the Federal Reserve Bank's recent moves to cut interest rates. After returning 43% in 2023, the tech-centric index is up roughly 30% in 2024. History suggests the rally will likely continue into 2025. The current bull market began on Oct. 12, 2022, and while every rally is different, history can provide important context. Bull markets last more than five years, on average. Since the current rally just entered its third year, there's a strong likelihood the Nasdaq will continue to gain ground next year. It's also worth noting that the Nasdaq has generated gains 73% of the time, dating back 53 years, so history is on the side of investors. Finally, the Nasdaq has jumped 12%, on average, in years following positive gains, which suggests there's additional upside ahead. Are You Missing The Morning Scoop? Wake up with Breakfast news in your inbox every market day. Sign Up For Free » Furthermore, there's been a resurgence in the popularity of stock splits over the past few years. As a result, investors are taking a renewed interest in companies that split their shares, as this is historically preceded by years of robust sales and profit growth. One such company is Nvidia (NASDAQ: NVDA). The stock has gained 26,920% over the past decade (as of this writing), prompting management to initiate a 10-for-1 stock split earlier this year -- after a 4-for-1 split in 2021. Despite its recent run-up, there's reason to believe that Nvidia's growth spurt will continue into 2025. Read on to find out why. Image source: Getty Images. The adoption of generative AI has spread like wildfire over the past two years as businesses are eager to share in the productivity increases promised by these advanced algorithms. Generative AI has proven adept at drafting and summarizing emails, searching and abbreviating content, mining data, generating original content, and writing computer code -- and new applications are being discovered every day. Automating and streamlining tasks saves users time and money, driving new users to adopt AI. Nvidia pioneered the graphics processing units (GPUs) that make this all possible. These specialized chips provide the sheer number-crunching capability that brought AI to life. The secret lies in parallel processing or breaking up computer-intensive jobs into smaller, more manageable bits. Nvidia first developed these chips to render lifelike images in video games but soon discovered other applications for this breakthrough technology, including data centers, high-performance computing (HPC), and machine learning -- an earlier branch of AI.",
  "image": "https://s.yimg.com/ny/api/res/1.2/ptZeLVlAzLIyCL_Z1QxQJg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/motleyfool.com/a5c9ef80a2044a0ce58c887cd9dff927",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cp\u003eThe \u003cstrong\u003eNasdaq Composite\u003c/strong\u003e has been on fire over the past couple of years, driven higher by the advent of artificial intelligence (AI), improving economic conditions, an uncontested election, and the Federal Reserve Bank\u0026#39;s recent moves to cut interest rates. After returning 43% in 2023, the tech-centric index is up roughly 30% in 2024. History suggests the rally will likely continue into 2025.\u003c/p\u003e  \u003cp\u003eThe current bull market began on Oct. 12, 2022, and while every rally is different, history can provide important context. Bull markets last more than five years, on average. Since the current rally just entered its third year, there\u0026#39;s a strong likelihood the Nasdaq will continue to gain ground next year. It\u0026#39;s also worth noting that the Nasdaq has generated gains 73% of the time, dating back 53 years, so history is on the side of investors. Finally, the Nasdaq has jumped 12%, on average, in years following positive gains, which suggests there\u0026#39;s additional upside ahead.\u003c/p\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eAre You Missing The Morning Scoop?\u003c/strong\u003e Wake up with \u003cstrong\u003eBreakfast news\u003c/strong\u003e in your inbox every market day. \u003ca href=\"https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e\u0026amp;impression=794bf358-1ae8-4194-a591-85b9d3c53860\u0026amp;url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-foolcom-breakfast-news%3Faid%3D11010%26source%3Disaeditxt0000998%26ftm_cam%3Dsa-breakfast-news%26ftm_veh%3Dtop_incontent_pitch_feed_yahoo%26ftm_pit%3D16931\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=f38aa408-9367-49cf-a6b9-13c542bf8c42\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Sign Up For Free »;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cspan\u003e\u003cstrong\u003eSign Up For Free »\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e \u003cp\u003eFurthermore, there\u0026#39;s been a resurgence in the popularity of \u003ca href=\"https://www.fool.com/terms/s/stock-split/?utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=f38aa408-9367-49cf-a6b9-13c542bf8c42\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:stock splits;elm:context_link;itc:0;sec:content-canvas\"\u003estock splits\u003c/a\u003e over the past few years. As a result, investors are taking a renewed interest in companies that split their shares, as this is historically preceded by years of robust sales and profit growth. One such company is \u003cstrong\u003eNvidia\u003c/strong\u003e \u003cspan\u003e(NASDAQ: NVDA)\u003c/span\u003e. The stock has gained 26,920% over the past decade (as of this writing), prompting management to initiate a \u003ca href=\"https://www.fool.com/investing/2024/05/22/nvidia-announces-a-10-for-1-stock-split-heres-what/?utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=f38aa408-9367-49cf-a6b9-13c542bf8c42\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:10-for-1 stock split;elm:context_link;itc:0;sec:content-canvas\"\u003e10-for-1 stock split\u003c/a\u003e earlier this year -- after a 4-for-1 split in 2021.\u003c/p\u003e \u003cp\u003eDespite its recent run-up, there\u0026#39;s reason to believe that Nvidia\u0026#39;s growth spurt will continue into 2025. Read on to find out why.\u003c/p\u003e \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"A person in business attire drawing an arrow with an upward trajectory marked 2025.\" loading=\"eager\" height=\"360\" width=\"640\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eImage source: Getty Images.  \u003c/figcaption\u003e \u003c/figure\u003e  \u003cp\u003eThe adoption of generative AI has spread like wildfire over the past two years as businesses are eager to share in the productivity increases promised by these advanced algorithms. Generative AI has proven adept at drafting and summarizing emails, searching and abbreviating content, mining data, generating original content, and writing computer code -- and new applications are being discovered every day. Automating and streamlining tasks saves users time and money, driving new users to adopt AI.\u003c/p\u003e  \u003cp\u003eNvidia pioneered the graphics processing units (GPUs) that make this all possible. These specialized chips provide the sheer number-crunching capability that brought AI to life. The secret lies in parallel processing or breaking up computer-intensive jobs into smaller, more manageable bits. Nvidia first developed these chips to render lifelike images in video games but soon discovered other applications for this breakthrough technology, including data centers, high-performance computing (HPC), and machine learning -- an earlier branch of AI.\u003c/p\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-07T23:01:00Z",
  "modifiedTime": null
}
