{
  "id": "1cc085da-1fea-4b9c-8f8d-50d78fad3eb0",
  "title": "Build a Brand Gen Z Wants to Work (and Buy) From",
  "link": "",
  "description": "I chat with Len Silverman—seasoned entrepreneur, longtime Learning Center owner, and author of Mesh: Aligning Your Personal Brand with Gen Z. With over 30 years of business experience and a front-row seat to Gen Z's development, Len offers expert insights into how businesses can attract, engage, and retain Gen Z employees. We explore what makes this generation tick, why traditional hiring practices fall short, and how aligning your company culture with Gen Z values can be a game-changer. If you're struggling to connect with the next generation of workers—or customers—this episode delivers the mindset and tools to bridge the gap. Today we discussed: [00:00] Opening [00:09] Introduction to Len Silverman [00:53] What is the Personal Brand of Gen Z [02:56] Common Stereotypes of Genz [04:16] The Old Ways Aren't Going to Work [06:39] The Employee Journey [08:35] Importance of Cultural Consistency [10:39] Changing Mindsets [12:44] Gen Z Customers [14:19] Common Mistakes Trying to Align with Gen Z [17:11] Turning Gen Z into A Players More About Len Silverman: Check out Len Silverman's Website: https://uptoelevenmarketing.com Connect with Len Silverman on LinkedIn: https://www.linkedin.com/in/up-to-eleven-len/ Read MESH: Aligning the Personal Brand of Gen Z with your Company Culture by Len Silverman: https://amzn.to/3DKURsC Rate, Review, \u0026 Follow If you liked this episode, please rate and review the show. Let us know what you loved most about the episode. Struggling with strategy? Unlock your free AI-powered prompts now and start building a winning strategy today! 👉 Get Your Free Prompts: https://dtm.world/freeprompts",
  "author": "John Jantsch",
  "published": "Thu, 27 Mar 2025 11:30:00 -0000",
  "source": "https://ducttape.libsyn.com/rss",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
