{
  "id": "1fecb08f-3949-42d6-9279-4611b8a2517e",
  "title": "Navitas Semiconductor director Richard Hendrix sells $323,040 in shares",
  "link": "https://www.investing.com/news/insider-trading-news/navitas-semiconductor-director-richard-hendrix-sells-323040-in-shares-93CH-3760213",
  "description": "",
  "author": "Investing.com",
  "published": "2024-12-07 01:07:51",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 2863,
  "excerpt": "Navitas Semiconductor director Richard Hendrix sells $323,040 in shares",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "Richard J. Hendrix, a director at Navitas Semiconductor Corp (NASDAQ:), recently executed a significant stock sale. Hendrix sold 80,000 shares of Navitas' Class A Common Stock on December 6, 2024, at an average price of $4.038 per share, amounting to a total transaction value of $323,040. The sale comes as the stock has shown strong momentum, with a 37% return over the past week, though trading at $3.76, it remains 55% below its 52-week high of $8.44. Following this transaction, Hendrix holds a total of 356,709 shares indirectly through RJH Management Co., LLC, and 94,739 shares directly, which includes 31,460 shares underlying unvested restricted stock units subject to vesting at the company's 2025 annual stockholders' meeting. Additionally, he maintains indirect ownership of 1,263,000 shares through Live Oak Sponsor Partners II, LLC, 42,366 shares via Live Oak Merchant Partners, LLC, and 71,807 shares through individual retirement accounts. According to InvestingPro, the company maintains strong financial health with a current ratio of 5.59, indicating solid liquidity, though it's currently not profitable. These transactions provide a glimpse into the director's current investment position in Navitas Semiconductor, a company known for its innovations in semiconductor technology. With a market cap of $705 million and revenue growth of 39% in the last twelve months, InvestingPro analysis indicates the stock is currently fairly valued, with 8 additional key insights available to subscribers. In other recent news, Navitas Semiconductor has reported significant developments. The company announced a record Q3 revenue of $21.7 million, despite an operational loss of $12.7 million. In response to these financial challenges, Navitas has initiated a cost reduction strategy, including a 14% workforce reduction, set to decrease operating expenses by approximately $2 million each quarter. Navitas has also made strategic moves, including the appointment of Dr. Ranbir Singh, a silicon carbide (SiC) technology expert, to its board of directors. This move is expected to bolster Navitas's growth in markets such as artificial intelligence, electric vehicles, and mobile technology. The company also launched a new low-voltage GaN product and entered a strategic partnership with Infineon (OTC:) for dual sourcing. Analysts' outlook on Navitas has been mixed. Needham maintained its Buy rating on Navitas but reduced the price target to $4.00 from $5.00. Baird also adjusted its outlook, lowering the price target to $5.00 from the previous $7.00, while maintaining an Outperform rating. Both firms anticipate a revenue rebound for Navitas in the upcoming years. These are among the recent developments at Navitas Semiconductor. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_9_800x533_L_1420026261.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\n\u003cp\u003eRichard J. Hendrix, a director at Navitas Semiconductor Corp (NASDAQ:), recently executed a significant stock sale. Hendrix sold 80,000 shares of Navitas\u0026#39; Class A Common Stock on December 6, 2024, at an average price of $4.038 per share, amounting to a total transaction value of $323,040. The sale comes as the stock has shown strong momentum, with a 37% return over the past week, though trading at $3.76, it remains 55% below its 52-week high of $8.44. \u003c/p\u003e\n\u003cp\u003eFollowing this transaction, Hendrix holds a total of 356,709 shares indirectly through RJH Management Co., LLC, and 94,739 shares directly, which includes 31,460 shares underlying unvested restricted stock units subject to vesting at the company\u0026#39;s 2025 annual stockholders\u0026#39; meeting. Additionally, he maintains indirect ownership of 1,263,000 shares through Live Oak Sponsor Partners II, LLC, 42,366 shares via Live Oak Merchant Partners, LLC, and 71,807 shares through individual retirement accounts. According to \u003ca href=\"https://www.investing.com/pro/NVTS\"\u003eInvestingPro\u003c/a\u003e, the company maintains strong financial health with a current ratio of 5.59, indicating solid liquidity, though it\u0026#39;s currently not profitable. \u003c/p\u003e\n\u003cp\u003eThese transactions provide a glimpse into the director\u0026#39;s current investment position in Navitas Semiconductor, a company known for its innovations in semiconductor technology. With a market cap of $705 million and revenue growth of 39% in the last twelve months, \u003ca href=\"https://www.investing.com/pro/NVTS\"\u003eInvestingPro\u003c/a\u003e analysis indicates the stock is currently fairly valued, with 8 additional key insights available to subscribers.\u003c/p\u003e\n\n\u003cp\u003eIn other recent news, Navitas Semiconductor has reported significant developments. The company announced a record Q3 revenue of $21.7 million, despite an operational loss of $12.7 million. In response to these financial challenges, Navitas has initiated a cost reduction strategy, including a 14% workforce reduction, set to decrease operating expenses by approximately $2 million each quarter. \u003c/p\u003e\n\u003cp\u003eNavitas has also made strategic moves, including the appointment of Dr. Ranbir Singh, a silicon carbide (SiC) technology expert, to its board of directors. This move is expected to bolster Navitas\u0026#39;s growth in markets such as artificial intelligence, electric vehicles, and mobile technology. The company also launched a new low-voltage GaN product and entered a strategic partnership with Infineon (OTC:) for dual sourcing.\u003c/p\u003e\n\u003cp\u003eAnalysts\u0026#39; outlook on Navitas has been mixed. Needham maintained its Buy rating on Navitas but reduced the price target to $4.00 from $5.00. Baird also adjusted its outlook, lowering the price target to $5.00 from the previous $7.00, while maintaining an Outperform rating. Both firms anticipate a revenue rebound for Navitas in the upcoming years. These are among the recent developments at Navitas Semiconductor.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-07T01:07:51Z",
  "modifiedTime": null
}
