{
  "id": "27a7af4e-36bd-4944-b97e-784e91f790cc",
  "title": "Hexaware Tech lists at 5% above IPO price",
  "link": "https://economictimes.indiatimes.com/markets/ipos/fpos/hexaware-tech-lists-at-5-above-ipo-price/articleshow/118401157.cms",
  "description": "After delisting from the Indian bourses in November 2020, the software services company returned to the capital market by selling shares worth ₹8,750 crore in the IPO last week, making it the largest Indian IT services IPO exceeding Tata Consultancy Services' ₹4,713 crore public issue in 2004.",
  "author": "",
  "published": "Thu, 20 Feb 2025 05:25:14 +0530",
  "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
  "categories": null,
  "byline": "",
  "length": 2380,
  "excerpt": "After delisting from the Indian bourses in November 2020, the software services company returned to the capital market by selling shares worth ₹8,750 crore in the IPO last week, making it the largest Indian IT services IPO exceeding Tata Consultancy Services' ₹4,713 crore public issue in 2004.",
  "siteName": "The Economic Times",
  "favicon": "",
  "text": "Mumbai: Hexaware Technologies made a quiet return to the Indian stock market listing at about 5% above its initial public offering (IPO) price of ₹708 on Wednesday. The stock, which opened at ₹745.5, closed at ₹755.75, about 7% above its issue price. Tired of too many ads? Remove AdsAfter delisting from the Indian bourses in November 2020, the software services company returned to the capital market by selling shares worth ₹8,750 crore in the IPO last week, making it the largest Indian IT services IPO exceeding Tata Consultancy Services' ₹4,713 crore public issue in 2004.Analysts are bullish about the stock's prospects as its valuations are below that of its peers like Coforge and Persistent Systems.\"Hexaware's PE (Price to Earnings) ratio is attractive within this group and appears undervalued compared to Persistent Systems and Coforge,\" said Abhishek Pandya, research analyst, StoxBox. \"Considering the company's business profile \u0026 strong fundamentals, we remain bullish on Hexaware Tech from a medium to long-term perspective.\"Hexaware Technologies’ PE ratio is 43.1 times while Persistent Systems and Coforge have a PE ratio of 73.9 and 74.5 respectively. This makes Hexaware an attractive buy relative to these companies, said Pandya. Tired of too many ads? Remove Ads“The company’s return on net worth is the highest at 23.6% among its peers, indicating strong profitability and a healthy return to shareholders, which helps justify its valuation,” he said. JM Financial initiated coverage on the stock on Wednesday with a ‘buy’ rating and a target price of Rs 820, implying an 8.5% upside over Wednesday’s closing. Private Equity Carlyle’s ownership in the company could remain an overhang on the valuation, the brokerage said. The firm owns close to 75% of Hexaware. The IPO was solely an offer for sale of Rs 8,750 crore by CA Magnum Holdings, a subsidiary of the Carlyle Group. Analysts said that the listing indicates moderate investor confidence and although the response was subdued, the listing performance exceeded grey market expectations. “Given its strong financial growth, improving margins, strong cash generation and global customer base, the company is well-positioned to achieve sustained growth within the sector,” said Pandya. “We suggest that investors who have received shares consider maintaining their positions with this outlook in mind.”",
  "image": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-15550,resizemode-75,msid-118401157/markets/ipos/fpos/hexaware-tech-lists-at-5-above-ipo-price.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"articlebody_118401157\"\u003e\u003cp\u003eMumbai: \u003ca href=\"https://economictimes.indiatimes.com/topic/hexaware-technologies\"\u003eHexaware Technologies\u003c/a\u003e made a quiet return to the Indian stock market listing at about 5% above its initial public offering (IPO) price of ₹708 on Wednesday. The stock, which opened at ₹745.5, closed at ₹755.75, about 7% above its issue price. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAfter delisting from the Indian bourses in November 2020, the software services company returned to the capital market by selling shares worth ₹8,750 crore in the IPO last week, making it the largest Indian IT services IPO exceeding \u003ca href=\"https://economictimes.indiatimes.com/topic/tata-consultancy-services\"\u003eTata Consultancy Services\u003c/a\u003e\u0026#39; ₹4,713 crore public issue in 2004.\u003c/p\u003e\u003cp\u003eAnalysts are bullish about the stock\u0026#39;s prospects as its valuations are below that of its peers like \u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/coforge-ltd/stocks/companyid-858.cms\"\u003eCoforge\u003c/a\u003e and \u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/persistent-systems-ltd/stocks/companyid-21519.cms\"\u003ePersistent Systems\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;Hexaware\u0026#39;s PE (Price to Earnings) ratio is attractive within this group and appears undervalued compared to Persistent Systems and \u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/coforge-ltd/stocks/companyid-858.cms\"\u003eCoforge\u003c/a\u003e,\u0026#34; said Abhishek Pandya, research analyst, StoxBox. \u0026#34;Considering the company\u0026#39;s business profile \u0026amp; strong fundamentals, we remain bullish on Hexaware Tech from a medium to long-term perspective.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/hexaware-technologies-ltd/stocks/companyid-2254981.cms\"\u003eHexaware Technologies\u003c/a\u003e’ PE ratio is 43.1 times while Persistent Systems and Coforge have a PE ratio of 73.9 and 74.5 respectively. This makes Hexaware an attractive buy relative to these companies, said Pandya. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e“The company’s return on net worth is the highest at 23.6% among its peers, indicating strong profitability and a healthy return to shareholders, which helps justify its valuation,” he said. \u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/jm-financial-ltd/stocks/companyid-12633.cms\"\u003eJM Financial\u003c/a\u003e initiated coverage on the stock on Wednesday with a ‘buy’ rating and a target price of Rs 820, implying an 8.5% upside over Wednesday’s closing. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"90%\" src=\"https://img.etimg.com/photo/113427908.cms\" alt=\"Growfast logo\" loading=\"lazy\" decoding=\"async\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003ePrivate Equity Carlyle’s ownership in the company could remain an overhang on the valuation, the brokerage said. The firm owns close to 75% of Hexaware. The IPO was solely an offer for sale of Rs 8,750 crore by CA Magnum Holdings, a subsidiary of the Carlyle Group. \u003c/p\u003e\u003cp\u003eAnalysts said that the listing indicates moderate investor confidence and although the response was subdued, the listing performance exceeded grey market expectations. \u003c/p\u003e\u003cp\u003e“Given its strong financial growth, improving margins, strong cash generation and global customer base, the company is well-positioned to achieve sustained growth within the sector,” said Pandya. “We suggest that investors who have received shares consider maintaining their positions with this outlook in mind.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
