{
  "id": "282d7e95-90bc-4955-a772-0a410c02490c",
  "title": "NCC, Divi's Labs among top picks by Ajit Mishra of Religare Broking",
  "link": "https://www.business-standard.com/markets/news/ncc-divi-s-labs-among-top-picks-by-ajit-mishra-of-religare-broking-124120500075_1.html",
  "description": "The markets experienced a volatile session and ended nearly flat, taking a breather after three consecutive days of gains",
  "author": "",
  "published": "Thu, 05 Dec 2024 06:14:13 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Ajit Mishra",
  "length": 2581,
  "excerpt": "The markets experienced a volatile session and ended nearly flat, taking a breather after three consecutive days of gains",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "2 min read Last Updated : Dec 05 2024 | 6:14 AM ISTIndices view Nifty: CMP: 24,467.45 The markets experienced a volatile session and ended nearly flat, taking a breather after three consecutive days of gains. While the tone remained positive for part of the session, profit-booking in select heavyweights limited the upside.  Sectorally, performance was mixed, with banking and realty outperforming, while energy, auto, and FMCG faced pressure. On the broader front, the momentum persisted, as midcap and smallcap indices rose nearly a per cent each. This pause is a natural reaction following the recent rally, especially with key sectors like banking and IT driving the gains while others remain subdued or under pressure. We expect the consolidation to continue in the next session, though the overall sentiment should stay positive.  Traders are advised to focus on a stock-specific approach and use these intermediate pauses to accumulate quality stocks.More From This Section Stocks recommendations Divi’s Laboratories Limited  | LTP: Rs 6,256.50| Buy | Target: Rs 6,460 | Stop loss: Rs 6,150 The pharma sector is witnessing a gradual recovery, with Divi’s Laboratories outperforming most of its peers. Currently trading at record highs, the stock has emerged strong after breaking out of a two-month consolidation phase. It appears well-positioned for the next leg of its upward trajectory. Traders are encouraged to leverage the ongoing minor consolidation phase to initiate fresh long positions. NCC Limited  |LTP: Rs 312.15 | Buy | Target: Rs 332 | Stop loss: Rs 302 The infrastructure sector has been witnessing robust buying interest, with NCC moving in tandem. The stock has staged a strong recovery after successfully retesting its 200-day exponential moving average (DEMA). It is currently forming a pivot near its previous swing high. With consolidation likely nearing completion, this presents a good opportunity for participants to accumulate positions around the current levels. Punjab National Bank | LTP: Rs 110.01 | Buy | Target: Rs 118 | Stop loss: Rs 106 The banking sector continues to outperform, with PSU banks moving in step with their private counterparts. Among the key players, PNB has shown a strong reversal after a nearly seven-month corrective phase. The stock has regained all its critical moving averages, bolstering its positive outlook. Its chart pattern suggests a steady upward trend in the coming sessions.  (This article is by Ajit Mishra, SVP-research at Religare Broking Limited. Views expressed are his own.) Also Read",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-09/18/thumb/featurecrop/400X400/1726644412-926.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e2 min read  Last Updated : Dec 05 2024 | 6:14 AM IST\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\u003cstrong\u003eIndices view\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNifty: CMP: 24,467.45\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\n\tThe markets experienced a volatile session and ended nearly flat, taking a breather after three consecutive days of gains. While the tone remained positive for part of the session, profit-booking in select heavyweights limited the upside. \u003c/p\u003e\n\u003cp\u003e\n\tSectorally, performance was mixed, with banking and realty outperforming, while energy, auto, and FMCG faced pressure. On the broader front, the momentum persisted, as midcap and smallcap indices rose nearly a per cent each.\u003c/p\u003e\n\u003cp\u003e\n\tThis pause is a natural reaction following the recent rally, especially with key sectors like banking and IT driving the gains while others remain subdued or under pressure. We expect the consolidation to continue in the next session, though the overall sentiment should stay positive. \u003c/p\u003e\n\u003cp\u003e\n\tTraders are advised to focus on a stock-specific approach and use these intermediate pauses to accumulate quality stocks.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eMore From This Section\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003ch3\u003e\n\tStocks recommendations\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003eDivi’s Laboratories Limited  | LTP: Rs 6,256.50| Buy | Target: Rs 6,460 | Stop loss: Rs 6,150\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\n\tThe pharma sector is witnessing a gradual recovery, with Divi’s Laboratories outperforming most of its peers. Currently trading at record highs, the stock has emerged strong after breaking out of a two-month consolidation phase. It appears well-positioned for the next leg of its upward trajectory. Traders are encouraged to leverage the ongoing minor consolidation phase to initiate fresh long positions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNCC Limited  |LTP: Rs 312.15 | Buy | Target: Rs 332 | Stop loss: Rs 302\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\n\tThe infrastructure sector has been witnessing robust buying interest, with NCC moving in tandem. The stock has staged a strong recovery after successfully retesting its 200-day exponential moving average (DEMA). It is currently forming a pivot near its previous swing high. With consolidation likely nearing completion, this presents a good opportunity for participants to accumulate positions around the current levels.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePunjab National Bank | LTP: Rs 110.01 | Buy | Target: Rs 118 | Stop loss: Rs 106\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\n\tThe banking sector continues to outperform, with PSU banks moving in step with their private counterparts. Among the key players, PNB has shown a strong reversal after a nearly seven-month corrective phase. The stock has regained all its critical moving averages, bolstering its positive outlook. Its chart pattern suggests a steady upward trend in the coming sessions.\u003csmall\u003e \u003c/small\u003e \u003cem\u003e\u003cstrong\u003e(This article is by Ajit Mishra, SVP-research at Religare Broking Limited. Views expressed are his own.)\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-05T06:14:29+05:30",
  "modifiedTime": null
}
