{
  "id": "358d9229-f8ca-4ba0-89fd-35aa00b4c846",
  "title": "Elon Musk gets more bad news as rival launches the anti-Tesla",
  "link": "https://finance.yahoo.com/news/elon-musk-gets-more-bad-223700109.html",
  "description": "",
  "author": "",
  "published": "2025-04-28T22:37:00Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Samuel O'Brient",
  "length": 2772,
  "excerpt": "Another titan of industry is gunning hard for Musk's market share.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: Despite the bump that it received last week after Elon Musk’s earnings announcement, Tesla  (TSLA)  is still facing an uphill battle. Shares kicked off this week by falling, suggesting that the stock’s momentum may be short-lived. With Musk announcing that he plans on cutting back his work with the Department of Government Efficiency (DOGE), many investors rejoiced, and the market reacted well, despite the vagueness of Musk’s statement. Now it seems that the hype is already cooling off, just a few days later. 💵💰Don't miss the move: Subscribe to TheStreet's free daily newsletter 💰💵 TSLA stock still has quite a bit of ground to make up, having declined more than 27% year-to-date (YTD). Given the company’s disappointing Q1 earnings report, the company will need to show investors that it is capable of turning things around. Unfortunately for Tesla, one of its key markets is getting even more crowded. One of Musk’s biggest rivals has a new venture that could mean extremely bad news. Tesla CEO Elon Musk may soon have even one more problem on his hands.Image source: TheStreet/Getty As Tesla’s earnings revealed, the company has been having a lot of trouble selling its cars. While the electric vehicle (EV) market remains robust, consumer sentiment toward Tesla has severely compromised its growth on a global scale, as backlash for Musk’s political affiliations continues to spread. One product that has proven difficult to move is the Cybertruck. Musk hyped Tesla’s futuristic pickup truck as the company prepared to roll it out. But as TheStreet recently reported, photos have shown that Tesla is storing a shocking amount of these vehicles in parking lots, clearly unable to sell them. Related: Key analyst believes Tesla and Elon Musk are running out of time Now the market for electric trucks has a key player, one who is already competing with Musk on multiple fronts. Amazon founder Jeff Bezos is backing a fast-growing EV startup called Slate Auto that is advertising customizable electric pickups with a significantly lower price tag than the Cybertruck. Founded in 2022, the startup operated in stealth mode until this year, busting onto the scene with a splash that turned many heads, likely including Musk’s. The least expensive Cybertruck is currently priced at roughly $69,990, whereas Slate’s electric trucks start at only $25,000, a price that falls below $20,000 with EV tax credits. Slate CEO Chris Barman is a mechanical engineer who spent the bulk of her career at Chrysler, helping the company scale multiple operations. She believes that her team is uniquely positioned to create an affordable electric truck that other companies cannot, highlighting their innovative modeling and design work.",
  "image": "https://media.zenfs.com/en/thestreet_881/e8fc768128f03d43407be467b27d1e25",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e   \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e  \u003cp\u003eDespite the bump that it received last week after Elon Musk’s earnings announcement, Tesla \u003cspan\u003e (\u003cstrong\u003e\u003ca href=\"https://finance.yahoo.com/quote/TSLA\" data-ylk=\"slk:TSLA;elm:context_link;itc:0;sec:content-canvas\"\u003eTSLA\u003c/a\u003e\u003c/strong\u003e) \u003c/span\u003e is still facing an uphill battle. Shares kicked off this week by falling, suggesting that the stock’s momentum may be short-lived.\u003c/p\u003e  \u003cp\u003eWith Musk announcing that he plans on cutting back his work with the Department of Government Efficiency (DOGE), many investors rejoiced, and the market reacted well, despite the vagueness of Musk’s statement. Now it seems that the hype is already cooling off, just a few days later.\u003c/p\u003e    \u003cp\u003e💵💰\u003ca href=\"https://www.thestreet.com/newsletters?utm_source=article\u0026amp;utm_medium_top\u0026amp;utm_campaign=amazing_race\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Don\u0026#39;t miss the move: Subscribe to TheStreet\u0026#39;s free daily newsletter;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cstrong\u003eDon\u0026#39;t miss the move: Subscribe to TheStreet\u0026#39;s free daily newsletter\u003c/strong\u003e\u003c/a\u003e 💰💵\u003c/p\u003e  \u003cp\u003eTSLA stock still has quite a bit of ground to make up, having declined more than 27% year-to-date (YTD). Given the company’s disappointing Q1 earnings report, the company will need to show investors that it is capable of turning things around.\u003c/p\u003e  \u003cp\u003eUnfortunately for Tesla, one of its key markets is getting even more crowded. One of Musk’s biggest rivals has a new venture that could mean extremely bad news.\u003c/p\u003e  \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"Tesla CEO Elon Musk may soon have even one more problem on his hands.Image source\u0026amp;colon; TheStreet\u0026amp;sol;Getty\" loading=\"eager\" height=\"540\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eTesla CEO Elon Musk may soon have even one more problem on his hands.Image source: TheStreet/Getty  \u003c/figcaption\u003e \u003c/figure\u003e    \u003cp\u003e\u003cbr/\u003eAs Tesla’s earnings revealed, the company has been having a lot of trouble selling its cars. While the electric vehicle (EV) market remains robust, consumer sentiment toward Tesla has severely compromised its growth on a global scale, as backlash for Musk’s political affiliations continues to spread.\u003c/p\u003e    \u003cp\u003eOne product that has proven difficult to move is the Cybertruck. Musk hyped Tesla’s futuristic pickup truck as the company prepared to roll it out. But as TheStreet recently reported, \u003ca href=\"https://finance.yahoo.com/news/shocking-photos-reveal-teslas-potential-213700759.html\" data-ylk=\"slk:photos have shown;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003ephotos have shown\u003c/a\u003e that Tesla is storing a shocking amount of these vehicles in parking lots, clearly unable to sell them.\u003c/p\u003e  \u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://finance.yahoo.com/news/analyst-flags-major-tesla-problems-153300234.html\" data-ylk=\"slk:Related: Key analyst believes Tesla and Elon Musk are running out of time;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eRelated: Key analyst believes Tesla and Elon Musk are running out of time\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e  \u003cp\u003eNow the market for electric trucks has a key player, one who is already competing with Musk on multiple fronts. Amazon founder Jeff Bezos is backing a fast-growing EV startup called Slate Auto that is advertising customizable electric pickups with a significantly lower price tag than the Cybertruck.\u003c/p\u003e    \u003cp\u003eFounded in 2022, the startup operated in stealth mode until this year, busting onto the scene with a splash that turned many heads, likely including Musk’s. The least expensive Cybertruck is currently priced at roughly $69,990, whereas Slate’s electric trucks start at only $25,000, a price that falls below $20,000 with EV tax credits.\u003c/p\u003e  \u003cp\u003eSlate CEO Chris Barman is a mechanical engineer who spent the bulk of her career at Chrysler, helping the company scale multiple operations. She believes that her team is uniquely positioned to create an affordable electric truck that other companies cannot, highlighting their innovative modeling and design work.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e      \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-679c5f35-8e7e-4562-b011-30021812fd32\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-f61711a5-6513-3433-9eeb-8fd675dc1c37\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-702af2a0-d96e-3f36-b5e0-2cee0129268e\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-e5fc339c-5d65-3b85-bdab-7b6a0b8cfc2a\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-c749e01b-02ad-48ab-a87e-adcdbc5de486\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-d2d6ecca-1ef8-3384-91cf-5cbf50090f71\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-04b0c46f-1411-3925-9ad4-792552f393ac\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-28T22:37:00Z",
  "modifiedTime": null
}
