{
  "id": "39dcebce-a2eb-4148-9d40-201a559bc946",
  "title": "Republic Services targets $16.85B-$16.95B revenue for 2025 while advancing digital tools and sustainability projects",
  "link": "https://seekingalpha.com/news/4408314-republic-services-targets-16_85b-16_95b-revenue-for-2025-while-advancing-digital-tools-and?utm_source=feed_news_all\u0026utm_medium=referral\u0026feed_item_type=news",
  "description": "",
  "author": "",
  "published": "Thu, 13 Feb 2025 20:00:17 -0500",
  "source": "https://seekingalpha.com/market_currents.xml",
  "categories": [
    "rsg"
  ],
  "byline": "SA Transcript Insights Editor",
  "length": 1098,
  "excerpt": "Explore Republic Services' strong Q4 2024 financial results, digital innovations, and robust 2025 growth outlook with disciplined pricing and sustainability...",
  "siteName": "Seeking Alpha",
  "favicon": "https://seekingalpha.com/samw/static/images/favicon-192x192.png",
  "text": "Earnings Call Insights: Republic Services (NYSE:RSG) Q4 2024 Management View CEO Jon Vander Ark highlighted that Republic Services concluded 2024 strongly, surpassing full-year guidance on adjusted EBITDA, EPS, and free cash flow. The company achieved 7% revenue growth, 12% adjusted EBITDA growth, and expanded adjusted EBITDA margins by Seeking Alpha's Disclaimer: The earnings call insights are compilations of earnings call transcripts and other content available on the Seeking Alpha website. The insights are generated by an AI tool and have not been curated or reviewed by editors. Due to inherent limitations in using AI-based tools, the accuracy, completeness, or timeliness of the earnings call insights cannot be guaranteed. Please see full earnings call transcripts here. The earnings call insights are intended for informational purposes only. Seeking Alpha does not take account of your objectives or your financial situation and does not offer any personalized investment advice. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.",
  "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-test-id=\"card-container\"\u003e\u003cheader\u003e\u003c/header\u003e\u003cdiv data-test-id=\"content-container\"\u003e\u003cp\u003eEarnings Call Insights: Republic Services (\u003cspan\u003eNYSE:\u003ca href=\"https://seekingalpha.com/symbol/RSG\" title=\"Republic Services, Inc.\"\u003eRSG\u003c/a\u003e\u003c/span\u003e) Q4 2024\u003c/p\u003e \u003ch3\u003eManagement View\u003c/h3\u003e \u003cul\u003e \u003cli\u003e\u003cp\u003eCEO Jon Vander Ark highlighted that Republic Services concluded 2024 strongly, surpassing full-year guidance on adjusted EBITDA, EPS, and free cash flow. The company achieved 7% revenue growth, 12% adjusted EBITDA growth, and expanded adjusted EBITDA margins by\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eSeeking Alpha\u0026#39;s Disclaimer: \u003c/strong\u003eThe earnings call insights are compilations of earnings call transcripts and other content available on the Seeking Alpha website. The insights are generated by an AI tool and have not been curated or reviewed by editors. Due to inherent limitations in using AI-based tools, the accuracy, completeness, or timeliness of the earnings call insights cannot be guaranteed. Please see full earnings call transcripts \u003ca href=\"https://seekingalpha.com/symbol/RSG/earnings/transcripts\"\u003ehere\u003c/a\u003e. The earnings call insights are intended for informational purposes only. Seeking Alpha does not take account of your objectives or your financial situation and does not offer any personalized investment advice. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-14T01:00:17Z",
  "modifiedTime": null
}
