{
  "id": "5112b240-3056-471c-a976-18c133d94af8",
  "title": "What are junk fees — and how can you avoid them?",
  "link": "https://finance.yahoo.com/personal-finance/credit-cards/article/what-are-junk-fees-233042252.html",
  "description": "",
  "author": "",
  "published": "2024-03-22T23:30:42Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Kendall Little",
  "length": 5676,
  "excerpt": "Late fees aren't the only fees that may be hiding in your monthly credit card statements. Here’s what you need to know about junk fees.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Credit card issuers can no longer charge “excessive” late fees for credit cards, thanks to a recent ruling from the Consumer Financial Protection Bureau (CFPB). Previously, a late payment may have cost you upwards of $30. Now? You won’t pay more than $8. The agency said late payment fees grow larger and larger each year and cost cardholders billions. They’re one example of “junk fees” currently overrunning our economy, according to the White House. While capping late fees could save you money over time, they’re not the only credit card fees that may be hiding in your monthly statements. As consumers, we pay fees all the time — for any number of transactions, services, and other parts of daily life. When companies charge unnecessary fees or aren’t transparent about the amount, they’re more likely junk fees. Junk fees can increase the real cost of borrowing money or paying for a good or service. They also make it more difficult for you to compare different options fairly, according to the CFPB. A recent White House memo describes them similarly: “These junk fees, which are often not disclosed upfront and only revealed after a consumer has decided to buy something, obscure true prices and dilute the forces of market competition that are the bedrock of the U.S economy.” The junk fees under scrutiny from the government can be found across many industries. They include everything from service fees from online ticket sellers, for example, which don’t appear until you’re ready to check out, to overdraft and non-sufficient funds fees charged by your bank. If you’ve ever bought a house, you may have also encountered junk fees in the form of closing costs — added charges for inspections, insurance, and more can vary and make the actual cost of taking on a mortgage loan much higher than you initially anticipated. The latest moves to mitigate late fees may offer savings for consumers, but these aren’t the only credit card fees that can cost you. When you don’t pay at least the minimum toward your card balance by the due date, you may be charged a late fee. Until now, these fees often range up to $40 per late payment. On average, late fees from major issuers were $32, according to the CFPB. Late fees now are capped at $8 and there’s no longer an annual inflation adjustment — so issuers cannot increase late fees from that amount year after year. Returned payment fees: Like late fees, returned payment fees are a type of penalty fee charged by your issuer. If you make a payment from a bank account without enough funds to cover the payment amount, you could be issued a returned payment fee. These fees can also range up to $40 per charge. Foreign transaction fees are a common credit card fee that applies to purchases you make abroad or purchases with businesses based in other countries. Typically, these fees range from 1% to 3% of each foreign transaction. Balance transfers can be a useful tool for paying off debt without interest, but you should be aware of the potential fee cost before you decide to transfer a balance. These fees are often expressed as the greater of a percentage of your balance (3% to 5%) or a flat fee ($5 to $10). When you need to borrow cash from your credit line, you can incur a cash advance fee. Because of the cost—which includes both the fee and a cash advance APR—cash advances are risky and best used as a last resort. Like balance transfers, cash advance fees are often charged as the greater of either a percentage of the cash you withdraw (3% to 5%, for example) or a flat fee ($5 to $10). There are no shortage of fees that your credit card company may charge. But there are also ways to avoid paying them altogether. The most important thing you can do to avoid credit card fees is read and understand your card's terms and conditions. Within these terms, you’ll find all of the fees you may be charged by your issuer and exactly how much they can cost. Some fees also depend on your individual card. Foreign transaction fees, for example, are often waived on travel rewards credit cards. If you travel internationally often and want to use your card for spending, you may want to open a card with no foreign transaction fees as a benefit. Another important way to avoid fees (including junk fees like late fees) is to practice good credit habits. If you pay your credit card balance on time each month — even better, pay your balance in full — you can avoid many fees associated with credit cards. You won’t incur late fees as long as you pay by the due date, for example. You can avoid returned payment fees by making sure the account you use to pay has enough money to cover your balance. You can also avoid balance transfer fees by not taking on any debt that requires a balance transfer in the first place. Avoiding credit card fees generally involves two best practices: finding the right card for your goals and spending and practicing good credit habits that will help you avoid debt and build a great credit score over time. This article was edited by Rebecca McCracken Editorial Disclosure: The information in this article has not been reviewed or approved by any advertiser. All opinions belong solely to Yahoo Finance and are not those of any other entity. The details on financial products, including card rates and fees, are accurate as of the publish date. All products or services are presented without warranty. Check the bank’s website for the most current information. This site doesn't include all currently available offers. Credit score alone does not guarantee or imply approval for any financial product.",
  "image": "https://s.yimg.com/ny/api/res/1.2/gGcYKRGvF9F.X2FYpbSWDw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04ODA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-03/7c1ca770-e8a3-11ee-bf97-38014d03f659",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e   \u003cp\u003eCredit card issuers can no longer charge “excessive” late fees for credit cards, thanks to a recent ruling from the \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.consumerfinance.gov/about-us/newsroom/cfpb-bans-excessive-credit-card-late-fees-lowers-typical-fee-from-32-to-8/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Consumer Financial Protection Bureau (CFPB);cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eConsumer Financial Protection Bureau (CFPB)\u003c/a\u003e. Previously, a late payment may have cost you upwards of $30. Now? You won’t pay more than $8.\u003c/p\u003e   \u003cp\u003eThe agency said late payment fees grow larger and larger each year and cost cardholders billions. They’re one example of “junk fees” currently overrunning our economy, according to the White House.\u003c/p\u003e   \u003cp\u003eWhile capping late fees could save you money over time, they’re not the only credit card fees that may be hiding in your monthly statements.\u003c/p\u003e      \u003cp\u003eAs consumers, we pay fees all the time — for any number of transactions, services, and other parts of daily life. When companies charge unnecessary fees or aren’t transparent about the amount, they’re more likely junk fees.\u003c/p\u003e   \u003cp\u003eJunk fees can increase the real cost of borrowing money or paying for a good or service. They also make it more difficult for you to compare different options fairly, \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.consumerfinance.gov/about-us/blog/hidden-cost-junk-fees/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:according to the CFPB;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eaccording to the CFPB\u003c/a\u003e.\u003c/p\u003e   \u003cp\u003eA \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.whitehouse.gov/wp-content/uploads/2023/03/WH-Junk-Fees-Guide-for-States.pdf\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:recent White House memo;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003erecent White House memo\u003c/a\u003e describes them similarly: “These junk fees, which are often not disclosed upfront and only revealed after a consumer has decided to buy something, obscure true prices and dilute the forces of market competition that are the bedrock of the U.S economy.”\u003c/p\u003e      \u003cp\u003eThe junk fees under scrutiny from the government can be found across many industries. They include everything from service fees from online ticket sellers, for example, which don’t appear until you’re ready to check out, to overdraft and non-sufficient funds fees charged by your bank.\u003c/p\u003e   \u003cp\u003eIf you’ve ever bought a house, you may have also encountered junk fees in the form of\u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://finance.yahoo.com/personal-finance/mortgages/article/closing-costs-031706677.html\" data-ylk=\"slk:closing costs;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e closing costs\u003c/a\u003e — added charges for inspections, insurance, and more can vary and make the actual cost of taking on a \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://finance.yahoo.com/personal-finance/mortgages/article/what-is-a-mortgage-212429727.html\" data-ylk=\"slk:mortgage loan;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003emortgage loan\u003c/a\u003e much higher than you initially anticipated.\u003c/p\u003e      \u003cp\u003eThe latest moves to mitigate late fees may offer savings for consumers, but these aren’t the only credit card fees that can cost you.\u003c/p\u003e      \u003cp\u003eWhen you don’t pay at least the minimum toward your card balance by the due date, you may be charged a late fee. Until now, these fees often range up to $40 per late payment. On average, late fees from major issuers were $32, according to the CFPB. Late fees now are \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://www.consumerfinance.gov/about-us/newsroom/cfpb-bans-excessive-credit-card-late-fees-lowers-typical-fee-from-32-to-8/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:capped at $8;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ecapped at $8\u003c/a\u003e and there’s no longer an annual inflation adjustment — so issuers cannot increase late fees from that amount year after year.\u003c/p\u003e   \u003cp\u003eReturned payment fees: Like late fees, returned payment fees are a type of penalty fee charged by your issuer. If you make a payment from a bank account without enough funds to cover the payment amount, you could be issued a returned payment fee. These fees can also range up to $40 per charge.\u003c/p\u003e      \u003cp\u003eForeign transaction fees are a common credit card fee that applies to purchases you make abroad or purchases with businesses based in other countries. Typically, these fees range from 1% to 3% of each foreign transaction.\u003c/p\u003e      \u003cp\u003eBalance transfers can be a useful tool for paying off debt without interest, but you should be aware of the potential fee cost before you decide to transfer a balance. These fees are often expressed as the greater of a percentage of your balance (3% to 5%) or a flat fee ($5 to $10).\u003c/p\u003e      \u003cp\u003eWhen you need to borrow cash from your credit line, you can incur a cash advance fee. Because of the cost—which includes both the fee and a cash advance APR—cash advances are risky and best used as a last resort. Like balance transfers, cash advance fees are often charged as the greater of either a percentage of the cash you withdraw (3% to 5%, for example) or a flat fee ($5 to $10).\u003c/p\u003e         \u003cp\u003eThere are no shortage of fees that your credit card company may charge. But there are also ways to avoid paying them altogether.\u003c/p\u003e   \u003cp\u003eThe most important thing you can do to avoid credit card fees is read and understand your card\u0026#39;s terms and conditions. Within these terms, you’ll find all of the fees you may be charged by your issuer and exactly how much they can cost.\u003c/p\u003e   \u003cp\u003eSome fees also depend on your individual card. Foreign transaction fees, for example, are often waived on \u003ca data-i13n=\"cpos:7;pos:1\" href=\"https://finance.yahoo.com/personal-finance/credit-cards/article/best-travel-rewards-credit-card-172745542.html\" data-ylk=\"slk:travel rewards credit cards;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003etravel rewards credit cards\u003c/a\u003e. If you travel internationally often and want to use your card for spending, you may want to \u003ca data-i13n=\"cpos:8;pos:1\" href=\"https://finance.yahoo.com/personal-finance/credit-cards/article/best-credit-cards-no-foreign-transaction-fees-234302581.html\" data-ylk=\"slk:open a card with no foreign transaction fees;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eopen a card with no foreign transaction fees\u003c/a\u003e as a benefit.\u003c/p\u003e   \u003cp\u003eAnother important way to avoid fees (including junk fees like late fees) is to \u003ca data-i13n=\"cpos:9;pos:1\" href=\"https://finance.yahoo.com/personal-finance/credit-cards/article/how-to-use-a-credit-card-responsibly-200559278.html\" data-ylk=\"slk:practice good credit habits;cpos:9;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003epractice good credit habits\u003c/a\u003e. If you pay your credit card balance on time each month — even better, pay your balance in full — you can avoid many fees associated with credit cards.\u003c/p\u003e   \u003cp\u003eYou won’t incur late fees as long as you pay by the due date, for example. You can avoid returned payment fees by making sure the account you use to pay has enough money to cover your balance. You can also avoid balance transfer fees by not taking on any debt that requires a balance transfer in the first place.\u003c/p\u003e   \u003cp\u003eAvoiding credit card fees generally involves two best practices: finding the right card for your goals and spending and practicing good credit habits that will help you avoid debt and build a great credit score over time.\u003c/p\u003e      \u003cp\u003e\u003cem\u003eThis article was edited by \u003c/em\u003e\u003ca data-i13n=\"cpos:10;pos:1\" href=\"https://www.yahoo.com/author/rebecca-mccracken/\" data-ylk=\"slk:Rebecca McCracken;cpos:10;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eRebecca McCracken\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e   \u003chr/\u003e   \u003cp\u003e\u003cem\u003eEditorial Disclosure: The information in this article has not been reviewed or approved by any advertiser. All opinions belong solely to Yahoo Finance and are not those of any other entity. The details on financial products, including card rates and fees, are accurate as of the publish date. All products or services are presented without warranty. Check the bank’s website for the most current information. This site doesn\u0026#39;t include all currently available offers. Credit score alone does not guarantee or imply approval for any financial product.\u003c/em\u003e\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-03-22T23:30:42Z",
  "modifiedTime": null
}
