{
  "id": "66e63096-6ef1-4402-99bf-a6e9be8ae8f1",
  "title": "Vedanta aims to increase production across segments: Chairman Anil Agarwal",
  "link": "https://www.business-standard.com/companies/news/vedanta-aims-to-increase-production-across-segments-chairman-anil-agarwal-124111600749_1.html",
  "description": "In the near future, Vedanta is aiming to double the production levels of its subsidiary Hindustan Zinc, increase oil production at Cairn Oil \u0026 Gas to 3 lakh barrels of oil equivalent per day",
  "author": "",
  "published": "Sat, 16 Nov 2024 21:51:14 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 1454,
  "excerpt": "Vedanta Chairman Anil Agarwal on Saturday said the metal and mining conglomerate looks to increase production across segments including crude oil and zinc.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "He also termed the closure of Tuticorin copper plant in Tamil Nadu as one of his smallest failures as a businessman. | File Photo: Bloomberg2 min read Last Updated : Nov 16 2024 | 9:51 PM IST Vedanta Chairman Anil Agarwal on Saturday said the metal and mining conglomerate is aiming for significant production increases across key segments, including crude oil, zinc, and aluminium. \"We are going to produce five hundred thousand barrels of oil and gas...so many other things they are doing, but these are the major thing for me to do...\" Agarwal said during his address at the HT Leadership Summit 2024. He also termed the closure of Tuticorin copper plant in Tamil Nadu as one of his smallest failures as a businessman. \"Tuticorin is one of the smallest failures. More failure you have, the more success you will get. This (failure) is the first ladder for your success,\" Agarwal said remembering the incidents that led to the closure of the copper unit. In the near future, Vedanta is aiming to double the production levels of its subsidiary Hindustan Zinc, increase oil production at Cairn Oil \u0026 Gas to 300,000 barrels of oil equivalent per day. Further, the group plans to enhance the capacity of its aluminium smelter operations, expanding output to 3 million tonnes per annum, which would strengthen Vedanta's position as one of the leading aluminium producers in India, Agarwal said in a communication to shareholders recently.  Also Read",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-01/02/thumb/fitandfill/400X400/1704162313-1113.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ci\u003e\u003c/i\u003e\u003cimg src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2024-01/02/full/1704162313-1113.jpg?im=FitAndFill=(826,465)\" title=\"Anil Agarwal, Vedanta Chairman\" alt=\"Anil Agarwal, Vedanta Chairman\" width=\"826\" height=\"465\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHe also termed the closure of Tuticorin copper plant in Tamil Nadu as one of his smallest failures as a businessman. | File Photo: Bloomberg\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e2 min read  Last Updated : Nov 16 2024 | 9:51 PM IST\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tVedanta Chairman Anil Agarwal on Saturday said the metal and mining conglomerate is aiming for significant production increases across key segments, including crude oil, zinc, and aluminium.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;We are going to produce five hundred thousand barrels of oil and gas...so many other things they are doing, but these are the major thing for me to do...\u0026#34; Agarwal said during his address at the HT Leadership Summit 2024.\u003c/p\u003e\n\u003cp\u003e\n\tHe also termed the closure of Tuticorin copper plant in Tamil Nadu as one of his smallest failures as a businessman. \u0026#34;Tuticorin is one of the smallest failures. More failure you have, the more success you will get. This (failure) is the first ladder for your success,\u0026#34; Agarwal said remembering the incidents that led to the closure of the copper unit.\u003c/p\u003e\n\u003cp\u003e\n\tIn the near future, Vedanta is aiming to double the production levels of its subsidiary Hindustan Zinc, increase oil production at Cairn Oil \u0026amp; Gas to 300,000 barrels of oil equivalent per day. Further, the group plans to enhance the capacity of its aluminium smelter operations, expanding output to 3 million tonnes per annum, which would strengthen Vedanta\u0026#39;s position as one of the leading aluminium producers in India, Agarwal said in a communication to shareholders recently.\u003csmall\u003e \u003c/small\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-16T21:51:14+05:30",
  "modifiedTime": null
}
