{
  "id": "6da9fa81-96f8-4f63-b0a7-7e64036a0427",
  "title": "Financial services are pushing up the revenues of the Southeast Asia 500’s most prominent tech startups",
  "link": "https://fortune.com/asia/2025/06/21/sea-grab-goto-southeast-asia-500-financial-services/",
  "description": "Sea, Grab, and GoTo climbed the rankings of the Southeast Asia 500, in part thanks to their fast-growing fintech businesses.",
  "author": "Lionel Lim",
  "published": "Sun, 22 Jun 2025 00:00:00 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Business"
  ],
  "byline": "Lionel Lim",
  "length": 4146,
  "excerpt": "Sea, Grab, and GoTo climbed the rankings of the Southeast Asia 500, in part thanks to their fast-growing fintech businesses.",
  "siteName": "Fortune Asia",
  "favicon": "https://fortune.com/icons/favicons/apple-touch-icon.png",
  "text": "Tech has a tiny presence on the Southeast Asia 500, generating just under 3% of the list’s total revenue. Just one internet company, Sea, sits in the top 20, whereas four such companies sit in the Fortune 500’s top 20.  Yet the region’s most prominent internet platforms all climbed up this year’s rankings. Sea, No. 15, rose five places on this year’s Southeast Asia 500 after growing its revenue by almost 30% year-on-year to reach $16.8 billion.  Singapore’s Grab also rose 24 places, reaching No. 128 on this year’s list, with revenue of $2.8 billion. And fellow ride-hailing platform GoTo, based in Indonesia, jumped 13 spots with sales of $1 billion. All three platforms can cite one particular business for helping drive recent success: financial services. None of these companies started off as truly fintech companies. Sea focuses on gaming and e-commerce, while Grab and GoTo started off with ride-hailing and delivery. But financial services is proving to be a straightforward–and potentially lucrative–path for the region’s tech companies.  Financial services is a small, but quickly growing, part of Sea’s business. Sea’s digital financial services arm, recently rebranded to Monee, grew by almost 35% last year, reaching $2.4 billion. Sea’s carried that momentum into 2025. Monee’s revenue posted year-on-year growth of 57.6% in the first quarter, reaching $787.1 million. As of March 31, 2025, consumer and loans principal outstanding stood at $5.8 billion, up 76.5% from the same period a year ago. Monee launched an e-wallet in 2014, and since then has expanded to services like credit, banking, and insurtech. Most of Sea’s digital financial revenue and operating income is driven by its consumer and small and medium enterprise credit business.  Sea also owns two digital banks: Maribank, which operates in Singapore, and Seabank which operates in Indonesia and the Philippines.  Grab’s financial services was also the ride-hailing platform’s fastest growing business last year, with revenue rising by 44% to reach $253 million. Again, that momentum carried into 2025, with financial services revenue growing by 36% year-on-year in the first quarter.  Like Sea, Grab first started its financial services business with an e-wallet. The company now offers loans to its drivers and merchants partners, and has also expanded into the digital banking space through GXS Bank and GX Bank in Singapore and Malaysia respectively. Grab’s total loans disbursed as of March 31, 2025 reached $566 million, a 56% increase from the same period the year before.  GoTo has also set up its own financial services app, separate from its flagship ride-hailing service Gojek. GoPay, launched in 2023, uses less mobile data than having to use GoPay through the Gojek app, making it easier to access for those with less powerful phones. GoTo also holds a 22% stake in Bank Jago, an Indonesian digital bank.  Revenue for Goto’s financial services unit almost doubled last year, reaching 3.7 trillion Indonesian rupiah ($230 million).  Why invest in financial services? Financial services is still a smaller business for Sea, Grab and GoTo when compared to their main services, but it’s a natural progression for these tech companies as they try to serve a population that’s still largely underbanked. Gross margins for financial services are also often higher compared to their main services offered like e-commerce or ride-hailing. These customers normally present greater risks for traditional financial institutions. But tech platforms argue their data on users, gleaned from their e-commerce or on-demand services, can help build a risk profile that can be used to judge creditworthiness, thereby allowing them to disburse loans to a segment of population that traditional banks may not want to work with.Digital banks offer another way to acquire more customers. Grab, Sea or GoTo can encourage users of their e-wallet services to open a new account with a digital bank. That, in turn, will give these companies more data, and eventually start offering other services like investment and insurance products.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2214520236-e1750409053554.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eTech has a tiny presence on the \u003ca href=\"https://fortune.com/asia/ranking/southeast-asia-500/\" target=\"_self\" aria-label=\"Go to https://fortune.com/asia/ranking/southeast-asia-500/\"\u003eSoutheast Asia 500\u003c/a\u003e, generating just under 3% of the list’s total revenue. Just one internet company, Sea, sits in the top 20, whereas four such companies sit in the Fortune 500’s top 20. \u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eYet the region’s most prominent internet platforms all climbed up this year’s rankings. \u003ca href=\"https://fortune.com/company/sea/\" target=\"_self\" aria-label=\"Go to https://fortune.com/company/sea/\"\u003eSea\u003c/a\u003e, No. 15, rose five places on this year’s Southeast Asia 500 after growing its revenue by almost 30% year-on-year to reach $16.8 billion. \n\n\n\n\u003c/p\u003e\u003cp\u003eSingapore’s \u003ca href=\"https://fortune.com/company/grab-holdings/\" target=\"_self\" aria-label=\"Go to https://fortune.com/company/grab-holdings/\"\u003eGrab\u003c/a\u003e also rose 24 places, reaching No. 128 on this year’s list, with revenue of $2.8 billion. And fellow ride-hailing platform \u003ca href=\"https://fortune.com/company/goto/\" target=\"_self\" aria-label=\"Go to https://fortune.com/company/goto/\"\u003eGoTo\u003c/a\u003e, based in Indonesia, jumped 13 spots with sales of $1 billion.\n\n\n\n\u003c/p\u003e\u003cp\u003eAll three platforms can cite one particular business for helping drive recent success: financial services. None of these companies started off as truly fintech companies. Sea focuses on gaming and e-commerce, while Grab and GoTo started off with ride-hailing and delivery. But financial services is proving to be a straightforward–and potentially lucrative–path for the region’s tech companies. \n\n\n\n\u003c/p\u003e\u003cp\u003eFinancial services is a small, but quickly growing, part of Sea’s business. Sea’s digital financial services arm, \u003ca href=\"https://fortune.com/asia/2025/05/08/sea-rebrand-seamoney-to-monee-fintech/\" target=\"_self\" aria-label=\"Go to https://fortune.com/asia/2025/05/08/sea-rebrand-seamoney-to-monee-fintech/\"\u003erecently rebranded\u003c/a\u003e to Monee, grew by almost 35% last year, reaching $2.4 billion. Sea’s carried that momentum into 2025. Monee’s revenue posted year-on-year growth of 57.6% in the first quarter, reaching $787.1 million. \u003c/p\u003e\u003cp\u003eAs of March 31, 2025, consumer and loans principal outstanding stood at $5.8 billion, up 76.5% from the same period a year ago.\n\n\n\n\u003c/p\u003e\u003cp\u003eMonee launched an e-wallet in 2014, and since then has expanded to services like credit, banking, and insurtech. Most of Sea’s digital financial revenue and operating income is driven by its consumer and small and medium enterprise credit business. \n\n\n\n\u003c/p\u003e\u003cp\u003eSea also owns two digital banks: Maribank, which operates in Singapore, and Seabank which operates in Indonesia and the Philippines. \n\n\n\n\u003c/p\u003e\u003cp\u003eGrab’s financial services was also the ride-hailing platform’s fastest growing business last year, with revenue rising by 44% to reach $253 million. Again, that momentum carried into 2025, with financial services revenue growing by 36% year-on-year in the first quarter. \n\n\n\n\u003c/p\u003e\u003cp\u003eLike Sea, Grab first started its financial services business with an e-wallet. The company now offers loans to its drivers and merchants partners, and has also expanded into the digital banking space through GXS Bank and GX Bank in Singapore and Malaysia respectively. \u003c/p\u003e\u003cp\u003eGrab’s total loans disbursed as of March 31, 2025 reached $566 million, a 56% increase from the same period the year before. \n\n\n\n\u003c/p\u003e\u003cp\u003eGoTo has also set up its own financial services app, separate from its flagship ride-hailing service Gojek. GoPay, launched in 2023, uses less mobile data than having to use GoPay through the Gojek app, making it easier to access for those with less powerful phones. GoTo also holds a 22% stake in Bank Jago, an Indonesian digital bank. \n\n\n\n\u003c/p\u003e\u003cp\u003eRevenue for Goto’s financial services unit almost doubled last year, reaching 3.7 trillion Indonesian rupiah ($230 million). \n\n\n\n\u003c/p\u003e\u003ch2\u003eWhy invest in financial services?\u003c/h2\u003e\n\n\n\n\u003cp\u003eFinancial services is still a smaller business for Sea, Grab and GoTo when compared to their main services, but it’s a natural progression for these tech companies as they try to serve a population that’s still largely underbanked. Gross margins for financial services are also often higher compared to their main services offered like e-commerce or ride-hailing.\n\n\n\n\u003c/p\u003e\u003cp\u003eThese customers normally present greater risks for traditional financial institutions. But tech platforms argue their data on users, gleaned from their e-commerce or on-demand services, can help build a risk profile that can be used to judge creditworthiness, thereby allowing them to disburse loans to a segment of population that traditional banks may not want to work with.\u003c/p\u003e\u003cp\u003eDigital banks offer another way to acquire more customers. Grab, Sea or GoTo can encourage users of their e-wallet services to open a new account with a digital bank. That, in turn, will give these companies more data, and eventually start offering other services like investment and insurance products. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
