{
  "id": "6e17c64b-0115-4009-8784-a953b89b3f90",
  "title": "Car dealer who will be US Senator says he and Trump want to overhaul car industry",
  "link": "https://www.yahoo.com/news/car-dealer-us-senator-says-171032870.html",
  "description": "",
  "author": "",
  "published": "2024-11-08T17:10:32Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Jamie L. LaReau and Eric D. Lawrence, Detroit Free Press",
  "length": 23182,
  "excerpt": "Senator-elect Bernie Moreno, a former car dealer and U-M grad, has President-elect Trump's ear. Here are their proposed changes to the car industry.",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "The first car dealer ever elected to the U.S. Senate says the Trump agenda for the U.S. auto industry is one that, if enacted, would upend the strategy Detroit's automakers have spent billions of dollars pursuing: The transition to electric cars.For one thing, Republicans will look to freeze fuel economy standards for at least a decade — which would slow EV adoption and anger environmentalists. A second Donald Trump administration may also look to take away California's ability to set its own strict emissions standards. Also, it is likely to repeal parts of the Inflation Reduction Act, including the $7,500 tax credit consumers receive now toward the purchase of an EV, a benefit that's helped the Detroit automakers sell the cars.Trump's agenda could also include rewarding companies with big tax breaks if they build cars in the United States. These initiatives were laid out to the Detroit Free Press in an exclusive interview with Bernie Moreno, a former car dealer who won election Tuesday to the U.S. Senate from Ohio. Moreno said he and Trump, who endorsed each other, have discussed the industry and \"I think we are on the same page here.\"U.S. Sen.-elect Bernie Moreno, R-Ohio, speaks at the Republican National Convention, at the Fiserv Forum in Milwaukee on July 16, 2024.The ideas are eye-popping considering General Motors has set 2035 as the date to be all-electric. Ford Motor Co. and Stellantis also have aggressive targets to add electrification to their lineups over the next decade. Industry watchers have warned that government action to slow EV research and production will ultimately leave American automakers behind as the world electrifies automotive transportation.Environmental activists expressed alarm.\"Gutting the clean car standards makes no sense for drivers and their wallets, autoworkers or really anyone who breathes,\" said Kathy Harris, director for clean vehicles at Natural Resources Defense Council. \"The vehicle standards are the largest single action taken to address climate change, cutting as much carbon pollution as the entire U.S. economy now emits annually. With climate-fueled storms and heat waves harming so many already, the only winners would be Trump’s donors in the oil industry, as drivers would pay more at the pump.”But Moreno, 57, backed by more than 1,000 auto dealers in a campaign that cost him and his rival, incumbent Democrat Sherrod Brown, a record $500 million, said the industry must focus on cars that people want to buy and can afford.Ignoring market and making 'cars people don't want'Moreno touched on several topics, most notably his issue with automakers pushing out EVs to meet what he said are unrealistic government fuel economy standards. That, he said, is causing sky-high prices for gasoline vehicles so companies can offset the billions they are losing by producing EVs. According to Kelley Blue Book, the average transaction price for a new vehicle in the U.S. was $48,397 in September.\"Anybody who even has a (basic) understanding of how the automobile industry works in America would tell you that the secret sauce is the marketplace,\" Moreno said Thursday, noting that sales signal to automakers what consumers want and don't want.\"But for the first time in automotive history, car companies decided, 'We’re not going to pay attention to our customers. We’re going to pay attention to our political leaders and make cars people don’t want,' \" Moreno said. \"The money that has been wasted and lost in this … move to electric vehicles is just absolutely insane. Ford has lost billions of dollars trying to pacify political leaders that were completely unqualified to be giving any kind of advice.”Ford's EV division, called Ford Model e, lost $1.2 billion in pretax profits during the third quarter and is expected to lose about $5 billion by the year's end.While EVs are not yet profitable, GM has promised Wall Street it would get its EVs to a variable profit position — meaning the revenue GM earns from selling the vehicle exceeds the direct cost of producing it — by year-end.Kelley Blue Book reported 346,309 EVs were sold in the third quarter in the country, a 7.8% increase from the year-ago quarter and putting the EV share of sales at 8.9%, the highest level recorded. But EV sales are still not growing at the pace the industry had been expecting, and Moreno's contention is that most EV sales are being driven by incentives such as the $7,500 federal tax credit.Making an 'American automotive renaissance'Moreno, the first car dealer elected to the Senate, is a 1989 graduate of the University of Michigan with a bachelor's degree in business administration.He said he and President-elect Trump share the same vision for overhauling the American auto industry: They want to create more jobs, bring down prices of new vehicles, repeal many of the environmental regulations that are driving automakers' aggressive EV push and keep foreign-built cars offshore with high barriers to entry.The plan includes lowering energy prices and incentivizing automakers to shift all manufacturing to the United States.\"We’re going to have an American energy and American automotive renaissance in this country unlike anything you’ve seen,\" Moreno said.Ohio car dealer Bernie Moreno works with Ohio Treasurer Josh Mandel, left, to pay some state business taxes with Bitcoin in November 2018.He noted that all the initiatives would have to pass through Congress and Trump would have to support them as well, but Moreno said the two are like-minded.It's \"the reason President Trump endorsed me and I endorsed President Trump,\" Moreno said. A Trump spokesperson had not responded Friday morning to a message seeking comment.Keeping China's 'garbage cars' offshoreThat includes the idea of doing whatever it takes to ensure vehicles are made in America, not China or Mexico and then imported here.\"The minute that China thinks they can come here with their cheap, fully electric garbage cars … they’re sadly mistaken. These cars will come in here with dramatically high tariffs that will make those cars unsellable,\" Moreno said. \"We’re not going to be suckers anymore. We’re going to protect American workers and American jobs.”Industry watchers have praised the quality of cars and their advanced battery technology produced by China's BYD, which late last year briefly slipped ahead of Tesla in global EV sales.Trump has said he would impose a 10% to 20% tariff, the taxes put on goods coming into a country, on all imports, including tariffs as high as 60% to 100% for goods from China. Moreno said if some auto parts can't be made here, \"we're not going to tariff those things immediately,\" but anything that can be made here should be made here, he said.\"Look, Lincoln has decided to make a lot of its cars in China and that’s a bad decision,\" Moreno said. \"They’re going to find that it’s a very bad decision. They should be making those cars here.\"Ford builds the Lincoln Nautilus in China and GM builds its Buick Envision in China, both SUVs that are sold in the United States. All three Detroit automakers build various vehicles in Mexico that are sold in the U.S.Ford said that over the past five years, it has exported more vehicles made in America to China than the other way around. Also, while its luxury brand, Lincoln, imports one model into the U.S., Ford has exported many more models, such as F-150, Mustang, Bronco, Explorer and Lincoln Continental, Aviator and Navigator.Ford spokeswoman Robyn Jackson said in a statement to the Free Press, \"Ford has bet on U.S. production and American workers more than any other automaker. As the No. 1 automaker in terms of production, employment and exporting vehicles from the USA to other markets, we look forward to working with the new administration and new Congress on policies that will ensure a thriving American auto industry and manufacturing sector. We are committed to offering customers the freedom of choice — great gas, hybrid and electric vehicles.”Stern words for StellantisMoreno also had stern words for another member of the Detroit Three, noting that “companies like, Stellantis, which the United States government handed Chrysler Corp. for free in essence, they are laying off workers and shipping our jobs to Mexico. CEO Carlos Tavares needs to understand the United States government is not going to allow him to gut Chrysler, and Jeep, and Dodge, and Ram, and ship those cars and the direction overseas, in managing a company that was handed to them for free, which never should have been done.”Moreno was referencing the way Chrysler came to be part of Stellantis predecessor Fiat Chrysler Automobiles in connection with the company's 2009 bankruptcy.Stellantis has come under fire for numerous job cuts this year as it has struggled to manage its inventory levels, and on Wednesday announced it would eliminate a shift at the Toledo Assembly Complex, meaning layoffs for 1,100 workers. The company has also confirmed it is expanding its truck plant in Saltillo, Mexico.Jodi Tinson, a spokeswoman for Stellantis, said in a statement to the Free Press: \"Stellantis congratulates Senator-elect Bernie Moreno on his election to the U.S. Senate. Because Toledo, Ohio, is an important part of our manufacturing footprint as the production home of the iconic Jeep Wrangler and Jeep Gladiator sold worldwide, we look forward to working with the senator-elect on policies that support a strong and competitive manufacturing base in the U.S.\"Old GM plant is symbolic of what needs to happen nextA native of Colombia, Moreno grew up in Florida before attending U-M. He had a dream of working for an automaker and at age 14, wrote a letter to General Motors' then-CEO Roger Smith, suggesting ways Smith could improve the company. Smith wrote a lengthy reply, which Moreno still has, that began: \"It's not often I receive a letter from someone who is planning to take over my job,\" according to a 2017 article on Moreno in Automotive News.After a stint from 1987 to 1993 with then-GM brand Saturn, Moreno segued into auto retail, eventually building an empire of 15 dealerships across Ohio, Kentucky, Massachusetts and Florida that represented 30 brands. In 2017, he told Automotive News his brands generated more than $700 million in annual revenue. But by 2020, he sold all of his car dealerships.Moreno's entrepreneurial drive centered on the car business. In 2018, when GM first announced it would permanently close its Lordstown Assembly plant in northeast Ohio, which built the Chevrolet Cruze sedan, Moreno tried to save it.As the Free Press reported in 2019, Moreno met with GM leaders. He wanted to buy 150,000 to 180,000 Cruze cars to start a global ride-hailing company similar to Uber. GM CEO Mary Barra rejected the idea. GM shuttered Lordstown that spring.At that time, then-President Trump targeted GM and a local UAW president in tweets urging the carmaker to reopen the plant. But GM sold it to electric-truck maker Lordstown Motors that year. Lordstown Motors filed for federal bankruptcy protection in June 2023.Foxconn, a Taiwan-based electronics assembler, now owns the 6.2 million-square-foot auto assembly plant in Lordstown, but it sits idle. Moreno drives past it often and he said it serves inspiration for his U.S. auto industry overhaul plans.\"I want to see that plant producing automobiles again,\" Moreno said. \"It is symbolic of what we need to do. We need to turn things around. That community did everything right. These are people who went to work every single day. They followed the rules, they tried to raise their families, and make ends meet and the rug got pulled out from under them. That’s got to end.”Toyota is poised to win as the EV tax credit goes awayMoreno said he knows Barra and considers her a \"very capable CEO.\"Asked to comment on Moreno's initiatives for the auto industry, GM spokeswoman Liz Winter sent the following statement: \"We look forward to working with Senator-elect Moreno on important issues ahead for the auto industry. GM remains committed to supporting jobs, driving innovation, and keeping America competitive globally. We've invested more than $5.6 billion in GM facilities in Ohio since 2013, including a joint venture with LG Energy Solution that employs 2,200 people and positions the industry for the future.\"Moreno said he is eager to meet Ford CEO Jim Farley and Stellantis CEO Tavares. His closest relationships now are with leaders at Toyota Motor North America, which he said helped organize the coalition of car dealers that supported his Senate run.\"The winner in this whole thing will probably be Toyota because they were the one company that said, ‘We’re just not going to do that,' \" Moreno said. By \"that\" he means follow what he and Trump refer to as the \"EV mandate.\"To be clear: No law or rule forces carmakers to make EVs or consumers to purchase them. Moreno is referring to tightened fuel-economy standards under the Biden administration. The administration ruled earlier this year that new vehicles sold in the U.S. will have to meet a fleet average about 38 mpg by 2031 in real-world driving, up from about 29 mpg, according to The Associated Press.Also, the Environmental Protection Agency has adopted stricter tailpipe-emissions rules. Biden has set a goal for 50% of all sales be EVs by 2030, but it is a target not a mandate.But Moreno said the strict requirements essentially force carmakers to push EVs. He said Toyota bucked the trend and set a model the rest of the industry should follow by investing heavily in hybrids rather than all-electric. Toyota did not respond to a request for comment on this story.“The problem with GM, Ford and Stellantis is that they made the decision to pacify the Biden-Harris administration and not call them out for the ridiculousness of their electric vehicle policies,\" Moreno said. \"Toyota, in listening to their car dealers, they planned to have the cars that consumers wanted. So the big winner now is Toyota because they don’t have to pivot.\"The Detroit Three need to revisit their strategies because the electric vehicle tax credit will likely disappear.\"The United States government — if I have anything to do with it, I’m one of 100 people and President Trump obviously makes a decision on this as well — but my suspicion is that electric vehicle subsidies are gone,\" Moreno said. \"So now there’s no subsidy. You buy an electric vehicle, the car stands on its own.\"Some more proposed changesHere are some more of Moreno's specific proposals:Repealing the emission standards that, in effect, can only be met through selling electric vehicles.Freezing Corporate Average Fuel Economy standards for \\\"at least a decade.\\\"Prohibiting California from following a separate set of emission standards from the rest of the nation.The CAFE standards are part of the Clean Air Act. California gets a waiver to set its own, tougher requirements, which now require that all new vehicles sold there by 2035 be only zero-emission vehicles in an effort to fight pollution and climate change.That influences manufacturers’ vehicle mix because California is the nation’s largest car market. For all of last year, 1.78 million cars were sold in California alone, according to the California New Car Dealers Association.Moreno said it makes sense to hit pause on fuel-economy standards because, \"We hit an incredibly high number, let's pause these requirements for at least a decade to let the marketplace catch up, the technology catch up.\"Katherine García, Sierra Club’s director of Clean Transportation for All, said that won't happen without a fight.“The nation’s clean vehicle standards are a bedrock environmental safeguard that slash an enormous amount of health-threatening pollution, and we are prepared to fight any rollback of them, including threats to CAFE standards and California’s authority to set its own more protective standards,\" she said. \"We’ve been here before, and we have and will fight back against Trump’s extreme anti-environment, anti-middle class agenda and defend and build on the progress we’ve made over the last four years on clean transportation and climate.”Less competitive in global markets, adverse health affectsAbhilasha Bhola, auto supply chain director on the climate team at the consumer advocacy group Public Citizen, warned that Moreno's idea to freeze CAFE standards would hurt communities.“His vision has the potential to turn every auto town in America into a version of what happened to Flint, Michigan, in the 1990s,” she said of a time when numerous auto plants had closed there.With countries in Europe and East Asia continuing to invest in electrification and with CAFE standards supporting electrification here, the U.S. auto industry would suffer if those standards are pulled, she said.”We risk falling further behind other countries and reducing demand for American-made cars abroad,” she said. “Bernie Moreno and Trump's auto policy makes us less competitive in global markets and that causes regular people to face some of the worst impacts.”It would also directly lead to worse health outcomes for Americans, she said.“Doubling down on (internal) combustion engines through reduced efficiency standards is sentencing millions of Americans to dirty air and increased respiratory illness,” she said. “Smog from cars causes incredible health impacts. It means upper respiratory illness. It means people are missing work, school. There’s increased impacts and stress on our healthcare system, and this reduces quality of life.”California’s leadership in reducing harmful emissions is important, she said.“California is also the largest auto market in the country. It’s not just Californians that are impacted by those emissions. That smog travels to other states. So by getting rid of the California waiver and forcing the state to not have stricter standards, it means that the rest of the country suffers, too,” Bhola said.A spokesman for the California Air Resources Board declined comment on what the next Trump administration might do. California Gov. Gavin Newsome on Thursday called a special legislative session to strengthen the state's progressive policies.Despite the possibility that the incoming administration might make such sweeping changes to vehicle standards, Bhola said she doesn’t believe \"all hope is lost.\" It will simply require a shift in focus.“I think there is an opportunity for states and cities to put forward their own environmental regulations,\" she said, noting that those areas can continue to create incentives for EV uptake and to lower emissions and create good jobs.Moreno: Give automakers tax write-off for US wagesAnother proposed agenda item for Moreno is bringing down new vehicle prices, which he said can be done by lowering interest rates as inflation comes down. Also, lowering the regulatory environment for the car companies will help lower prices.\"We need to repeal the part of the infrastructure law that requires all 2026 model-year vehicles to have an alcohol-impairment device each time the car starts,\" Moreno said. \"The reason is very simple: Those of us, like myself, who do not drink alcohol, why am I paying for a device to check my impairment? It adds cost.”But in 2022, more than 13,000 people were killed in incidents related to drunken driving, according to federal statistics. U.S. Rep. Debbie Dingell, D-Ann Arbor, who pushed for the law, said the technology can save lives.Finally, he suggests a new tax code that rewards American companies.“I’ll give you an example, if you’re an American company that employs American workers, maybe you can write off whatever you pay in salaries twice,\" Moreno said. \"So if you pay $10 million in salary and wages, you get an additional $10 million tax write-off. That encourages companies to pay their employees more money.\"But some say the U.S. auto industry would actually sufferSam Fiorani, vice president of global vehicle forecasting for AutoForecast Solutions, questioned the logic behind any plans that would effectively discourage innovation and efficiency improvements, such as California’s ability to set its own emissions standards.“It’s good to have somebody pushing the boundaries of what’s available in the marketplace,” Fiorani said. “Focusing strictly on what the American consumer wants today will make (automakers) less competitive in five to 10 years.”Trump and the economy: How Trump's victory could affect the US economyWhether it’s the incoming administration’s desire to limit what California can do or to freeze fuel economy standards for a decade, the impact would hurt automakers and everyone who depends on them in the long run, Fiorani said.“The global automotive industry is progressing at such a rate at the moment that American companies will be left behind if we concentrate on full-size pickups and SUVs,” Fiorani saidHe noted that he also writes about automotive history and offered a lesson from the past that would appear to have relevance in this discussion.“These cars from the ‘70s that were bloated and only in demand in the United States meant that foreign auto manufacturers could come in here and appeal to the customers with newer products and more efficient products and products that existing companies wouldn’t see as profitable,” he said.American car companies were woefully noncompetitive on a global scale 50 years ago, and pushing for higher fuel economy standards at least pulled them up to the level of the competition, he said. Fiorani warned that electric vehicles and hybridization are the future, and delaying any investments would be detrimental for automakers.As for what gets produced in Mexico, Fiorani said the Detroit Three currently produce a handful of vehicles there and usually for competitive reasons. Bringing all those vehicles to the United States would likely increase prices and decrease the demand for them.Ohio and Michigan will lead the wayMore: Experts: Trump presidency could benefit Detroit automakers, but cost car buyers moreOne of Trump's biggest supporters has been Tesla CEO Elon Musk, and as a reward for it, Trump has promised Musk a quasi-Cabinet position. Moreno said it's a brilliant plan.\"We could take $2 trillion a year in savings out of the federal government, there’s no question in my mind about that,\" Moreno said of Musk. \"We can’t afford the government we have right now.\"He believes Musk would help add efficiency, remove unnecessary departments and rid Washingon of bureaucrats who are \"spinning their wheels.\" He noted how Musk built some 25,000 Tesla charging stations across the country and the U.S. government has still built just a fraction of that.Moreno promises if Trump's autos agenda is enacted, \"It’ll be the golden age of manufacturing in America with Ohio and Michigan leading the way.”Contact Jamie L. LaReau: jlareau@freepress.com. Follow her on Twitter @jlareauan. Read more on General Motors and sign up for our autos newsletter. Become a subscriber.This story has been updated with additional information.This article originally appeared on Detroit Free Press: Senator-elect says he joins Trump in wanting to overhaul car industry",
  "image": "https://s.yimg.com/ny/api/res/1.2/7Uilp_ztl_0E5Cp06IwG9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/usa_today_money_325/687bd423ae23ddf1e2a17e97f883784a",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eThe first car dealer ever elected to the U.S. Senate says the Trump agenda for the U.S. auto industry is one that, if enacted, would upend the strategy Detroit\u0026#39;s automakers have spent billions of dollars pursuing: The transition to electric cars.\u003c/p\u003e\u003cp\u003eFor one thing, Republicans will look to freeze fuel economy standards for at least a decade — which would slow EV adoption and anger environmentalists. A second Donald Trump administration may also look to take away California\u0026#39;s ability to set its own strict emissions standards. Also, it is likely to repeal parts of the Inflation Reduction Act, including the $7,500 tax credit consumers receive now toward the purchase of an EV, a benefit that\u0026#39;s helped the Detroit automakers sell the cars.\u003c/p\u003e\u003cp\u003eTrump\u0026#39;s agenda could also include rewarding companies with big tax breaks if they build cars in the United States. These initiatives were laid out to the Detroit Free Press in an exclusive interview with Bernie Moreno, a former car dealer who won election Tuesday to the U.S. Senate from Ohio. Moreno said he and Trump, who endorsed each other, have discussed the industry and \u0026#34;I think we are on the same page here.\u0026#34;\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"U.S. Sen.-elect Bernie Moreno, R-Ohio, speaks at the Republican National Convention, at the Fiserv Forum in Milwaukee on July 16, 2024.\" loading=\"lazy\" width=\"960\" height=\"640\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/8c13ho5haFyjoSkwTCJYZw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://media.zenfs.com/en/usa_today_money_325/687bd423ae23ddf1e2a17e97f883784a\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cp\u003eU.S. Sen.-elect Bernie Moreno, R-Ohio, speaks at the Republican National Convention, at the Fiserv Forum in Milwaukee on July 16, 2024.\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe ideas are eye-popping considering General Motors has set 2035 as the date to be all-electric. Ford Motor Co. and Stellantis also have aggressive targets to add electrification to their lineups over the next decade. Industry watchers have warned that government action to slow EV research and production will ultimately leave American automakers behind as the world electrifies automotive transportation.\u003c/p\u003e\u003cp\u003eEnvironmental activists expressed alarm.\u003c/p\u003e\u003cp\u003e\u0026#34;Gutting the clean car standards makes no sense for drivers and their wallets, autoworkers or really anyone who breathes,\u0026#34; said Kathy Harris, director for clean vehicles at Natural Resources Defense Council. \u0026#34;The vehicle standards are the largest single action taken to address climate change, cutting as much carbon pollution as the entire U.S. economy now emits annually. With climate-fueled storms and heat waves harming so many already, the only winners would be Trump’s donors in the oil industry, as drivers would pay more at the pump.”\u003c/p\u003e\u003cp\u003eBut Moreno, 57, backed by more than 1,000 auto dealers in a campaign that cost him and his rival, incumbent Democrat Sherrod Brown, a \u003ca href=\"https://www.pbs.org/newshour/politics/republicans-move-closer-to-senate-control-as-trump-backed-bernie-moreno-defeats-incumbent-sen-sherrod-brown-in-ohio\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:record $500 million;elm:context_link;itc:0;sec:content-canvas\"\u003erecord $500 million\u003c/a\u003e, said the industry must focus on cars that people want to buy and can afford.\u003c/p\u003e\u003ch2\u003eIgnoring market and making \u0026#39;cars people don\u0026#39;t want\u0026#39;\u003c/h2\u003e\u003cp\u003eMoreno touched on several topics, most notably his issue with automakers pushing out EVs to meet what he said are unrealistic government fuel economy standards. That, he said, is causing sky-high prices for gasoline vehicles so companies can offset the billions they are losing by producing EVs. According to Kelley Blue Book, the average transaction price for a new vehicle in the U.S. was $48,397 in September.\u003c/p\u003e\u003cp\u003e\u0026#34;Anybody who even has a (basic) understanding of how the automobile industry works in America would tell you that the secret sauce is the marketplace,\u0026#34; Moreno said Thursday, noting that sales signal to automakers what consumers want and don\u0026#39;t want.\u003c/p\u003e\u003cp\u003e\u0026#34;But for the first time in automotive history, car companies decided, \u0026#39;We’re not going to pay attention to our customers. We’re going to pay attention to our political leaders and make cars people don’t want,\u0026#39; \u0026#34; Moreno said. \u0026#34;The money that has been wasted and lost in this … move to electric vehicles is just absolutely insane. Ford has lost billions of dollars trying to pacify political leaders that were completely unqualified to be giving any kind of advice.”\u003c/p\u003e\u003cp\u003eFord\u0026#39;s EV division, called Ford Model e, lost $1.2 billion in pretax profits during the third quarter and is expected to \u003ca href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2024/10/28/third-quarter-2024-financial-results.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:lose about $5 billion by the year\u0026#39;s end;elm:context_link;itc:0;sec:content-canvas\"\u003elose about $5 billion by the year\u0026#39;s end\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWhile EVs are not yet profitable, GM\u003ca href=\"https://www.freep.com/story/money/cars/general-motors/2024/10/22/gm-reports-rise-in-q3-profits-boosting-its-full-year-outlook/75775200007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:has promised Wall Street;elm:context_link;itc:0;sec:content-canvas\"\u003e has promised Wall Street\u003c/a\u003e it would get its EVs to a variable profit position — meaning the revenue GM earns from selling the vehicle exceeds the direct cost of producing it — by year-end.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.coxautoinc.com/market-insights/q3-2024-ev-sales/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Kelley Blue Book reported;elm:context_link;itc:0;sec:content-canvas\"\u003eKelley Blue Book reported\u003c/a\u003e 346,309 EVs were sold in the third quarter in the country, a 7.8% increase from the year-ago quarter and putting the EV share of sales at 8.9%, the highest level recorded. But EV sales are still \u003ca href=\"https://www.freep.com/story/money/cars/2024/08/09/ev-adoption-slowed-price-range-charging-gm-ford-tesla-byd/74273947007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:not growing at the pace the industry had been expecting;elm:context_link;itc:0;sec:content-canvas\"\u003enot growing at the pace the industry had been expecting\u003c/a\u003e, and Moreno\u0026#39;s contention is that most EV sales are being driven by incentives such as the $7,500 federal tax credit.\u003c/p\u003e\u003ch2\u003eMaking an \u0026#39;American automotive renaissance\u0026#39;\u003c/h2\u003e\u003cp\u003eMoreno, the first car dealer elected to the Senate, is a 1989 graduate of the University of Michigan with a bachelor\u0026#39;s degree in business administration.\u003c/p\u003e\u003cp\u003eHe said he and President-elect Trump share the same vision for overhauling the American auto industry: They want to create more jobs, bring down prices of new vehicles, repeal many of the environmental regulations that are driving automakers\u0026#39; aggressive EV push and keep foreign-built cars offshore with high barriers to entry.\u003c/p\u003e\u003cp\u003eThe plan includes lowering energy prices and incentivizing automakers to shift all manufacturing to the United States.\u003c/p\u003e\u003cp\u003e\u0026#34;We’re going to have an American energy and American automotive renaissance in this country unlike anything you’ve seen,\u0026#34; Moreno said.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Ohio car dealer Bernie Moreno works with Ohio Treasurer Josh Mandel, left, to pay some state business taxes with Bitcoin in November 2018.\" loading=\"lazy\" width=\"960\" height=\"960\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/ISeqJTvu2GZ.644.juTAZQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTk2MA--/https://media.zenfs.com/en/usa_today_money_325/e8118a8cb7990524de75deb32288fb2b\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cp\u003eOhio car dealer Bernie Moreno works with Ohio Treasurer Josh Mandel, left, to pay some state business taxes with Bitcoin in November 2018.\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eHe noted that all the initiatives would have to pass through Congress and Trump would have to support them as well, but Moreno said the two are like-minded.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s \u0026#34;the reason President Trump endorsed me and I endorsed President Trump,\u0026#34; Moreno said. A Trump spokesperson had not responded Friday morning to a message seeking comment.\u003c/p\u003e\u003ch2\u003eKeeping China\u0026#39;s \u0026#39;garbage cars\u0026#39; offshore\u003c/h2\u003e\u003cp\u003eThat includes the idea of doing whatever it takes to ensure vehicles are made in America, not China or Mexico and then imported here.\u003c/p\u003e\u003cp\u003e\u0026#34;The minute that China thinks they can come here with their cheap, fully electric garbage cars … they’re sadly mistaken. These cars will come in here with dramatically high tariffs that will make those cars unsellable,\u0026#34; Moreno said. \u0026#34;We’re not going to be suckers anymore. We’re going to protect American workers and American jobs.”\u003c/p\u003e\u003cp\u003eIndustry watchers have \u003ca href=\"https://www.freep.com/story/money/cars/2024/10/10/chinas-byd-global-ev-maker-us-factory/75085460007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:praised the quality of cars;elm:context_link;itc:0;sec:content-canvas\"\u003epraised the quality of cars\u003c/a\u003e and their advanced battery technology produced by China\u0026#39;s BYD, which late last year briefly slipped ahead of Tesla in global EV sales.\u003c/p\u003e\u003cp\u003eTrump has said he would impose a 10% to 20% tariff, the taxes put on goods coming into a country, on all imports, including tariffs as high as 60% to 100% for goods from China. Moreno said if some auto parts can\u0026#39;t be made here, \u0026#34;we\u0026#39;re not going to tariff those things immediately,\u0026#34; but anything that can be made here should be made here, he said.\u003c/p\u003e\u003cp\u003e\u0026#34;Look, Lincoln has decided to make a lot of its cars in China and that’s a bad decision,\u0026#34; Moreno said. \u0026#34;They’re going to find that it’s a very bad decision. They should be making those cars here.\u0026#34;\u003c/p\u003e\u003cp\u003eFord builds the Lincoln Nautilus in China and GM builds its Buick Envision in China, both SUVs that are sold in the United States. All three Detroit automakers build various vehicles in Mexico that are sold in the U.S.\u003c/p\u003e\u003cp\u003eFord said that over the past five years, it has exported more vehicles made in America to China than the other way around. Also, while its luxury brand, Lincoln, imports one model into the U.S., Ford has exported many more models, such as F-150, Mustang, Bronco, Explorer and Lincoln Continental, Aviator and Navigator.\u003c/p\u003e\u003cp\u003eFord spokeswoman Robyn Jackson said in a statement to the Free Press, \u0026#34;Ford has bet on U.S. production and American workers more than any other automaker. As the No. 1 automaker in terms of production, employment and exporting vehicles from the USA to other markets, we look forward to working with the new administration and new Congress on policies that will ensure a thriving American auto industry and manufacturing sector. We are committed to offering customers the freedom of choice — great gas, hybrid and electric vehicles.”\u003c/p\u003e\u003ch2\u003eStern words for Stellantis\u003c/h2\u003e\u003cp\u003eMoreno also had stern words for another member of the Detroit Three, noting that “companies like, Stellantis, which the United States government handed Chrysler Corp. for free in essence, they are laying off workers and shipping our jobs to Mexico. CEO Carlos Tavares needs to understand the United States government is not going to allow him to gut Chrysler, and Jeep, and Dodge, and Ram, and ship those cars and the direction overseas, in managing a company that was handed to them for free, which never should have been done.”\u003c/p\u003e\u003cp\u003eMoreno was referencing the way Chrysler came to be part of Stellantis predecessor Fiat Chrysler Automobiles in connection \u003ca href=\"https://finance.yahoo.com/news/10-years-bailouts-gm-chrysler-162307980.html\" data-ylk=\"slk:with the company\u0026#39;s 2009 bankruptcy;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003ewith the company\u0026#39;s 2009 bankruptcy\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eStellantis has come under fire for numerous job cuts this year as it has struggled to manage its inventory levels, and on Wednesday announced it would \u003ca href=\"https://www.freep.com/story/money/cars/chrysler/2024/11/06/stellantis-cuts-shift-jeep-plant-layoffs-toledo/76094810007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:eliminate a shift at the Toledo Assembly Complex;elm:context_link;itc:0;sec:content-canvas\"\u003eeliminate a shift at the Toledo Assembly Complex\u003c/a\u003e, meaning layoffs for 1,100 workers. The company has also confirmed \u003ca href=\"https://www.freep.com/story/money/cars/chrysler/2024/10/22/stellantis-saltillo-mexico-factory-ram-1500/75793487007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:it is expanding its truck plant in Saltillo, Mexico;elm:context_link;itc:0;sec:content-canvas\"\u003eit is expanding its truck plant in Saltillo, Mexico\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eJodi Tinson, a spokeswoman for Stellantis, said in a statement to the Free Press: \u0026#34;Stellantis congratulates Senator-elect Bernie Moreno on his election to the U.S. Senate. Because Toledo, Ohio, is an important part of our manufacturing footprint as the production home of the iconic Jeep Wrangler and Jeep Gladiator sold worldwide, we look forward to working with the senator-elect on policies that support a strong and competitive manufacturing base in the U.S.\u0026#34;\u003c/p\u003e\u003ch2\u003eOld GM plant is symbolic of what needs to happen next\u003c/h2\u003e\u003cp\u003eA native of Colombia, Moreno grew up in Florida before attending U-M. He had a dream of working for an automaker and at age 14, wrote a letter to General Motors\u0026#39; then-CEO Roger Smith, suggesting ways Smith could improve the company. Smith wrote a lengthy reply, which Moreno still has, that began: \u0026#34;It\u0026#39;s not often I receive a letter from someone who is planning to take over my job,\u0026#34; according to a 2017 article on Moreno \u003ca href=\"https://www.autonews.com/article/20170320/RETAIL07/303209997/moreno-has-his-own-roger-and-me-tale/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:in Automotive News;elm:context_link;itc:0;sec:content-canvas\"\u003ein Automotive News\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAfter a stint from 1987 to 1993 with then-GM brand Saturn, Moreno segued into auto retail, eventually building an empire of 15 dealerships across Ohio, Kentucky, Massachusetts and Florida that represented 30 brands. In 2017, he told \u003ca href=\"https://www.autonews.com/article/20170320/RETAIL07/303209974/bernie-moreno-s-unexpected-u-turn/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Automotive News;elm:context_link;itc:0;sec:content-canvas\"\u003eAutomotive News\u003c/a\u003e his brands generated more than $700 million in annual revenue. But by 2020, he sold all of his car dealerships.\u003c/p\u003e\u003cp\u003eMoreno\u0026#39;s entrepreneurial drive centered on the car business. In 2018, when GM first announced it would permanently close its Lordstown Assembly plant in northeast Ohio, which built the Chevrolet Cruze sedan, Moreno tried to save it.\u003c/p\u003e\u003cp\u003eAs the \u003ca href=\"https://www.freep.com/story/money/cars/general-motors/2019/03/19/cleveland-car-dealer-tried-save-gms-lordstown-assembly-plant/3205898002/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Free Press reported in 2019;elm:context_link;itc:0;sec:content-canvas\"\u003eFree Press reported in 2019\u003c/a\u003e, Moreno met with GM leaders. He wanted to buy 150,000 to 180,000 Cruze cars to start a global ride-hailing company similar to Uber. GM CEO Mary Barra rejected the idea. GM shuttered Lordstown that spring.\u003c/p\u003e\u003cp\u003eAt that time, \u003ca href=\"https://www.freep.com/story/money/cars/general-motors/2019/03/17/donald-trump-twitter-gm-uaw-lordstown-ohio-plant/3194619002/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:then-President Trump targeted GM and a local UAW president;elm:context_link;itc:0;sec:content-canvas\"\u003ethen-President Trump targeted GM and a local UAW president\u003c/a\u003e in tweets urging the carmaker to reopen the plant. But GM sold it to electric-truck maker Lordstown Motors that year. Lordstown Motors filed for federal bankruptcy protection in June 2023.\u003c/p\u003e\u003cp\u003eFoxconn, a Taiwan-based electronics assembler, now owns the 6.2 million-square-foot auto assembly plant in Lordstown, but it sits idle. Moreno drives past it often and he said it serves inspiration for his U.S. auto industry overhaul plans.\u003c/p\u003e\u003cp\u003e\u0026#34;I want to see that plant producing automobiles again,\u0026#34; Moreno said. \u0026#34;It is symbolic of what we need to do. We need to turn things around. That community did everything right. These are people who went to work every single day. They followed the rules, they tried to raise their families, and make ends meet and the rug got pulled out from under them. That’s got to end.”\u003c/p\u003e\u003ch2\u003eToyota is poised to win as the EV tax credit goes away\u003c/h2\u003e\u003cp\u003eMoreno said he knows Barra and considers her a \u0026#34;very capable CEO.\u0026#34;\u003c/p\u003e\u003cp\u003eAsked to comment on Moreno\u0026#39;s initiatives for the auto industry, GM spokeswoman Liz Winter sent the following statement: \u0026#34;We look forward to working with Senator-elect Moreno on important issues ahead for the auto industry. GM remains committed to supporting jobs, driving innovation, and keeping America competitive globally. We\u0026#39;ve invested more than $5.6 billion in GM facilities in Ohio since 2013, including a joint venture with LG Energy Solution that employs 2,200 people and positions the industry for the future.\u0026#34;\u003c/p\u003e\u003cp\u003eMoreno said he is eager to meet Ford CEO Jim Farley and Stellantis CEO Tavares. His closest relationships now are with leaders at Toyota Motor North America, which he said helped organize the coalition of car dealers that supported his Senate run.\u003c/p\u003e\u003cp\u003e\u0026#34;The winner in this whole thing will probably be Toyota because they were the one company that said, ‘We’re just not going to do that,\u0026#39; \u0026#34; Moreno said. By \u0026#34;that\u0026#34; he means follow what he and Trump refer to as the \u0026#34;EV mandate.\u0026#34;\u003c/p\u003e\u003cp\u003eTo be clear: No law or rule forces carmakers to make EVs or consumers to purchase them. Moreno is referring to tightened fuel-economy standards under the Biden administration. The administration ruled earlier this year that new vehicles sold in the U.S. will have to meet a fleet average about 38 mpg by 2031 in real-world driving, up from about 29 mpg, \u003ca href=\"https://apnews.com/article/gas-mileage-transportation-electric-vehicle-nhtsa-4aaefb855ff7c449c6e4e9e4c69a9847\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:according to The Associated Press;elm:context_link;itc:0;sec:content-canvas\"\u003eaccording to The Associated Press\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAlso, the \u003ca href=\"https://www.epa.gov/newsreleases/biden-harris-administration-finalizes-strongest-ever-pollution-standards-cars-position\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Environmental Protection Agency has adopted stricter tailpipe-emissions rules;elm:context_link;itc:0;sec:content-canvas\"\u003eEnvironmental Protection Agency has adopted stricter tailpipe-emissions rules\u003c/a\u003e. Biden has set a goal for 50% of all sales be EVs by 2030, but it is a target not a mandate.\u003c/p\u003e\u003cp\u003eBut Moreno said the strict requirements essentially force carmakers to push EVs. He said Toyota bucked the trend and set a model the rest of the industry should follow by investing heavily in hybrids rather than all-electric. Toyota did not respond to a request for comment on this story.\u003c/p\u003e\u003cp\u003e“The problem with GM, Ford and Stellantis is that they made the decision to pacify the Biden-Harris administration and not call them out for the ridiculousness of their electric vehicle policies,\u0026#34; Moreno said. \u0026#34;Toyota, in listening to their car dealers, they planned to have the cars that consumers wanted. So the big winner now is Toyota because they don’t have to pivot.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Detroit Three need to revisit their strategies because the electric vehicle tax credit will likely disappear.\u003c/p\u003e\u003cp\u003e\u0026#34;The United States government — if I have anything to do with it, I’m one of 100 people and President Trump obviously makes a decision on this as well — but my suspicion is that electric vehicle subsidies are gone,\u0026#34; Moreno said. \u0026#34;So now there’s no subsidy. You buy an electric vehicle, the car stands on its own.\u0026#34;\u003c/p\u003e\u003ch2\u003eSome more proposed changes\u003c/h2\u003e\u003cp\u003eHere are some more of Moreno\u0026#39;s specific proposals:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eRepealing the emission standards that, in effect, can only be met through selling electric vehicles.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eFreezing Corporate Average Fuel Economy standards for \\\u0026#34;at least a decade.\\\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eProhibiting California from following a separate set of emission standards from the rest of the nation.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe CAFE standards are part of the Clean Air Act. California gets a waiver to set its own, tougher requirements, which now require that all new vehicles sold there by 2035 be only zero-emission vehicles in an effort to fight pollution and climate change.\u003c/p\u003e\u003cp\u003eThat influences manufacturers’ vehicle mix because California is the nation’s largest car market. For all of last year, 1.78 million cars were sold in California alone, according to the \u003ca href=\"https://www.cncda.org/news/california-new-car-dealers-association-releases-year-end-2023-auto-outlook-report/#:~:text=Major%20takeaways%3A%202023%20proved%20to,by%20this%20publication%20last%20year).\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:California New Car Dealers Association;elm:context_link;itc:0;sec:content-canvas\"\u003eCalifornia New Car Dealers Association\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eMoreno said it makes sense to hit pause on fuel-economy standards because, \u0026#34;We hit an incredibly high number, let\u0026#39;s pause these requirements for at least a decade to let the marketplace catch up, the technology catch up.\u0026#34;\u003c/p\u003e\u003cp\u003eKatherine García, Sierra Club’s director of Clean Transportation for All, said that won\u0026#39;t happen without a fight.\u003c/p\u003e\u003cp\u003e“The nation’s clean vehicle standards are a bedrock environmental safeguard that slash an enormous amount of health-threatening pollution, and we are prepared to fight any rollback of them, including threats to CAFE standards and California’s authority to set its own more protective standards,\u0026#34; she said. \u0026#34;We’ve been here before, and we have and will fight back against Trump’s extreme anti-environment, anti-middle class agenda and defend and build on the progress we’ve made over the last four years on clean transportation and climate.”\u003c/p\u003e\u003ch2\u003eLess competitive in global markets, adverse health affects\u003c/h2\u003e\u003cp\u003eAbhilasha Bhola, auto supply chain director on the climate team at the consumer advocacy group Public Citizen, warned that Moreno\u0026#39;s idea to freeze CAFE standards would hurt communities.\u003c/p\u003e\u003cp\u003e“His vision has the potential to turn every auto town in America into a version of what happened to Flint, Michigan, in the 1990s,” she said of a time when numerous auto plants had closed there.\u003c/p\u003e\u003cp\u003eWith countries in Europe and East Asia continuing to invest in electrification and with CAFE standards supporting electrification here, the U.S. auto industry would suffer if those standards are pulled, she said.\u003c/p\u003e\u003cp\u003e”We risk falling further behind other countries and reducing demand for American-made cars abroad,” she said. “Bernie Moreno and Trump\u0026#39;s auto policy makes us less competitive in global markets and that causes regular people to face some of the worst impacts.”\u003c/p\u003e\u003cp\u003eIt would also directly lead to worse health outcomes for Americans, she said.\u003c/p\u003e\u003cp\u003e“Doubling down on (internal) combustion engines through reduced efficiency standards is sentencing millions of Americans to dirty air and increased respiratory illness,” she said. “Smog from cars causes incredible health impacts. It means upper respiratory illness. It means people are missing work, school. There’s increased impacts and stress on our healthcare system, and this reduces quality of life.”\u003c/p\u003e\u003cp\u003eCalifornia’s leadership in reducing harmful emissions is important, she said.\u003c/p\u003e\u003cp\u003e“California is also the largest auto market in the country. It’s not just Californians that are impacted by those emissions. That smog travels to other states. So by getting rid of the California waiver and forcing the state to not have stricter standards, it means that the rest of the country suffers, too,” Bhola said.\u003c/p\u003e\u003cp\u003eA spokesman for the California Air Resources Board declined comment on what the next Trump administration might do. California Gov. Gavin Newsome on Thursday \u003ca href=\"https://apnews.com/article/california-donald-trump-gavin-newsom-special-session-32511d5887409d68d692e094ed50a272\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:called a special legislative session;elm:context_link;itc:0;sec:content-canvas\"\u003ecalled a special legislative session\u003c/a\u003e to strengthen the state\u0026#39;s progressive policies.\u003c/p\u003e\u003cp\u003eDespite the possibility that the incoming administration might make such sweeping changes to vehicle standards, Bhola said she doesn’t believe \u0026#34;all hope is lost.\u0026#34; It will simply require a shift in focus.\u003c/p\u003e\u003cp\u003e“I think there is an opportunity for states and cities to put forward their own environmental regulations,\u0026#34; she said, noting that those areas can continue to create incentives for EV uptake and to lower emissions and create good jobs.\u003c/p\u003e\u003ch2\u003eMoreno: Give automakers tax write-off for US wages\u003c/h2\u003e\u003cp\u003eAnother proposed agenda item for Moreno is bringing down new vehicle prices, which he said can be done by lowering interest rates as inflation comes down. Also, lowering the regulatory environment for the car companies will help lower prices.\u003c/p\u003e\u003cp\u003e\u0026#34;We need to repeal the part of the infrastructure law that requires all 2026 model-year vehicles to have an alcohol-impairment device each time the car starts,\u0026#34; Moreno said. \u0026#34;The reason is very simple: Those of us, like myself, who do not drink alcohol, why am I paying for a device to check my impairment? It adds cost.”\u003c/p\u003e\u003cp\u003eBut in 2022, more than 13,000 people were killed in incidents related to drunken driving, according to federal statistics. U.S. Rep. Debbie Dingell, D-Ann Arbor, who pushed for the law, said \u003ca href=\"https://www.freep.com/story/money/cars/2024/09/12/anti-drunk-driving-technology-nhtsa-debbie-dingell/74906878007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:the technology can save lives;elm:context_link;itc:0;sec:content-canvas\"\u003ethe technology can save lives\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFinally, he suggests a new tax code that rewards American companies.\u003c/p\u003e\u003cp\u003e“I’ll give you an example, if you’re an American company that employs American workers, maybe you can write off whatever you pay in salaries twice,\u0026#34; Moreno said. \u0026#34;So if you pay $10 million in salary and wages, you get an additional $10 million tax write-off. That encourages companies to pay their employees more money.\u0026#34;\u003c/p\u003e\u003ch2\u003eBut some say the U.S. auto industry would actually suffer\u003c/h2\u003e\u003cp\u003eSam Fiorani, vice president of global vehicle forecasting for AutoForecast Solutions, questioned the logic behind any plans that would effectively discourage innovation and efficiency improvements, such as California’s ability to set its own emissions standards.\u003c/p\u003e\u003cp\u003e“It’s good to have somebody pushing the boundaries of what’s available in the marketplace,” Fiorani said. “Focusing strictly on what the American consumer wants today will make (automakers) less competitive in five to 10 years.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eTrump and the economy: \u003c/strong\u003e\u003ca href=\"https://finance.yahoo.com/news/trumps-victory-could-affect-us-213957997.html\" data-ylk=\"slk:How Trump\u0026#39;s victory could affect the US economy;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eHow Trump\u0026#39;s victory could affect the US economy\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWhether it’s the incoming administration’s desire to limit what California can do or to freeze fuel economy standards for a decade, the impact would hurt automakers and everyone who depends on them in the long run, Fiorani said.\u003c/p\u003e\u003cp\u003e“The global automotive industry is progressing at such a rate at the moment that American companies will be left behind if we concentrate on full-size pickups and SUVs,” Fiorani said\u003c/p\u003e\u003cp\u003eHe noted that he also writes about automotive history and offered a lesson from the past that would appear to have relevance in this discussion.\u003c/p\u003e\u003cp\u003e“These cars from the ‘70s that were bloated and only in demand in the United States meant that foreign auto manufacturers could come in here and appeal to the customers with newer products and more efficient products and products that existing companies wouldn’t see as profitable,” he said.\u003c/p\u003e\u003cp\u003eAmerican car companies were woefully noncompetitive on a global scale 50 years ago, and pushing for higher fuel economy standards at least pulled them up to the level of the competition, he said. Fiorani warned that electric vehicles and hybridization are the future, and delaying any investments would be detrimental for automakers.\u003c/p\u003e\u003cp\u003eAs for what gets produced in Mexico, Fiorani said the Detroit Three currently produce a handful of vehicles there and usually for competitive reasons. Bringing all those vehicles to the United States would likely increase prices and decrease the demand for them.\u003c/p\u003e\u003ch2\u003eOhio and Michigan will lead the way\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eMore: \u003c/strong\u003e\u003ca href=\"https://www.freep.com/story/money/cars/2024/11/06/donald-trump-presidency-impact-detroit-three-automakers-uaw-car-buyers-ev/76088343007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Experts: Trump presidency could benefit Detroit automakers, but cost car buyers more;elm:context_link;itc:0;sec:content-canvas\"\u003eExperts: Trump presidency could benefit Detroit automakers, but cost car buyers more\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eOne of Trump\u0026#39;s biggest supporters has been Tesla CEO Elon Musk, and as a reward for it, Trump has promised Musk a quasi-Cabinet position. Moreno said it\u0026#39;s a brilliant plan.\u003c/p\u003e\u003cp\u003e\u0026#34;We could take $2 trillion a year in savings out of the federal government, there’s no question in my mind about that,\u0026#34; Moreno said of Musk. \u0026#34;We can’t afford the government we have right now.\u0026#34;\u003c/p\u003e\u003cp\u003eHe believes Musk would help add efficiency, remove unnecessary departments and rid Washingon of bureaucrats who are \u0026#34;spinning their wheels.\u0026#34; He noted how Musk built some 25,000 Tesla charging stations across the country and the U.S. government has still built just a fraction of that.\u003c/p\u003e\u003cp\u003eMoreno promises if Trump\u0026#39;s autos agenda is enacted, \u0026#34;It’ll be the golden age of manufacturing in America with Ohio and Michigan leading the way.”\u003c/p\u003e\u003cp\u003e\u003cem\u003eContact Jamie L. LaReau: \u003ca href=\"mailto:jlareau@freepress.com\" data-ylk=\"slk:jlareau@freepress.com;elm:context_link;itc:0;sec:content-canvas\"\u003ejlareau@freepress.com\u003c/a\u003e. Follow her on Twitter \u003ca href=\"https://twitter.com/jlareauan\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:@jlareauan;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cstrong\u003e@\u003c/strong\u003ejlareauan\u003c/a\u003e. Read more on \u003ca href=\"https://www.freep.com/autos/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:General Motors;elm:context_link;itc:0;sec:content-canvas\"\u003eGeneral Motors\u003c/a\u003e and sign up for our \u003ca href=\"https://profile.freep.com/newsletters/automotive-news-headlines/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:autos newsletter;elm:context_link;itc:0;sec:content-canvas\"\u003eautos newsletter\u003c/a\u003e. \u003ca href=\"https://cm.freep.com/specialoffer?gps-source=CPNEWS\u0026amp;itm_medium=tagline\u0026amp;itm_source=news\u0026amp;itm_campaign=NEWSROOM\u0026amp;itm_content=JamieLareau\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Become a subscriber;elm:context_link;itc:0;sec:content-canvas\"\u003eBecome a subscriber\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis story has been updated with additional information.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis article originally appeared on Detroit Free Press: \u003ca href=\"https://www.usatoday.com/story/money/cars/2024/11/08/senator-elect-joins-trump-in-wanting-to-overhaul-car-industry/76130104007/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Senator-elect says he joins Trump in wanting to overhaul car industry;elm:context_link;itc:0;sec:content-canvas\"\u003eSenator-elect says he joins Trump in wanting to overhaul car industry\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "24 min read",
  "publishedTime": "2024-11-08T17:10:32Z",
  "modifiedTime": null
}
