{
  "id": "70555c12-de4d-40aa-a897-f47c2873634d",
  "title": "Salesforce, Inc. (CRM) to Invest $500M in Saudi AI Expansion with New Riyadh HQ",
  "link": "https://finance.yahoo.com/news/salesforce-inc-crm-invest-500m-131155895.html",
  "description": "",
  "author": "",
  "published": "2025-05-14T13:11:55Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Ghazal Ahmed",
  "length": 2510,
  "excerpt": "We recently compiled a list of the 9 AI Stocks Poised to Gain from Trump’s Middle East AI Push. In this article, we are going to take a look at where...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: We recently compiled a list of the 9 AI Stocks Poised to Gain from Trump’s Middle East AI Push. In this article, we are going to take a look at where Salesforce, Inc. (NYSE:CRM) stands against the other AI stocks. A White House Official said Tuesday that the United States does not need to block the global spread of its AI chips and technology to control national security risks, signaling a flexible approach toward sharing advanced technology to trusted allies such as Saudi Arabia. When President Biden was in office, he tried to curb China’s progress in artificial intelligence by limiting access to powerful chips. However, President Trump is taking a different approach—one that encompasses offering US technology to countries on the condition that they avoid Chinese alternatives. READ ALSO: 10 AI Stocks Surging on News and Ratings and 10 AI Stocks Making Moves This Week. David Sacks, the White House's AI and crypto czar, signaled on the administration’s new stance only days after Washington announced plans to rescind and modify a previous regulation from the Biden era that would limit global access to artificial-intelligence chips. \"The Trump administration has just announced that we will be rescinding what's known as the Biden diffusion rule... it literally restricted the diffusion or proliferation of American technology all over the world. (Diffusion) is not a risk with a friend like Saudi Arabia at all but I think in general there was a great deal of misunderstanding about the diversion of GPUs.” These comments imply how the United States is now looking to deepen tech ties with Middle Eastern partners investing heavily in AI infrastructure and aiming to position themselves as a hub of emerging technology outside the United States. Before these comments were made, Saudi Arabia and its neighbors saw their access to US chips limited under the AI diffusion rules imposed during the Biden era. However, Trump officials deem this as “misguided”, touting that there is no risk with “a friend like Saudi Arabia.” The Biden-era controls were rescinded by the Department of Commerce on Tuesday. \"The original reason for this diffusion rule is that we have a policy of not wanting our advanced semiconductors to go to what are known as countries of concern.\" For this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024.",
  "image": "https://s.yimg.com/ny/api/res/1.2/4TaIymUCvisp0zNXdo.5Pg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM7Y2Y9d2VicA--/https://media.zenfs.com/en/insidermonkey.com/057172d1bddd5e7eaee5fc08e2756794",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e  \u003cp\u003eWe recently compiled a list of the \u003cstrong\u003e\u003ca href=\"https://www.insidermonkey.com/blog/9-ai-stocks-poised-to-gain-from-trumps-middle-east-ai-push-1532817/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:9 AI Stocks Poised to Gain from Trump’s Middle East AI Push;elm:context_link;itc:0;sec:content-canvas\"\u003e9 AI Stocks Poised to Gain from Trump’s Middle East AI Push\u003c/a\u003e\u003c/strong\u003e.\u003cstrong\u003e \u003c/strong\u003eIn this article, we are going to take a look at where Salesforce, Inc. (NYSE:CRM) stands against the other AI stocks.\u003c/p\u003e  \u003cp\u003eA White House Official said Tuesday that the United States does not need to block the global spread of its AI chips and technology to control national security risks, signaling a flexible approach toward sharing advanced technology to trusted allies such as Saudi Arabia.\u003c/p\u003e    \u003cp\u003eWhen President Biden was in office, he tried to curb China’s progress in artificial intelligence by limiting access to powerful chips. However, President Trump is taking a different approach—one that encompasses offering US technology to countries on the condition that they avoid Chinese alternatives.\u003c/p\u003e  \u003cp\u003e\u003cstrong\u003eREAD ALSO: \u003ca href=\"https://www.insidermonkey.com/blog/10-ai-stocks-surging-on-news-and-ratings-1532093/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:10 AI Stocks Surging on News and Ratings;elm:context_link;itc:0;sec:content-canvas\"\u003e10 AI Stocks Surging on News and Ratings\u003c/a\u003e and \u003ca href=\"https://www.insidermonkey.com/blog/10-ai-stocks-making-moves-this-week-1530947/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:10 AI Stocks Making Moves This Week;elm:context_link;itc:0;sec:content-canvas\"\u003e10 AI Stocks Making Moves This Week\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e  \u003cp\u003eDavid Sacks, the White House\u0026#39;s AI and crypto czar, signaled on the administration’s new stance only days after Washington announced plans to rescind and modify a previous regulation from the Biden era that would limit global access to artificial-intelligence chips.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003e\u0026#34;The Trump administration has just announced that we will be rescinding what\u0026#39;s known as the Biden diffusion rule... it literally restricted the diffusion or proliferation of American technology all over the world. (Diffusion) is not a risk with a friend like Saudi Arabia at all but I think in general there was a great deal of misunderstanding about the diversion of GPUs.”\u003c/p\u003e \u003c/blockquote\u003e  \u003cp\u003eThese comments imply how the United States is now looking to deepen tech ties with Middle Eastern partners investing heavily in AI infrastructure and aiming to position themselves as a hub of emerging technology outside the United States.\u003c/p\u003e  \u003cp\u003eBefore these comments were made, Saudi Arabia and its neighbors saw their access to US chips limited under the AI diffusion rules imposed during the Biden era. However, Trump officials deem this as “misguided”, touting that there is no risk with “a friend like Saudi Arabia.” The Biden-era controls were rescinded by the Department of Commerce on Tuesday.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003e\u0026#34;The original reason for this diffusion rule is that we have a policy of not wanting our advanced semiconductors to go to what are known as countries of concern.\u0026#34;\u003c/p\u003e \u003c/blockquote\u003e  \u003cp\u003eFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e      \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-14T13:11:55Z",
  "modifiedTime": null
}
