{
  "id": "7f148e96-80c2-40e6-8221-72c39bc29e0c",
  "title": "Bank of Korea to cut rates on Jan. 16, may ease just once this quarter amid political turmoil: Reuters poll",
  "link": "https://www.investing.com/news/economy-news/bank-of-korea-to-cut-rates-on-jan-16-may-ease-just-once-this-quarter-amid-political-turmoil-reuters-poll-3810663",
  "description": "",
  "author": "Reuters",
  "published": "2025-01-14 00:45:36",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 2513,
  "excerpt": "Bank of Korea to cut rates on Jan. 16, may ease just once this quarter amid political turmoil: Reuters poll",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "By Anant Chandak BENGALURU (Reuters) - The Bank of Korea will cut its base rate by a quarter-point on Thursday, a month earlier than previously expected, to support a struggling South Korean economy amid risks from political uncertainty, according to a Reuters poll of economists. Acting president Choi Sang-mok is facing a delicate task steering Asia's fourth-largest economy amid public anger around efforts to arrest impeached President Yoon Suk Yeol and the government lowering its 2025 growth outlook to 1.8% from 2.2%. Political turmoil and high domestic household debt have sent the Korean won to its weakest in nearly 15 years while tariff threats from U.S. President-elect Donald Trump have driven expectations of fewer U.S. interest rate cuts this year. Around 80% of economists, 27 of 34, polled Jan. 8-13 expected the BOK to cut its base rate by 25 basis points to 2.75% on Jan. 16. The remaining seven forecast no change. A November poll following a surprise reduction of the base rate to 3.00% saw a majority of economists predict the bank would next cut rates in February. \"Against a backdrop of heightened political uncertainty and intensifying growth concerns, we think the Bank of Korea will deliver its third straight 25 bp cut at its upcoming meeting. The case to move sooner rather than later has strengthened,\" said Krystal Tan, economist at ANZ. \"The main hurdle for successive rate cuts is recent KRW weakness and concerns about financial stability... Prolonged political instability and/or direct U.S. tariffs on South Korea exports would call for more accommodative monetary policy.\" Median forecasts showed one cut from the BOK this quarter and the same move in both the second and third quarters taking the rate to 2.25% - considered the neutral rate. That would be followed by a hold until at least mid-2026. Half - 14 of 28 - who had forecasts until year-end expected the base rate at 2.25%. Still, eight predicted it at 2.50% and six at 2.00% highlighting the uncertainty of the outlook ahead of Trump's inauguration on Jan. 20. \"Still-subdued domestic demand recovery, along with the sharp decline in consumer sentiment in part due to the domestic politics, likely mean that the board will continue to lower its policy rate towards neutral,\" said Jin Choi, Korea economist at HSBC. \"However, we note that a meaningful change in the U.S. Fed's future policy trajectory could constrain the BOK's easing going forward.\" (Other stories from the January Reuters global economic poll)",
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEL0D00X_M.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eBy Anant Chandak\u003c/p\u003e \u003cp\u003eBENGALURU (Reuters) - The Bank of Korea will cut its base rate by a quarter-point on Thursday, a month earlier than previously expected, to support a struggling South Korean economy amid risks from political uncertainty, according to a Reuters poll of economists.\u003c/p\u003e \u003cp\u003eActing president Choi Sang-mok is facing a delicate task steering Asia\u0026#39;s fourth-largest economy amid public anger around efforts to arrest impeached President Yoon Suk Yeol and the government lowering its 2025 growth outlook to 1.8% from 2.2%.\u003c/p\u003e \u003cp\u003ePolitical turmoil and high domestic household debt have sent the Korean won to its weakest in nearly 15 years while tariff threats from U.S. President-elect Donald Trump have driven expectations of fewer U.S. interest rate cuts this year.\u003c/p\u003e \u003cp\u003eAround 80% of economists, 27 of 34, polled Jan. 8-13 expected the BOK to cut its base rate by 25 basis points to 2.75% on Jan. 16. The remaining seven forecast no change.\u003c/p\u003e \u003cp\u003eA November poll following a surprise reduction of the base rate to 3.00% saw a majority of economists predict the bank would next cut rates in February.\u003c/p\u003e \u003cp\u003e\u0026#34;Against a backdrop of heightened political uncertainty and intensifying growth concerns, we think the Bank of Korea will deliver its third straight 25 bp cut at its upcoming meeting. The case to move sooner rather than later has strengthened,\u0026#34; said Krystal Tan, economist at ANZ. \u003c/p\u003e \u003cp\u003e\u0026#34;The main hurdle for successive rate cuts is recent KRW weakness and concerns about financial stability... Prolonged political instability and/or direct U.S. tariffs on South Korea exports would call for more accommodative monetary policy.\u0026#34;\u003c/p\u003e \u003cp\u003eMedian forecasts showed one cut from the BOK this quarter and the same move in both the second and third quarters taking the rate to 2.25% - considered the neutral rate. That would be followed by a hold until at least mid-2026.\u003c/p\u003e \u003cp\u003eHalf - 14 of 28 - who had forecasts until year-end expected the base rate at 2.25%. Still, eight predicted it at 2.50% and six at 2.00% highlighting the uncertainty of the outlook ahead of Trump\u0026#39;s inauguration on Jan. 20. \u003c/p\u003e \u003cp\u003e\u0026#34;Still-subdued domestic demand recovery, along with the sharp decline in consumer sentiment in part due to the domestic politics, likely mean that the board will continue to lower its policy rate towards neutral,\u0026#34; said Jin Choi, Korea economist at HSBC.\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEL0D00X_L.jpg\" title=\"© Reuters. FILE PHOTO: The logo of the Bank of Korea is seen in Seoul, South Korea, November 30, 2017.  REUTERS/Kim Hong-Ji/File photo\" alt=\"© Reuters. FILE PHOTO: The logo of the Bank of Korea is seen in Seoul, South Korea, November 30, 2017.  REUTERS/Kim Hong-Ji/File photo\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;However, we note that a meaningful change in the U.S. Fed\u0026#39;s future policy trajectory could constrain the BOK\u0026#39;s easing going forward.\u0026#34;\u003c/p\u003e \u003cp\u003e(Other stories from the January Reuters global economic poll) \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-14T00:40:39Z",
  "modifiedTime": null
}
