{
  "id": "807bc301-ee70-4525-af77-2f230c6542aa",
  "title": "I Asked ChatGPT To Explain How To Make Money Without Working: Here’s What It Said",
  "link": "https://finance.yahoo.com/news/asked-chatgpt-explain-money-without-140235094.html",
  "description": "",
  "author": "",
  "published": "2025-06-05T14:02:35Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Nicole Spector",
  "length": 2835,
  "excerpt": "During this time of economic turbulence when even people making six-figure salaries may be living paycheck to paycheck, we turned to ChatGPT for some answers...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Ah, ChatGPT, how did we once, just a few years ago, live without you? You do so much — more than we imagined possible. You have the power to pass advanced exams in virtually every field. Some people use you as a personal assistant. Others, go so far as to turn to you for therapy (a controversial trend, but a trend nonetheless). What many of us use you most for is to provide accessible answers to complex questions. And to offer ideas we may not have thought of on our own. Advertisement: High Yield Savings Offers Powered by Money.com - Yahoo may earn commission from the links above. Find Out: I’m a Self-Made Millionaire: Here’s How I Use ChatGPT To Make a Lot of Money Read Next: 4 Affordable Car Brands You Won't Regret Buying in 2025 And so we turn to you during this time of economic turbulence when even people making six-figure salaries may be living paycheck to paycheck and are wondering, “How can I make money without working?” What are your answers, ChatGPT? Let’s find out. A tried and true way to generate passive income is investing. ChatGPT surfaced the idea of investing in stocks or funds. “Buying dividend-paying stocks or investing in index funds can generate income over time,” the chatbot explained. “Dividends provide regular payments, and capital gains add long-term growth.” Some of the world’s wealthiest people, such as Warren Buffett and George Soros, grew their multibillion-dollar fortunes through investing. Learn More: Here’s How To Use AI To Quickly Start a Side Gig, According to Codie Sanchez ChatGPT pointed to owning real estate as a proven way to make money without working. Real estate can be a sturdy hedge against inflation, as it generally appreciates over time, and you can profit off it by renting a home out. Of course, you’ll need the upfront capital to make such a large purchase. Examples of ultra-wealthy people who champion real estate investing are Robert Kiyosaki and Barbara Corcoran. ChatGPT cited placing money in HYSAs as one way to make money without working. Absolutely you should be putting your emergency savings in a HYSA, so that it generates interest, but this is one of the weaker ways to make money because you just won’t make very much. Right now, the highest HYSA rates banks offer are between 4% and 5%. In the same short paragraph highlighting the money-earning potential of placing money in HYSAs, ChatGPT touched on putting money in government bonds. It’s odd that ChatGPT would group HYSAs with bonds, as bonds are very different money-making vessels. Firstly, they’re investments, not bank accounts. They’re generally considered very safe investments, but they’re not terribly profitable. As of March, 20-year T-bonds offered an interest rate of 4.750%, while 30-year T-bonds offered 4.625%, according to Motley Fool Mone.",
  "image": "https://s.yimg.com/ny/api/res/1.2/DuQiO.Da8QlVbkrgkfLfkA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/gobankingrates_644/d1c7612e66261a10b279299ec32a6c09",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e   \u003cp\u003eAh, ChatGPT, how did we once, just a few years ago, live without you? You do so much — more than we imagined possible. You have the power to pass advanced exams in virtually every field. Some people use you as a personal assistant. Others, go so far as to turn to you for therapy (a controversial trend, but a trend nonetheless). What many of us use you most for is to \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.gobankingrates.com/retirement/401k/i-asked-chatgpt-to-explain-401k-plans-like-im-12-what-it-said/?hyperlink_type=manual\u0026amp;utm_term=incontent_link_1\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=1\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:provide accessible answers to complex questions;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eprovide accessible answers to complex questions\u003c/a\u003e. And to offer ideas we may not have thought of on our own.\u003c/p\u003e   \u003cdiv\u003e\u003ch2\u003eAdvertisement: High Yield Savings Offers \u003c/h2\u003e  \u003cp\u003ePowered by Money.com - Yahoo may earn commission from the links above. \u003c/p\u003e\u003c/div\u003e   \u003cp\u003e\u003cstrong\u003eFind Out: \u003c/strong\u003e\u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.gobankingrates.com/money/making-money/self-made-millionaire-how-i-used-chatgpt-to-make-money/?hyperlink_type=manual\u0026amp;utm_term=related_link_1\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=2\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:I’m a Self-Made Millionaire: Here’s How I Use ChatGPT To Make a Lot of Money;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cstrong\u003eI’m a Self-Made Millionaire: Here’s How I Use ChatGPT To Make a Lot of Money\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e   \u003cp\u003e\u003cstrong\u003eRead Next: \u003c/strong\u003e\u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.gobankingrates.com/saving-money/car/affordable-car-brands-you-wont-regret-buying/?hyperlink_type=manual\u0026amp;utm_term=related_link_2\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=3\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:4 Affordable Car Brands You Won\u0026#39;t Regret Buying in 2025;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cstrong\u003e4 Affordable Car Brands You Won\u0026#39;t Regret Buying in 2025\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e   \u003cp\u003eAnd so we turn to you during this time of economic turbulence when even people making six-figure salaries may be living paycheck to paycheck and are wondering, “How can I make money without working?” What are your answers, ChatGPT? \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.gobankingrates.com/money/making-money/surprising-ways-make-money-dont-feel-like-work/?hyperlink_type=manual\u0026amp;utm_term=incontent_link_2\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=4\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Let’s find out;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eLet’s find out\u003c/a\u003e.\u003c/p\u003e      \u003cp\u003eA tried and true way to \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://www.gobankingrates.com/money/making-money/online-tools-build-passive-income/?hyperlink_type=manual\u0026amp;utm_term=incontent_link_3\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=5\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:generate passive income;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003egenerate passive income\u003c/a\u003e is investing. ChatGPT surfaced the idea of investing in stocks or funds.\u003c/p\u003e   \u003cp\u003e“Buying dividend-paying stocks or investing in index funds can generate income over time,” the chatbot explained. “Dividends provide regular payments, and capital gains add long-term growth.”\u003c/p\u003e   \u003cp\u003eSome of the world’s wealthiest people, such as Warren Buffett and George Soros, grew their multibillion-dollar fortunes through investing.\u003c/p\u003e   \u003cp\u003e\u003cstrong\u003eLearn More: \u003c/strong\u003e\u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://www.gobankingrates.com/money/side-gigs/how-to-use-ai-quickly-start-side-gig-according-to-codie-sanchez/?hyperlink_type=manual\u0026amp;utm_term=related_link_3\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=6\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Here’s How To Use AI To Quickly Start a Side Gig, According to Codie Sanchez;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cstrong\u003eHere’s How To Use AI To Quickly Start a Side Gig, According to Codie Sanchez\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e      \u003cp\u003eChatGPT pointed to owning real estate as a \u003ca data-i13n=\"cpos:7;pos:1\" href=\"https://www.gobankingrates.com/investing/real-estate/less-traditional-ways-to-grow-wealth-through-real-estate/?hyperlink_type=manual\u0026amp;utm_term=incontent_link_4\u0026amp;utm_campaign=1307392\u0026amp;utm_source=yahoo.com\u0026amp;utm_content=7\u0026amp;utm_medium=rss\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:proven way to make money without working;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eproven way to make money without working\u003c/a\u003e. Real estate can be a sturdy hedge against inflation, as it generally appreciates over time, and you can profit off it by renting a home out. Of course, you’ll need the upfront capital to make such a large purchase. Examples of ultra-wealthy people who champion real estate investing are Robert Kiyosaki and Barbara Corcoran.\u003c/p\u003e      \u003cp\u003eChatGPT cited placing money in HYSAs as one way to make money without working. Absolutely you should be putting your emergency savings in a HYSA, so that it generates interest, but this is one of the weaker ways to make money because you just won’t make very much. Right now, the highest HYSA rates banks offer are between 4% and 5%.\u003c/p\u003e      \u003cp\u003eIn the same short paragraph highlighting the money-earning potential of placing money in HYSAs, ChatGPT touched on putting money in government bonds. It’s odd that ChatGPT would group HYSAs with bonds, as bonds are very different money-making vessels. Firstly, they’re investments, not bank accounts. They’re generally considered very safe investments, but they’re not terribly profitable. As of March, 20-year T-bonds offered an interest rate of 4.750%, while 30-year T-bonds offered 4.625%, according to Motley Fool Mone.\u003c/p\u003e \u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-d024a5b6-5ba8-4a7a-86bc-ebaecb6ee7e4\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-e72ad41d-f2c3-420f-8c38-9d7b4f84276c\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-55db2c30-d2da-4fda-a3b8-fe1a34dd4291\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-63c9afa6-840d-4aea-92c6-4c6a7be282e7\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-19f2bc26-edd4-4592-bd11-85f1f6d24701\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-d64a4886-e131-439b-95aa-4415e4a515ef\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-8341654b-e18d-4b81-afad-35e7fa15df00\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-05T14:02:35Z",
  "modifiedTime": null
}
