{
  "id": "a192491a-921c-43b0-b2f8-13bb1723d301",
  "title": "NXG Cushing ® Midstream Energy Fund (NYSE: SRV) Announces Distributions",
  "link": "https://www.investing.com/news/press-releases/nxg-cushing--midstream-energy-fund-nyse-srv-announces-distributions-93CH-3778381",
  "description": "",
  "author": "Investing.com",
  "published": "2024-12-18 00:44:03",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 5082,
  "excerpt": "NXG Cushing ® Midstream Energy Fund (NYSE: SRV) Announces Distributions",
  "siteName": "Investing.com",
  "favicon": "",
  "text": ", /PRNewswire/ -- The  NXG Cushing ® Midstream Energy Fund (NYSE: SRV) (the \"Fund\") declared a special distribution of $0.31477 per common share. This special distribution will be payable to common shareholders pursuant to the table below:Record DateEx-Dividend DatePayment DateDistribution AmountDecember 27, 2024December 27, 2024December 31, 2024$0.31477This special distribution is in addition to the Fund's previously announced December distribution of $0.45 per share. This special distribution is being paid to allow the Fund to meet its 2024 distribution requirements as a regulated investment company for U.S. federal income tax purposes.  It is estimated that 100% of the special distribution will consist of long-term capital gain. The sources the distribution are only estimates and are provided to you pursuant to regulatory requirements and are not being provided for tax reporting purposes. The final determination of such sources will be made and reported to shareholders in early 2025 for the 2024 dividends, after the end of the calendar year when the Fund determines its earnings and profits for the year. The final tax status of a distribution may differ substantially from this information. The distribution shall be paid on the payment date unless the payment of such distribution is deferred by the Fund's Board of Trustees upon a determination that such deferral is required in order to comply with applicable law or to ensure that the Fund remains solvent and able to pay its debts as they become due and continue as a going concern.ADDITIONAL INFORMATION ABOUT THE FUNDThe Fund is a non-diversified, closed-end management investment company with an investment objective of seeking a high after-tax total return from a combination of capital appreciation and current income. The Fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its net assets, plus any borrowings for investment purposes, in a portfolio of midstream energy investments. The Fund considers midstream energy investments to be investments that offer economic exposure to securities of midstream energy companies, which are companies that engage provide midstream services in the energy infrastructure sector, including the gathering, transporting, processing, fractionation, storing, refining and distribution of natural resources, such as , natural gas liquids, refined petroleum products, biofuels, carbon sequestration, solar, and wind. The Fund considers a company to be a midstream energy company if at least 50% of its assets, income, sales or profits are committed to, derived from or otherwise related to midstream energy services. The Fund's shares are traded on the New York Stock Exchange under the symbol \"SRV.\"There can be no assurance that the Fund will achieve its investment objectives. Investments in the Fund involve operating expenses and fees. The net asset value of the Fund will fluctuate with the value of the underlying securities. It is important to note that closed-end funds trade on their market value, not net asset value, and closed-end funds often trade at a discount to their net asset value.ABOUT NXG Investment ManagementCushing ® Asset Management, LP (\"Cushing\") is an SEC-registered investment adviser headquartered in Dallas, Texas. Cushing serves as investment adviser to affiliated funds and managed accounts. Cushing is doing business as NXG Investment Management. The Firm provides Next (LON:) Generation investment strategies to investors seeking long-term growth in companies focused on traditional and transformational infrastructure.Contact:  Blake NelsonNXG Investment Management214-692-6334www.nxgim.comIMPORTANT INFORMATIONThis press release shall not constitute an offer to sell or a solicitation to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer or solicitation or sale would be unlawful prior to registration or qualification under the laws of such state or jurisdiction.This press release contains certain statements that may include \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical fact, included herein are \"forward-looking statements.\" Although the Fund and NXG Investment Management believe that the expectations reflected in these forward-looking statements are reasonable, they do involve assumptions, risks and uncertainties, and these expectations may prove to be incorrect. Actual results could differ materially from those anticipated in these forward-looking statements as a result of a variety of factors, including those discussed in the company's reports that are filed with the Securities and Exchange Commission. You should not place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Other than as required by law, the Fund and Cushing do not assume a duty to update this forward-looking statement.",
  "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp id=\"temp_ReleaseStart\"\u003e,  /PRNewswire/ -- The  NXG Cushing ® \u003cspan\u003eMidstream Energy Fund\u003c/span\u003e (NYSE: SRV) (the \u0026#34;Fund\u0026#34;) declared a special distribution of \u003cmoney\u003e$0.31477\u003c/money\u003e per common share. This special distribution will be payable to common shareholders pursuant to the table below:\u003c/p\u003e\u003cdiv\u003e\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cb\u003e\u003cu\u003eRecord Date\u003c/u\u003e\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cb\u003e\u003cu\u003eEx-Dividend Date\u003c/u\u003e\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cb\u003e\u003cu\u003ePayment Date\u003c/u\u003e\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cb\u003e\u003cu\u003eDistribution \u003cbr/\u003eAmount\u003c/u\u003e\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cchron\u003eDecember 27, 2024\u003c/chron\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cchron\u003eDecember 27, 2024\u003c/chron\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cchron\u003eDecember 31, 2024\u003c/chron\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003ctd colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cmoney\u003e$0.31477\u003c/money\u003e\u003c/span\u003e\u003c/p\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003eThis special distribution is in addition to the Fund\u0026#39;s previously announced December distribution of \u003cmoney\u003e$0.45\u003c/money\u003e per share. This special distribution is being paid to allow the Fund to meet its 2024 distribution requirements as a regulated investment company for \u003clocation idsrc=\"xmltag.org\" value=\"LC/us\"\u003eU.S.\u003c/location\u003e federal income tax purposes.  \u003c/p\u003e\u003cp\u003eIt is estimated that 100% of the special distribution will consist of long-term capital gain. The sources the distribution are only estimates and are provided to you pursuant to regulatory requirements and are not being provided for tax reporting purposes. The final determination of such sources will be made and reported to shareholders in early 2025 for the 2024 dividends, after the end of the calendar year when the Fund determines its earnings and profits for the year. The final tax status of a distribution may differ substantially from this information.\u003c/p\u003e\n\u003cp\u003eThe distribution shall be paid on the payment date unless the payment of such distribution is deferred by the Fund\u0026#39;s \u003cspan\u003eBoard of Trustees\u003c/span\u003e upon a determination that such deferral is required in order to comply with applicable law or to ensure that the Fund remains solvent and able to pay its debts as they become due and continue as a going concern.\u003c/p\u003e\u003cp\u003eADDITIONAL INFORMATION ABOUT THE FUND\u003c/p\u003e\u003cp\u003eThe Fund is a non-diversified, closed-end management investment company with an investment objective of seeking a high after-tax total return from a combination of capital appreciation and current income. The Fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its net assets, plus any borrowings for investment purposes, in a portfolio of midstream energy investments. The Fund considers midstream energy investments to be investments that offer economic exposure to securities of midstream energy companies, which are companies that engage provide midstream services in the energy infrastructure sector, including the gathering, transporting, processing, fractionation, storing, refining and distribution of natural resources, such as , natural gas liquids,  refined petroleum products, biofuels, carbon sequestration, solar, and wind. The Fund considers a company to be a midstream energy company if at least 50% of its assets, income, sales or profits are committed to, derived from or otherwise related to midstream energy services. The Fund\u0026#39;s shares are traded on the \u003cspan\u003eNew York Stock Exchange\u003c/span\u003e under the symbol \u0026#34;SRV.\u0026#34;\u003c/p\u003e\u003cp\u003eThere can be no assurance that the Fund will achieve its investment objectives. Investments in the Fund involve operating expenses and fees. The net asset value of the Fund will fluctuate with the value of the underlying securities. It is important to note that closed-end funds trade on their market value, not net asset value, and closed-end funds often trade at a discount to their net asset value.\u003c/p\u003e\u003cp\u003eABOUT \u003cspan\u003eNXG Investment Management\u003c/span\u003e\u003c/p\u003e\u003cp\u003eCushing ® \u003cspan\u003eAsset Management, LP\u003c/span\u003e (\u0026#34;\u003clocation idsrc=\"xmltag.org\" value=\"LU/us.tx.cusing\"\u003eCushing\u003c/location\u003e\u0026#34;) is an \u003cspan\u003eSEC\u003c/span\u003e-registered investment adviser headquartered in \u003clocation idsrc=\"xmltag.org\" value=\"LU/us.tx.dallas\"\u003eDallas, Texas\u003c/location\u003e. \u003clocation idsrc=\"xmltag.org\" value=\"LU/us.tx.cusing\"\u003eCushing\u003c/location\u003e serves as investment adviser to affiliated funds and managed accounts. \u003clocation idsrc=\"xmltag.org\" value=\"LU/us.tx.cusing\"\u003eCushing\u003c/location\u003e is doing business as \u003cspan\u003eNXG Investment Management\u003c/span\u003e. The Firm provides \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Next \u003c/span\u003e\u003c/span\u003e (LON:) Generation investment strategies to investors seeking long-term growth in companies focused on traditional and transformational infrastructure.\u003c/p\u003e\u003cp\u003e\u003ci\u003eContact:  \u003cbr/\u003e\u003c/i\u003e\u003cperson\u003eBlake Nelson\u003c/person\u003e\u003cbr/\u003e\u003cspan\u003eNXG Investment Management\u003c/span\u003e\u003cbr/\u003e214-692-6334\u003cbr/\u003ewww.nxgim.com\u003c/p\u003e\u003cp\u003eIMPORTANT INFORMATION\u003c/p\u003e\u003cp\u003eThis press release shall not constitute an offer to sell or a solicitation to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer or solicitation or sale would be unlawful prior to registration or qualification under the laws of such state or jurisdiction.\u003c/p\u003e\u003cp\u003eThis press release contains certain statements that may include \u0026#34;forward-looking statements\u0026#34; within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical fact, included herein are \u0026#34;forward-looking statements.\u0026#34; Although the Fund and \u003cspan\u003eNXG Investment Management\u003c/span\u003e believe that the expectations reflected in these forward-looking statements are reasonable, they do involve assumptions, risks and uncertainties, and these expectations may prove to be incorrect. Actual results could differ materially from those anticipated in these forward-looking statements as a result of a variety of factors, including those discussed in the company\u0026#39;s reports that are filed with the \u003cspan\u003eSecurities and Exchange Commission\u003c/span\u003e. You should not place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Other than as required by law, the Fund and \u003clocation idsrc=\"xmltag.org\" value=\"LU/us.tx.cusing\"\u003eCushing\u003c/location\u003e do not assume a duty to update this forward-looking statement.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-18T00:44:03Z",
  "modifiedTime": null
}
