{
  "id": "a261a694-f138-45ec-b023-3c053a7a06f3",
  "title": "Dr Morepen launches weight management product, forays into wellness biz",
  "link": "https://www.business-standard.com/companies/news/dr-morepen-launches-weight-management-product-forays-into-wellness-biz-124121001320_1.html",
  "description": "Company eyes Rs 30 crore revenue in first year, Rs 200 crore by 2030",
  "author": "",
  "published": "Wed, 11 Dec 2024 01:08:13 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Sanket Koul",
  "length": 2690,
  "excerpt": "Company eyes Rs 30 crore revenue in first year, Rs 200 crore by 2030",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "Medical device maker Dr Morepen, a wholly-owned subsidiary of Morepen Laboratories, on Tuesday forayed into the growing wellness segment with the launch of a weight management product, LightLife. The company aims to establish itself in the wellness market, which is currently valued at around Rs 12,000 crore and growing at an annual rate of 16 per cent. Commenting on the foray, Varun Suri, chief executive officer (CEO), Dr Morepen, said the company is looking to build long-term brands in India's wellness market, targeting Rs 200 crore in revenue from the LightLife brand by 2030. This move comes as over 25 per cent of Indian adults are projected to face obesity by 2035, according to a 2024 report by the World Obesity Atlas. \"India's obesity rate is increasing, and this segment is expected to touch $52.3 billion by 2032, reflecting the urgency to address weight management with solutions that are both safe and effective,\" Suri said. Suri added that the company is targeting Rs 30 crore in revenue from the programme in the first year. Dr Morepen currently generates around Rs 200 crore in revenue from its over-the-counter (OTC) product segment.More From This Section The LightLife products will initially be available in the direct-to-consumer (D2C) market via Dr Morepen’s website. The company plans to create awareness through media and influencers. \"Later on, we will be available in retail outlets and pharmacies within the next six to eight months,\" he added. Priced at Rs 599, the product is targeted at health-conscious individuals aged 25 and above, particularly in Tier-I and Tier-II cities. Suri also told Business Standard that the company plans to add products in gut health, proteins, Omega-3, and other wellness subgroups, which are currently in various stages of planning and research. Commenting on the markets in focus, Suri said, \"Our focus is purely on India as the problem we aim to solve is aligned with the Indian customer, their diet plans, fitness routines, and recipes.\" Suri added that the LightLife initiative promotes a healthy, balanced lifestyle through innovations like Slimbiome and Intelicaps, empowering individuals with scientifically validated solutions. \"The product leverages globally sourced prebiotics from the UK, probiotics from Belgium, and dietary fibre, aiming to enhance gut health, reduce cravings, and promote satiety. This addresses weight management beyond traditional calorie-counting methods or restrictive diets,\" he said. The product is supported by a comprehensive wellness programme, including personalised nutrition plans, strength training guidance, and a dedicated health app to track progress.",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-08/28/thumb/featurecrop/400X400/1724830651-8131.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tMedical device maker Dr Morepen, a wholly-owned subsidiary of Morepen Laboratories, on Tuesday forayed into the growing wellness segment with the launch of a weight management product, LightLife.\u003c/p\u003e\n\u003cp\u003e\n\tThe company aims to establish itself in the wellness market, which is currently valued at around Rs 12,000 crore and growing at an annual rate of 16 per cent.\u003c/p\u003e\n\u003cp\u003e\n\tCommenting on the foray, Varun Suri, chief executive officer (CEO), Dr Morepen, said the company is looking to build long-term brands in India\u0026#39;s wellness market, targeting Rs 200 crore in revenue from the LightLife brand by 2030.\u003c/p\u003e\n\u003cp\u003e\n\tThis move comes as over 25 per cent of Indian adults are projected to face obesity by 2035, according to a 2024 report by the World Obesity Atlas.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;India\u0026#39;s obesity rate is increasing, and this segment is expected to touch $52.3 billion by 2032, reflecting the urgency to address weight management with solutions that are both safe and effective,\u0026#34; Suri said.\u003c/p\u003e\n\u003cp\u003e\n\tSuri added that the company is targeting Rs 30 crore in revenue from the programme in the first year. Dr Morepen currently generates around Rs 200 crore in revenue from its over-the-counter (OTC) product segment.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eMore From This Section\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tThe LightLife products will initially be available in the direct-to-consumer (D2C) market via Dr Morepen’s website. The company plans to create awareness through media and influencers.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;Later on, we will be available in retail outlets and pharmacies within the next six to eight months,\u0026#34; he added.\u003c/p\u003e\n\u003cp\u003e\n\tPriced at Rs 599, the product is targeted at health-conscious individuals aged 25 and above, particularly in Tier-I and Tier-II cities.\u003c/p\u003e\n\u003cp\u003e\n\tSuri also told Business Standard that the company plans to add products in gut health, proteins, Omega-3, and other wellness subgroups, which are currently in various stages of planning and research.\u003c/p\u003e\n\u003cp\u003e\n\tCommenting on the markets in focus, Suri said, \u0026#34;Our focus is purely on India as the problem we aim to solve is aligned with the Indian customer, their diet plans, fitness routines, and recipes.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\n\tSuri added that the LightLife initiative promotes a healthy, balanced lifestyle through innovations like Slimbiome and Intelicaps, empowering individuals with scientifically validated solutions.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;The product leverages globally sourced prebiotics from the UK, probiotics from Belgium, and dietary fibre, aiming to enhance gut health, reduce cravings, and promote satiety. This addresses weight management beyond traditional calorie-counting methods or restrictive diets,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003e\n\tThe product is supported by a comprehensive wellness programme, including personalised nutrition plans, strength training guidance, and a dedicated health app to track progress.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-11T01:08:13+05:30",
  "modifiedTime": null
}
