{
  "id": "ba23cd47-0bec-4b89-b590-fb47f3213b6d",
  "title": "3 stocks Warren Buffett's Berkshire Hathaway is selling — and 2 stocks it's buying",
  "link": "https://finance.yahoo.com/news/3-stocks-warren-buffetts-berkshire-153500045.html",
  "description": "",
  "author": "",
  "published": "2025-05-16T16:12:16Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Shannon Carroll",
  "length": 2653,
  "excerpt": "Warren Buffett may be stepping down as Berkshire Hathaway’s CEO at the end of the year, but he’s still making all sorts of market moves until then. In the...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Photo: Michael M. Santiago (Getty Images) Warren Buffett may be stepping down as Berkshire Hathaway’s CEO at the end of the year, but he’s still making all sorts of market moves until then. In the holding company’s latest SEC filing, Berkshire reported that it was a net seller of U.S. stocks, buying $3.2 billion and selling around $4.7 billion. The holding company continues to make its way out of the financial markets, unloading three financial stocks: Bank of America (BAC), Capital One (COF), and Citi (C). Berkshire sold 7.2% of its stake in Bank of America — 48.7 million shares for an estimated $2.1 billion — as it continued a move that began in the back half of 2024, when it sold 34% of its stake. Buffett’s company also offloaded 4% of its stake in Capital One and sold all its remaining shares in Citi. That retreat from banking appears to be part of a broader realignment. While Berkshire is unwinding some of its traditional financial holdings, it’s also doubling down on consumer-facing plays — namely, beverages. Berkshire saw an opening in Constellation Brands (STZ), doubling its stake to more than 12 million shares from the 5.6 million it purchased in the fourth quarter. Constellation is the parent company of Corona and Modelo — which continues to gain traction in the U.S., especially among Hispanic consumers — along with premium wine labels like Robert Mondavi and Kim Crawford. Shares of Constellation rose over 3% overnight following the disclosure. While alcohol has been less trendy among younger purchasers (cannabis-infused and nonalcoholic drinks are growing in popularity), Buffett, the “Oracle of Omaha,” has made a large chunk of his fortune on buying stocks he thinks are undervalued. The holding company also made another big purchase — but it’s unclear just what it was. In the SEC filing, Berkshire said it “has omitted from this public Form 13F one or more holding(s) for which it is requesting confidential treatment.” That kind of secrecy often signals that Berkshire is building a large position over multiple quarters and doesn’t want to alert the market too early. The $2 billion line item was filed under the vague “commercial, industrial, and other” category — Barron’s speculated the mystery stock could be an industrial company. The 13F filing represents a slightly out-of-date snapshot because companies have 45 days after a quarter ends to disclose their holdings. Berkshire’s latest filing only covers positions as of March 31 — so it doesn’t include any moves it made as a result of President Donald Trump’s sweeping “Liberation Day” tariff announcement on April 2.",
  "image": "https://media.zenfs.com/en/quartz.com/64c2162dd78a24f82a1d0d5b0e37c7a2",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e   \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"Photo: Michael M. Santiago (Getty Images)\" loading=\"eager\" height=\"533\" width=\"800\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003ePhoto: Michael M. Santiago (Getty Images)  \u003c/figcaption\u003e \u003c/figure\u003e   \u003cp\u003eWarren Buffett may be stepping down \u003ca href=\"https://qz.com/warren-buffett-berkshire-hathaway-ceo-retire-1851779023?_gl=1*1ed4whp*_ga*MTYxMDk3MTU2Ny4xNzQ2MTI1NDM3*_ga_V4QNJTT5L0*czE3NDc0MDMyMDgkbzI4JGcxJHQxNzQ3NDA0OTc5JGo2MCRsMCRoMCRkeW9zMWFpT1JHdWxiMlFpRXpXSEZWWUdaYzhOZ0cyUkY1Zw..\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:as Berkshire Hathaway’s CEO;elm:context_link;itc:0;sec:content-canvas\"\u003eas Berkshire Hathaway’s CEO\u003c/a\u003e at the end of the year, but he’s still making all sorts of market moves until then. In the holding company’s latest SEC filing, Berkshire reported that it was a net seller of U.S. stocks, buying $3.2 billion and selling around $4.7 billion.\u003c/p\u003e      \u003cp\u003eThe holding company continues to make its way out of the financial markets, unloading three financial stocks: Bank of America (\u003ca href=\"https://qz.com/quote/BAC\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:BAC;elm:context_link;itc:0;sec:content-canvas\"\u003eBAC\u003c/a\u003e), Capital One (\u003ca href=\"https://qz.com/quote/COF\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:COF;elm:context_link;itc:0;sec:content-canvas\"\u003eCOF\u003c/a\u003e), and Citi (\u003ca href=\"https://qz.com/quote/C\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:C;elm:context_link;itc:0;sec:content-canvas\"\u003eC\u003c/a\u003e).\u003c/p\u003e   \u003cp\u003eBerkshire sold 7.2% of its stake in Bank of America — 48.7 million shares for an estimated $2.1 billion — as it continued a move that began in the back half of 2024, when it sold 34% of its stake. Buffett’s company also offloaded 4% of its stake in Capital One and sold all its remaining shares in Citi.\u003c/p\u003e   \u003cp\u003eThat retreat from banking appears to be part of a broader realignment. While Berkshire is unwinding some of its traditional financial holdings, it’s also doubling down on consumer-facing plays — namely, beverages.\u003c/p\u003e      \u003cp\u003eBerkshire saw an opening in Constellation Brands (\u003ca href=\"https://qz.com/quote/STZ\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:STZ;elm:context_link;itc:0;sec:content-canvas\"\u003eSTZ\u003c/a\u003e), doubling its stake to more than 12 million shares from the 5.6 million it purchased in the fourth quarter. Constellation is the parent company of Corona and Modelo — which continues to gain traction in the U.S., especially among Hispanic consumers — along with premium wine labels like Robert Mondavi and Kim Crawford. Shares of Constellation rose over 3% overnight following the disclosure.\u003c/p\u003e   \u003cp\u003eWhile alcohol has been less trendy among younger purchasers (cannabis-infused and nonalcoholic drinks are growing in popularity), Buffett, the “Oracle of Omaha,” has made a large chunk of his fortune on \u003ca href=\"https://qz.com/warren-buffett-retires-berkshire-hathaway-predictions-1851779117?_gl=1*1gyqkft*_ga*MTYxMDk3MTU2Ny4xNzQ2MTI1NDM3*_ga_V4QNJTT5L0*czE3NDc0MDMyMDgkbzI4JGcxJHQxNzQ3NDA0OTc5JGo2MCRsMCRoMCRkeW9zMWFpT1JHdWxiMlFpRXpXSEZWWUdaYzhOZ0cyUkY1Zw..\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:buying stocks he thinks are undervalued;elm:context_link;itc:0;sec:content-canvas\"\u003ebuying stocks he thinks are undervalued\u003c/a\u003e.\u003c/p\u003e      \u003cp\u003eThe holding company also made another big purchase — but it’s unclear just what it was. In the SEC filing, Berkshire said it “has omitted from this public Form 13F one or more holding(s) for which it is requesting confidential treatment.” That kind of secrecy often signals that Berkshire is building a large position over multiple quarters and doesn’t want to alert the market too early.\u003c/p\u003e   \u003cp\u003eThe $2 billion line item was filed under the vague “commercial, industrial, and other” category — \u003ca href=\"https://www.barrons.com/articles/berkshire-mystery-stock-buy-buffett-ecb182c4\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Barron’s speculated;elm:context_link;itc:0;sec:content-canvas\"\u003eBarron’s speculated\u003c/a\u003e the mystery stock could be an industrial company.\u003c/p\u003e      \u003cp\u003eThe 13F filing represents a slightly out-of-date snapshot because companies have 45 days after a quarter ends to disclose their holdings. Berkshire’s latest filing only covers positions as of March 31 — so it doesn’t include any moves it made as a result of President Donald Trump’s sweeping “Liberation Day” tariff announcement on April 2.\u003c/p\u003e \u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-bf2572f3-feee-3371-ad56-15962bcb98c4\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-ba3ec3fd-8022-4879-9adf-a5c314fe8420\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-86edb859-b7fb-4900-b9b9-84c7088e4216\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-022c39ea-4578-3e22-a7db-b8beecc2c1f0\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-16T16:12:16Z",
  "modifiedTime": null
}
