{
  "id": "c15d133a-f9e9-46d9-82b4-35929ee51d57",
  "title": "Macron says France and the UK will ‘save Europe’ even though Brexit was all about Britain leaving the EU",
  "link": "https://fortune.com/2025/07/08/macron-visit-london-parliament-save-europe-uk-britain-brexit/",
  "description": "\"We will save Europe by our example and our solidarity,\" the French President told both houses of Parliament.",
  "author": "Jill Lawless, The Associated Press",
  "published": "Tue, 08 Jul 2025 21:15:49 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "World"
  ],
  "byline": "Jill Lawless,The Associated Press",
  "length": 6267,
  "excerpt": "\"We will save Europe by our example and our solidarity,\" the French President told both houses of Parliament.",
  "siteName": "Fortune",
  "favicon": "https://fortune.com/icons/favicons/apple-touch-icon.png",
  "text": "French President Emmanuel Macron on Tuesday urged Britain to stick close to its neighbors despite its exit from the European Union, saying France and the U.K. will “save Europe” by standing for democracy, law and international order in a dangerous world. On a state visit that mixed royal pageantry with tough political talks on Ukraine and migration, Macron said Europe must strengthen its economy and defenses and reduce its dependence “on both the U.S. and China.” Macron’s three-day trip, at the invitation of King Charles III, is the first state visit to the U.K. by a European Union head of state since Brexit, and a symbol of the U.K. government’s desire to reset relations with the bloc after Britain acrimoniously left the EU in 2020. Macron addressed members of both houses of Britain’s Parliament packed into the building’s ornate Royal Gallery. He said the two countries represent “a world order based on law, justice and respect for territorial integrity, an order that is today being attacked on a daily basis.” “The United Kingdom and France must once again show the world that our alliance can make all the difference,” Macron said, adding that “we will save Europe by our example and our solidarity.”He said that even though Britain has left the EU, “the United Kingdom cannot stay on the sidelines. Because defense and security, competitiveness, democracy — the very core of our identity — are connected across Europe as a continent.” Pomp and politics The French president and his wife, Brigitte Macron, were treated to the full force of British ceremonial charm, a far cry from the chilly relations of 2022, when then-Foreign Secretary Liz Truss said that the “jury is out” on whether Macron was a friend or a foe. The Macrons were greeted at London’s RAF Northolt air base by Prince William and his wife Catherine — wearing a dress by French design house Christian Dior — before being met by King Charles and Queen Camilla in Windsor, west of London. They were driven to the almost 1,000-year-old royal residence of Windsor Castle in horse-drawn carriages, through streets bedecked in Union Jacks and French tricolor flags. The king and queen hosted a banquet for the Macrons at Windsor Castle on Tuesday evening, with 160 guests including politicians, diplomats and celebrities such as Mick Jagger and Elton John. They were served summer vegetables, chicken with asparagus and iced blackcurrant parfait, along with Champagne and a gin-infused cocktail called L’entente, after the “entente cordiale” struck between Britain and France in 1904. As monarch, Charles is expected to be above politics, but he spoke about the support Britain and France give Ukraine “in defense of our shared values,” noted the challenge of “irregular migration across the English Channel” and said the two countries face “complex threats, emanating from multiple directions.“As friends and as allies, we face them together,” Charles said. New tactics to stop boats Politics will take center stage on Wednesday, when Macron sits down for talks with U.K. Prime Minister Keir Starmer on migration, defense and investment — including a 12.5% stake by French energy firm EDF in a new nuclear power plant planned for eastern England. Macron also came bearing a tantalizing cultural gift: an agreement to send the Bayeux Tapestry to Britain for the first time in more than 900 years. The 70-meter (230-foot) tapestry showing the Norman conquest of England in 1066 will go on display at the British Museum from September 2026 to July 2027. At talks Wednesday and a U.K.-France summit on Thursday, Macron and Starmer will discuss ways to stop migrants from crossing the English Channel in small boats and try to advance plans for a post-ceasefire security force for Ukraine, despite apparent U.S. indifference to the idea and Russia’s refusal to halt the onslaught on its neighbor. Britain receives fewer asylum-seekers than Mediterranean European countries, but thousands of migrants each year use northern France as a launching point to reach the U.K., either by stowing away in trucks or — after a clampdown on that route — in small boats across one of the world’s busiest shipping lanes.The U.K. has struck a series of deals with France over the years to increase patrols of beaches and share intelligence in an attempt to disrupt the smuggling gangs. It has all had only a limited impact. About 37,000 people were detected crossing the English Channel in small boats in 2024, and more than 20,000 people made the crossing in the first six months of 2025, up by about 50% from the same period last year. Dozens of people have died trying to cross. British officials have been pushing for French police to intervene more forcefully to stop the boats, and welcomed the sight of officers slashing rubber dinghies with knives in recent days. France is also considering a U.K. proposal for a “one-in, one-out” deal that would see France take back some migrants who reached Britain, in return for the U.K. accepting some of those in France. Macron said the leaders would try “to fix today what is a burden for our two countries.”“France and the U.K. have a shared responsibility to address irregular migration with humanity, solidarity and fairness,” he said. Keeping Ukraine in focus Starmer and Macron have worked closely together to rally support for Ukraine, though they have taken contrasting approaches to U.S. President Donald Trump, with Macron more willing to challenge the American president than the emollient Starmer. Britain and France have led efforts to form an international peacekeeping force for Ukraine to reinforce a future ceasefire with European troops and equipment and U.S. security guarantees. Trump has shown little enthusiasm for the idea, however, and a ceasefire remains elusive. British officials say the “coalition of the willing” idea is alive and well, with Macron and Starmer due to join an international videoconference on Thursday to discuss planning for the force. Macron said the coalition was a sign that “Europeans will never abandon Ukraine – never.”Introducing the 2025 Fortune 500, the definitive ranking of the biggest companies in America. Explore this year's list.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2223475800.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eFrench President \u003ca href=\"https://apnews.com/hub/emmanuel-macron\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/hub/emmanuel-macron\"\u003eEmmanuel Macron\u003c/a\u003e on Tuesday urged Britain to stick close to its neighbors despite its exit from the European Union, saying France and the U.K. will “save Europe” by standing for democracy, law and international order in a dangerous world.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eOn a \u003ca href=\"https://apnews.com/photo-gallery/france-macron-state-visit-uk-king-charles-iii-a939fb473d4037347536600b6e789f48\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/photo-gallery/france-macron-state-visit-uk-king-charles-iii-a939fb473d4037347536600b6e789f48\"\u003estate visit\u003c/a\u003e that mixed \u003ca href=\"https://apnews.com/article/britain-france-macron-state-visit-royals-2a8b136d78f5693fb3a6afe50a2bf7ef\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/britain-france-macron-state-visit-royals-2a8b136d78f5693fb3a6afe50a2bf7ef\"\u003eroyal pageantry with tough political talks\u003c/a\u003e on Ukraine and migration, Macron said Europe must strengthen its economy and defenses and reduce its dependence “on both the U.S. and China.”\n\n\n\n\u003c/p\u003e\u003cp\u003eMacron’s three-day trip, at the invitation of \u003ca href=\"https://apnews.com/hub/king-charles-iii\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/hub/king-charles-iii\"\u003eKing Charles III\u003c/a\u003e, is the first state visit to the U.K. by a European Union head of state since Brexit, and a symbol of the U.K. government’s desire to reset relations with the bloc after Britain acrimoniously left the EU in 2020.\n\n\n\n\u003c/p\u003e\u003cp\u003eMacron addressed members of both houses of Britain’s Parliament packed into the building’s ornate Royal Gallery. He said the two countries represent “a world order based on law, justice and respect for territorial integrity, an order that is today being attacked on a daily basis.”\n\n\n\n\u003c/p\u003e\u003cp\u003e“The United Kingdom and France must once again show the world that our alliance can make all the difference,” Macron said, adding that “we will save Europe by our example and our solidarity.”\u003c/p\u003e\u003cp\u003eHe said that even though Britain has left the EU, “the United Kingdom cannot stay on the sidelines. Because defense and security, competitiveness, democracy — the very core of our identity — are connected across Europe as a continent.”\n\n\n\n\u003c/p\u003e\u003ch4\u003ePomp and politics\u003c/h4\u003e\n\n\n\n\u003cp\u003eThe French president and his wife, \u003ca href=\"https://apnews.com/article/macron-brigitte-wife-french-president-vietnam-viral-video-82dbcd00d45b6a7718e855a9f4414a26\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/macron-brigitte-wife-french-president-vietnam-viral-video-82dbcd00d45b6a7718e855a9f4414a26\"\u003eBrigitte Macron\u003c/a\u003e, were treated to the full force of British ceremonial charm, a far cry from the chilly relations of 2022, when then-Foreign Secretary Liz Truss said that the “jury is out” on whether Macron was a friend or a foe.\n\n\n\n\u003c/p\u003e\u003cp\u003eThe Macrons were greeted at London’s RAF Northolt air base by Prince William and his wife Catherine — wearing a dress by French design house \u003ca href=\"https://fortune.com/company/christian-dior/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/christian-dior/\"\u003eChristian Dior\u003c/a\u003e — before being met by King Charles and Queen Camilla in Windsor, west of London. They were driven to the almost 1,000-year-old royal residence of Windsor Castle in horse-drawn carriages, through streets bedecked in Union Jacks and French tricolor flags.\n\n\n\n\u003c/p\u003e\u003cp\u003eThe king and queen hosted a banquet for the Macrons at Windsor Castle on Tuesday evening, with 160 guests including politicians, diplomats and celebrities such as Mick Jagger and Elton John. They were served summer vegetables, chicken with asparagus and iced blackcurrant parfait, along with Champagne and a gin-infused cocktail called L’entente, after the “entente cordiale” struck between Britain and France in 1904.\n\n\n\n\u003c/p\u003e\u003cp\u003eAs monarch, Charles is expected to be above politics, but he spoke about the support Britain and France give Ukraine “in defense of our shared values,” noted the challenge of “irregular migration across the English Channel” and said the two countries face “complex threats, emanating from multiple directions.\u003c/p\u003e\u003cp\u003e“As friends and as allies, we face them together,” Charles said.\n\n\n\n\u003c/p\u003e\u003ch4\u003eNew tactics to stop boats\u003c/h4\u003e\n\n\n\n\u003cp\u003ePolitics will take center stage on Wednesday, when Macron sits down for talks with U.K. Prime Minister \u003ca href=\"https://apnews.com/article/uk-starmer-labour-welfare-rebellion-ec78160cfff4673978916a3f86b67a5e\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/uk-starmer-labour-welfare-rebellion-ec78160cfff4673978916a3f86b67a5e\"\u003eKeir Starmer\u003c/a\u003e on migration, defense and investment — including a 12.5% stake by French energy firm EDF in a new nuclear power plant planned for eastern England.\n\n\n\n\u003c/p\u003e\u003cp\u003eMacron also came bearing a tantalizing cultural gift: an agreement to send the \u003ca href=\"https://apnews.com/article/bayeux-tapestry-british-museum-france-england-8d93d40468884ae146f9fffd257b595d\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/bayeux-tapestry-british-museum-france-england-8d93d40468884ae146f9fffd257b595d\"\u003eBayeux Tapestry\u003c/a\u003e to Britain for the first time in more than 900 years. The 70-meter (230-foot) \u003ca href=\"https://fortune.com/company/coach/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/coach/\"\u003etapestry\u003c/a\u003e showing the Norman conquest of England in 1066 will go on display at the British Museum from September 2026 to July 2027.\n\n\n\n\u003c/p\u003e\u003cp\u003eAt talks Wednesday and a U.K.-France summit on Thursday, Macron and Starmer will discuss ways to stop migrants from \u003ca href=\"https://apnews.com/article/france-britain-migration-small-boats-1faf4d1342713bcc5842198e8a5dce4b\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/france-britain-migration-small-boats-1faf4d1342713bcc5842198e8a5dce4b\"\u003ecrossing the English Channel in small boats\u003c/a\u003e and try to advance plans for a post-ceasefire \u003ca href=\"https://apnews.com/article/ukraine-russia-force-coalition-britain-france-nato-4c87525361eb3cf1c860075d4519f6d8\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/ukraine-russia-force-coalition-britain-france-nato-4c87525361eb3cf1c860075d4519f6d8\"\u003esecurity force for Ukraine\u003c/a\u003e, despite apparent U.S. indifference to the idea and Russia’s refusal to halt the onslaught on its neighbor.\n\n\n\n\u003c/p\u003e\u003cp\u003eBritain receives fewer asylum-seekers than Mediterranean European countries, but thousands of migrants each year use northern France as a launching point to reach the U.K., either by stowing away in trucks or — after a clampdown on that route — in small boats across one of the world’s busiest shipping lanes.\u003c/p\u003e\u003cp\u003eThe U.K. has struck a series of deals with France over the years to \u003ca href=\"https://apnews.com/article/france-britain-migration-small-boats-1faf4d1342713bcc5842198e8a5dce4b\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/france-britain-migration-small-boats-1faf4d1342713bcc5842198e8a5dce4b\"\u003eincrease patrols of beaches\u003c/a\u003e and share intelligence in an attempt to disrupt the smuggling gangs.\n\n\n\n\u003c/p\u003e\u003cp\u003eIt has all had only a limited impact. About 37,000 people were detected crossing the English Channel in small boats in 2024, and more than 20,000 people \u003ca href=\"https://apnews.com/article/britain-migrants-small-boats-france-english-channel-e92039de5c23d3dc9ad8f16ffa86b8fc\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/britain-migrants-small-boats-france-english-channel-e92039de5c23d3dc9ad8f16ffa86b8fc\"\u003emade the crossing\u003c/a\u003e in the first six months of 2025, up by about 50% from the same period last year. Dozens of people have died trying to cross.\n\n\n\n\u003c/p\u003e\u003cp\u003eBritish officials have been pushing for French police to intervene more forcefully to stop the boats, and welcomed the sight of officers \u003ca href=\"https://apnews.com/article/france-britain-migration-small-boats-1faf4d1342713bcc5842198e8a5dce4b\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/france-britain-migration-small-boats-1faf4d1342713bcc5842198e8a5dce4b\"\u003eslashing rubber dinghies\u003c/a\u003e with knives in recent days.\n\n\n\n\u003c/p\u003e\u003cp\u003eFrance is also considering a U.K. proposal for a “one-in, one-out” deal that would see France take back some migrants who reached Britain, in return for the U.K. accepting some of those in France.\n\n\n\n\u003c/p\u003e\u003cp\u003eMacron said the leaders would try “to fix today what is a burden for our two countries.”\u003c/p\u003e\u003cp\u003e“France and the U.K. have a shared responsibility to address irregular migration with humanity, solidarity and fairness,” he said.\n\n\n\n\u003c/p\u003e\u003ch4\u003eKeeping Ukraine in focus\u003c/h4\u003e\n\n\n\n\u003cp\u003eStarmer and Macron have worked closely together to \u003ca href=\"https://apnews.com/article/france-ukraine-macron-coalition-starmer-14b7ac6496283564a366d50fb3220f0b\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/france-ukraine-macron-coalition-starmer-14b7ac6496283564a366d50fb3220f0b\"\u003erally support\u003c/a\u003e for Ukraine, though they have taken \u003ca href=\"https://apnews.com/article/starmer-washington-white-house-trump-ukraine-us-5f7814b6dd2f71d8cf575fa9301a1593\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://apnews.com/article/starmer-washington-white-house-trump-ukraine-us-5f7814b6dd2f71d8cf575fa9301a1593\"\u003econtrasting approaches\u003c/a\u003e to U.S. President Donald Trump, with Macron more willing to challenge the American president than the emollient Starmer.\n\n\n\n\u003c/p\u003e\u003cp\u003eBritain and France have led efforts to form an international peacekeeping force for Ukraine to reinforce a future ceasefire with European troops and equipment and U.S. security guarantees.\n\n\n\n\u003c/p\u003e\u003cp\u003eTrump has shown little enthusiasm for the idea, however, and a ceasefire remains elusive. British officials say the “coalition of the willing” idea is alive and well, with Macron and Starmer due to join an international videoconference on Thursday to discuss planning for the force.\n\n\n\n\u003c/p\u003e\u003cp\u003eMacron said the coalition was a sign that “Europeans will never abandon Ukraine – never.”\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eIntroducing the 2025 Fortune 500\u003c/strong\u003e, the definitive ranking of the biggest companies in America. \u003ca href=\"https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\"\u003eExplore this year\u0026#39;s list.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
