{
  "id": "c2ef83ef-fc78-4cb9-a8f6-7b06dc20e771",
  "title": "Powell asks inspector general to review $2.5 billion renovation after Trump blasts Fed project",
  "link": "https://www.cnbc.com/2025/07/14/fed-chair-powell-asks-inspector-general-to-review-controversial-building-project.html",
  "description": "Powell asked for the review following blistering criticism of the project.",
  "author": "",
  "published": "Mon, 14 Jul 2025 17:33:24 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Jeff Cox",
  "length": 2859,
  "excerpt": "Powell asked for the review following blistering criticism of the project.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Construction on the Marriner S. Eccles Federal Reserve building in Washington, DC, US, on Wednesday, June 25, 2025. Al Drago | Bloomberg | Getty ImagesThe Federal Reserve has brought in its inspector general to review a building expansion that has drawn fire from the White House, according to a source familiar with the issue.Fed Chair Jerome Powell asked for the review, following blistering criticism of the project, initially pegged at $2.5 billion but hit by cost overruns that have brought accusations from President Donald Trump and other administration officials of \"fundamental mismanagement.\"\"The idea that the Fed could print money and then spend $2.5 billion on a building without real congressional oversight, it didn't occur to the people that framed the Federal Reserve Act,\" Kevin Hassett, director of the National Economic Council, said Monday on CNBC's \"Squawk Box.\" \"We've got a real problem of oversight and excess spending.\"The inspector general serves the Fed and the Consumer Financial Protection Bureau and is responsible for looking for fraud, waste and abuse. Powell's request was reported first by Axios.In a letter posted to social media last week, Russell Vought, head of the Office of Management and Budget, also slammed the project, which involves two of the Fed's three Washington, D.C., buildings including its main headquarters known as the Eccles Building.Vought, during a CNBC interview Friday, likened the building to the Palace of Versailles in France and charged that Powell was guilty of \"fiscal mismanagement\" at the Fed.For its part, the central bank has posted a detailed frequently asked questions page on its site, highlighting key details and explaining why some of the specifications were changed or \"scaled back or eliminated\" at least in part due to higher-than-expected construction costs.\"The project also remediates safety issues by removing hazardous materials such as asbestos and lead and will bring the buildings up to modern code,\" the page explains. \"While periodic work has been done to keep the buildings occupiable, neither building has seen a comprehensive renovation since they were constructed.\"The Fed is not a taxpayer-funded institution and is therefore not under the OMB's supervision. It has worked with the National Capital Planning Commission in Washington on the project, but also noted on the FAQ page that it \"does not regard any of those changes as warranting further review.\"In separate comments, former Fed Governor Kevin Warsh, speaking Sunday on Fox News, called the renovation costs \"outrageous\" and said it was more evidence the central bank \"has lost its way.\" Warsh is considered a strong contender to succeed Powell when the latter's term as chair expires in May 2026.Clarification: This article has been updated to clarify that Warsh's comments originally aired on Fox News.",
  "image": "https://image.cnbcfm.com/api/v1/image/108170384-1752170359976-gettyimages-2221381748-FEDERAL_RESERVE.jpeg?v=1752505021\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108170384\" data-test=\"InlineImage\"\u003e\u003cp\u003eConstruction on the Marriner S. Eccles Federal Reserve building in Washington, DC, US, on Wednesday, June 25, 2025. \u003c/p\u003e\u003cp\u003eAl Drago | Bloomberg | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe \u003ca href=\"https://www.cnbc.com/federal-reserve/\"\u003eFederal Reserve\u003c/a\u003e has brought in its inspector general to review a building expansion that has drawn fire from the White House, according to a source familiar with the issue.\u003c/p\u003e\u003cp\u003eFed Chair \u003ca href=\"https://www.cnbc.com/jay-powell/\"\u003eJerome Powell\u003c/a\u003e asked for the review, following blistering criticism of the project, initially pegged at $2.5 billion but hit by cost overruns that have brought accusations from President \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e and other administration officials of \u0026#34;fundamental mismanagement.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;The idea that the Fed could print money and then spend $2.5 billion on a building without real congressional oversight, it didn\u0026#39;t occur to the people that framed the Federal Reserve Act,\u0026#34; Kevin Hassett, director of the National Economic Council, said Monday on CNBC\u0026#39;s \u0026#34;\u003ca href=\"https://www.cnbc.com/squawk-box-us/\"\u003eSquawk Box\u003c/a\u003e.\u0026#34; \u0026#34;We\u0026#39;ve got a real problem of oversight and excess spending.\u0026#34;\u003c/p\u003e\u003cp\u003eThe inspector general serves the Fed and the Consumer Financial Protection Bureau and is responsible for looking for fraud, waste and abuse. Powell\u0026#39;s request was reported first by Axios.\u003c/p\u003e\u003cp\u003eIn a letter posted to social media last week, Russell Vought, head of the Office of Management and Budget, \u003ca href=\"https://www.cnbc.com/2025/07/11/trump-budget-chief-vought-ramps-up-criticism-of-powell-vows-investigation-into-fed-renovations.html\"\u003ealso slammed the project\u003c/a\u003e, which involves two of the Fed\u0026#39;s three Washington, D.C., buildings including its main headquarters known as the Eccles Building.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108171457\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000382228\" aria-labelledby=\"Placeholder-ArticleBody-Video-108171457\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108171458-17524966941752496691-40715330485-1080pnbcnews.jpg?v=1752496693\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"National Economic Council Director Hassett: The Fed has been \u0026#39;very, very wrong\u0026#39; on the tariff issue\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eVought, during a CNBC interview Friday, likened the building to the Palace of Versailles in France and charged that Powell was guilty of \u0026#34;fiscal mismanagement\u0026#34; at the Fed.\u003c/p\u003e\u003cp\u003eFor its part, the central bank has posted a detailed \u003ca href=\"https://www.federalreserve.gov/faqs/building-project-faqs.htm\" target=\"_blank\"\u003efrequently asked questions page\u003c/a\u003e on its site, highlighting key details and explaining why some of the specifications were changed or \u0026#34;scaled back or eliminated\u0026#34; at least in part due to higher-than-expected construction costs.\u003c/p\u003e\u003cp\u003e\u0026#34;The project also remediates safety issues by removing hazardous materials such as asbestos and lead and will bring the buildings up to modern code,\u0026#34; the page explains. \u0026#34;While periodic work has been done to keep the buildings occupiable, neither building has seen a comprehensive renovation since they were constructed.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Fed is not a taxpayer-funded institution and is therefore not under the OMB\u0026#39;s supervision. It has worked with the National Capital Planning Commission in Washington on the project, but also noted on the FAQ page that it \u0026#34;does not regard any of those changes as warranting further review.\u0026#34;\u003c/p\u003e\u003cp\u003eIn separate comments, former Fed Governor Kevin Warsh, speaking Sunday on Fox News, called the renovation costs \u0026#34;outrageous\u0026#34; and said it was more evidence the central bank \u0026#34;has lost its way.\u0026#34; Warsh is considered a strong contender to succeed Powell when the latter\u0026#39;s term as chair expires in May 2026.\u003c/p\u003e\u003cp\u003e\u003cem\u003eClarification: This article has been updated to clarify that Warsh\u0026#39;s comments originally aired on Fox News.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-14T15:43:31Z",
  "modifiedTime": "2025-07-14T17:33:24Z"
}
