{
  "id": "d1c928a3-9f84-40db-a1b2-3fee5ff2dea1",
  "title": "Boeing issues layoff notices to more than 400 workers as it begins drastic cuts",
  "link": "https://fortune.com/2024/11/16/boeing-layoff-notices-400-workers-union-engineers-10-percent-labor-cuts/",
  "description": "Boeing announced in October that it planned to cut 10% of its workforce, about 17,000 jobs, in the coming months.",
  "author": "The Associated Press",
  "published": "Sat, 16 Nov 2024 22:59:31 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Business"
  ],
  "byline": "The Associated Press",
  "length": 2240,
  "excerpt": "Boeing announced in October that it planned to cut 10% of its workforce, about 17,000 jobs, in the coming months.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "Boeing has delivered layoff notices to more than 400 members of its professional aerospace labor union, part of thousands of cuts planned as the company struggles to recover from financial and regulatory trouble as well as an eight-week strike by its Machinists union. The pink slips went out last week to members of the Society of Professional Engineering Employees in Aerospace, or SPEEA, The Seattle Times reported. The workers will remain on the payroll through mid-January. Boeing announced in October that it planned to cut 10% of its workforce, about 17,000 jobs, in the coming months. CEO Kelly Ortberg told employees the company must “reset its workforce levels to align with our financial reality.” The Society of Professional Engineering Employees in Aerospace, or SPEEA, union said the cuts had affected 438 members. The union’s local chapter has 17,000 Boeing employees who are largely based in Washington, with some in Oregon, California and Utah. Of those 438 workers, 218 are members of SPEEA’s professional unit, which includes engineers and scientists. The rest are members of the technical unit, which includes analysts, planners, technicians and skilled tradespeople. Eligible employees will receive career transition services and subsidized health care benefits for up to three months. Workers will also receive severance, typically about one week of pay for every year of service. Boeing’s unionized Machinists began returning to work earlier this month following the strike. The strike strained Boeing’s finances. But Ortberg said on an October call with analysts that it did not cause the layoffs, which he described as a result of overstaffing. Boeing, based in Arlington, Virginia, has been in financial and regulatory trouble since a panel blew off the fuselage of an Alaska Airlines plane in January. Production rates slowed to a crawl, and the Federal Aviation Administration capped production of the 737 MAX at 38 planes per month, a threshold Boeing has yet to reach.How many degrees of separation are you from the globe's most powerful business leaders? Explore who made our brand-new list of the 100 Most Powerful People in Business. Plus, learn about the metrics we used to make it.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/11/GettyImages-2158860663-e1731797015691.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003cp\u003e\u003ca href=\"https://fortune.com/company/boeing/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/boeing/\"\u003eBoeing\u003c/a\u003e has delivered layoff notices to more than 400 members of its professional aerospace labor union, part of thousands of cuts planned as the company struggles to recover from \u003ca href=\"https://apnews.com/article/boeing-faa-safety-review-b5bee514e8da2e3feccfd9a5e13564a4\" target=\"_blank\" aria-label=\"Go to https://apnews.com/article/boeing-faa-safety-review-b5bee514e8da2e3feccfd9a5e13564a4\" rel=\"noopener\"\u003efinancial and regulatory\u003c/a\u003e trouble as well as an \u003ca href=\"https://apnews.com/article/boeing-production-after-strike-union-machinists-f79201d575565b69ccfdf21710108a09\" target=\"_blank\" aria-label=\"Go to https://apnews.com/article/boeing-production-after-strike-union-machinists-f79201d575565b69ccfdf21710108a09\" rel=\"noopener\"\u003eeight-week strike\u003c/a\u003e by its Machinists union.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eThe pink slips went out last week to members of the Society of Professional Engineering Employees in Aerospace, or SPEEA, \u003ca href=\"https://www.seattletimes.com/business/boeing-aerospace/boeing-lays-off-400-plus-members-of-speea-professional-aerospace-union/\" target=\"_blank\" aria-label=\"Go to https://www.seattletimes.com/business/boeing-aerospace/boeing-lays-off-400-plus-members-of-speea-professional-aerospace-union/\" rel=\"noopener\"\u003eThe Seattle Times reported\u003c/a\u003e. The workers will remain on the payroll through mid-January.\u003c/p\u003e\n\n\n\n\u003cp\u003eBoeing \u003ca href=\"https://apnews.com/article/boeing-layoffs-strike-airplane-factories-de637999cf525699577b42b72bff2a70\" target=\"_blank\" aria-label=\"Go to https://apnews.com/article/boeing-layoffs-strike-airplane-factories-de637999cf525699577b42b72bff2a70\" rel=\"noopener\"\u003eannounced in October\u003c/a\u003e that it planned to cut 10% of its workforce, about 17,000 jobs, in the coming months. CEO Kelly Ortberg told employees the company must “reset its workforce levels to align with our financial reality.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Society of Professional Engineering Employees in Aerospace, or SPEEA, union said the cuts had affected 438 members. The union’s local chapter has 17,000 Boeing employees who are largely based in Washington, with some in Oregon, California and Utah.\u003c/p\u003e\n\n\n\n\u003cp\u003eOf those 438 workers, 218 are members of SPEEA’s professional unit, which includes engineers and scientists. The rest are members of the technical unit, which includes analysts, planners, technicians and skilled tradespeople.\u003c/p\u003e\n\n\n\n\u003cp\u003eEligible employees will receive career transition services and subsidized health care benefits for up to three months. Workers will also receive severance, typically about one week of pay for every year of service.\u003c/p\u003e\n\n\n\n\u003cp\u003eBoeing’s unionized Machinists began returning to work earlier this month following the strike.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe strike strained Boeing’s finances. But Ortberg said on an October call with analysts that it did not cause the layoffs, which he described as a result of overstaffing.\u003c/p\u003e\n\n\n\n\u003cp\u003eBoeing, based in Arlington, Virginia, has been in financial and regulatory trouble since a \u003ca href=\"https://apnews.com/article/ntsb-boeing-max-blowout-alaska-airlines-9057d70b2f85b06caa80d6ba7a91826a\" target=\"_blank\" aria-label=\"Go to https://apnews.com/article/ntsb-boeing-max-blowout-alaska-airlines-9057d70b2f85b06caa80d6ba7a91826a\" rel=\"noopener\"\u003epanel blew off the fuselage\u003c/a\u003e of an Alaska Airlines plane in January. Production rates slowed to a crawl, and the Federal Aviation Administration capped production of the 737 MAX at 38 planes per month, a threshold Boeing has yet to reach.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cb\u003eHow many degrees of separation are you from the globe\u0026#39;s most powerful business leaders? \u003c/b\u003eExplore who made our brand-new list of the \u003ca href=\"https://fortune.com/ranking/most-powerful-people/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/most-powerful-people/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\"\u003e100 Most Powerful People in Business\u003c/a\u003e. Plus, learn about the metrics we used to make it.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
