{
  "id": "d33fb31e-c7a4-48c7-8dff-ca82c62dd8f2",
  "title": "Starbucks earnings top estimates, but same-store sales decline for fourth straight quarter",
  "link": "https://www.cnbc.com/2025/01/28/starbucks-sbux-q1-2025-earnings.html",
  "description": "Starbucks said its same-store sales fell 4%, fueled by a 6% decline in visits to its stores.",
  "author": "",
  "published": "Tue, 28 Jan 2025 23:12:41 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Amelia Lucas",
  "length": 4983,
  "excerpt": "Starbucks said its same-store sales fell 4%, fueled by a 6% decline in visits to its stores.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "The Starbucks logo is seen on a cup at one of its cafes on April 26, 2024.Jakub Porzycki/ | Nurphoto | Getty ImagesStarbucks on Tuesday reported that its same-store sales slid for the fourth consecutive quarter, but the company's quarterly earnings and revenue beat Wall Street's expectations.The coffee giant kicked off a turnaround plan last quarter in the hopes of reviving its U.S. business, which has slumped over the past year.\"While we have room for improvement, we're making progress as planned, and have confidence we're on the right track,\" CEO Brian Niccol said in a video released on the company's website Tuesday afternoon.He added that the company has seen a \"positive response\" to the early steps it has taken. Those tweaks have included removing extra charges for nondairy milk options, focusing its marketing on its coffee and slashing 30% of its food and beverage menu items by the end of fiscal 2025.Here is what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:Earnings per share: 69 cents vs. 67 cents expectedRevenue: $9.4 billion vs. $9.31 billion expectedStarbucks reported fiscal first-quarter net income attributable to the company of $780.8 million, or 69 cents per share, down from $1.02 billion, or 90 cents per share, a year earlier.The company's net sales of $9.4 billion were unchanged from a year earlier.Starbucks' same-store sales fell 4%, fueled by a 6% decline in traffic to its stores. Wall Street was expecting a steeper drop of 5.5%, according to StreetAccount estimates. Both its U.S. and international locations outperformed expectations.U.S. same-store sales slid 4% as traffic to its cafes fell 8%. Under Niccol, who took the reins in September, the company has been trying to turn around its U.S. business by getting \"back to Starbucks\" and returning its focus to coffee and the customer experience.Starbucks has also been cutting back on deals, so its discounted transactions fell 40% during the quarter. Niccol credited the pullback in discounts for the chain's sales improvement throughout the quarter.Outside of its home market, same-store sales also declined 4%.Starbucks' same-store sales in China, its second-largest market, fell 6%, fueled by a 4% decline in average ticket. The coffee giant has been leaning into discounts in China to compete with rivals that have much lower prices, such as Luckin Coffee.Niccol said he made his first visit to stores in China last week. The company is exploring strategic partnerships to grow its business in the country.\"We're processing these learnings, and we will share more as we do,\" he told analysts on the company's conference call.In October, the company suspended its forecast for fiscal 2025, citing the turnaround efforts. On Tuesday's call, executives also backed away from a target of $4 billion in supply-chain cost savings by 2028; Niccol's predecessor Laxman Narasimhan had shared that number in April 2024, just as sales began to shrink and months before he was out of the job.Starbucks is also planning fewer new locations and renovations in fiscal 2025 to free up capital to fuel its comeback. However, Niccol sees strong demand for more cafes in the long term.\"In the U.S. alone, we still see the potential to double our store count, while improving the overall health of our portfolio. We'll do this through a strong store renovation program, new store builds, and store closures,\" Niccol said.The company is also trying to improve its speed of service by scheduling more workers, removing bottlenecks behind its coffee counters and making baristas' jobs easier.For example, Starbucks plans to prioritize installing its Siren equipment in its busiest locations, Niccol said. The new equipment includes a custom ice dispenser, milk-dispensing system and faster blenders so baristas can make drinks more quickly.Starbucks is also piloting a new algorithm to manage the order that baristas should make both mobile and in-store drinks. If successful, the algorithm could solve Starbucks' overcrowded pick-up counters that cause frustration for both customers and baristas.Niccol also has plans for Starbucks' corporate workforce. He has been reorganizing the company's structure, including splitting the role of North American president into two jobs. Earlier on Tuesday, the company announced it has hired two alumni from Taco Bell, Niccol's employer prior to Chipotle.In early March, the company is planning to lay off workers, although Starbucks has not yet shared how many jobs will be affected.Don’t miss these insights from CNBC PROTom Lee says market sell-off sparked by DeepSeek was an overreaction, as Nvidia suffers its worst day since 2020How U.S. efforts to restrict China from Nvidia’s fastest chips may have backfiredAmazon, Broadcom are buying opportunities on DeepSeek sell-off, Hightower's Stephanie Link saysThe DeepSeek sell-off: What major analysts are saying about Nvidia, possible AI bubble popping",
  "image": "https://image.cnbcfm.com/api/v1/image/108038916-1727270649111-IMG_5688.jpg?v=1730320762\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-107408070\" data-test=\"InlineImage\"\u003e\u003cp\u003eThe Starbucks logo is seen on a cup at one of its cafes on April 26, 2024.\u003c/p\u003e\u003cp\u003eJakub Porzycki/ | Nurphoto | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-1\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/SBUX/\"\u003eStarbucks\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e on Tuesday \u003ca href=\"https://investor.starbucks.com/news/financial-releases/news-details/2025/Starbucks-Reports-Q1-Fiscal-Year-2025-Results/default.aspx\" target=\"_blank\"\u003ereported\u003c/a\u003e that its same-store sales slid for the fourth consecutive quarter, but the company\u0026#39;s quarterly earnings and revenue beat Wall Street\u0026#39;s expectations.\u003c/p\u003e\u003cp\u003eThe coffee giant \u003ca href=\"https://www.cnbc.com/2024/10/31/starbucks-ceo-brian-niccol-change.html\"\u003ekicked off a turnaround plan\u003c/a\u003e last quarter in the hopes of reviving its U.S. business, which has slumped over the past year.\u003c/p\u003e\u003cp\u003e\u0026#34;While we have room for improvement, we\u0026#39;re making progress as planned, and have confidence we\u0026#39;re on the right track,\u0026#34; CEO Brian Niccol said in a \u003ca href=\"https://about.starbucks.com/press/2025/starbucks-reports-q1-fiscal-2025-results/\" target=\"_blank\"\u003evideo released\u003c/a\u003e on the company\u0026#39;s website Tuesday afternoon.\u003c/p\u003e\u003cp\u003eHe added that the company has seen a \u0026#34;positive response\u0026#34; to the early steps it has taken. Those tweaks have included removing extra charges for nondairy milk options, focusing its marketing on its coffee and slashing 30% of its food and beverage menu items by the end of fiscal 2025.\u003c/p\u003e\u003cp\u003eHere is what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eEarnings per share\u003c/strong\u003e: 69 cents vs. 67 cents expected\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eRevenue\u003c/strong\u003e: $9.4 billion vs. $9.31 billion expected\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eStarbucks reported fiscal first-quarter net income attributable to the company of $780.8 million, or 69 cents per share, down from $1.02 billion, or 90 cents per share, a year earlier.\u003c/p\u003e\u003cp\u003eThe company\u0026#39;s net sales\u003cstrong\u003e \u003c/strong\u003eof $9.4 billion were unchanged from a year earlier.\u003c/p\u003e\u003cp\u003eStarbucks\u0026#39; same-store sales fell 4%, fueled by a 6% decline in traffic to its stores. Wall Street was expecting a steeper drop of 5.5%, according to StreetAccount estimates. Both its U.S. and international locations outperformed expectations.\u003c/p\u003e\u003cp\u003eU.S. same-store sales slid 4% as traffic to its cafes fell 8%. Under Niccol, who took the reins in September, the company has been trying to turn around its U.S. business by getting \u0026#34;back to Starbucks\u0026#34; and returning its focus to coffee and the customer experience.\u003c/p\u003e\u003cp\u003eStarbucks has also been cutting back on deals, so its discounted transactions fell 40%\u003cstrong\u003e during the quarter. \u003c/strong\u003eNiccol credited the pullback in discounts for the chain\u0026#39;s sales improvement throughout the quarter.\u003c/p\u003e\u003cp\u003eOutside of its home market, same-store sales also declined 4%.\u003c/p\u003e\u003cp\u003eStarbucks\u0026#39; same-store sales in China, its second-largest market, fell 6%, fueled by a 4% decline in average ticket. The coffee giant has been \u003ca href=\"https://www.cnbc.com/2024/11/01/chinese-coffee-market-starbucks-ceo-brian-niccol.html\"\u003eleaning into discounts in China\u003c/a\u003e to compete with rivals that have much lower prices, such as Luckin Coffee.\u003c/p\u003e\u003cp\u003eNiccol said he made his first visit to stores in China last week. The company is exploring strategic partnerships to grow its business in the country.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re processing these learnings, and we will share more as we do,\u0026#34; he told analysts on the company\u0026#39;s conference call.\u003c/p\u003e\u003cp\u003eIn October, the company suspended its forecast for fiscal 2025, citing the turnaround efforts. On Tuesday\u0026#39;s call, executives also backed away from a \u003ca href=\"https://www.cnbc.com/2024/04/30/starbucks-sbux-earnings-q2-2024.html\"\u003etarget of $4 billion\u003c/a\u003e in supply-chain cost savings by 2028; Niccol\u0026#39;s predecessor Laxman Narasimhan had shared that number in April 2024, just as sales began to shrink and months before he was out of the job.\u003c/p\u003e\u003cp\u003eStarbucks is also planning fewer new locations and renovations in fiscal 2025 to free up capital to fuel its comeback. However, Niccol sees strong demand for more cafes in the long term.\u003c/p\u003e\u003cp\u003e\u0026#34;In the U.S. alone, we still see the potential to double our store count, while improving the overall health of our portfolio. We\u0026#39;ll do this through a strong store renovation program, new store builds, and store closures,\u0026#34; Niccol said.\u003c/p\u003e\u003cp\u003eThe company is also trying to improve its speed of service by scheduling more workers, removing bottlenecks behind its coffee counters and making baristas\u0026#39; jobs easier.\u003c/p\u003e\u003cp\u003eFor example, Starbucks plans to prioritize installing its Siren equipment in its busiest locations, Niccol said. The new equipment includes a custom ice dispenser, milk-dispensing system and faster blenders so baristas can make drinks more quickly.\u003c/p\u003e\u003cp\u003eStarbucks is also piloting a new algorithm to manage the order that baristas should make both mobile and in-store drinks. If successful, the algorithm could solve Starbucks\u0026#39; overcrowded pick-up counters that cause frustration for both customers and baristas.\u003c/p\u003e\u003cp\u003eNiccol also has plans for Starbucks\u0026#39; corporate workforce. He has been reorganizing the company\u0026#39;s structure, including splitting the role of North American president into two jobs. Earlier on Tuesday, the company announced \u003ca href=\"https://www.cnbc.com/2025/01/28/starbucks-adds-two-former-taco-bell-executives-ahead-of-earnings.html\"\u003eit has hired two alumni\u003c/a\u003e from Taco Bell, Niccol\u0026#39;s employer prior to Chipotle.\u003c/p\u003e\u003cp\u003eIn early March, the company is planning to \u003ca href=\"https://www.cnbc.com/2025/01/17/starbucks-to-trim-jobs-as-part-of-turnaround-strategy-says-ceo-.html\"\u003elay off workers\u003c/a\u003e, although Starbucks has not yet shared how many jobs will be affected.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"RegularArticle-RelatedContent-1\"\u003e\u003ch2\u003eDon’t miss these insights from CNBC PRO\u003c/h2\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/01/27/tom-lee-calls-market-sell-off-overreaction-nvidia-falls-on-deepseek-news.html\"\u003eTom Lee says market sell-off sparked by DeepSeek was an overreaction, as Nvidia suffers its worst day since 2020\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/01/27/how-us-keeping-china-from-nvidias-fastest-chips-may-have-backfired.html\"\u003eHow U.S. efforts to restrict China from Nvidia’s fastest chips may have backfired\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/01/27/amazon-broadcom-are-buys-on-deepseek-sell-off-hightowers-stephanie-link-says.html\"\u003eAmazon, Broadcom are buying opportunities on DeepSeek sell-off, Hightower\u0026#39;s Stephanie Link says\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/01/27/deepseek-sell-off-nvidia-analysts-react.html\"\u003eThe DeepSeek sell-off: What major analysts are saying about Nvidia, possible AI bubble popping\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-28T20:30:01Z",
  "modifiedTime": "2025-01-28T23:12:41Z"
}
