{
  "id": "de212628-36a8-48c4-b299-d58d61c19aba",
  "title": "Bill Gates donated $50 million to back Kamala Harris—And it comes as Trump appears to be catching up in polls",
  "link": "https://fortune.com/2024/10/22/bill-gates-50-million-kamala-harris-president-nyt/",
  "description": "Bill Gates has typically stayed out of politics, but according to the NYT he's donated $50 million to elect Kamala Harris.",
  "author": "Brooke Seipel, Amanda Gerut",
  "published": "Tue, 22 Oct 2024 22:33:54 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Politics"
  ],
  "byline": "Brooke Seipel,Amanda Gerut",
  "length": 2651,
  "excerpt": "Bill Gates has typically stayed out of politics, but according to the NYT he's donated $50 million to elect Kamala Harris.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "Microsoft founder Bill Gates is supporting Democratic Vice President Kamala Harris in the 2024 presidential race, according to The New York Times. Sources close to Gates reportedly told the outlet that the billionaire, long known for staying out of politics publicly, had donated about $50 million to a nonprofit supporting Harris’s run. In a statement to the Times, Gates did not confirm or deny the donation but said, “this election is different.” Fortune has reached out to Gates for comment. According to The Times report, Gates is concerned about former President Donald Trump’s economic policies and potential cuts to family planning and global health programs. Gates’ donation supporting the Democratic nominee comes as sentiment has shifted in recent days about Harris’ chances to defeat Trump in the presidential election. Crypto prediction platform Polymarket, which has $2.3 billion in wagers on the election outcome, is tilted heavily in favor of Trump with 64% odds on the Republican as the victor. PredictIt has similar odds favoring a Trump win next month.  Billionaire investor Stanley Druckenmiller, known for his clear-sighted navigation through geopolitical uncertainty, suggested last week in an interview with Bloomberg that market insiders are banking on a Trump win. In that scenario, there would be a “red sweep” of Republican candidates, he said.  “Personally, I think anybody that votes for Trump is probably not going to change their ballot for a Democrat in Congress,” he added. On the other hand, Harris has continued to attract backers with deep pockets.  Fellow billionaire and philanthropist Melinda French Gates endorsed Harris in July and made a big donation to her campaign. “I feel like Kamala, I was happy to endorse,” French Gates told Stephen Colbert on The Late Show in July. “I’ve worked with her before, she knows what we need in society and she’s using her voice against those issues already on the campaign trail, and I knew she would.” French Gates previously endorsed President Biden in June—her first time ever declaring for a presidential candidate.  Similarly, billionaire and philanthropist Laurene Powell Jobs donated to Harris, who is one of her longtime close friends.  Powell Jobs and her philanthropy and investment firm Emerson Collective have been heavily funding democratic politics for the past several years. Since 2020, Powell Jobs and Emerson Collective have donated more than $3.4 million to democratic nominees and other funds, according to Federal Election Commission filings collected by Fortune.  This breaking news report will be updated shortly.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/10/GettyImages-2178405094-e1729636251386.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003cp\u003e\u003ca href=\"https://fortune.com/company/microsoft/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/microsoft/\"\u003eMicrosoft\u003c/a\u003e founder Bill Gates is supporting Democratic Vice President Kamala Harris in the 2024 presidential race, \u003ca href=\"https://www.nytimes.com/2024/10/22/us/elections/bill-gates-future-forward-kamala-harris.html\" target=\"_blank\" aria-label=\"Go to https://www.nytimes.com/2024/10/22/us/elections/bill-gates-future-forward-kamala-harris.html\" rel=\"noopener\"\u003eaccording to The New York Times\u003c/a\u003e.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eSources close to Gates reportedly told the outlet that the billionaire, long known for staying out of politics publicly, had donated about $50 million to a nonprofit supporting Harris’s run. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn a statement to the Times, Gates did not confirm or deny the donation but said, “this election is different.” \u003cem\u003eFortune \u003c/em\u003ehas reached out to Gates for comment.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to The Times report, Gates is concerned about former President Donald Trump’s economic policies and potential cuts to family planning and global health programs.\u003c/p\u003e\n\n\n\n\u003cp\u003eGates’ donation supporting the Democratic nominee comes as sentiment has shifted in recent days about Harris’ chances to defeat Trump in the presidential election. Crypto prediction platform Polymarket, which has $2.3 billion in wagers on the election outcome, is tilted heavily in favor of Trump with 64% odds on the Republican as the victor. PredictIt has \u003ca href=\"https://www.predictit.org/markets/detail/7456/Who-will-win-the-2024-US-presidential-election\" target=\"_blank\" aria-label=\"Go to https://www.predictit.org/markets/detail/7456/Who-will-win-the-2024-US-presidential-election\" rel=\"noopener\"\u003esimilar odds\u003c/a\u003e favoring a Trump win next month. \u003c/p\u003e\n\n\n\n\u003cp\u003eBillionaire investor Stanley Druckenmiller, known for his clear-sighted navigation through geopolitical uncertainty, suggested last week in an \u003ca href=\"https://fortune.com/2024/10/17/billionaire-investor-stanley-druckenmiller-trump-win-kamala-harris-election/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/10/17/billionaire-investor-stanley-druckenmiller-trump-win-kamala-harris-election/\"\u003einterview\u003c/a\u003e with Bloomberg that market insiders are banking on a Trump win. In that scenario, there would be a “red sweep” of Republican candidates, he said. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Personally, I think anybody that votes for Trump is probably not going to change their ballot for a Democrat in Congress,” he added.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn the other hand, Harris has continued to attract backers with deep pockets. \u003c/p\u003e\n\n\n\n\u003cp\u003eFellow billionaire and philanthropist Melinda French Gates endorsed Harris in July and made a big donation to her campaign. “I feel like Kamala, I was happy to endorse,” French Gates told Stephen Colbert on \u003ca href=\"https://www.youtube.com/watch?v=rSR1FME7lnI\" target=\"_blank\" aria-label=\"Go to https://www.youtube.com/watch?v=rSR1FME7lnI\" rel=\"noopener\"\u003e\u003cem\u003eThe Late Show\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003ein July. “I’ve worked with her before, she knows what we need in society and she’s using her voice against those issues already on the campaign trail, and I knew she would.”\u003c/p\u003e\n\n\n\n\u003cp\u003eFrench Gates previously endorsed President Biden in June—her first time ever declaring for a presidential candidate. \u003c/p\u003e\n\n\n\n\u003cp\u003eSimilarly, billionaire and philanthropist Laurene Powell Jobs donated to Harris, who is one of her longtime close friends. \u003c/p\u003e\n\n\n\n\u003cp\u003ePowell Jobs and her philanthropy and investment firm Emerson Collective have been heavily funding democratic politics for the past several years. Since 2020, Powell Jobs and Emerson Collective have donated more than $3.4 million to democratic nominees and other funds, according to \u003ca href=\"https://fortune.com/2024/09/25/silicon-valley-political-donations-elon-musk-peter-thiel-reid-hoffman/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/09/25/silicon-valley-political-donations-elon-musk-peter-thiel-reid-hoffman/\"\u003eFederal Election Commission filings collected by \u003cem\u003eFortune\u003c/em\u003e\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThis breaking news report will be updated shortly.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
