{
  "id": "e8ab485d-ea07-4145-b769-70596388f3ca",
  "title": "Tesla reports sales miss as auto revenue drops for second straight quarter",
  "link": "https://www.cnbc.com/2025/07/23/tesla-tsla-q2-2025-earnings-report.html",
  "description": "Tesla’s second-quarter earnings call comes as Elon Musk’s automaker tries to revitalize EV sales and turn its robotaxis into moneymakers.",
  "author": "",
  "published": "Wed, 23 Jul 2025 23:33:59 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Lora Kolodny",
  "length": 5050,
  "excerpt": "Tesla’s second-quarter earnings call comes as Elon Musk’s automaker tries to revitalize EV sales and turn its robotaxis into moneymakers.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Elon Musk, CEO of SpaceX and Tesla, attends the Viva Technology conference at the Porte de Versailles exhibition center in Paris on June 16, 2023.Gonzalo Fuentes | ReutersTesla reported a 16% decline in automotive revenue as sales fell for a second straight quarter and again trailed analysts' estimates.Here's how the company did, compared with estimates from analysts polled by LSEG:Earnings per share: 40 cents adjusted vs. 43 cents expectedRevenue: $22.50 billion vs. $22.74 billionTesla shares dipped by more than 4% after hours, following remarks by CEO Elon Musk and finance chief Vaibhav Taneja about higher tariff costs and the expiration of federal electric vehicle tax credits.\"We probably could have a few rough quarters. I am not saying that we will, but we could,\" Musk said.Auto revenue for Tesla came in at $16.7 billion in the second quarter, down from $19.9 billion in the same quarter last year. Of that sum, revenue from sales of auto regulatory credits declined to $439 million from $890 million a year earlier.In early July, Tesla reported a 14% year-over-year slide in vehicle deliveries to 384,000 for the second quarter. Deliveries are the closest approximation of EV sales reported by Tesla but aren't precisely defined in its shareholder communications.Tesla's slump this year is partly due to backlash against the company in the U.S. and Europe, after Musk spent heavily to help reelect President Donald Trump, endorsed Germany's extreme anti-immigrant AfD party and then led the Trump administration's Department of Government Efficiency, or DOGE. There, Musk slashed the federal workforce, rolled back regulations and eliminated the United States Agency for International Development, or USAID.The company's shares were down about 18% for the year as of Wednesday's close, making it the worst performance among tech's megacaps. The Nasdaq is up about 9% in 2025.The stock was flat in extended trading until the earnings call, but it began to dip after Taneja said that the \"big beautiful bill\" recently passed by Congress would affect Tesla's business. The bill ends a federal $7,500 EV tax credit at the end of September.Tesla has also shifted aspects of its supply chain to deal with Trump's tariffs.\"Given the abrupt change, we have limited supply of vehicles in the U.S. this quarter,\" Taneja said. \"We may not be able to guarantee delivery orders placed in the later part of August and beyond.\"Net income fell to $1.17 billion, or 33 cents per share, in the second quarter, from $1.4 billion, or 40 cents per share, a year earlier.In its shareholder deck, Tesla said it began its \"first builds of a more affordable model in June, with volume production planned for the second half of 2025.\"Tesla has to this point put off the production of a less pricey \"model 2\" EV. Meanwhile, other automakers are now offering a greater variety of vehicles, and China-based competitors are selling affordable EVs with high-tech self-driving features as a standard rather than premium option.Musk has tried to keep fans and investors focused on Tesla's future, which he envisions as being dominated by the company's robotaxis and humanoid Optimus robots. Musk has said Tesla's robotaxis could work for their owners, making them money while they sleep. Optimus robots, he has said, will be so sophisticated that they can serve as factory workers or babysitters.In June, Tesla began testing a robotaxi service in Austin, Texas, which operates in a limited area with a human valet on board. The service is accessible only to select riders, generally Tesla and Musk enthusiasts.\"We will further improve and expand the service (more vehicles covering a larger area, eventually without a safety rider) while testing in other U.S. cities in anticipation of additional launches,\" Tesla said in the shareholder deck, reiterating prior statements.The company is significantly behind Alphabet's Waymo, which has commercial robotaxi services that are open to the public running in several U.S. markets, including Austin.Musk, who has missed self-imposed deadlines around self-driving technology for more than a decade, said Wednesday that Tesla's goal is to have autonomous ridehailing available to about half the U.S. population by the end of this year, \"subject to regulatory approvals.\"\"I think we'll technically be able to do it,\" he said.On the company's earnings call a year ago, Musk said he didn't foresee regulatory hurdles to a broad rollout out of Tesla's self-driving technology in the U.S. and beyond.In Tesla's services and other segment, which includes revenue from its EV charging stations, gross profit rose 17% year over year. Tesla said it was driven by \"improved Supercharging gross profit generation from increased volume,\" and said it has added more than 2,900 net new Supercharging stalls, an 18% increase from a year earlier. The company boasts 7,377 Supercharger stations in its charging network.Tesla's digital assets are now worth $1.24 billion, according to the shareholder update, up from $722 million a year ago.",
  "image": "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108168278\" data-test=\"InlineImage\"\u003e\u003cp\u003eElon Musk, CEO of SpaceX and Tesla, attends the Viva Technology conference at the Porte de Versailles exhibition center in Paris on June 16, 2023.\u003c/p\u003e\u003cp\u003eGonzalo Fuentes | Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-1\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/TSLA/\"\u003eTesla\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e reported a 16% decline in automotive revenue as sales fell for a second straight quarter and again trailed analysts\u0026#39; estimates.\u003c/p\u003e\u003cp\u003eHere\u0026#39;s how the company did, compared with estimates from analysts polled by LSEG:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eEarnings per share\u003c/strong\u003e: 40 cents adjusted vs. 43 cents expected\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eRevenue\u003c/strong\u003e: $22.50 billion vs. $22.74 billion\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTesla shares dipped by more than 4% after hours, following remarks by CEO \u003ca href=\"https://www.cnbc.com/elon-musk/\"\u003eElon Musk\u003c/a\u003e and finance chief Vaibhav Taneja about higher tariff costs and the expiration of federal electric vehicle tax credits.\u003c/p\u003e\u003cp\u003e\u0026#34;We probably could have a few rough quarters. I am not saying that we will, but we could,\u0026#34; Musk said.\u003c/p\u003e\u003cp\u003eAuto revenue for Tesla came in at $16.7 billion in the second quarter, down from $19.9 billion in the same quarter last year. Of that sum, revenue from sales of auto regulatory credits declined to $439 million from $890 million a year earlier.\u003c/p\u003e\u003cp\u003eIn \u003ca href=\"https://www.cnbc.com/2025/07/02/tesla-tsla-q2-2025-vehicle-delivery-and-production-numbers.html\"\u003eearly July\u003c/a\u003e, Tesla reported a 14% year-over-year slide in vehicle deliveries to 384,000 for the second quarter. Deliveries are the closest approximation of EV sales reported by Tesla but aren\u0026#39;t precisely defined in its shareholder communications.\u003c/p\u003e\u003cp\u003eTesla\u0026#39;s slump this year is partly due to backlash against the company in the U.S. and Europe, after Musk spent heavily to help reelect \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003ePresident Donald Trump\u003c/a\u003e, endorsed Germany\u0026#39;s extreme anti-immigrant AfD party and then led the Trump administration\u0026#39;s Department of Government Efficiency, or DOGE. There, Musk slashed the federal workforce, rolled back regulations and eliminated the United States Agency for International Development, or USAID.\u003c/p\u003e\u003cp\u003eThe company\u0026#39;s shares were down about 18% for the year as of Wednesday\u0026#39;s close, making it the worst performance among tech\u0026#39;s megacaps. The Nasdaq is up about 9% in 2025.\u003c/p\u003e\u003cp\u003eThe stock was flat in extended trading until the earnings call, but it began to dip after Taneja said that the \u0026#34;\u003ca href=\"https://www.whitehouse.gov/articles/2025/07/president-trumps-one-big-beautiful-bill-is-now-the-law/\" target=\"_blank\"\u003ebig beautiful bill\u003c/a\u003e\u0026#34; recently passed by Congress would affect Tesla\u0026#39;s business. The bill \u003ca href=\"https://www.cnbc.com/2025/07/10/trump-big-beautiful-bill-ends-7500-ev-tax-credit-time-to-buy-vehicle.html\"\u003eends\u003c/a\u003e a federal $7,500 EV tax credit at the end of September.\u003c/p\u003e\u003cp\u003eTesla has also shifted aspects of its supply chain to deal with Trump\u0026#39;s tariffs.\u003c/p\u003e\u003cp\u003e\u0026#34;Given the abrupt change, we have limited supply of vehicles in the U.S. this quarter,\u0026#34; Taneja said. \u0026#34;We may not be able to guarantee delivery orders placed in the later part of August and beyond.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eNet income fell to $1.17 billion, or 33 cents per share, in the second quarter, from $1.4 billion, or 40 cents per share, a year earlier.\u003c/p\u003e\u003cp\u003eIn its \u003ca href=\"https://www.tesla.com/sites/default/files/downloads/TSLA-Q2-2025-Update.pdf\" target=\"_blank\"\u003eshareholder deck\u003c/a\u003e, Tesla said it began its \u0026#34;first builds of a more affordable model in June, with volume production planned for the second half of 2025.\u0026#34;\u003c/p\u003e\u003cp\u003eTesla has to this point put off the production of a less pricey \u0026#34;model 2\u0026#34; EV. Meanwhile, other automakers are now offering a greater variety of vehicles, and China-based competitors are selling affordable EVs with high-tech self-driving features as a standard rather than premium option.\u003c/p\u003e\u003cp\u003eMusk has tried to keep fans and investors focused on Tesla\u0026#39;s future, which he envisions as being dominated by the company\u0026#39;s robotaxis and humanoid Optimus robots. Musk has said Tesla\u0026#39;s robotaxis could work for their owners, making them money while they sleep. Optimus robots, he has said, will be so sophisticated that they can serve as factory workers or babysitters.\u003c/p\u003e\u003cp\u003eIn June, Tesla began testing a \u003ca href=\"https://www.cnbc.com/2025/06/20/tesla-robotaxi-launch-austin.html\"\u003erobotaxi\u003c/a\u003e service in Austin, Texas, which operates in a limited area with a human valet on board. The service is accessible only to select riders, generally Tesla and Musk enthusiasts.\u003c/p\u003e\u003cp\u003e\u0026#34;We will further improve and expand the service (more vehicles covering a larger area, eventually without a safety rider) while testing in other U.S. cities in anticipation of additional launches,\u0026#34; Tesla said in the shareholder deck, reiterating prior statements.\u003c/p\u003e\u003cp\u003eThe company is significantly behind \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-9\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/GOOGL/\"\u003eAlphabet\u0026#39;s\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e Waymo, which has commercial robotaxi services that are open to the public running in several U.S. markets, including Austin.\u003c/p\u003e\u003cp\u003eMusk, who has missed self-imposed deadlines around self-driving technology for more than a decade, said Wednesday that Tesla\u0026#39;s goal is to have autonomous ridehailing available to about half the U.S. population by the end of this year, \u0026#34;subject to regulatory approvals.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I think we\u0026#39;ll technically be able to do it,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eOn the company\u0026#39;s earnings call a year ago, Musk said he didn\u0026#39;t foresee regulatory hurdles to a broad rollout out of Tesla\u0026#39;s self-driving technology in the U.S. and beyond.\u003c/p\u003e\u003cp\u003eIn Tesla\u0026#39;s services and other segment, which includes revenue from its EV charging stations, gross profit rose 17% year over year. Tesla said it was driven by \u0026#34;improved Supercharging gross profit generation from increased volume,\u0026#34; and said it has added more than 2,900 net new Supercharging stalls, an 18% increase from a year earlier. The company boasts 7,377 Supercharger stations in its charging network.\u003c/p\u003e\u003cp\u003eTesla\u0026#39;s digital assets are now worth $1.24 billion, according to the shareholder update, up from $722 million a year ago.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108169059\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000381658\" aria-labelledby=\"Placeholder-ArticleBody-Video-108169059\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108169060-17519956391751995637-40626317826-1080pnbcnews.jpg?v=1751995638\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Elon Musk can\u0026#39;t continue to go down this political path, says Wedbush\u0026#39;s Dan Ives\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-23T16:00:09Z",
  "modifiedTime": "2025-07-23T23:33:59Z"
}
