{
  "id": "ec8cec74-353a-43e8-a5d1-ba612b9307db",
  "title": "How the TACO trade could end up backfiring on investors",
  "link": "https://finance.yahoo.com/news/taco-trade-could-end-backfiring-171501357.html",
  "description": "",
  "author": "",
  "published": "2025-07-12T17:15:01Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "William Edwards",
  "length": 2698,
  "excerpt": "Buying the dip during tariff volatility has paid off for investors, but the TACO trade could ultimately backfire, GMO's Ben Inker said.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "A trader works at his desk on the floor of the New York Stock Exchange (NYSE) at the opening bell in New York on July 11, 2025.TIMOTHY A. CLARY/AFP via Getty Images Investors have come to see Trump's more extreme trade policies as bluffs. But without financial markets to check Trump, will the trade backfire? GMO's Ben Inker says a weak reaction to tariffs could embolden Trump. Buying the dip during recent tariff volatility has been a profitable strategy this year, but will the so-called TACO trade backfire on bullish investors confident that the president will always back down? It didn't take long for investors to figure out that Trump doesn't always mean what he says when it comes to trade policy. The TACO trade — short for \"Trump always chickens out,\" a phrase coined by the Financial Times' Robert Armstrong to describe Trump's habit of backing away from proposals that roil markets— has emerged as a result. Investors have started not to take Trump so seriously, believing his more extreme policy proposals, like blanket tariffs or firing the Chairman of the Federal Reserve, are just a bluff. But Ben Inker, the co-head of asset allocation at GMO, argues that this approach may backfire. Markets have acted as a check on Trump this year. The president paused tariffs in April after historic sell-offs in both stocks and bonds, and he's backed down from ideas like firing Jerome Powell as Fed chief after markets balked at the prospect. Now, with investors seemingly less willing to sell after every bold proposal Trump makes, he may have little incentive to back off from his trade war, which he has ramped up again this week. The president fired off letters throughout the week that included threats of 25% tariffs on Japan and South Korea, 50% tariffs on Brazil, and 35% on Canada. Stocks dipped on Friday as Trump re-escalated the trade war, but it was nothing like the sell-off in April, despite some tariffs announced in the week being steeper than expected. \"What we're seeing today is Trump being much more aggressive,\" Inker said. He said that Trump's recent announcement of 50% tariffs on Brazil is \"an aggressive stance that sort of presumes you can do whatever you want, which is quite different from what we saw with the backdown from the Liberation Day tariffs when the bond market started going crazy,\" Inker said. \"In the absence of the financial markets telling him to back off, he won't back off,\" he added. Investors lately haven't been pricing in downside risks. The S\u0026P 500 and the Nasdaq hit all-time highs on Thursday, and valuations are high Inker said that the benchmark index is probably close to 40% overvalued.",
  "image": "https://s.yimg.com/ny/api/res/1.2/lDxsO2H1PXS6YvUj_mPyzA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/business_insider_articles_888/f93fcd139a9107de5582b0d89d160d4d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e   \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"A trader works at his desk on the floor of the New York Stock Exchange.\" loading=\"eager\" height=\"640\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eA trader works at his desk on the floor of the New York Stock Exchange (NYSE) at the opening bell in New York on July 11, 2025.\u003cspan\u003eTIMOTHY A. CLARY/AFP via Getty Images\u003c/span\u003e  \u003c/figcaption\u003e \u003c/figure\u003e   \u003cul\u003e\u003cli\u003e \u003cp\u003eInvestors have come to see Trump\u0026#39;s more extreme trade policies as bluffs.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eBut without financial markets to check Trump, will the trade backfire?\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eGMO\u0026#39;s Ben Inker says a weak reaction to tariffs could embolden Trump.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e   \u003cp\u003eBuying the dip during recent tariff volatility has been a profitable strategy this year, but will the so-called \u003ca href=\"https://www.businessinsider.com/taco-trade-trump-tariffs-investors-stock-market-japan-south-korea-2025-7?utm_medium=referral\u0026amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:TACO trade;elm:context_link;itc:0;sec:content-canvas\"\u003eTACO trade\u003c/a\u003e backfire on bullish investors confident that the president will always back down?\u003c/p\u003e      \u003cp\u003eIt didn\u0026#39;t take long for investors to figure out that Trump doesn\u0026#39;t always mean what he says when it comes to trade policy. The TACO trade — short for \u0026#34;Trump always chickens out,\u0026#34; a phrase coined by the Financial Times\u0026#39; Robert Armstrong to describe Trump\u0026#39;s habit of backing away from proposals that roil markets— has emerged as a result.\u003c/p\u003e   \u003cp\u003eInvestors have started not to take Trump so seriously, believing his more extreme policy proposals, like blanket tariffs or \u003ca href=\"https://www.businessinsider.com/trump-backs-off-firing-jerome-powell-markets-rally-2025-4?utm_medium=referral\u0026amp;utm_source=yahoo.com\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:firing the Chairman;elm:context_link;itc:0;sec:content-canvas\"\u003efiring the Chairman\u003c/a\u003e of the Federal Reserve, are just a bluff.\u003c/p\u003e      \u003cp\u003eBut Ben Inker, the co-head of asset allocation at GMO, argues that this approach may backfire.\u003c/p\u003e   \u003cp\u003eMarkets have acted as a check on Trump this year. The president paused tariffs in April after historic sell-offs in both stocks and bonds, and he\u0026#39;s backed down from ideas like firing Jerome Powell as Fed chief after markets balked at the prospect.\u003c/p\u003e   \u003cp\u003eNow, with investors seemingly less willing to sell after every bold proposal Trump makes, he may have little incentive to back off from his trade war, which he has ramped up again this week. The president fired off letters throughout the week that included threats of 25% tariffs on Japan and South Korea, 50% tariffs on Brazil, and 35% on Canada.\u003c/p\u003e      \u003cp\u003eStocks dipped on Friday as Trump re-escalated the trade war, but it was nothing like the sell-off in April, despite some tariffs announced in the week being steeper than expected.\u003c/p\u003e   \u003cp\u003e\u0026#34;What we\u0026#39;re seeing today is Trump being much more aggressive,\u0026#34; Inker said.\u003c/p\u003e   \u003cp\u003eHe said that Trump\u0026#39;s recent announcement of 50% tariffs on Brazil is \u0026#34;an aggressive stance that sort of presumes you can do whatever you want, which is quite different from what we saw with the backdown from the Liberation Day tariffs when the bond market started going crazy,\u0026#34; Inker said.\u003c/p\u003e      \u003cp\u003e\u0026#34;In the absence of the financial markets telling him to back off, he won\u0026#39;t back off,\u0026#34; he added.\u003c/p\u003e   \u003cp\u003eInvestors lately haven\u0026#39;t been pricing in downside risks. The S\u0026amp;P 500 and the Nasdaq hit all-time highs on Thursday, and valuations are high\u003c/p\u003e   \u003cp\u003eInker said that the benchmark index is probably close to 40% overvalued.\u003c/p\u003e \u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-18277d53-98f8-31f6-b3be-78581131d0ff\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-ab7137a1-a180-37f5-b1a6-c05762b45f74\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-858feb41-1fe3-3a50-8a44-2751d61e088b\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-1119e9ec-1655-3f51-a874-770a376a7c98\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-12T17:15:01Z",
  "modifiedTime": null
}
