{
  "id": "eda91a37-77b6-4fb1-93da-45bc6bb4a4a5",
  "title": "Rain enhancement technologies investor Paul Dacier buys $100k in stock",
  "link": "https://www.investing.com/news/insider-trading-news/rain-enhancement-technologies-investor-paul-dacier-buys-100k-in-stock-93CH-3793089",
  "description": "",
  "author": "Investing.com",
  "published": "2025-01-01 00:51:37",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 1060,
  "excerpt": "Rain enhancement technologies investor Paul Dacier buys $100k in stock",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "Paul T. Dacier, a significant shareholder of Rain Enhancement Technologies Holdco, Inc. (NASDAQ:RAIN), has acquired 8,782 shares of the company's Class A common stock. The shares were purchased at approximately $11.39 each, totaling around $100,026. The micro-cap company, currently valued at $3.97 million, has seen its stock surge over 430% in the past year. According to InvestingPro analysis, the stock appears overvalued at current levels, with a Fair Financial Health Score of 2.27. This transaction was completed as part of a private placement linked to a business combination involving Coliseum Acquisition Corp. and Rain Enhancement Technologies, Inc. Following this acquisition, Dacier holds a total of 1,848,104 shares indirectly through Rainwater LLC. Want deeper insights into RAIN's valuation and insider trading patterns? InvestingPro subscribers get access to exclusive financial metrics and real-time alerts on insider transactions. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_10_800x533_L_1420026292.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003ePaul T. Dacier, a significant shareholder of Rain Enhancement Technologies Holdco, Inc. (NASDAQ:RAIN), has acquired 8,782 shares of the company\u0026#39;s Class A common stock. The shares were purchased at approximately $11.39 each, totaling around $100,026. The micro-cap company, currently valued at $3.97 million, has seen its stock surge over 430% in the past year. According to \u003ca href=\"https://www.investing.com/pro/RAIN\"\u003eInvestingPro\u003c/a\u003e analysis, the stock appears overvalued at current levels, with a Fair Financial Health Score of 2.27. This transaction was completed as part of a private placement linked to a business combination involving Coliseum Acquisition Corp. and Rain Enhancement Technologies, Inc. Following this acquisition, Dacier holds a total of 1,848,104 shares indirectly through Rainwater LLC. Want deeper insights into RAIN\u0026#39;s valuation and insider trading patterns? \u003ca href=\"https://www.investing.com/pro/RAIN\"\u003eInvestingPro\u003c/a\u003e subscribers get access to exclusive financial metrics and real-time alerts on insider transactions.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-01T00:51:37Z",
  "modifiedTime": null
}
