{
  "id": "f373b617-b327-4a58-8c22-e4efceb193d6",
  "title": "Ford CEO Jim Farley says Waymo’s approach to self-driving makes more sense than Tesla’s",
  "link": "https://fortune.com/2025/06/27/ford-ceo-jim-farley-waymo-self-driving-lidar-more-sense-than-tesla-aspen-ideas/",
  "description": "Farley says that LiDAR is “mission critical.”",
  "author": "Jessica Mathews",
  "published": "Sat, 28 Jun 2025 00:34:21 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Business"
  ],
  "byline": "Jessica Mathews",
  "length": 3609,
  "excerpt": "Farley says that LiDAR is “mission critical.”",
  "siteName": "Fortune",
  "favicon": "https://fortune.com/icons/favicons/apple-touch-icon.png",
  "text": "Ford CEO Jim Farley expressed skepticism about the technological approach to self-driving cars being pursued by Tesla, citing consumer “trust” and the need to “be really careful” as reasons why Ford sees more potential in systems based on laser sensors like those in Waymo vehicles. The comments are the latest indication of the auto industry’s resistance to Tesla CEO Elon Musk’s vision of less expensive self-driving vehicles that use only video cameras and artificial intelligence — a bet Musk believes will ultimately pay off and prompt other automakers to license Tesla’s technology. But Ford, the number three automaker in the U.S., which plans to work with partners to incorporate self-driving technology into its future vehicles, does not seem likely to license Tesla’s tech anytime soon, based on Farley’s comments on Friday. “When you have a brand like Ford, when there’s a new technology, you have to be really careful,” Farley said at the Aspen Ideas Festival on Friday. “We really believe that LiDAR is mission critical,” Farley said, referring to the laser sensors used by companies like Waymo. Farley was being interviewed by Walter Isaacson, who published a biography on Elon Musk in 2023. When their conversation turned to autonomy, Isaacson asked Farley to compare both Waymo and Tesla’s systems, and he asked which approach made more sense. “To us, Waymo,” Farley said. He pointed out that both Waymo, owned by Google-parent Alphabet, and Tesla “have made a lot of progress” on self-driving, and Farley acknowledged that he has had conversations with Elon Musk. But he stated that Ford considered LiDAR to be an important part of the picture, noting that “where the camera will be completely blinded, the LiDAR system will see exactly what’s in front of you.” Tesla, which recently launched its robotaxi service in Austin—with safety riders in the front seat—has famously taken a “camera-only” approach to its autonomous technology, meaning that it doesn’t use radar or LiDAR technology to “see” the environment around the car. This approach has drawn scrutiny across the industry from people who question whether it is as safe without the redundancies, even as Musk argues that it’s more economical and performs just as well “The issue with Waymo’s cars is it costs way more money,” Musk said during Tesla’s quarterly earnings call in April.  “The car is very expensive, made in low volume. Teslas probably cost 25% or 20% of what a Waymo costs and made in very high volume.” Ford has said it plans to partner with a self-driving software company once the technology is farther along. While the company had spent $1 billion pursuing its own joint venture with Volkswagen, called Argo AI, Ford stopped funding the effort in 2022 and decided to pursue a partnership model. In the meantime, the company has shifted attention to its “BlueCruise” technology, a so-called Level 2 self-driving system that allows drivers to take their hands off the wheel on the highway but requires full attention. Ford is still working on developing a more advanced system, which will allow drivers to not pay attention during certain times on the highway—but it has said it no longer has intentions to build a fully autonomous, Level 4 system, only plans to partner with other companies who have. “We decided, as a company, that a cooler problem than full autonomy in an urban setting was high speed, eyes off. Push a button and read a book in your car,” Farley said.Introducing the 2025 Fortune 500, the definitive ranking of the biggest companies in America. Explore this year's list.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2192536788.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eFord CEO Jim Farley expressed skepticism about the technological approach to self-driving cars being pursued by \u003ca href=\"https://fortune.com/company/tesla/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/tesla/\"\u003eTesla\u003c/a\u003e, citing consumer “trust” and the need to “be really careful” as reasons why Ford sees more potential in systems based on laser sensors like \u003ca href=\"https://fortune.com/2025/03/25/waymo-alphabet-google-washington-dc-autonomous-taxi-safety-technology/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2025/03/25/waymo-alphabet-google-washington-dc-autonomous-taxi-safety-technology/\"\u003ethose in Waymo vehicles\u003c/a\u003e.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eThe comments are the latest indication of the auto industry’s resistance to Tesla CEO Elon Musk’s vision of less expensive self-driving vehicles that use only video cameras and artificial intelligence — a bet Musk believes will ultimately pay off and prompt other automakers to \u003ca href=\"https://x.com/elonmusk/status/1775531730306249026\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://x.com/elonmusk/status/1775531730306249026\"\u003elicense Tesla’s technology\u003c/a\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003eBut Ford, the number three automaker in the U.S., which plans to work with partners to incorporate self-driving technology into its future vehicles, does not seem likely to license Tesla’s tech anytime soon, based on Farley’s comments on Friday.\n\n\n\n\u003c/p\u003e\u003cp\u003e“When you have a brand like Ford, when there’s a new technology, you have to be really careful,” Farley said at the Aspen Ideas Festival on Friday. “We really believe that LiDAR is mission critical,” Farley said, \u003ca href=\"https://www.ibm.com/think/topics/lidar\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://www.ibm.com/think/topics/lidar\"\u003ereferring to the laser sensors\u003c/a\u003e used by companies like Waymo.\n\n\n\n\u003c/p\u003e\u003cp\u003eFarley was being interviewed by Walter Isaacson, who published a biography on Elon Musk in 2023. When their conversation turned to autonomy, Isaacson asked Farley to compare both Waymo and Tesla’s systems, and he asked which approach made more sense. \u003c/p\u003e\u003cp\u003e“To us, Waymo,” Farley said. He pointed out that both \u003ca href=\"https://fortune.com/2024/05/29/waymo-self-driving-robo-taxi-uber-tesla-alphabet/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/05/29/waymo-self-driving-robo-taxi-uber-tesla-alphabet/\"\u003eWaymo\u003c/a\u003e, owned by Google-parent Alphabet, and Tesla “have made a lot of progress” on self-driving, and Farley acknowledged that he has had conversations with Elon Musk. But he stated that Ford considered LiDAR to be an important part of the picture, noting that “where the camera will be completely blinded, the LiDAR system will see exactly what’s in front of you.”\n\n\n\n\u003c/p\u003e\u003cp\u003eTesla, which recently \u003ca href=\"https://fortune.com/2025/06/10/tesla-robotaxi-launch-austin-residents-vehicles-testing-neighborhood-streets\" target=\"_self\" aria-label=\"Go to https://fortune.com/2025/06/10/tesla-robotaxi-launch-austin-residents-vehicles-testing-neighborhood-streets\"\u003elaunched its robotaxi service in Austin\u003c/a\u003e—with safety riders in the front seat—has famously taken a “camera-only” approach to its autonomous technology, meaning that it doesn’t use radar or LiDAR technology to “see” the environment around the car. This approach has drawn scrutiny across the industry from people who question whether it is as safe without the redundancies, even as Musk argues that it’s more economical and performs just as well\n\n\n\n\u003c/p\u003e\u003cp\u003e“The issue with Waymo’s cars is it costs way more money,” Musk said during Tesla’s quarterly earnings call in April.  “The car is very expensive, made in low volume. Teslas probably cost 25% or 20% of what a Waymo costs and made in very high volume.”\n\n\n\n\u003c/p\u003e\u003cp\u003eFord has said it plans to partner with a self-driving software company once the technology is farther along. While the company had spent $1 billion pursuing its own joint venture with \u003ca href=\"https://fortune.com/company/volkswagen/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/volkswagen/\"\u003eVolkswagen\u003c/a\u003e, called Argo AI, Ford stopped funding the effort in 2022 and decided to pursue a partnership model. In the meantime, the company has shifted attention to its “BlueCruise” technology, a so-called Level 2 self-driving system that allows drivers to take their hands off the wheel on the highway but requires full attention. Ford is still working on developing a more advanced system, which will allow drivers to not pay attention during certain times on the highway—but it has said it no longer has intentions to build a fully autonomous, Level 4 system, only plans to partner with other companies who have.\n\n\n\n\u003c/p\u003e\u003cp\u003e“We decided, as a company, that a cooler problem than full autonomy in an urban setting was high speed, eyes off. Push a button and read a book in your car,” Farley said.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eIntroducing the 2025 Fortune 500\u003c/strong\u003e, the definitive ranking of the biggest companies in America. \u003ca href=\"https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\"\u003eExplore this year\u0026#39;s list.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
