{
  "id": "f79bcb90-7c91-4555-9be6-075facc36109",
  "title": "If You'd Bought 1 Share of Netflix at Its IPO, Here's How Many Shares You Would Own Now",
  "link": "https://finance.yahoo.com/news/youd-bought-1-share-netflix-142700077.html",
  "description": "",
  "author": "",
  "published": "2025-02-25T14:27:00Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Collin Brantmeyer, The Motley Fool",
  "length": 2480,
  "excerpt": "Could Netflix split its stock again? Here's its history as a publicly traded company.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Netflix (NASDAQ: NFLX) has arguably been the biggest disruptor to the entertainment industry over the past 30 years. Today, the streaming giant's stock trades at over $1,000 per share and is a potential candidate for a stock split. But, before getting into that, let's take a closer look at how many shares Netflix investors would own today if they had held on to their shares since they started trading on the Nasdaq Stock Market. Netflix was founded in 1997 as a competitor to Blockbuster, operating a DVD-by-mail rental service, and quickly went public in 2002 at $15 per share. Just two years later, in 2004, Netflix split its stock 2-for-1 when it was trading at around $70 per share. The company later pivoted when it introduced a streaming service in January 2007, delivering video on demand to its subscribers. As the platform skyrocketed in popularity, so did its stock -- soaring to nearly $700 before undergoing another split in 2015, this time at a 7-for-1 ratio. As a result of Netflix's two stock splits, if you had bought one share at its initial public offering, you would hold 14 shares. An initial $15 investment would be worth over $14,000 today, to demonstrate the company's overwhelming success. Previously, chairman and co-founder Reed Hastings has stated that a lower stock price can make Netflix shares more affordable to retail investors. As outlined, Netflix's previous stock splits came at a lower price point than where the stock currently trades, so another split could be plausible. That said, investing in a stock solely in hopes of a stock split is generally not a wise strategy. A split does not change the overall value of your investment. Instead, investors should focus on the company's health. Notably, Netflix continues to dominate the streaming landscape with 301 million global paid subscribers, which delivered $39 billion in revenue and $6.9 billion in free cash flow. For 2025, management expects 12% to 14% revenue growth and 16% free-cash-flow growth, meaning shareholders should continue to benefit by holding Netflix for the long term. Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this. On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
  "image": "https://s.yimg.com/ny/api/res/1.2/CtrTpjDs38aLDL5uyzK.bQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MjE7Y2Y9d2VicA--/https://media.zenfs.com/en/motleyfool.com/0db276e4c97a93ee5109680bcdf80217",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"\" loading=\"eager\" height=\"577\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e  \u003c/figure\u003e \u003cp\u003e\u003cstrong\u003eNetflix\u003c/strong\u003e \u003cspan\u003e(NASDAQ: NFLX)\u003c/span\u003e has arguably been the biggest disruptor to the entertainment industry over the past 30 years. Today, the streaming giant\u0026#39;s stock trades at over $1,000 per share and is a potential candidate for a \u003ca href=\"https://www.fool.com/terms/s/stock-split/?utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=778831eb-3b2e-417d-aa31-02bc3cc5e5a9\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:stock split;elm:context_link;itc:0;sec:content-canvas\"\u003estock split\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eBut, before getting into that, let\u0026#39;s take a closer look at how many shares Netflix investors would own today if they had held on to their shares since they started trading on the \u003ca href=\"https://www.fool.com/investing/stock-market/exchange/nasdaq/?utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=778831eb-3b2e-417d-aa31-02bc3cc5e5a9\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Nasdaq Stock Market;elm:context_link;itc:0;sec:content-canvas\"\u003eNasdaq Stock Market\u003c/a\u003e.\u003c/p\u003e  \u003cp\u003eNetflix was founded in 1997 as a competitor to Blockbuster, operating a DVD-by-mail rental service, and quickly went public in 2002 at $15 per share. Just two years later, in 2004, Netflix split its stock 2-for-1 when it was trading at around $70 per share.\u003c/p\u003e \u003cp\u003eThe company later pivoted when it introduced a streaming service in January 2007, delivering video on demand to its subscribers. As the platform skyrocketed in popularity, so did its stock -- soaring to nearly $700 before undergoing another split in 2015, this time at a 7-for-1 ratio.\u003c/p\u003e \u003cp\u003eAs a result of Netflix\u0026#39;s two stock splits, if you had bought one share at its initial public offering, you would hold 14 shares. An initial $15 investment would be worth over $14,000 today, to demonstrate the company\u0026#39;s overwhelming success.\u003c/p\u003e  \u003cp\u003ePreviously, chairman and co-founder Reed Hastings has stated that a lower stock price can make Netflix shares more affordable to retail investors. As outlined, Netflix\u0026#39;s previous stock splits came at a lower price point than where the stock currently trades, so another split could be plausible.\u003c/p\u003e \u003cp\u003eThat said, investing in a stock solely in hopes of a stock split is generally not a wise strategy. A split does not change the overall value of your investment.\u003c/p\u003e  \u003cp\u003eInstead, investors should focus on the company\u0026#39;s health. Notably, Netflix continues to dominate the streaming landscape with 301 million global paid subscribers, which delivered $39 billion in revenue and $6.9 billion in free cash flow. For 2025, management expects 12% to 14% revenue growth and 16% free-cash-flow growth, meaning shareholders should continue to benefit by holding Netflix for the long term.\u003c/p\u003e  \u003cp\u003eEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\u003c/p\u003e \u003cp\u003eOn rare occasions, our expert team of analysts issues a \u003ca href=\"https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e\u0026amp;impression=a1b68a90-ecd8-4f55-a2f9-4d72bf36dcd6\u0026amp;url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fa-sa-dd-3%3Faid%3D9431%26source%3Disaeditxt0001030%26ftm_cam%3Dsa-dd%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D17178\u0026amp;utm_source=yahoo-host-full\u0026amp;utm_medium=feed\u0026amp;utm_campaign=article\u0026amp;referring_guid=778831eb-3b2e-417d-aa31-02bc3cc5e5a9\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:“Double Down” stock;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cstrong\u003e“Double Down” stock\u003c/strong\u003e\u003c/a\u003e recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\u003c/p\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-25T14:27:00Z",
  "modifiedTime": null
}
