{
  "id": "fcc3512d-6379-44a1-a00d-7618152d6125",
  "title": "Carlyle group exits Indegene; sells 10.2% stake for Rs 1,447 crore",
  "link": "https://www.business-standard.com/companies/news/carlyle-group-exits-indegene-sells-10-2-stake-for-rs-1-447-crore-125060401213_1.html",
  "description": "According to the bulk deal data available on the NSE, US-based Carlyle group, through its arm CA Dawn Investments, sold more than 2.44 crore shares, amounting to a 10.20 per cent stake in Indegene",
  "author": "",
  "published": "Wed, 04 Jun 2025 21:26:43 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 2036,
  "excerpt": "Global investment firm Carlyle group on Wednesday exited Indegene by divesting its entire 10.2 per cent stake in digital healthcare services for Rs 1,447 crore through open market transactions.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192-min.png",
  "text": "Global investment firm Carlyle group on Wednesday exited Indegene by divesting its entire 10.2 per cent stake in digital healthcare services for Rs 1,447 crore through open market transactions. According to the bulk deal data available on the NSE, US-based Carlyle group, through its arm CA Dawn Investments, sold more than 2.44 crore shares, amounting to a 10.20 per cent stake in Indegene. The shares were offloaded in the price range of Rs 591.02-591.84 apiece, taking the combined transaction value to Rs 1,447.17 crore. Meanwhile, Premji Invest's affiliate PI Opportunities AIF V, Capital group, Societe Generale, Luxembourg-based Eastbridge Group and Abakkus Asset Manager cumulatively bought 1.06 crore shares or 4.42 per cent stake in Indegene for Rs 627 crore. The shares were picked up in the price range of Rs 591-591.48 apiece, taking the aggregate deal value to Rs 626.85 crore.Also Read Details of the other buyers of Indegene's shares could not be ascertained on the National Stock Exchange (NSE). Shares of Indegene declined 4.07 per cent to close at Rs 594.50 per piece on the NSE. PE firm Carlyle group's clocked an impressive 31 per cent internal rate of return over a four-year period. This highly profitable divestment marks a pivotal moment, underscoring the immense potential of India's digital healthcare sector. In April 2021, Carlyle invested USD 122 million (Rs 917 crore) in Indegene by acquiring 45.5 million shares at Rs 201 each on the stock exchanges. Carlyle executed a phased exit as Indegene scaled its global operations and went public in May 2024. The shares were sold by the PE firm at Rs 452 apiece during the initial public offering, at Rs 618 per share in December 2024, and the final tranche at about Rs 591 each in June 2025, enabling Carlyle to secure significant returns amidst varying market conditions.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-08/30/full/1630325404-8966.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tGlobal investment firm Carlyle group on Wednesday exited Indegene by divesting its entire 10.2 per cent stake in digital healthcare services for Rs 1,447 crore through open market transactions.\u003c/p\u003e\n\u003cp\u003e\n\tAccording to the bulk deal data available on the NSE, US-based Carlyle group, through its arm CA Dawn Investments, sold more than 2.44 crore shares, amounting to a 10.20 per cent stake in Indegene.\u003c/p\u003e\n\u003cp\u003e\n\tThe shares were offloaded in the price range of Rs 591.02-591.84 apiece, taking the combined transaction value to Rs 1,447.17 crore.\u003c/p\u003e\n\u003cp\u003e\n\tMeanwhile, Premji Invest\u0026#39;s affiliate PI Opportunities AIF V, Capital group, Societe Generale, Luxembourg-based Eastbridge Group and Abakkus Asset Manager cumulatively bought 1.06 crore shares or 4.42 per cent stake in Indegene for Rs 627 crore.\u003c/p\u003e\n\u003cp\u003e\n\tThe shares were picked up in the price range of Rs 591-591.48 apiece, taking the aggregate deal value to Rs 626.85 crore.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tDetails of the other buyers of Indegene\u0026#39;s shares could not be ascertained on the National Stock Exchange (NSE).\u003c/p\u003e\n\u003cp\u003e\n\tShares of Indegene declined 4.07 per cent to close at Rs 594.50 per piece on the NSE.\u003c/p\u003e\n\u003cp\u003e\n\tPE firm Carlyle group\u0026#39;s clocked an impressive 31 per cent internal rate of return over a four-year period. This highly profitable divestment marks a pivotal moment, underscoring the immense potential of India\u0026#39;s digital healthcare sector.\u003c/p\u003e\n\u003cp\u003e\n\tIn April 2021, Carlyle invested USD 122 million (Rs 917 crore) in Indegene by acquiring 45.5 million shares at Rs 201 each on the stock exchanges.\u003c/p\u003e\n\u003cp\u003e\n\tCarlyle executed a phased exit as Indegene scaled its global operations and went public in May 2024.\u003c/p\u003e\n\u003cp\u003e\n\tThe shares were sold by the PE firm at Rs 452 apiece during the initial public offering, at Rs 618 per share in December 2024, and the final tranche at about Rs 591 each in June 2025, enabling Carlyle to secure significant returns amidst varying market conditions.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-04T21:26:43+05:30",
  "modifiedTime": null
}
