[
  {
    "id": "d75d1bb1-2b91-4bc4-9a61-7915ea78b5cb",
    "title": "England W 2-1 Italy W: What Were The Main Talking Points As The Lionesses Remarkably Punch Their EURO 25 Final Ticket?",
    "link": "https://www.soccernews.com/england-w-2-1-italy-w-what-were-the-main-talking-points-as-the-lionesses-remarkably-punch-their-euro-25-final-ticket/387890/",
    "description": "Producing what was another sensational late comeback on Tuesday night, England booked their spot in the final of this summer’s European Championships as they snatched a 2-1 victory against Italy in Geneva. In what was a similar story to last weekend’s epic quarter-final showdown against Sweden, the Lionesses drastically failed to find any kind of […] The post England W 2-1 Italy W: What Were The Main Talking Points As The Lionesses Remarkably Punch Their EURO 25 Final Ticket? appeared first on Soccer News.",
    "author": "Tom Dunstan",
    "published": "Tue, 22 Jul 2025 22:55:32 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "Editorial",
      "European Championships"
    ]
  },
  {
    "id": "675e6c58-ea3b-4284-881c-c2259434b867",
    "title": "´We´re going to make a movie someday´, says Wiegman after late England heroics",
    "link": "https://www.soccernews.com/we-re-going-to-make-a-movie-someday-says-wiegman-after-late-england-heroics/387892/",
    "description": "Sarina Wiegman believes her England team are going to “make a movie someday” after edging another dramatic encounter to reach the Euro 2025 final. Wiegman watched on as the Lionesses came from a goal down to beat Italy 2-1 in extra-time, with the win sealed by substitutes Michelle Agyemang and Chloe Kelly. Barbara Bonansea had […] The post ´We´re going to make a movie someday´, says Wiegman after late England heroics appeared first on Soccer News.",
    "author": "SoccerNews",
    "published": "Wed, 23 Jul 2025 00:11:00 +0000",
    "image": "",
    "source": "https://www.soccernews.com/feed",
    "categories": [
      "General Soccer News"
    ]
  }
]
