{
  "id": "0ec3f25e-52d7-42b2-9a69-1ecf7e68a654",
  "title": "Artificial Intelligence Put My Dad Out Of A Job And I’m Worried",
  "link": "https://www.financialsamurai.com/artificial-intelligence-put-my-dad-out-of-a-job/",
  "description": "For over 10 years, my father has been my primary editor on Financial Samurai. When my father isn't available, my wife steps in. This system has allowed me to maintain a consistent publishing schedule of three quality posts a week. Typically, I spend 1.5–3 hours writing a post. Then, my father spends 1–1.5 hours editing […] The post Artificial Intelligence Put My Dad Out Of A Job And I’m Worried appeared first on Financial Samurai.",
  "author": "Financial Samurai",
  "published": "Wed, 02 Oct 2024 11:28:00 +0000",
  "source": "https://www.financialsamurai.com/feed/",
  "categories": [
    "Career \u0026 Employment"
  ],
  "byline": "Financial Samurai",
  "length": 10752,
  "excerpt": "Artificial intelligence (AI) put my dad out of his editing job of 10 plus years. More than the loss in income is the loss of purpose.",
  "siteName": "Financial Samurai",
  "favicon": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2017/02/cropped-FinancialSamurai-Site-Icon-700x700-180x180.png",
  "text": "For over 10 years, my father has been my primary editor on Financial Samurai. When my father isn't available, my wife steps in. This system has allowed me to maintain a consistent publishing schedule of three quality posts a week. Typically, I spend 1.5–3 hours writing a post. Then, my father spends 1–1.5 hours editing it. After that, I take another 30 minutes or so to add relevant links, images, and share the post on social media. Altogether, each post can take up to five hours to produce, even though they usually take less than 10 minutes to read. No wonder why it’s so hard to last online! Not only does it take huge effort to complete a post, everybody expects you to write for free. And if you can’t get any sponsors, the natural course of action is to quit. Fortunately, I enjoy the process of writing, spending roughly 10 hours a week on it. However, in 2022, artificial intelligence (AI) became mainstream with OpenAI’s ChatGPT. Initially, I didn’t pay much attention to it, as people were mostly using it for casual conversations—like having a digital companion. Then I became dismayed by how AI was simply stealing all publishers' content. But in early 2024, I found the perfect use case for ChatGPT after opening up a free account in 2023. After writing each post, I'd just drop the entire post in the software to catch grammar errors and make my writing clearer. Not only did this speed up my writing process, but it also saved my father almost five hours of work each week. In other words, AI replaced my dad’s job. My Dad Was Actually Happy AI Took Over After relying on our writing and editing routine for so long, I felt a little guilty about not sending him my draft posts anymore. So, one day, I asked him how he felt about it. To my surprise, he was not only fine with it, but actually happy! In the past, he had occasionally complained about my tendency to write too much or be too wordy. However, I didn’t expect him to be glad that he no longer had to edit my posts. Sure, I wasn’t paying him much to edit—his “compensation” was being able to order Uber Eats on my credit card for whatever he and my mom wanted. My card is the default setting on his Uber Eats account. During COVID, I set this up to help them avoid public places and unnecessary driving as senior citizens in their 70s. They love food, so they were quite pleased with the arrangement. Although he no longer edits my posts regularly, he’s still on the Financial Samurai meal plan, which I’m happy to continue as a way to make up for the years he helped me for free. The Problem With AI Taking Over My Dad’s Job Here’s the thing: I didn’t just want my dad to be my editor for the help—it was a way for us to bond. He is a man of few words and I wanted to have more organic reasons to call. Since I published three posts a week, plus a weekly newsletter, I would call, text, or email him at least three times a week. During these exchanges, we would talk about the post, trade ideas, and discuss anything else happening in our lives. Being my editor brought us closer together. I had to endure a lot of critical feedback that sometimes stung, but it was worth it. Now that he’s no longer editing regularly, our communication has dropped by 70%. I still call him once or twice a week, but we no longer chat as frequently or in as much detail. That’s the biggest downside of AI replacing my dad’s job—the decline in our conversations. How sad. When I started Financial Samurai, I envisioned it as a place where my parents could always check in to see what I was up to. I was living in SF and constantly traveling, while they were abroad or living in Honolulu. Now, I hope it can serve as a repository of thoughts and memories for my children. Having Purpose In Retirement Is So Important Another concern I have about AI taking over my dad’s job is that it takes away one of his purposes. Even though he says he’s happy to no longer edit my posts, I wonder if he’s truly 100% OK with it. Everyone needs a sense of purpose, especially in retirement. Without purpose, you risk spending your days passively—sitting in front of the TV, letting your mind and body deteriorate. By keeping the mind challenged, especially in retirement, we might be able to stave off neurodegenerative disorders or at least slow them down. If we don’t use our minds and bodies, we tend to lose them. I worry about this for my dad because I went through a letdown after I retired in 2012. I felt uncertain, anxious, and restless for the first couple of years. I’ve written about the downsides of early retirement to help others feel OK sharing their concerns. Writing for Financial Samurai gave me a purpose after I no longer had clients to manage. Coming up with new ideas has also kept my mind sharp. Small Surprising Revelations Keep Coming For example, just the other day, I was telling my wife how excited I was of a simple solution I came up with for the work-from-home debate: work for a company that allows you to work from home for a better lifestyle, but invest in companies that require employees to be in the office for potentially better returns. This way, you’re at least hedged. I had been focusing on the work-from-home issue from the employee and manager perspectives but hadn’t considered it from an investor’s viewpoint. I’m sure others have thought of this before, but I hadn’t come across it communicated so succinctly as a solution. Consulting for a startup earlier this year, even if only for four months, reminded me how much harder startup employees work compared to those at established companies. Something is always going on and startup employees need to be able to perform multiple job functions. My latest consulting experience prompted me to invest more in a venture capital fund focused on AI. Seeing smart, motivated people create is a part of America's magic. I had conviction investing in private growth companies before, but now I have even more. Hopefully, regularly exercising my mind by coming up with new ideas will keep it healthy for longer. Blind Spot: We're Just Two Different People Maybe my dad’s retirement is exactly what he wants—great food, Apple TV+, the occasional exercise class, and a quarterly poker night with friends while living in Hawaii. When I write this out, his retirement sound great! After all, he’s a traditional retiree in his 70s, while I retired early at 34 and am now 47. I likely have more energy to take on new activities simply because I’m younger. I'm also obsessed with doing as much as possible before I become incapacitated. My dad, on the other hand, has been retired for over 20 years. So by now, he surely knows what makes him happy. Perhaps my fear is that I see plenty of active people in their late 60s and 70s playing pickleball, which amazes me. So, part of me dreams about that level of activity, ability, and community for my father. I also worry about settling into a sedentary lifestyle, as if it is an inevitability as one ages. But I’ve come to realize—and accept—that we’re just two different people with different levels of contentment. If he's not worried, why should I be? Besides, it’s hard to change one’s habits so late. AI May Be Coming For Your Job Too Luckily for my dad, he doesn’t need an editing job to make ends meet. After decades of working in the foreign service, he has a lifetime pension. But what I do know is that AI is coming for millions of jobs. My dad’s job was one of them, and yours could be next. AI has boosted my productivity by about 35%, and I expect that to grow as I get better at using it. Some website owners are now producing hundreds of articles a month with AI, while I’m still stubbornly holding at 16. I used to be skeptical of AI, but once I learned to use it, I became a believer. This year, I’ve invested over $140,000 into private AI companies, with plans to invest more as my cash flow allows. If OpenAI was going to put my dad out of work, then at least it should give me a return on my investment. Learn To Use AI For Your Own Good You need to get comfortable with AI to boost your productivity at work. Build or use an AI agent or AI copilot to help you get work done. Learn every AI tool and application you can because if you don’t, someone else will, and you'll fall behind. I’m currently using ChatGPT for the most basic task: editing. But the more drafts I feed into it, the better it will get at learning my writing style. Eventually, AI could generate posts that are 80%+ done based on the topics and parameters I set. That would save me three to six hours a week. Then I could finally sit on the beach every day, sipping a margarita after a round of tennis. What a life! Well, maybe not. I could do that now, but I don’t because I enjoy being productive. There’s something deeply rewarding about creating something from nothing. Writing is part of my ikigai—it not only brings me happiness but also helps me work through dilemmas, which gives me a deep sense of satisfaction. Through writing this post, I’ve come to realize the futility of trying to change someone based on my own desires and the importance of letting people be. I’m not ready to let AI take away the joy of effort and creativity yet. Maybe I’ll teach my dad how to use ChatGPT to edit my posts when I visit him next. He’s used Grammarly before, and since he’s not that excited about editing my work, AI could save him a lot of time. Who knows, maybe his interest will return as he adds his personal touch while keeping his mind sharp! But again, that might just be me projecting. Leave him alone in retirement already! I’ll check in with him after he reads this post! Hope retirement life is treating you ever better, dad. Reader Questions Has AI taken over your job yet? If not, are you worried it will? How are you using AI to boost your productivity? I’d love to hear all the ways you’ve integrated AI into your work. Or, are you avoiding AI altogether? If you're interested in investing in AI companies as a hedge, check out the Fundrise venture capital product. It invests in the following sectors: Artificial Intelligence \u0026 Machine Learning Modern Data Infrastructure Development Operations (DevOps) Financial Technology (FinTech) Real Estate \u0026 Property Technology (PropTech) Roughly 65% of the Fundrise venture product is invests in artificial intelligence, which I'm bullish about. In 20 years, I don't want my kids wondering why I didn't invest in AI or work in AI! The investment minimum is also only $10. I'm an investor and Fundrise is also a long-time sponsor of Financial Samurai.",
  "image": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/09/homeless-8614156_1280.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-270499\" itemtype=\"https://schema.org/CreativeWork\" itemscope=\"itemscope\"\u003e\n\n\t\n\t\n\u003cdiv data-ast-blocks-layout=\"true\" itemprop=\"text\"\u003e\n\n\t\t\n\t\t\n\u003cp\u003eFor over 10 years, my father has been my primary editor on \u003cem\u003eFinancial Samurai\u003c/em\u003e. When my father isn\u0026#39;t available, my wife steps in. This system has allowed me to maintain a consistent publishing schedule of three quality posts a week.\u003c/p\u003e\n\n\n\n\u003cp\u003eTypically, I spend 1.5–3 hours writing a post. Then, my father spends 1–1.5 hours editing it. After that, I take another 30 minutes or so to add relevant links, images, and share the post on social media. Altogether, each post can take up to five hours to produce, even though they usually take less than 10 minutes to read. \u003c/p\u003e\n\n\n\n\u003cp\u003eNo wonder why it’s so hard to last online! Not only does it take huge effort to complete a post, everybody expects you to write for free. And if you can’t get any sponsors, the natural course of action is to quit.\u003c/p\u003e\n\n\n\n\u003cp\u003eFortunately, I enjoy the process of writing, spending roughly 10 hours a week on it. However, in 2022, \u003ca href=\"https://www.financialsamurai.com/artificial-intelligence-ai-how-to-protect-yourself-and-benefit-financially/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eartificial intelligence\u003c/a\u003e (AI) became mainstream with OpenAI’s ChatGPT. Initially, I didn’t pay much attention to it, as people were mostly using it for casual conversations—like having a digital companion. Then I became dismayed by how AI was simply stealing all publishers\u0026#39; content.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut in early 2024, I found the perfect use case for ChatGPT after opening up a free account in 2023. After writing each post, I\u0026#39;d just drop the entire post in the software to catch grammar errors and make my writing clearer. Not only did this speed up my writing process, but it also saved my father almost five hours of work each week.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn other words, AI replaced my dad’s job.\u003c/p\u003e\n\n\n\n\u003ch2\u003eMy Dad Was Actually Happy AI Took Over\u003c/h2\u003e\n\n\n\n\u003cp\u003eAfter relying on our writing and editing routine for so long, I felt a little guilty about not sending him my draft posts anymore. So, one day, I asked him how he felt about it. To my surprise, he was not only fine with it, but actually happy!\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the past, he had occasionally complained about my tendency to write too much or be too wordy. However, I didn’t expect him to be \u003cem\u003eglad\u003c/em\u003e that he no longer had to edit my posts.\u003c/p\u003e\n\n\n\n\u003cp\u003eSure, I wasn’t paying him much to edit—his “compensation” was being able to order Uber Eats on my credit card for whatever he and my mom wanted. My card is the default setting on his Uber Eats account. During COVID, I set this up to help them avoid public places and unnecessary driving as senior citizens in their 70s.\u003c/p\u003e\n\n\n\n\u003cp\u003eThey love food, so they were quite pleased with the arrangement. Although he no longer edits my posts regularly, he’s still on the \u003cem\u003eFinancial Samurai\u003c/em\u003e meal plan, which I’m happy to continue as a way to make up for the years he helped me for free.\u003c/p\u003e\n\n\n\n\u003ch2\u003eThe Problem With AI Taking Over My Dad’s Job\u003c/h2\u003e\n\n\n\n\u003cp\u003eHere’s the thing: I didn’t just want my dad to be my editor for the help—it was\u003cstrong\u003e a way for us to bond\u003c/strong\u003e. He is a man of few words and I wanted to have more organic reasons to call. \u003c/p\u003e\n\n\n\n\u003cp\u003eSince I published three posts a week, \u003ca aria-label=\"plus a weekly newsletter (opens in a new tab)\" href=\"https://www.financialsamurai.com/news\" target=\"_blank\" rel=\"nofollow noindex noreferrer noopener\"\u003eplus a weekly newsletter\u003c/a\u003e, I would call, text, or email him at least three times a week. During these exchanges, we would talk about the post, trade ideas, and discuss anything else happening in our lives.\u003c/p\u003e\n\n\n\n\u003cp\u003eBeing my editor brought us closer together. I had to endure a lot of critical feedback that sometimes stung, but it was worth it. Now that he’s no longer editing regularly, our communication has dropped by 70%.\u003c/p\u003e\n\n\n\n\u003cp\u003eI still call him once or twice a week, but we no longer chat as frequently or in as much detail. That’s the biggest downside of AI replacing my dad’s job—the decline in our conversations. How sad.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen I started \u003cem\u003eFinancial Samurai\u003c/em\u003e, I envisioned it as a place where my parents could always check in to see what I was up to. I was living in SF and constantly traveling, while they were abroad or \u003ca href=\"https://www.financialsamurai.com/challenges-of-living-working-honolulu-hawaii/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eliving in Honolulu\u003c/a\u003e. Now, I hope it can serve as a repository of thoughts and memories for my children.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-having-purpose-in-retirement-is-so-important\"\u003eHaving Purpose In Retirement Is So Important\u003c/h2\u003e\n\n\n\n\u003cp\u003eAnother concern I have about AI taking over my dad’s job is that it takes away one of his purposes. Even though he says he’s happy to no longer edit my posts, I wonder if he’s truly 100% OK with it.\u003c/p\u003e\n\n\n\n\u003cp\u003eEveryone needs a sense of purpose, especially in retirement. Without purpose, you risk spending your days passively—sitting in front of the TV, letting your mind and body deteriorate.\u003c/p\u003e\n\n\n\n\u003cp\u003eBy keeping the mind challenged, especially in retirement, we might be able to stave off neurodegenerative disorders or at least slow them down. If we don’t use our minds and bodies, we tend to lose them.\u003c/p\u003e\n\n\n\n\u003cp\u003eI worry about this for my dad because I went through a letdown after I retired in 2012. I felt uncertain, anxious, and restless for the first couple of years. I’ve written about the \u003ca href=\"https://www.financialsamurai.com/the-negatives-of-early-retirement-life-nobody-likes-to-talks-about/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edownsides of early retirement\u003c/a\u003e to help others feel OK sharing their concerns.\u003c/p\u003e\n\n\n\n\u003cp\u003eWriting for \u003cem\u003eFinancial Samurai\u003c/em\u003e gave me a purpose after I no longer had clients to manage. Coming up with new ideas has also kept my mind sharp. \u003c/p\u003e\n\n\n\n\u003ch2\u003eSmall Surprising Revelations Keep Coming\u003c/h2\u003e\n\n\n\n\u003cp\u003eFor example, just the other day, I was telling my wife how excited I was of a simple solution I came up with for the \u003ca href=\"https://www.financialsamurai.com/settling-the-work-from-home-debate-once-and-for-all/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ework-from-home debate\u003c/a\u003e: work for a company that allows you to work from home for a better lifestyle, but invest in companies that require employees to be in the office for potentially better returns. This way, you’re at least hedged.\u003c/p\u003e\n\n\n\n\u003cp\u003eI had been focusing on the work-from-home issue from the employee and manager perspectives but hadn’t considered it from an investor’s viewpoint. I’m sure others have thought of this before, but I hadn’t come across it communicated so succinctly as a solution.\u003c/p\u003e\n\n\n\n\u003cp\u003eConsulting for a startup earlier this year, even if \u003ca href=\"https://www.financialsamurai.com/went-back-to-work-and-could-only-last-four-months/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eonly for four months\u003c/a\u003e, reminded me how much harder startup employees work compared to those at established companies. Something is always going on and startup employees need to be able to perform multiple job functions. \u003c/p\u003e\n\n\n\n\u003cp\u003eMy latest consulting experience prompted me to invest more in a \u003cstrong\u003e\u003ca aria-label=\"venture capital fund focused on AI (opens in a new tab)\" href=\"https://www.financialsamurai.com/innovation\" target=\"_blank\" rel=\"nofollow noindex noreferrer noopener\"\u003eventure capital fund focused on AI\u003c/a\u003e\u003c/strong\u003e. Seeing smart, motivated people create is a part of America\u0026#39;s magic. I had conviction investing in private growth companies before, but now I have even more.\u003c/p\u003e\n\n\n\n\u003cp\u003eHopefully, regularly exercising my mind by coming up with new ideas will keep it healthy for longer.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-blind-spot-we-re-just-two-different-people\"\u003eBlind Spot: We\u0026#39;re Just Two Different People\u003c/h2\u003e\n\n\n\n\u003cp\u003eMaybe my dad’s retirement is exactly what he wants—great food, Apple TV+, the occasional exercise class, and a quarterly poker night with friends while living in Hawaii. When I write this out, his retirement sound great! \u003c/p\u003e\n\n\n\n\u003cp\u003eAfter all, he’s a traditional retiree in his 70s, while I retired early at 34 and am now 47. I likely have more energy to take on new activities simply because I’m younger. I\u0026#39;m also \u003cem\u003eobsessed\u003c/em\u003e with doing as much as possible before I become incapacitated. My dad, on the other hand, has been retired for over 20 years. So by now, he surely knows \u003ca href=\"https://www.financialsamurai.com/solving-happiness-things-that-will-make-you-happier-and-wealthier/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewhat makes him happy\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003ePerhaps my fear is that I see plenty of active people in their late 60s and 70s playing pickleball, which amazes me. So, part of me dreams about that level of activity, ability, and community for my father. I also worry about settling into a sedentary lifestyle, as if it is an inevitability as one ages.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut I’ve come to realize—and accept—that we’re just two different people with different levels of contentment. If he\u0026#39;s not worried, why should I be? Besides, it’s hard to change one’s habits so late.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-ai-may-be-coming-for-your-job-too\"\u003eAI May Be Coming For Your Job Too\u003c/h2\u003e\n\n\n\n\u003cp\u003eLuckily for my dad, he doesn’t need an editing job to make ends meet. After decades of working in the foreign service, he has a \u003ca href=\"https://www.financialsamurai.com/how-do-i-calculate-the-value-of-my-pension/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003elifetime pension\u003c/a\u003e. But what I do know is that AI is coming for millions of jobs. My dad’s job was one of them, and yours could be next.\u003c/p\u003e\n\n\n\n\u003cp\u003eAI has boosted my productivity by about 35%, and I expect that to grow as I get better at using it. Some website owners are now producing hundreds of articles a month with AI, while I’m still stubbornly holding at 16.\u003c/p\u003e\n\n\n\n\u003cp\u003eI used to be skeptical of AI, but once I learned to use it, I became a believer. This year, I’ve invested over $140,000 into \u003ca href=\"https://www.financialsamurai.com/investing-in-private-ai-companies-without-connections-or-big-money/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eprivate AI companies\u003c/a\u003e, with plans to invest more as my cash flow allows. If OpenAI was going to put my dad out of work, then at least it should give me a return on my investment. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-learn-to-use-ai-for-your-own-good\"\u003eLearn To Use AI For Your Own Good\u003c/h2\u003e\n\n\n\n\u003cp\u003eYou need to get comfortable with AI to boost your productivity at work. Build or use an AI agent or AI copilot to help you get work done. Learn every AI tool and application you can because if you don’t, someone else will, and you\u0026#39;ll fall behind.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m currently using ChatGPT for the most basic task: editing. But the more drafts I feed into it, the better it will get at learning my writing style. Eventually, AI could generate posts that are 80%+ done based on the topics and parameters I set. That would save me three to six hours a week.\u003c/p\u003e\n\n\n\n\u003cp\u003eThen I could finally sit on the beach every day, sipping a margarita after a round of tennis. What a life! Well, maybe not. I could do that now, but I don’t because I enjoy being productive. There’s something deeply rewarding about creating something from nothing.\u003c/p\u003e\n\n\n\n\u003cp\u003eWriting is part of my \u003cem\u003e\u003ca href=\"https://www.financialsamurai.com/ikigai-is-why-you-shouldnt-be-afraid-of-retirement/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eikigai\u003c/a\u003e\u003c/em\u003e—it not only brings me happiness but also helps me work through dilemmas, which gives me a deep sense of satisfaction. Through writing this post, I’ve come to realize the futility of trying to change someone based on my own desires and the importance of letting people be.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m not ready to let AI take away the joy of effort and creativity yet.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"728\" height=\"688\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/09/ikigai.jpg\" alt=\"Ikigai - your reason for being\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/09/ikigai.jpg?fit=1456,9999 728w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/09/ikigai-350x331.jpg?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/09/ikigai-529x500.jpg?fit=1456,9999 529w\" sizes=\"(max-width: 728px) 100vw, 728px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMaybe I’ll teach my dad how to use ChatGPT to edit my posts when I visit him next. He’s used Grammarly before, and since he’s not that excited about editing my work, AI could save him a lot of time. Who knows, maybe his interest will return as he adds his personal touch while keeping his mind sharp!\u003c/p\u003e\n\n\n\n\u003cp\u003eBut again, that might just be me projecting. Leave him alone in retirement already! I’ll check in with him after he reads this post! Hope retirement life is treating you ever better, dad.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-reader-questions\"\u003e\u003cstrong\u003eReader Questions\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eHas AI taken over your job yet? If not, are you worried it will? How are you using AI to boost your productivity? I’d love to hear all the ways you’ve integrated AI into your work. Or, are you avoiding AI altogether?\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you\u0026#39;re interested in investing in AI companies as a hedge, check out the \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/innovation\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFundrise venture capital product\u003c/a\u003e\u003c/strong\u003e. It invests in the following sectors:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eArtificial Intelligence \u0026amp; Machine Learning\u003c/li\u003e\n\n\n\n\u003cli\u003eModern Data Infrastructure\u003c/li\u003e\n\n\n\n\u003cli\u003eDevelopment Operations (DevOps)\u003c/li\u003e\n\n\n\n\u003cli\u003eFinancial Technology (FinTech)\u003c/li\u003e\n\n\n\n\u003cli\u003eReal Estate \u0026amp; Property Technology (PropTech)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eRoughly 65% of the Fundrise venture product is invests in artificial intelligence, which I\u0026#39;m bullish about. In 20 years, I don\u0026#39;t want my kids wondering why I didn\u0026#39;t invest in AI or work in AI! \u003c/p\u003e\n\n\n\n\u003cp\u003eThe investment minimum is also only $10. I\u0026#39;m an investor and Fundrise is also a long-time sponsor of Financial Samurai.\u003c/p\u003e\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-10-02T11:28:00Z",
  "modifiedTime": "2024-10-03T17:55:58Z"
}
