{
  "id": "0f074751-8a11-444d-b2e9-7129578ec277",
  "title": "Finishing Rich Despite A Low-Return Stock Market Environment",
  "link": "https://www.financialsamurai.com/low-stock-market-return-scenario/",
  "description": "Since the bottom of the global financial crisis in July 2009, the S\u0026P 500 has generally experienced a strong bull market. While there were challenging periods in 2018, 1Q 2020, and 2022, stock market investors have largely been well rewarded. However, Goldman Sachs warns that the good times might be coming to an end. Goldman […] The post Finishing Rich Despite A Low-Return Stock Market Environment appeared first on Financial Samurai.",
  "author": "Financial Samurai",
  "published": "Wed, 23 Oct 2024 11:50:00 +0000",
  "source": "https://www.financialsamurai.com/feed/",
  "categories": [
    "Retirement"
  ],
  "byline": "Financial Samurai",
  "length": 16096,
  "excerpt": "Goldman Sachs and Vanguard are forecasting abysmal stock market returns over the next 10 years. Here's how to invest and act to get rich.",
  "siteName": "Financial Samurai",
  "favicon": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2017/02/cropped-FinancialSamurai-Site-Icon-700x700-180x180.png",
  "text": "Since the bottom of the global financial crisis in July 2009, the S\u0026P 500 has generally experienced a strong bull market. While there were challenging periods in 2018, 1Q 2020, and 2022, stock market investors have largely been well rewarded. However, Goldman Sachs warns that the good times might be coming to an end. Goldman projects the S\u0026P 500 to return just 3% annually over the next decade—a significant drop from the 13% average annual returns of the past 10 years and the historical 11% since 1930. Their analysis suggests a 72% probability that U.S. Treasuries will outperform the S\u0026P, with a 33% chance the index may even trail inflation through 2034. As the author of Buy This, Not That, a bestseller that encourages readers to think in terms of probabilities, I found Goldman's perspective intriguing. My key assumption is simple: if you believe there's at least a 70% chance you're making the right decision, you should go ahead with it. This probabilistic approach applies to investing, major life choices, and financial planning, helping to minimize risk while maximizing opportunity. The people at Goldman Sachs aren't stupid. If they think there's a 72% probability of the S\u0026P 500 returning just 3% annually over the next decade, we should probably pay attention. Why Such An Abysmal Stock Return Forecast? Goldman Sachs believes the S\u0026P 500 is too heavily concentrated in major tech companies like Apple, Microsoft, Nvidia, and Meta. Historically, when there’s such a high concentration, mean reversion tends to occur, causing performance to suffer. The S\u0026P 500 is currently trading at around 22 times forward earnings, much higher than the long-term average of around 17 times. If the market reverts to this trend, future returns are likely to be lower. Goldman isn’t alone in forecasting weak stock returns. Vanguard shares a similar outlook, predicting just 3% to 5% annual returns for U.S. large-cap stocks over the next decade. They also suggest that better opportunities might exist in value stocks, small caps, REITs, and international markets. On the other hand, J.P. Morgan projects U.S. stocks will return around 7.8% annually over the next 20 years, with bonds yielding about 5%. This would represent a 2.2% decline from the S\u0026P 500's historical 10% compound annual return since 1926. Vanguard equity forecasts How To Operate In A Low Stock Return Environment And Still Get Rich Nobody can predict future stock market returns with certainty. Vanguard issued similar low-return forecasts at the onset of the pandemic, and they have been proven wrong for over four years. However, as a Financial Samurai who values probabilities over absolutes, let’s consider the scenario where Goldman Sachs is correct. If the S\u0026P 500 only returns 3% annually over the next decade, what strategies can we implement to outperform? 1) Diversify away from the S\u0026P 500 into real estate and bonds If the S\u0026P 500 is projected to return just 3% annually over the next decade, diversifying into underperforming assets like bonds and real estate could offer better opportunities. Both asset classes have faced headwinds as the Federal Reserve raised interest rates 11 times since 2022. With bond yields increasing again, these asset classes offer potential value. Furthermore, the significant wealth generated in the stock market since 2009 may prompt a rotation of capital into bonds and real estate as investors seek more stable returns. If you already own real estate, consider remodeling your rental property to boost rental income. I undertook an extensive remodeling project from 2020-2022 that generates a 12% annual return. Additionally, explore expanding the property's livable square footage. If you can remodel at a cost per square foot lower than the selling price per square foot, you stand to earn a strong return. If you feel with greater than 70% certainty a 3% average annual stock market return will happen, you could invest your entire portfolio in Treasury bonds. The 10-year is yielding 4.2% and the 30-year is yielding 4.49%. These choices provide a guaranteed income stream, enabling you to withdraw at a rate higher than 3%, while preserving your principal for future generations. Ultimately, your decision to invest in risk-free Treasury bonds will depend on your confidence in Goldman Sachs’ predictions for the stock market. It will also depend on your appetite for potentially higher returns. 2) Invest in private AI companies given big tech performance With the S\u0026P 500’s concentration in big tech—largely driven by AI-related growth—it makes sense to consider private AI companies for exposure to future innovation. AI has the potential to solve global labor shortages, drive productivity, and even contribute to breakthroughs in healthcare and other sectors. Investing in private AI firms through an open-ended venture fund can capture the upside in a sector poised for long-term impact. A reasonable allocation—up to 20% of your investable capital—may ensure you benefit from the next wave of technological advances, especially as AI continues to disrupt industries. Private companies are staying private longer, allowing more gains to accrue to private investors. Therefore, it is only logical to allocate a greater portion of your capital to private companies. 3) Invest Where You Have Favorable Odds In 2012, after retiring from my job, I invested my six-figure severance package in the Dow Jones Industrial Average (DJIA) and S\u0026P 500, despite feeling nervous about leaving the workforce. My Citigroup financial advisor introduced me to structured notes, which are derivative products offering downside protection or upside boosts. One particular note provided 100% downside protection on the DJIA but required me to accept only a 0.5% dividend, compared to the DJIA’s 1.5% dividend yield. The investment had a five-year duration, and the security of downside protection gave me the courage to invest everything at the time. Given the uncertainty in the market, I wouldn’t have invested my entire severance directly into the DJIA. But with just a 1% annual dividend trade-off for downside protection, I felt confident. Here is an example of a structured note where you can lose up to 30% of your investment and still get 100% of your principal back. You also get a minimum fixed return amount of 15% + 100% participation on the upside after 15%. Investing in an Open-Ended Venture Capital Fund Today, I find favorable odds investing in an open-ended venture capital fund, where I can see its holdings. There’s often a 8-24 month lag between when a private company fundraises and when valuations increase. By tracking news articles from reliable publications, I can spot signals when a company in the fund is about to raise capital at a much higher valuation. This provides an opportunity to invest at the previous round’s valuation, locking in a paper return once the new valuation is announced. Take OpenAI as an example. In early October 2024, OpenAI raised $6.6 billion in venture capital, valuing the company at $157 billion—an 80% increase from its February 2024 valuation. During these discussions, you could have invested in an open-ended fund that owns OpenAI to capture the upside, since funds don't revalue its assets until after an event is closed. If a venture fund had 100% of its portfolio in OpenAI, an investor would be up roughly 60% in just eight months, accounting for dilution. While no fund will have such a concentrated portfolio, you can analyze other holdings in the fund, such as Anthropic, OpenAI’s smaller competitor, and extrapolate their potential future valuations. The Information recently reported Anthropic is actually looking to raise at a valuation up to $40 billion, or 4X higher. 4) Work Harder and Longer Unfortunately, if the S\u0026P 500 is only expected to deliver a 3% to 5% return, you may need to work harder and longer to achieve financial independence. It’s wise to recalculate your net worth targets based on this lower return rate. Project what your financial standing will be in 3, 5, 10, 15, and 20 years and adjust accordingly. Alternatively, you could still aim to retire at your desired age, as it’s often better to retire early than to chase a higher net worth given time's priceless value. However, this may require adjusting your spending or finding supplemental income sources to maintain your lifestyle. From my experience since 2012, generating supplemental retirement income can be enjoyable. I’ve driven for Uber, coached high school tennis, provided private tennis lessons, consulted for tech companies, written books, and secured sponsors for Financial Samurai. When you need more income in retirement, you’ll adapt by reducing expenses and discovering new earning opportunities. 5) Lower Your Safe Withdrawal Rate In a low-return environment, lower your safe withdrawal rate if you’re retired. If Goldman Sachs and other investment forecasters are correct, this adjustment will increase your chances of not outliving your savings. Conversely, if they turn out to be wrong, you’ll simply have more to donate later. It’s counterproductive to raise your withdrawal rate while stock market return forecasts decline. A dynamic safe withdrawal rate that adjusts with market conditions is more prudent. Let's conduct a thought exercise. The historically recommended 4% withdrawal rate was introduced when the S\u0026P 500 returned ~10% on average, meaning the withdrawal rate represented 40% of that return. Therefore, under similar logic, a safe withdrawal rate of around 1.2% would be more appropriate in a 3% return scenario (40% X 3%). This may sound extreme, but so does predicting a mere 3% annual return for the next ten years. Let’s take the logic a step further. If You're Still Working and Planning to Retire For those not yet retired, consider aiming for a net worth equal to 83 times (inverse of 1.2%) your annual living expenses. For example, if you spend $60,000 a year, your target net worth should be approximately $5 million to avoid the fear of running out of money in retirement. I understand that an 83X multiple is unreasonable, and most will not reach that goal. However, this figure is only a target if you maintain your current investment strategy, don't lengthen your working years, or don't generate supplemental income after retirement. In addition, the S\u0026P 500's return average could also be higher than 3% on average, enabling you to lower your net worth target too. Limited-time promotion: For those with over $250,000 in investable assets seeking a free financial checkup, you can schedule an appointment with an Empower financial professional here. If you complete your two video calls with the advisor before October 31, 2024, you'll receive a complimentary $100 Visa gift card, with no obligation to sign up afterward. It's always great to get a second opinion from someone who helps construct investment portfolios as a living. 6) Create and invest in your business Instead of investing in the stock market with the potential for low single-digit returns, consider investing more in your own business or creating one of your own. If you can invest $100 into your business and generate more than $105 in net profits, that’s a better move if you agree with Goldman Sachs' and Vanguard's low stock market forecasts. The reality is, many private business owners can earn significantly higher returns from their capital expenditures than the stock market. Often, they just don’t realize this because they aren’t comparing the various ways they could be deploying their capital. Or, they're simply too frugal or risk averse. Personally, I could allocate more funds towards advertising, PR, hiring writers, or developing new products to grow Financial Samurai and boost revenue. However, I do not because I’ve stubbornly focused on what I love since 2009—writing. Once this site starts feeling like a job or business, my interest in running it goes down. I have peers who spend $500,000 a year on payroll, paying freelance teams to churn out SEO-optimized content to maximize earnings. That's too soul-sucking for me, but it's nice to know I have this option. A Low Stock Return Environment Will Widen The Gap Between Winners And Losers I invested through the “lost decade,” when the S\u0026P 500 stagnated from March 2000 until November 2012. However, during that time, savvy investors could have capitalized on buying near the bottom and targeting specific stocks to realize substantial gains. If we find ourselves in another prolonged period of poor stock market returns, the same principle will likely apply. There will be significant winners and dismal losers. The best stock pickers will have the opportunity to outperform the broader market. Unfortunately, the majority of active investors tend to underperform their respective index benchmarks. Therefore, you will probably have to count more on your own hard work to get ahead. For me, dialing up the intensity is exactly what I plan to do now that both our kids are in school full-time. I've got until December 31, 2027 to regain our financial independence after blowing it up to buy our current house. My Current Net Worth Structure Currently, ~41% of my net worth is in real estate. This asset class offers stability, comfort, and consistent income, along with the shelter it provides. If mortgage rates follow a downward trend, it will create a favorable environment for real estate investments. I hold about 24% of my net worth in public equities, with my allocation averaging around 30% since 2012. I’m not rushing to increase my stock investments given the potential for lower returns moving forward. I'm just nibbling with every 0.5% – 1% pullback. What excites me most right now is investing in private AI companies. My firsthand experience shows how AI has significantly boosted my productivity and impacted job markets. Since I can't get a job in AI, investing in this sector is the next best option. A forecast of a mere 3% annual return for the stock market over the next decade is disheartening. However, a repeat of a significant stock market correction, like the one we experienced in 2022, could easily sway more investors to believe in such gloomy predictions. Having invested since 1995, I've come to accept that anything is possible regarding stock market returns. As a result, keep an open mind and hope for the best, but expect the worst. What are your thoughts on Vanguard and Goldman Sachs's dismal stock market return forecasts? What percentage chance do you think a 3% average annual return over the next decade will happen? How are you positioning your investments to potentially exceed these low expected returns? Diversify Into Artificial Intelligence More gains are accruing to private company investors as these companies remain private longer. As a result, it makes sense to allocate a greater percentage of your capital to private investments. One option to consider is the Fundrise venture capital product, which invests in private growth companies in the following five sectors: Artificial Intelligence \u0026 Machine Learning Modern Data Infrastructure Development Operations (DevOps) Financial Technology (FinTech) Real Estate \u0026 Property Technology (PropTech) In 20 years, I don't want my kids wondering why I didn't invest in AI or work in AI. The investment minimum is also only $10. Most venture capital funds have a $100,000+ minimum. You can see what Fundrise is holding before deciding to invest and how much. I've invested $143,000 in Fundrise venture so far and Fundrise is a long-time sponsor of Financial Samurai. If you want to achieve financial freedom sooner, join 60,000+ readers and sign up for my free weekly newsletter. Everything I write is based off firsthand experience because money is too important to be left up to pontification.",
  "image": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/ai-generated-8458264_1280.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-271376\" itemtype=\"https://schema.org/CreativeWork\" itemscope=\"itemscope\"\u003e\n\n\t\n\t\n\u003cdiv data-ast-blocks-layout=\"true\" itemprop=\"text\"\u003e\n\n\t\t\n\t\t\n\u003cp\u003eSince the bottom of the global financial crisis in July 2009, the S\u0026amp;P 500 has generally experienced a strong bull market. While there were challenging periods in 2018, 1Q 2020, and 2022, stock market investors have largely been well rewarded. However, Goldman Sachs warns that the good times might be coming to an end.\u003c/p\u003e\n\n\n\n\u003cp\u003eGoldman projects the S\u0026amp;P 500 to return just 3% annually over the next decade—a significant drop from the 13% average annual returns of the past 10 years and the historical 11% since 1930. Their analysis suggests a 72% probability that U.S. Treasuries will outperform the S\u0026amp;P, with a 33% chance the index may even trail inflation through 2034.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs the author of \u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.amazon.com/gp/product/0593328779/ref=as_li_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=0593328779\u0026amp;linkCode=as2\u0026amp;tag=fsamurai-20\u0026amp;linkId=c7d3ba685907d647dc95238486aa7fd8\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eBuy This, Not That\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e, a bestseller that encourages readers to think in terms of probabilities, I found Goldman\u0026#39;s perspective intriguing. My key assumption is simple: if you believe there\u0026#39;s at least a 70% chance you\u0026#39;re making the right decision, you should go ahead with it. This probabilistic approach applies to investing, major life choices, and financial planning, helping to minimize risk while maximizing opportunity.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe people at Goldman Sachs aren\u0026#39;t stupid. If they think there\u0026#39;s a 72% probability of the S\u0026amp;P 500 returning just 3% annually over the next decade, we should probably pay attention. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1070\" height=\"806\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/IMG_0193.jpg\" alt=\"Goldman Sachs S\u0026amp;P 500 forecasts - Navigating An Abysmal Stock Return Environment For 10 Years\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/IMG_0193.jpg?fit=1456,9999 1070w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/IMG_0193-350x264.jpg?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/IMG_0193-664x500.jpg?fit=1456,9999 664w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/IMG_0193-768x579.jpg?fit=1456,9999 768w\" sizes=\"(max-width: 1070px) 100vw, 1070px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-why-such-an-abysmal-stock-return-forecast\"\u003eWhy Such An Abysmal Stock Return Forecast? \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.financialsamurai.com/how-to-get-job-goldman-sachs/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGoldman Sachs\u003c/a\u003e believes the S\u0026amp;P 500 is too heavily concentrated in major tech companies like Apple, Microsoft, Nvidia, and Meta. Historically, when there’s such a high concentration, mean reversion tends to occur, causing performance to suffer.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe S\u0026amp;P 500 is currently trading at around 22 times forward earnings, much higher than the long-term average of around 17 times. If the market reverts to this trend, future returns are likely to be lower.\u003c/p\u003e\n\n\n\n\u003cp\u003eGoldman isn’t alone in forecasting weak stock returns. Vanguard shares a similar outlook, predicting just 3% to 5% annual returns for U.S. large-cap stocks over the next decade. They also suggest that better opportunities might exist in value stocks, small caps, REITs, and international markets.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn the other hand, \u003ca href=\"https://am.jpmorgan.com/us/en/asset-management/institutional/insights/portfolio-insights/ltcma/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eJ.P. Morgan projects\u003c/a\u003e U.S. stocks will return around 7.8% annually over the next 20 years, with bonds yielding about 5%. This would represent a 2.2% decline from the S\u0026amp;P 500\u0026#39;s historical 10% compound annual return since 1926.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"641\" height=\"500\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/vanguard-10-year-forecast-stocks-2024-2034-641x500.png\" alt=\"Vanguard\u0026#39;s abysmal stock market forecasts\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/vanguard-10-year-forecast-stocks-2024-2034-641x500.png?fit=1456,9999 641w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/vanguard-10-year-forecast-stocks-2024-2034-350x273.png?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/vanguard-10-year-forecast-stocks-2024-2034-768x599.png?fit=1456,9999 768w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/vanguard-10-year-forecast-stocks-2024-2034.png?fit=1456,9999 1419w\" sizes=\"(max-width: 641px) 100vw, 641px\"/\u003e\u003cfigcaption\u003eVanguard equity forecasts\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-how-to-operate-in-a-low-stock-return-environment-and-still-get-rich\"\u003eHow To Operate In A Low Stock Return Environment And Still Get Rich\u003c/h2\u003e\n\n\n\n\u003cp\u003eNobody can predict future stock market returns with certainty. Vanguard issued similar low-return forecasts at the onset of the pandemic, and they have been proven wrong for over four years.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, as a Financial Samurai who values probabilities over absolutes, let’s consider the scenario where Goldman Sachs is correct. If the S\u0026amp;P 500 only returns 3% annually over the next decade, what strategies can we implement to outperform? \u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-1-diversify-away-from-the-s-amp-p-500-into-real-estate-and-bonds\"\u003e1) Diversify away from the S\u0026amp;P 500 into real estate and bonds\u003c/h3\u003e\n\n\n\n\u003cp\u003eIf the S\u0026amp;P 500 is projected to return just 3% annually over the next decade, diversifying into underperforming assets like bonds and real estate could offer better opportunities. Both asset classes have faced headwinds as the Federal Reserve raised interest rates 11 times since 2022.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith bond yields increasing again, these asset classes offer potential value. Furthermore, the significant wealth generated in the stock market since 2009 may prompt a rotation of capital into bonds and real estate as investors seek more stable returns. \u003c/p\u003e\n\n\n\n\u003cp\u003eIf you already own real estate, consider \u003ca href=\"https://www.financialsamurai.com/remodeling-your-rental-property-for-more-passive-income-and-value/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eremodeling your rental property to boost rental income\u003c/a\u003e. I undertook an extensive remodeling project from 2020-2022 that generates a 12% annual return. Additionally, explore \u003ca href=\"https://www.financialsamurai.com/how-to-make-lots-of-money-in-real-estate/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eexpanding the property\u0026#39;s livable square footage\u003c/a\u003e. If you can remodel at a cost per square foot lower than the selling price per square foot, you stand to earn a strong return.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you feel with greater than 70% certainty a 3% average annual stock market return will happen, you could invest your entire portfolio in Treasury bonds. The 10-year is yielding 4.2% and the 30-year is yielding 4.49%. These choices provide a guaranteed income stream, enabling you to withdraw at a rate higher than 3%, while preserving your principal for future generations.\u003c/p\u003e\n\n\n\n\u003cp\u003eUltimately, your decision to invest in risk-free Treasury bonds will depend on your confidence in Goldman Sachs’ predictions for the stock market. It will also depend on your appetite for potentially higher returns.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"728\" height=\"372\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/fixed-income-table-728x372.png\" alt=\"\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/fixed-income-table-728x372.png?fit=1456,9999 728w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/fixed-income-table-350x179.png?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/fixed-income-table-768x392.png?fit=1456,9999 768w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/fixed-income-table-1536x784.png?fit=1456,9999 1536w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/10/fixed-income-table.png?fit=1456,9999 1789w\" sizes=\"(max-width: 728px) 100vw, 728px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch3 id=\"h-2-invest-in-private-ai-companies-given-big-tech-performance\"\u003e2) \u003cstrong\u003eInvest in private AI companies given big tech performance\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eWith the S\u0026amp;P 500’s concentration in big tech—largely driven by AI-related growth—it makes sense to consider \u003ca href=\"https://www.financialsamurai.com/investing-in-private-ai-companies-without-connections-or-big-money/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eprivate AI companies\u003c/a\u003e for exposure to future innovation. AI has the potential to solve global labor shortages, drive productivity, and even contribute to breakthroughs in healthcare and other sectors.\u003c/p\u003e\n\n\n\n\u003cp\u003eInvesting in private AI firms through an \u003ca href=\"https://www.financialsamurai.com/innovation\" rel=\"nofollow noindex noreferrer noopener\" target=\"_blank\" aria-label=\"open-ended venture fund (opens in a new tab)\"\u003eopen-ended venture fund\u003c/a\u003e can capture the upside in a sector poised for long-term impact. A reasonable allocation—up to 20% of your investable capital—may ensure you benefit from the next wave of technological advances, especially as AI continues to disrupt industries.\u003c/p\u003e\n\n\n\n\u003cp\u003ePrivate companies are staying private longer, allowing more gains to accrue to private investors. Therefore, it is only logical to allocate a greater portion of your capital to private companies.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-3-invest-where-you-have-favorable-odds\"\u003e3) Invest Where You Have Favorable Odds\u003c/h3\u003e\n\n\n\n\u003cp\u003eIn 2012, after retiring from my job, I invested my \u003ca href=\"https://www.financialsamurai.com/how-to-make-money-quitting-your-job-2/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esix-figure severance package\u003c/a\u003e in the Dow Jones Industrial Average (DJIA) and S\u0026amp;P 500, despite feeling nervous about leaving the workforce.\u003c/p\u003e\n\n\n\n\u003cp\u003eMy Citigroup financial advisor introduced me to \u003ca href=\"https://www.financialsamurai.com/understanding-structured-derivative-products-cdsnote-as-an-investment/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003estructured notes\u003c/a\u003e, which are derivative products offering downside protection or upside boosts. One particular note provided \u003cem\u003e100% downside protection\u003c/em\u003e on the DJIA but required me to accept only a 0.5% dividend, compared to the DJIA’s 1.5% dividend yield.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe investment had a five-year duration, and the security of downside protection gave me the courage to invest everything at the time. Given the uncertainty in the market, I wouldn’t have invested my entire severance directly into the DJIA. But with just a 1% annual dividend trade-off for downside protection, I felt confident.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere is an example of a structured note where you can lose up to 30% of your investment and still get 100% of your principal back. You also get a minimum fixed return amount of 15% + 100% participation on the upside after 15%. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"728\" height=\"438\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/06/structured-note-2-FS.png\" alt=\"Structured Note example\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/06/structured-note-2-FS.png?fit=1456,9999 728w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2018/06/structured-note-2-FS-350x211.png?fit=1456,9999 350w\" sizes=\"(max-width: 728px) 100vw, 728px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch3 id=\"h-investing-in-an-open-ended-venture-capital-fund\"\u003eInvesting in an Open-Ended Venture Capital Fund\u003c/h3\u003e\n\n\n\n\u003cp\u003eToday, I find favorable odds investing in an open-ended \u003ca href=\"https://www.financialsamurai.com/venture-capital-funds-beats-investing-in-individual-companies/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eventure capital fund\u003c/a\u003e, where I can see its holdings. There’s often a 8-24 month lag between when a private company fundraises and when valuations increase. \u003c/p\u003e\n\n\n\n\u003cp\u003eBy tracking news articles from reliable publications, I can spot signals when a company in the fund is about to raise capital at a much higher valuation. This provides an opportunity to invest at the previous round’s valuation, locking in a paper return once the new valuation is announced.\u003c/p\u003e\n\n\n\n\u003cp\u003eTake OpenAI as an example. In early October 2024, OpenAI raised $6.6 billion in venture capital, valuing the company at $157 billion—an 80% increase from its February 2024 valuation. During these discussions, you could have invested in an open-ended fund that owns OpenAI to capture the upside, since funds don\u0026#39;t revalue its assets until \u003cem\u003eafter\u003c/em\u003e an event is closed.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf a venture fund had 100% of its portfolio in OpenAI, an investor would be up roughly 60% in just eight months, accounting for dilution. While no fund will have such a concentrated portfolio, you can analyze other holdings in the fund, such as Anthropic, OpenAI’s smaller competitor, and extrapolate their potential future valuations. \u003cem\u003eThe Information\u003c/em\u003e recently reported Anthropic is actually looking to raise at a valuation up to $40 billion, or 4X higher. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-4-work-harder-and-longer\"\u003e4) Work Harder and Longer\u003c/h3\u003e\n\n\n\n\u003cp\u003eUnfortunately, if the S\u0026amp;P 500 is only expected to deliver a 3% to 5% return, you may need to work harder and longer to achieve financial independence. It’s wise to recalculate your \u003ca href=\"https://www.financialsamurai.com/net-worth-targets-by-age-income-work-experience/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003enet worth targets\u003c/a\u003e based on this lower return rate. Project what your financial standing will be in 3, 5, 10, 15, and 20 years and adjust accordingly. \u003c/p\u003e\n\n\n\n\u003cp\u003eAlternatively, you could still aim to retire at your desired age, as it’s often \u003ca href=\"https://www.financialsamurai.com/why-retiring-early-is-better-than-retiring-rich/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebetter to retire early\u003c/a\u003e than to chase a higher net worth given time\u0026#39;s priceless value. However, this may require adjusting your spending or finding supplemental income sources to maintain your lifestyle.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom my experience since 2012, generating supplemental retirement income can be enjoyable. I’ve \u003ca href=\"https://www.financialsamurai.com/whats-it-like-driving-for-uber-mixed-emotions-of-hope-and-sadness/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edriven for Uber\u003c/a\u003e, coached high school tennis, provided private tennis lessons, \u003ca href=\"https://www.financialsamurai.com/went-back-to-work-and-could-only-last-four-months/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003econsulted for tech companies\u003c/a\u003e, written books, and secured sponsors for Financial Samurai.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen you need more income in retirement, you’ll adapt by reducing expenses and discovering new earning opportunities.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-5-lower-your-safe-withdrawal-rate\"\u003e5) \u003cstrong\u003eLower Your Safe Withdrawal Rate\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eIn a low-return environment, lower your safe withdrawal rate if you’re retired. If Goldman Sachs and other investment forecasters are correct, this adjustment will increase your chances of not outliving your savings. Conversely, if they turn out to be wrong, you’ll simply have more to donate later.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s counterproductive to raise your withdrawal rate while stock market return forecasts decline. A \u003ca href=\"https://www.financialsamurai.com/proper-safe-withdrawal-rate/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edynamic safe withdrawal rate\u003c/a\u003e that adjusts with market conditions is more prudent.\u003c/p\u003e\n\n\n\n\u003cp\u003eLet\u0026#39;s conduct a thought exercise. The historically recommended 4% withdrawal rate was introduced when the S\u0026amp;P 500 returned ~10% on average, meaning the withdrawal rate represented 40% of that return. Therefore, under similar logic, a safe withdrawal rate of around 1.2% would be more appropriate in a 3% return scenario (40% X 3%). \u003c/p\u003e\n\n\n\n\u003cp\u003eThis may sound extreme, but so does predicting a mere 3% annual return for the next ten years. Let’s take the logic a step further.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-if-you-re-still-working-and-planning-to-retire\"\u003eIf You\u0026#39;re Still Working and Planning to Retire\u003c/h3\u003e\n\n\n\n\u003cp\u003eFor those not yet retired, consider aiming for a net worth equal to 83 times (inverse of 1.2%) your annual living expenses. For example, if you spend $60,000 a year, your target net worth should be approximately $5 million to avoid the fear of running out of money in retirement.\u003c/p\u003e\n\n\n\n\u003cp\u003eI understand that an 83X multiple is unreasonable, and most will not reach that goal. However, this figure is \u003cem\u003eonly\u003c/em\u003e a target if you maintain your current investment strategy, don\u0026#39;t lengthen your working years, or don\u0026#39;t generate supplemental income after retirement. In addition, the S\u0026amp;P 500\u0026#39;s return average could also be higher than 3% on average, enabling you to lower your net worth target too.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eLimited-time promotion:\u003c/em\u003e\u003c/strong\u003e \u003cem\u003eFor those with over $250,000 in investable assets seeking a free financial checkup, you can schedule an appointment with an \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/advisor\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eEmpower financial professional here\u003c/a\u003e\u003c/strong\u003e. If you complete your two video calls with the advisor before October 31, 2024, you\u0026#39;ll receive a complimentary $100 Visa gift card, with no obligation to sign up afterward.\u003c/em\u003e \u003cem\u003eIt\u0026#39;s always great to get a second opinion from someone who helps construct investment portfolios as a living. \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-6-create-and-invest-in-your-business\"\u003e6) Create and invest in your business\u003c/h3\u003e\n\n\n\n\u003cp\u003eInstead of investing in the stock market with the potential for low single-digit returns, consider investing more in your own business or creating one of your own. If you can invest $100 into your business and generate more than $105 in net profits, that’s a better move if you agree with Goldman Sachs\u0026#39; and Vanguard\u0026#39;s low stock market forecasts.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe reality is, many private business owners can earn significantly higher returns from their capital expenditures than the stock market. Often, they just don’t realize this because they aren’t comparing the various ways they could be deploying their capital. Or, they\u0026#39;re simply too frugal or risk averse. \u003c/p\u003e\n\n\n\n\u003cp\u003ePersonally, I could allocate more funds towards advertising, PR, hiring writers, or developing new products to grow \u003cem\u003eFinancial Samurai\u003c/em\u003e and boost revenue. However, I do not because I’ve stubbornly focused on what I love since 2009—writing. Once this site starts feeling like a job or business, my interest in running it goes down.\u003c/p\u003e\n\n\n\n\u003cp\u003eI have peers who spend $500,000 a year on payroll, paying freelance teams to churn out SEO-optimized content to maximize earnings. That\u0026#39;s too soul-sucking for me, but it\u0026#39;s nice to know I have this option.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-a-low-stock-return-environment-will-widen-the-gap-between-winners-and-losers\"\u003eA Low Stock Return Environment Will Widen The Gap Between Winners And Losers\u003c/h2\u003e\n\n\n\n\u003cp\u003eI invested through the “lost decade,” when the S\u0026amp;P 500 stagnated from March 2000 until November 2012. However, during that time, savvy investors could have capitalized on buying near the bottom and targeting specific stocks to realize substantial gains.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf we find ourselves in another prolonged period of poor stock market returns, the same principle will likely apply. There will be significant winners and dismal losers. The best stock pickers will have the opportunity to outperform the broader market. Unfortunately, the \u003ca href=\"https://www.financialsamurai.com/active-versus-passive-investing-performance-equities-fixed-income/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emajority of active investors tend to underperform\u003c/a\u003e their respective index benchmarks.\u003c/p\u003e\n\n\n\n\u003cp\u003eTherefore, you will probably have to count more on your own hard work to get ahead. For me, dialing up the intensity is exactly what I plan to do now that both our kids are in school full-time. I\u0026#39;ve got until December 31, 2027 to regain our financial independence after \u003ca href=\"https://www.financialsamurai.com/no-longer-financially-independent-blew-up-my-passive-income/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eblowing it up\u003c/a\u003e to buy our current house.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-my-current-net-worth-structure\"\u003eMy Current Net Worth Structure \u003c/h2\u003e\n\n\n\n\u003cp\u003eCurrently, ~41% of my net worth is in real estate. This asset class offers stability, comfort, and consistent income, along with the shelter it provides. If mortgage rates follow a downward trend, it will create a favorable environment for real estate investments.\u003c/p\u003e\n\n\n\n\u003cp\u003eI hold about 24% of my net worth in public equities, with my allocation averaging around 30% since 2012. I’m not rushing to increase my stock investments given the potential for lower returns moving forward. I\u0026#39;m just nibbling with every 0.5% – 1% pullback.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat excites me most right now is investing in private AI companies. My firsthand experience shows how AI has significantly boosted my productivity and \u003ca href=\"https://www.financialsamurai.com/artificial-intelligence-put-my-dad-out-of-a-job/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eimpacted job markets\u003c/a\u003e. Since I can\u0026#39;t get a job in AI, investing in this sector is the next best option.\u003c/p\u003e\n\n\n\n\u003cp\u003eA forecast of a mere 3% annual return for the stock market over the next decade is disheartening. However, a repeat of a significant stock market correction, like the one we experienced in 2022, could easily sway more investors to believe in such gloomy predictions. \u003c/p\u003e\n\n\n\n\u003cp\u003eHaving invested since 1995, I\u0026#39;ve come to accept that anything is possible regarding stock market returns. As a result, keep an open mind and hope for the best, but expect the worst.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhat are your thoughts on Vanguard and Goldman Sachs\u0026#39;s dismal stock market return forecasts? What percentage chance do you think a 3% average annual return over the next decade will happen? How are you positioning your investments to potentially exceed these low expected returns?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2 id=\"m_-3419412582211526320m_-5392598252816716637gmail-h-investing-in-artificial-intelligence-for-my-kids\"\u003eDiversify Into Artificial Intelligence \u003c/h2\u003e\n\n\n\n\u003cp\u003eMore gains are accruing to private company investors as these companies remain private longer. As a result, it makes sense to allocate a greater percentage of your capital to private investments. One option to consider is the \u003cstrong\u003e\u003ca aria-label=\"Fundrise venture capital product (opens in a new tab)\" href=\"https://www.financialsamurai.com/innovation\" target=\"_blank\" rel=\"nofollow noindex noreferrer noopener\"\u003eFundrise venture capital product\u003c/a\u003e\u003c/strong\u003e, which invests in private growth companies in the following five sectors:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eArtificial Intelligence \u0026amp; Machine Learning\u003c/li\u003e\n\n\n\n\u003cli\u003eModern Data Infrastructure\u003c/li\u003e\n\n\n\n\u003cli\u003eDevelopment Operations (DevOps)\u003c/li\u003e\n\n\n\n\u003cli\u003eFinancial Technology (FinTech)\u003c/li\u003e\n\n\n\n\u003cli\u003eReal Estate \u0026amp; Property Technology (PropTech)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eIn 20 years, I don\u0026#39;t want my kids wondering why I didn\u0026#39;t invest in AI or work in AI. The investment minimum is also only $10. Most venture capital funds have a $100,000+ minimum. You can see what Fundrise is holding before deciding to invest and how much.\u003c/p\u003e\n\n\n\n\u003cp\u003eI\u0026#39;ve invested $143,000 in Fundrise venture so far and Fundrise is a long-time sponsor of Financial Samurai. \u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to achieve financial freedom sooner, join 60,000+ readers and sign up for my \u003ca aria-label=\"free weekly newsletter (opens in a new tab)\" href=\"https://www.financialsamurai.com/news\" target=\"_blank\" rel=\"nofollow noindex noreferrer noopener\"\u003efree weekly newsletter\u003c/a\u003e. Everything I write is based off firsthand experience because money is too important to be left up to pontification. \u003c/p\u003e\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2024-10-23T11:50:00Z",
  "modifiedTime": "2024-10-23T16:38:27Z"
}
