{
  "id": "2121ff08-bf69-44f6-ae82-cfd11d6e106c",
  "title": "Charging an EV with Solar Panels",
  "link": "https://www.nerdwallet.com/article/mortgages/charging-ev-solar",
  "description": "You can charge an electric vehicle (EV) with solar panels. A full charge often costs less than filling the tank with gas but requires seven to 12 solar panels.",
  "author": "Rosana Francescato",
  "published": "Sat, 16 Nov 2024 00:03:20 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Homeownership",
    "Mortgages"
  ],
  "byline": "Rosana Francescato",
  "length": 6640,
  "excerpt": "You can charge an electric vehicle (EV) with solar panels. A full charge often costs less than filling the tank with gas but requires seven to 12 solar panels.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "You can charge an electric vehicle (EV) with solar panels if you have a Level 1 or Level 2 charger in your home. It often costs less than filling the tank with gas. However, you have to acquire and install the solar panels on your home's roof first. How can I charge my EV from my solar panels?There are two ways to charge your EV with solar panels.Use a Level 1 charger with a regular electrical outlet. A Level 1 charger is a cable that usually comes with your EV and plugs into an electrical outlet. Charging this way can take 40–50+ hours to go from empty to 80%, so the hours when your roof’s solar panels are producing energy will not be enough to fully charge your car; you’ll need to use electricity from the grid as well. Use a Level 2 charger. You can have a Level 2 EV charger installed to power your car more quickly. These chargers can be programmed to charge your car at times when electricity is cheaper and/or when your solar panels are producing the most (you may also be able to schedule this directly from your car). Plus, they can charge your car from empty to 80% in four to 10 hours. So with a Level 2 charger, you can probably charge your car exclusively with solar.If you pair your solar panels with a solar battery, you solar power for use at a later time. That will extend the times when you can charge your EV with solar energy. How much does it cost to charge an EV at home with solar panels?Charging your EV directly from your solar panels may cost less than charging it with electricity from the power grid. That’s because solar may lower your electric bills, reducing the price you pay per kilowatt-hour (kWh).How much it costs to charge an EV with solar varies depending on these factors:Your charger type. The more efficient your EV charger is, the less energy you lose when charging your car and the more you may save. It usually costs less to charge your car with a more-efficient Level 2 charger than with a less-efficient Level 1 charger, and you’re more likely to be able to charge your EV exclusively with solar power. But a Level 2 charger comes with some upfront costs.The cost of your solar panels. If you own your system and have already recouped the cost of your solar panels from savings on your electricity bills, charging your EV with your solar panels could cost almost nothing. If you lease your panels or are paying back a solar loan for them, your lease or loan payments will affect how much it costs to charge your EV.Your EV battery. If your car’s battery has a higher capacity, which means a longer mileage range, it will probably cost more to fully charge your EV. But the cost per kWh probably won’t be higher.Where you live. Your savings will be maximized if you live in an area with plenty of sunshine and favorable solar policies. When you charge your EV. Costs will depend on your local electricity rates and plan structures, as well as whether your solar panels are producing energy at the time you’re charging your EV.How much you drive. Driving a lot will increase your annual costs — but your savings (compared to filling up a gas tank or even charging an EV without solar) will be higher.How to calculate the cost of charging an EV with solar powerBecause so many variables are involved, it’s challenging to determine what it will cost to charge your EV with solar. But you can get an estimate using this formula:Cost per 100 miles = Your EV’s kWh use per 100 miles * Cost per kWh for solar powerYour EV’s kWh use: The Department of Energy website lists the energy use in kWh per 100 miles for specific EV models. Your electricity cost with solar: This is where the calculation gets tricky. If you know your levelized cost of energy (LCOE), you can use that. LCOE is simply your system’s lifetime costs divided by its energy production. If you don’t know your LCOE, you can use what you’re currently paying for electricity per kWh — which might be close to zero if you’ve paid off your solar.Example: A 2023 Chevy Bolt consumes 28 kWh per 100 miles. If your cost of energy without solar is $0.17 per kWh (the average U.S. electricity price in August 2024 according to the U.S. Energy Information Administration), you pay $4.76 for every 100 miles of range. If your cost of energy with solar goes down to $0.10 per kWh, you’ll pay $2.80 to add 100 miles of range. This might be significantly cheaper than buying the gasoline required to drive 100 miles.How many solar panels do I need to charge an EV?Charging an EV typically requires seven to 12 solar panels, according to EnergySage, a solar and home energy product comparison marketplace. So it’s important to consider a potential EV when sizing your solar system.The exact number of panels you’ll need for your EV depends on your EV battery, the amount of sunshine where you live, whether you’ll do all your charging at home and how much you drive.How to calculate the number of solar panels you needUse this formula to determine how many solar panels you need.Number of solar panels = (Annual home electricity use + Your EV’s annual electricity use) ÷ Solar panel production ratio ÷ Solar panel output According to the Department of Energy, today’s EVs consume about 25-40 kWh per 100 miles. So if you drive 13,476 miles annually, the average in the U.S. according to the Federal Highway Administration, your EV will need about 3,369–5,390 kWh annually. Are solar panels worth it with an EV?Solar and EVs often pair well. When deciding whether this combination makes sense for you, consider these pros and cons. Pros of charging EVs with solar panelsSavings. You can maximize your fuel savings by charging your EV with solar.Emissions reductions. EVs produce fewer emissions than gas cars even when powered by electricity from the grid; you’ll lower your emissions further by powering your EV with solar.Potential increased reliability. If you pair your panels with a solar battery, you’ll still be able to charge your car during blackouts.Grid balancing. By charging your EV with your solar, you’ll help avoid strain on the power grid as demand for electricity increases.Cons of charging EVs with solar panelsUpfront costs. You’ll need more solar panels to charge your EV and meet your home’s electricity needs, adding to the cost of your system. Although you may save over time, you’ll need to factor in this initial extra cost. Slower charging. Because the sun isn’t always shining, charging your car may take longer if you rely exclusively on your solar panels — especially if you use Level 1 chargers.Solar intermittency. On cloudy days, you probably won’t be able to charge your car fully using only solar energy.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2024/11/GettyImages-1524463208-1-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eYou can charge an electric vehicle (EV) with solar panels if you have a Level 1 or Level 2 charger in your home. It often costs less than filling the tank with gas. However, you have to acquire and install the solar panels on your home\u0026#39;s roof first. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"how-can-i-charge-my-ev-from-my-solar-panels\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow can I charge my EV from my solar panels?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThere are two ways to charge your EV with solar panels.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003col data-currency=\"List\"\u003e\u003cli\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eUse a Level 1 charger with a regular electrical outlet\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. A Level 1 charger is a cable that usually comes with your EV and plugs into an electrical outlet. Charging this way can take 40–50+ hours to go from empty to 80%, so the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/do-solar-panels-work-at-night\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ehours when your roof’s solar panels are producing energy\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e will not be enough to fully charge your car; you’ll need to use electricity from the grid as well\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eUse a Level 2 charger\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. You can have a Level 2 EV charger installed to power your car more quickly. These chargers can be programmed to charge your car at times when electricity is cheaper and/or when your solar panels are producing the most (you may also be able to schedule this directly from your car). Plus, they can charge your car from empty to 80% in four to 10 hours. So with a Level 2 charger, you can probably charge your car exclusively with solar.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eIf you pair your solar panels with a \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/solar-batteries-pros-cons-how-to-choose\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003esolar battery\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, you solar power for use at a later time. That will extend the times when you can charge your EV with solar energy.   \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"how-much-does-it-cost-to-charge-an-ev-at-home-with-solar-panels\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow much does it cost to charge an EV at home with solar panels?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eCharging your EV directly from your solar panels may cost less than charging it with electricity from the power grid. That’s because \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/solar-panels-electric-bill\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003esolar may lower your electric bills\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, reducing the price you pay per kilowatt-hour (kWh).\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHow much it costs to charge an EV with solar varies depending on these factors:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eYour charger type\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. The more efficient your EV charger is, the less energy you lose when charging your car and the more you may save. It usually costs less to charge your car with a more-efficient Level 2 charger than with a less-efficient Level 1 charger, and you’re more likely to be able to charge your EV exclusively with solar power\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. But a Level 2 charger comes with some upfront costs.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eThe cost of your solar panels\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. If you own your system and have already recouped the cost of your solar panels from savings on your electricity bills, charging your EV with your solar panels could cost almost nothing. If you \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/solar-leasing\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003elease your panels\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e or are paying back a \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/best/loans/personal-loans/solar-loans-solar-panel-system-financing-options\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003esolar loan\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e for them, your lease or loan payments will affect how much it costs to charge your EV.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eYour EV battery\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. If your car’s battery has a higher capacity, which means a longer mileage range, it will probably cost more to fully charge your EV. But the cost per kWh probably won’t be higher.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eWhere you live\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. Your savings will be maximized if you live in an area with plenty of sunshine and favorable solar policies. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eWhen you charge your EV\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. Costs will depend on your local \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/solar-panels-electric-bill\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eelectricity rates and plan structures\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, as well as whether your solar panels are producing energy at the time you’re charging your EV.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eHow much you drive\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. Driving a lot will increase your annual costs — but your savings (compared to filling up a gas tank or even charging an EV without solar) will be higher.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"how-to-calculate-the-cost-of-charging-an-ev-with-solar-power\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow to calculate the cost of charging an EV with solar power\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eBecause so many variables are involved, it’s challenging to determine what it will cost to charge your EV with solar. But you can get an estimate using this formula:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eCost per 100 miles = Your EV’s kWh use per 100 miles * Cost per kWh for solar power\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eYour EV’s kWh use\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e: The \u003c/span\u003e\u003ca href=\"https://www.fueleconomy.gov/feg/PowerSearch.do?action=noform\u0026amp;year1=2023\u0026amp;year2=2024\u0026amp;minmsrpsel=0\u0026amp;maxmsrpsel=0\u0026amp;city=0\u0026amp;hwy=0\u0026amp;comb=0\u0026amp;cbftelectricity=Electricity\u0026amp;YearSel=2023-2024\u0026amp;make=\u0026amp;mclass=\u0026amp;vfuel=Electricity\u0026amp;vtype=\u0026amp;trany=\u0026amp;drive=\u0026amp;cyl=\u0026amp;MpgSel=000\u0026amp;sortBy=Comb\u0026amp;Units=\u0026amp;url=SearchServlet\u0026amp;opt=new\u0026amp;minmsrp=0\u0026amp;maxmsrp=0\u0026amp;minmpg=0\u0026amp;maxmpg=0\u0026amp;sCharge=\u0026amp;tCharge=\u0026amp;startstop=\u0026amp;cylDeact=\u0026amp;rowLimit=100\u0026amp;tabView=0\u0026amp;pageno=1\" data-currency=\"Link\" rel=\"nofollow noopener noreferrer\" target=\"_self\"\u003e\u003cspan\u003eDepartment of Energy website\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e lists the energy use in kWh per 100 miles for specific EV models. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eYour electricity cost with solar\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e: This is where the calculation gets tricky. If you know your levelized cost of energy (LCOE), you can use that. LCOE is simply your system’s lifetime costs divided by its energy production. If you don’t know your LCOE, you can use what you’re currently paying for electricity per kWh — which might be close to zero if you’ve paid off your solar\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eExample\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e: A 2023 Chevy Bolt consumes 28 kWh per 100 miles. If your cost of energy without solar is $0.17 per kWh (the average U.S. electricity price in August 2024 according to the U.S. Energy Information Administration), you pay $4.76 for every 100 miles of range. If your cost of energy with solar goes down to $0.10 per kWh, you’ll pay $2.80 to add 100 miles of range. This might be significantly cheaper than buying the gasoline required to drive 100 miles.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"how-many-solar-panels-do-i-need-to-charge-an-ev\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow many solar panels do I need to charge an EV?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eCharging an EV typically requires seven to 12 solar panels, according to EnergySage, a solar and home energy product comparison marketplace\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. So it’s important to consider a potential EV when sizing your solar system.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThe exact number of panels you’ll need for your EV depends on your EV battery, the amount of sunshine where you live, whether you’ll do all your charging at home and how much you drive.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"how-to-calculate-the-number-of-solar-panels-you-need\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow to calculate the number of solar panels you need\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eUse this formula to determine how many solar panels you need.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eNumber of solar panels = (Annual home electricity use + Your EV’s annual electricity use) ÷ Solar panel production ratio ÷ Solar panel output \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAccording to the Department of Energy, today’s EVs consume about 25-40 kWh per 100 miles\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. So if you drive 13,476 miles annually, the average in the U.S. according to the Federal Highway Administration, your EV will need about 3,369–5,390 kWh annually\u003c/span\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"are-solar-panels-worth-it-with-an-ev\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eAre solar panels worth it with an EV?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eSolar and EVs often pair well. When deciding whether this combination makes sense for you, consider these pros and cons. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003ePros of charging EVs with solar panels\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eSavings\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. You can maximize your fuel savings by charging your EV with solar.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eEmissions reductions\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. EVs produce fewer emissions than gas cars even when powered by electricity from the grid; you’ll lower your emissions further by powering your EV with solar.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003ePotential increased reliability\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. If you pair your panels with a solar battery, you’ll still be able to charge your car during blackouts.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eGrid balancing\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. By charging your EV with your solar, you’ll help avoid strain on the power grid as demand for electricity increases.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eCons of charging EVs with solar panels\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eUpfront costs\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. You’ll need more solar panels to charge your EV and meet your home’s electricity needs, adding to the cost of your system. Although you may save over time, you’ll need to factor in this initial extra cost. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eSlower charging\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. Because the sun isn’t always shining, charging your car may take longer if you rely exclusively on your solar panels — especially if you use Level 1 chargers.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eSolar intermittency\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. On cloudy days, you probably won’t be able to charge your car fully using only solar energy.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-16T00:03:20Z",
  "modifiedTime": null
}
