{
  "id": "27a3a40e-f3ff-4141-920c-b5efe8a51139",
  "title": "Weekend Reading For Financial Planners (November 30–December 1)",
  "link": "https://feeds.feedblitz.com/~/908621774/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-November-%e2%80%93December/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent study from Cerulli Associates shows that consumer trust in financial services companies has increased significantly over the past decade, with firms that provide a more personalized approach to providing financial advice seeing the bestRead More... The post Weekend Reading For Financial Planners (November 30–December 1) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 29 Nov 2024 19:00:22 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 32249,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent study from Cerulli Associates shows that consumer trust in financial services companies has increased significantly over the past decade, with firms that provide a more personalized approach to providing financial advice seeing the best",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent study from Cerulli Associates shows that consumer trust in financial services companies has increased significantly over the past decade, with firms that provide a more personalized approach to providing financial advice seeing the best results. Which could prove to be a boon for the financial advice industry as more consumers are willing to entrust their assets to an advisor (while at the same time possibly making it tougher for some advisors to differentiate themselves primarily by how they put their clients' interests first?). Also in industry news this week: While many financial advisors are paying close attention to the potential extension of sunsetting measures within the Tax Cuts and Jobs Act (TCJA) in the coming year, legislation related to retirement savings could be on Congress' agenda as well Fidelity is planning to change the default for its existing RIA non-retirement clients' cash balances from money market funds to its (lower-interest-rate-paying) in-house cash management product in the latest signal that even when firms don't pay platform fees themselves, RIA custodial services aren't truly 'free' From there, we have several articles on estate planning: A recent survey indicates that a significant number of families experience inheritance-related strain, which can be mitigated by opening up lines of communication between parents and their children How encouraging clients to think of their qualitative legacy goals (and not just the dollars and cents of what they what to leave to heirs) can help them overcome psychological barriers to starting meaningful inheritance conversations with their children 5 ways that clients can simplify their estate to ensure that their goals are met and that they don't create additional stress for their survivors We also have a number of articles on retirement planning: Why alignment between one's sense of self and the lifestyle structure they operate in is a driving factor in whether an individual will thrive in retirement Why creating structure around how one will spend their time in retirement (whether through work, hobbies, and/or social activities) can ultimately lead to greater retirement satisfaction The different ways clients can implement a 'phased retirement' beyond working fewer hours, from creating a \"stop doing list\" to establishing greater workplace flexibility We wrap up with 3 final articles, all about planning for the holiday season: Ideas for hosting a virtual holiday party for staff or clients, from chocolate-tasting classes to hosted virtual trivia events How financial advisors can ensure their client holiday cards and gifts stand out from the pack Tips for holiday-themed advisory firm social media content, including the value of video to help prospects and clients get to know firm staff better on a personal level Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. Trust In Advisors Rose Steeply In Past Decade: Cerulli (Michael Fischer | ThinkAdvisor) For consumers, handing their hard-earned assets to be managed by a financial advisor typically requires a significant level of trust. And while firms and individual advisors can carefully craft their reputations and offer advice that is in their clients' best interest, an individual's willingness to seek financial advice in the first place can also be influenced by the reputation of the industry as a whole. Which suggests that looking at industry-wide trust figures can provide a broad signal on consumers' receptiveness to seeking out financial advice. According to research from Cerulli Associates, the percentage of affluent investors who believe that financial services firms are looking out for their best interests has risen significantly during the past decade, from 39% in 2014 to 60% this year. Notably, this level of trust is consistent across age demographics, with 56% to 60% of those in age cohorts below 70 indicating so and 65% of those older than age 70 agreeing (perhaps because they have had the opportunity for longer relationships with advisors). Client trust was highest in channels where clients experience direct advisor relationships, including private banks (75%) and full-service advisory firms (65%), with less-personalized channels (e.g., retirement plan providers) lagging behind. Among the approximately 40% of affluent investors who indicated a lack of trust in financial firms, 24% said they were unsure of the quality of the financial products their advisor might recommend (compared to only 11% for those who trust their financial firms), suggesting that building trust in the advisor-client relationship first before discussing specific investments could lead to a more trusting relationship (and perhaps greater likelihood that the client will stick with the advisor, and their portfolio recommendations). Altogether, this study suggests that the financial advice industry has been successful in improving its level of trust with consumers (perhaps in line with more financial advice professionals truly putting their clients' interests first?). Which could prove to be a boon to the industry if it leads more consumers to seek out advice relationships (while at the same time possibly making it tougher for some firms to market themselves primarily by how they put their clients' interests first, suggesting advisors might look to other potential differentiators?). On The Horizon For 2025: TCJA Extension...And SECURE Act 3.0? (Melanie Waddell | ThinkAdvisor) During the past year, there has been significant speculation about what the results of the 2024 election would mean for expiring provisions of the 2017 Tax Cuts and Jobs Act (TCJA), including potential changes in marginal tax rates, the future of State And Local Tax (SALT) deductions, and other measures. Now, with the election in the rearview mirror and a second Trump administration on the horizon (along with Republican majorities in the U.S. House of Representatives and Senate), observers have a better idea of what to expect when it comes to tax- and retirement-related legislation that could impact financial advisors and their clients. The top piece of financial-related legislation to be debated in 2025 is almost certain to be tax measures baked into a broader budget bill, which could pass without support from Democrats through the reconciliation process (which limits amendments and eliminates the filibuster, allowing the Senate to pass the legislation with a majority vote). While many expiring measures from the TCJA are likely to feature in this legislation (given that the original law was passed during the first Trump administration), there still could be plenty of debate concerning the exact makeup of specific measures (e.g., possible division regarding the SALT cap, with legislators from relatively high-tax states potentially supporting an expansion or elimination of the cap to provide tax relief to their constituents with other legislators possibly seeking to limit the deduction further to increase Federal tax revenue). While much of the focus in 2025 will be on tax-related items, proposed retirement-related legislation could come to the forefront as well, according to some pundits, which, if passed and packaged together could represent a \"SECURE Act 3.0\", following closely on the heels of \"SECURE 2.0\", which was passed in late 2022 and affected everything from Required Minimum Distributions (RMDs) to creating new opportunities for Roth contributions (which could feature in future legislation if legislators look to encourage [or require, in some cases] Roth contributions in order to raise tax revenue). While there has been some speculation that such a \"SECURE 3.0\" could focus on expanding access to retirement savings for currently underserved groups (e.g., the Helping Young Americans Save for Retire Act, would make it easier to allow workers as young as 18 to participate in workplace retirement plans), there could be less appetite for any major overhaul to retirement savings as industry participants continue to digest the effects of SECURE 2.0. Ultimately, the key point is that 2025 could see the passage of significant legislation that could affect nearly every taxpayer (and financial planning client), presenting financial advisors with the opportunity to add value by staying abreast of the latest updates on the legislation (as questions from curious clients are likely to arise over the course of the year) and by considering potential planning opportunities as the exact details come into greater focus. Fidelity To Move RIA Client Cash From Money Market Funds To Lower-Yielding Sweep Product (Ian Wenik | Citywire RIA) A custodian is one of the most crucial vendors for RIAs that manage client assets. From the core custodial services of trading and holding and keeping records of electronically owned securities, to the ancillary technology from trading to (digital) onboarding that custodians provide to help advisors run their business, a good RIA custodial relationship can help firms attract and retain clients. And despite this range of benefits, RIAs typically are able to access these services without having to pay direct platform fees, as the custodians earn money in a variety of other ways, including in today's environment what is often a substantial amount of net interest income derived from the difference between the rate paid on RIA client cash held in platform or related-bank sweep programs, and the rate at which they can otherwise invest or lend the money to others (e.g., through margin loans). Which has become particularly important to the custodians as the industry has moved away from ticket charges for trades and is less and less reliant on mutual funds (and the sub-TA fees they historically generated for RIA custodians). In an apparent move to boost their net interest income, Fidelity (the second-largest RIA custodian, trailing only Charles Schwab) is planning to convert all of its existing RIA non-retirement clients' cash balances from money market funds (with the largest Fidelity money market fund currently carrying an approximately 4.27% 7-day yield) to its in-house cash management product, FCASH (which offered a 2.32% yield as of early November). The shift, which is expected to take place in the first quarter of 2025, would require financial advisors to manually trade their clients' cash out of FCASH and into a money market fund or other cash management product to achieve higher Notably, the move comes at a time of increasing scrutiny of brokerage firms' cash sweep programs, with LPL Financial, Wells Fargo, and Morgan Stanley all facing probes from the Securities and Exchange Commission over the yields they pay clients and plaintiffs filing lawsuits against those firms as well as Schwab, Ameriprise, and Raymond James (though several of those firms have indicated that they are raising the interest rates paid on their cash sweep products), perhaps a sign that Fidelity believes its cash sweep rates at 2.32% are still sufficiently competitive. In the end, Fidelity's latest move is a reminder to RIAs that their custodians aren't really 'free' and can and do generate revenue through indirect means (e.g., by offering RIA clients relatively low rates on cash sweep products and using that cash to earn higher rates elsewhere), as RIA custodians needs to get paid somehow for the services they provide. On the plus side, advisors on the Fidelity platform working with clients with significant cash positions (that aren't being used imminently to purchase another investment) now have an opportunity to help them earn more by (manually) moving funds in cash sweep accounts to higher-paying money market funds (or perhaps by moving the cash to one of many cash management platforms designed for advisors?). Still, though, the change serves as a powerful reminder that In Wealthy Families, Inheritance Distress Goes Beyond Money (John Manganaro | ThinkAdvisor) Many financial planning clients have a goal to leave a legacy interest, often in the form of bequeathing assets to their children. While this reflects generosity towards their heirs (and can give these financial beneficiaries a leg up), a recent survey suggests that the circumstances around inheritances can cause strain, both for parents and their children. According to Bank of America's 2024 Study of Wealthy Americans, which surveyed 1,007 adults with at least $3 million in investable assets, individuals who benefited from 'legacy wealth' are most likely to indicate they either already have or expect to experience strain around inheritance issues, with 45% of respondents indicating this is the case. Respondents identified interpersonal family dynamics as the primary cause of this strive (cited by 59% of those surveyed), followed by an unequal distribution of assets (38%), lack of clear instructions and documentation (25%), lack of communication (24%), and lack of trust or transparency in relevant executors or trustees (18%). Another area of potential stress concerns certain hard assets, such as collectibles or antiques, that might end up being given to a recipient who has no interest in them. Nonetheless, despite this strain, only 48% of those surveyed have a 'basic' estate plan (i.e., a will, living will/advanced directive, and a durable power of attorney) in place, though those who work with a financial advisor were more likely to do so (50%) compared to those without one (31%). In sum, while leaving assets to heirs can be an act of generosity, the process of doing so can create intra-family strain, both in terms of interpersonal dynamics (e.g., if one child feels shortchanged) and logistics (e.g., how to handle tangible property). Which presents financial advisors with several avenues for supporting clients in this position, whether in ensuring they have prepared the appropriate estate documents (and that these documents match the client's intentions), helping them giving assets in an equitable way, or by encouraging them to start a dialogue with their children surrounding their wishes for their estate (perhaps during the holiday season, when many family members will be getting together anyway?). Navigating The Psychological Barriers To Fruitful Inheritance Conversations (Chad Druvenga | Advisor Perspectives) When it comes to estate planning, having open communication between parents and their children (or other inheritors) can help clear up potential confusion and strain that can emerge when parents keep their estate plans hidden from view. Nonetheless, some clients might be hesitant about starting this dialogue, perhaps because they don't want to reduce their heirs' motivation to work hard (if they know they will eventually receive a large inheritance) or create additional strain while they are still alive (e.g., if their heirs feel like they are being treated unequally). With this in mind, financial advisors can help clients build the motivation to initiate inheritance conversations with their heirs. To start, rather than first focusing on quantitative matters (i.e., who is going to receive what), advisors can encourage their clients to think about the qualitative benefits they want their wealth to accomplish. For instance, clients might consider how they want their heirs to use their inheritance (e.g., if there is a family business, do the parents expect their children to continue to operate it?). Doing so can help the parents see how starting an estate planning conversation with their children can help ensure their ultimate goals for their wealth are met (and can lead to discussions with their advisor about the best structures [e.g., trusts] to make them happen). Further, by facilitating these conversations, advisors can begin to build trust with these clients' children, possibly increasing the chances that the heirs will continue to use the advisor to manage their parents' assets after they pass away. Ultimately, the key point is that while it can be psychologically challenging for parents to hold inheritance conversations with their children, financial advisors can help them get over these barriers by exploring their values and discussing ways to ensure that their legacy goals will be met (perhaps by facilitating the creation of a family money mission statement) while reducing potential stress for their family in the process. 5 Ways For A Client To Simplify Their Estate (Cheryl Winokur Munk | The Wall Street Journal) The death of a parent or other loved one is an inherently stressful situation for those who are left behind. Sometimes, this grief can be compounded by stress resulting from the decedent leaving a complicated estate plan (or none at all), requiring their executor and/or heirs to decipher and execute their wishes. Which suggests that clients potentially can prevent this further stress by updating and simplifying their estate plans. To start, regularly updated estate documents (and beneficiary forms) can ensure that selected assets go to the desired person (particularly important for blended families, where the beneficiary of some accounts could be a client's previous spouse rather than the current one). In addition, clients can help avoid conflict by assigning tangible personal property to specific individuals in advance (and writing down where each item is located!) to prevent arguments among their children or other heirs as to who gets what. Similarly, identifying digital assets (e.g., financial assets such as cryptocurrencies or a digital picture collection) can help ensure they are not lost in the shuffle when it comes to dividing up an estate. Other helpful instructions to write out in advance include the location of estate and other key documents, the names, numbers, and locations of financial accounts, and names and contact information for attorneys, accountants, and financial advisors. Finally, clients can reduce sibling rivalry issues by naming an outside party as the executor for their estate and or trustee for trust accounts rather than one of their children (or, if they do name a child, write out their reasoning for doing so, for example because the child lives locally). In the end, while clients might think about their legacy in part in terms of the assets they leave to their heirs, one of the most underrated gifts of all (and an area where a financial advisor can add value!) could be a well-designed estate plan that is relatively simple to execute and avoids creating strain among the client's survivors! The 4 Behaviors That Help Retirees Thrive (Amabile, Bailyn, Crary, Hall, and Kram | Harvard Business Review) Many individuals look forward to the day they can retire, leaving the 9-to-5 behind and having time for activities they've long wanted to pursue. Nevertheless, retirement can be a major shock to the system, both given the loss of purpose that a job can provide and the lack of structure that comes with no longer having to be in the office at certain times. With this in mind, the authors conducted a 10-year longitudinal study of 14 Americans going through the retirement transition and interviewed 106 pre- and postretirement knowledge workers to see how individuals adjust to retirement over time and identified 4 key behaviors that helped retirees thrive: alignment, awareness, agency, and adaptability. First, successful retirees tended to have alignment between their \"self\" (i.e., one's central identities, needs, and values, among other factors) and their \"life structure\" (i.e., one's main activities and relationships, the groups and organizations they belong to, and the places where they spend their time). For instance, if a retiree who values helping others could achieve alignment if they are able to take part in several volunteer opportunities in retirement. On the other hand, a retiree who values close friendships might find the transition difficult if they move to a new location (far away from their longtime friends) after they retire. The other 3 behaviors (awareness, agency, and adaptability) are tools that can help a retiree achieve better alignment. To start, engaging in exercises to boost awareness (perhaps with the assistance of a financial advisor?) can help a retiree (or someone considering the transition) better understand both their self (e.g., their values and goals) and their life structure. One option is for an individual to write down 6 to 10 words that describe themselves (e.g., engineer, friend, nature lover), circle the 3 or 4 that matter most to them, and then consider whether their current life structure (or, for those still working, the one the expect to have in retirement) aligns with those core aspects of self. Next, the ability to exercise agency over one's life can help individuals improve their situation. For example, a retiree might regularly check in and consider the changes they could make to their life structure to better bring it in line with their \"self\" (e.g., a retiree who misses their old social network from the office might join a local club related to one of their interests). Finally, thriving retirees showed adaptability, or the ability to adjust when major events occurred, whether positive (e.g., birth of a grandchild) or negative (e.g., death of a spouse). And while many of these events are unpredictable, retirees can help prepare mentally in advance by brainstorming events that could occur, potential challenges that could arise because of them, and how they might adapt to this new environment. In sum, while retirement can be an enjoyable transition, it is not inevitable that an individual retiree will thrive. Nonetheless, by better understanding what makes them tick and creating a \"life structure\" that fits this mold, retirees (and those about to make the jump) can create retirement lifestyles that reflect their values, interests, and goals! Research-Backed Strategies To Get The Most Out Of Retirement (Eric Barker | Barking Up The Wrong Tree) For some individuals, their first year of retirement is a dream come true, a time to travel, read, and relax after a multi-decade career. However, given research finding that this high quality of life can wane over time (e.g., as time devoted to unstructured relaxation can lead to boredom) and that the life satisfaction pre-retirees expect to have in retirement often lags that expressed by current retirees, taking a more structured approach to planning and executing one's retirement years can lead to more enjoyment and meaning. To start, while having a financial plan for retirement is important (of course), success in retirement goes well beyond just having enough dollars to meet one's lifestyle requirements. With this in mind, creating an organized picture of what one wants their retirement to look like (not just identifying activities, but also planning out the structure of a 'typical' day) can help prevent boredom or a lack of purpose once they retire. Next, when crafting this schedule, a (pre) retiree might think about the potential role for work in this schedule. And while they might not want to return to full-time work (they are retired after all), part-time work can provide a sense of purpose and structure (and give a boost to their finances as well!). In addition, finding hobbies can also provide an emotional boost, with volunteering and exercise being particularly associated with greater happiness. Finally, the quality of social relationships can be a strong influence on one's happiness in retirement, both in terms of broader social networks (that might need to be replenished after leaving work) as well as one's closest relationships (e.g., with a spouse). Ultimately, the key point is that the commonly used maxim that it's important to \"retire to something rather than from something\" can apply to several areas of retirement, from the hobbies (or paid work) that a retiree takes on to the social ties they maintain (and perhaps grow) over time. And for financial advisors, this could mean not only ensuring that their clients are well set up to have a financially successful retirement, but also are prepared to have a psychologically fulfilling one as well! The Upsides Of A Phased Retirement (Christine Benz | Morningstar) Some individuals view retirement as a clearly defined line in the sand between full-time work and no (paid) work at all. However, given that such a transition can be jarring (both financially and psychologically), some individuals might choose a 'phased' retirement where they gradually reduce the hours that they work over time to get the benefits of employment (financial, social, and others) while freeing up time for other activities (e.g., travel and hobbies). Notably, though, a 'phased' retirement does not necessarily just have to be about the number of hours worked each week. For instance, an individual could decide to focus just on the most enjoyable and meaningful work assignments available to them. Though an alternative approach is to create (and implement) a \"stop-doing list\", reducing the number of work activities that don't bring satisfaction (thereby leaving behind ones that do). Also, another way to 'phase' into retirement is to adjust one's schedule in and out of the office (with the blessing of their employer). Because while being in the office can provide benefits (e.g., socializing with colleagues, mentoring junior employees), working remotely can potentially provide additional leisure time (based on less time spent commuting) and location flexibility (i.e., being able to work from a different state, or even country). Altogether, perhaps one of the greatest benefits of a 'phased' retirement is that it allows for experimentation, whether in the number of hours worked, what work is performed, and where it occurs. Which can help a client avoid an 'all or nothing' retirement decision (that they might regret one way or the other) and instead take a more gradual approach to retirement on their terms. 10 Ideas For Hosting A Virtual Holiday Party (Susan Theder | Financial Advisor) The holiday season comes with many traditions, including the office holiday party. Whether it's an internal gathering of firm staff or a larger-scale client event, these events can provide an opportunity to socialize and build relationships outside of the daily work environment or client meetings. While firms with local staff and/or clients might choose to have an in-person gathering this year, for the number of firms with staff and/or clients spread around the country might consider virtual options for their holiday party. While it might be harder to create a festive atmosphere with a virtual event (there are so many decorations you can hang on a Zoom screen after all), there are a wide range of options, across a variety of price points, that firms can consider to still have a fun time. One option is to do a virtual class, where materials are sent to participants in advance and an instructor leads the lesson virtually. Such events include a virtual 'sip and paint' (e.g., from Board \u0026 Brush), chocolate tasting (e.g., with Bar and Cocoa), charcuterie board making and/or wine tasting (e.g., from Confetti), or a holiday cooking lesson (e.g., with Rockoly). Trivia-minded groups can create their own games for free (e.g., using JeopardyLabs) or have one hosted for them (e.g., with Outback Team Building or The Big Quiz Thing). Or for those who just want to eat and chat, hosting a virtual pizza party (e.g., from Pizzatime) could be the answer. In sum, there are a wide range of available options for hosting a virtual staff or client holiday part this year, which can help build ties heading into the new year (with significantly less time spent on setup and cleanup compared to an in-office event)! How To Ensure Client Holiday Cards And Gifts Stand Out (Crystal Lee Butler | Crystal Marketing Solutions) While the final weeks of the year can be a season of merriment, they can also come with significant stress, whether it's from planning a large family Thanksgiving get-together, finding the right presents for everyone on your shopping list, or, for financial advisors, making sure year-end tasks (e.g., RMDs) are taken on time. Another common to-do for financial advisors is to send holiday cards and/or gifts to clients; and while it might be tempting to find the most convenient solution to this task (given other year-end responsibilities), taking the time to offer a more personalized touch could pay off in the coming year. Sending a holiday card is a tradition for many families and advisory firms. Nevertheless, given the number of cards a client is likely to receive, it can be hard for an advisor to stand out from the pack and be remembered. Perhaps the most important feature of an effective holiday card is to include a personal touch, whether a signature (or having each member of the firm sign cards) and/or an individualized message to each client. Another way to stand out is to send a card at an 'off peak' period, such as closer to Thanksgiving or New Year's Day, when clients aren't likely to find several other cards in their mailbox. For firms that want to go the extra mile, sending holiday gifts can also be a sign of appreciation for clients. These could include personalized gifts (perhaps using information on client preferences stored in the firm's CRM) or perhaps the gift of 'time' (e.g., a meal kit delivery or laundry service). In the end, while sending holiday cards or gifts might seem like just another task on a long year-end checklist, demonstrating thoughtfulness could demonstrate to clients that their advisory firm is willing to go the extra mile for them not only during the holidays, but also throughout the entire year! 4 Holiday Content Tips For Financial Advisor Social Media (Shane Barker | Nitrogen) For advisory firms who use social media to promote their brands, the need for new content never ends (though can be made easier by repurposing exiting content). Luckily, the holiday season provides a natural opportunity to create themed content to connect with prospects and clients alike. To start, finding ways to create personalized holiday-themed content can boost engagement, whether by posting team members' favorite holiday traditions or recipes, or by creating curated lists relevant to the firm's ideal client persona (e.g., inspirational books on entrepreneurship for business-owner clients). Other posts could be planning-related, such as best practices for holiday budgeting or year-end financial to-dos (which could encourage prospects to take the next step if they realize they might not be comfortable handling some of them on their own?). Notably, these posts can be supercharged by including video in addition to text (e.g., recording interviews with team members about what they're thankful for this year). And even when using static posts, adding a bit of color and festive touch can help these posts stand out from those that are text-only. Ultimately, the key point is that the holiday season offers a variety of opportunities to create themed social media content that can show an advisor's personality to engage prospects and clients and help keep their firm top-of-mind into the new year and beyond. We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2024/05/Social-Image-Blog-Article-Weekend-Reading-2024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; – this week\u0026#39;s edition kicks off with the news that a recent study from Cerulli Associates shows that consumer trust in financial services companies has increased significantly over the past decade, with firms that provide a more personalized approach to providing financial advice seeing the best results. Which could prove to be a boon for the financial advice industry as more consumers are willing to entrust their assets to an advisor (while at the same time possibly making it tougher for some advisors to differentiate themselves primarily by how they put their clients\u0026#39; interests first?).\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhile many financial advisors are paying close attention to the potential extension of sunsetting measures within the Tax Cuts and Jobs Act (TCJA) in the coming year, legislation related to retirement savings could be on Congress\u0026#39; agenda as well\u003c/li\u003e\n\u003cli\u003eFidelity is planning to change the default for its existing RIA non-retirement clients\u0026#39; cash balances from money market funds to its (lower-interest-rate-paying) in-house cash management product in the latest signal that even when firms don\u0026#39;t pay platform fees themselves, RIA custodial services aren\u0026#39;t truly \u0026#39;free\u0026#39;\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on estate planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA recent survey indicates that a significant number of families experience inheritance-related strain, which can be mitigated by opening up lines of communication between parents and their children\u003c/li\u003e\n\u003cli\u003eHow encouraging clients to think of their qualitative legacy goals (and not just the dollars and cents of what they what to leave to heirs) can help them overcome psychological barriers to starting meaningful inheritance conversations with their children\u003c/li\u003e\n\u003cli\u003e5 ways that clients can simplify their estate to ensure that their goals are met and that they don\u0026#39;t create additional stress for their survivors\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on retirement planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhy alignment between one\u0026#39;s sense of self and the lifestyle structure they operate in is a driving factor in whether an individual will thrive in retirement\u003c/li\u003e\n\u003cli\u003eWhy creating structure around how one will spend their time in retirement (whether through work, hobbies, and/or social activities) can ultimately lead to greater retirement satisfaction\u003c/li\u003e\n\u003cli\u003eThe different ways clients can implement a \u0026#39;phased retirement\u0026#39; beyond working fewer hours, from creating a \u0026#34;stop doing list\u0026#34; to establishing greater workplace flexibility\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with 3 final articles, all about planning for the holiday season:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdeas for hosting a virtual holiday party for staff or clients, from chocolate-tasting classes to hosted virtual trivia events\u003c/li\u003e\n\u003cli\u003eHow financial advisors can ensure their client holiday cards and gifts stand out from the pack\u003c/li\u003e\n\u003cli\u003eTips for holiday-themed advisory firm social media content, including the value of video to help prospects and clients get to know firm staff better on a personal level\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" sizes=\"(max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"Trust In Advisors Rose In Past Decade\" id=\"trust-in-advisors-rose-steeply-in-past-decade-cerulli\"\u003e\u003cspan\u003e\u003ca href=\"https://www.thinkadvisor.com/2024/11/21/trust-in-advisors-rose-steeply-in-past-decade-cerulli/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eTrust In Advisors Rose Steeply In Past Decade: Cerulli\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Michael Fischer | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor consumers, handing their hard-earned assets to be managed by a financial advisor typically requires a significant level of trust. And while firms and individual advisors can carefully craft their reputations and offer advice that is in their clients\u0026#39; best interest, \u003ca href=\"https://www.kitces.com/blog/advice-industry-prospecting-clients-marketing-growth-positive-development-trust/\"\u003ean individual\u0026#39;s willingness to seek financial advice in the first place can also be influenced by the reputation of the industry as a whole\u003c/a\u003e. Which suggests that looking at industry-wide trust figures can provide a broad signal on consumers\u0026#39; receptiveness to seeking out financial advice.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://www.cerulli.com/press-releases/affluent-investors-trust-their-financial-providers-more-than-ever\"\u003eresearch from Cerulli Associates\u003c/a\u003e, the percentage of affluent investors who believe that financial services firms are looking out for their best interests has risen significantly during the past decade, from 39% in 2014 to 60% this year. Notably, this level of trust is consistent across age demographics, with 56% to 60% of those in age cohorts below 70 indicating so and 65% of those older than age 70 agreeing (perhaps because they have had the opportunity for longer relationships with advisors). Client trust was highest in channels where clients experience direct advisor relationships, including private banks (75%) and full-service advisory firms (65%), with less-personalized channels (e.g., retirement plan providers) lagging behind. Among the approximately 40% of affluent investors who indicated a lack of trust in financial firms, 24% said they were unsure of the quality of the financial products their advisor might recommend (compared to only 11% for those who trust their financial firms), suggesting that building trust in the advisor-client relationship first before discussing specific investments could lead to a more trusting relationship (and perhaps greater likelihood that the client will stick with the advisor, and their portfolio recommendations).\u003c/p\u003e\n\u003cp\u003eAltogether, this study suggests that the financial advice industry has been successful in improving its level of trust with consumers (perhaps in line with more financial advice professionals truly putting their clients\u0026#39; interests first?). Which could prove to be a boon to the industry if it leads more consumers to seek out advice relationships (while at the same time possibly \u003ca href=\"https://www.kitces.com/blog/great-convergence-ria-fiduciary-marketing-differentiation-broker-dealer-regulation-best-interest/\"\u003emaking it tougher for some firms to market themselves primarily by how they put their clients\u0026#39; interests first\u003c/a\u003e, \u003ca href=\"https://www.kitces.com/blog/marketing-growth-financial-advisor-prospects-different-ria/\"\u003esuggesting advisors might look to other potential differentiators\u003c/a\u003e?).\u003c/p\u003e\n\u003ch2 data-nav-title=\"TCJA Extension...And SECURE Act 3.0?\" id=\"on-the-horizon-for-2025-tcja-extensionand-secure-act-30\"\u003e\u003cspan\u003e\u003ca href=\"https://www.thinkadvisor.com/2024/11/22/expect-secure-30-and-a-major-tax-bill-next-year/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eOn The Horizon For 2025: TCJA Extension...And SECURE Act 3.0?\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Melanie Waddell | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDuring the past year, there has been significant speculation about what the results of the 2024 election would mean for expiring provisions of the \u003ca href=\"https://www.kitces.com/blog/final-gop-tax-plan-summary-tcja-2017-individual-tax-brackets-pass-through-strategies/\"\u003e2017 Tax Cuts and Jobs Act (TCJA)\u003c/a\u003e, including \u003ca href=\"https://www.kitces.com/blog/tax-cut-and-jobs-act-tcja-sunset-marginal-tax-rates-personal-exemption-phaseout-pease-limitation-qbi-deduction/\"\u003epotential changes in marginal tax rates, the future of State And Local Tax (SALT) deductions, and other measures\u003c/a\u003e. Now, with the election in the rearview mirror and a second Trump administration on the horizon (along with Republican majorities in the U.S. House of Representatives and Senate), observers have a better idea of what to expect when it comes to tax- and retirement-related legislation that could impact financial advisors and their clients.\u003c/p\u003e\n\u003cp\u003eThe top piece of financial-related legislation to be debated in 2025 is almost certain to be tax measures baked into a broader budget bill, which could pass without support from Democrats through the reconciliation process (which limits amendments and eliminates the filibuster, allowing the Senate to pass the legislation with a majority vote). While many expiring measures from the TCJA are likely to feature in this legislation (given that the original law was passed during the first Trump administration), there still could be plenty of debate concerning the exact makeup of specific measures (e.g., possible division regarding the SALT cap, with legislators from relatively high-tax states potentially supporting an expansion or elimination of the cap to provide tax relief to their constituents with other legislators possibly seeking to limit the deduction further to increase Federal tax revenue).\u003c/p\u003e\n\u003cp\u003eWhile much of the focus in 2025 will be on tax-related items, proposed retirement-related legislation could come to the forefront as well, according to some pundits, which, if passed and packaged together could represent a \u0026#34;SECURE Act 3.0\u0026#34;, following closely on the heels of \u003ca href=\"https://www.kitces.com/blog/secure-act-2-omnibus-2022-hr-2954-rmd-75-529-roth-rollover-increase-qcd-student-loan-match/\"\u003e\u0026#34;SECURE 2.0\u0026#34;\u003c/a\u003e, which was passed in late 2022 and affected everything from Required Minimum Distributions (RMDs) to creating new opportunities for Roth contributions (which could feature in future legislation if legislators look to encourage [or require, in some cases] Roth contributions in order to raise tax revenue). While there has been some speculation that such a \u0026#34;SECURE 3.0\u0026#34; could focus on expanding access to retirement savings for currently underserved groups (e.g., the \u003ca href=\"https://www.thinkadvisor.com/2024/11/22/expect-secure-30-and-a-major-tax-bill-next-year/\"\u003eHelping Young Americans Save for Retire Act\u003c/a\u003e, would make it easier to allow workers as young as 18 to participate in workplace retirement plans), there could be less appetite for any major overhaul to retirement savings as industry participants \u003ca href=\"https://www.kitces.com/blog/secure-act-2-0-irs-regulations-rmd-required-minimum-distributions-10-year-rule-eligible-designated-beneficiary-see-through-conduit-trust/\"\u003econtinue to digest the effects of SECURE 2.0\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that 2025 could see the passage of significant legislation that could affect nearly every taxpayer (and financial planning client), presenting financial advisors with the opportunity to add value by staying abreast of the latest updates on the legislation (as questions from curious clients are likely to arise over the course of the year) and \u003ca href=\"https://www.kitces.com/blog/2024-election-republican-trifecta-trump-2025-tcja-sunset-tax-planning-tax-cut-and-jobs-act-salt-congress/\"\u003eby considering potential planning opportunities as the exact details come into greater focus\u003c/a\u003e.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Fidelity To Move RIA Client Cash\" id=\"fidelity-to-move-ria-client-cash-from-money-market-funds-to-loweryielding-sweep-product\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/exclusive-fidelity-to-move-ria-client-cash-from-money-market-funds-to-lower-yielding-sweep-product/a2455186\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eFidelity To Move RIA Client Cash From Money Market Funds To Lower-Yielding Sweep Product\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Ian Wenik | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA custodian is one of the most crucial vendors for RIAs that manage client assets. From the core custodial services of trading and holding and keeping records of electronically owned securities, to the ancillary technology from trading to (digital) onboarding that custodians provide to help advisors run their business, a good RIA custodial relationship can help firms attract and retain clients. And despite this range of benefits, RIAs typically are able to access these services without having to pay direct platform fees, as \u003ca href=\"https://www.kitces.com/blog/yang-xu-tradingfront-ria-custodian-commission-free-trading-net-interest-margin-income-cash-sweep-bank/\"\u003ethe custodians earn money in a variety of other ways\u003c/a\u003e, including in today\u0026#39;s environment what is often a substantial amount of net interest income derived from the difference between the rate paid on RIA client cash held in platform or related-bank sweep programs, and the rate at which they can otherwise invest or lend the money to others (e.g., through margin loans). Which has become particularly important to the custodians as the industry has moved away from ticket charges for trades and is less and less reliant on mutual funds (and the sub-TA fees they historically generated for RIA custodians).\u003c/p\u003e\n\u003cp\u003eIn an apparent move to boost their net interest income, Fidelity (the second-largest RIA custodian, trailing only Charles Schwab) is planning to convert all of its existing RIA non-retirement clients\u0026#39; cash balances from money market funds (with the largest Fidelity money market fund currently carrying an approximately 4.27% 7-day yield) to its in-house cash management product, FCASH (which offered a 2.32% yield as of early November). The shift, which is expected to take place in the first quarter of 2025, would require financial advisors to manually trade their clients\u0026#39; cash out of FCASH and into a money market fund or other cash management product to achieve higher\u003c/p\u003e\n\u003cp\u003eNotably, the move comes at a time of increasing scrutiny of brokerage firms\u0026#39; cash sweep programs, with LPL Financial, Wells Fargo, and Morgan Stanley all facing probes from the Securities and Exchange Commission over the yields they pay clients and plaintiffs filing lawsuits against those firms as well as Schwab, Ameriprise, and Raymond James (though \u003ca href=\"https://citywire.com/ria/news/how-schwabs-new-cash-sweep-policy-led-to-lpls-brutal-week-in-the-markets/a2446592\"\u003eseveral of those firms have indicated that they are raising the interest rates paid on their cash sweep products\u003c/a\u003e), perhaps a sign that Fidelity believes its cash sweep rates at 2.32% are still sufficiently competitive.\u003c/p\u003e\n\u003cp\u003eIn the end, Fidelity\u0026#39;s latest move is a reminder to RIAs that their custodians aren\u0026#39;t really \u0026#39;free\u0026#39; and can and do generate revenue through indirect means (e.g., by offering RIA clients relatively low rates on cash sweep products and using that cash to earn higher rates elsewhere), as RIA custodians needs to get paid somehow for the services they provide. On the plus side, advisors on the Fidelity platform working with clients with significant cash positions (that aren\u0026#39;t being used imminently to purchase another investment) now have an opportunity to help them earn more by (manually) moving funds in cash sweep accounts to higher-paying money market funds (or perhaps by \u003ca href=\"https://www.kitces.com/blog/cash-management-rising-interest-rates-inflation-sweep-accounts-fintech-fees-aua/\"\u003emoving the cash\u003c/a\u003e to one of many \u003ca href=\"https://fintech.kitces.com/category/financial-planning/cash-management/\"\u003ecash management platforms designed for advisors\u003c/a\u003e?). Still, though, the change serves as a powerful reminder that\u003c/p\u003e\n\u003ch2 data-nav-title=\"Inheritance Distress Goes Beyond Money\" id=\"in-wealthy-families-inheritance-distress-goes-beyond-money\"\u003e\u003cspan\u003e\u003ca href=\"https://www.thinkadvisor.com/2024/06/25/in-wealthy-families-inheritance-distress-goes-beyond-money/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Estate-Planning\"\u003eIn Wealthy Families, Inheritance Distress Goes Beyond Money\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(John Manganaro | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMany financial planning clients have a goal to leave a legacy interest, often in the form of bequeathing assets to their children. While this reflects generosity towards their heirs (and can give these financial beneficiaries a leg up), a recent survey suggests that the circumstances around inheritances can cause strain, both for parents and their children.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://ustrustaem.fs.ml.com/content/dam/ust/articles/pdf/2024BoA-PB_Study_of_Wealthy_Americans.pdf\"\u003eBank of America\u0026#39;s 2024 Study of Wealthy Americans\u003c/a\u003e, which surveyed 1,007 adults with at least $3 million in investable assets, individuals who benefited from \u0026#39;legacy wealth\u0026#39; are most likely to indicate they either already have or expect to experience strain around inheritance issues, with 45% of respondents indicating this is the case. Respondents identified interpersonal family dynamics as the primary cause of this strive (cited by 59% of those surveyed), followed by an unequal distribution of assets (38%), lack of clear instructions and documentation (25%), lack of communication (24%), and lack of trust or transparency in relevant executors or trustees (18%). Another area of potential stress concerns certain hard assets, such as collectibles or antiques, that might end up being given to a recipient who has no interest in them. Nonetheless, despite this strain, only 48% of those surveyed have a \u0026#39;basic\u0026#39; estate plan (i.e., a will, living will/advanced directive, and a durable power of attorney) in place, though those who work with a financial advisor were more likely to do so (50%) compared to those without one (31%).\u003c/p\u003e\n\u003cp\u003eIn sum, while leaving assets to heirs can be an act of generosity, the process of doing so can create intra-family strain, both in terms of interpersonal dynamics (e.g., if one child feels shortchanged) and logistics (e.g., how to handle tangible property). Which presents financial advisors with several avenues for supporting clients in this position, whether in \u003ca href=\"https://www.kitces.com/blog/financial-advisor-estate-planning-attorney-planning-cooperation-roles-client-referrals/\"\u003eensuring they have prepared the appropriate estate documents\u003c/a\u003e (and that \u003ca href=\"https://www.kitces.com/estate-planning-document-course/\"\u003ethese documents match the client\u0026#39;s intentions\u003c/a\u003e), helping them \u003ca href=\"https://www.kitces.com/blog/estate-planning-taxes-tax-retirement-asset-beneficiaries-ira-fund/\"\u003egiving assets in an equitable way\u003c/a\u003e, or by encouraging them to start a dialogue with their children surrounding their wishes for their estate (perhaps during the holiday season, when many family members will be getting together anyway?).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Psychological Barriers To Inheritance\" id=\"navigating-the-psychological-barriers-to-fruitful-inheritance-conversations\"\u003e\u003cspan\u003e\u003ca href=\"https://www.advisorperspectives.com/articles/2024/09/25/navigating-psychological-barriers-fruitful-conversations\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Estate-Planning\"\u003eNavigating The Psychological Barriers To Fruitful Inheritance Conversations\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Chad Druvenga | Advisor Perspectives)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen it comes to estate planning\u003ca href=\"https://www.kitces.com/blog/roy-williams-group-amy-castoro-bridging-generations-heir-preparedness-trust-communication/\"\u003e, having open communication between parents and their children (or other inheritors) can help clear up potential confusion and strain\u003c/a\u003e that can emerge when parents keep their estate plans hidden from view. Nonetheless, some clients might be hesitant about starting this dialogue, perhaps because they don\u0026#39;t want to reduce their heirs\u0026#39; motivation to work hard (if they know they will eventually receive a large inheritance) or create additional strain while they are still alive (e.g., if their heirs feel like they are being treated unequally).\u003c/p\u003e\n\u003cp\u003eWith this in mind, financial advisors can help clients build the motivation to initiate inheritance conversations with their heirs. To start, rather than first focusing on quantitative matters (i.e., who is going to receive what), \u003ca href=\"https://www.kitces.com/blog/coventry-edwards-pitt-ballentine-partners-family-office-raised-aged-healthy-wealthy-wise/\"\u003eadvisors can encourage their clients to think about the qualitative benefits they want their wealth to accomplish\u003c/a\u003e. For instance, clients might consider how they want their heirs to use their inheritance (e.g., if there is a family business, do the parents expect their children to continue to operate it?). Doing so can help the parents see how starting an estate planning conversation with their children can help ensure their ultimate goals for their wealth are met (and can lead to discussions with their advisor about the best structures [e.g., trusts] to make them happen). Further, by facilitating these conversations, advisors can begin to build trust with these clients\u0026#39; children, possibly increasing the chances that the heirs will continue to use the advisor to manage their parents\u0026#39; assets after they pass away.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while it can be psychologically challenging for parents to hold inheritance conversations with their children, financial advisors can help them get over these barriers by exploring their values and discussing ways to ensure that their legacy goals will be met (perhaps by \u003ca href=\"https://www.kitces.com/blog/family-money-mission-statement-preparing-heirs-inheritance-collier-williams-preisser/\"\u003efacilitating the creation of a family money mission statement\u003c/a\u003e) while reducing potential stress for their family in the process.\u003c/p\u003e\n\u003ch2 data-nav-title=\"5 Ways For A Client To Simplify Their Estate\" id=\"5-ways-for-a-client-to-simplify-their-estate\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wsj.com/personal-finance/retirement/estate-planning-simplify-heirs-a7066acc\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Estate-Planning\"\u003e5 Ways For A Client To Simplify Their Estate\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Cheryl Winokur Munk | The Wall Street Journal)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe death of a parent or other loved one is an inherently stressful situation for those who are left behind. Sometimes, this grief can be compounded by stress resulting from the decedent leaving a complicated estate plan (or none at all), requiring their executor and/or heirs to decipher and execute their wishes. Which suggests that clients potentially can prevent this further stress by updating and simplifying their estate plans.\u003c/p\u003e\n\u003cp\u003eTo start, regularly updated estate documents (and beneficiary forms) can ensure that selected assets go to the desired person (particularly important for blended families, where the beneficiary of some accounts could be a client\u0026#39;s previous spouse rather than the current one). In addition, clients can help avoid conflict by assigning tangible personal property to specific individuals in advance (and writing down where each item is located!) to prevent arguments among their children or other heirs as to who gets what. Similarly, identifying digital assets (e.g., financial assets such as cryptocurrencies or a digital picture collection) can help ensure they are not lost in the shuffle when it comes to dividing up an estate. Other helpful instructions to write out in advance include the location of estate and other key documents, the names, numbers, and locations of financial accounts, and names and contact information for attorneys, accountants, and financial advisors. Finally, clients can reduce sibling rivalry issues by naming an outside party as the executor for their estate and or trustee for trust accounts rather than one of their children (or, if they do name a child, write out their reasoning for doing so, for example because the child lives locally).\u003c/p\u003e\n\u003cp\u003eIn the end, while clients might think about their legacy in part in terms of the assets they leave to their heirs, one of the most underrated gifts of all (and an area where a financial advisor can add value!) could be a well-designed estate plan that is relatively simple to execute and avoids creating strain among the client\u0026#39;s survivors!\u003c/p\u003e\n\u003ch2 data-nav-title=\"4 Behaviors That Help Retirees Thrive\" id=\"the-4-behaviors-that-help-retirees-thrive\"\u003e\u003cspan\u003e\u003ca href=\"https://hbr.org/2024/11/retire-without-regrets\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eThe 4 Behaviors That Help Retirees Thrive\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Amabile, Bailyn, Crary, Hall, and Kram | Harvard Business Review)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMany individuals look forward to the day they can retire, leaving the 9-to-5 behind and having time for activities they\u0026#39;ve long wanted to pursue. Nevertheless, retirement can be a major shock to the system, both given the loss of purpose that a job can provide and the lack of structure that comes with no longer having to be in the office at certain times. With this in mind, the authors conducted a 10-year longitudinal study of 14 Americans going through the retirement transition and interviewed 106 pre- and postretirement knowledge workers to see how individuals adjust to retirement over time and identified 4 key behaviors that helped retirees thrive: alignment, awareness, agency, and adaptability.\u003c/p\u003e\n\u003cp\u003eFirst, successful retirees tended to have alignment between their \u0026#34;self\u0026#34; (i.e., one\u0026#39;s central identities, needs, and values, among other factors) and their \u0026#34;life structure\u0026#34; (i.e., one\u0026#39;s main activities and relationships, the groups and organizations they belong to, and the places where they spend their time). For instance, if a retiree who values helping others could achieve alignment if they are able to take part in several volunteer opportunities in retirement. On the other hand, a retiree who values close friendships might find the transition difficult if they move to a new location (far away from their longtime friends) after they retire.\u003c/p\u003e\n\u003cp\u003eThe other 3 behaviors (awareness, agency, and adaptability) are tools that can help a retiree achieve better alignment. To start, engaging in exercises to boost awareness (perhaps with the assistance of a financial advisor?) can help a retiree (or someone considering the transition) better understand both their self (e.g., their values and goals) and their life structure. One option is for an individual to write down 6 to 10 words that describe themselves (e.g., engineer, friend, nature lover), circle the 3 or 4 that matter most to them, and then consider whether their current life structure (or, for those still working, the one the expect to have in retirement) aligns with those core aspects of self.\u003c/p\u003e\n\u003cp\u003eNext, the ability to exercise agency over one\u0026#39;s life can help individuals improve their situation. For example, a retiree might regularly check in and consider the changes they could make to their life structure to better bring it in line with their \u0026#34;self\u0026#34; (e.g., a retiree who misses their old social network from the office might join a local club related to one of their interests). Finally, thriving retirees showed adaptability, or the ability to adjust when major events occurred, whether positive (e.g., birth of a grandchild) or negative (e.g., death of a spouse). And while many of these events are unpredictable, retirees can help prepare mentally in advance by brainstorming events that could occur, potential challenges that could arise because of them, and how they might adapt to this new environment.\u003c/p\u003e\n\u003cp\u003eIn sum, while retirement can be an enjoyable transition, \u003ca href=\"https://www.kitces.com/blog/retirement-transition-meaningful-work/\"\u003eit is not inevitable that an individual retiree will thrive\u003c/a\u003e. Nonetheless, by better understanding what makes them tick and creating a \u0026#34;life structure\u0026#34; that fits this mold, retirees (and those about to make the jump) can create retirement lifestyles that reflect their values, interests, and goals!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Strategies To Get The Most Out Of Retirement\" id=\"researchbacked-strategies-to-get-the-most-out-of-retirement\"\u003e\u003cspan\u003e\u003ca href=\"https://bakadesuyo.com/2024/10/retirement/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eResearch-Backed Strategies To Get The Most Out Of Retirement\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Eric Barker | Barking Up The Wrong Tree)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor some individuals, their first year of retirement is a dream come true, a time to travel, read, and relax after a multi-decade career. However, given research finding that this high quality of life can wane over time (e.g., as time devoted to unstructured relaxation can lead to boredom) and that the life satisfaction pre-retirees expect to have in retirement often lags that expressed by current retirees, taking a more structured approach to planning and executing one\u0026#39;s retirement years can lead to more enjoyment and meaning.\u003c/p\u003e\n\u003cp\u003eTo start, while having a financial plan for retirement is important (of course), success in retirement goes well beyond just having enough dollars to meet one\u0026#39;s lifestyle requirements. With this in mind, creating an organized picture of what one wants their retirement to look like (not just identifying activities, but also planning out the structure of a \u0026#39;typical\u0026#39; day) can help prevent boredom or a lack of purpose once they retire. Next, when crafting this schedule, a (pre) retiree might think about the potential role for work in this schedule. And while they might not want to return to full-time work (they are retired after all), part-time work can provide a sense of purpose and structure (and give a boost to their finances as well!). In addition, finding hobbies can also provide an emotional boost, with volunteering and exercise being particularly associated with greater happiness. Finally, the quality of social relationships can be a strong influence on one\u0026#39;s happiness in retirement, both in terms of broader social networks (that might need to be replenished after leaving work) as well as one\u0026#39;s closest relationships (e.g., with a spouse).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that the commonly used maxim that it\u0026#39;s important to \u0026#34;retire \u003cem\u003eto\u003c/em\u003e something rather than \u003cem\u003efrom\u003c/em\u003e something\u0026#34; can apply to several areas of retirement, from the hobbies (or paid work) that a retiree takes on to the social ties they maintain (and perhaps grow) over time. And for financial advisors, this could mean not only ensuring that their clients are well set up to have a financially successful retirement, but also are prepared to have a psychologically fulfilling one as well!\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Upsides Of A Phased Retirement\" id=\"the-upsides-of-a-phased-retirement\"\u003e\u003cspan\u003e\u003ca href=\"https://www.morningstar.com/retirement/im-not-ready-im-not-waiting\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eThe Upsides Of A Phased Retirement\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Christine Benz | Morningstar)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSome individuals view retirement as a clearly defined line in the sand between full-time work and no (paid) work at all. However, given that such a transition can be jarring (both financially and psychologically), some individuals might choose \u003ca href=\"https://www.kitces.com/blog/traditional-semi-and-temporary-retirement-to-avoid-hedonic-adaptation/\"\u003ea \u0026#39;phased\u0026#39; retirement\u003c/a\u003e where they gradually reduce the hours that they work over time to get the benefits of employment (financial, social, and others) while freeing up time for other activities (e.g., travel and hobbies).\u003c/p\u003e\n\u003cp\u003eNotably, though, a \u0026#39;phased\u0026#39; retirement does not necessarily just have to be about the number of hours worked each week. For instance, an individual could decide to focus just on the most enjoyable and meaningful work assignments available to them. Though an alternative approach is to create (and implement) a \u003ca href=\"https://www.kitces.com/blog/carl-podcast-stop-doing-list-advisor-capacity/\"\u003e\u0026#34;stop-doing list\u0026#34;\u003c/a\u003e, reducing the number of work activities that don\u0026#39;t bring satisfaction (thereby leaving behind ones that do). Also, another way to \u0026#39;phase\u0026#39; into retirement is to adjust one\u0026#39;s schedule in and out of the office (with the blessing of their employer). Because while being in the office can provide benefits (e.g., socializing with colleagues, mentoring junior employees), working remotely can potentially provide additional leisure time (based on less time spent commuting) and location flexibility (i.e., being able to work from a different state, or even country).\u003c/p\u003e\n\u003cp\u003eAltogether, perhaps one of the greatest benefits of a \u0026#39;phased\u0026#39; retirement is that it allows for experimentation, whether in the number of hours worked, what work is performed, and where it occurs. Which can help a client avoid an \u0026#39;all or nothing\u0026#39; retirement decision (that they might regret one way or the other) and instead take a more gradual approach to retirement on their terms.\u003c/p\u003e\n\u003ch2 data-nav-title=\"10 Ideas For A Virtual Holiday Party\" id=\"10-ideas-for-hosting-a-virtual-holiday-party\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/10-ideas-for-hosting-a-virtual-holiday-party-79984.html?issue=379\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003e10 Ideas For Hosting A Virtual Holiday Party\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Susan Theder | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe holiday season comes with many traditions, including the office holiday party. Whether it\u0026#39;s an internal gathering of firm staff or a larger-scale client event, these events can provide an opportunity to socialize and build relationships outside of the daily work environment or client meetings. While firms with local staff and/or clients might choose to have an in-person gathering this year, for the number of firms with staff and/or clients spread around the country might consider virtual options for their holiday party.\u003c/p\u003e\n\u003cp\u003eWhile it might be harder to create a festive atmosphere with a virtual event (there are so many decorations you can hang on a Zoom screen after all), there are a wide range of options, across a variety of price points, that firms can consider to still have a fun time. One option is to do a virtual class, where materials are sent to participants in advance and an instructor leads the lesson virtually. Such events include a virtual \u0026#39;sip and paint\u0026#39; (e.g., from \u003ca href=\"https://boardandbrush.com/\"\u003eBoard \u0026amp; Brush\u003c/a\u003e), chocolate tasting (e.g., with \u003ca href=\"https://barandcocoa.com/pages/virtual-chocolate-tastings\"\u003eBar and Cocoa\u003c/a\u003e), charcuterie board making and/or wine tasting (e.g., from \u003ca href=\"https://www.withconfetti.com/product/virtual-charcuterie-board-making-class\"\u003eConfetti\u003c/a\u003e), or a holiday cooking lesson (e.g., with \u003ca href=\"https://rockoly.com/virtual-team-building-cooking-classes/\"\u003eRockoly\u003c/a\u003e). Trivia-minded groups can create their own games for free (e.g., using \u003ca href=\"https://jeopardylabs.com/\"\u003eJeopardyLabs\u003c/a\u003e) or have one hosted for them (e.g., with \u003ca href=\"https://www.outbackteambuilding.com/remote/virtual-team-building-activities/\"\u003eOutback Team Building\u003c/a\u003e or \u003ca href=\"https://bigquizthing.com/\"\u003eThe Big Quiz Thing\u003c/a\u003e). Or for those who just want to eat and chat, hosting a virtual pizza party (e.g., from \u003ca href=\"https://www.pizzatime.xyz/\"\u003ePizzatime\u003c/a\u003e) could be the answer.\u003c/p\u003e\n\u003cp\u003eIn sum, there are a wide range of available options for hosting a virtual staff or client holiday part this year, which can help build ties heading into the new year (with significantly less time spent on setup and cleanup compared to an in-office event)!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Ensure Client Holiday Gifts Stand Out\" id=\"how-to-ensure-client-holiday-cards-and-gifts-stand-out\"\u003e\u003cspan\u003e\u003ca href=\"https://crystalmarketingsolutions.com/blog/holiday-marketing-financial-advisors\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow To Ensure Client Holiday Cards And Gifts Stand Out\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Crystal Lee Butler | Crystal Marketing Solutions)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile the final weeks of the year can be a season of merriment, they can also come with significant stress, whether it\u0026#39;s from planning a large family Thanksgiving get-together, finding the right presents for everyone on your shopping list, or, for financial advisors, making sure year-end tasks (e.g., RMDs) are taken on time. Another common to-do for financial advisors is to send holiday cards and/or gifts to clients; and while it might be tempting to find the most convenient solution to this task (given other year-end responsibilities), taking the time to offer a more personalized touch could pay off in the coming year.\u003c/p\u003e\n\u003cp\u003eSending a holiday card is a tradition for many families and advisory firms. Nevertheless, given the number of cards a client is likely to receive, it can be hard for an advisor to stand out from the pack and be remembered. Perhaps the most important feature of an effective holiday card is to include a personal touch, whether a signature (or having each member of the firm sign cards) and/or an individualized message to each client. Another way to stand out is to send a card at an \u0026#39;off peak\u0026#39; period, such as closer to Thanksgiving or New Year\u0026#39;s Day, when clients aren\u0026#39;t likely to find several other cards in their mailbox. For firms that want to go the extra mile, sending holiday gifts can also be a sign of appreciation for clients. These could include personalized gifts (perhaps using information on client preferences stored in the firm\u0026#39;s CRM) or perhaps the gift of \u0026#39;time\u0026#39; (e.g., a meal kit delivery or laundry service).\u003c/p\u003e\n\u003cp\u003eIn the end, while sending holiday cards or gifts might seem like just another task on a long year-end checklist, demonstrating thoughtfulness could demonstrate to clients that their advisory firm is willing to go the extra mile for them not only during the holidays, but also throughout the entire year!\u003c/p\u003e\n\u003ch2 data-nav-title=\"4 Holiday Tips For Advisor Social Media\" id=\"4-holiday-content-tips-for-financial-advisor-social-media\"\u003e\u003cspan\u003e\u003ca href=\"https://nitrogenwealth.com/blog/content-tips-for-holiday-social-media/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003e4 Holiday Content Tips For Financial Advisor Social Media\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Shane Barker | Nitrogen)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor advisory firms who use social media to promote their brands, the need for new content never ends (though can be made easier by \u003ca href=\"https://www.kitces.com/blog/financial-advisor-content-marketing-repurpose-seo-video-podcast-social-media-newsletter/\"\u003erepurposing exiting content\u003c/a\u003e). Luckily, the holiday season provides a natural opportunity to create themed content to connect with prospects and clients alike.\u003c/p\u003e\n\u003cp\u003eTo start, finding ways to create personalized holiday-themed content can boost engagement, whether by posting team members\u0026#39; favorite holiday traditions or recipes, or by creating curated lists relevant to the firm\u0026#39;s \u003ca href=\"https://www.kitces.com/blog/ideal-client-persona-financial-advisor-niche-marketing-messaging/\"\u003eideal client persona\u003c/a\u003e (e.g., inspirational books on entrepreneurship for business-owner clients). Other posts could be planning-related, such as best practices for holiday budgeting or year-end financial to-dos (which could encourage prospects to take the next step if they realize they might not be comfortable handling some of them on their own?). Notably, these posts can be supercharged by including video in addition to text (e.g., recording interviews with team members about what they\u0026#39;re thankful for this year). And even when using static posts, adding a bit of color and festive touch can help these posts stand out from those that are text-only.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that the holiday season offers a variety of opportunities to create themed social media content that can show an advisor\u0026#39;s personality to engage prospects and clients and help keep their firm top-of-mind into the new year and beyond.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (November 30–December 1)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-c4bc2bc4153d077a4caad294-=\"\"\u003e\u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "34 min read",
  "publishedTime": "2024-11-29T14:00:22-05:00",
  "modifiedTime": "2024-11-29T17:27:19Z"
}
