{
  "id": "39685cb7-f416-4972-8d79-accaa22a2de0",
  "title": "Jordan Grumet’s New Book: The Purpose Code",
  "link": "https://obliviousinvestor.com/jordan-grumets-new-book-the-purpose-code/",
  "description": "In 2022 I read Jordan Grumet’s first book Taking Stock: A Hospice Doctor’s Advice on Financial Independence, Building Wealth, and Living a Regret-Free Life, and it made enough of an impression on me that I referenced it in my own book, More Than Enough. And I found that I kept bringing up various topics from […]",
  "author": "Mike",
  "published": "Mon, 06 Jan 2025 13:00:39 +0000",
  "source": "https://obliviousinvestor.com/feed/",
  "categories": [
    "Book Reviews"
  ],
  "byline": "",
  "length": 3273,
  "excerpt": "In 2022 I read Jordan Grumet’s first book Taking Stock: A Hospice Doctor’s Advice on Financial Independence, Building Wealth, and Living a Regret-Free Life, and it made enough of an impression on me that I referenced it in my own book, More Than Enough. And I found that I kept bringing up various topics from the book with friends, family, clients, and readers, because I was confident that they’d find the concepts to be helpful.",
  "siteName": "",
  "favicon": "",
  "text": "In 2022 I read Jordan Grumet’s first book Taking Stock: A Hospice Doctor’s Advice on Financial Independence, Building Wealth, and Living a Regret-Free Life, and it made enough of an impression on me that I referenced it in my own book, More Than Enough. And I found that I kept bringing up various topics from the book with friends, family, clients, and readers, because I was confident that they’d find the concepts to be helpful. More recently, I read Grumet’s new book: The Purpose Code: How to Unlock Meaning, Maximize Happiness, and Leave a Lasting Legacy. Very broadly speaking, my experience of the book was that: I found that I did not enjoy it as much as I enjoyed his first book, yet The book provided me with actionable information, which I was already putting to use before I even finished reading. (Specifically, it helped me finally understand one aspect of my work that I don’t enjoy — and start formulating a plan for what to do about that.) In hindsight, I think those two observations are simply opposite sides of the same coin. The book was giving me information about a change I needed to make. That wasn’t exactly fun or comfortable, but it was helpful. The crux of Grumet’s new book is what he calls the “purpose paradox” — the simultaneous observations that 1) people who have a clear sense of purpose experience increased lifespan, health, and happiness, yet 2) more than 91% of people experience anxiety about being unsure of what their purpose is. You might then think that the bulk of Grumet’s book is spent giving advice about how to find your Purpose In Life. But it’s quite the opposite. The book’s core message is that the source of the anxiety mentioned above is the belief that we each need to have a clearly defined Life Purpose. That’s anxiety-provoking, because very few people have a clearly defined Life Purpose. The reality is, you probably won’t have a moment in your life when the clouds part and you experience an epiphany about exactly what you’re meant to be doing with your time here on earth. Grumet argues instead for building what he calls “little p purpose” (as opposed to “Big P Purpose”) via smaller-scale pursuits. Maybe that means doing work that you find meaningful, even if it isn’t work that’s going to change the course of history. Or maybe that means diving into hobbies that you enjoy. Grumet argues that in both cases (work or hobbies) when you’re doing something that you really care about, you tend to develop relationships with other people who care about the same thing — and that helps to deepen the sense of purpose that’s linked to that activity for you. In any event, as a pretty “nuts and bolts” sort of person, a book about finding or building life purpose is a good bit outside the zone of what I typically read. But I found it helpful — useful advice, that I was able to put to work immediately. You might find the same thing, especially if it’s outside the zone of what you’d typically read as well. The Purpose Code: How to Unlock Meaning, Maximize Happiness, and Leave a Lasting Legacy by Jordan Grumet \"A wonderful book that tells its readers, with simple logical explanations, our Boglehead Philosophy for successful investing.\" - Taylor Larimore, author of The Bogleheads' Guide to Investing",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eIn 2022 I read Jordan Grumet’s first book \u003ca href=\"https://www.amazon.com/dp/1646043545/?tag=obliviousinve-20\"\u003e\u003cem\u003eTaking Stock: A Hospice Doctor’s Advice on Financial Independence, Building Wealth, and Living a Regret-Free Life\u003c/em\u003e\u003c/a\u003e, and it made enough of an impression on me that I referenced it in my own book, \u003ca href=\"https://www.amazon.com/dp/1950967131/?tag=obliviousinve-20\"\u003e\u003cem\u003eMore Than Enough\u003c/em\u003e\u003c/a\u003e. And I found that I kept bringing up various topics from the book with friends, family, clients, and readers, because I was confident that they’d find the concepts to be helpful.\u003c/p\u003e\n\u003cp\u003eMore recently, I read Grumet’s new book: \u003ca href=\"https://www.amazon.com/Purpose-Code-meaning-maximize-happiness/dp/1804090859/?tag=obliviousinve-20\"\u003e\u003cem\u003eThe Purpose Code: How to Unlock Meaning, Maximize Happiness, and Leave a Lasting Legacy\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eVery broadly speaking, my experience of the book was that:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eI found that I did not enjoy it as much as I enjoyed his first book, yet\u003c/li\u003e\n\u003cli\u003eThe book provided me with actionable information, which I was already putting to use before I even finished reading. (Specifically, it helped me finally understand one aspect of my work that I don’t enjoy — and start formulating a plan for what to do about that.)\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eIn hindsight, I think those two observations are simply opposite sides of the same coin. The book was giving me information about a change I needed to make. That wasn’t exactly fun or comfortable, but it was helpful.\u003c/p\u003e\n\u003cp\u003eThe crux of Grumet’s new book is what he calls the “purpose paradox” — the simultaneous observations that 1) people who have a clear sense of purpose experience increased lifespan, health, and happiness, yet 2) more than 91% of people experience anxiety about being unsure of what their purpose is.\u003c/p\u003e\n\u003cp\u003eYou might then think that the bulk of Grumet’s book is spent giving advice about how to find your Purpose In Life. But it’s quite the opposite. The book’s core message is that the source of the anxiety mentioned above is the belief that we each need to have a clearly defined Life Purpose. That’s anxiety-provoking, because very few people have a clearly defined Life Purpose. The reality is, you probably \u003cem\u003ewon’t\u003c/em\u003e have a moment in your life when the clouds part and you experience an epiphany about exactly what you’re meant to be doing with your time here on earth.\u003c/p\u003e\n\u003cp\u003eGrumet argues instead for building what he calls “little p purpose” (as opposed to “Big P Purpose”) via smaller-scale pursuits. Maybe that means doing work that you find meaningful, even if it isn’t work that’s going to change the course of history. Or maybe that means diving into hobbies that you enjoy. Grumet argues that in both cases (work or hobbies) when you’re doing something that you really care about, you tend to develop relationships with other people who care about the same thing — and that helps to deepen the sense of purpose that’s linked to that activity for you.\u003c/p\u003e\n\u003cp\u003eIn any event, as a pretty “nuts and bolts” sort of person, a book about finding or building life purpose is a good bit outside the zone of what I typically read. But I found it helpful — useful advice, that I was able to put to work immediately. You might find the same thing, especially if it’s outside the zone of what you’d typically read as well.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/Purpose-Code-meaning-maximize-happiness/dp/1804090859/?tag=obliviousinve-20\"\u003e\u003cem\u003eThe Purpose Code: How to Unlock Meaning, Maximize Happiness, and Leave a Lasting Legacy\u003c/em\u003e\u003c/a\u003e by Jordan Grumet\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003e\n\n\u0026#34;A wonderful book that tells its readers, with simple logical explanations, our Boglehead Philosophy for successful investing.\u0026#34;\n- Taylor Larimore, author of \u003cem\u003eThe Bogleheads\u0026#39; Guide to Investing\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
