{
  "id": "410f55b9-8a2b-4915-b979-a8e2cf9b3689",
  "title": "Weekend Reading For Financial Planners (March 15–16)",
  "link": "https://feeds.feedblitz.com/~/914802185/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-March-%e2%80%93/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that Securities and Exchange Commission (SEC) Commissioner Hester Peirce suggested in a recent interview that she would like to see the SEC give advisors more leeway to provide customized solutions to clients (rather than feeling requiredRead More... The post Weekend Reading For Financial Planners (March 15–16) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 14 Mar 2025 18:00:03 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 32302,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that Securities and Exchange Commission (SEC) Commissioner Hester Peirce suggested in a recent interview that she would like to see the SEC give advisors more leeway to provide customized solutions to clients (rather than feeling required",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that Securities and Exchange Commission (SEC) Commissioner Hester Peirce suggested in a recent interview that she would like to see the SEC give advisors more leeway to provide customized solutions to clients (rather than feeling required to take a regulator-prescribed \"check-the-box\" approach) and would like to ease the compliance burden on smaller investment advisers (perhaps expanding the SEC's definition of small firm in the process) to reduce the entry and operational barriers for these firms. Which, if implemented under the new administration, could provide relief for investment advisers, particularly smaller firms that already have to balance compliance with client service, marketing, and the other duties that go into running a firm. Also in industry news this week: A recent survey finds that while advisors are increasingly using passive investment vehicles, many are taking the time to look beneath the hood to examine the makeup of different indexes in order to choose the best option for their clients A survey of advisors working at enterprise firms shows a significant increase in their adoption of artificial intelligence tools over the past year, with common use cases including predictive analytics, marketing, and summaries of meeting notes From there, we have several articles on Social Security: The Social Security Administration has reversed a policy enacted last year that limited overpayment 'clawbacks' to 10% of monthly benefits, which will have the effect of reducing the monthly payments of some Social Security recipients to $0 until the overpayment is recovered How the relationship between income and longevity could play a role in policy efforts to raise the Full Retirement Age in order to help shore up the Social Security system A white paper shows the impact (in dollar terms) for clients of various proposals to put Social Security on sustainable footing We also have a number of articles on practice management: As growth-driven (rather than retirement-driven) RIA M\u0026A activity increases, deal terms and cultural fit (and not 'just' headline valuations) are becoming increasingly relevant Why a \"curated cultural competition\" with limited suitors rather than an \"auction\" focused on price could better serve the interests of RIA buyers and sellers alike How firms can approach unsolicited acquisition offers, from analyzing the different compensation elements being offered to assessing whether the buyer shares a similar approach to financial planning We wrap up with three final articles, all about building better habits: 12 ways to build better habits, from breaking big goals down into smaller chunks to sharpening the ability to say \"no\" to opportunities that might distract from the goal at hand How \"commitment strategies\" can reduce the amount of willpower required to start and maintain new habits How running \"tiny experiments\" can help individuals build better habits while viewing their progress from a more impartial perspective Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. SEC Commissioner Calls For Greater Planning Flexibility For Advisers, Eased Compliance Burden On Small Firms (Tracey Longo | Financial Advisor) Financial advisors and other investment industry participants waited eagerly throughout 2024 for the results of the presidential election to have a better idea of what the regulatory environment might look like in the coming years. With the departure of SEC Chair Gary Gensler following President Trump's inauguration (alongside the appointment of acting Chair Mark Uyeda and the nomination of Paul Atkins to lead the regulator), industry observers are now considering what changes might be in store for 2025 and beyond. A frequent critic of Gensler's approach to regulation was SEC Commissioner Hester Peirce, who recently (during an interview at the Investment Adviser Association's annual compliance conference) laid out policies and regulatory approaches she would like to see the regulator pursue under the new administration. To start, she questioned what she considers to be the SEC's \"prescriptive\" approach, which she suggested could corner investment advisers into \"check-the-box\" type services, product offerings, and investment strategies, averring instead that advisers should have the freedom to tailor strategies to their clients' needs (rather than a regulator's preferences). Peirce also suggested that when it comes to enforcement actions, the SEC should focus on instances of substantive investor harm rather than technical enforcement of regulations (e.g., fines for violations of rules surrounding off-channel communication where clients weren't necessarily harmed). In addition, Peirce said that \"entry and operational barriers should be low for firms\" and that the SEC could consider implementing \"tiered\" regulations (e.g., exempting smaller firms from certain regulations or giving them more time to comply). In a similar vein, Peirce said the SEC could reconsider its approach to defining small firms (i.e., raising the current $25 million assets under management limit to be considered a small firm), which could allow more firms to fall under this umbrella (and potentially benefit from eased compliance burdens). In the end, while the SEC's ultimately agenda will be steered by Atkins (if he is confirmed), because Peirce's more firm-friendly approach to regulation tends to align with views previously expressed by Atkins and others in the administration (though she did note that firms would be unwise to assume they can now worry less about compliance requirements and do what they want), her comments could provide a preview of future actions the regulator might take. Which could ultimately provide relief for investment advisers, particularly smaller firms that already have to balance compliance with client service, marketing, and the other duties that go into running a firm (and perhaps encourage the formation of new firms, which could allow the industry to serve more clients!). Advisors Focusing More On Planning, Passive Investing: Cerulli (Edward Hayes | Financial Advisor) A trend in recent years in the financial advisory space has been a shift among many firms from focusing predominantly on investment management to offering a more comprehensive suite of services. This shift has been spurred on in part by the availability of products (from index funds to model portfolios) that make it easier for advisors to provide clients with access to diversified portfolios that require less time to manage than a more hands-on approach. Nevertheless, a recent white paper from research and consulting firm Cerulli Associates suggests that even advisors using 'passive' investments are actively assessing the features of different indexes and fund offerings. Advisors surveyed with at least 10% of their assets in ETFs said they expect to allocate an average of 49% of their assets to index-based or passive strategies in the next two years (up from 46% in 2024) alongside 50% allocations to actively managed ETFs (which are often used to replace less tax efficient actively managed mutual funds). However, advisors using index ETFs don't necessarily view them as commodities, as 82% indicated that the index design was most important when selecting index-based products, demonstrating an interest in ensuring that the makeup of the underlying index (which can vary significantly across indexes covering the same asset class) reflects the needs of their clients and fits into their overall portfolio. The paper suggested that an advisor's ability to better understand the indexes they are studying and selecting appropriate funds accordingly could serve as a differentiator compared to human or robo-advisors that might be less discerning when choosing among funds that target similar goals. In sum, while index products are often thought of as being more similar than their actively managed counterparts, conducting due diligence into the differences in how they are constructed could allow them to reap the time-saving advantages of building portfolios with index products while ensuring that the funds chosen meet the advisor's goals for that portion of their client's portfolio. Enterprise Advisor Survey Finds Rapid Attitude Shift On AI (Michael Fischer | ThinkAdvisor) Since ChatGPT burst onto the scene in late 2022, many financial advisors have been curious about the potential use cases for it and other generative Artificial Intelligence (AI) tools. However, given the relatively new nature of this technology (and software that incorporates it), some advisors might have initially taken a cautious approach to its adoption, perhaps concerned whether its use might put client data in danger or lead to regulatory scrutiny. Nonetheless, a recent survey of advisors working at enterprise firms released by AdvisorTech platform Advisor360 indicates that many advisors are warming to this technology, with 85% of respondents saying that AI is helpful to their practice (up from 64% last year) and 76% indicating that they have experienced immediate benefits from generative AI-enabled tools. The most common use cases cited by advisors included predictive analytics, marketing, and summarizing meeting notes (while only 29% indicating that they use AI-enabled tools to develop personalized financial plans). Firms also appear to be formalizing their use of AI tools, with 82% of advisor respondents indicating their firms have formal policies around generative AI (up from only 47% that did in the previous year's survey). And while some observers wondered whether generative AI might pose a threat to human advisors' businesses, this appears to be a declining worry for advisors (perhaps as they recognize the limitations of the current generation of AI-powered tools?) as only 8% of advisors surveyed said they consider generative AI to be a potential threat to their livelihood, down from 21% last year. Altogether, this survey indicates that there is positive momentum when it comes to (at least enterprise) advisor adoption of AI-powered software. At the same time, given the growing catalog of AI tools (and the potential for them to expand across additional AdvisorTech categories), the ultimate effects of this new technology might not be seen until several years down the line. (Gregory Korte | Bloomberg News) Given the enormity of the Social Security system, some mistakes are inevitable when it comes to paying out the appropriate benefits to tens of millions of recipients. Sometimes, this can result in individuals receiving overpayment, often due to a mistake on the part of the Social Security Administration. While the government can make corrections for the individual's future payments, this situation also raises the question of how it should 'claw back' the overpayments that have already been made (particularly if the recipient cannot afford to pay it back in a lump sum). Last year, the Biden-era Social Security Administration eased the rules surrounding these repayments, including a cap on the benefit withholding rate at 10% (down from 100%, in an effort to reduce the budgetary strain on those who count on their monthly benefits for rent and other expenses). However, current acting Social Security commissioner Leland Dudek announced last week that this policy will be reversed and that the government will revert back to full withholding (meaning that some Social Security recipients will see their monthly benefits temporarily reduced to $0), which will be applied to benefits checks beginning March 27 (and is expected to save the Social Security trust fund $7 billion in the next decade). Notably, though, the withholding rate for overpayments of Supplemental Security Income (which supports people with disabilities and older adults with little or no income) will remain at 10%, continuing relief for this group. In addition, individuals can contact Social Security to appeal the overpayment decision or the amount or to request a lower rate if they can't afford full recovery of their overpayment. Also, legislation introduced in the House of Representatives this week would limit the lookback period for overpayment errors to 10 years, which could limit the size of payments clawed back if the error persisted for more than a decade. Ultimately, the key point is that advisory clients who are subject to the recovery of Social Security overpayments (now and in the future) could face a sharp reduction in their monthly benefit checks. Which could prompt advisors to meet with these clients to determine the impact on their monthly cash flow (perhaps requiring additional portfolio withdrawals?) and whether they might be eligible to appeal the overpayment decision. How The Relationship Between Income And Longevity Could Impact A Potential Change To Social Security's Full Retirement Age (Alicia Munnell | Center For Retirement Research At Boston College) Given the expected exhaustion of the Social Security trust fund in approximately 2035 (at which point the system would be able to pay out 83% of scheduled benefits), policymakers and analysts have considered a variety of proposals to return the system to solid footing. One policy that has been floated would be (given an increase in longevity over time) to raise the Full Retirement Age (FRA) for Social Security claiming purposes (which would support the system's health by keeping individuals in the workforce longer and reducing the years they receive payments). However, Munnell suggests that a universal increase to the FRA could end up punishing lower-income individuals relatively more than their higher-income counterparts. To start, an extensive body of evidence has demonstrated a positive correlation between life expectancy and income (with an analysis by the Social Security Administration finding that men born in 1960 [who reach age 62] with Average Indexed Monthly Earnings in the highest quintile are expected to live to an average of age 87.6, while their counterparts in the lowest income quintile are only expected to live to age 77.3). Further, this gap has widened over time, with an 8.4-year gap for men born in 1930 compared to the 10.3-year gap today. Which means that increasing the FRA for all workers would result in a larger proportional reduction in lifetime benefits for lower-income workers (given their shorter life expectancies) compared to their higher-income counterparts. With this in mind, another option could be to only increase the FRA for relatively higher-income workers. For instance, a proposal by economist Wendell Primus would only increase the FRA for individuals above the 60th percentile of income (with the highest quintile seeing an increase in their FRA to 70), which would eliminate 16% of Social Security's 75-year deficit. However, a key question under this proposal would be when to determine an individual's relative income for the purpose of determining their retirement date (as it would be an unfortunate surprise for an individual to find out that their FRA was pushed back in the year or two before they reached their planned retirement age!). In the end, while increasing the FRA could be one part of a package to shore up the Social Security system, implementing it would likely require a deft touch to ensure that the policy achieves its intended effects without creating unintended consequences. (John Manganaro | ThinkAdvisor) Given frequent media write-ups on the health of the Social Security system (guilty!), financial advisors and many of their clients are likely aware that policy action almost certainly will be needed in the coming years to avoid the exhaustion of the Social Security trust fund and the reduction in benefits that would ensue (though, contrary to the beliefs of many individuals, the system would continue to be able to pay out the vast majority of scheduled benefits for decades to come as most of the system's revenues come from ongoing payroll tax payments). However, many clients might not be aware of how much of a financial hit they might take depending on the potential policies that might be enacted and their unique situations. To give advisors and consumers an idea of the potential impact of various policy options, a white paper from HealthView Services looks at the impact of different choices on a hypothetical mixed-gender \"mass affluent\" couple with $175,000 in household income who is 25 years away from retirement and an \"average income\" couple with $110,000 in household income that is 10 years away from retirement (in their model, both couples claim Social Security benefits when the older spouse turns 65 and have a life expectancy of 86 [husband] and 90 [wife]). The paper finds that these couples would see the greatest loss in benefits from an across-the-board 21% reduction in benefits in 2033 resulting from the exhaustion of the trust fund (ranging from $908,000 in lost lifetime benefits for the mass affluent couple and $252,000 for the average income couple). Given the likely political consequences (and impact on the lifestyles of many seniors) that would come from an across-the-board benefit reduction, the paper also looks at the impact of different policy levers that Congress might pull as part of a broader package to keep Social Security on stable footing. For example, a one-year delay to Full Retirement Age would lead to a $325,000 reduction in lifetime benefits for the mass affluent couple claiming at age 65, while the average income couple claiming at 65 would lose $249,000. Alternatively, policymakers could choose to enact measures on the revenue side; for instance, raising the Social Security portion of the payroll tax from 12.4% to 16.0% would fully address Social Security's shortfall but would reduce pre-retirement net income by $133,000 for the mass affluent couple and $22,000 for the average-income couple. Another option would be to eliminate the maximum taxable earnings limit for high earners (from the current $176,100), which would impact higher-earning individuals (who could see significantly more of their income exposed to Social Security taxation). For example, the paper estimates that a couple with a combined $500,000 in income would contribute an additional $250,000 in pre-tax income over 25 years. In sum, while policymakers have yet to act to put Social Security on sound financial footing, this paper gives advisors and their clients an idea of the potential financial burden they might face under different scenarios (with younger and higher-income individuals experiencing a larger burden in absolute dollar terms), perhaps providing advisors with different options to 'stress test' their clients' financial plans based on different policy outcomes that might come to fruition! As Growth-Driven RIA M\u0026A Increases, Deal Terms Come To Forefront (Karen DeMasters | Financial Advisor) RIA Mergers and Acquisitions (M\u0026A) activity is often discussed in terms of retiring firm founders seeking external buyers for their firms, providing an exit (and deal compensation to support their retirements) and a new home for the firm's clients and staff. However, in recent years many founders have looked to sell not with the intention of exiting the business, but rather to seek to more effectively grow their practice within a larger organization. In this environment (which has been partially fueled by an increase in Private Equity (PE)-funded RIA aggregators), securing attractive deal terms and finding an appropriate cultural fit are paramount for sellers. For instance, in terms of deal terms, many PE-backed deals include an equity component in deal compensation, which suggests that finding a buyer with a proven track record of growth and multiple avenues for gaining new client assets (e.g., not just relying on a custodial referral channel) could increase the chances of experiencing a positive financial outcome. Further, given that founders looking to sell for growth purposes are likely to stay with the combined firm for an extended period, finding a cultural match (e.g., in terms of the buyer's approach to clients, team structure, technology, and its business philosophy) can increase the chances that the selling founder will achieve their aims over the long run. Ultimately, the key point is that while a retiring founder might first look to headline valuation numbers when considering transaction partners (though ensuring their team and clients will fit in well with the buying firm is an important consideration as well), for selling founders seeking growth opportunities within a larger firm, moving beyond the valuation to consider the type of compensation being offered by different suitors and how their firm would fit in with the larger organization are particularly important considerations. Seeking A \"Curated Cultural Competition\" Rather Than A Bidding War In RIA M\u0026A (Allen Darby | Citywire RIA) When selling a tangible item (e.g., a work of art), an auction with many bidders can often result in the highest sale price (usually in cash) for the seller, who might not care much about what the purchaser plans to do with the item up for sale (unless it has deep personal meaning). However, when it comes to selling a financial advisory firm, because the type of compensation (in addition to the headline valuation), as well as the culture of the buyer, can be very important to the seller (who typically not only seeks to maximize their own remuneration, but also ensure that their staff and clients will fit in well within the new firm). Nonetheless, Darby (the CEO of sell-side M\u0026A advisory firm Alaris Acquisitions) suggests that the predominant approach for RIA sales today is more reflective of a multi-bidder auction focused on headline valuations rather than a more in-depth inquiry into the culture of interested buyers. Which, he suggests, invites the potential for sellers to be disappointed if they don't conduct (or receive from their deal advisor) a thorough evaluation of the deal terms proposed by different prospective buyers (e.g., an offer with a seemingly attractive valuation might include only a small amount of upfront cash and unrealistic performance hurdles to achieve the full valuation). Further, with many potential buyers bidding largely on price, sellers do not necessarily have the opportunity to get into the culture of the various firms vying for the deal. Given these challenges, Darby suggests an alternate approach of holding a \"curated cultural competition\" where the only bidders are those who have been found to be a strong strategic and cultural fit for the selling firm. Not only could this provide the seller with more confidence that the buyer they choose will be a good cultural fit for their firm, but this approach also could give sellers greater incentive to offer a more attractive valuation and deal terms (as they are able to conduct deeper due diligence into the selling firm before making an offer and have greater confidence that the acquisition would be positive for their bottom line). In the end, while it makes logical sense that having more potential buyers for a firm could extract the highest valuation, gaining in-depth knowledge into (fewer) bidders' offers and cultures could prove more valuable to selling firm owners and ultimately lead to a more satisfying result for themselves as well as for their staff and clients. How Firms Can Evaluate Inbound Acquisition Offers (Dan Moisand | Financial Advisor) While some firms put themselves on the market for sale (whether the founder is retiring or they are seeking to grow within a larger firm), many successful firms will field calls from potential acquirors interested in a deal. And while the thought of achieving an 'exit' might seem attractive to founders, often the 'devil is in the details', as Moisand's firm has found out after evaluating (and turning down) multiple acquisition offers. For instance, given that most acquisitions are paid for with cash, client retention payments, growth payments, and/or stock in the buyer, the combination of these elements could make an offer more or less attractive to the selling firm. For instance, when client retention payments make up a significant part of the total consideration, sellers will be under significant pressure to ensure their clients stick around with the new firm (for the amount of time [often one to three years] outlined in the deal terms), which could be challenging if the new firm doesn't offer the same levels of technology and customer service as the selling firm. Retention payments could also conflict with growth targets, as a focused pursuit of new client growth (to hit deal targets) could take time away from current clients and lead some of them to leave the new firm (serving as a hit to retention payments). And when it comes to stock in the buyer, sellers will want to know the class of stock they will receive as well as the rights associated with it, as well as the dividend or distribution rate and the liquidity of these shares (which will provide them with more information on the risk and potential of this deal element). Altogether, while firms might receive offers that look attractive on the surface, the deal terms can reveal whether taking it might be a good financial decision for the selling owner. Further, looking beyond deal terms, sellers will likely also be interested in the cultural fit between the two firms (particularly if the selling owner(s) plan to stick with the new firm for years to come), particularly when it comes to their approach to providing advice (e.g., whether they are planning or product sales focused), which could have major impacts both on the seller and the firm they've worked hard to build! 12 Ways To Build Better Habits (Ryan Holiday) Whether it's a New Year's Resolution or a mid-year decision to make a change, habits play a major role in our lives. But as many people who have tried to pursue an audacious goal or stop a long-standing 'bad' habit know, being able to follow through with these changes and maintain them for the long run can be quite challenging. With this in mind, Holiday offers a series of tips for establishing and maintaining better habits. To start, many people resolve to be more productive but find themselves distracted. With this in mind, he suggests taking on the most important tasks at the beginning of the day before interruptions and fatigue can set in. Similarly, creating or removing friction can make the habit more 'automatic' (e.g., for those who want to drink more water, always keeping a refillable water bottle around). In addition, while an individual might set a 'big' goal, breaking it down into smaller chunks can make it feel more manageable (e.g., if one's goal is to read 50 books this year, commit to the [very achievable goal of] reading one page a day rather than trying to take on the full goal at once [which might be much more challenging]). Other ways to achieve goals and build better habits center on the amount that's on one's plate on a daily basis. For instance, rather than trying to take on as many projects or goals as possible (which can suck one's willpower), focusing on the highest priorities can increase the likelihood that they will be achieved. On a related note, mastering the ability to say 'no' when (seemingly attractive) opportunities arise can help prevent distractions from the habits one is trying to work on. Further, while habits might be personal, they don't have to be pursued alone, as finding a friend or colleague who wants to pursue a similar goal can create a sense of camaraderie and accountability. Ultimately, the key point is that establishing and maintaining better habits is not just a matter of personal willpower, but also the broader context in which these goals are being pursued, whether it's physical space, one's to-do list, or social relationships that can support these changes! Using Commitment Strategies To Create Better Habits (Tim Harford) Characteristics such as \"grit\" and \"determination\" are often viewed as key determinants for success, demonstrating an individual's ability to take on challenges through sheer willpower. But as many a failed New Year's Resolution can attest to, few individuals have an unlimited well of willpower to tap into. One potential way to reduce the amount of willpower needed to follow through on a desired habit or goal is to employ \"commitment strategies\", which can make it easier to complete a task (or harder to engage in a bad habit). For instance, if your goal is to run more often, joining a running club that meets at a certain time each week serves as a commitment that will encourage you to attend even when you might otherwise not feel like running (less you face the judgment of your peers in the club). On the opposite end of the spectrum, if your goal is to eat less junk food, keeping tempting treats out of the house can make it much less likely that you will consume it. There are even websites and apps (e.g., Stickk) that will help you commit to goals by having you put money on the table, only getting it back if the goal is completed. In the end, while 'grit' is no doubt important in many facets of life, it can be hard to rely on this trait to achieve the range of goals you might set for yourself. Which suggests that using commitment strategies to support these goals can make it more likely that they will be achieved (and perhaps open the door for completing more of them?). How \"Tiny Experiments\" Can Lead To Big Changes (Anne-Laure Le Cunff | Next Big Idea Club) Running experiments is a key part of making scientific progress, even as scientists recognize that not every experiment will be successful. And while other individuals might not be trying to find the next medical breakthrough, Le Cunff suggests that running \"tiny experiments\" in everyday life can help lead to positive personal change. For instance, many individuals might make major goals (e.g., health, career) but not know where to start. One option is to run a \"tiny experiment\" by to taking on a certain task for a certain period of time (e.g., someone who wants to start a blog might decide to sit down to write for 15 minutes everyday at 9 a.m. for the next month). The key, though, is not necessarily whether the experiment is 'completed', but rather to reflect on how it went and what they might be able to improve on going forward. One way to do this is by engaging in a \"Plus Minus Next\" exercise, where the 'experimenter' writes down what 'worked' in the \"plus\" column, what didn't work in the \"minus\" column and what you'll try during the next week or month in the \"next\" column. In this way they can better assess the results of the \"experiment\" as an impartial observer rather than criticizing themselves for perceived personal failings if it wasn't successful. Further, by sharing these with others, they can receive feedback and questions that can help them make additional changes to the \"experiments\" (and hopefully achieve even better results). In sum, just as a scientist might try to learn from the successes or failures of an experiment, individuals have the ability to do the same in their daily lives. Which could ultimately lead to major professional or personal breakthroughs! We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2024/05/Social-Image-Blog-Article-Weekend-Reading-2024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; – this week\u0026#39;s edition kicks off with the news that Securities and Exchange Commission (SEC) Commissioner Hester Peirce suggested in a recent interview that she would like to see the SEC give advisors more leeway to provide customized solutions to clients (rather than feeling required to take a regulator-prescribed \u0026#34;check-the-box\u0026#34; approach) and would like to ease the compliance burden on smaller investment advisers (perhaps expanding the SEC\u0026#39;s definition of small firm in the process) to reduce the entry and operational barriers for these firms. Which, if implemented under the new administration, could provide relief for investment advisers, particularly smaller firms that already have to balance compliance with client service, marketing, and the other duties that go into running a firm.\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA recent survey finds that while advisors are increasingly using passive investment vehicles, many are taking the time to look beneath the hood to examine the makeup of different indexes in order to choose the best option for their clients\u003c/li\u003e\n\u003cli\u003eA survey of advisors working at enterprise firms shows a significant increase in their adoption of artificial intelligence tools over the past year, with common use cases including predictive analytics, marketing, and summaries of meeting notes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on Social Security:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe Social Security Administration has reversed a policy enacted last year that limited overpayment \u0026#39;clawbacks\u0026#39; to 10% of monthly benefits, which will have the effect of reducing the monthly payments of some Social Security recipients to $0 until the overpayment is recovered\u003c/li\u003e\n\u003cli\u003eHow the relationship between income and longevity could play a role in policy efforts to raise the Full Retirement Age in order to help shore up the Social Security system\u003c/li\u003e\n\u003cli\u003eA white paper shows the impact (in dollar terms) for clients of various proposals to put Social Security on sustainable footing\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on practice management:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAs growth-driven (rather than retirement-driven) RIA M\u0026amp;A activity increases, deal terms and cultural fit (and not \u0026#39;just\u0026#39; headline valuations) are becoming increasingly relevant\u003c/li\u003e\n\u003cli\u003eWhy a \u0026#34;curated cultural competition\u0026#34; with limited suitors rather than an \u0026#34;auction\u0026#34; focused on price could better serve the interests of RIA buyers and sellers alike\u003c/li\u003e\n\u003cli\u003eHow firms can approach unsolicited acquisition offers, from analyzing the different compensation elements being offered to assessing whether the buyer shares a similar approach to financial planning\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with three final articles, all about building better habits:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e12 ways to build better habits, from breaking big goals down into smaller chunks to sharpening the ability to say \u0026#34;no\u0026#34; to opportunities that might distract from the goal at hand\u003c/li\u003e\n\u003cli\u003eHow \u0026#34;commitment strategies\u0026#34; can reduce the amount of willpower required to start and maintain new habits\u003c/li\u003e\n\u003cli\u003eHow running \u0026#34;tiny experiments\u0026#34; can help individuals build better habits while viewing their progress from a more impartial perspective\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" sizes=\"(max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"SEC Commissioner Calls For Flexibility\" id=\"sec-commissioner-calls-for-greater-planning-flexibility-for-advisers-eased-compliance-burden-on-small-firms\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/sec-commissioner-warns-against--check-the-box--advisor-oversight-81625.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eSEC Commissioner Calls For Greater Planning Flexibility For Advisers, Eased Compliance Burden On Small Firms\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Tracey Longo | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFinancial advisors and other investment industry participants waited eagerly throughout 2024 for the results of the presidential election to have a better idea of what the regulatory environment might look like in the coming years. With the departure of SEC Chair Gary Gensler following President Trump\u0026#39;s inauguration (alongside the appointment of acting Chair Mark Uyeda and \u003ca href=\"https://www.fa-mag.com/news/trump-picks-atkins--ex-sec-commissioner--to-succeed-gensler-80561.html\"\u003ethe nomination of Paul Atkins to lead the regulator\u003c/a\u003e), industry observers are now considering what changes might be in store for 2025 and beyond.\u003c/p\u003e\n\u003cp\u003eA frequent critic of Gensler\u0026#39;s approach to regulation was SEC Commissioner Hester Peirce, who recently (during an interview at the Investment Adviser Association\u0026#39;s annual compliance conference) laid out policies and regulatory approaches she would like to see the regulator pursue under the new administration. To start, she questioned what she considers to be the SEC\u0026#39;s \u0026#34;prescriptive\u0026#34; approach, which she suggested could corner investment advisers into \u0026#34;check-the-box\u0026#34; type services, product offerings, and investment strategies, averring instead that advisers should have the freedom to tailor strategies to their clients\u0026#39; needs (rather than a regulator\u0026#39;s preferences). Peirce also suggested that when it comes to enforcement actions, the SEC should focus on instances of substantive investor harm rather than technical enforcement of regulations (e.g., fines for violations of rules surrounding off-channel communication where clients weren\u0026#39;t necessarily harmed).\u003c/p\u003e\n\u003cp\u003eIn addition, Peirce said that \u0026#34;entry and operational barriers should be low for firms\u0026#34; and that the SEC could consider implementing \u0026#34;tiered\u0026#34; regulations (e.g., exempting smaller firms from certain regulations or giving them more time to comply). In a similar vein, Peirce said the SEC could reconsider its approach to defining small firms (i.e., raising the current $25 million assets under management limit to be considered a small firm), which could allow more firms to fall under this umbrella (and potentially benefit from eased compliance burdens).\u003c/p\u003e\n\u003cp\u003eIn the end, while the SEC\u0026#39;s ultimately agenda will be steered by Atkins (if he is confirmed), because Peirce\u0026#39;s more firm-friendly approach to regulation tends to align with views previously expressed by Atkins and others in the administration (though \u003ca href=\"https://www.wealthmanagement.com/regulation-compliance/peirce-says-sec-staff-cuts-are-going-to-be-hard-for-agency\"\u003es\u003c/a\u003ehe did note that firms would be unwise to assume they can now worry less about compliance requirements and do what they want), her comments could provide a preview of future actions the regulator might take. Which could ultimately provide relief for investment advisers, particularly smaller firms that already have to balance compliance with client service, marketing, and the other duties that go into running a firm (and perhaps encourage the formation of new firms, which could allow the industry to serve more clients!).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advisors Focusing More On Planning\" id=\"advisors-focusing-more-on-planning-passive-investing-cerulli\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/cerulli-finds-growing-interest-among-advisors-in-passive-funds-81623.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eAdvisors Focusing More On Planning, Passive Investing: Cerulli\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Edward Hayes | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA trend in recent years in the financial advisory space has been a shift among many firms from focusing predominantly on investment management to \u003ca href=\"https://www.kitces.com/blog/financial-comprehensive-plans-advisor-time-income-revenue-outsourcing/\"\u003eoffering a more comprehensive suite of services\u003c/a\u003e. This shift has been spurred on in part by the availability of products (from index funds to model portfolios) that make it easier for advisors to provide clients with access to diversified portfolios that require less time to manage than a more hands-on approach.\u003c/p\u003e\n\u003cp\u003eNevertheless, a recent \u003ca href=\"https://www.cerulli.com/resource/redefining-the-role-of-index-providers\"\u003ewhite paper from research and consulting firm Cerulli Associates\u003c/a\u003e suggests that even advisors using \u0026#39;passive\u0026#39; investments are actively assessing the features of different indexes and fund offerings. Advisors surveyed with at least 10% of their assets in ETFs said they expect to allocate an average of 49% of their assets to index-based or passive strategies in the next two years (up from 46% in 2024) alongside 50% allocations to actively managed ETFs (which are often used to replace less tax efficient actively managed mutual funds). However, advisors using index ETFs don\u0026#39;t necessarily view them as commodities, as 82% indicated that the index design was most important when selecting index-based products, demonstrating an interest in ensuring that the makeup of the underlying index (which can vary significantly across indexes covering the same asset class) reflects the needs of their clients and fits into their overall portfolio. The paper suggested that an advisor\u0026#39;s ability to better understand the indexes they are studying and selecting appropriate funds accordingly could serve as a differentiator compared to human or robo-advisors that might be less discerning when choosing among funds that target similar goals.\u003c/p\u003e\n\u003cp\u003eIn sum, while index products are often thought of as being more similar than their actively managed counterparts, conducting due diligence into the differences in how they are constructed could allow them to reap the time-saving advantages of building portfolios with index products while ensuring that the funds chosen meet the advisor\u0026#39;s goals for that portion of their client\u0026#39;s portfolio.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Survey Finds Rapid Attitude Shift On AI\" id=\"enterprise-advisor-survey-finds-rapid-attitude-shift-on-ai\"\u003e\u003cspan\u003e\u003ca href=\"https://www.thinkadvisor.com/2025/02/26/new-advisor-survey-finds-rapid-attitude-shift-on-ai/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eEnterprise Advisor Survey Finds Rapid Attitude Shift On AI\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Michael Fischer | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSince ChatGPT burst onto the scene in late 2022, many financial advisors have been curious about the \u003ca href=\"https://www.kitces.com/blog/156-michael-kitces-carl-richards-chat-gpt-financial-advisor-ai-technology-tools/\"\u003epotential use cases for it and other generative Artificial Intelligence (AI) tools\u003c/a\u003e. However, given the relatively new nature of this technology (and software that incorporates it), some advisors might have initially taken a cautious approach to its adoption, \u003ca href=\"https://www.kitces.com/blog/ai-artificial-intelligence-chatgpt-fiduciary-rule-advisor-technology/\"\u003eperhaps concerned whether its use might put client data in danger or lead to regulatory scrutiny\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNonetheless, \u003ca href=\"https://www.advisor360.com/2025-connected-wealth-report\"\u003ea recent survey of advisors working at enterprise firms released by AdvisorTech platform Advisor360\u003c/a\u003e indicates that many advisors are warming to this technology, with 85% of respondents saying that AI is helpful to their practice (up from 64% last year) and 76% indicating that they have experienced immediate benefits from generative AI-enabled tools. The most common use cases cited by advisors included predictive analytics, marketing, and summarizing meeting notes (while only 29% indicating that they use AI-enabled tools to develop personalized financial plans). Firms also appear to be formalizing their use of AI tools, with 82% of advisor respondents indicating their firms have formal policies around generative AI (up from only 47% that did in the previous year\u0026#39;s survey). And while some observers wondered whether generative AI might pose a threat to human advisors\u0026#39; businesses, this appears to be a declining worry for advisors (perhaps as they \u003ca href=\"https://www.kitces.com/blog/chatgpt-ai-financial-advisor-trust-writing-calculator-meeting-notes-client-emails/\"\u003erecognize the limitations of the current generation of AI-powered tools\u003c/a\u003e?) as only 8% of advisors surveyed said they consider generative AI to be a potential threat to their livelihood, down from 21% last year.\u003c/p\u003e\n\u003cp\u003eAltogether, this survey indicates that there is positive momentum when it comes to (at least enterprise) advisor adoption of AI-powered software. At the same time, given the growing catalog of AI tools (and the potential for them to expand across additional \u003ca href=\"https://fintech.kitces.com/\"\u003eAdvisorTech categories\u003c/a\u003e), \u003ca href=\"https://www.kitces.com/blog/generative-ai-artificial-intelligence-advisor-technology-chat-gpt-software-innovation/\"\u003ethe ultimate effects of this new technology might not be seen until several yea\u003c/a\u003ers down the line.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Gregory Korte | Bloomberg News)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven the enormity of the Social Security system, some mistakes are inevitable when it comes to paying out the appropriate benefits to tens of millions of recipients. Sometimes, this can result in individuals receiving overpayment, often due to a mistake on the part of the Social Security Administration. While the government can make corrections for the individual\u0026#39;s future payments, this situation also raises the question of how it should \u0026#39;claw back\u0026#39; the overpayments that have already been made (particularly if the recipient cannot afford to pay it back in a lump sum).\u003c/p\u003e\n\u003cp\u003eLast year, the Biden-era Social Security Administration eased the rules surrounding these repayments, including a cap on the benefit withholding rate at 10% (down from 100%, in an effort to reduce the budgetary strain on those who count on their monthly benefits for rent and other expenses). However, current acting Social Security commissioner Leland Dudek announced last week that this policy will be reversed and that the government will revert back to full withholding (meaning that some Social Security recipients will see their monthly benefits temporarily reduced to $0), which will be applied to benefits checks beginning March 27 (and is expected to save the Social Security trust fund $7 billion in the next decade). Notably, though, the withholding rate for overpayments of Supplemental Security Income (which supports people with disabilities and older adults with little or no income) will remain at 10%, continuing relief for this group. In addition, \u003ca href=\"https://www.ssa.gov/forms/ssa-632.html\"\u003eindividuals can contact Social Security to appeal the overpayment decision or the amount or to request a lower rate\u003c/a\u003e if they can\u0026#39;t afford full recovery of their overpayment. Also, legislation introduced in the House of Representatives this week would limit the lookback period for overpayment errors to 10 years, which could limit the size of payments clawed back if the error persisted for more than a decade.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that advisory clients who are subject to the recovery of Social Security overpayments (now and in the future) could face a sharp reduction in their monthly benefit checks. Which could prompt advisors to meet with these clients to determine the impact on their monthly cash flow (perhaps requiring additional portfolio withdrawals?) and whether they might be eligible to appeal the overpayment decision.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Relationship Between Income, Longevity\" id=\"how-the-relationship-between-income-and-longevity-could-impact-a-potential-change-to-social-securitys-full-retirement-age\"\u003e\u003cspan\u003e\u003ca href=\"https://crr.bc.edu/this-trend-has-important-implications-for-social-securitys-full-retirement-age/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eHow The Relationship Between Income And Longevity Could Impact A Potential Change To Social Security\u0026#39;s Full Retirement Age\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Alicia Munnell | Center For Retirement Research At Boston College)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven the \u003ca href=\"https://www.kitces.com/blog/social-security-sustainability-trust-fund-benefits-taxes-legislation-financial-planning/\"\u003eexpected exhaustion of the Social Security trust fund in approximately 2035\u003c/a\u003e (at which point the system would be able to pay out 83% of scheduled benefits), policymakers and analysts have considered a variety of proposals to return the system to solid footing. One policy that has been floated would be (given an increase in longevity over time) to raise the Full Retirement Age (FRA) for Social Security claiming purposes (which would support the system\u0026#39;s health by keeping individuals in the workforce longer and reducing the years they receive payments). However, Munnell suggests that a universal increase to the FRA could end up punishing lower-income individuals relatively more than their higher-income counterparts.\u003c/p\u003e\n\u003cp\u003eTo start, \u003ca href=\"https://www.congress.gov/crs-product/R44846\"\u003ean extensive body of evidence\u003c/a\u003e has demonstrated a positive correlation between life expectancy and income (with \u003ca href=\"https://www.ssa.gov/OACT/solvency/HoyerPrimus_20250103.pdf\"\u003ean analysis by the Social Security Administration\u003c/a\u003e finding that men born in 1960 [who reach age 62] with \u003ca href=\"https://www.ssa.gov/oact/cola/Benefits.html\"\u003eAverage Indexed Monthly Earnings\u003c/a\u003e in the highest quintile are expected to live to an average of age 87.6, while their counterparts in the lowest income quintile are only expected to live to age 77.3). Further, this gap has widened over time, with an 8.4-year gap for men born in 1930 compared to the 10.3-year gap today. Which means that increasing the FRA for all workers would result in a larger proportional reduction in lifetime benefits for lower-income workers (given their shorter life expectancies) compared to their higher-income counterparts.\u003c/p\u003e\n\u003cp\u003eWith this in mind, another option could be to only increase the FRA for relatively higher-income workers. For instance, a \u003ca href=\"https://www.brookings.edu/articles/fixing-social-security-blueprint-for-a-bipartisan-solution/\"\u003eproposal\u003c/a\u003e by economist Wendell Primus would only increase the FRA for individuals above the 60th percentile of income (with the highest quintile seeing an increase in their FRA to 70), which would eliminate 16% of Social Security\u0026#39;s 75-year deficit. However, a key question under this proposal would be when to determine an individual\u0026#39;s relative income for the purpose of determining their retirement date (as it would be an unfortunate surprise for an individual to find out that their FRA was pushed back in the year or two before they reached their planned retirement age!).\u003c/p\u003e\n\u003cp\u003eIn the end, while increasing the FRA could be one part of a package to shore up the Social Security system, implementing it would likely require a deft touch to ensure that the policy achieves its intended effects without creating unintended consequences.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(John Manganaro | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven frequent media write-ups on the health of the Social Security system (\u003ca href=\"https://www.kitces.com/blog/social-security-sustainability-trust-fund-benefits-taxes-legislation-financial-planning/\"\u003eguilty!\u003c/a\u003e), financial advisors and many of their clients are likely aware that policy action almost certainly will be needed in the coming years to avoid the exhaustion of the Social Security trust fund and the reduction in benefits that would ensue (though, contrary to the beliefs of many individuals, the system would continue to be able to pay out the vast majority of scheduled benefits for decades to come as most of the system\u0026#39;s revenues come from ongoing payroll tax payments). However, many clients might not be aware of how much of a financial hit they might take depending on the potential policies that might be enacted and their unique situations.\u003c/p\u003e\n\u003cp\u003eTo give advisors and consumers an idea of the potential impact of various policy options, a \u003ca href=\"https://hvsfinancial.com/wp-content/uploads/2024/10/funding-social-security-October-2024.pdf\"\u003ewhite paper from HealthView Services\u003c/a\u003e looks at the impact of different choices on a hypothetical mixed-gender \u0026#34;mass affluent\u0026#34; couple with $175,000 in household income who is 25 years away from retirement and an \u0026#34;average income\u0026#34; couple with $110,000 in household income that is 10 years away from retirement (in their model, both couples claim Social Security benefits when the older spouse turns 65 and have a life expectancy of 86 [husband] and 90 [wife]). The paper finds that these couples would see the greatest loss in benefits from an across-the-board 21% reduction in benefits in 2033 resulting from the exhaustion of the trust fund (ranging from $908,000 in lost lifetime benefits for the mass affluent couple and $252,000 for the average income couple).\u003c/p\u003e\n\u003cp\u003eGiven the likely political consequences (and impact on the lifestyles of many seniors) that would come from an across-the-board benefit reduction, the paper also looks at the impact of different policy levers that Congress might pull as part of a broader package to keep Social Security on stable footing. For example, a one-year delay to Full Retirement Age would lead to a $325,000 reduction in lifetime benefits for the mass affluent couple claiming at age 65, while the average income couple claiming at 65 would lose $249,000.\u003c/p\u003e\n\u003cp\u003eAlternatively, policymakers could choose to enact measures on the revenue side; for instance, raising the Social Security portion of the payroll tax from 12.4% to 16.0% would fully address Social Security\u0026#39;s shortfall but would reduce pre-retirement net income by $133,000 for the mass affluent couple and $22,000 for the average-income couple. Another option would be to eliminate the maximum taxable earnings limit for high earners (from the current $176,100), which would impact higher-earning individuals (who could see significantly more of their income exposed to Social Security taxation). For example, the paper estimates that a couple with a combined $500,000 in income would contribute an additional $250,000 in pre-tax income over 25 years.\u003c/p\u003e\n\u003cp\u003eIn sum, while policymakers have yet to act to put Social Security on sound financial footing, this paper gives advisors and their clients an idea of the potential financial burden they might face under different scenarios (with younger and higher-income individuals experiencing a larger burden in absolute dollar terms), perhaps providing advisors with different options to \u0026#39;stress test\u0026#39; their clients\u0026#39; financial plans based on different policy outcomes that might come to fruition!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Growth-Driven RIA M\u0026amp;A Increases\" id=\"as-growthdriven-ria-ma-increases-deal-terms-come-to-forefront\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/reasons-for-m-a-are-shifting--advisors-say-81663.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"M\u0026amp;A\"\u003eAs Growth-Driven RIA M\u0026amp;A Increases, Deal Terms Come To Forefront\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Karen DeMasters | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRIA Mergers and Acquisitions (M\u0026amp;A) activity is often discussed in terms of retiring firm founders seeking external buyers for their firms, providing an exit (and deal compensation to support their retirements) and a new home for the firm\u0026#39;s clients and staff. However, in recent years many founders have looked to sell not with the intention of exiting the business, \u003ca href=\"https://www.kitces.com/blog/mark-tibergien-pershing-advisor-solutions-sizing-scaling-up-practice-management-advisory-business/\"\u003ebut rather to seek to more effectively grow their practice within a larger organization\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn this environment (which has been partially fueled by an increase in Private Equity (PE)-funded RIA aggregators), \u003ca href=\"https://www.kitces.com/blog/david-grau-jr-internal-succession-plan-private-equity-era-sale-acquisition/\"\u003esecuring attractive deal terms\u003c/a\u003e and finding an appropriate cultural fit are paramount for sellers. For instance, in terms of deal terms, many PE-backed deals include an equity component in deal compensation, which suggests that finding a buyer with a proven track record of growth and multiple avenues for gaining new client assets (e.g., not just relying on a custodial referral channel) could increase the chances of experiencing a positive financial outcome. Further, given that founders looking to sell for growth purposes are likely to stay with the combined firm for an extended period, finding a cultural match (e.g., in terms of the buyer\u0026#39;s approach to clients, team structure, technology, and its business philosophy) can increase the chances that the selling founder will achieve their aims over the long run.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while a retiring founder might first look to headline valuation numbers when considering transaction partners (though ensuring their team and clients will fit in well with the buying firm is an important consideration as well), for selling founders seeking growth opportunities within a larger firm, moving beyond the valuation to consider the type of compensation being offered by different suitors and how their firm would fit in with the larger organization are particularly important considerations.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Seeking A Curated Cultural Competition\" id=\"seeking-a-curated-cultural-competition-rather-than-a-bidding-war-in-ria-ma\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/opinion-the-m-and-a-playbook-is-broken-here-s-how-to-fix-it/a2461074\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"M\u0026amp;A\"\u003eSeeking A \u0026#34;Curated Cultural Competition\u0026#34; Rather Than A Bidding War In RIA M\u0026amp;A\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Allen Darby | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen selling a tangible item (e.g., a work of art), an auction with many bidders can often result in the highest sale price (usually in cash) for the seller, who might not care much about what the purchaser plans to do with the item up for sale (unless it has deep personal meaning). However, when it comes to selling a financial advisory firm, because the type of compensation (in addition to the headline valuation), as well as the culture of the buyer, can be very important to the seller (who typically not only seeks to maximize their own remuneration, but also ensure that their staff and clients will fit in well within the new firm).\u003c/p\u003e\n\u003cp\u003eNonetheless, Darby (the CEO of sell-side M\u0026amp;A advisory firm \u003ca href=\"https://www.alarisacquisitions.com/\"\u003eAlaris Acquisitions\u003c/a\u003e) suggests that the predominant approach for RIA sales today is more reflective of a multi-bidder auction focused on headline valuations rather than a more in-depth inquiry into the culture of interested buyers. Which, he suggests, invites the potential for \u003ca href=\"https://www.kitces.com/blog/learning-experiences-advisor-firm-owners-merging-selling-acquisition-inside-information/\"\u003esellers to be disappointed\u003c/a\u003e if they don\u0026#39;t conduct (or receive from their deal advisor) a thorough evaluation of the deal terms proposed by different prospective buyers (e.g., an offer with a seemingly attractive valuation might include only a small amount of upfront cash and unrealistic performance hurdles to achieve the full valuation). Further, with many potential buyers bidding largely on price, sellers do not necessarily have the opportunity to get into the culture of the various firms vying for the deal.\u003c/p\u003e\n\u003cp\u003eGiven these challenges, Darby suggests an alternate approach of holding a \u0026#34;curated cultural competition\u0026#34; where the only bidders are those who have been found to be a strong strategic and cultural fit for the selling firm. Not only could this provide the seller with more confidence that the buyer they choose will be a good cultural fit for their firm, but this approach also could give sellers greater incentive to offer a more attractive valuation and deal terms (as they are able to conduct deeper due diligence into the selling firm before making an offer and have greater confidence that the acquisition would be positive for their bottom line).\u003c/p\u003e\n\u003cp\u003eIn the end, while it makes logical sense that having more potential buyers for a firm could extract the highest valuation, gaining in-depth knowledge into (fewer) bidders\u0026#39; offers and cultures could prove more valuable to selling firm owners and ultimately lead to a more satisfying result for themselves as well as for their staff and clients.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Evaluating Inbound Acquisition Offers\" id=\"how-firms-can-evaluate-inbound-acquisition-offers\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/m-a-outsiders-81462.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"M\u0026amp;A\"\u003eHow Firms Can Evaluate Inbound Acquisition Offers\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Dan Moisand | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile some firms put themselves on the market for sale (whether the founder is retiring or they are seeking to grow within a larger firm), many successful firms will field calls from potential acquirors interested in a deal. And while the thought of achieving an \u0026#39;exit\u0026#39; might seem attractive to founders, often the \u0026#39;devil is in the details\u0026#39;, as Moisand\u0026#39;s firm has found out after evaluating (and turning down) multiple acquisition offers.\u003c/p\u003e\n\u003cp\u003eFor instance, given that most acquisitions are paid for with cash, client retention payments, growth payments, and/or stock in the buyer, the combination of these elements could make an offer more or less attractive to the selling firm. For instance, when client retention payments make up a significant part of the total consideration, sellers will be under significant pressure to ensure their clients stick around with the new firm (for the amount of time [often one to three years] outlined in the deal terms), which could be challenging if the new firm doesn\u0026#39;t offer the same levels of technology and customer service as the selling firm. Retention payments could also conflict with growth targets, as a focused pursuit of new client growth (to hit deal targets) could take time away from current clients and lead some of them to leave the new firm (serving as a hit to retention payments). And when it comes to stock in the buyer, sellers will want to know the class of stock they will receive as well as the rights associated with it, as well as the dividend or distribution rate and the liquidity of these shares (which will provide them with more information on the risk and potential of this deal element).\u003c/p\u003e\n\u003cp\u003eAltogether, while firms might receive offers that look attractive on the surface, the deal terms can reveal whether taking it might be a good financial decision for the selling owner. Further, looking beyond deal terms, sellers will likely also be interested in the cultural fit between the two firms (particularly if the selling owner(s) plan to stick with the new firm for years to come), particularly when it comes to their approach to providing advice (e.g., whether they are planning or product sales focused), which could have major impacts both on the seller and the firm they\u0026#39;ve worked hard to build!\u003c/p\u003e\n\u003ch2 id=\"12-ways-to-build-better-habits\"\u003e\u003cspan\u003e\u003ca href=\"https://ryanholiday.net/the-secret-to-better-habits-in-2025/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003e12 Ways To Build Better Habits\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Ryan Holiday)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhether it\u0026#39;s a New Year\u0026#39;s Resolution or a mid-year decision to make a change, habits play a major role in our lives. But as many people who have tried to pursue an audacious goal or stop a long-standing \u0026#39;bad\u0026#39; habit know, being able to follow through with these changes and maintain them for the long run can be quite challenging. With this in mind, Holiday offers a series of tips for establishing and maintaining better habits.\u003c/p\u003e\n\u003cp\u003eTo start, many people resolve to be more productive but find themselves distracted. With this in mind, he suggests taking on the most important tasks at the beginning of the day before interruptions and fatigue can set in. Similarly, creating or removing friction can make the habit more \u0026#39;automatic\u0026#39; (e.g., for those who want to drink more water, always keeping a refillable water bottle around). In addition, while an individual might set a \u0026#39;big\u0026#39; goal, breaking it down into smaller chunks can make it feel more manageable (e.g., if one\u0026#39;s goal is to read 50 books this year, commit to the [very achievable goal of] reading one page a day rather than trying to take on the full goal at once [which might be much more challenging]).\u003c/p\u003e\n\u003cp\u003eOther ways to achieve goals and build better habits center on the amount that\u0026#39;s on one\u0026#39;s plate on a daily basis. For instance, rather than trying to take on as many projects or goals as possible (which can suck one\u0026#39;s willpower), focusing on the highest priorities can increase the likelihood that they will be achieved. On a related note, mastering the ability to say \u0026#39;no\u0026#39; when (seemingly attractive) opportunities arise can help prevent distractions from the habits one is trying to work on. Further, while habits might be personal, they don\u0026#39;t have to be pursued alone, as finding a friend or colleague who wants to pursue a similar goal can create a sense of camaraderie and accountability.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that establishing and maintaining better habits is not just a matter of personal willpower, but also the broader context in which these goals are being pursued, whether it\u0026#39;s physical space, one\u0026#39;s to-do list, or social relationships that can support these changes!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Commitment Strategies For Better Habits\" id=\"using-commitment-strategies-to-create-better-habits\"\u003e\u003cspan\u003e\u003ca href=\"https://timharford.com/2025/02/want-to-change-consider-your-situation/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eUsing Commitment Strategies To Create Better Habits\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Tim Harford)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCharacteristics such as \u0026#34;grit\u0026#34; and \u0026#34;determination\u0026#34; are often viewed as key determinants for success, demonstrating an individual\u0026#39;s ability to take on challenges through sheer willpower. But as many a failed New Year\u0026#39;s Resolution can attest to, few individuals have an unlimited well of willpower to tap into.\u003c/p\u003e\n\u003cp\u003eOne potential way to reduce the amount of willpower needed to follow through on a desired habit or goal is to employ \u0026#34;commitment strategies\u0026#34;, which can make it easier to complete a task (or harder to engage in a bad habit). For instance, if your goal is to run more often, joining a running club that meets at a certain time each week serves as a commitment that will encourage you to attend even when you might otherwise not feel like running (less you face the judgment of your peers in the club). On the opposite end of the spectrum, if your goal is to eat less junk food, keeping tempting treats out of the house can make it much less likely that you will consume it. There are even websites and apps (e.g., \u003ca href=\"https://www.stickk.com/\"\u003eStickk\u003c/a\u003e) that will help you commit to goals by having you put money on the table, only getting it back if the goal is completed.\u003c/p\u003e\n\u003cp\u003eIn the end, while \u0026#39;grit\u0026#39; is no doubt important in many facets of life, it can be hard to rely on this trait to achieve the range of goals you might set for yourself. Which suggests that using commitment strategies to support these goals can make it more likely that they will be achieved (and perhaps open the door for completing more of them?).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Tiny Experiments Can Lead To Big Changes\" id=\"how-tiny-experiments-can-lead-to-big-changes\"\u003e\u003cspan\u003e\u003ca href=\"https://nextbigideaclub.com/magazine/art-goal-setting-live-free-instead-pressure-bookbite/54478/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow \u0026#34;Tiny Experiments\u0026#34; Can Lead To Big Changes\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Anne-Laure Le Cunff | Next Big Idea Club)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRunning experiments is a key part of making scientific progress, even as scientists recognize that not every experiment will be successful. And while other individuals might not be trying to find the next medical breakthrough, Le Cunff suggests that running \u0026#34;tiny experiments\u0026#34; in everyday life can help lead to positive personal change.\u003c/p\u003e\n\u003cp\u003eFor instance, many individuals might make major goals (e.g., health, career) but not know where to start. One option is to run a \u0026#34;tiny experiment\u0026#34; by to taking on a certain task for a certain period of time (e.g., someone who wants to start a blog might decide to sit down to write for 15 minutes everyday at 9 a.m. for the next month). The key, though, is not necessarily whether the experiment is \u0026#39;completed\u0026#39;, but rather to reflect on how it went and what they might be able to improve on going forward. One way to do this is by engaging in a \u0026#34;Plus Minus Next\u0026#34; exercise, where the \u0026#39;experimenter\u0026#39; writes down what \u0026#39;worked\u0026#39; in the \u0026#34;plus\u0026#34; column, what didn\u0026#39;t work in the \u0026#34;minus\u0026#34; column and what you\u0026#39;ll try during the next week or month in the \u0026#34;next\u0026#34; column. In this way they can better assess the results of the \u0026#34;experiment\u0026#34; as an impartial observer rather than criticizing themselves for perceived personal failings if it wasn\u0026#39;t successful. Further, by sharing these with others, they can receive feedback and questions that can help them make additional changes to the \u0026#34;experiments\u0026#34; (and hopefully achieve even better results).\u003c/p\u003e\n\u003cp\u003eIn sum, just as a scientist might try to learn from the successes or failures of an experiment, individuals have the ability to do the same in their daily lives. Which could ultimately lead to major professional or personal breakthroughs!\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (March 15–16)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-7a3abc65d898ab2c8a054148-=\"\"\u003e\n                    \u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "34 min read",
  "publishedTime": "2025-03-14T14:00:03-04:00",
  "modifiedTime": "2025-03-14T17:39:06Z"
}
