{
  "id": "43158ebc-c8d9-494c-89e8-ae8e70aa8105",
  "title": "Mortgage Rates Fall Slightly, But Borrowers Need More Relief",
  "link": "https://www.nerdwallet.com/article/mortgages/weekly-mortgage-rates-6-5-25",
  "description": "Mortgage rates fell in the week ending June 5.",
  "author": "Taylor Getler",
  "published": "Thu, 05 Jun 2025 19:32:48 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Mortgage Rates",
    "Mortgages"
  ],
  "byline": "Taylor Getler",
  "length": 2945,
  "excerpt": "Mortgage rates fell in the week ending June 5.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Mortgage rates fell across the board this week, breaking a four-week streak of increases. The average rate on the 30-year fixed-rate mortgage fell 12 basis points to 6.95% for the week ending June 5, according to rates provided to NerdWallet by Zillow. A basis point is one one-hundredth of a percentage point.Even with this slight reprieve, borrowers shouldn’t hold their breath waiting for significant rate drops any time soon. Federal Reserve watchers predict central bankers will vote to hold the federal funds rate steady at their next meeting in two weeks. That means mortgage rates will likely continue to orbit around 7% for the foreseeable future. However, for would-be buyers who need rates to fall closer to 6.5%, there is a light at the end of the tunnel — if they can wait for it. Explore mortgages today and get started on your homeownership goalsGet personalized rates. Your lender matches are just a few questions away.What's your zip code?Do you want to purchase or refinance?What's your property type?How do you plan to use this property?Won’t affect your credit scoreHigh rates push home sales to record lowsAt a recent legislative event, Lawrence Yun, chief economist at the National Association of Realtors (NAR), announced that mortgage rates are forecast to average 6.4% in the second half of the year and 6.1% in 2026. “For new home buyers, their monthly payment obligation has increased, and this is what's killing the housing market,” said Yun, who referred to lower mortgage rates as the “magic bullet” that the real estate industry needs to recover.\"Home sales have been very difficult over the past two years,” he told industry stakeholders. “We've had the lowest home sales in 30 years for two consecutive years.\"Yun attributed the recent market slowdown to the economy falling short of Federal Reserve goals. Central bankers’ forecast for the GDP (a measure of the country’s economic output) was reduced from 2.1% to 1.7% in March, while inflation projections were raised from 2.4% to 2.7%. Still, Yun’s tone was bullish. He noted that shelter costs, which are a major economic indicator, are trending downward. Job growth has also exceeded pre-pandemic levels, and wages are outpacing price increases on consumer goods — all factors the Fed will consider in deciding when to cut rates. Some areas are still hotWhile the nation’s overall real estate market might be suffering, some pockets are still red-hot. Zillow reports that several Northeast areas — Boston; Buffalo, New York; Hartford, Connecticut; and Providence, Rhode Island — continue to experience fierce competition. Homes in these markets are selling within 10 days, with more than half selling above listing price. Currently, the slowest major metro market is Miami. Zillow reports listings in Miami and across the Sun Belt — the area from North Carolina to Southern California — receive less interest from site users than other parts of the country.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/06/GettyImages-2162651117-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMortgage rates fell across the board this week, breaking a four-week streak of increases. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe average rate on the 30-year fixed-rate mortgage fell 12 basis points to 6.95% for the week ending June 5, according to rates provided to NerdWallet by Zillow. A basis point is one one-hundredth of a percentage point.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEven with this slight reprieve, borrowers shouldn’t hold their breath waiting for significant rate drops any time soon. Federal Reserve watchers predict central bankers will vote to hold the federal funds rate steady at their next meeting in two weeks. That means \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/current-interest-rates\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003e\u003cspan\u003emortgage rates\u003c/span\u003e\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e will likely continue to orbit around 7% for the foreseeable future. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHowever, for would-be buyers who need rates to fall closer to 6.5%, there is a light at the end of the tunnel — if they can wait for it. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003eExplore mortgages today and get started on your homeownership goals\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003eGet personalized rates. Your lender matches are just a few questions away.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv data-currency=\"Columns\"\u003e\u003cp\u003e\u003clabel for=\"nw-aria-ssr-4-2-1-1-1\"\u003e\u003cspan\u003eWhat\u0026#39;s your zip code?\u003c/span\u003e\u003c/label\u003e\u003c/p\u003e\u003cp\u003e\u003clabel for=\"nw-aria-ssr-4-2-1-1-2\"\u003e\u003cspan\u003eDo you want to purchase or refinance?\u003c/span\u003e\u003c/label\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-currency=\"Columns\"\u003e\u003cp\u003e\u003clabel for=\"nw-aria-ssr-4-2-1-1-3\"\u003e\u003cspan\u003eWhat\u0026#39;s your property type?\u003c/span\u003e\u003c/label\u003e\u003c/p\u003e\u003cp\u003e\u003clabel for=\"nw-aria-ssr-4-2-1-1-4\"\u003e\u003cspan\u003eHow do you plan to use this property?\u003c/span\u003e\u003c/label\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003csvg width=\"16\" height=\"16\" viewBox=\"0 0 16 16\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cpath d=\"M8 0.666504L2 3.33317V7.33317C2 11.0332 4.56 14.4932 8 15.3332C11.44 14.4932 14 11.0332 14 7.33317V3.33317L8 0.666504ZM6.66667 11.3332L4 8.6665L4.94 7.7265L6.66667 9.4465L11.06 5.05317L12 5.99984L6.66667 11.3332Z\" fill=\"#006642\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003cp\u003e\u003cspan\u003eWon’t affect your credit score\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHigh rates push home sales to record lows\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAt a recent legislative event, Lawrence Yun, chief economist at the National Association of Realtors (NAR), announced that mortgage rates are forecast to average 6.4% in the second half of the year and 6.1% in 2026. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“For new home buyers, their monthly payment obligation has increased, and this is what\u0026#39;s killing \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/is-it-a-good-time-to-buy-a-house\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003e\u003cspan\u003ethe housing market\u003c/span\u003e\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e,” said Yun, who referred to lower mortgage rates as the “magic bullet” that the real estate industry needs to recover.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u0026#34;Home sales have been very difficult over the past two years,” he told industry stakeholders. “We\u0026#39;ve had the lowest home sales in 30 years for two consecutive years.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYun attributed the recent market slowdown to the economy falling short of Federal Reserve goals. Central bankers’ forecast for the GDP (a measure of the country’s economic output) was reduced from 2.1% to 1.7% in March, while \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/calculator/inflation-calculator\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003e\u003cspan\u003einflation\u003c/span\u003e\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e projections were raised from 2.4% to 2.7%. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eStill, Yun’s tone was bullish. He noted that shelter costs, which are a major economic indicator, are trending downward. Job growth has also exceeded pre-pandemic levels, and wages are outpacing price increases on consumer goods — all factors the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/fed-mortgage-rates\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003e\u003cspan\u003eFed will consider\u003c/span\u003e\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e in deciding when to cut rates. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eSome areas are still hot\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhile the nation’s overall real estate market might be suffering, some pockets are still red-hot. Zillow reports that several Northeast areas — Boston; Buffalo, New York; Hartford, Connecticut; and Providence, Rhode Island — continue to experience fierce competition. Homes in these markets are selling within 10 days, with more than half selling above listing price. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCurrently, the slowest major metro market is Miami. Zillow reports listings in Miami and across the Sun Belt — the area from North Carolina to Southern California — receive less interest from site users than other parts of the country. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-05T19:32:48Z",
  "modifiedTime": null
}
