{
  "id": "4679d18a-5e9a-4352-929b-2bead7383fca",
  "title": "Social Security Under Trump: 5 Warning Signs",
  "link": "https://www.nerdwallet.com/article/investing/social-security/social-security-trump",
  "description": "A series of moves, including staff cuts and policy changes, could burden many Social Security applicants and beneficiaries and even threaten the stability of the system.",
  "author": "Rick VanderKnyff",
  "published": "Fri, 21 Mar 2025 20:36:36 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Social Security"
  ],
  "byline": "Rick VanderKnyff",
  "length": 10048,
  "excerpt": "A series of moves, including staff cuts and policy changes, could burden many Social Security applicants and beneficiaries and even threaten the stability of the system.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Chaotic change has been upending every federal agency since President Donald Trump’s second inauguration, and Social Security — despite its longstanding status as the untouchable “third rail” of American politics — is no exception. Trump pledged while campaigning that he would not seek to cut benefits to eligible recipients, and the White House reiterated that in a March 11 press release, saying: “The Trump Administration will not cut Social Security, Medicare, or Medicaid benefits.” And so far, it has held to the pledge to leave benefit levels untouched. But in the opening weeks of the administration, rules changes and staff cutbacks have already been announced that could affect service levels, particularly to some of the program’s most vulnerable applicants and beneficiaries. This comes as a record-setting cohort of Americans is hitting traditional retirement age, a four-year bubble of late baby boomers that has come to be known as “peak 65.”News moves fast. Stay ahead of how it could impact your money.Interest rates, inflation, natural disasters — get notified when breaking news could affect your finances, and get expert insights to help you plan your next move. Meanwhile, rhetoric from within the administration has escalated. Billionaire Elon Musk, a “special government employee” put in charge of the so-called Department of Government Efficiency, or DOGE, called Social Security “the biggest Ponzi scheme of all time” in a Feb. 28 podcast interview. Trump himself, in his recent address to Congress, claimed his administration is finding “shocking levels of incompetence and probable fraud” in Social Security. Social Security is the single biggest line item in the national budget. In 2024, $1.5 trillion was spent on the program. In September 2024, 51.5 million retired workers received benefits averaging $1,922. But the program serves more than the retired. Also in September 2024, recipients included:2.6 million spouses and children of retired workers.According to AARP, 40% of older Americans rely on Social Security for more than half of their family income, and 14% of them rely on the program for 90% or more of their income.Dire warnings about the future of Social Security have been increasing, and Martin O’Malley — the SSA’s commissioner until last November — told MSNBC this week that the current administration’s actions could lead to “system collapse.” Here are five things to watch as the new administration seeks to trim the cost of the Social Security program.Staff cutbacksWhen Trump took office, the Social Security Administration (SSA) had 57,000 employees. On Feb. 28, SSA announced that it aimed to reduce headcount to 50,000. Even before the cuts, Social Security is at a 50-year staffing low — at a time when the ranks of the retired are growing at a record pace, and people are generally living longer. For comparison, in 1995 there were 62,504 SSA employees and 43.4 million beneficiaries, according to SSA data. That’s a ratio of about 694 beneficiaries per employee. If we apply 2024’s beneficiary count of 68.5 million to the SSA’s new staff target of 50,000, the ratio almost doubles to 1,369 to 1. Of course, the internet has come of age since 1995, and many functions can be performed online, including address and phone number changes, accessing a benefit verification letter and starting or changing direct deposit. Not all seniors have internet access, however: The Pew Research Center estimates that 10% of Americans 65 or older are not internet users. Overall, millions of beneficiaries still rely on one-on-one help, especially with more complex questions. Average processing time for disability claims have already doubled in the past five years, according to AARP, from four to eight months. Phone service changesLee Dudek, Trump’s acting commissioner of Social Security, has enacted two significant process changes that the SSA says are intended to combat fraud and identity theft, but are also likely to complicate matters for many new applicants and current beneficiaries, particularly those with limited mobility.On March 12, SSA announced that it would no longer process changes to direct deposit by phone, saying, “Approximately 40 percent of Social Security direct deposit fraud is associated with someone calling SSA to change direct deposit bank information.” Changes must now be made online (with two-factor authentication) or at a local Social Security office. On March 18, SSA announced it is taking steps to implement “stronger identity verification procedures,” called “internet ID proofing” in an internal memo from Doris Diaz, acting deputy commissioner for operations for SSA. Under the change, those trying to apply for retirement or disability benefits would be required to first verify their identities online; those who are unable to do so would be required to visit a field office. In her memo, first reported March 17 by the newsletter popular.info, Diaz estimated the latter changes would result in \"approximately 75,000-85,000 additional visitors per week” to field offices, and present “increased challenges for vulnerable populations.” At the same time, according to the memo, it would result in “reduced fraud risk and fewer improper payments.”Field office congestionOne significant change to Social Security policy took place in December, before Trump took office: requiring appointments rather than drop-in visits at field offices in an effort to reduce wait times. A December blog post from SSA said drop-in visits would still be accommodated, but most language on the SSA site indicates that offices are “requiring appointments for in-person service.” To get an in-person appointment, one must call the main Social Security line (1-800-772-1213) — and phone hold times are typically two hours or more. Available appointment dates are typically a month or more out, according to online sources. And that’s before the aforementioned phone policy changes take effect.There are also conflicting reports from within the Trump administration about the potential closure of public-facing offices. The Associated Press has combed through the list of canceled government leases listed on the DOGE site and identified 47 SSA offices slated for closure, 24 of them this year. When contacted, the SSA press office provided a list of 64 “soft leases” slated for cancellation. Some are not public-facing offices. Of those that are, all are listed as small “permanent remote sites” reserved for hearings. Most hearings, SSA says, are now done remotely and the hearing rooms (typically housed within field offices) are no longer needed.The lists provided through DOGE and the SSA overlap but are not identical. There are today “about 1,200 field offices,” according to the SSA press office.Changes to overpayment policySometimes, Social Security mistakenly overpays recipients, and the agency is required by law to recover any overpaid funds. To do so, once an overpayment has been identified, SSA has historically withheld 100% of future benefit checks until the overpaid amount has been recovered — meaning that beneficiaries could see all of a monthly check dissipate. President Joe Biden changed that recovery rate to 10%, so that overpayments would be clawed back over time. Under Dudek, the 100% recovery is back in effect as of March 27. The SSA says it will work to accommodate those for whom the accelerated repayment presents a hardship, but the beneficiary would have to call or visit an office to make their case.A 2024 report from the Social Security Administration’s Office of the Inspector General estimated that $72 billion in “improper payments” were made in fiscal years 2015 through 2022, representing less than 1% of all benefits paid in that period. The SSA estimates the policy change will help them recover an additional $7 billion per year.The program’s long-term viabilitySocial Security’s shaky long-term funding status is not a problem created by Trump, but one of his policy proposals could exacerbate it. Social Security is a program in which current workers pay a designated payroll tax to underwrite benefits to current retirees. Because of our aging population, however, there is a growing imbalance between the number of workers and the number of retirees. The ratio of covered workers to current beneficiaries has fallen by almost half since 1960.Since 2010, the money coming into Social Security via payroll taxes has fallen short of the money going out to pay benefits. In 2023, the shortfall was $41 billion, and that was paid out via two trust funds that were established in 1940 and 1957 respectively — back when workers greatly numbered retirees. Those trust funds are projected to run dry in 2035 unless changes are made to shore up the system. If the trust funds run out, Social Security would be able to pay only about 83% of scheduled benefits.Material steps to fix the funding gap could include increasing the retirement age, raising the payroll tax, or eliminating the cap on Social Security payroll taxes paid in a year. Full retirement age was gradually raised from 65 to the current 67 — by an act passed by Congress in 1983. No such proposals are on the table from the current administration. However, Trump pledged in his campaign and again in his recent speech to Congress that he would eliminate income taxes on Social Security benefits. About half of recipients do currently pay taxes on a portion of their benefits, and they would see their overall tax bill lowered if Trump succeeds. The move would serve to worsen systemic issues, though, because those tax proceeds (which totaled $51 billion in 2023) are plowed back into paying benefits.The Wharton School at the University of Pennsylvania estimated in a February report that eliminating taxes on Social Security benefits would shave two years from the life of the trust funds, moving its own estimate of the projected depletion date from December 2034 to December 2032, and would increase federal debt by 7% by 2054.(Photo by Andrew Harnik/Getty Images)",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/03/GettyImages-2203343807-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eChaotic change has been upending every federal agency since President Donald Trump’s second inauguration, and Social Security — despite its longstanding status as the untouchable “third rail” of American politics — is no exception. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTrump pledged while campaigning that he would not seek to cut benefits to eligible recipients, and the White House reiterated that in a March 11 press release, saying: “The Trump Administration will not cut Social Security, Medicare, or Medicaid benefits.” And so far, it has held to the pledge to leave benefit levels untouched. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut in the opening weeks of the administration, rules changes and staff cutbacks have already been announced that could affect service levels, particularly to some of the program’s most vulnerable applicants and beneficiaries. This comes as a record-setting cohort of Americans is hitting traditional retirement age, a four-year bubble of late baby boomers that has come to be known as “peak 65.”\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch3 data-currency=\"Text\" id=\"news-moves-fast.-stay-ahead-of-how-it-could-impact-your-money.\"\u003e\u003cspan\u003eNews moves fast. Stay ahead of how it could impact your money.\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eInterest rates, inflation, natural disasters — get notified when breaking news could affect your finances, and get expert insights to help you plan your next move. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://s3.us-east-1.amazonaws.com/cdns3.nerdwallet.com/User+Engagement/25Q1_UEG_Content-Site-Ads-2-Fed_signals_major.svg\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMeanwhile, rhetoric from within the administration has escalated. Billionaire Elon Musk, a “special government employee” put in charge of the so-called Department of Government Efficiency, or DOGE, called Social Security “the biggest Ponzi scheme of all time” in a Feb. 28 podcast interview. Trump himself, in his recent address to Congress, claimed his administration is finding “shocking levels of incompetence and probable fraud” in Social Security. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.nerdwallet.com/article/investing/social-security/social-security\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eSocial Security\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e is the single biggest line item in the national budget. In 2024, $1.5 trillion was spent on the program. In September 2024, 51.5 million retired workers received benefits averaging $1,922. But the program serves more than the retired. Also in September 2024, recipients included:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e2.6 million spouses and children of retired workers.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eAccording to AARP, 40% of older Americans rely on Social Security for more than half of their family income, and 14% of them rely on the program for 90% or more of their income.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDire warnings about the future of Social Security have been increasing, and Martin O’Malley — the SSA’s commissioner until last November — told MSNBC this week that the current administration’s actions could lead to “system collapse.” Here are five things to watch as the new administration seeks to trim the cost of the Social Security program.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"staff-cutbacks\"\u003e\u003cspan\u003eStaff cutbacks\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-economy\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eTrump took office\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, the Social Security Administration (SSA) had 57,000 employees. On Feb. 28, SSA announced that it aimed to reduce headcount to 50,000. Even before the cuts, Social Security is at a 50-year staffing low — at a time when the ranks of the retired are growing at a record pace, and people are generally living longer. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFor comparison, in 1995 there were 62,504 SSA employees and 43.4 million beneficiaries, according to SSA data. That’s a ratio of about 694 beneficiaries per employee. If we apply 2024’s beneficiary count of 68.5 million to the SSA’s new staff target of 50,000, the ratio almost doubles to 1,369 to 1. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOf course, the internet has come of age since 1995, and many functions can be performed online, including \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/investing/social-security/change-address-social-security\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eaddress and phone number changes\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, accessing a benefit verification letter and starting or changing direct deposit. Not all seniors have internet access, however: The Pew Research Center estimates that 10% of Americans 65 or older are not internet users. Overall, millions of beneficiaries still rely on one-on-one help, especially with more complex questions. Average processing time for disability claims have already doubled in the past five years, according to AARP, from four to eight months. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"phone-service-changes\"\u003e\u003cspan\u003ePhone service changes\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eLee Dudek, Trump’s acting commissioner of Social Security, has enacted two significant process changes that the SSA says are intended to combat fraud and identity theft, but are also likely to complicate matters for many new applicants and current beneficiaries, particularly those with limited mobility.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eOn March 12, SSA announced that it would no longer process changes to direct deposit by phone, saying, “Approximately 40 percent of Social Security direct deposit fraud is associated with someone calling SSA to change direct deposit bank information.” Changes must now be made online (with two-factor authentication) or at a local Social Security office. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eOn March 18, SSA announced it is taking steps to implement “stronger identity verification procedures,” called “internet ID proofing” in an internal memo from Doris Diaz, acting deputy commissioner for operations for SSA. Under the change, those trying to apply for retirement or disability benefits would be required to first verify their identities online; those who are unable to do so would be required to visit a field office. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eIn her memo, first reported March 17 by the newsletter popular.info, Diaz estimated the latter changes would result in \u0026#34;approximately 75,000-85,000 additional visitors per week” to field offices, and present “increased challenges for vulnerable populations.” At the same time, according to the memo, it would result in “reduced fraud risk and fewer improper payments.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"field-office-congestion\"\u003e\u003cspan\u003eField office congestion\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOne significant change to Social Security policy took place in December, before Trump took office: requiring appointments rather than drop-in visits at field offices in an effort to reduce wait times. A December blog post from SSA said drop-in visits would still be accommodated, but most language on the SSA site indicates that offices are “requiring appointments for in-person service.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTo get an in-person appointment, one must call the main Social Security line (1-800-772-1213) — and phone hold times are typically two hours or more. Available appointment dates are typically a month or more out, according to online sources. And that’s before the aforementioned phone policy changes take effect.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are also conflicting reports from within the Trump administration about the potential closure of public-facing offices. The Associated Press has combed through the list of canceled government leases listed on the DOGE site and identified 47 SSA offices slated for closure, 24 of them this year. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen contacted, the SSA press office provided a list of 64 “soft leases” slated for cancellation. Some are not public-facing offices. Of those that are, all are listed as small “permanent remote sites” reserved for hearings. Most hearings, SSA says, are now done remotely and the hearing rooms (typically housed within field offices) are no longer needed.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe lists provided through DOGE and the SSA overlap but are not identical. There are today “about 1,200 field offices,” according to the SSA press office.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"changes-to-overpayment-policy\"\u003e\u003cspan\u003eChanges to overpayment policy\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSometimes, Social Security mistakenly overpays recipients, and the agency is required by law to recover any overpaid funds. To do so, once an overpayment has been identified, SSA has historically withheld 100% of future benefit checks until the overpaid amount has been recovered — meaning that beneficiaries could see all of a monthly check dissipate. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePresident Joe Biden changed that recovery rate to 10%, so that overpayments would be clawed back over time. Under Dudek, the 100% recovery is back in effect as of March 27. The SSA says it will work to accommodate those for whom the accelerated repayment presents a hardship, but the beneficiary would have to call or visit an office to make their case.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA 2024 report from the Social Security Administration’s Office of the Inspector General estimated that $72 billion in “improper payments” were made in fiscal years 2015 through 2022, representing less than 1% of all benefits paid in that period. The SSA estimates the policy change will help them recover an additional $7 billion per year.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"the-program\u0026#39;s-long-term-viability\"\u003e\u003cspan\u003eThe program’s long-term viability\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSocial Security’s shaky long-term funding status is not a problem created by Trump, but one of his policy proposals could exacerbate it. Social Security is a program in which current workers pay a designated payroll tax to underwrite benefits to current retirees. Because of our aging population, however, there is a growing imbalance between the number of workers and the number of retirees. The ratio of covered workers to current beneficiaries has fallen by almost half since 1960.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSince 2010, the money coming into Social Security via payroll taxes has fallen short of the money going out to pay benefits. In 2023, the shortfall was $41 billion, and that was paid out via two trust funds that were established in 1940 and 1957 respectively — back when workers greatly numbered retirees. Those trust funds are projected to run dry in 2035 unless changes are made to shore up the system. If the trust funds run out, Social Security would be able to pay only about 83% of scheduled benefits.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMaterial steps to fix the funding gap could include increasing the retirement age, raising the payroll tax, or eliminating the cap on Social Security payroll taxes paid in a year. \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/investing/social-security/retirement-age\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eFull retirement age\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e was gradually raised from 65 to the current 67 — by an act passed by Congress in 1983. No such proposals are on the table from the current administration. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHowever, Trump pledged in his campaign and again in his recent speech to Congress that he would eliminate \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/investing/social-security/social-security-taxed\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eincome taxes on Social Security benefits\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. About half of recipients do currently pay taxes on a portion of their benefits, and they would see their overall tax bill lowered if Trump succeeds. The move would serve to worsen systemic issues, though, because those tax proceeds (which totaled $51 billion in 2023) are plowed back into paying benefits.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe Wharton School at the University of Pennsylvania estimated in a February report that eliminating taxes on Social Security benefits would shave two years from the life of the trust funds, moving its own estimate of the projected depletion date from December 2034 to December 2032, and would increase federal debt by 7% by 2054.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e(Photo by Andrew Harnik/Getty Images)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-03-21T20:36:36Z",
  "modifiedTime": null
}
