{
  "id": "52494553-c43c-4085-a3e6-70d4c734b9be",
  "title": "Get the ‘Cheat Codes’ for Cheaper Travel (NEW)",
  "link": "https://www.nerdwallet.com/article/travel/get-the-cheat-codes-for-cheaper-travel-2",
  "description": "Free newsletter gives easy tips to save money on travel",
  "author": "Erin Hurd",
  "published": "Thu, 24 Jul 2025 17:48:26 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Travel"
  ],
  "byline": "Erin Hurd",
  "length": 5214,
  "excerpt": "Free newsletter gives easy tips to save money on travel",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Want to travel more, but pay less?Credit card rewards, hotel points and airline miles can be like travel “cheat codes” to unlocking more affordable trips.They can make it possible to fly first class to a far-flung island; visit relatives over the holidays without wiping out your bank account; create some Disney magic for your family; and help make any of your travel bucket list dreams come true.The challenge? For many people, it's knowing where or how to get started.That’s why we started TravelNerd, a free newsletter designed to help you crack the code on spending less on your travel. Subscribe to our free TravelNerd newsletter for inspiration, tips and money-saving strategies, delivered straight to your inbox.By signing up, you will receive newsletters and promotional content and agree to our Terms of Use and acknowledge the data practices in our Privacy Policy. You may unsubscribe at any time.Your vacation can't afford to miss thisEach week our expert Travel Nerds will show you tips and tricks to get the most out of your travel dollars, like:✅ How to get started using travel points and miles (without all the overwhelming jargon).✅ Where to find cheap flights (that you actually want to take).✅ Tips to score hotel upgrades.✅ How to smartly use credit cards to earn tons of rewards and perks.✅ Lesser-known ways to make your Disney trip cheaper and easier.✅ Ways to make your travels more affordable even without credit card rewards.✅ What all the latest travel news means for you.✅ Fast-moving travel deals to help save you a bundle.✅ And much more.Our experts will deliver all this right to your inbox, plus hot deals and limited-time offers — absolutely free.Meet the Travel Nerds 🤓Sally French, Lead Writer and Smart Travel co-hostA former Cast Member at Disneyland (that's Disney-speak for employee), Sally is our resident Disney expert. She's also a competitive weightlifter and powerlifter, so many of her travel involves going to meets (often fueled on the famous Hampton Inn waffles).She’s biked over the sea ice in the Arctic Circle, climbed to the top of the Eiffel Tower with all her carry-on bags during a 10-hour layover in Paris, hiked 25 miles in a day around Italy's Cinque Terre and biked the famous Hải Vân Pass in Vietnam. She hates relaxing.Craig Joseph, Lead WriterCraig lives to explore and is always looking for the next adventure. He’s redeemed millions of rewards to visit over 40 countries and enjoys teaching people how they can do the same.Craig loves figuring out creative ways to keep travel costs down so there’s more money to have fun in unique places. From cycling across the islands of southern Japan to snowboarding through Antarctic snow blasts on volcanoes in New Zealand, he’s your man for active and sporty travel ideas.Benjamin Din, Lead WriterBenjamin is a travel enthusiast who thrives on maximizing points and miles, elite status, and credit card perks to unlock unforgettable experiences — not just for himself, but for his friends and family too.Last year, he flew over 100 flights, exploring all six inhabited continents, (Antarctica is still on the bucket list!) experiencing everything from basic economy to international first class. You’ll often find him in a Star Alliance lounge, as he chases down his next big milestone: becoming a United Airlines million miler.Meghan Coyle, Editor and Smart Travel co-hostMeghan loves traveling with her family, including her mom, dad, and three younger sisters. She has now gotten all of her family and friends into using credit cards and loyalty programs to make travel more affordable and upgrade the experience.Meghan studied abroad in New Zealand in college, so she is always looking for beautiful, adventurous destinations with great hiking. These days, she’s using most of her points and miles on trips to destination weddings in Hawaii, Florida, Mexico, Scotland, Italy, and Australia.Claire Tsosie, Managing EditorClaire is a veteran credit cards and travel Nerd. She loves traveling with her husband and two kids. Her personal goal is to take four family trips every year. She uses points, miles and other credit card benefits to keep costs down. Upcoming adventures include a visit to Legoland, a weekend in Washington’s Cascade Mountains, a road trip to Montana and a week in Boston.Erin Hurd, DirectorErin Hurd is a credit card and travel rewards expert. Formerly a writer and editor and now heading NerdWallet’s travel business. Her love of travel led to a passion for credit card and loyalty rewards to subsidize trips, and she thrives on teaching others how to harness the power of credit card rewards.When she's not helping NerdWallet users find the best travel value, Erin is planning her next adventure for her family of four using points and miles — sometimes flying in premium cabins, often staying in posh suites, always spending a small fraction of the retail price.Subscribe to our free TravelNerd newsletter for inspiration, tips and money-saving strategies, delivered straight to your inbox.By signing up, you will receive newsletters and promotional content and agree to our Terms of Use and acknowledge the data practices in our Privacy Policy. You may unsubscribe at any time.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2018/04/GettyImages-672425798_FB.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eWant to travel more, but pay less?\u003c/span\u003e\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit card rewards, hotel points and airline miles can be like travel “cheat codes” to unlocking more affordable trips.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThey can make it possible to fly first class to a far-flung island; visit relatives over the holidays without wiping out your bank account; create some Disney magic for your family; and help make any of your travel bucket list dreams come true.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe challenge? For many people, it\u0026#39;s knowing where or how to get started.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThat’s why we started \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eTravelNerd\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e, a free newsletter designed to help you crack the code on spending less on your travel.\n\u003c/span\u003e\u003c/p\u003e\u003cdiv data-currency=\"Columns\"\u003e\u003cdiv\u003e\u003cp data-currency=\"Text\"\u003eSubscribe to our free TravelNerd newsletter for inspiration, tips and money-saving strategies, delivered straight to your inbox.\u003c/p\u003e\u003c/div\u003e\u003cp data-currency=\"Text\"\u003eBy signing up, you will receive newsletters and promotional content and agree to our \u003ca href=\"https://www.nerdwallet.com/p/terms-of-use\" data-currency=\"Link\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eTerms of Use\u003c/a\u003e and acknowledge the data practices in our \u003ca href=\"https://www.nerdwallet.com/p/privacy-policy\" data-currency=\"Link\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ePrivacy Policy\u003c/a\u003e. You may unsubscribe at any time.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eYour vacation can\u0026#39;t afford to miss this\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEach week our expert Travel Nerds will show you tips and tricks to get the most out of your travel dollars, like:\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ How to get started using travel points and miles (without all the overwhelming jargon).\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ Where to find cheap flights (that you actually want to take).\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ Tips to score hotel upgrades.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ How to smartly use credit cards to earn tons of rewards and perks.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ Lesser-known ways to make your Disney trip cheaper and easier.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ Ways to make your travels more affordable even without credit card rewards.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ What all the latest travel news means for you.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ Fast-moving travel deals to help save you a bundle.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e✅ And much more.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOur experts will deliver all this right to your inbox, plus hot deals and limited-time offers — absolutely free.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eMeet the Travel Nerds 🤓\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Helmet, Clothing, Glove\" src=\"https://www.nerdwallet.com/tachyon/2025/03/nerd-meghan-e1743087384969.jpeg?fit=320%2C2580\" credit=\"unknown\" id=\"1720965\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eSally French, Lead Writer and Smart Travel co-host\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA former Cast Member at Disneyland (that\u0026#39;s Disney-speak for employee), Sally is our resident Disney expert. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShe\u0026#39;s also a competitive weightlifter and powerlifter, so many of her travel involves going to meets (often fueled on the famous Hampton Inn waffles).\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShe’s biked over the sea ice in the Arctic Circle, climbed to the top of the Eiffel Tower with all her carry-on bags during a 10-hour layover in Paris, hiked 25 miles in a day around Italy\u0026#39;s Cinque Terre and biked the famous Hải Vân Pass in Vietnam. She hates relaxing.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Face, Happy, Head\" src=\"https://www.nerdwallet.com/tachyon/2025/03/nerd-craig-joseph-e1743087693871.jpeg?fit=320%2C2983\" credit=\"unknown\" id=\"1720967\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eCraig Joseph, Lead Writer\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCraig lives to explore and is always looking for the next adventure. He’s redeemed millions of rewards to visit over 40 countries and enjoys teaching people how they can do the same.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCraig loves figuring out creative ways to keep travel costs down so there’s more money to have fun in unique places. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFrom cycling across the islands of southern Japan to snowboarding through Antarctic snow blasts on volcanoes in New Zealand, he’s your man for active and sporty travel ideas.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Accessories, Glasses, Photography\" src=\"https://www.nerdwallet.com/tachyon/2025/03/nerd-ben-e1743087806253.jpg?fit=320%2C550\" credit=\"unknown\" id=\"1720970\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eBenjamin\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eDin\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eLead \u003c/span\u003e\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eWriter\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBenjamin is a travel enthusiast who thrives on maximizing points and miles, elite status, and credit card perks to unlock unforgettable experiences — not just for himself, but for his friends and family too.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eLast year, he flew over 100 flights, exploring all six inhabited continents, (Antarctica is still on the bucket list!) experiencing everything from basic economy to international first class. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYou’ll often find him in a Star Alliance lounge, as he chases down his next big milestone: becoming a United Airlines million miler.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Fir, Plant, Tree\" src=\"https://www.nerdwallet.com/tachyon/2025/03/nerd-meghan-coyle.png?fit=320%2C1010\" credit=\"unknown\" id=\"1720966\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eMeghan Coyle, Editor\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e\u003cspan\u003e and Smart Travel co-host\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMeghan loves traveling with her family, including her mom, dad, and three younger sisters. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShe has now gotten all of her family and friends into using credit cards and loyalty programs to make travel more affordable and upgrade the experience.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMeghan studied abroad in New Zealand in college, so she is always looking for beautiful, adventurous destinations with great hiking. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThese days, she’s using most of her points and miles on trips to destination weddings in Hawaii, Florida, Mexico, Scotland, Italy, and Australia.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Face, Head, Person\" src=\"https://www.nerdwallet.com/tachyon/2025/03/nerd-claire-tsosie-e1743087887934.jpeg?fit=320%2C2568\" credit=\"unknown\" id=\"1720968\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eClaire Tsosie, Managing Editor\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eClaire is a veteran credit cards and travel Nerd. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShe loves traveling with her husband and two kids. Her personal goal is to take four family trips every year. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShe uses points, miles and other credit card benefits to keep costs down. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eUpcoming adventures include a visit to Legoland, a weekend in Washington’s Cascade Mountains, a road trip to Montana and a week in Boston.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Rock, Face, Head\" src=\"https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/03/private-coaching-erin-family-197x192.png\" credit=\"unknown\" id=\"1720973\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003e\u003cspan\u003eErin Hurd, \u003c/span\u003e\u003c/span\u003e\u003cspan\u003e\n\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eDirector\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eErin Hurd is a credit card and travel rewards expert. Formerly a writer and editor and now heading NerdWallet’s travel business. Her love of travel led to a passion for credit card and loyalty rewards to subsidize trips, and she thrives on teaching others how to harness the power of credit card rewards.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen she\u0026#39;s not helping NerdWallet users find the best travel value, Erin is planning her next adventure for her family of four using points and miles — sometimes flying in premium cabins, often staying in posh suites, always spending a small fraction of the retail price.\u003c/span\u003e\u003c/p\u003e\u003cdiv data-currency=\"Columns\"\u003e\u003cdiv\u003e\u003cp data-currency=\"Text\"\u003eSubscribe to our free TravelNerd newsletter for inspiration, tips and money-saving strategies, delivered straight to your inbox.\u003c/p\u003e\u003c/div\u003e\u003cp data-currency=\"Text\"\u003eBy signing up, you will receive newsletters and promotional content and agree to our \u003ca href=\"https://www.nerdwallet.com/p/terms-of-use\" data-currency=\"Link\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eTerms of Use\u003c/a\u003e and acknowledge the data practices in our \u003ca href=\"https://www.nerdwallet.com/p/privacy-policy\" data-currency=\"Link\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ePrivacy Policy\u003c/a\u003e. You may unsubscribe at any time.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-24T17:48:26Z",
  "modifiedTime": null
}
