{
  "id": "5d39d4b4-9c65-4950-9e5c-b508058b8e58",
  "title": "Would You Rather Have A Penny That Doubles Each Day For A Month Or $1 Million?",
  "link": "https://thecollegeinvestor.com/17145/would-you-rather-have-a-penny-that-doubles-each-day-for-a-month-or-1-million/",
  "description": "The Fable of the Grain of Rice shows how it's better to get a penny that doubles daily versus having $1,000,000 upfront. This is compound interest. The post Would You Rather Have A Penny That Doubles Each Day For A Month Or $1 Million? appeared first on The College Investor.",
  "author": "Robert Farrington",
  "published": "Mon, 14 Oct 2024 16:00:00 +0000",
  "source": "https://thecollegeinvestor.com/feed/",
  "categories": [
    "Investing"
  ],
  "byline": "Robert Farrington",
  "length": 7039,
  "excerpt": "The Fable of the Grain of Rice shows which is better: a penny that doubles every day versus having $1,000,000 upfront. This is compound interest.",
  "siteName": "The College Investor",
  "favicon": "https://thecollegeinvestor.com/wp-content/uploads/2020/08/cropped-facicon-cap-192x192.png.webp",
  "text": "Would you rather have a penny that doubles each day for a month or 1 million dollars? I saw this question the other day, and it reminded me of one of my favorite stories from high school math (yes, that's pretty nerdy, but this is a personal finance blog).So, before I tell the story, think about it:If a genie appeared and gave you a choice, what you would choose: would you rather have a penny today, that doubled everyday for a month, or $1 million today? The fact is, a lot of people get caught up in the initial amounts: $1,000,000.00 versus $0.01. But let's share the story of the The Grain of Rice, a mathematical fable from India. The Grain Of Rice FableLong ago in India, there lived a raja who believed he was wise and fair, as a raja should be. The people in his province were rice farmers. The raja decreed that everyone must give nearly all of their rice to him. \"I will store the rice safely,\" the raja promised the people, \"so that in time of famine, everyone will have rice to eat, and no one will go hungry.\" Each year, the raja's rice collectors gathered nearly all of the people's rice and carried it away to the royal storehouses.For many years, the rice grew well. The people gave nearly all of their rice to the raja, and the storehouses were always full. But the people were left with only enough rice to get by. Then one year the rice grew badly and there was famine and hunger. The people had no rice to give to the raja, and they had no rice to eat. The raja's ministers implored him, \"Your highness, let us open the royal storehouses and give the rice to the people, as you promised.\" \"No!\" cried the raja. How do I know how long the famine will last? I must have the rice for myself. Promis or no promise, a raja must not go hungry!\"Time went on, and the people grew more and more hungry. But the raja would not give out the rice. One day, the raja ordered a feast for himself and his court--as, it seemed to him, a raja should now and then, even when there is famine. A servant led an elephant from a royal storehouse to the palace, carrying two full baskets of rice. A village girl named Rani saw that a trickle of rice was falling from one of the baskets. Quickly she jumped up and walked along beside the elephant, catching the falling rice in her skirt. She was clever, and she began to make a plan.At the palace, a guard cried, \"Halt, thief! Where are you going with that rice?\"\"I am not a thief,\" Rani replied. \"This rice fell from one of the baskets, and I am returning it now to the raja.\"When the raja heard about Rani's good deed, he asked his ministers to bring her before him.\"I wish to reward you for returning what belongs to me,\" the raja said to Rani. \"Ask me for anything, and you shall have it.\"\"Your highness,\" said Rani, \"I do not deserve any reward at all. But if you wish, you may give me one grain of rice.\"\"Only one grain of rice?\" exclaimed the raja. \"Surely you will allow me to reward you more plentifully, as a raja should.\"\"Very well,\" said Rani. \"If it pleased Your Highness, you may reward me in this way. Today, you will give me a single grain of rice. Then, each day for thirty days you will give me double the rice you gave me the day before. Thus, tomorrow you will give me two grains of rice, the next day four grains of rice, and so on for thirty day.\"\"This seems to be a modest reward,\" said the raja. \"But you shall have it.\"And Rani was presented with a single grain of rice.The next day, Rani was presented with 2 grains of rice.And the following day, Rani was presented with 4 grains of rice.On the ninth day, Rani was presented with 256 grains of rice. She had received in all five hundred and eleven grains of rice, enough for only a small handful. \"This girl is honest, but not very clever,\" thought the raja. \"She would have gained more rice by keeping what fell into her skirt!\"On the twelfth day, Rani received 2048 grains of rice, about four handfuls.On the thirteenth day, she received 4096 grains of rice, enough to fill a bowl.On the sixteenth day, Rani was presented with a bag containing 32,768 grains of rice. All together she had enough rice for two bags. \"This doubling up adds up to more rice than I expected\" thought the raja. \"But surely her reward won't amount to much more.\"On the twenty-first day, she received 1,048,576 grains of rice, enough to fill a basket.On the twenty-fourth day, Rani was presented with 8,388,608 grains of rice--enough to fill eight baskets, which were carried to her by eight royal deer.On the twenty-seventh day, thirty-two brahma bulls were needed to deliver sixty-four baskets of rice. The raja was deeply troubled. \"One grain of rice has grown very great indeed,\" he thought. \"But I shall fulfill the reward to the end, as a raja should.\"On the twenty-ninth day, Rani was presented with the contents of two royal storehouses.On the thirtieth and final day, two hundred and fifty-six elephants crossed the province, carrying the contents of the last four royal storehouses- 536,870,912 grains of rice.All together, Rani had received more than one billion grains of rice. The raja had no more rice to give. \"And what will you do with this rice,\" said the raja with a sigh, \"now that I have none?\"\"I shall give it to all the hungry people,\" said Rani, \"and I shall leave a basket of rice for you, too, if you promise from now on to take only as much rice as you need.\"\"I promise,\" said the raja. And for the rest of his days, the raja was truly wise and fair, as a raja should be.The Power Of Compound InterestNow that you've read the fable, you can see the choice is pretty clear: it's better to have a single penny that doubles everyday for a month, versus $1 million up front. This is because of the power of compound interest.If you took a single penny and doubled it everyday, by day 30, you would have $5,368,709.12.However, it's important to note that it's all about the power of doubling - if you asked the same question, but changed the doubling time to just 27 days, you would only have $671,088.64.Chart Of A Penny Doubling Each DayIf you're curious to see what that looks like, here is a chart that shows the math of a penny doubling each day. This is the real power of compound interest! As you notice, the growth really starts accelerating around day 22. You don't even get past $100 until Day 15!Key Takeaway For InvestingThe key takeaway from all of this should be: start investing early and often. The biggest gains and returns always happen later in life. If you start investing in your portfolio today and earn a modest 6% return, that might not seem like a lot of money today.But in 30 years? Earning a 6% return throughout your life, you'll start seeing huge returns later in life as you approach retirement.Remember, investing is a long term endeavor - you shouldn't be looking to double your money in 3-5 years. You should be looking to grow your money over time. Remember, the Rule of 72 will guide in you in how long it will take to double.What do you think about the Fable of the Grain of Rice?",
  "image": "https://thecollegeinvestor.com/wp-content/uploads/2015/11/TheCollegeInvestor_1200x628_PennyDoublesEveryday-8.12.22.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eWould you rather have a penny that doubles each day for a month or 1 million dollars?\u003c/strong\u003e I saw this question the other day, and it reminded me of one of my favorite stories from high school math (yes, that\u0026#39;s pretty nerdy, but this is a personal finance blog).\u003c/p\u003e\u003cp\u003eSo, before I tell the story, think about it:\u003c/p\u003e\u003cp\u003eIf a genie appeared and gave you a choice, what you would choose: \u003cstrong\u003ewould you rather have a penny today, that doubled everyday for a month, or $1 million today? \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe fact is, a lot of people get caught up in the initial amounts: $1,000,000.00 versus $0.01.\u003c/p\u003e\n\u003cp\u003eBut let\u0026#39;s share the story of the \u003ca href=\"https://jwilson.coe.uga.edu/EMT668/EMAT6680.F99/Martin/instructional%20unit/day4.exponential/excel/grainofrice.html\" target=\"_blank\" rel=\"noopener\"\u003eThe Grain of Rice\u003c/a\u003e, a mathematical fable from India.\u003ca href=\"https://thecollegeinvestor.com/go/masterworks\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cstrong\u003e \u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1635021590536\"\u003eThe Grain Of Rice Fable\u003c/h2\u003e\u003cp\u003eLong ago in India, there lived a raja who believed he was wise and fair, as a raja should be. The people in his province were rice farmers. The raja decreed that everyone must give nearly all of their rice to him. \u0026#34;I will store the rice safely,\u0026#34; the raja promised the people, \u0026#34;so that in time of famine, everyone will have rice to eat, and no one will go hungry.\u0026#34; Each year, the raja\u0026#39;s rice collectors gathered nearly all of the people\u0026#39;s rice and carried it away to the royal storehouses.\u003c/p\u003e\u003cp\u003eFor many years, the rice grew well. The people gave nearly all of their rice to the raja, and the storehouses were always full. But the people were left with only enough rice to get by. Then one year the rice grew badly and there was famine and hunger. The people had no rice to give to the raja, and they had no rice to eat. The raja\u0026#39;s ministers implored him, \u0026#34;Your highness, let us open the royal storehouses and give the rice to the people, as you promised.\u0026#34; \u0026#34;No!\u0026#34; cried the raja. How do I know how long the famine will last? I must have the rice for myself. Promis or no promise, a raja must not go hungry!\u0026#34;\u003c/p\u003e\u003cp\u003eTime went on, and the people grew more and more hungry. But the raja would not give out the rice. One day, the raja ordered a feast for himself and his court--as, it seemed to him, a raja should now and then, even when there is famine. A servant led an elephant from a royal storehouse to the palace, carrying two full baskets of rice. A village girl named Rani saw that a trickle of rice was falling from one of the baskets. Quickly she jumped up and walked along beside the elephant, catching the falling rice in her skirt. She was clever, and she began to make a plan.\u003c/p\u003e\u003cp\u003eAt the palace, a guard cried, \u0026#34;Halt, thief! Where are you going with that rice?\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I am not a thief,\u0026#34; Rani replied. \u0026#34;This rice fell from one of the baskets, and I am returning it now to the raja.\u0026#34;\u003c/p\u003e\u003cp\u003eWhen the raja heard about Rani\u0026#39;s good deed, he asked his ministers to bring her before him.\u003c/p\u003e\u003cp\u003e\u0026#34;I wish to reward you for returning what belongs to me,\u0026#34; the raja said to Rani. \u0026#34;Ask me for anything, and you shall have it.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Your highness,\u0026#34; said Rani, \u0026#34;I do not deserve any reward at all. But if you wish, you may give me one grain of rice.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Only one grain of rice?\u0026#34; exclaimed the raja. \u0026#34;Surely you will allow me to reward you more plentifully, as a raja should.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Very well,\u0026#34; said Rani. \u0026#34;If it pleased Your Highness, you may reward me in this way. Today, you will give me a single grain of rice. Then, each day for thirty days you will give me double the rice you gave me the day before. Thus, tomorrow you will give me two grains of rice, the next day four grains of rice, and so on for thirty day.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;This seems to be a modest reward,\u0026#34; said the raja. \u0026#34;But you shall have it.\u0026#34;\u003c/p\u003e\u003cp\u003eAnd Rani was presented with a single grain of rice.\u003c/p\u003e\u003cp\u003eThe next day, Rani was presented with 2 grains of rice.\u003c/p\u003e\u003cp\u003eAnd the following day, Rani was presented with 4 grains of rice.\u003c/p\u003e\u003cp\u003eOn the ninth day, Rani was presented with 256 grains of rice. She had received in all five hundred and eleven grains of rice, enough for only a small handful. \u0026#34;This girl is honest, but not very clever,\u0026#34; thought the raja. \u0026#34;She would have gained more rice by keeping what fell into her skirt!\u0026#34;\u003c/p\u003e\u003cp\u003eOn the twelfth day, Rani received 2048 grains of rice, about four handfuls.\u003c/p\u003e\u003cp\u003eOn the thirteenth day, she received 4096 grains of rice, enough to fill a bowl.\u003c/p\u003e\u003cp\u003eOn the sixteenth day, Rani was presented with a bag containing 32,768 grains of rice. All together she had enough rice for two bags. \u0026#34;This doubling up adds up to more rice than I expected\u0026#34; thought the raja. \u0026#34;But surely her reward won\u0026#39;t amount to much more.\u0026#34;\u003c/p\u003e\u003cp\u003eOn the twenty-first day, she received 1,048,576 grains of rice, enough to fill a basket.\u003c/p\u003e\u003cp\u003eOn the twenty-fourth day, Rani was presented with 8,388,608 grains of rice--enough to fill eight baskets, which were carried to her by eight royal deer.\u003c/p\u003e\u003cp\u003eOn the twenty-seventh day, thirty-two brahma bulls were needed to deliver sixty-four baskets of rice. The raja was deeply troubled. \u0026#34;One grain of rice has grown very great indeed,\u0026#34; he thought. \u0026#34;But I shall fulfill the reward to the end, as a raja should.\u0026#34;\u003c/p\u003e\u003cp\u003eOn the twenty-ninth day, Rani was presented with the contents of two royal storehouses.\u003c/p\u003e\u003cp\u003eOn the thirtieth and final day, two hundred and fifty-six elephants crossed the province, carrying the contents of the last four royal storehouses- 536,870,912 grains of rice.\u003c/p\u003e\u003cp\u003eAll together, Rani had received more than \u003cstrong\u003eone billion grains of rice\u003c/strong\u003e. The raja had no more rice to give. \u0026#34;And what will you do with this rice,\u0026#34; said the raja with a sigh, \u0026#34;now that I have none?\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I shall give it to all the hungry people,\u0026#34; said Rani, \u0026#34;and I shall leave a basket of rice for you, too, if you promise from now on to take only as much rice as you need.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I promise,\u0026#34; said the raja. And for the rest of his days, the raja was truly wise and fair, as a raja should be.\u003c/p\u003e\u003ch2 id=\"t-1635021590537\"\u003eThe Power Of Compound Interest\u003c/h2\u003e\u003cp\u003eNow that you\u0026#39;ve read the fable, you can see the choice is pretty clear: it\u0026#39;s better to have a single penny that doubles everyday for a month, versus $1 million up front. This is because of \u003ca href=\"https://thecollegeinvestor.com/32879/compound-interest/\"\u003ethe power of compound interest\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIf you took a single penny and doubled it everyday, by day 30, you would have \u003cstrong\u003e$5,368,709.12.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eHowever, it\u0026#39;s important to note that it\u0026#39;s all about the power of doubling - if you asked the same question, but changed the doubling time to just 27 days, you would only have $671,088.64.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1664386524276\"\u003eChart Of A Penny Doubling Each Day\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re curious to see what that looks like, here is a chart that shows the math of a penny doubling each day. This is the real power of compound interest! As you notice, the growth really starts accelerating around day 22. You don\u0026#39;t even get past $100 until Day 15!\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1635021590538\"\u003eKey Takeaway For Investing\u003c/h2\u003e\u003cp\u003eThe key takeaway from all of this should be: \u003ca href=\"https://thecollegeinvestor.com/start-investing/\" target=\"_blank\"\u003e\u003cstrong\u003estart investing early and often\u003c/strong\u003e\u003c/a\u003e. The biggest gains and returns always happen later in life. If you start investing in your portfolio today and earn a modest 6% return, that might not seem like a lot of money today.\u003c/p\u003e\u003cp\u003eBut in 30 years? Earning a 6% return throughout your life, you\u0026#39;ll start seeing huge returns later in life as you approach retirement.\u003c/p\u003e\u003cp\u003eRemember, investing is a long term endeavor - you shouldn\u0026#39;t be looking to double your money in 3-5 years. You should be looking to grow your money over time. Remember, \u003ca href=\"https://thecollegeinvestor.com/9660/the-rule-of-72-for-investing/\"\u003ethe Rule of 72\u003c/a\u003e will guide in you in how long it will take to double.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWhat do you think about the Fable of the Grain of Rice?\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-14T09:00:00-07:00",
  "modifiedTime": "2024-10-14T09:14:43-07:00"
}
