{
  "id": "93531428-16a5-4a57-8c77-9916d366909f",
  "title": "House Proposes College Cost Reduction Act",
  "link": "https://thecollegeinvestor.com/45282/college-cost-reduction-act/",
  "description": "The College Cost Reduction Act seeks to fix student loan lending, improve student outcomes, and hold colleges accountable to their costs. The post House Proposes College Cost Reduction Act appeared first on The College Investor.",
  "author": "Mark Kantrowitz",
  "published": "Sun, 15 Dec 2024 12:15:00 +0000",
  "source": "https://thecollegeinvestor.com/feed/",
  "categories": [
    "Student Loans"
  ],
  "byline": "Mark Kantrowitz",
  "length": 12950,
  "excerpt": "The College Cost Reduction Act seeks to fix student loan lending, improve student outcomes, and hold colleges accountable to their costs.",
  "siteName": "The College Investor",
  "favicon": "https://thecollegeinvestor.com/wp-content/uploads/2020/08/cropped-facicon-cap-192x192.png",
  "text": "Source: The College Investor The College Cost Reduction Act (H.R. 6951) includes proposals to improve student success, accountability, transparency, college access and college affordability. Several of the proposals are focused on student loans, including new limits on annual and aggregate borrowing. The 224-page legislation was introduced by Rep. Virginia Foxx (R-NC-5), chair of the House Committee on Education and the Workforce, on January 11, 2024. It is part of the latest effort to reauthorize the Higher Education Act of 1965. She recently made statements that she intends to push this forward in January 2025 with the new Trump administration.Some of the proposals have bipartisan support and some do not. Rep. Foxx said, “Democrats and Republicans agree that student loan debt in America has reached astronomical levels,” undercutting the pursuit of postsecondary education. But, while some of the proposals will face opposition in the Democrat-controlled Senate, there is room for negotiation between Democrats and Republicans. Caps Federal Student Aid At Median Cost Of CollegeTotal annual federal student aid, including federal grants and loans, cannot exceed the median cost of college for students enrolled in similar degree programs nationwide.The median cost of college will be calculated based on data from the previous award year.Based on data from the 2019-2020 National Postsecondary Student Aid Study (NPSAS:20), the median cost of attendance is about $12,000 for Certificate programs, $11,000 for Associate’s degrees, $26,000 for Bachelor’s degrees, $24,000 for Master’s degrees, $36,000 for PhDs and $59,000 for graduate professional degrees.New Student Loan LimitsThe legislation establishes new aggregate federal student loan limits for undergraduate and graduate students.$50,000 for undergraduate students (up to $23,000 of which may be subsidized)$100,000 for graduate students$150,000 for graduate professional programsTotal aggregate loans are also capped at $200,000 per student.Undergraduate students may exceed the limits to satisfy licensure requirements if their program demonstrates strong college completion and employment outcomes.This compares with previous limits of $31,000 for dependent undergraduate students and $57,500 for independent undergraduate students, and aggregate limits of $138,500 for graduate students (including undergraduate loans) and $224,000 for medical school students. The legislation will sunset the Parent PLUS and Grad PLUS loan programs, which do not have aggregate loan limits. Annual limits will be capped at the median cost of college of the student’s program. Most students borrow less than the median cost of college, including PLUS loans, except for 8% of students in Master’s degree programs and about a fifth of students in graduate professional degree programs. College financial aid administrators will have the ability to lower loan limits based on the median or average starting salary for program graduates, enrollment status (full or part-time), degree level (e.g., Certificate, Associate’s degree, Bachelor’s degree, Master’s degree, PhDs, MDs and other graduate professional degrees). New Student Loan Repayment PlansThe legislation streamlines federal student loan repayment plans, replacing the dozen different repayment plans with just two repayment plans, standard 10-year repayment and an income-driven repayment plan. The new income-driven repayment plan, which will be called the Repayment Assistance Plan (RAP), is similar to the Pay-As-You-Earn (PAYE) repayment plan. Monthly payments are equal to 10% of discretionary income, where discretionary income is defined as the amount by which adjusted gross income (AGI) exceeds 150% of the poverty line.There are, however, a few differences:If a borrower makes on-time payments, at least half of the payment will be applied to the principal balance of the loan. If the rest of the payment does not fully cover accrued interest, the excess interest will be waived. The total payments will be capped at the total principal and interest that would have been paid under the standard 10-year repayment plan. This cap on total payments applies to all borrowers, including current borrowers who switch into this plan.   Current borrowers will be grandfathered in, and can choose to repay their loans under their existing repayment plans or one of the two new repayment plans. New borrowers will be limited to the new repayment plans. This effectively ends the SAVE repayment plan for new borrowers.The legislation will prohibit the U.S. Department of Education from creating new repayment plans or modifying existing repayment plans if the changes increase costs to the federal government. Other Student Loan ChangesThe legislation will make other changes to federal student loans, including:Allows borrowers to rehabilitate defaulted federal student loans twice, instead of just once. Rehabilitation removes the default from the borrower’s credit history.Eliminates interest capitalization for all borrowers, including both new and current borrowers.Eliminates origination fees on all new federal student loans. The current fees are about 1% on Federal Direct Stafford Loans and about 4% on Federal Direct PLUS Loans. Bans new regulations or executive actions relating to student loans if they will increase costs to the federal government. College Risk-Sharing On Federal Student LoansNew risk-sharing rules will require colleges to repay the federal government for a portion of the unpaid interest and principal on loans made to their former students. The goal is to drive more accountability onto the colleges for both their costs and the outcomes of their students.There will be two formulas for the annual payments, one for students who graduated and one for students who did not graduate. In both cases the total non-repayment balance will be multiplied by a earnings-to-price ratio or the college completion rate.For the cohort of students who graduate, one minus the ratio of the median value-added earnings of students who graduate to the median total price charged to the students in the cohort. The minimum and maximum ratios are set at 0% and 100%. For the cohort of students who do not graduate, the percentage of students who received federal student aid who did not graduate within 150% of the normal time-frame for the student’s degree program. For students at 2-year colleges, it will be based on the percentage of students who did not graduate with a Bachelor’s degree within 6 years. If the college fails to make the annual risk-sharing payments to the U.S. Department of Education by certain deadlines, there will be additional penalties:If the college doesn’t make the risk-sharing payments within 90 days, they will be charged interest at the average interest rate on loans in the student cohort. If the college doesn’t make the risk-sharing payments within 12 months, they will lose eligibility to make federal student loans to students in the programs for which the college failed to make risk-sharing payments. If the college doesn’t make the risk-sharing payments within 18 months, they will also lose eligibility for Federal Pell Grants.If the college doesn’t make the risk-sharing payments within two years, they will lose eligibility for federal student aid for at least 10 years. If the college agrees to stop making federal student loans to students enrolled in the program of study for at least 10 years, the U.S. Department of Education will reduce the risk-sharing payment for that program by 50%. Colleges Facing Biggest Risk Sharing CostsIn an analysis done by the Foundation for Research on Equal Opportunity explored which colleges may be facing the biggest risk sharing costs. Based on the criteria above, some schools will be facing a nine-figure pentalty.University of Southern California (USC) - $169,207,408Strayer University - $104,900,720New York University (NYU) - $98,655,496University of Phoenix - $92,720,736Palmer College of Chiropractic - $91,767,112According to FREOPP, \"Around 85 percent of institutions where average ROI is negative would face a net penalty, and over half would face a penalty exceeding $500 per FTE student.\"Mandatory Standard For Financial Aid OffersThe legislation establishes a new mandatory standardized “Financial Aid Offer.” The standard financial aid offer will include the following:Lists college costs first, disaggregated into direct and indirect costs.Lists grants and scholarships next.Lists the net price, defined as college costs minus the grants and scholarships. In addition, colleges must disclose their scholarship displacement policies.Related: How To Read A Financial Aid OfferPell Plus ProgramThe Pell Plus Program will double the maximum Federal Pell Grant for juniors and seniors who are enrolled in eligible Bachelor’s degree programs who are on track to graduate on-time. Eligible Bachelor’s degree programs must publish a guaranteed maximum total price for the entire degree program that will not increase while the student is enrolled for up to a maximum of six years. In addition, the maximum total price must not exceed the value-added earnings of former students who completed the program.  New PROMISE Grant ProgramThe legislation will end the Federal Supplemental Education Opportunity Grant (FSEOG) and the Leveraging Education Assistance Program (LEAP).It will replace them with a new performance-based “PROMISE” grant program, which provides colleges with funding that can be used to improve college access, college affordability and college success. Colleges will receive up to $5,000 per federal student aid recipient. To be eligible for this funding, a college must satisfy the maximum total price guarantee requirements. The funding for the PROMISE program will come from $2 billion previously appropriated for the campus-based aid programs that are being sunset, plus risk-sharing payments made by colleges with high delinquency and default rates. Grants will be prioritized based on the percentage enrollment of low-income students.Updates to the College Scorecard ToolThe legislation requires the College Scorecard tool to include aggregate, program-level statistics on college costs, financial aid and student outcomes, as well as enrollment, progression and completion. This includes the total net price required for completion and college completion rates. It will be based on privacy-protected student-level data.The data will include average, median, minimum and maximum statistics for the cost of attendance, grants, total net price, student debt, loan repayment rates (both borrower-based and dollar-based), time in repayment, and annual earnings and value-added earnings for college graduates and dropouts. The statistics will be disaggregated by income categories (e.g., income quintiles), student aid index categories, Pell Grant recipient status, federal student loan recipients and non-recipients, sex, race and ethnicity, disability status, enrollment status, residency status, international student status and recipients of veterans education benefits.  The College Scorecard will let students compare colleges and degree programs. The legislation also creates a universal net price calculator that will provide students with personalized net price estimates for each college and program of study.Streamlines College TransfersColleges will be allowed to release education records to other colleges to make it easier for the colleges to award college credentials to the student, provided that the student consents to the reverse transfer process.Each college will be required to disclose its policies regarding the transfer of credits from other colleges (e.g., articulation agreements) and bans colleges from denying credit transfer based solely on the source of accreditation of the other college.Regulatory ChangesThe legislation repeals or requires changes to many regulations issued during the Biden and Obama administrations, including90/10 ruleGainful employmentChange in ownershipFinancial responsibility Incentive compensationThird-party servicerClosed school dischargesBorrower defense to repaymentPre-dispute arbitrationFalse certification dischargesAbility to benefitThe executive branch will be blocked from issuing new regulations in some of these areas, such as the 90/10 rule and gainful employment. It also preempts state laws that conflict with federal requirements for and operations of federal student loan servicers. The legislation implements changes to accreditation, requiring accreditors to focus on student outcomes, such as a comparison of median total price and median value-added earnings of graduates, labor market outcomes, loan repayment rates and college completion rates. It also allows the creation of industry-specific accreditors and makes it easier to create new accreditors. It allows colleges and programs not under sanction to change accreditors.",
  "image": "https://thecollegeinvestor.com/wp-content/uploads/2022/03/CollegeInvestor_1200x628_When_Dollar_Cost_Averaging_Works_and_When_It_Doesn_t.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"tve_flt\" data-post-id=\"45282\"\u003e\u003cdiv data-css=\"tve-u-18d134949b3\" data-float-d=\"1\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"College Cost Reduction Act | Source: The College Investor\" data-id=\"39388\" width=\"880\" data-init-width=\"1280\" height=\"495\" data-init-height=\"720\" title=\"CollegeInvestor_1280x720_Budget_Before_You_Borrow_Make_Sure_You_Know_The_College_Costs\" loading=\"lazy\" src=\"https://thecollegeinvestor.com/wp-content/uploads/2022/02/CollegeInvestor_1280x720_Budget_Before_You_Borrow_Make_Sure_You_Know_The_College_Costs.jpg\" data-width=\"880\" data-height=\"495\" data-css=\"tve-u-193c65edd5b\" srcset=\"https://thecollegeinvestor.com/wp-content/uploads/2022/02/CollegeInvestor_1280x720_Budget_Before_You_Borrow_Make_Sure_You_Know_The_College_Costs.jpg 1280w, https://thecollegeinvestor.com/wp-content/uploads/2022/02/CollegeInvestor_1280x720_Budget_Before_You_Borrow_Make_Sure_You_Know_The_College_Costs-300x169.jpg 300w, https://thecollegeinvestor.com/wp-content/uploads/2022/02/CollegeInvestor_1280x720_Budget_Before_You_Borrow_Make_Sure_You_Know_The_College_Costs-1024x576.jpg 1024w, https://thecollegeinvestor.com/wp-content/uploads/2022/02/CollegeInvestor_1280x720_Budget_Before_You_Borrow_Make_Sure_You_Know_The_College_Costs-768x432.jpg 768w\" sizes=\"auto, (max-width: 880px) 100vw, 880px\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-css=\"tve-u-193c65f2bdf\"\u003eSource: The College Investor\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\t\u003cp\u003eThe \u003ca href=\"https://edworkforce.house.gov/uploadedfiles/foxx_bill_text.pdf\" target=\"_blank\" rel=\"noopener\"\u003eCollege Cost Reduction Act (H.R. 6951)\u003c/a\u003e includes proposals to improve student success, accountability, transparency, college access and college affordability. Several of the proposals are focused on \u003ca href=\"https://thecollegeinvestor.com/student-loan-debt/\" target=\"_blank\"\u003estudent loans\u003c/a\u003e, including new limits on annual and aggregate borrowing. \u003c/p\u003e\u003cp\u003eThe 224-page legislation was introduced by Rep. Virginia Foxx (R-NC-5), chair of the House Committee on Education and the Workforce, on January 11, 2024. It is part of the latest effort to reauthorize the Higher Education Act of 1965. She recently made statements that she intends to push this forward in January 2025 with the new Trump administration.\u003c/p\u003e\u003cp\u003eSome of the proposals have bipartisan support and some do not. Rep. Foxx \u003ca href=\"https://edworkforce.house.gov/news/documentsingle.aspx?DocumentID=409975\" target=\"_blank\" rel=\"noopener\"\u003esaid\u003c/a\u003e, “Democrats and Republicans agree that student loan debt in America has reached astronomical levels,” undercutting the pursuit of postsecondary education. But, while some of the proposals will face opposition in the Democrat-controlled Senate, there is room for negotiation between Democrats and Republicans. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485203\"\u003e\u003cstrong\u003eCaps Federal Student Aid At Median Cost Of College\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eTotal annual federal student aid, including federal grants and loans, cannot exceed the median cost of college for students enrolled in similar degree programs nationwide.\u003c/p\u003e\u003cp\u003eThe median cost of college will be calculated based on data from the previous award year.\u003c/p\u003e\u003cp\u003eBased on data from the 2019-2020 National Postsecondary Student Aid Study (NPSAS:20), the median cost of attendance is about $12,000 for Certificate programs, $11,000 for Associate’s degrees, $26,000 for Bachelor’s degrees, $24,000 for Master’s degrees, $36,000 for PhDs and $59,000 for graduate professional degrees.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485204\"\u003e\u003cstrong\u003eNew Student Loan Limits\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation establishes new \u003ca href=\"https://thecollegeinvestor.com/42380/student-loan-borrowing-limits/\" target=\"_blank\"\u003eaggregate federal student loan limits\u003c/a\u003e for undergraduate and graduate students.\u003c/p\u003e\u003cul\u003e\u003cli\u003e$50,000 for undergraduate students (up to $23,000 of which may be subsidized)\u003c/li\u003e\u003cli\u003e$100,000 for graduate students\u003c/li\u003e\u003cli\u003e$150,000 for graduate professional programs\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTotal aggregate loans are also capped at $200,000 per student.\u003c/p\u003e\u003cp\u003eUndergraduate students may exceed the limits to satisfy licensure requirements if their program demonstrates strong college completion and employment outcomes.\u003c/p\u003e\u003cp\u003eThis compares with previous limits of $31,000 for dependent undergraduate students and $57,500 for independent undergraduate students, and aggregate limits of $138,500 for graduate students (including undergraduate loans) and $224,000 for medical school students. \u003c/p\u003e\u003cp\u003eThe legislation will sunset the \u003ca href=\"https://thecollegeinvestor.com/17101/options-if-you-cant-afford-your-parent-plus-loans/\" target=\"_blank\"\u003eParent PLUS\u003c/a\u003e and \u003ca href=\"https://thecollegeinvestor.com/34178/grad-plus-loan/\" target=\"_blank\"\u003eGrad PLUS loan programs\u003c/a\u003e, which do not have aggregate loan limits. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAnnual limits will be capped at the median cost of college of the student’s program\u003c/strong\u003e. Most students borrow less than the median cost of college, including PLUS loans, except for 8% of students in Master’s degree programs and about a fifth of students in graduate professional degree programs. \u003c/p\u003e\u003cp\u003eCollege financial aid administrators will have the ability to lower loan limits based on the median or average starting salary for program graduates, enrollment status (full or part-time), degree level (e.g., Certificate, Associate’s degree, Bachelor’s degree, Master’s degree, PhDs, MDs and other graduate professional degrees). \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485205\"\u003e\u003cstrong\u003eNew Student Loan Repayment Plans\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation streamlines federal student loan repayment plans, replacing the dozen different repayment plans with just two repayment plans, standard 10-year repayment and an income-driven repayment plan. \u003c/p\u003e\u003cp\u003eThe new income-driven repayment plan, which will be called the Repayment Assistance Plan (RAP), is similar to the Pay-As-You-Earn (PAYE) repayment plan. Monthly payments are equal to 10% of discretionary income, where discretionary income is defined as the amount by which adjusted gross income (AGI) exceeds 150% of the \u003ca href=\"https://aspe.hhs.gov/topics/poverty-economic-mobility/poverty-guidelines\" target=\"_blank\" rel=\"noopener\"\u003epoverty line\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThere are, however, a few differences:\u003c/p\u003e\u003cul\u003e\u003cli\u003eIf a borrower makes on-time payments, at least half of the payment will be applied to the principal balance of the loan. If the rest of the payment does not fully cover accrued interest, the excess interest will be waived. \u003c/li\u003e\u003cli\u003eThe total payments will be capped at the total principal and interest that would have been paid under the standard 10-year repayment plan. This cap on total payments applies to all borrowers, including current borrowers who switch into this plan.   \u003c/li\u003e\u003c/ul\u003e\u003cp\u003eCurrent borrowers will be grandfathered in, and can choose to repay their loans under their existing repayment plans or one of the two new repayment plans. New borrowers will be limited to the new repayment plans. This effectively ends the \u003ca href=\"https://thecollegeinvestor.com/43245/save-repayment-plan/\" target=\"_blank\"\u003eSAVE repayment plan\u003c/a\u003e for new borrowers.\u003c/p\u003e\u003cp\u003eThe legislation will prohibit the U.S. Department of Education from creating new repayment plans or modifying existing repayment plans if the changes increase costs to the federal government. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485206\"\u003e\u003cstrong\u003eOther Student Loan Changes\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation will make other changes to federal student loans, including:\u003c/p\u003e\u003cul\u003e\u003cli\u003eAllows borrowers to \u003ca href=\"https://thecollegeinvestor.com/15577/student-loan-rehabilitation/\" target=\"_blank\"\u003erehabilitate defaulted federal student loans\u003c/a\u003e twice, instead of just once. Rehabilitation removes the default from the borrower’s credit history.\u003c/li\u003e\u003cli\u003eEliminates \u003ca href=\"https://thecollegeinvestor.com/34219/what-is-capitalized-interest/\" target=\"_blank\"\u003einterest capitalization\u003c/a\u003e for all borrowers, including both new and current borrowers.\u003c/li\u003e\u003cli\u003eEliminates origination fees on all new federal student loans. The current fees are about 1% on Federal Direct Stafford Loans and about 4% on Federal Direct PLUS Loans. \u003c/li\u003e\u003cli\u003eBans new regulations or executive actions relating to student loans if they will increase costs to the federal government. \u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485207\"\u003e\u003cstrong\u003eCollege Risk-Sharing On Federal Student Loans\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eNew risk-sharing rules will \u003cstrong\u003erequire colleges to repay the federal government for a portion of the unpaid interest and principal on loans made to their former students\u003c/strong\u003e. The goal is to drive more accountability onto the colleges for both their costs and the outcomes of their students.\u003c/p\u003e\u003cp\u003eThere will be two formulas for the annual payments, one for students who graduated and one for students who did not graduate. In both cases the total non-repayment balance will be multiplied by a earnings-to-price ratio or the college completion rate.\u003c/p\u003e\u003cul\u003e\u003cli\u003eFor the cohort of students who graduate, one minus the ratio of the median value-added earnings of students who graduate to the median total price charged to the students in the cohort. The minimum and maximum ratios are set at 0% and 100%. \u003c/li\u003e\u003cli\u003eFor the cohort of students who do not graduate, the percentage of students who received federal student aid who did not graduate within 150% of the normal time-frame for the student’s degree program. For students at 2-year colleges, it will be based on the percentage of students who did not graduate with a Bachelor’s degree within 6 years. \u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf the college fails to make the annual risk-sharing payments to the U.S. Department of Education by certain deadlines, there will be additional penalties:\u003c/p\u003e\u003cul\u003e\u003cli\u003eIf the college doesn’t make the risk-sharing payments within 90 days, they will be charged interest at the average interest rate on loans in the student cohort. \u003c/li\u003e\u003cli\u003eIf the college doesn’t make the risk-sharing payments within 12 months, they will lose eligibility to make federal student loans to students in the programs for which the college failed to make risk-sharing payments. \u003c/li\u003e\u003cli\u003eIf the college doesn’t make the risk-sharing payments within 18 months, they will also lose eligibility for Federal Pell Grants.\u003c/li\u003e\u003cli\u003eIf the college doesn’t make the risk-sharing payments within two years, they will lose eligibility for federal student aid for at least 10 years. \u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIf the college agrees to stop making federal student loans to students enrolled in the program of study for at least 10 years, the U.S. Department of Education will reduce the risk-sharing payment for that program by 50%. \u003c/p\u003e\u003ch3\u003eColleges Facing Biggest Risk Sharing Costs\u003c/h3\u003e\u003cp\u003eIn an analysis done by the \u003ca href=\"https://freopp.org/an-analysis-of-the-college-cost-reduction-act-947a954eb7de\" target=\"_blank\" rel=\"noopener\"\u003eFoundation for Research on Equal Opportunity\u003c/a\u003e explored which colleges may be facing the biggest risk sharing costs. Based on the criteria above, some schools will be facing a nine-figure pentalty.\u003c/p\u003e\u003cul\u003e\u003cli\u003eUniversity of Southern California (USC) - $169,207,408\u003c/li\u003e\u003cli\u003eStrayer University - $104,900,720\u003c/li\u003e\u003cli\u003eNew York University (NYU) - $98,655,496\u003c/li\u003e\u003cli\u003eUniversity of Phoenix - $92,720,736\u003c/li\u003e\u003cli\u003ePalmer College of Chiropractic - $91,767,112\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAccording to FREOPP, \u0026#34;Around 85 percent of institutions where average ROI is negative would face a net penalty, and over half would face a penalty exceeding $500 per FTE student.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485208\"\u003e\u003cstrong\u003eMandatory Standard For Financial Aid Offers\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation establishes a new mandatory standardized “Financial Aid Offer.” The standard financial aid offer will include the following:\u003c/p\u003e\u003cul\u003e\u003cli\u003eLists college costs first, disaggregated into direct and indirect costs.\u003c/li\u003e\u003cli\u003eLists grants and scholarships next.\u003c/li\u003e\u003cli\u003eLists the net price, defined as college costs minus the grants and scholarships. \u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIn addition, colleges must disclose their \u003ca href=\"https://thecollegeinvestor.com/42706/scholarship-gotchas/#:~:text=Scholarship%20displacement%20occurs%20when%20winning,scholarship%20recipients%20experience%20scholarship%20displacement.\" target=\"_blank\"\u003escholarship displacement policies\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRelated: \u003c/strong\u003e\u003ca href=\"https://thecollegeinvestor.com/21868/financial-aid-award/\" target=\"_blank\"\u003eHow To Read A Financial Aid Offer\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485209\"\u003e\u003cstrong\u003ePell Plus Program\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe Pell Plus Program will double the maximum \u003ca href=\"https://thecollegeinvestor.com/33804/pell-grants/\" target=\"_blank\"\u003eFederal Pell Grant\u003c/a\u003e for juniors and seniors who are enrolled in eligible Bachelor’s degree programs who are on track to graduate on-time. \u003c/p\u003e\u003cp\u003eEligible Bachelor’s degree programs must publish a guaranteed maximum total price for the entire degree program that will not increase while the student is enrolled for up to a maximum of six years. In addition, the maximum total price must not exceed the value-added earnings of former students who completed the program.  \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485210\"\u003e\u003cstrong\u003eNew PROMISE Grant Program\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation will end the Federal Supplemental Education Opportunity Grant (FSEOG) and the Leveraging Education Assistance Program (LEAP).\u003c/p\u003e\u003cp\u003eIt will replace them with a new performance-based “PROMISE” grant program, which provides colleges with funding that can be used to improve college access, college affordability and college success. \u003c/p\u003e\u003cp\u003eColleges will receive up to $5,000 per federal student aid recipient. To be eligible for this funding, a college must satisfy the maximum total price guarantee requirements. \u003c/p\u003e\u003cp\u003eThe funding for the PROMISE program will come from $2 billion previously appropriated for the campus-based aid programs that are being sunset, plus risk-sharing payments made by colleges with high delinquency and default rates. Grants will be prioritized based on the percentage enrollment of low-income students.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485211\"\u003e\u003cstrong\u003eUpdates to the College Scorecard Tool\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation requires the \u003ca href=\"https://collegescorecard.ed.gov/\" target=\"_blank\" rel=\"noopener\"\u003eCollege Scorecard tool\u003c/a\u003e to include aggregate, program-level statistics on college costs, financial aid and student outcomes, as well as enrollment, progression and completion. This includes the \u003ca href=\"https://thecollegeinvestor.com/38530/how-much-does-college-really-cost/\" target=\"_blank\"\u003etotal net price\u003c/a\u003e required for completion and college completion rates. It will be based on privacy-protected student-level data.\u003c/p\u003e\u003cp\u003eThe data will include average, median, minimum and maximum statistics for the cost of attendance, grants, total net price, student debt, loan repayment rates (both borrower-based and dollar-based), time in repayment, and annual earnings and value-added earnings for college graduates and dropouts. \u003c/p\u003e\u003cp\u003eThe statistics will be disaggregated by income categories (e.g., income quintiles), \u003ca href=\"https://thecollegeinvestor.com/43805/student-aid-index-sai-chart/\" target=\"_blank\"\u003estudent aid index categories\u003c/a\u003e, Pell Grant recipient status, federal student loan recipients and non-recipients, sex, race and ethnicity, disability status, enrollment status, residency status, international student status and recipients of veterans education benefits.  \u003c/p\u003e\u003cp\u003eThe College Scorecard will let students compare colleges and degree programs. \u003c/p\u003e\u003cp\u003eThe legislation also creates a universal net price calculator that will provide students with personalized net price estimates for each college and program of study.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485212\"\u003e\u003cstrong\u003eStreamlines College Transfers\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eColleges will be allowed to release education records to other colleges to make it easier for the colleges to award college credentials to the student, provided that the student consents to the reverse transfer process.\u003c/p\u003e\u003cp\u003eEach college will be required to disclose its policies regarding the transfer of credits from other colleges (e.g., articulation agreements) and bans colleges from denying credit transfer based solely on the source of accreditation of the other college.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"t-1705425485213\"\u003e\u003cstrong\u003eRegulatory Changes\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe legislation repeals or requires changes to many regulations issued during the Biden and Obama administrations, including\u003c/p\u003e\u003cul\u003e\u003cli\u003e90/10 rule\u003c/li\u003e\u003cli\u003eGainful employment\u003c/li\u003e\u003cli\u003eChange in ownership\u003c/li\u003e\u003cli\u003eFinancial responsibility \u003c/li\u003e\u003cli\u003eIncentive compensation\u003c/li\u003e\u003cli\u003eThird-party servicer\u003c/li\u003e\u003cli\u003eClosed school discharges\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://thecollegeinvestor.com/41671/student-loan-forgiveness-college-rankings/\" target=\"_blank\"\u003eBorrower defense to repayment\u003c/a\u003e\u003c/li\u003e\u003cli\u003ePre-dispute arbitration\u003c/li\u003e\u003cli\u003eFalse certification discharges\u003c/li\u003e\u003cli\u003eAbility to benefit\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe executive branch will be blocked from issuing new regulations in some of these areas, such as the 90/10 rule and gainful employment. \u003c/p\u003e\u003cp\u003eIt also preempts state laws that conflict with federal requirements for and operations of federal student loan servicers. \u003c/p\u003e\u003cp\u003eThe legislation implements changes to accreditation, requiring accreditors to focus on student outcomes, such as a comparison of median total price and median value-added earnings of graduates, labor market outcomes, loan repayment rates and college completion rates. It also allows the creation of industry-specific accreditors and makes it easier to create new accreditors. It allows colleges and programs not under sanction to change accreditors.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2024-12-15T04:15:00-08:00",
  "modifiedTime": "2024-12-14T10:12:55Z"
}
