{
  "id": "961171b6-b533-4963-bc26-b25ff67ccbe8",
  "title": "Investing Blog Roundup: Chasing the Hot Fund",
  "link": "https://obliviousinvestor.com/investing-blog-roundup-chasing-the-hot-fund/",
  "description": "Just a few years ago, if you read financial news at all, it was impossible to avoid headlines about Cathy Wood’s ARK Innovation fund. The fund’s performance was off the charts. What happened next is a story we’ve seen before, over and over: dollars pour into the fund, as investors don’t want to miss out, […]",
  "author": "Mike",
  "published": "Mon, 02 Sep 2024 12:00:21 +0000",
  "source": "https://obliviousinvestor.com/feed/",
  "categories": [
    "Roundup"
  ],
  "byline": "",
  "length": 1839,
  "excerpt": "Just a few years ago, if you read financial news at all, it was impossible to avoid headlines about Cathy Wood’s ARK Innovation fund. The fund’s performance was off the charts.",
  "siteName": "",
  "favicon": "",
  "text": "Investing Blog Roundup: Chasing the Hot Fund Just a few years ago, if you read financial news at all, it was impossible to avoid headlines about Cathy Wood’s ARK Innovation fund. The fund’s performance was off the charts. What happened next is a story we’ve seen before, over and over: dollars pour into the fund, as investors don’t want to miss out, and then the fund’s performance going forward it not great. In this particular case though, it wasn’t just mediocre performance. It has been a disaster for investors. Chasing Star Fund Manager Performance from Ben Carlson Other Recommended Reading What We Believed from Jonathan Clements What Do Good Financial Advisors Cost in 2024? from Jim Dahle Solving Social Security’s Funding Shortfall Requires Acknowledging Uncertainty from Alicia Munnell 5 Reasons to Simplify Your Investment Portfolio from Chris Mamula What Happens to Bonds When Stocks Go Up? from Ben Carlson Yes, You Can be Trained to Detect Imposter Scams from Kimberly Blanton Utilizing Swap Powers In Irrevocable Trusts To Add Flexibility And Income Tax Efficiency from Anna Pfaehler Employers Now Have Interim Guidance on Student Loans and Retirement Plans from Martha Waggoner Thanks for reading! New to Investing? See My Related Book: Investing Made Simple: Investing in Index Funds Explained in 100 Pages or Less See it on Amazon. Topics Covered in the Book: Asset Allocation: Why it's so important, and how to determine your own, How to to pick winning mutual funds, Roth IRA vs. traditional IRA vs. 401(k), Click here to see the full list. A Testimonial: \"A wonderful book that tells its readers, with simple logical explanations, our Boglehead Philosophy for successful investing.\" - Taylor Larimore, author of The Bogleheads' Guide to Investing Read other reviews on Amazon September 2, 2024",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch2\u003eInvesting Blog Roundup: Chasing the Hot Fund\u003c/h2\u003e\n\u003cdiv\u003e\u003cp\u003eJust a few years ago, if you read financial news at all, it was impossible to avoid headlines about Cathy Wood’s ARK Innovation fund. The fund’s performance was off the charts.\u003c/p\u003e\n\u003cp\u003eWhat happened next is a story we’ve seen before, over and over: dollars pour into the fund, as investors don’t want to miss out, and then the fund’s performance going forward it not great. In this particular case though, it wasn’t just mediocre performance. It has been a disaster for investors.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://awealthofcommonsense.com/2024/08/chasing-star-fund-manager-performance/\"\u003eChasing Star Fund Manager Performance\u003c/a\u003e from Ben Carlson\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eOther Recommended Reading\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://humbledollar.com/2024/08/what-we-believed/\"\u003eWhat We Believed\u003c/a\u003e from Jonathan Clements\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.whitecoatinvestor.com/cost-of-financial-advice/\"\u003eWhat Do Good Financial Advisors Cost in 2024?\u003c/a\u003e from Jim Dahle\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://crr.bc.edu/solving-social-securitys-funding-shortfall-requires-acknowledging-uncertainty/\"\u003eSolving Social Security’s Funding Shortfall Requires Acknowledging Uncertainty\u003c/a\u003e from Alicia Munnell\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.caniretireyet.com/simplify-investment-portfolio/\"\u003e5 Reasons to Simplify Your Investment Portfolio\u003c/a\u003e from Chris Mamula\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://awealthofcommonsense.com/2024/08/what-happens-to-bonds-when-stocks-go-up/\"\u003eWhat Happens to Bonds When Stocks Go Up?\u003c/a\u003e from Ben Carlson\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://crr.bc.edu/yes-you-can-be-trained-to-detect-imposter-scams/\"\u003eYes, You Can be Trained to Detect Imposter Scams\u003c/a\u003e from Kimberly Blanton\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.kitces.com/blog/swap-powers-irrevocable-trusts-tax-efficiency-idgt-estate-planning/\"\u003eUtilizing Swap Powers In Irrevocable Trusts To Add Flexibility And Income Tax Efficiency\u003c/a\u003e from Anna Pfaehler\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.journalofaccountancy.com/news/2024/aug/irs-guidance-student-loans-retirement.html\"\u003eEmployers Now Have Interim Guidance on Student Loans and Retirement Plans\u003c/a\u003e from Martha Waggoner\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThanks for reading!\u003c/p\u003e\n\u003c/div\u003e\u003ch3\u003eNew to Investing? See My Related Book:\u003c/h3\u003e\n\u003ctable\u003e\u003ccolgroup\u003e\u003ccol span=\"2\" width=\"75\"/\u003e\n\u003c/colgroup\u003e\u003ctbody\u003e\n\u003ctr height=\"13\"\u003e\n\u003ctd\u003e\u003ca href=\"http://www.amazon.com/dp/1950967158/?tag=obliviouspromo-20\" target=\"_blank\"\u003e\u003cimg title=\"Investing Made Simple\" src=\"https://obliviousinvestor.com/wp-content/uploads/2018/05/NewBook6Covertiltedscaled.jpg\" width=\"160\" alt=\"Book6FrontCoverTiltedBlue\"/\u003e\u003c/a\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003eInvesting Made Simple: Investing in Index Funds Explained in 100 Pages or Less\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"http://www.amazon.com/dp/1950967158/?tag=obliviouspromo-20\" target=\"_blank\"\u003eSee it on Amazon\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ca href=\"http://www.amazon.com/dp/1950967158/?tag=obliviouspromo-20\" target=\"_blank\"\u003e\u003cimg title=\"buybuttontan\" src=\"https://www.obliviousinvestor.com/wp-content/uploads/2008/11/buybuttontan.gif\" alt=\"\" width=\"120\" height=\"28\"/\u003e\u003c/a\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003cp\u003e\u003cstrong\u003eTopics Covered in the Book:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\n\t\u003cli\u003eAsset Allocation: Why it\u0026#39;s so important, and how to determine your own,\u003c/li\u003e\n\t\u003cli\u003eHow to to pick winning mutual funds,\u003c/li\u003e\n\t\u003cli\u003eRoth IRA vs. traditional IRA vs. 401(k),\u003c/li\u003e\n\t\u003cli\u003e\u003ca href=\"http://www.amazon.com/dp/1950967158/?tag=obliviouspromo-20\" target=\"_blank\"\u003eClick here to see the full list\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA Testimonial:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\n\n\u0026#34;A wonderful book that tells its readers, with simple logical explanations, our Boglehead Philosophy for successful investing.\u0026#34;\n- Taylor Larimore, author of \u003cem\u003eThe Bogleheads\u0026#39; Guide to Investing\u003c/em\u003e\u003c/p\u003e\u003cul\u003e\n\t\u003cli\u003e\u003ca href=\"http://www.amazon.com/product-reviews/1950967158/?tag=obliviouspromo-20\" target=\"_blank\"\u003eRead other reviews on Amazon\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cspan title=\"2024-09-02T07:00:21-05:00\"\u003eSeptember 2, 2024\u003c/span\u003e   \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
