{
  "id": "9c1785e7-fb6d-4824-b63f-cf4c22ebf8fd",
  "title": "15 Military Discounts Worth 10% or More",
  "link": "https://www.nerdwallet.com/article/finance/military-discounts",
  "description": "Getting 10% off is typical, but some brands offer more.",
  "author": "Tommy Tindall",
  "published": "Mon, 16 Jun 2025 22:53:15 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Personal Finance"
  ],
  "byline": "Tommy Tindall",
  "length": 4860,
  "excerpt": "Getting 10% off is typical, but some brands offer more.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Hit up Home Depot, Lowes, Nike, L.L. Bean, The North Face, Timberland and many more stores for a regular military discount of 10% off. But that’s not all you can get for serving your country. Everyday military discounts can help you get good stuff for less. Our list is loaded with ways to save. Look for extra or special discounts around Independence Day, which is coming up soon.Decent discounts from top brands A 10% discount is nothing to sneeze at for brands you shop frequently, or that sell expensive stuff. Apple Apple offers 10% off through its Veterans and Military Purchase Program. It’s open to current and veteran members of the military and immediate family members who reside at the same residence. Take 10% off an iPhone 16 Pro Max that starts at $1199 and you’re looking at close to $120 of savings. Home Depot How about home projects with costs that keep going? Home Depot offers 10% off up to $400 annually on eligible purchases for current and former military members and their spouses. Lowe’s Lowe’s offers a 10% military discount on full price items with no annual limit to current and former military members and their spouses.Nike Nike offers 10% off most items online or in stores to current and former military members, along with spouses and dependents of those on active duty. Military discounts worth moreShop around and you can save more on everyday things and find ways to take advantage of your important job. Military discounts often apply to active and reserve servicemembers, veterans and retirees, and may include spouses and dependents. Some retailers extend discounts to first responders, health-care workers and teachers. Adidas All day I dream about saving money. Adidas offers 30% off online and in-store and 15% off at factory outlets for its military and responder discount.Under Armour Get 20% off all purchases, with opportunities for higher discounts during promotional periods, according to the website. The discount applies to first responders, health-care workers and teachers, too. Protect your country, and this house! Lululemon Fit check: Yoga pants again. Lulu gives 15% off online and in-store for its military and first responders discount. Kohl’sCure a case of the Mondays with a family visit to Kohl's. Get 15% off qualifying purchases in stores only on Mondays.MichaelsThe arts and crafts retail chain offers a military discount of 15% off your supply haul, including sale items. Disney+Park your kids in front of the TV for cheaper. You can sign up for the streaming service for 25% off the annual subscription price. Paramount+But wait, there’s more TV. This military discount is 50% off any plan for the life of your subscription.AT\u0026T WirelessNational ParksThe National Park Service offers a free Military Annual Pass to current members of the U.S. military and their dependents. Compare that with an entrance fee of $35 to drive into Yosemite. Theme parksDisney, Universal Studios, Six Flags and Sea World are among the best theme parks for military discounts. For example, eligible military can generally expect to save around 20% on three-day or longer tickets to Disney. Bonus: Purchase Disney tickets at a base ticket office and get them tax-free. It’s the rest of the trip that’ll cost you.Shopmyexchange.comHere’s a hack we saw mentioned on Reddit. Those eligible to shop at Exchange Stores (i.e., the PX) can use Shopmyexchange.com to buy stuff tax-free, and contact customer service to ask for a price match when a deal is better elsewhere. How to verify your military status for discounts Flash your Common Access Card (CAC) or VA ID when in a store that offers a discount, or get yourself set up to easily verify status online.Use ID.me and SheerID to verify your identityBrands often use third-party verification services to check your military status quickly. ID.Me and SheerID are two common platforms that specialize in verifying your eligibility for discounts. ID.me works like a virtual ID card. You create an account and verify your military credentials, then will log into the service via participating store sites — like Under Armour and Lowe’s — to apply the discount. SheerID works in real-time on brand sites — such as Nike and The North Face — to verify your status. You’ll need to input some basic information, and you may need to upload documentation in some cases. Go on GovXGovX is another way to get deals for serving. It’s a members-only shopping platform that makes it easy to find military discounts once verified as eligible.Always ask: 'Do you offer a military discount?'We like this list of deals, but it’s not exhaustive. Lots of brands show love to those who serve. Always ask the question. Whether you serve now, have served or are a military spouse or dependent. Also ask if you work as a first responder, or in health care or education. You earned it.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/06/GettyImages-1498643193-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eHit up Home Depot, Lowes, Nike, L.L. Bean, The North Face, Timberland and many more stores for a regular military discount of 10% off. But that’s not all you can get for serving your country. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEveryday military discounts can help you get good stuff for less. Our list is loaded with ways to save. Look for extra or special discounts around Independence Day, which is coming up soon.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"decent-discounts-from-top-brands\"\u003e\u003cspan\u003eDecent discounts from top brands \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA 10% discount is nothing to sneeze at for brands you shop frequently, or that sell expensive stuff. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"apple\"\u003e\u003cspan\u003eApple  \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eApple offers 10% off through its Veterans and Military Purchase Program. It’s open to current and veteran members of the military and immediate family members who reside at the same residence. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTake 10% off an iPhone 16 Pro Max that starts at $1199 and you’re looking at close to $120 of savings. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"home-depot\"\u003e\u003cspan\u003eHome Depot  \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHow about home projects with costs that keep going? Home Depot offers 10% off up to $400 annually on eligible purchases for current and former military members and their spouses.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"lowe\u0026#39;s\"\u003e\u003cspan\u003eLowe’s  \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eLowe’s offers a 10% military discount on full price items with no annual limit to current and former military members and their spouses.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"nike\"\u003e\u003cspan\u003eNike  \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eNike offers 10% off most items online or in stores to current and former military members, along with spouses and dependents of those on active duty. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"military-discounts-worth-more\"\u003e\u003cspan\u003eMilitary discounts worth more\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShop around and you can save more on everyday things and find ways to take advantage of your important job. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMilitary discounts often apply to active and reserve servicemembers, veterans and retirees, and may include spouses and dependents. Some retailers extend discounts to first responders, health-care workers and teachers. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"adidas\"\u003e\u003cspan\u003eAdidas \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAll day I dream about \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/how-to-save-money\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003esaving money\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. Adidas offers 30% off online and in-store and 15% off at factory outlets for its military and responder discount.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"under-armour\"\u003e\u003cspan\u003eUnder Armour \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGet 20% off all purchases, with opportunities for higher discounts during promotional periods, according to the website. The discount applies to first responders, health-care workers and teachers, too. Protect your country, and this house! \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"lululemon\"\u003e\u003cspan\u003eLululemon \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFit check: Yoga pants again. Lulu gives 15% off online and in-store for its military and first responders discount. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"kohl\u0026#39;s\"\u003e\u003cspan\u003eKohl’s\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCure a case of the Mondays with a family visit to Kohl\u0026#39;s. Get 15% off qualifying purchases in stores only on Mondays.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"michaels\"\u003e\u003cspan\u003eMichaels\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe arts and crafts retail chain offers a military discount of 15% off your supply haul, including sale items. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"disney+\"\u003e\u003cspan\u003eDisney+\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePark your kids in front of the TV for cheaper. You can sign up for the streaming service for 25% off the annual subscription price. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"paramount+\"\u003e\u003cspan\u003eParamount+\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut wait, there’s more TV. This military discount is 50% off any plan for the life of your subscription.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"atandt-wireless\"\u003e\u003cspan\u003eAT\u0026amp;T Wireless\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"national-parks\"\u003e\u003cspan\u003eNational Parks\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe National Park Service offers a free Military Annual Pass to current members of the U.S. military and their dependents. Compare that with an entrance fee of $35 to drive into Yosemite. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"theme-parks\"\u003e\u003cspan\u003eTheme parks\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDisney, Universal Studios, Six Flags and Sea World are among the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/travel/military-discounts-theme-parks\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ebest theme parks for military discounts\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. For example, eligible military can generally expect to save around 20% on three-day or longer tickets to Disney. Bonus: Purchase Disney tickets at a base ticket office and get them tax-free.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt’s the rest of the trip that’ll cost you.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"shopmyexchange.com\"\u003e\u003cspan\u003eShopmyexchange.com\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere’s a hack we saw mentioned on Reddit. Those eligible to shop at Exchange Stores (i.e., the PX) can use Shopmyexchange.com to buy stuff tax-free, and contact customer service to ask for a price match when a deal is better elsewhere. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"how-to-verify-your-military-status-for-discounts\"\u003e\u003cspan\u003eHow to verify your military status for discounts \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFlash your Common Access Card (CAC) or VA ID when in a store that offers a discount, or get yourself set up to easily verify status online.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"use-id.me-and-sheerid-to-verify-your-identity\"\u003e\u003cspan\u003eUse ID.me and SheerID to verify your identity\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBrands often use third-party verification services to check your military status quickly. ID.Me and SheerID are two common platforms that specialize in verifying your eligibility for discounts.   \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eID.me works like a virtual ID card. You create an account and verify your military credentials, then will log into the service via participating store sites — like Under Armour and Lowe’s — to apply the discount. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSheerID works in real-time on brand sites — such as Nike and The North Face — to verify your status. You’ll need to input some basic information, and you may need to upload documentation in some cases. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"go-on-govx\"\u003e\u003cspan\u003eGo on GovX\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGovX is another way to get deals for serving. It’s a members-only shopping platform that makes it easy to find military discounts once verified as eligible.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"always-ask:-\u0026#39;do-you-offer-a-military-discount\u0026#39;\"\u003e\u003cspan\u003eAlways ask: \u0026#39;Do you offer a military discount?\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWe like this list of deals, but it’s not exhaustive. Lots of brands show love to those who serve. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAlways ask the question. Whether you serve now, have served or are a military spouse or dependent. Also ask if you work as a first responder, or in health care or education. You earned it.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-16T22:53:15Z",
  "modifiedTime": null
}
