{
  "id": "a83460e5-437c-42e3-b862-6580c07bc1bf",
  "title": "The power of non-monetary investments",
  "link": "https://www.getrichslowly.org/nonmonetary-investments/",
  "description": "The following is from Taking Stock by Jordan Grumet with permission from Ulysses Press. Copyright © 2022 by Jordan Grumet. This passage has been edited to be more readable on the web. I used to have a patient who was an undertaker. We had many conversations about philosophy and practicality, and it didn’t take long for me to realize that one must gain profound insights from being engaged in such a unique business. As I was often fond of saying: When the undertaker speaks, you should really listen. Those of us who have made death and dying our business may seem unlikely investment advisers, but because both the undertaker and myself have spent extensive time in close proximity to mortality, we’ve been given unique insight into what’s really worth investing in. What investing tips could someone in my line of business have gleaned from dealing with death and dying? Believe it or not, a few quickly come to mind.",
  "author": "Jordan Grumet",
  "published": "Tue, 02 Aug 2022 12:00:33 +0000",
  "source": "https://www.getrichslowly.org/feed/",
  "categories": [
    "Planning"
  ],
  "byline": "Jordan Grumet",
  "length": 14219,
  "excerpt": "The following is from Taking Stock by Jordan Grumet with permission from Ulysses Press. Copyright © 2022 by Jordan Grumet. This passage has been edited to be",
  "siteName": "Get Rich Slowly",
  "favicon": "https://www.getrichslowly.org/favicons/android-icon-192x192.png",
  "text": "The following is from Taking Stock by Jordan Grumet with permission from Ulysses Press. Copyright © 2022 by Jordan Grumet. This passage has been edited to be more readable on the web. I used to have a patient who was an undertaker. We had many conversations about philosophy and practicality, and it didn’t take long for me to realize that one must gain profound insights from being engaged in such a unique business. As I was often fond of saying: When the undertaker speaks, you should really listen. Those of us who have made death and dying our business may seem unlikely investment advisers, but because both the undertaker and myself have spent extensive time in close proximity to mortality, we’ve been given unique insight into what’s really worth investing in. What investing tips could someone in my line of business have gleaned from dealing with death and dying? Believe it or not, a few quickly come to mind. These tips weren’t learned by accompanying the wealthy through this difficult journey — although the wealthy have much to teach. These tips weren’t siphoned off of the personal books of those who had little interest left in hiding their secret ingredients to success. These are simple, straightforward bits of knowledge gained from walking down this lonely path with those reluctant to be making the journey. And believe it or not, most of what I learned about investing has nothing to do with money. Invest in Yourself Personal investment comes in many forms. Chief among these is self-forgiveness. Remorse is common in humans of all stripes — living and dying — and its effects can be devastating. The specifics may vary: an action taken or not taken, a relationship salvaged or destroyed, or an object bought or sold. The human capacity to blame oneself is unlimited. We spend endless amounts of time feeling bad about things we wish we had done better. While self-blame serves the purpose of introspection and improving future outcomes, it often leaves a path of destruction it its wake. It’s hard to look forward when you are constantly looking back. The key appears to be changing what we can change and forgiving ourselves for the rest. Losing his job was the least of Gerald’s regrets. Decades before being diagnosed with cirrhosis (chronic liver disease), his exit from corporate America set off a series of events that ended in alcoholism. His marriage fell apart, and he quickly became estranged from his ex-wife and his daughter, Sandy. While sobriety and eventual employment were recoverable, the damage he had done to his body was not. Neither was the estrangement with Sandy. A large part of the life review process was spent with the social worker exploring his feelings surrounding the loss of his daughter. Gerald eventually was able to find a modicum of peace and forgive himself. He also realized that if this self-forgiveness had been granted earlier, he might have been able to quit alcohol long before his liver became so damaged. What have you been unwilling to forgive yourself for? What damage is this unwillingness inflicting? Another common way we invest in ourselves is by slowing down. Often, we have big audacious goals and want to reach them immediately. Yet — as in the story of the turtle and the hare — slow incremental gain is what helps us win the race. If we can make progress toward a major goal by just one percent per month, we’ll have phenomenal annual returns over the long run. This principle applies to a skill, a relationship, or just about anything we strive toward. We mustn’t allow our limiting beliefs to hold us back. We also need to invest in experiences. Experience compounds over time, just as our monetary assets do. As we learn and grow, we hone skills that make us better employees as well as people. Ask anyone who has risen through the ranks to become CEO of a company. Just like Ben Franklin’s compounding investments, growth in the workplace is anything but linear; it grows exponentially. And if we are going to talk about investing in ourselves, we would be remiss if we didn’t mention education. Invest in Education While there’s no question that I’ve benefited from an expensive four-year college education, there are so many different ways to educate yourself nowadays — read, discuss, take online courses, debate until your face is blue and you walk out of the room disgusted. The world is full of teachers, great and small. Knowledge is the emergency fund in which you shield your happiness. When all other resources are exhausted, your knowledge will help you secure a job, build a shelter, or make the right decisions at the most critical moments. Don’t skimp on self-improvement, and don’t be afraid to pay for it. The money you spend on education will compound in the form of knowledge and skills. Say yes — even when you don’t want to. Open yourself to other people’s requests, and jump into an activity that feels foreign or uncomfortable. The only way to gain knowledge or discover new passions is to be willing to explore. Not only will you be exposed to exciting opportunities, but you’ll also build stronger relationships with those to whom you say yes. Always have your bags packed. Don’t be afraid to learn new things. I’m continuously surprised by how resistant the average person is to learn about basic finance. Most experts suggest that a few hours of reading each month will make you totally financially competent. Yet the preconceived notion that the subject is too difficult scares many away; don’t let it. I have watched countless patients die with a book on their nightstand or an unfinished argument circling their brain. This is not sad or trivial. Even those who are dying wake up every morning with a plan for how they will spend each day. Make sure you allow room for acquiring new knowledge. Inquisitive people tend to die as they live: happy and full of questions. Invest in Other People The one measure of a person (rich or poor, happy or sad) is in the people whom the person leaves behind. I can think of no greater indicator of success. I know instantly when I walk into the room of a dying patient whether they have invested in other people. They are surrounded by pictures, letters, cards, and friends. In fact, I usually know who the successful investors are before I even reach the hospital room. There are people walking in and out; noise and laughter peal through the otherwise somber hallways. Smiles and tears celebrate the bittersweet confluence of life and death. If you invest in people, the compound interest will multiply into a lifetime of love and happiness. Long after you’re gone, your essence will survive in the smile on the lips of those who shared in your asset allocation. It took me years to understand this tip. I stumbled about as a doctor looking to find my people in the midst of a community that didn’t fit me. It was only after I discovered writing and podcasting in the personal finance realm that I was able to connect with people who understand me. These connections have made all the difference; they have given me the courage to redefine my identity and purpose. Invest in Children Invest not only your money, but your time and love. Invest in children. Help build the blocks of their adulthood and happiness. Sprinkle them with your knowledge, humility, and kindness. Lead them with your virtuous example. In you, they will find the role model of success and freedom. Teach them about finances so they can understand what money can and can’t do for them in attainment of their life goals. Leave them with a good example of what living looks like. Investing in your children will produce a lifetime of dividends. They will be the shoulder to lean on and the undertaker of your vast life dreams. Your time on this earth is short, but your progeny will carry on your spark. Like a ripple in a vast ocean, your effect will be carried with them through the generations. You will live on in the hearts and minds of those who come after you. Every time a colleague accidentally calls me by my father’s name, while rounding at the hospital, is proof of how we live on in our children. His legacy shaped my career and passions even decades after he has passed. He is remembered. I will never be able to repay my parents for what they have willingly surrendered to me. Instead, I will pay it forward to my own children. I will invest in them in much the same way as my parents have invested in me, and, thus, our goodness will continue on through the generations. Invest in Physical and Mental Health Your body and mind are interconnected. They form the framework you build upon. There’s no financial well-being without mental and physical well-being. As this book demonstrates, managing your money and future take forethought and conscientious decision-making. You can’t do this properly if you yourself are unwell. Invest in mental health by taking the time and energy to recover. Learn how to slow your mind and relax with activities such as meditation, exercise, and listening to classical music. Don’t be afraid to ask for help from family, friends, or mental health professionals. Psychological counseling is not only common but also incredibly helpful. Getting a professional’s outside perspective can make a huge difference in quieting those internal voices that disrupt your peace and calm. Physical health also plays an important role. Not only may it prolong the time to the end of life, but the emotional benefits are also enduring. We generally feel stronger both physically and emotionally when we are taking positive steps to take care of ourselves. This does not mean that we all have to become marathon runners. As I said before, perfect can be the enemy of good enough. Try to get at least thirty minutes of physical activity a day. Start with something easy like walking. Find an activity that fulfills your physical needs without being loathsome or burdensome. If you hate doing it, the habit won’t last. While I don’t feel strongly about alcohol or drugs, anything above recreational use often limits our health as well as our ability to see our goals clearly. If you are wondering whether it’s a problem, then it probably is. Most of the highs these substances give us are artificial and short-lived. Invest in the Market Even a collection of investing tips from a hospice doctor would be remiss without the basics. Taking Stock is a personal finance book, after all. So, don’t forget to invest in the stock market: Earn more than you spend. Save as much as you can each year (20 to 50 percent). Buy broad-based low-cost mutual funds. Max out retirement savings first, and then open a taxable brokerage account. Hire a financial adviser only to advise — not to invest for you. My hope is that this book gives you the intellectual, tactical, and practical knowledge to get the money right so that you can invest more heavily in the other things I’ve discussed. I don’t want to minimize the importance of understanding the financial basics, but I do want to remind you that they are necessary but not sufficient. Final Thoughts These are my investing tips from a hospice doctor. As you can see, only the last section deals with money. The reason, of course, is that finances are the easy part. How you invest the rest of your time and energy is likely to determine your perspective in those waning days when you deal with a doctor like me. Don’t waste your life and regret. Start investing now! Before it’s too late. The stronger the foundation you create, the better you’ll be able to deal with the unexpected. Because if you haven’t figured it out yet, that’s the point of investing in the first place. Your investing plan has to start immediately — before you are dying and the end is so clearly in sight. Building a life of meaning, purpose, and connections takes time and compounding. Investing in yourself takes energy, and investing in education requires work. Building relationships with your children and community will be a mental and physical strain. Taking care of your mind and body will be taxing. Learning about personal finance and building financial security will consume hours that you might rather have spent on something else. And it’s all so very, very worth it. Be as prepared for life as you would be for death. Invest in yourself wisely. Exercise: Non-Monetary Investment Inventory Clear your schedule for an hour for two to three separate days over the next week. During that time, make sure all electronics are turned to silent, you’re well-rested and fed, and you have found a quiet, comfortable place to concentrate. Take a sheet of paper, and separate it lengthwise into three separate columns. Number each from 1 to 10. For your first list, write down all the education you have received up to this time. You can start with high school, university, or college. Add in any graduate programs, online courses, on-site work trainings, or self-study projects. Be generous here — no need to have received a formal degree or certificate. It’s okay, especially for this section, if you don’t have ten full entries. For your second list, write down all your skills. These can range from professional expertise to innate talents to self-taught abilities. Don’t forget all that you’ve learned through social media. Are you a content creator? What about hobbies? Again, give yourself credit. What do people always tell you that you are good at? Finally, in the last column write down key relationships. This includes family, friends, work associates, and even acquaintances. List the ten people who have a big influence on your life. This is your community. Now peruse your three lists together; this is the sum total of your non-monetary investments. What you have created is an inventory of your non-financial wealth. Often, we get so caught up in our net worth calculation that we forget about our non-monetary assets. If you take your inventory of non-financial wealth and add it to your net worth calculation, you now have a true listing of all your resources. Are these enough to allow you to utilize most of your time pursuing your true purpose, identity, and connections? If so — welcome to financial independence!",
  "image": "https://www.getrichslowly.org/wp-content/uploads/taking-stock.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cblockquote\u003e\u003cp\u003eThe following is from \u003ca href=\"https://www.amazon.com/dp/1646043545/?tag=grsorg-20\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eTaking Stock\u003c/em\u003e\u003c/a\u003e by Jordan Grumet with permission from Ulysses Press. Copyright © 2022 by Jordan Grumet. This passage has been edited to be more readable on the web.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/dp/1646043545/?tag=grsorg-20\" target=\"_blank\" rel=\"noopener\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.getrichslowly.org/wp-content/uploads/taking-stock.webp \" type=\"image/webp\"/\u003e\u003cimg src=\"https://www.getrichslowly.org/wp-content/uploads/taking-stock.jpeg\" height=\"500\" width=\"333\" alt=\"\" fetchpriority=\"high\" decoding=\"async\"/\u003e \u003c/picture\u003e\u003c/a\u003eI used to have a patient who was an undertaker. We had many conversations about philosophy and practicality, and it didn’t take long for me to realize that one must gain profound insights from being engaged in such a unique business. As I was often fond of saying: \u003cstrong\u003eWhen the undertaker speaks, you should really listen.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThose of us who have made death and dying our business may seem unlikely investment advisers, but because both the undertaker and myself have spent extensive time in close proximity to mortality, we’ve been given unique insight into what’s really worth investing in. What investing tips could someone in my line of business have gleaned from dealing with death and dying? Believe it or not, a few quickly come to mind.\u003c/p\u003e\n\u003cp\u003eThese tips weren’t learned by accompanying the wealthy through this difficult journey — although the wealthy have much to teach. These tips weren’t siphoned off of the personal books of those who had little interest left in hiding their secret ingredients to success. These are simple, straightforward bits of knowledge gained from walking down this lonely path with those reluctant to be making the journey.\u003c/p\u003e\n\u003cp\u003eAnd believe it or not, \u003cstrong\u003emost of what I learned about investing has nothing to do with money\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ciframe title=\"338. Are You Ready to Take Stock of Your Life? w/ JL Collins and Jordan Grumet\" width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/HEdSgHa0AKI?feature=oembed\u0026amp;enablejsapi=1\u0026amp;origin=https://www.getrichslowly.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"invest-in-yourself\"\u003e\u003c/span\u003eInvest in Yourself\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003ePersonal investment comes in many forms. Chief among these is self-forgiveness.\u003c/p\u003e\n\u003cp\u003eRemorse is common in humans of all stripes — living and dying — and its effects can be devastating. The specifics may vary: an action taken or not taken, a relationship salvaged or destroyed, or an object bought or sold. The human capacity to blame oneself is unlimited. We spend endless amounts of time feeling bad about things we wish we had done better.\u003c/p\u003e\n\u003cp\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.getrichslowly.org/wp-content/uploads/serenity-prayer.webp \" type=\"image/webp\"/\u003e\u003cimg src=\"https://www.getrichslowly.org/wp-content/uploads/serenity-prayer.jpg\" height=\"360\" width=\"360\" alt=\"The AA serenity prayer\" decoding=\"async\" title=\"The AA serenity prayer\"/\u003e \u003c/picture\u003eWhile self-blame serves the purpose of introspection and improving future outcomes, it often leaves a path of destruction it its wake. It’s hard to look forward when you are constantly looking back. The key appears to be changing what we can change and forgiving ourselves for the rest.\u003c/p\u003e\n\u003cp\u003eLosing his job was the least of Gerald’s regrets. Decades before being diagnosed with cirrhosis (chronic liver disease), his exit from corporate America set off a series of events that ended in alcoholism. His marriage fell apart, and he quickly became estranged from his ex-wife and his daughter, Sandy. While sobriety and eventual employment were recoverable, the damage he had done to his body was not. Neither was the estrangement with Sandy.\u003c/p\u003e\n\u003cp\u003eA large part of the life review process was spent with the social worker exploring his feelings surrounding the loss of his daughter. Gerald eventually was able to find a modicum of peace and forgive himself. He also realized that if this self-forgiveness had been granted earlier, he might have been able to quit alcohol long before his liver became so damaged.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhat have you been unwilling to forgive yourself for?\u003c/li\u003e\n\u003cli\u003eWhat damage is this unwillingness inflicting?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnother common way we invest in ourselves is by slowing down. Often, we have big audacious goals and want to reach them immediately. Yet — as in the story of the turtle and the hare — slow incremental gain is what helps us win the race. If we can make progress toward a major goal by just one percent per month, we’ll have phenomenal annual returns over the long run. This principle applies to a skill, a relationship, or just about anything we strive toward. We mustn’t allow our \u003ca href=\"https://markmanson.net/limiting-beliefs\" target=\"_blank\" rel=\"noopener\"\u003elimiting beliefs\u003c/a\u003e to hold us back.\u003c/p\u003e\n\u003cp\u003eWe also need to invest in experiences. Experience compounds over time, just as our monetary assets do. As we learn and grow, we hone skills that make us better employees as well as people. Ask anyone who has risen through the ranks to become CEO of a company. Just like \u003ca href=\"https://www.mymoneyblog.com/ben-franklin-compound-interest.html\" target=\"_blank\" rel=\"noopener\"\u003eBen Franklin’s compounding investments\u003c/a\u003e, growth in the workplace is anything but linear; it grows exponentially.\u003c/p\u003e\n\u003cp\u003eAnd if we are going to talk about investing in ourselves, we would be remiss if we didn’t mention education.\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"invest-in-education\"\u003e\u003c/span\u003eInvest in Education\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eWhile there’s no question that I’ve benefited from an expensive four-year college education, there are so many different ways to educate yourself nowadays — read, discuss, take online courses, debate until your face is blue and you walk out of the room disgusted. The world is full of teachers, great and small.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKnowledge is the emergency fund in which you shield your happiness.\u003c/strong\u003e When all other resources are exhausted, your knowledge will help you secure a job, build a shelter, or make the right decisions at the most critical moments. Don’t skimp on self-improvement, and don’t be afraid to pay for it. The money you spend on education will compound in the form of knowledge and skills.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.getrichslowly.org/the-power-of-yes-a-simple-way-to-get-more-out-of-life/\"\u003eSay yes\u003c/a\u003e — even when you don’t want to. Open yourself to other people’s requests, and jump into an activity that feels foreign or uncomfortable.\u003c/p\u003e\n\u003cp\u003eThe only way to gain knowledge or discover new passions is to be willing to explore. Not only will you be exposed to exciting opportunities, but you’ll also build stronger relationships with those to whom you say yes. Always have your bags packed.\u003c/p\u003e\n\u003cp\u003eDon’t be afraid to learn new things. I’m continuously surprised by how resistant the average person is to learn about basic finance. Most experts suggest that a few hours of reading each month will make you totally financially competent. Yet the preconceived notion that the subject is too difficult scares many away; don’t let it.\u003c/p\u003e\n\u003cp\u003eI have watched countless patients die with a book on their nightstand or an unfinished argument circling their brain. This is not sad or trivial. Even those who are dying wake up every morning with a plan for how they will spend each day. Make sure you allow room for acquiring new knowledge. Inquisitive people tend to die as they live: happy and full of questions.\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"invest-in-other-people\"\u003e\u003c/span\u003eInvest in Other People\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eThe one measure of a person (rich or poor, happy or sad) is in the people whom the person leaves behind. I can think of no greater indicator of success. I know instantly when I walk into the room of a dying patient whether they have invested in other people. They are surrounded by pictures, letters, cards, and friends.\u003c/p\u003e\n\u003cp\u003eIn fact, I usually know who the successful investors are before I even reach the hospital room. There are people walking in and out; noise and laughter peal through the otherwise somber hallways. Smiles and tears celebrate the bittersweet confluence of life and death.\u003c/p\u003e\n\u003cp\u003eIf you invest in people, the compound interest will multiply into a lifetime of love and happiness. Long after you’re gone, your essence will survive in the smile on the lips of those who shared in your asset allocation.\u003c/p\u003e\n\u003cp\u003eIt took me years to understand this tip. I stumbled about as a doctor looking to find my people in the midst of a community that didn’t fit me. It was only after I discovered writing and podcasting in the personal finance realm that I was able to connect with people who understand me.\u003c/p\u003e\n\u003cp\u003eThese connections have made all the difference; they have given me the courage to redefine my identity and purpose.\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"invest-in-children\"\u003e\u003c/span\u003eInvest in Children\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eInvest not only your money, but your time and love. Invest in children. Help build the blocks of their adulthood and happiness. Sprinkle them with your knowledge, humility, and kindness. Lead them with your virtuous example. In you, they will find the role model of success and freedom. Teach them about finances so they can understand what money can and can’t do for them in attainment of their life goals. Leave them with a good example of what living looks like.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInvesting in your children will produce a lifetime of dividends.\u003c/strong\u003e They will be the shoulder to lean on and the undertaker of your vast life dreams. Your time on this earth is short, but your progeny will carry on your spark. Like a ripple in a vast ocean, your effect will be carried with them through the generations. You will live on in the hearts and minds of those who come after you.\u003c/p\u003e\n\u003cp\u003eEvery time a colleague accidentally calls me by my father’s name, while rounding at the hospital, is proof of how we live on in our children. His legacy shaped my career and passions even decades after he has passed. He is remembered.\u003c/p\u003e\n\u003cp\u003eI will never be able to repay my parents for what they have willingly surrendered to me. Instead, I will pay it forward to my own children. I will invest in them in much the same way as my parents have invested in me, and, thus, our goodness will continue on through the generations.\u003c/p\u003e\n\u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Taking Stock by Jordan Grumet Available 8/02 Ulysses Press: Official Book Trailer\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ZG1SZtXbLig?feature=oembed\u0026amp;enablejsapi=1\u0026amp;origin=https://www.getrichslowly.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"invest-in-physical-and-mental-health\"\u003e\u003c/span\u003eInvest in Physical and Mental Health\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eYour body and mind are interconnected. They form the framework you build upon. There’s no financial well-being without mental and physical well-being. As this book demonstrates, managing your money and future take forethought and conscientious decision-making. You can’t do this properly if you yourself are unwell.\u003c/p\u003e\n\u003cp\u003eInvest in mental health by taking the time and energy to recover. Learn how to slow your mind and relax with activities such as meditation, exercise, and listening to classical music. Don’t be afraid to ask for help from family, friends, or mental health professionals. Psychological counseling is not only common but also incredibly helpful. Getting a professional’s outside perspective can make a huge difference in quieting those internal voices that disrupt your peace and calm.\u003c/p\u003e\n\u003cp\u003ePhysical health also plays an important role. Not only may it prolong the time to the end of life, but the emotional benefits are also enduring. We generally feel stronger both physically and emotionally when we are taking positive steps to take care of ourselves. This does not mean that we all have to become marathon runners. As I said before, perfect can be the enemy of good enough.\u003c/p\u003e\n\u003cp\u003eTry to get at least thirty minutes of physical activity a day. Start with something easy like walking. Find an activity that fulfills your physical needs without being loathsome or burdensome. If you hate doing it, the habit won’t last.\u003c/p\u003e\n\u003cp\u003eWhile I don’t feel strongly about alcohol or drugs, anything above recreational use often limits our health as well as our ability to see our goals clearly. If you are wondering whether it’s a problem, then it probably is. Most of the highs these substances give us are artificial and short-lived.\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"invest-in-the-market\"\u003e\u003c/span\u003eInvest in the Market\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eEven a collection of investing tips from a hospice doctor would be remiss without the basics. \u003ca href=\"https://www.amazon.com/dp/1646043545/?tag=grsorg-20\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eTaking Stock\u003c/em\u003e\u003c/a\u003e is a personal finance book, after all. So, don’t forget to invest in the stock market:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEarn more than you spend.\u003c/li\u003e\n\u003cli\u003eSave as much as you can each year (20 to 50 percent).\u003c/li\u003e\n\u003cli\u003eBuy broad-based low-cost mutual funds.\u003c/li\u003e\n\u003cli\u003eMax out retirement savings first, and then open a taxable brokerage account.\u003c/li\u003e\n\u003cli\u003eHire a financial adviser only to advise — not to invest for you.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMy hope is that this book gives you the intellectual, tactical, and practical knowledge to get the money right so that you can invest more heavily in the other things I’ve discussed. I don’t want to minimize the importance of understanding the financial basics, but I do want to remind you that they are necessary but not sufficient.\u003c/p\u003e\n\u003ch2\u003e\u003cspan id=\"final-thoughts\"\u003e\u003c/span\u003eFinal Thoughts\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/dp/1646043545/?tag=grsorg-20\" target=\"_blank\" rel=\"noopener\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.getrichslowly.org/wp-content/uploads/taking-stock.webp \" type=\"image/webp\"/\u003e\u003cimg src=\"https://www.getrichslowly.org/wp-content/uploads/taking-stock.jpeg\" height=\"500\" width=\"333\" alt=\"\" fetchpriority=\"high\" decoding=\"async\"/\u003e \u003c/picture\u003e\u003c/a\u003eThese are my investing tips from a hospice doctor. As you can see, only the last section deals with money. The reason, of course, is that finances are the easy part. How you invest the rest of your time and energy is likely to determine your perspective in those waning days when you deal with a doctor like me. Don’t waste your life and regret.\u003c/p\u003e\n\u003cp\u003eStart investing now! Before it’s too late. The stronger the foundation you create, the better you’ll be able to deal with the unexpected. Because if you haven’t figured it out yet, that’s the point of investing in the first place.\u003c/p\u003e\n\u003cp\u003eYour investing plan has to start immediately — before you are dying and the end is so clearly in sight. Building a life of meaning, purpose, and connections takes time and compounding. Investing in yourself takes energy, and investing in education requires work. Building relationships with your children and community will be a mental and physical strain. Taking care of your mind and body will be taxing. Learning about personal finance and building financial security will consume hours that you might rather have spent on something else.\u003c/p\u003e\n\u003cp\u003eAnd it’s all so very, very worth it. Be as prepared for life as you would be for death.\u003c/p\u003e\n\u003cp\u003eInvest in yourself wisely.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003ch2\u003e\u003cspan id=\"exercise-non-monetary-investment-inventory\"\u003e\u003c/span\u003eExercise: Non-Monetary Investment Inventory\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eClear your schedule for an hour for two to three separate days over the next week. During that time, make sure all electronics are turned to silent, you’re well-rested and fed, and you have found a quiet, comfortable place to concentrate.\u003c/p\u003e\n\u003cp\u003eTake a sheet of paper, and separate it lengthwise into three separate columns. Number each from 1 to 10.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eFor your first list, write down all the education you have received up to this time. You can start with high school, university, or college. Add in any graduate programs, online courses, on-site work trainings, or self-study projects. Be generous here — no need to have received a formal degree or certificate. It’s okay, especially for this section, if you don’t have ten full entries.\u003c/li\u003e\n\u003cli\u003eFor your second list, write down all your skills. These can range from professional expertise to innate talents to self-taught abilities. Don’t forget all that you’ve learned through social media. Are you a content creator? What about hobbies? Again, give yourself credit. What do people always tell you that you are good at?\u003c/li\u003e\n\u003cli\u003eFinally, in the last column write down key relationships. This includes family, friends, work associates, and even acquaintances. List the ten people who have a big influence on your life. This is your community.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eNow peruse your three lists together; this is the sum total of your non-monetary investments. What you have created is an inventory of your non-financial wealth. Often, we get so caught up in our net worth calculation that we forget about our non-monetary assets.\u003c/p\u003e\n\u003cp\u003eIf you take your inventory of non-financial wealth and add it to your net worth calculation, you now have a true listing of all your resources. Are these enough to allow you to utilize most of your time pursuing your true purpose, identity, and connections? If so — welcome to financial independence!\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2022-08-02T05:00:33-06:00",
  "modifiedTime": "2024-08-12T15:14:37-06:00"
}
