{
  "id": "bceb017b-1d6d-4e9a-a572-77242ba54365",
  "title": "583: Google’s Algorithm Update DESTROYED Affiliate Sites… Now What?",
  "link": "https://mywifequitherjob.com/episode583/",
  "description": "In this episode, Toni and I discuss how Google’s latest algorithm update has shaken up the affiliate marketing world, leaving many sites in the dust. We’ll cover what this means for content creators and how to bounce back stronger than ever. So if you’re feeling the impact or just curious about the buzz, listen in! What You’ll Learn What the algorithm update really changed and why it matters to you Tips on how to adapt your strategies to stay relevant What you should be doing instead of blogging Sponsors SellersSummit.com – The Sellers Summit is the ecommerce conference that I’ve […] The post 583: Google’s Algorithm Update DESTROYED Affiliate Sites… Now What? appeared first on MyWifeQuitHerJob.com.",
  "author": "Steve Chou",
  "published": "Wed, 19 Mar 2025 15:02:25 +0000",
  "source": "https://mywifequitherjob.com/feed/",
  "categories": [
    "Blogging",
    "The My Wife Quit Her Job Podcast With Steve Chou"
  ],
  "byline": "",
  "length": 39666,
  "excerpt": "In this episode, Toni and I discuss how Google’s latest algorithm update has shaken up the affiliate marketing world, leaving many sites in the dust. We’ll cover what this means for content creators and how to bounce back stronger than ever. So if you’re feeling the impact or just curious about the buzz, listen in! Get My Free Mini Course On How To Start A Successful Ecommerce Store If you are interested in starting an ecommerce business, I put together a comprehensive package of resources that will help you launch your own online store from complete scratch. Be sure to …",
  "siteName": "MyWifeQuitHerJob.com",
  "favicon": "",
  "text": "In this episode, Toni and I discuss how Google’s latest algorithm update has shaken up the affiliate marketing world, leaving many sites in the dust.We’ll cover what this means for content creators and how to bounce back stronger than ever.If you are interested in starting an ecommerce business, I put together a comprehensive package of resources that will help you launch your own online store from complete scratch. Be sure to grab it before you leave!SellersSummit.com – The Sellers Summit is the ecommerce conference that I’ve run for the past 8 years. It’s small and intimate and you’ll learn a ton! Click Here To Grab The Recordings.The Family First Entrepreneur – Purchase my Wall Street Journal Bestselling book and receive $690 in free bonuses! Click here to redeem the bonuses 00:00 Welcome back to the podcast, the show where I cover all of the latest strategies and current events related to e-commerce and online business. In this episode, Tony and I dive into the state of affiliate marketing and whether it’s still a viable business model today, especially in light of Google’s latest algorithm updates. But before we begin, I wanted to let you know that tickets are now on sale for Seller Summit 2025 over at sellersummit.com and the prices are now going to go up every two weeks until the event starts. The Seller Summit00:29 is the conference that I hold every year that specifically targets e-commerce entrepreneurs selling physical products online. Unlike other events that focus on inspirational stories and high-level advice, mine is a curriculum-based conference where you will leave with practical and actionable strategies specifically for an e-commerce business. Every speaker I invite is deep in the trenches of their e-commerce business, entrepreneurs who are importing large quantities of physical goods, and not some high-level guys who are overseeing their companies at 50,000 feet.00:59 I personally hate large events, so the Seller’s Summit is always small and intimate. Every year we cut off ticket sales at around 200 people, so tickets sell out fast, and we’ve sold out every single year for the past 8 years. If you are an ecommerce entrepreneur making more than $250,000 or $1 million per year, we also offer an exclusive mastermind experience with other top sellers. The Seller’s Summit is going to be held in Fort Lauderdale, Florida from May 6th to May 8th.01:28 Right now, this is the cheapest the tickets will ever be. So head on over to sellersummit.com and grab your ticket. Now onto the show.01:42 Welcome to the My Wife, Quit or Job podcast. Today we’re going to talk about affiliate marketing in today’s age where people are putting out less content, especially on blogs. Yeah, I’m cheating with this one because I’m actually on an affiliate marketing panel in a couple of months, actually next month. Oh at the Pet Summit. At the Pet Summit. Yeah. And it was funny because we had a little meeting yesterday to talk about what we were, you know, kind of the structure of the panel. As you know, I’m not a panel fan because I feel like02:12 people don’t learn anything, but we wanted this panel to be really educational for the attendees. And so we basically walked through a strategy of what we wanted to talk about. And as we were doing that, we all had very strong views on how to best make affiliate marketing work for you. And I think you still can. I think this is actually still really lucrative. And the exciting part is, and we’ve said this a lot, you don’t have to have a ton of traffic to make affiliate marketing work on any platform, YouTube.02:42 Instagram, TikTok, blog. It’s not always about being in the millions of views. Yeah, you know what? Usually before we record, I go and I Google to see what like the latest current events are. And I’ve just noticed recently that there’s hardly any content out there except from like the larger sites. All the smaller independent blogs aren’t really putting out content anymore. And if they are, it’s all kind of like the AI generated stuff.03:11 I feel like all these Google changes in the past couple of years have really decimated the entire blogging community to the point where at some point AI is not going have any content or to digest. That’s what I wondered that last year. I think we probably talked about it on the podcast. If everyone stops creating content, then where does the content come from? People are still putting out YouTube content and short form content.03:39 The whole blogosphere, I feel like, is just going away. Let’s start with blogging. Let’s start with that as the first bucket. I think if you have a blog right now and you’ve had one for a while, I wouldn’t stop creating content and I wouldn’t stop using affiliate links. I just think you have to be more strategic about how you’re using them and also integrating other04:08 mediums with the blog. So for example, let’s just we’ll do we’ll do one of yours and one of mine. So let’s just say vacuums, right? I love to talk about affiliates for vacuums because I buy a vacuum every year. And, before I could just write a post and include a link to a vacuum. And, you know, that would be it. Right. And people would click on it and I’d make money. But today, that’s not that’s not going to work. Right. So one thing you can do with the blog is04:35 you know, not just write a post, but I’m gonna embed a video of me using like two or three vacuums and I’m gonna show you like how I empty my Dyson and how it works on different surfaces. And you know, I’m gonna include that video content into the blog post so that people can realize like, cause I still like, I still use that. I still use blogs for those things. I still read reviews and not just on Amazon, right? Because there’s a lot of times where I’m on Amazon and I don’t,05:04 I don’t trust the product, the first couple of product reviews, right? Cause I’m like, that person totally got that item for free or there was some backdoor dealing with, know, send it to me, I’ll PayPal you, blah, blah, blah kind of thing. And we, all know that happens, those of us in this business. And so I still like to see regular people talking about the products and talking about why they like them and why they don’t like them. So I would start incorporating video into my blog posts, especially with05:32 Anything you could demonstrate and then the other option would be something you would do was how to use a tool. Yes, that was largely YouTube-focused. Even when I was doing a blog post for it, it was mainly the YouTube video that was driving a lot of those clicks, actually. Just to be clear for everyone listening, I’m not saying blogging is dead, but if it’s a standalone blog,06:00 without a business or service associated with it, Google is just not ranking those sites. And so the old method of creating a review post or a comparison post or whatnot for affiliate marketing, the likelihood of you getting at least SEO traffic to it is highly unlikely now, which is why people have stopped writing posts for the most part. Well, yeah, because you put in all this work and then no one sees it. And if you don’t have06:30 If you don’t have an email list that you can drive people to read stuff to, or you’re not leveraging social media or Pinterest, if Google was basically your main squeeze, then you really don’t have another way right now to get traffic to your website. Yes, and I think the issue with affiliate marketing, at least the way it works today for the most part, is that you need to get someone to click on a link where it’s then attributed to you. But where can you put a link?06:59 The blog was the ideal location to do that. Yes. So now that like the blog part is probably less likely for you to get traffic there, that leaves email, which is still incredible for that. And that also leaves social media and YouTube, guess, if you consider that social media. Problem with social media, though, is that you can’t include links. Right. Right. And on YouTube, when you include a link, it’s usually in the description.07:29 Getting people to click on these links is a lot harder than it used to be on a blog. I think the one exception to this would be, let’s just say, because my blog has been up and down with SEO, it got hit really bad many, many years ago, and then it rebounded a little, and then it dropped, and then it can’t. It’s like a never-ending revolving door. What I have found is there are still posts that do fairly well.07:59 on Google, Pinterest, like they’re still getting traffic, right? They’re just popular posts. And what I was thinking about the other day, cause you know how Google search console sends you like that little report every month of like what has impressions and clicks. And I realized that like as I usually just delete those, I don’t look at them too seriously cause Google hasn’t been like a main traffic source for me for a long time.08:23 But I started looking at it and I was like, know, this post actually, I don’t think I’ve touched this post in a really long time. I was like, I should go in there and just, if people are coming to it, like, why am I not maximizing that? Right? So if you already have content and you are a content creator and maybe you have been hit by Google updates and you’re discouraged and you’re not creating that new content, you can still update your old content. And it was funny because I got a check after Christmas or like a deposit from08:51 commission junction that was like more than it, like I get like about the same amount every month or so. And this was like double. And I was like, huh, that’s weird. Like maybe it’s an error. But then when I like started digging in and I got the search console results, I realized like, oh no, this one post is like resurfaced basically. And it had an affiliate list. So then it’s like, in there and update your old content. If you’re seeing this getting traction from wherever it’s getting traction from.09:19 make sure that that stuff is optimized because there’s probably like, and actually I was updating another post and like all my affiliate links were broken, right? Because the post was like 13 years old and it had resurfaced on Pinterest. So someone had pinned like a picture and then it was just getting like a lot of traction there. And I realized that every single Amazon link on there, the product, I because I linked it 13 years ago, those products aren’t being sold, right? And obviously people are still getting to Amazon. The link still09:48 tracks, right? So I would still get credit if they bought something, but wouldn’t it be better to actually send them to a product that they want, right? Like, wouldn’t it be better to work on that? So that’s something if you if you’re in that position, I would recommend, you know, prioritizing the content and making sure that everything is updated because it’s so easy to just let that stuff go because there’s so much else that you could be working You’re about like an existing affiliate post, right? Yes, existing. Yeah. I’m curious, can we talk about your panel? Do you guys have an agenda?10:19 We do, we do. I’m pretty sure the people listening are not gonna be at the Pet Summit. No, they’re not. They’re not. So one of the things that we really wanna talk about, which I think is very important, is that, most of the creators at the Pet Summit are not bloggers. They don’t even have a website, which still blows my mind. I know that I’m old school, but how could you not just have a landing page? I agree.10:48 Yeah, a lot of creators don’t have anything. just rely on Instagram. yes, and their link tree or whatever. So that’s what I learned last year from speaking there is that there were probably 60 % of the people there had no website at all. Like everything was through Instagram, TikTok. And these are huge, like millions of followers. We’re not talking about like little 10,000, you know, create follower accounts.11:16 So one of the things that I have found coming from working on both sides, right, being an affiliate and also working with the brands trying to recruit affiliates is that most of the time the creators, especially the ones that have built like a very large following on social, do not understand that you can negotiate with your affiliates. Right. Like all of this is negotiable. Most of the time when you’re a content creator and you have a social following,11:46 you usually send out that media kit, right? Or you’re like, well, I charge $1,000 for a post or I charge $5,000 for a video, right? As opposed to negotiating like, yeah, I’m gonna charge you a flat fee, but also I would like a commission on sales that I drive to your product. And maybe your normal commission rate is 5%, I want seven, right? So most creators don’t know that you can do that.12:11 in this new creator space, right? Like these last people who have blown up in the last two or three years, they don’t understand that all of that is negotiable and that you should always ask for the double dip. You should always ask for the flat fee plus the affiliate revenue, right? Now, if you’re a small creator and you’re just getting started, you just wanna go in with the affiliate, because you wanna prove yourself, right? But then on the flip side, what they don’t understand is you can’t just tell a brand12:40 I charge X amount of dollars and not be able to show the brand some level of conversion on the backend. But oftentimes, in every brand that I’ve spoken with in the past year or two, basically, it’s like, get these media kits and they want $25,000 for an Instagram post or so. Some of this is absolutely obscene.13:03 I’m like, well, I would never take that. I actually dealt with a brand just last week who sent a media kit and they wanted $3,000 for an email. Did I tell you this story? No. I want to make sure I didn’t tell them the podcast already. They wanted $3,000 for an email, sponsored email. Okay. To, I think, 50,000 or 60,000 subscribers. That’s a big list. Exactly the market we want, market align, right? However, when I said,13:31 Okay, can you show me a case study of when you’ve done this before? Can you show me your open rate, your click through rate? Like, oh, we don’t have that.13:41 So you’re the first person to ever do this? To ask for it, absolutely. Oh, to ask for it? Yes, to ask for it. I would assume because like the first time someone asked that you would probably figure out how to get it, right? If you’re going to lose the deal. Right. And so they were like, oh, yeah, we don’t we don’t have that. was like, so you have no case studies where you’ve sold a sponsorship or you’ve, you know, put a link in like you’ve used affiliate links. So you can tell me what your click through rate is on those links. You can tell me what your conversion rate is on those links in an email.14:12 I can tell you that for any of my clients. I can tell you that for myself. And I think that’s what the affiliates need to know. And this is what I really want to focus on on the Pet Summit, because these people do have large audiences, is like you need to focus on telling the brand what you can drive for them. It’s not about how many followers you have. And it never is. It’s about what you can convert.14:34 or what you can, at least the traffic you drive to them because obviously if they don’t convert on the sales page, then it’s probably a sales page problem, right, or a listing problem. But if you can only drive 50 clicks, you have a million followers, it’s probably not a good financial investment. But if you can drive 10,000 clicks and you know that because you’ve used your own affiliate link, and you can use your own affiliate links to find this out, right, to create your media kit, then you’re become so much more valuable to that brand, you can charge whatever you want.15:03 You know why this conversation is very relevant to me right now? It’s because I’m switching from one of my larger affiliates to a different one, mainly because the product is better. Okay. But I wanted the same rates as what I was getting from the prior affiliate at least. So what I ended up negotiating was actually an upfront fee just to even make the content. And then they match the other affiliate. But15:32 In reality, if I was thinking about it, the product is better than what I’d been recommending in the past. That’s what prompted the switch. I don’t have a track record with this company, this new company at all, but they were still willing to negotiate these terms. You don’t have a track record with that company, but you do have a track record. Yes, that’s correct.15:57 You can. I we have it in seller summit media kit. Like we have case studies in there for people to like, you know, this company did this. We drove this many signups. You know, you so you don’t necessarily have to have it with the brand that you’re talking to, but you have to have it somewhere. Yeah, but they didn’t even ask for any of that stuff, which is very interesting. That’s absolutely nuts.16:23 It’s nuts when there’s an upfront fee, right? Because to me, if they offer you a bonus on the back end, like, we’ll pay you. If it’s normally two, we’ll pay you $3 to sign up, something like that. And you don’t drive any, then it’s no harm on them at all. But if they’re willing to invest that upfront fee, then that’s where it matters, right? Then if you drive nothing, it’s like, well, they’re out $1,000 or whatever, whatever it is. The reason why I bring it up is I think a lot of companies don’t ask that.16:52 question. Interesting. I do. I never don’t ask I know you do, but it’s actually happened a couple of times. I’ve sold podcast sponsorships before where they didn’t even ask for my listenership. You’re just so famous. No, no, but how do they know? I have all the information on a page, but they didn’t even ask for it. Which is crazy to me. Here’s where-17:20 So if this, and I’m sure this has happened to lots of people, right? You’re not the only person where brands don’t ask for that. The problem is, is let’s just say you’re like, charge $10,000 for a YouTube video, right? And so a company pays you $10,000 for a YouTube video and you drive 15 clicks. That company is not gonna work with you again. Right. Right. And to me, the beauty of17:45 the content creation, affiliate marketing, all those things, all of this online world is developing the relationships. Some of the most lucrative relationships I’ve had with brands and deals came from our fourth interaction. They approached me and are like, oh, we wanna, I remember the company that I worked for that sold baby bottles. They were like,18:06 Hey, we wanna sponsor you to go to blog her. So we’ll pay for your blogger ticket and we’ll pay for your hotel or whatever. And you just have to like wear our t-shirt around the conference and like that. was like, and write a blog post, something pretty simple. And I wanted to go to the conference and this is like, know, 2009. And I was like, yeah, no problem. I use these bottles anyway. It’s perfect, right? Have a baby. Well then, you know, that.18:27 that post did well, drove a lot of traffic to their website, you know, and so then they were like, hey, we wanna now pay you to write some more content. So I went from getting like a free ticket and free hotel, which was probably valued at eight or $900 to we’re gonna pay you several thousand dollars to then like, oh, we want you to be our brand ambassador. We want you to write on our blog, which then paid even higher, right? So because I delivered in step one, I made it to step three and four and it ended up being several thousand dollars over the course of18:57 a couple of years working with this company. Same thing with another baby brand. You know, started out with like just an affiliate relationship. Then they paid for sponsored posts. That did well. I ended up making multiple, multiple with them and with a TV deal. Right. Like, so that’s like so if you charge, you know, $10,000 in the beginning, you don’t deliver, then you’ve ruined any opportunity with them and you’ve ruined any opportunity to people they talk to. Right. Because when I was on the brand side, we all talked.19:27 Like who’s your like number one? Who’s your best blogger? Right? Like we had these like we all knew who the top people were and those are the people that got all the deals. So all these PR companies and marketing companies, they all talk to, they’re all friends. They all work at the same building in New York. Right? Like, so I think that’s why as the on the affiliate side, being able to have very clear like deliverables and information to give to these brands from day one, even if they’re not asking, makes such a difference.19:57 I just wanted to take a moment to tell you about a free resource that I offer on my website that you may not be aware of. If you are interested in starting your own online store, I put together a comprehensive six day mini course on how to get started in ecommerce that you should all check out. It contains both video and text based tutorials that go over the entire process of finding products to sell all the way to getting your first sales online. Now this course is free and can be obtained at mywifequitterjob.com slash free.20:26 just sign up right there on the front page via email and I’ll send you the course right away. Once again, that’s mywifequitterjob.com slash free. Now back to the show.20:37 You know, it’s this is like bringing up all this PTSD. I’m working with this brand right now where they want to name the title of the YouTube video. That’s so dangerous. And I’m like, OK, well, you want this title? I will tell you right now if we name it that it’s going to flop. Yeah. And it just depends. Do you want views or do you want to like rank for this keyword? That’s different. They’re like views. I’m like, OK, well, you’re paying the money. If you want that title.21:07 I’m happy to use it, but I’m gonna tell you now it’s not gonna do well. They haven’t gotten back. No, I mean, I was being frank. I was like, spent a lot of time on the title and the thumbnail, which is like 80 % of the success of a video. And you wanna name it something that’s just kind of dull, like how to do something very specific. Like I’m a fan of the tool, but if you do a tutorial how-to that’s very specific, very granular, it’s not gonna do well.21:37 That’s tough too, because at what point do you say, fine, you can light it all up and let it burn? At the end of the day, when it doesn’t perform to their expectations, it’s on you, even though it’s really on them. I did a prior sponsored video for one company and I had freedom to do everything. It got like 150,000 views.22:05 And then the, so they re-upped, they were very happy with that campaign. But this time they wanted to insert their brand in the title. Right? And so I spent all this time, I was like, okay, I’m just going to tell you upfront, it’s not going to do well. It’s not going do well. They’re like, that’s okay. I want, I want the brand in there. And so sure enough, I did what they said. The video was good and it only got 7,000 views. I haven’t heard from them since, but I don’t feel like it’s my fault.22:34 That’s not your fault at all. If you’re really honest with them, that’s on them too. That’s why I’m like, brands, come on. This is to talking to the brand side. If you’re hiring a creator to make this content, let them do what they do best. Quit trying to push the narrative. They’ll figure out a way to get your stuff in there organically. They’ll figure out…22:59 They’ll figure out the best way to do it. you come in, if you know so much, then why isn’t your YouTube channel at 500,000 subscribers? You don’t and that’s why you work with creators. That’s why you work with TikTokers, because their TikTok accounts are huge because they know what to say and what to do. You don’t. I know a lot of them when I was really heavy into the brand space.23:24 There were things that they didn’t want you to say that didn’t align with their values and guidelines. That stuff I can totally respect. But the parts of like, we want to title stuff or we want to like tell you, use our picture. This is a big one, like use their photos. I was like, so your stock images? No, you want my kid with a bottle, right? Like you don’t want an AI generated baby, know, kind of thing.23:48 So that’s the hard part. But here’s the other thing, and where I think this is what’s made you really successful with this sort of like, I know you’ve negotiated some deals with YouTube and things like that, which you didn’t really do on your blog as much. You’ve done it more on YouTube, is that when you do something and it doesn’t perform to your expectations, you make it right. And I think that’s what creators and affiliates need to know too, is if you have negotiated a deal,24:17 with a brand, maybe you’re getting a higher commission or you’re getting a flat fee plus a commission. And maybe it’s just like the video flops, right? Or the content doesn’t perform, like redo it, rewrite it, ask you, like get your circle to help you promote it, right? Like, because you wanna value those relationships and show them that like, hey, sometimes things just don’t work out the way you think they’re going to on the internet, that’s just life. But there are things you can do to help it. And you’ve always been willing to do those things for brands.24:46 which I think makes you very valuable to those companies. I mean, I am when I don’t warn them that it’s going to flop ahead of time. Correct. if you say like, you, yeah, that’s a totally different. like, if you are like, hey, I have, like, if you would have done that video where you had all the creative freedom and it got 3000 views, you would have done, you would have removed it, changed the thumbnail, changed it. Like you would have done stuff to like, hey, this isn’t performing to the standard of my normal videos. I need to fix it.25:12 That’s what I think content creators need to do too, if you want to build those relationships because you and I both know, for example, Jim Wang and JD Roth made their fortunes on affiliates. The reason why, well, mostly Jim. Jim was doing everything in his power to maximize conversions and referrals when doing that. That was his main gig.25:38 A, testing, changing buttons, doing those things. As a content creator, if you want those super lucrative relationships and affiliate relationships, you’ve got to do everything to get the best results. If you’re willing to do that, you’re going to see a huge financial gain from it, especially if you already have an audience. Yeah. Sorry, we got off track from affiliate marketing. It’s still affiliate marketing in general.26:08 So I was just thinking affiliate marketing is a lot more difficult now on short form, unless you’re using the platform, like TikTok shop as an affiliate is. I was just going to say it’s gotten so much easier. Oh, you’re talking about? Well, yeah. So when I say. Yeah, with TikTok, I just don’t like being beholden to this platform, to these platforms. I have some acquaintances of mine who racked up a lot of money26:38 being a TikTok affiliate, but then they created some content that got them a strike and they never got their payout. It’s stuff like that that you’ll be holding to a platform. I guess you are anyways, if you’re on a blog too, you’ll be holding to the company that’s paying you too. It just seems though a lot more dangerous when it’s like company wide, like all your affiliates under one roof. yeah.27:06 So yeah, I was like gonna go the absolute opposite direction. I would say, I totally agree with you with that. Like, and I feel like TikTok right now reminds me a lot of like those big Amazon affiliates back in like 2012, 2013, like especially the deal bloggers, right? That would like drive, I mean, they were making 20, 30, $40,000 a month off of 2 % commissions, right? Like we’re talking like the volume is insane. And then all of a sudden Amazon wakes up one day and goes, oh, you’re not 4%, you’re 2%.27:37 Right. Right. Which is essentially what TikTok can do today. Right. Like, oh, you’re banned or this is a strike or we took the video down. Right. Like they can kind of do whatever they want and you have no recourse. Just like you had no recourse was Amazon. If Amazon wanted to cut your commissions and Amazon went in in like 2012, 2013, 2014 and cut every big affiliates commissions, every single not one person got out of that without a massive affiliate cut, which is of course so funny because like28:05 the smaller companies will up your commission if you’re doing that kind of a job. But Amazon’s like, nope, screw you. Because they don’t need us anymore. Yeah, because like, oh, yeah, you got the product listing up. You got it viral, like on Amazon. We don’t need you anymore. It’s got 20,000 reviews thanks to you. So but my thinking is if you are newer to content creation and you don’t really know anything about affiliate marketing and you haven’t been in the space for a while, TikTok just makes it really easy. So while28:34 There’s the negative of like you’re also beholden to TikTok just like as a seller, right? Same thing. The ease of which you can be an affiliate on TikTok is kind of nuts. mean, same with Amazon, I guess, right? Except for it’s just like so much easier to get. Well, like, with TikTok, it’s like so much like people can buy your stuff on TikTok. mean, Amazon now on the Amazon Influencer program, if your videos live on the listing, that’s another story. But with TikTok,29:03 I guess, I don’t know, is your feed filled with these videos? Mine is. What type of videos? do mean? Like a TikTok influencer, they’re hawking the Breeze drink, the mushroom. You can tell my feed, Breeze drink, mushroom gummies. I get all these bras. That’s just my feed, right? Obviously, TikTok’s got a great algorithm. I’m trying to think what I get sold, like gadgets. Okay. The one I get a lot is this-29:32 this gimbal for your phone so you can film yourself and it follows you. I’ve been getting that commercial a lot. But yeah, yeah. mean, a lot of times these days, actually, it’s people live selling too. I get a lot of live streams too. I get the one Korean skincare girl like 24 seven. That’s the one. And I’ve never bought skincare on TikTok. So I don’t know why that’s in my algorithm. But if you’re a content creator and you have a TikTok account and you’re growing it.29:59 It doesn’t make sense to not do this in my opinion. This is where it stinks to sell on TikTok. The commissions are stupid. On Amazon, you’re lucky to get 2%. On TikTok, you can get 10, 15, and then sometimes a bonus. TikTok’s trying to build this program out. I would say ride the wave while you can.30:25 It probably will not be like this forever because I don’t think it’s actually financially sustainable. Not only that, people, have you ever bought anything from TikTok Shop? I have not, but my wife has, I believe. Let’s just say I make a video and I’m talking about how great these little thumbtacks are and I show you my little bulletin board and it’s so awesome and these are so cute and they stick and whatever. They’ve got the days of the week on them, I don’t know. You’re like, oh, yes, I need those. You literally click.30:55 and it’s in your cart and your checkout information is saved and within like 13 seconds, like that’s my biggest downfall of TikTok Shop is that like I’ll see a video and like before I know it, it’s at my front door. Like it didn’t give me a chance to decide not to do something. There’s no barrier for the consumer. So as an affiliate, that’s exactly what you want. Cause the last thing you wanna do like,31:19 I remember back in the day it was like, you can earn money if people give us their email and fill out this 15 step survey and blah, blah, blah. It’s like, well, people drop, right? But here it’s like these thumbtacks, two clicks and I’ve bought them. So as on the affiliate side, to me, not doing that doesn’t make sense right now because now that’s not how you should pay your mortgage. You shouldn’t base your whole financial plan on the TikTok affiliate program. I mean, some people do that. Let’s be fair.31:46 And YouTube and Instagram have something similar now too. It’s just TikTok works really well. Yeah. But I think if you should be doing that as an affiliate, should be finding the products that… And you can go in there as an affiliate and find stuff that makes sense for your audience. Like don’t promote stuff that doesn’t make sense. I know for my TikTok channel, once a week, I get an email from TikTok that says, hey, I’ll pay you a hundred bucks to create this specific content promoting this thing.32:18 So I’m not sure. I don’t really chat with my mastermind buddies about TikTok actually. I’m just curious if anyone else is getting think the bigger, since your account’s bigger, I’m sure anyone with your size of account is getting that. But think about how easy that is. I would just pick up my phone and just say a couple words about this thing and then you get paid out. You submit your video, they approve it, and then you get your payment. It’s anywhere between 50 to 100 bucks. Well, here’s the other thing to think about.32:47 The whole beauty of TikTok is they don’t want edited content. They want literally seeing your finger push off the button to start the film. It’s not even like you have to edit anything. It’s like you just pick it, literally pick up your phone and record. To me, on the affiliate side, not doing TikTok affiliate doesn’t make sense if you’re looking to generate revenue. Right. The other platform is on the other hand.33:16 Yeah, I wouldn’t like put all my eggs in that basket. That’s the only warning because it could shut down again. Yeah, it’s I just would treat it like cash flow. Yeah. The other platforms, I think, are a little harder. I mean, they’re trying to mimic the same thing that TikTok has. Yeah. But at least on YouTube, I always in the video say, hey, link link below and I always make it the first link. So it shows up if I’m trying to promote something outside of that, though.33:45 I don’t know, I guess your friends are probably more into this. Are they still making a lot of money affiliates on their blogs or? I don’t think anybody’s cleaning up on the blog anymore unless you still have a post that either is viral on Pinterest or ranks on Google. That’s really the easiest way to do it. What I do think is that, this is where I think the affiliate opportunity is really34:13 ripe and we are not saturated in this. If you can make YouTube videos where you teach somebody how to do something or you show, like if you’re showing people something on a video, it makes it really easy to convert on those affiliate links. Yes, they have to click off of YouTube and go to the store or whatever to buy it or sign up for the software or whatever it is. like, I can’t tell you how many times that I have searched for how to do something and34:41 I watch two or three YouTube videos and I will buy whatever the tool or product or service is based on that creator teaching me how to do it. That’s like my bread and butter. I teach people how to use a tool, which is why with this new affiliate, once I film these videos, I know I’m to be able to deliver. I was just curious because they don’t know any of stuff. I think it’s so crazy that they don’t want that information, but I also am not surprised because35:10 I’ve dealt with a lot of these people. That’s the thing though. It’s like a lot of content creators are storytellers, right? Which we always say is the hardest way to monetize and grow because most people are not that great of a storyteller. Even if you’re a storyteller and that’s most of your videos, if you can teach people how to do something, a perfect example is like Jamerill, our friend that does the mega cooking.35:40 She’s a storyteller and she’s good and she’s interesting, right? Because she’s got a million kids and she has like a commercial kitchen in her house. It’s like people are watching it for almost like the TLC value, right? Of like, what does it look like to can 40,000 jars of tomatoes or something? But when she says this is the only stew pot I use, right? In her videos, then anyone who’s watching that for like, they do want to learn how to like bulk cook or do those things like.36:06 They’re going to buy that pot. They’re going to buy from her link. So you can still weave in the teaching and the story. You just have to be very purposeful in how you do it. Yeah. I mean, she is just really good at being on camera, actually. Yes. And she will say that she’s done every single thing wrong on camera. It’s still great. Well, no. mean, it’s trial and error. I’m sure she was bad in the beginning. Yeah. She breaks all the YouTube rules, apparently. But you know.36:35 I feel like there’s a lot of people who are successful and they didn’t necessarily follow the exact script. However, if you follow the script, it’s probably a lot easier for the most part. But yeah, I think that’s still an opportunity. Even like we talked about Kevin a lot on the podcast, but he did that video about like comparing routers or wifi systems or things like that. And he drove for the size of his channel, the amount of clicks he drove was like crazy, right? Like proportionally.37:02 I think he had like 500 subscribers and he drove 300 clicks. I wonder if it makes sense for him to just be a TikTok affiliate in the tech sector. Yeah, I would think. Although knowing his personality, I don’t know if he’d be willing to do it because because these are some of these are no name brands, right? Yes. And he mainly talks about the mainstream. So maybe he wouldn’t do it. But that would probably be a way for him to just review stuff. Yeah. And make a lot more money probably than than the affiliate.37:32 I think he’s an Amazon affiliate right now, right? Yes, he’s an Amazon affiliate. Which doesn’t pay out that much. Yeah. But I think with the YouTube content, teaching is the key to getting people to click and buy through your affiliate link. It’s not too hard for people to click through and do that. Obviously, there’s a couple more steps than just on the TikTok shop, but it’s still not that hard. People are willing to do it. Oh, yeah, for sure. For sure.38:01 So I guess the overall sentiment here is I’m actually kind of sad that this is the case. And we had alluded to this earlier, but you know, blogging because of the Google changes, less favorable. think affiliate blog, like a pure affiliate blog. Yeah. I wouldn’t do it today. Where the affiliate dollars are, are on short form video and long form video and social media today. Yeah.38:30 Hope you enjoyed this episode. If you currently run an affiliate blog, let me know your thoughts. For more information and resources, go to mywifequithejobs.com slash episode 583. Once again, tickets to the Seller Summit 2025 are now on sale over at sellersummit.com. If you want to hang out in person in a small intimate setting, develop real relationships with like-minded entrepreneurs and learn a ton, then come to my event. Go to sellersummit.com.38:58 And if you’re interested in starting your own e-commerce store, head on over to my wife, quitherjob.com and sign up for my free six day mini course. Just type in your email and I’ll send the course right away via email.",
  "image": "https://mywifequitherjob.com/blog/wp-content/uploads/2025/03/MWQHJ583SteveToni.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eIn this episode, Toni and I discuss how Google’s latest algorithm update has shaken up the affiliate marketing world, leaving many sites in the dust.\u003c/p\u003e\u003cp\u003eWe’ll cover what this means for content creators and how to bounce back stronger than ever.\u003c/p\u003e\u003cp\u003eIf you are interested in starting an ecommerce business, I put together a \u003cstrong\u003ecomprehensive package of resources\u003c/strong\u003e that will help you \u003cstrong\u003elaunch your own online store\u003c/strong\u003e from complete scratch. Be sure to grab it before you leave!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSellersSummit.com\u003c/strong\u003e – The Sellers Summit is the ecommerce conference that I’ve run for the past 8 years. It’s small and intimate and you’ll learn a ton! \u003ca href=\"https://sellerssummit.com/members2024/virtual-pass\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eClick Here To Grab The Recordings\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Family First Entrepreneur\u003c/strong\u003e – Purchase my Wall Street Journal Bestselling book and receive $690 in free bonuses! \u003ca href=\"https://mywifequitherjob.com/book\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eClick here to redeem the bonuses\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e 00:00\u003cbr/\u003e Welcome back to the podcast, the show where I cover all of the latest strategies and current events related to e-commerce and online business. In this episode, Tony and I dive into the state of affiliate marketing and whether it’s still a viable business model today, especially in light of Google’s latest algorithm updates. But before we begin, I wanted to let you know that tickets are now on sale for Seller Summit 2025 over at sellersummit.com and the prices are now going to go up every two weeks until the event starts. The Seller Summit\u003c/p\u003e\u003cp\u003e00:29\u003cbr/\u003e is the conference that I hold every year that specifically targets e-commerce entrepreneurs selling physical products online. Unlike other events that focus on inspirational stories and high-level advice, mine is a curriculum-based conference where you will leave with practical and actionable strategies specifically for an e-commerce business. Every speaker I invite is deep in the trenches of their e-commerce business, entrepreneurs who are importing large quantities of physical goods, and not some high-level guys who are overseeing their companies at 50,000 feet.\u003c/p\u003e\u003cp\u003e00:59\u003cbr/\u003e I personally hate large events, so the Seller’s Summit is always small and intimate. Every year we cut off ticket sales at around 200 people, so tickets sell out fast, and we’ve sold out every single year for the past 8 years. If you are an ecommerce entrepreneur making more than $250,000 or $1 million per year, we also offer an exclusive mastermind experience with other top sellers. The Seller’s Summit is going to be held in Fort Lauderdale, Florida from May 6th to May 8th.\u003c/p\u003e\u003cp\u003e01:28\u003cbr/\u003e Right now, this is the cheapest the tickets will ever be. So head on over to sellersummit.com and grab your ticket. Now onto the show.\u003c/p\u003e\u003cp\u003e01:42\u003cbr/\u003e Welcome to the My Wife, Quit or Job podcast. Today we’re going to talk about affiliate marketing in today’s age where people are putting out less content, especially on blogs. Yeah, I’m cheating with this one because I’m actually on an affiliate marketing panel in a couple of months, actually next month. Oh at the Pet Summit.  At the Pet Summit. Yeah. And it was funny because we had a little meeting yesterday to talk about what we were, you know, kind of the structure of the panel. As you know, I’m not a panel fan because I feel like\u003c/p\u003e\u003cp\u003e02:12\u003cbr/\u003e people don’t learn anything, but we wanted  this panel to be really educational for the attendees. And so we basically walked through a strategy of what we wanted to talk about. And as we were doing that, we all had very  strong views on how to best make affiliate marketing work for you. And I think you still can. I think this is actually still really lucrative. And the exciting part is, and we’ve said this a lot, you don’t have to have a ton of traffic to make affiliate marketing work on any platform, YouTube.\u003c/p\u003e\u003cp\u003e02:42\u003cbr/\u003e Instagram, TikTok, blog. It’s not always about being in the millions of views. Yeah, you know what?  Usually before we record, I go and I Google to see what like the latest current events are. And I’ve just noticed recently that there’s hardly any content out there except from like the larger sites.  All the smaller independent blogs aren’t really putting out content anymore. And if they are, it’s all kind of like the AI generated stuff.\u003c/p\u003e\u003cp\u003e03:11\u003cbr/\u003e I feel like all these Google changes in the past couple of years have really decimated the entire blogging community to the point where at some point AI is not going have any content or to digest.  That’s what  I wondered that  last year. I think we probably talked about it on the podcast. If everyone stops creating content, then where does the content come from?  People are still putting out YouTube content  and short form content.\u003c/p\u003e\u003cp\u003e03:39\u003cbr/\u003e The whole blogosphere, I feel like,  is just going away.  Let’s start with blogging. Let’s start with that as the first bucket. I think if you have a blog right now and you’ve had one for a while,  I wouldn’t stop creating content and I wouldn’t stop using affiliate links. I just think you have to be more strategic about how you’re using them and also integrating other\u003c/p\u003e\u003cp\u003e04:08\u003cbr/\u003e mediums with the blog. So for example, let’s just we’ll do we’ll do one of yours and one of mine. So let’s just say vacuums, right? I love to talk about affiliates for vacuums because I buy a vacuum every year.  And,  before I could just write a post and include a link to a vacuum. And, you know,  that would be it. Right. And people would click on it and I’d make money. But today, that’s not that’s not going to work. Right. So one thing you can do with the blog is\u003c/p\u003e\u003cp\u003e04:35\u003cbr/\u003e you know, not just write a post, but I’m gonna embed a video of me using like two or three vacuums and I’m gonna show you like how I empty my Dyson and how it works on different surfaces. And you know, I’m gonna include that video content into the blog post so that people can realize like, cause I still like, I still use that. I still use blogs for those things. I still read reviews and not just on Amazon, right? Because  there’s a lot of times where I’m on Amazon and I don’t,\u003c/p\u003e\u003cp\u003e05:04\u003cbr/\u003e I don’t trust the product, the first couple of product reviews, right? Cause I’m like, that person totally got that item for free  or there was some backdoor dealing with, know,  send it to me, I’ll PayPal you, blah, blah, blah kind of thing. And we, all know that happens,  those of us in this business. And so I still like to see regular people talking about the products and talking about why they like them and why they don’t like them. So I would start incorporating video into my blog posts, especially with\u003c/p\u003e\u003cp\u003e05:32\u003cbr/\u003e Anything  you could demonstrate and then the other option would be something you would do was how to use a tool. Yes, that was largely YouTube-focused.  Even when I was doing a blog post for it, it was mainly the YouTube video that was driving a lot  of those clicks, actually. Just to be clear for everyone listening, I’m not saying blogging is dead, but if it’s a standalone blog,\u003c/p\u003e\u003cp\u003e06:00\u003cbr/\u003e without a business or service associated with it, Google is just not ranking those sites.  And so the old method of  creating a review post or a comparison post or whatnot for affiliate marketing, the likelihood of you getting  at least SEO traffic to it  is highly unlikely now,  which is why people have stopped writing posts  for the most part. Well, yeah, because you put in all this work and then no one sees it. And if you don’t have\u003c/p\u003e\u003cp\u003e06:30\u003cbr/\u003e If you don’t have an email list that you can drive people to read stuff to, or you’re not leveraging social media or Pinterest, if Google was basically your main squeeze, then  you really don’t have another way right now to get traffic to your website. Yes, and I think  the issue with affiliate marketing, at least the way it works today for the most part, is that you need to get someone to click on a link  where it’s then attributed to you. But where can you put a link?\u003c/p\u003e\u003cp\u003e06:59\u003cbr/\u003e The blog was the ideal location to do that. Yes.  So now that like the blog part is probably less likely for you to get traffic there, that leaves  email, which is  still incredible for that. And that also leaves social media and YouTube, guess, if you consider that social media. Problem with social media, though, is that you can’t include links. Right. Right. And on YouTube, when you include a link, it’s usually in the description.\u003c/p\u003e\u003cp\u003e07:29\u003cbr/\u003e Getting people to click on these links is a lot harder than it used to be on a blog. I think the one exception to this would be, let’s just say, because my blog has been up and down with SEO, it got hit really bad many, many years ago, and then it rebounded a little, and then it dropped, and then it can’t. It’s like a  never-ending revolving door. What I have found is there are still posts that do fairly well.\u003c/p\u003e\u003cp\u003e07:59\u003cbr/\u003e on Google, Pinterest, like they’re still getting traffic, right? They’re just popular posts.  And what I was thinking about the other day, cause you know how Google  search console sends you like that little report every month of like what  has impressions and clicks. And I realized that like as I usually just delete those, I don’t look at them too seriously cause Google hasn’t been like a main traffic source for me for a long time.\u003c/p\u003e\u003cp\u003e08:23\u003cbr/\u003e But I started looking at it and I was like, know, this post actually, I don’t think I’ve touched this post in a really long time. I was like, I should go in there and just, if people are coming to it, like, why am I not maximizing that? Right? So if you already have content and you are a content creator and maybe you have been hit by Google updates and you’re discouraged and you’re not creating that new content, you can still update your old content. And it was funny because I got a check after Christmas or like a deposit from\u003c/p\u003e\u003cp\u003e08:51\u003cbr/\u003e commission junction that was like more than it, like I get like about the same amount every month or so. And this was like double. And I was like, huh, that’s weird. Like maybe it’s an error.  But then when I like started digging in and I got the search console results, I realized like, oh no, this one post is like resurfaced basically. And it had an affiliate list. So then it’s like, in there and update your old content. If you’re seeing this getting traction from wherever it’s getting traction from.\u003c/p\u003e\u003cp\u003e09:19\u003cbr/\u003e make sure that that stuff is optimized because there’s probably like, and actually I was updating another post and like all my affiliate links were broken, right? Because the post was like 13 years old  and it had resurfaced on Pinterest. So  someone had pinned like a picture and then it was just getting like a lot of traction there.  And I realized that every single Amazon link on there, the product, I because I linked it 13 years ago, those products aren’t being sold, right? And obviously people are still getting to Amazon. The link still\u003c/p\u003e\u003cp\u003e09:48\u003cbr/\u003e tracks, right? So I would still get credit if they bought something, but wouldn’t it be better to actually send them to a product that they want, right? Like, wouldn’t it be better to work on that? So that’s something if you if you’re in that position, I would recommend, you know, prioritizing the content and making sure that everything is updated because it’s so easy to just let that stuff go  because there’s so much else that you could be working You’re about like an existing affiliate post, right? Yes, existing. Yeah. I’m curious, can we talk about your panel? Do you guys have an agenda?\u003c/p\u003e\u003cp\u003e10:19\u003cbr/\u003e We do, we do. I’m pretty sure the people listening are not gonna be at the Pet Summit. No, they’re not. They’re not. So one of the things that we really wanna talk about, which I think is very important, is that, most of the creators at the Pet Summit are not bloggers. They don’t even have a website, which still blows my mind. I know that I’m old school, but how could you not just have a landing page? I agree.\u003c/p\u003e\u003cp\u003e10:48\u003cbr/\u003e Yeah, a lot of creators don’t have anything. just rely on Instagram. yes, and their link tree or whatever.  So that’s what I learned last year from speaking there is that there were probably 60 % of the people there had no website at all. Like everything was through Instagram, TikTok. And these are huge, like  millions of followers. We’re not talking about like little 10,000, you know, create follower accounts.\u003c/p\u003e\u003cp\u003e11:16\u003cbr/\u003e So one of the things that I have found coming from working on both sides, right, being an affiliate and also working with the brands trying to recruit affiliates is that most of the time the creators, especially the ones that have built like a very large following on social, do not understand that you can negotiate with your affiliates. Right. Like  all of this is negotiable.  Most of the time when you’re a content creator and you have a social following,\u003c/p\u003e\u003cp\u003e11:46\u003cbr/\u003e you usually send out that media kit, right? Or you’re like, well, I charge $1,000 for a post or I charge $5,000 for a video, right? As opposed to negotiating like, yeah, I’m gonna charge you a flat fee, but also I would like a commission on sales that I drive to your product. And maybe your normal commission rate is 5%, I want seven, right? So  most creators don’t know that you can do that.\u003c/p\u003e\u003cp\u003e12:11\u003cbr/\u003e in this new creator space, right? Like these last people who have blown up in the last two or three years, they don’t understand that all of that is negotiable and that you should always ask  for the double dip. You should always ask for the flat fee plus the affiliate revenue, right? Now, if you’re a small creator and you’re just getting started, you just wanna go in with the affiliate, because you wanna prove yourself, right?  But then on the flip side, what they don’t understand is you can’t just tell a brand\u003c/p\u003e\u003cp\u003e12:40\u003cbr/\u003e I charge X amount of dollars and not be able to show the brand some level of conversion on the backend. But oftentimes, in every brand that I’ve spoken with in the past year or two, basically, it’s like, get these media kits and they want $25,000 for an Instagram post or so. Some of this is absolutely obscene.\u003c/p\u003e\u003cp\u003e13:03\u003cbr/\u003e I’m like, well, I would never take that. I actually dealt with a brand just last week who sent a media kit and they wanted $3,000 for an email. Did I tell you this story? No. I want to make sure I didn’t tell them the podcast already. They wanted $3,000 for an email, sponsored email. Okay. To, I think, 50,000 or 60,000 subscribers. That’s a big list. Exactly the market we want, market align, right? However, when I said,\u003c/p\u003e\u003cp\u003e13:31\u003cbr/\u003e Okay,  can you show me a case study of when you’ve done this before? Can you show me your open rate, your click through rate? Like, oh, we don’t have that.\u003c/p\u003e\u003cp\u003e13:41\u003cbr/\u003e So you’re the first person to ever do this? To ask for it, absolutely. Oh, to ask for it? Yes, to ask for it. I would assume because like the first time someone asked that you would probably figure out how to get it, right? If you’re going to lose the deal. Right. And so they were like, oh, yeah, we don’t we don’t have that. was like, so you have no case studies where you’ve sold a sponsorship or you’ve, you know, put a link in like you’ve used affiliate links. So you can tell me what your click through rate is on those links. You can tell me what your conversion rate is on those links in an email.\u003c/p\u003e\u003cp\u003e14:12\u003cbr/\u003e I can tell you that for any of my clients. I can tell you that for myself.  And I think that’s what the affiliates need to know. And this is what I really want to focus on on the Pet Summit, because these people do have large audiences, is like you need to focus on telling the brand  what you can drive for them. It’s not about how many followers you have. And it never is. It’s about what you can convert.\u003c/p\u003e\u003cp\u003e14:34\u003cbr/\u003e or what you can, at least the traffic you drive to them because obviously if they don’t convert on the sales page, then it’s probably a sales page problem, right, or a listing problem. But if you can only drive 50 clicks,  you have a million followers, it’s probably not a good financial investment. But if you can drive 10,000 clicks and you know that because you’ve  used your own affiliate link, and you can use your own affiliate links to find this out, right, to create your media kit, then you’re become so much more valuable to that brand, you can charge whatever you want.\u003c/p\u003e\u003cp\u003e15:03\u003cbr/\u003e You know why this conversation is very relevant to me right now?  It’s because I’m switching from one of my larger affiliates to a different one, mainly because the product is better. Okay. But I wanted the same rates as what I was getting from the prior affiliate at least. So what I ended up negotiating was actually an upfront fee just to even make the content.  And then they match the other affiliate. But\u003c/p\u003e\u003cp\u003e15:32\u003cbr/\u003e In reality, if I was thinking about it,  the product is better than  what I’d been recommending in the past. That’s what prompted the switch. I don’t have a track record with this company, this new company at all, but they were still willing to negotiate these terms. You don’t have a track record with that company, but you do have a track record. Yes, that’s correct.\u003c/p\u003e\u003cp\u003e15:57\u003cbr/\u003e You can. I we have it in seller summit media kit. Like we have case studies in there for people to like, you know, this company did this. We drove this many signups.  You know, you so you don’t necessarily have to have it with the brand that you’re talking to, but you have to have it somewhere. Yeah, but they didn’t even ask for any of that stuff, which is very interesting. That’s absolutely nuts.\u003c/p\u003e\u003cp\u003e16:23\u003cbr/\u003e It’s nuts when there’s an upfront fee, right? Because to me, if they offer you a bonus on the back end, like, we’ll pay you. If it’s normally two, we’ll pay you $3 to sign up, something like that.  And you don’t drive any, then it’s no harm on them at all. But if they’re willing to invest that upfront fee, then that’s where it matters, right? Then if you drive nothing, it’s like, well, they’re out $1,000 or whatever, whatever it is. The reason why I bring it up is  I think a lot of companies don’t ask that.\u003c/p\u003e\u003cp\u003e16:52\u003cbr/\u003e question. Interesting. I do. I never don’t ask I know you do, but it’s actually happened a couple of times.  I’ve sold podcast sponsorships before where they didn’t even ask for my listenership.  You’re just so famous. No, no, but how do they know? I have all the information on a page, but they didn’t even ask for it. Which is crazy to me.  Here’s where-\u003c/p\u003e\u003cp\u003e17:20\u003cbr/\u003e So  if this, and I’m sure this has happened to lots of people, right? You’re not the only person where brands don’t ask for that. The problem is, is let’s just say you’re like, charge $10,000 for a YouTube video, right? And so a company pays you $10,000 for a YouTube video and you drive 15 clicks. That company is not gonna work with you again. Right. Right. And to me, the beauty of\u003c/p\u003e\u003cp\u003e17:45\u003cbr/\u003e the content creation, affiliate marketing, all those things, all of this online world is developing the relationships. Some of the most lucrative relationships I’ve had with brands and deals came from our fourth interaction. They approached me and are like, oh, we wanna, I remember the company that I worked for that sold baby bottles. They were like,\u003c/p\u003e\u003cp\u003e18:06\u003cbr/\u003e Hey, we wanna sponsor you to go to blog her. So we’ll pay for your blogger ticket and we’ll pay for your hotel or whatever. And you just have to like wear our t-shirt around the conference and like that. was like, and write a blog post, something pretty simple. And I wanted to go to the conference and this is like,  know, 2009. And I  was like, yeah, no problem. I use these bottles anyway. It’s perfect, right? Have a baby. Well then, you know,  that.\u003c/p\u003e\u003cp\u003e18:27\u003cbr/\u003e that post did well, drove a lot of traffic to their website, you know, and so then they were like, hey, we wanna now pay you to write some more content. So I went from getting like a free ticket and free hotel, which was probably valued at eight or $900 to we’re gonna pay you several thousand dollars to then like, oh, we want you to be our brand ambassador. We want you to write on our blog, which then paid even higher, right? So because I delivered in step one, I made it to step three and four and it ended up being several thousand dollars over the course of\u003c/p\u003e\u003cp\u003e18:57\u003cbr/\u003e a couple of years working with this company. Same thing with another baby brand. You know, started out with like just an affiliate relationship. Then they paid for sponsored posts. That did well. I ended up making multiple, multiple with them and with a TV deal. Right. Like, so that’s like so if you charge, you know, $10,000 in the beginning, you don’t deliver, then you’ve ruined any opportunity with them and you’ve ruined any opportunity to people they talk to. Right. Because when I was on the brand side, we all talked.\u003c/p\u003e\u003cp\u003e19:27\u003cbr/\u003e Like who’s your like number one? Who’s your best blogger? Right? Like we had these like we all knew who the top people were  and those are the people that got all the deals. So all these PR companies and marketing companies, they all talk to, they’re all friends. They all work at the same building in New York. Right? Like, so  I think that’s why as the on the affiliate side, being able to have very clear like deliverables and information to give to these brands from day one, even if they’re not asking, makes such a difference.\u003c/p\u003e\u003cp\u003e19:57\u003cbr/\u003e I just wanted to take a moment to tell you about a free resource that I offer on my website that you may not be aware of. If you are interested in starting your own online store, I put together a comprehensive six day mini course on how to get started in ecommerce that you should all check out. It contains both video and text based tutorials that go over the entire process of finding products to sell all the way to getting your first sales online. Now this course is free and can be obtained at mywifequitterjob.com slash free.\u003c/p\u003e\u003cp\u003e20:26\u003cbr/\u003e just sign up right there on the front page via email and I’ll send you the course right away. Once again, that’s mywifequitterjob.com slash free. Now back to the show.\u003c/p\u003e\u003cp\u003e20:37\u003cbr/\u003e You know, it’s  this is like bringing up all this PTSD. I’m working with this brand right now  where they want to name the title of the YouTube video.  That’s so dangerous. And I’m like, OK, well, you want this title? I will tell you right now if we name it that it’s going to flop. Yeah. And it just depends. Do you want views or do you want to like rank for this keyword? That’s different. They’re like views. I’m like, OK, well, you’re paying the money. If you want that title.\u003c/p\u003e\u003cp\u003e21:07\u003cbr/\u003e I’m happy to use it, but I’m gonna tell you now it’s not gonna do well.  They haven’t gotten back. No, I mean, I was being frank. I was like, spent a lot of time on the title and the thumbnail, which is like 80 % of the success of a video.  And you wanna name it something that’s just kind of dull, like how to do something very specific. Like I’m a fan of the tool, but  if you do a tutorial how-to that’s very specific, very granular, it’s not gonna do well.\u003c/p\u003e\u003cp\u003e21:37\u003cbr/\u003e That’s tough too, because at what point do you say, fine,  you can light it all up and let it burn? At the end of the day, when it doesn’t perform to their expectations, it’s on you, even though it’s really on them. I did a prior sponsored video for one company and I had freedom to do everything.  It got like 150,000 views.\u003c/p\u003e\u003cp\u003e22:05\u003cbr/\u003e And then the, so they re-upped, they were very happy with that campaign. But this time they wanted to insert their brand in the title.  Right? And so I spent all this time, I was like, okay, I’m just going to tell you upfront, it’s not going to do well. It’s not going do well. They’re like, that’s okay. I want, I want the brand in there. And so sure enough, I did what they said. The video was good and it only got 7,000 views.  I haven’t heard from them since, but I don’t feel like it’s my fault.\u003c/p\u003e\u003cp\u003e22:34\u003cbr/\u003e That’s not your fault at all. If you’re really honest with them, that’s on them too. That’s why I’m like, brands, come on. This is to talking to the brand side. If you’re hiring a creator to make this content, let them do what they do best. Quit trying to push the narrative. They’ll figure out a way to get your stuff in there organically.  They’ll figure out…\u003c/p\u003e\u003cp\u003e22:59\u003cbr/\u003e They’ll figure out the best way to do it. you come in, if you know so much, then why isn’t your YouTube channel at 500,000 subscribers? You don’t and that’s why you work with creators. That’s why you work with TikTokers, because their TikTok accounts are huge because they know what to say and what to do. You don’t. I know a lot of them when I was really heavy into the brand space.\u003c/p\u003e\u003cp\u003e23:24\u003cbr/\u003e There were things that they didn’t want you to say that didn’t align with their values and guidelines. That stuff I can totally respect.  But the parts of like, we want to title stuff or we want to like tell you, use our  picture. This is a big one, like use their photos. I was like, so your stock images? No, you want my kid with a bottle, right? Like you don’t want an AI generated baby, know, kind of thing.\u003c/p\u003e\u003cp\u003e23:48\u003cbr/\u003e So that’s the hard part. But here’s the other thing, and where I think this is what’s made you really successful with this sort of like, I know you’ve negotiated some deals with YouTube and things like that, which you didn’t really do on your blog as much. You’ve done it more on YouTube, is that when you do something and it doesn’t perform to your expectations, you make it right. And I think that’s what creators and affiliates need to know too, is if you have negotiated a deal,\u003c/p\u003e\u003cp\u003e24:17\u003cbr/\u003e with a brand, maybe you’re getting a higher commission or you’re getting a flat fee plus a commission. And maybe it’s just like the video flops, right? Or the content doesn’t perform, like redo it, rewrite it, ask you, like get your circle to help you promote it, right? Like, because you wanna value those relationships and show them that like, hey, sometimes things just don’t work out the way you think they’re going to on the internet, that’s just life. But there are things you can do to help it. And  you’ve always been willing to do those things for brands.\u003c/p\u003e\u003cp\u003e24:46\u003cbr/\u003e which I think makes you very valuable to those companies. I mean, I am when I don’t warn them that it’s going to flop ahead of time. Correct. if you say like, you, yeah, that’s a totally different. like, if you are like, hey, I have, like, if you would have done that video where you had all the creative freedom and it got 3000 views, you would have done, you would have removed it, changed the thumbnail, changed it. Like you would have done stuff to like, hey, this isn’t performing to the standard of my normal videos. I need to fix it.\u003c/p\u003e\u003cp\u003e25:12\u003cbr/\u003e That’s what I think content creators need to do too, if you want to build those relationships because you and I both know, for example, Jim Wang and JD Roth made their fortunes on affiliates. The reason why, well, mostly Jim. Jim was doing everything in his power to maximize conversions  and referrals when  doing that.  That was his main gig.\u003c/p\u003e\u003cp\u003e25:38\u003cbr/\u003e A, testing,  changing buttons, doing those things. As a content creator, if you want those super lucrative relationships and affiliate relationships,  you’ve got to do everything to  get the best results. If you’re willing to do that, you’re going to see a huge financial gain from it,  especially if you already have an audience. Yeah.  Sorry, we got off track from affiliate marketing.  It’s still affiliate marketing in general.\u003c/p\u003e\u003cp\u003e26:08\u003cbr/\u003e So I was just thinking affiliate marketing is a lot more difficult now on short form, unless you’re using the platform, like TikTok shop as an affiliate is. I was just going to say it’s gotten so much easier. Oh, you’re talking about? Well, yeah. So when I say. Yeah, with TikTok, I just don’t like being beholden to this platform, to these platforms. I have some acquaintances of mine who racked up a lot of money\u003c/p\u003e\u003cp\u003e26:38\u003cbr/\u003e being a TikTok affiliate, but then they created some content that got them a strike and they never got their payout. It’s stuff like that that you’ll be holding to a platform. I guess you are anyways, if you’re on a blog too, you’ll be holding to the company that’s paying you too.  It just seems though a lot more dangerous when it’s like company wide, like all your affiliates under one roof. yeah.\u003c/p\u003e\u003cp\u003e27:06\u003cbr/\u003e So yeah, I was like gonna go the absolute opposite direction. I would say, I totally agree with you with that. Like, and I feel like TikTok right now reminds me a lot of like those big Amazon affiliates back in like 2012, 2013, like especially the deal bloggers, right? That would like drive, I mean, they were making 20, 30, $40,000 a month off of 2 % commissions, right? Like we’re talking like the volume is insane. And then all of a sudden Amazon wakes up one day and goes, oh, you’re not 4%, you’re 2%.\u003c/p\u003e\u003cp\u003e27:37\u003cbr/\u003e Right. Right. Which is essentially what TikTok can do today. Right. Like, oh, you’re banned or this is a strike or we took the video down. Right. Like they can kind of do whatever they want and you have no recourse. Just like you had no recourse was Amazon. If Amazon wanted to cut your commissions and Amazon went in in like 2012, 2013, 2014 and cut every big affiliates commissions, every single not one person got out of that without a massive affiliate cut, which is of course so funny because like\u003c/p\u003e\u003cp\u003e28:05\u003cbr/\u003e the smaller companies will up your commission if you’re doing that kind of a job. But Amazon’s like, nope, screw you.  Because they don’t need us anymore. Yeah, because like, oh, yeah, you got the product listing up. You got it viral, like on Amazon. We don’t need you anymore. It’s got 20,000 reviews thanks to you.  So but my thinking is if you are newer to content creation and you don’t really know anything about affiliate marketing and you haven’t been in the space for a while, TikTok just makes it really easy. So while\u003c/p\u003e\u003cp\u003e28:34\u003cbr/\u003e There’s the negative of like you’re also beholden to TikTok just like as a seller, right? Same thing.  The ease of which you can be an affiliate on TikTok is kind of nuts. mean, same with Amazon, I guess, right? Except for it’s just like  so much easier to get. Well, like, with TikTok, it’s like so much like people can buy your stuff on TikTok. mean, Amazon now on the Amazon Influencer program, if your videos live on the listing, that’s another story. But with TikTok,\u003c/p\u003e\u003cp\u003e29:03\u003cbr/\u003e I guess, I don’t know, is your feed filled with these videos? Mine is. What type of videos? do mean? Like a TikTok influencer, they’re hawking the Breeze drink, the mushroom. You can tell my feed, Breeze drink, mushroom gummies. I get all these bras. That’s just my feed, right? Obviously, TikTok’s got a great algorithm. I’m trying to think what I get sold, like gadgets. Okay. The one I get a lot is this-\u003c/p\u003e\u003cp\u003e29:32\u003cbr/\u003e this gimbal for your phone so you can film yourself and it follows you. I’ve been getting that commercial a lot. But  yeah, yeah. mean, a lot of times these days, actually, it’s people live selling too. I get a lot of live streams too. I get the one Korean skincare girl like 24 seven. That’s the one. And I’ve never bought skincare on TikTok. So I don’t know why that’s in my algorithm. But  if you’re a content creator and you have a TikTok account and you’re growing it.\u003c/p\u003e\u003cp\u003e29:59\u003cbr/\u003e It doesn’t make sense to not do this in my opinion. This is where it stinks to sell on TikTok. The commissions are stupid. On Amazon, you’re lucky to get 2%. On TikTok, you can get 10, 15, and then sometimes a bonus. TikTok’s trying to build this program out. I would say ride the wave while you can.\u003c/p\u003e\u003cp\u003e30:25\u003cbr/\u003e It probably will not be like this forever because I don’t think it’s actually financially sustainable. Not only that, people, have you ever bought anything from TikTok Shop? I have not, but my wife has, I believe. Let’s just say I make a video and I’m talking about how great these little thumbtacks are and I show you my little bulletin board and it’s so awesome and these are so cute and they stick and whatever. They’ve got the days of the week on them, I don’t know. You’re like, oh, yes, I need those. You literally click.\u003c/p\u003e\u003cp\u003e30:55\u003cbr/\u003e and it’s in your cart and your checkout information is saved and within like 13 seconds, like that’s my biggest downfall of TikTok Shop is that like I’ll see a video and like before I know it, it’s at my front door. Like it didn’t give me a chance to decide not to do something. There’s no barrier for the consumer. So as an affiliate, that’s exactly what you want. Cause the last thing you wanna do like,\u003c/p\u003e\u003cp\u003e31:19\u003cbr/\u003e I remember back in the day it was like, you can earn money if people give us their email and fill out this 15 step survey and blah, blah, blah. It’s like, well, people drop, right? But here it’s like these thumbtacks,  two clicks and  I’ve bought them.  So  as on the affiliate side, to me,  not doing that doesn’t make sense right now because now that’s not how you should pay your mortgage. You shouldn’t base your whole financial plan on the TikTok affiliate program. I mean, some people do that. Let’s be fair.\u003c/p\u003e\u003cp\u003e31:46\u003cbr/\u003e And YouTube and Instagram have something similar  now too. It’s just TikTok works really well. Yeah. But I think if you should be doing that as an affiliate, should be finding the products that… And you can go in there as an affiliate and find stuff that makes sense for your audience. Like don’t promote stuff that doesn’t make sense. I know for my TikTok channel,  once a week, I get an email from TikTok that says, hey, I’ll pay you a hundred bucks to create this specific content promoting this thing.\u003c/p\u003e\u003cp\u003e32:18\u003cbr/\u003e So I’m not sure. I don’t really chat with my mastermind buddies about TikTok actually. I’m just curious if anyone else is getting think the bigger, since your account’s bigger, I’m sure anyone with your size of account is getting that. But think about how easy that is. I would just pick up my phone and just say a couple words about this thing and then you get paid out. You submit your video, they approve it, and then you get your payment. It’s anywhere between 50 to 100 bucks. Well, here’s the other thing to think about.\u003c/p\u003e\u003cp\u003e32:47\u003cbr/\u003e The whole beauty of TikTok is they don’t want edited content. They want literally seeing your finger push off the button to start the film. It’s not even like you have to edit anything. It’s like you just pick it, literally pick up your phone and record. To  me, on the affiliate side,  not doing TikTok affiliate doesn’t make sense if you’re looking to generate revenue. Right. The other platform is on the other hand.\u003c/p\u003e\u003cp\u003e33:16\u003cbr/\u003e Yeah, I wouldn’t like put all my eggs in that basket. That’s the only warning because it could shut down again.  Yeah, it’s  I just would treat it like cash flow. Yeah. The other platforms, I think, are a little harder. I mean,  they’re trying to mimic the same thing that TikTok has. Yeah. But  at least on YouTube, I always in the video say, hey, link link below and I always make it the first link. So it shows up if I’m trying to promote something outside of that, though.\u003c/p\u003e\u003cp\u003e33:45\u003cbr/\u003e I don’t know, I guess your friends are probably more into this. Are they still making a lot of money affiliates on their blogs or? I don’t think anybody’s cleaning up on the blog anymore unless you still have a post that either is viral on Pinterest or ranks on Google. That’s really the easiest way to do it.  What I do think is that,  this is where I think the affiliate opportunity is really\u003c/p\u003e\u003cp\u003e34:13\u003cbr/\u003e ripe and we are not saturated in this. If you can make YouTube videos where you teach somebody how to do something  or you  show, like if you’re showing people something on a video, it makes it really easy to convert on those affiliate links. Yes, they have to click off of YouTube and go to the store or whatever to buy it or sign up for the software or whatever it is.  like, I can’t tell you how many times that I have searched for how to do something and\u003c/p\u003e\u003cp\u003e34:41\u003cbr/\u003e I watch two or three YouTube videos and I will buy whatever the tool or product or service is based on that creator teaching me how to do it. That’s like my bread and butter. I teach people how to use a tool, which is why with this new affiliate, once I film these videos, I know I’m to be able to deliver. I was just curious because they don’t know any of stuff. I think it’s so crazy that they don’t want that information, but I also am not surprised because\u003c/p\u003e\u003cp\u003e35:10\u003cbr/\u003e I’ve dealt with a lot of these people. That’s the thing though. It’s like a lot of content creators are storytellers, right? Which we always say is the hardest way to monetize and grow because most people are not that great of a storyteller. Even if you’re a storyteller and that’s most of your videos, if you can teach people how to do something, a perfect example is like Jamerill, our friend that does the mega cooking.\u003c/p\u003e\u003cp\u003e35:40\u003cbr/\u003e She’s a storyteller and she’s good and she’s interesting, right? Because she’s got a million kids and she has like a commercial kitchen in her house. It’s like people are watching it for almost like the TLC value, right? Of like, what does it look like to can 40,000 jars of tomatoes or something?  But when she says this is the only  stew pot I use,  right? In her videos, then anyone who’s watching that for like, they do want to learn how to like bulk cook or do those things like.\u003c/p\u003e\u003cp\u003e36:06\u003cbr/\u003e They’re going to buy that pot. They’re going to buy from her link.  So you can still weave in the teaching and the story. You just have to be very purposeful in how you do it. Yeah. I mean, she is just really good at being on camera, actually. Yes.  And she will say that she’s done every single thing wrong on camera. It’s still great. Well, no. mean, it’s trial and error. I’m sure she was bad in the beginning. Yeah. She breaks all the YouTube rules, apparently. But you know.\u003c/p\u003e\u003cp\u003e36:35\u003cbr/\u003e I feel like there’s a lot of people who are successful and they didn’t necessarily follow the exact script. However, if you follow the script, it’s probably a lot easier for the most part. But yeah, I think that’s still an opportunity. Even like we talked about Kevin a lot on the podcast, but he did that video about like comparing routers or wifi systems or things like that. And he drove for the size of his channel, the amount of clicks he drove was like crazy, right? Like proportionally.\u003c/p\u003e\u003cp\u003e37:02\u003cbr/\u003e I think he had like 500 subscribers and he drove 300 clicks. I wonder if it makes sense for him to just be a TikTok affiliate in the tech sector. Yeah, I would think. Although knowing his personality, I don’t know if he’d be willing to do it because because these are some of these are no name brands, right? Yes. And he mainly talks about the mainstream. So maybe he wouldn’t do it. But that would probably be a way for him to just review stuff. Yeah. And make a lot more money probably than than the affiliate.\u003c/p\u003e\u003cp\u003e37:32\u003cbr/\u003e I think he’s an Amazon affiliate right now, right? Yes, he’s an Amazon affiliate. Which doesn’t pay out that much. Yeah. But I think with the YouTube content, teaching is the key to  getting people to click and buy through your affiliate link. It’s not too hard for people to click through and do that. Obviously, there’s a couple more steps than just on the TikTok shop, but it’s still not  that hard. People are willing to do it. Oh, yeah, for sure. For sure.\u003c/p\u003e\u003cp\u003e38:01\u003cbr/\u003e So  I guess the overall sentiment here is  I’m actually kind of sad that this is the case. And we had alluded to this earlier, but you know, blogging because of the Google changes, less favorable. think affiliate blog, like a pure affiliate blog. Yeah. I wouldn’t do it today.  Where the affiliate dollars are, are on short form video  and long form video and social media today. Yeah.\u003c/p\u003e\u003cp\u003e38:30\u003cbr/\u003e Hope you enjoyed this episode. If you currently run an affiliate blog, let me know your thoughts. For more information and resources, go to mywifequithejobs.com slash episode 583. Once again, tickets to the Seller Summit 2025 are now on sale over at sellersummit.com. If you want to hang out in person in a small intimate setting, develop real relationships with like-minded entrepreneurs and learn a ton, then come to my event. Go to sellersummit.com.\u003c/p\u003e\u003cp\u003e38:58\u003cbr/\u003e And if you’re interested in starting your own e-commerce store, head on over to my wife, quitherjob.com and sign up for my free six day mini course. Just type in your email and I’ll send the course right away via email.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "41 min read",
  "publishedTime": null,
  "modifiedTime": null
}
