{
  "id": "d2a1f455-2e9d-4fe3-a887-933df90b0fa2",
  "title": "Check Your Home Insurance Now, Avoid Regret Later",
  "link": "https://www.nerdwallet.com/article/mortgages/property-line-adequate-home-insurance-coverage",
  "description": "You probably have insufficient homeowners insurance coverage. You can protect yourself financially by shopping for home insurance carefully. Here's how.",
  "author": "Holden Lewis",
  "published": "Mon, 24 Feb 2025 12:00:20 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Homeownership",
    "Mortgages"
  ],
  "byline": "Holden Lewis",
  "length": 6376,
  "excerpt": "You probably have insufficient homeowners insurance coverage. You can protect yourself financially by shopping for home insurance carefully. Here's how.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "I'll never forget the water-filled light bulbs.Weeks after Hurricane Floyd flooded the North Carolina towns of Princeville and Tarboro in 1999, I made a reporting trip there to find out how residents were coping. A man escorted me inside his single-story house, which had been submerged for days under water the height of a basketball hoop. As we stood under the kitchen chandelier (his table had floated into the living room), he reached up to tap the light fixture's flame-shaped bulbs. Water had displaced the gas inside.The man was happy to salvage his framed, water-stained army discharge certificate. But as for the ruined house, he doubted his insurance would pay the full cost of rebuilding.Being underinsured still happens more often than you think. In fact, there's a good chance you have insufficient homeowners insurance coverage. You can fix that, and protect yourself financially, by shopping for home insurance carefully and making a few phone calls. Here's how.Beware undercoverageThe core of your home insurance policy is dwelling coverage: the part of the policy that will pay to repair or rebuild your home. The policy specifies the maximum amount it will pay. Watch out, because your dwelling coverage limit could be too low.\"One of the biggest mistakes we see, when reviewing policies, is that the dwelling coverage is not enough to rebuild the home in the event of a disaster,\" said Celia Santana, CEO of Personal Risk Management Solutions, an insurance brokerage in New York City. \"We see this on 65% of the prospects we meet with.\"Undercoverage appears to be widespread. Take the Marshall Fire, a 2021 wildfire that destroyed almost 1,000 buildings in Boulder County, Colorado. Almost three-quarters of the homeowners were underinsured, according to a research paper, \"Coverage Neglect in Homeowners Insurance,\" published in December 2024 by scholars from the University of Colorado and the University of Wisconsin.After the Marshall Fire, \"we find that underinsurance significantly delays rebuilding and makes fire survivors more likely to sell their homes,\" the paper concludes.Here's what that could look like in your life: Your house burns down and you have $300,000 in dwelling coverage — but you discover that it will cost $400,000 to rebuild. The mortgage lender expects you to build a house of similar value. So you spend months or years scraping up the $100,000 difference before you can rebuild. Or, if you can pay off the mortgage, you sell the property and move away.Besides having a too-low dwelling coverage limit, there's another type of undercoverage: not having all the insurance policies you need. Standard home insurance doesn't pay to fix damage resulting from earthquakes or floods. To get coverage for those disasters, you have to buy separate insurance policies.Get the coverage you needWhether you're buying a home or renewing your policy, the best way to shop is by asking probing questions of insurance agents and finding out how much it would cost to rebuild the house. First, ask if you should buy earthquake or flood insurance. You might think you already know the answer, but you could be wrong.Just as important, make sure you have enough dwelling coverage to replace the home if it's destroyed. That amount isn't the same as the value of the house. \"Do not confuse market value with replacement value,\" Santana said. When providing a rate quote, an insurance agent likely plugs the home's square footage and other information into a calculator that spits out a dollar amount representing the cost to rebuild. You shouldn't take that calculation as the final word.Instead, call general contractors to ask if the insurer's recommended coverage limit is adequate, advises Kevin Daley, president of the private client group for EPIC Insurance Brokers \u0026 Consultants. He says to ask: Could you rebuild my house within this coverage limit?Daley says that oftentimes, the contractor will respond with something like: \"Look, your insurance company thinks this house can be built for 400 grand. I'm telling you right now it's 455 minimum.\"If a contractor comes out to take a look at your house, expect to pay a fee.Consider extended replacement cost coverageEven after you talk with a contractor to learn the true cost of rebuilding, that dollar amount might be insufficient after a natural disaster. Here's why: If your house burns but the neighboring houses are untouched, you'll navigate a market in which building supplies and construction workers are typically available, and prices and wages are predictable. But if your whole neighborhood burns in a wildfire, those markets break down.After a disaster, hundreds of nearby homeowners might need building materials and construction workers at the same time. Demand exceeds supply, so prices and wages go up. A house that would normally cost $455,000 to rebuild could suddenly cost more than half a million dollars to construct.That's where extended replacement cost coverage comes in. It pays up to a certain percentage above your dwelling coverage limit if costs are higher than expected. For example, if you have $400,000 in dwelling coverage, plus an endorsement adding 25% in extended replacement cost coverage, the insurer will add 25% (or $100,000) to your limit, raising it to $500,000.\"You want to get your dwelling coverage to an amount where you'd be able to rebuild if it's just your house\" that's destroyed, says Emily Rogan, senior program officer for United Policyholders, a nonprofit information resource for policyholders. Beyond that, she says, you'd rely on extended replacement cost coverage for a worst-case scenario, community-level disaster.Ideally, you have full coverage the day you buy a home. If not, you can beef up your insurance when you're better informed and have the money to pay for it. Sooner is better, because you can't know when disaster will strike.As you talk to agents, bring up the type of scenarios that drift into your head as you try to fall asleep. If a tree crashes through my roof, will insurance pay for a whole new roof, or just the damaged section? Will insurance pay my rent if I'm displaced, and if so, how much or for how long? The insurer might soothe your fears by adding endorsements (for additional charges) that add oomph to your basic coverage.Buying adequate home insurance might cost more, but you'll sleep better.",
  "image": "https://www.nerdwallet.com/tachyon/2025/02/GettyImages-484678458.jpg?resize=1440%2C864",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eI\u0026#39;ll never forget the water-filled light bulbs.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWeeks after Hurricane Floyd flooded the North Carolina towns of Princeville and Tarboro in 1999, I made a reporting trip there to find out how residents were coping. A man escorted me inside his single-story house, which had been submerged for days under water the height of a basketball hoop. As we stood under the kitchen chandelier (his table had floated into the living room), he reached up to tap the light fixture\u0026#39;s flame-shaped bulbs. Water had displaced the gas inside.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe man was happy to salvage his framed, water-stained army discharge certificate. But as for the ruined house, he doubted his insurance would pay the full cost of rebuilding.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBeing underinsured still happens more often than you think. In fact, there\u0026#39;s a good chance you have insufficient homeowners insurance coverage. You can fix that, and protect yourself financially, by shopping for \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/how-to-shop-for-homeowners-insurance\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ehome insurance\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e carefully and making a few phone calls. Here\u0026#39;s how.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"beware-undercoverage\"\u003e\u003cspan\u003eBeware undercoverage\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe core of your home insurance policy is \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/dwelling-coverage-homeowners\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003edwelling coverage\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e: the part of the policy that will pay to repair or rebuild your home. The policy specifies the maximum amount it will pay. Watch out, because your dwelling coverage limit could be too low.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u0026#34;One of the biggest mistakes we see, when reviewing policies, is that the dwelling coverage is not enough to rebuild the home in the event of a disaster,\u0026#34; said Celia Santana, CEO of Personal Risk Management Solutions, an insurance brokerage in New York City. \u0026#34;We see this on 65% of the prospects we meet with.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eUndercoverage appears to be widespread. Take the Marshall Fire, a 2021 wildfire that destroyed almost 1,000 buildings in Boulder County, Colorado. Almost three-quarters of the homeowners were underinsured, according to a research paper, \u0026#34;Coverage Neglect in Homeowners Insurance,\u0026#34; published in December 2024 by scholars from the University of Colorado and the University of Wisconsin.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAfter the Marshall Fire, \u0026#34;we find that underinsurance significantly delays rebuilding and makes fire survivors more likely to sell their homes,\u0026#34; the paper concludes.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere\u0026#39;s what that could look like in your life: Your house burns down and you have $300,000 in dwelling coverage — but you discover that it will cost $400,000 to rebuild. The mortgage lender expects you to build a house of similar value. So you spend months or years scraping up the $100,000 difference before you can rebuild. Or, if you can pay off the mortgage, you sell the property and move away.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBesides having a too-low dwelling coverage limit, there\u0026#39;s another type of undercoverage: not having all the insurance policies you need. Standard home insurance \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/home-insurance-exclusions\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003edoesn\u0026#39;t pay to fix damage resulting from earthquakes or floods\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. To get coverage for those disasters, you have to buy separate insurance policies.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"get-the-coverage-you-need\"\u003e\u003cspan\u003eGet the coverage you need\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhether you\u0026#39;re buying a home or renewing your policy, the best way to shop is by asking probing questions of \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/independent-insurance-agents\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003einsurance agents\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e and finding out how much it would cost to rebuild the house. First, ask if you should buy earthquake or flood insurance. You might think you already know the answer, but you could be wrong.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eJust as important, make sure you have enough dwelling coverage to replace the home if it\u0026#39;s destroyed. That amount isn\u0026#39;t the same as the value of the house. \u0026#34;Do not confuse market value with replacement value,\u0026#34; Santana said. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen providing a rate quote, an insurance agent likely plugs the home\u0026#39;s square footage and other information into a calculator that spits out a dollar amount representing the cost to rebuild. You shouldn\u0026#39;t take that calculation as the final word.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eInstead, call general contractors to ask if the insurer\u0026#39;s recommended coverage limit is adequate, advises Kevin Daley, president of the private client group for EPIC Insurance Brokers \u0026amp; Consultants. He says to ask: Could you rebuild my house within this coverage limit?\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDaley says that oftentimes, the contractor will respond with something like: \u0026#34;Look, your insurance company thinks this house can be built for 400 grand. I\u0026#39;m telling you right now it\u0026#39;s 455 minimum.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIf a contractor comes out to take a look at your house, expect to pay a fee.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"consider-extended-replacement-cost-coverage\"\u003e\u003cspan\u003eConsider extended replacement cost coverage\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEven after you talk with a contractor to learn the true cost of rebuilding, that dollar amount might be insufficient after a natural disaster. Here\u0026#39;s why: If your house burns but the neighboring houses are untouched, you\u0026#39;ll navigate a market in which building supplies and construction workers are typically available, and prices and wages are predictable. But if your whole neighborhood burns in a wildfire, those markets break down.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAfter a disaster, hundreds of nearby homeowners might need building materials and construction workers at the same time. Demand exceeds supply, so prices and wages go up. A house that would normally cost $455,000 to rebuild could suddenly cost more than half a million dollars to construct.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThat\u0026#39;s where \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/extended-replacement-cost\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eextended replacement cost coverage\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e comes in. It pays up to a certain percentage above your dwelling coverage limit if costs are higher than expected. For example, if you have $400,000 in dwelling coverage, plus an endorsement adding 25% in extended replacement cost coverage, the insurer will add 25% (or $100,000) to your limit, raising it to $500,000.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u0026#34;You want to get your dwelling coverage to an amount where you\u0026#39;d be able to rebuild if it\u0026#39;s just your house\u0026#34; that\u0026#39;s destroyed, says Emily Rogan, senior program officer for United Policyholders, a nonprofit information resource for policyholders. Beyond that, she says, you\u0026#39;d rely on extended replacement cost coverage for a worst-case scenario, community-level disaster.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIdeally, you have full coverage the day you \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/mortgages/home-buying-checklist-steps-to-buying-house\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ebuy a home\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. If not, you can beef up your insurance when you\u0026#39;re better informed and have the money to pay for it. Sooner is better, because you can\u0026#39;t know when disaster will strike.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAs you talk to agents, bring up the type of scenarios that drift into your head as you try to fall asleep. If a tree crashes through my roof, will insurance pay for a whole new roof, or just the damaged section? Will \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/loss-of-use-coverage\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003einsurance pay my rent\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e if I\u0026#39;m displaced, and if so, how much or for how long? The insurer might soothe your fears by adding endorsements (for additional charges) that add oomph to your basic coverage.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBuying adequate home insurance might cost more, but you\u0026#39;ll sleep better.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-24T12:00:20Z",
  "modifiedTime": null
}
