{
  "id": "dfd8b3fd-8456-40da-905e-84d10ace2e64",
  "title": "Buying a Car in Another State: What to Know",
  "link": "https://www.nerdwallet.com/article/cars/buying-car-out-of-state",
  "description": "The main differences between buying a car in another state and buying one locally involve sales tax, inspection and registration rules, and getting your car home.",
  "author": "Roberta Pescow",
  "published": "Mon, 07 Apr 2025 14:16:14 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Car Shopping",
    "Cars"
  ],
  "byline": "Roberta Pescow",
  "length": 6660,
  "excerpt": "The main differences between buying a car in another state and buying one locally involve sales tax, inspection and registration rules, and getting your car home.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Buying a car out of state involves getting the car’s history, having it inspected, paying, registering it, insuring it and paying the sales tax. The main differences between in-state and out-of-state car purchases involve sales tax, inspection and registration regulations — as well as how you’ll get your new car home.Why buy an out-of-state car?Shopping for a vehicle out of state has a number of advantages.Larger selection. A wider marketplace means greater choice, and this could really matter if you’re looking for a rare or antique vehicle — or even a particular model or color that isn’t in stock in your state.Potential savings. You may be able to get a better price on the car you want if you’re willing to travel farther afield. Some dealers may be running discounts or promotions on the specific model you’re looking for, and states may use different pricing standards, which could translate to lower prices. Additionally, you may also be able to find private sellers with lower-price offerings in other states.Convenience. You can shop online for cars located all across the country, from the comfort of your home. Some out-of-state car sellers may be willing to ship your new car right to your door.The downside of buying a car in a different stateBefore buying a car out-of-state, there are three big considerations to be aware of.You have to figure out how to get your car home. If the seller isn’t willing to ship the car to you, you’ll either have to pay to have your new car shipped or drive it home yourself after getting a temporary registration. Transportation expenses may offset any savings you gain on the purchase price, particularly if it involves a cross-country trip.The process may be more complicated. It may be more timely and complex to get a car from out of state inspected and registered in your own state. Since emissions requirements vary between states, a car that passes inspection in the purchase state may fail in your home state.You may have to buy sight-unseen. Unless you travel to check out the car you’re considering, buying an out-of-state car could mean committing to purchase a car you’ve never even seen in person. If you purchase remotely, you may have to deal with the additional expense and time involved in finding a trustworthy mechanic in the area to inspect the car and verify that it’s in good running order.Planning to buy a car?Explore the auto-buying platforms from our partners below. ADEdmunds - New Cars PurchaseNew and Used Car ShoppingEdmunds offers expert car reviews, pricing information, and detailed comparisons for new and used vehicles. With comprehensive data on thousands of cars, trucks, SUVs, and hybrids, Edmunds helps users make informed decisions by providing valuable insights into vehicle performance, features, and costs. The platform also allows access to financing options, vehicle listings, and dealership information, making the car-buying process seamless and stress-free. Whether searching for a new model or a quality used car, Edmunds is a trusted resource for all automotive needs.CarsDirect - Car PurchaseNew and Used Car ShoppingCarsDirect provides a broad selection of new vehicles, including cars, trucks, SUVs, and hybrids, through an extensive network of dealers to ensure great deals. For those interested in quality used vehicles, they offer access to over 1,400,000 listings, making it easy to find and secure the perfect car, truck, or SUV. The platform allows users to conveniently save searches and receive notifications when new listings match their criteria. Additionally, CarsDirect partners with numerous dealers to offer streamlined purchase options for both new and used cars, simplifying the buying process.How taxes work when buying a car in another stateUnless you live in a state with no sales tax, you’ll probably owe sales tax on the out-of-state car — and you usually won’t owe less if the state you purchase the car in has a lower sales tax rate than your home state. This is because, in general, you owe sales tax based on the state where you live and register the car, rather than on where you make the purchase.Paying the sales tax shouldn’t be all that difficult. Often, you pay what you owe when you register the car at your local DMV. If you purchased your car from a dealership rather than a private seller, it may be even easier — the dealership may collect your state sales tax when you pay for the car, and then remit the funds on your behalf to your home state.🤓Nerdy TipIn addition to sales tax, some states (including California and Texas) also charge a “use tax” on vehicles brought from other states. In general, you pay this additional tax when you register your car at the DMV.How registration works when buying a car in a different stateWhen you purchase a car in a different state, registration (like taxes) follows the laws and practices of your home state. If you’ve purchased your car from an out-of-state dealer, registration is relatively simple. The dealership will likely handle the details to get your car registered according to the regulations of your home state, as well as give you a temporary registration tag so you can legally drive your car back home.It gets a little more complicated when you buy from an out-of-state private seller, because you have to deal directly with your local DMV. You may need to show the following:Signed title (or manufacturer's certificate of origin) to prove you own your new car.Proof of insurance. Application for a temporary registration (in order to drive the car home legally and continue driving until you’ve fully registered it). Proof of safety and/or emissions inspection (depending on your state’s regulations).Payment for the sales tax you owe as part of your registration process.Is it worth buying a new car out of state?Whether it’s worth it to buy a car in another state really depends on how good a deal it is and whether you’re willing to jump through extra hoops to make it happen. Here are a few questions you can ask yourself to help you decide if out-of-state car buying makes sense for you.Do I have the time, money and energy to travel to another state?Am I willing to purchase a car sight-unseen if I can’t travel to check it out myself?Will the cost of getting the car home offset the money I’ll save by going out of state?Am I willing to deal with the possibility of a more complex registration process?Can I find the car I want at a fair price closer to home?Can I afford shipping costs if the car is too far away to drive it home myself?Do I know a qualified mechanic willing to travel to the out-of-state car to verify that it’s mechanically sound?",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/04/GettyImages-1731252872-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBuying a car out of state involves getting the car’s history, having it inspected, paying, registering it, insuring it and paying the sales tax. The main differences between in-state and out-of-state car purchases involve sales tax, inspection and registration regulations — as well as how you’ll get your new car home.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"why-buy-an-out-of-state-car\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWhy buy an out-of-state car?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eShopping for a vehicle out of state has a number of advantages.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eLarger selection.\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e A wider marketplace means greater choice, and this could really matter if you’re looking for a rare or antique vehicle — or even a particular model or color that isn’t in stock in your state.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003ePotential savings.\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e You may be able to get a better price on the car you want if you’re willing to travel farther afield. Some dealers may be running discounts or promotions on the specific model you’re looking for, and states may use different pricing standards, which could translate to lower prices. Additionally, you may also be able to find \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/auto-loans/tips-for-buying-a-used-car-from-a-private-seller\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eprivate sellers\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e with lower-price offerings in other states.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eConvenience\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e. You can shop online for cars located all across the country, from the comfort of your home. Some out-of-state car sellers may be willing to ship your new car right to your door.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"the-downside-of-buying-a-car-in-a-different-state\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eThe downside of buying a car in a different state\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eBefore buying a car out-of-state, there are three big considerations to be aware of.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003col data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eYou have to figure out how to get your car home.\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e If the seller isn’t willing to ship the car to you, you’ll either have to pay to \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/auto-loans/car-shipping-how-it-works\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ehave your new car shipped\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e or drive it home yourself after getting a temporary registration. Transportation expenses may offset any savings you gain on the purchase price, particularly if it involves a cross-country trip.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eThe process may be more complicated.\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e It may be more timely and complex to get a car from out of state inspected and registered in your own state. Since \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/auto-loans/how-to-pass-a-smog-test-and-what-to-do-if-you-dont\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eemissions requirements\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e vary between states, a car that passes inspection in the purchase state may fail in your home state.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eYou may have to buy sight-unseen. \u003c/span\u003e\u003c/span\u003e\u003cspan\u003eUnless you travel to check out the car you’re considering, buying an out-of-state car could mean committing to purchase a car you’ve never even seen in person. If you purchase remotely, you may have to deal with the additional expense and time involved in finding a trustworthy mechanic in the area to \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/auto-loans/car-inspection-cost\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003einspect the car\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e and verify that it’s in good running order.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003ePlanning to buy a car?\u003c/span\u003e\u003c/p\u003e\u003cp\u003eExplore the auto-buying platforms from our partners below.\n\n\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAD\u003c/p\u003e\u003cdiv dir=\"ltr\"\u003e\u003cdiv\u003e\u003cdiv data-index=\"0\" tabindex=\"-1\" aria-hidden=\"false\"\u003e\u003cdiv\u003e\u003ca id=\"customizable_marketplacetable__product-image\" href=\"https://www.nerdwallet.com/investing/network-links/638?calling_deployable_name=article-client\u0026amp;calling_deployable_version=27\u0026amp;impression_page_name=buying_a_car_in_another_state_what_to_know\u0026amp;impression_pageview_id=56d18604-2f1d-4d9a-bd0f-e988ef8ccb80\u0026amp;impression_position=0\u0026amp;impression_section=customizable_marketplacetable\u0026amp;sku_impression_id=7002081a-c9b7-4ce9-82ec-91f146fa057d\u0026amp;source_url=\u0026amp;trk_channel=web\u0026amp;trk_element=hyperlink\u0026amp;trk_location=MarketplaceApplyNow\u0026amp;finish_type=external_application\u0026amp;has_prequalified=false\u0026amp;impression_id=\u0026amp;link_type=PRODUCT_IMAGE\u0026amp;monetizable=yes_assumed\u0026amp;page_number=\u0026amp;product_impression_id=\u0026amp;product_display_driver=user_selected\u0026amp;product_position=\u0026amp;section_name=customizable_marketplacetable\u0026amp;section_position=\u0026amp;clickHeader_pageNumber=\u0026amp;clickHeader_productPosition=\u0026amp;clickHeader_productLocation=MarketplaceApplyNow\u0026amp;clickHeader_sectionPosition=\u0026amp;clickHeader_productId=5175a3d2-4609-11ef-9a9b-df9e795fde87\u0026amp;clickHeader_productSlug=\u0026amp;clickHeader_linkType=PRODUCT_IMAGE\" target=\"_blank\" rel=\"sponsored\"\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Edmunds - New Cars Purchase\" title=\"Edmunds - New Cars Purchase\" src=\"http://www.nerdwallet.com/cdn/nodeapp/auto-loans-client/img/edmunds_logo_rgb.svg\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/a\u003e\u003cp\u003eEdmunds - New Cars Purchase\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003eNew and Used Car Shopping\u003c/span\u003e\u003cspan data-currency=\"Text\"\u003eEdmunds offers expert car reviews, pricing information, and detailed comparisons for new and used vehicles. With comprehensive data on thousands of cars, trucks, SUVs, and hybrids, Edmunds helps users make informed decisions by providing valuable insights into vehicle performance, features, and costs. The platform also allows access to financing options, vehicle listings, and dealership information, making the car-buying process seamless and stress-free. Whether searching for a new model or a quality used car, Edmunds is a trusted resource for all automotive needs.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-index=\"1\" tabindex=\"-1\" aria-hidden=\"false\"\u003e\u003cdiv\u003e\u003ca id=\"customizable_marketplacetable__product-image\" href=\"https://www.nerdwallet.com/investing/network-links/643?calling_deployable_name=article-client\u0026amp;calling_deployable_version=27\u0026amp;impression_page_name=buying_a_car_in_another_state_what_to_know\u0026amp;impression_pageview_id=56d18604-2f1d-4d9a-bd0f-e988ef8ccb80\u0026amp;impression_position=0\u0026amp;impression_section=customizable_marketplacetable\u0026amp;sku_impression_id=eae2294f-8d62-4b58-8acc-9c0f07df07b8\u0026amp;source_url=\u0026amp;trk_channel=web\u0026amp;trk_element=hyperlink\u0026amp;trk_location=MarketplaceApplyNow\u0026amp;finish_type=external_application\u0026amp;has_prequalified=false\u0026amp;impression_id=\u0026amp;link_type=PRODUCT_IMAGE\u0026amp;monetizable=yes_assumed\u0026amp;page_number=\u0026amp;product_impression_id=\u0026amp;product_display_driver=user_selected\u0026amp;product_position=\u0026amp;section_name=customizable_marketplacetable\u0026amp;section_position=\u0026amp;clickHeader_pageNumber=\u0026amp;clickHeader_productPosition=\u0026amp;clickHeader_productLocation=MarketplaceApplyNow\u0026amp;clickHeader_sectionPosition=\u0026amp;clickHeader_productId=412e1c4c-7224-11ef-bcef-0346898ff6ac\u0026amp;clickHeader_productSlug=\u0026amp;clickHeader_linkType=PRODUCT_IMAGE\" target=\"_blank\" rel=\"sponsored\"\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"CarsDirect - Car Purchase\" title=\"CarsDirect - Car Purchase\" src=\"https://www.nerdwallet.com/cdn/nodeapp/auto-loans-client/img/CarsDirect.svg\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/a\u003e\u003cp\u003eCarsDirect - Car Purchase\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003eNew and Used Car Shopping\u003c/span\u003e\u003cspan data-currency=\"Text\"\u003eCarsDirect provides a broad selection of new vehicles, including cars, trucks, SUVs, and hybrids, through an extensive network of dealers to ensure great deals. For those interested in quality used vehicles, they offer access to over 1,400,000 listings, making it easy to find and secure the perfect car, truck, or SUV. The platform allows users to conveniently save searches and receive notifications when new listings match their criteria. Additionally, CarsDirect partners with numerous dealers to offer streamlined purchase options for both new and used cars, simplifying the buying process.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cul\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"how-taxes-work-when-buying-a-car-in-another-state\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow taxes work when buying a car in another state\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eUnless you live in a state with no sales tax, you’ll probably owe sales tax on the out-of-state car — and you usually won’t owe less if the state you purchase the car in has a lower sales tax rate than your home state. This is because, in general, you owe sales tax based on the state where you live and register the car, rather than on where you make the purchase.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePaying the sales tax shouldn’t be all that difficult. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eOften, you pay what you owe when you register the car at your local DMV. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eIf you purchased your car from a dealership rather than a private seller, it may be even easier — the dealership may collect your state sales tax when you pay for the car, and then remit the funds on your behalf to your home state.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003e🤓\u003c/span\u003e\u003cspan data-currency=\"Text\"\u003eNerdy Tip\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn addition to sales tax, some states (including California and Texas) also charge a “use tax” on vehicles brought from other states. In general, you pay this additional tax when you register your car at the DMV.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"how-registration-works-when-buying-a-car-in-a-different-state\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eHow registration works when buying a car in a different state\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eWhen you purchase a car in a different state, registration (like taxes) follows the laws and practices of your home state. If you’ve purchased your car from an out-of-state dealer, registration is relatively simple. The dealership will likely handle the details to get your car registered according to the regulations of your home state, as well as give you a temporary registration tag so you can legally drive your car back home.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt gets a little more complicated when you buy from an out-of-state private seller, because you have to deal directly with your local DMV. You may need to show the following:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eSigned title (or manufacturer\u0026#39;s certificate of origin) to prove you own your new car.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eProof of insurance. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eApplication for a temporary registration (in order to drive the car home legally and continue driving until you’ve fully registered it). \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eProof of safety and/or emissions inspection (depending on your state’s regulations).\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003ePayment for the sales tax you owe as part of your registration process.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"is-it-worth-buying-a-new-car-out-of-state\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eIs it worth buying a new car out of state?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eWhether it’s worth it to buy a car in another state really depends on how good a deal it is and whether you’re willing to jump through extra hoops to make it happen. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere are a few questions you can ask yourself to help you decide if out-of-state car buying makes sense for you.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDo I have the time, money and energy to travel to another state?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eAm I willing to purchase a car sight-unseen if I can’t travel to check it out myself?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eWill the cost of getting the car home offset the money I’ll save by going out of state?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eAm I willing to deal with the possibility of a more complex registration process?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eCan I find the car I want at a fair price closer to home?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eCan I afford shipping costs if the car is too far away to drive it home myself?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDo I know a qualified mechanic willing to travel to the out-of-state car to verify that it’s mechanically sound?\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-07T14:16:14Z",
  "modifiedTime": null
}
