{
  "id": "e54a1caf-54bb-4542-99a3-74f105a0d2c4",
  "title": "5 Ways Gig Economy Workers Can Save for Retirement",
  "link": "https://www.wisebread.com/5-ways-gig-economy-workers-can-save-for-retirement",
  "description": "We are in the midst of a major economic shift. While workers in the past could expect to keep a stable job with a traditional employer for decades, workers of today have found they must either cobble together a career from a variety of gigs, or supplement a lackluster salary from a traditional job by doing freelance work in their spare time. Though you can make a living (and possibly even a good one) in the gig economy, this kind of work does leave gig workers vulnerable in one very important way: retirement planning. Without the backing of an employer-sponsored retirement account, many gig workers are not saving enough for their golden years. According to a recent report by Betterment, seven out of 10 full-time gig workers say they are unprepared to maintain their current lifestyle during retirement, while three out of 10 say they don't regularly set aside any money for retirement. So what's a gig worker to do if they don't want to be driving for Uber and taking TaskRabbit jobs into their 70s and 80s? Here are five things you can do to save for retirement as a member of the gig economy. (See also: 15 Lucrative Side Hustles for City Dwellers) 1. Take stock of what you have Many people don't have a clear idea of how much money they have. And it's impossible to plan your retirement if you don't know where you are today. So any retirement savings should start with a look at what you already have in the accounts in your name. Add up how much is in your checking and savings accounts, any neglected retirement accounts you may have picked up from previous traditional jobs, cash on hand if your gig work relies on cash tips, or any other financial accounts. The sum total could add up to more than you realize if you haven't recently taken stock of where you are. Even if you truly have nothing more than pocket lint and a couple quarters to your name, it's better to know where you are than proceed without a clear picture of your financial reality. (See also: These 13 Numbers Are Crucial to Understanding Your Finances) 2. Open an IRA If you don't already have a retirement account that you can contribute to, then you need to set one up ASAP. You can't save for retirement if you don't have an account to put money in. IRAs are specifically created for individual investors and you can easily get started with one online. If you have money from a 401(k) to roll over, you have more options available to you, as some IRAs have a minimum investment amount (typically $1,000). If you have less than that to open your account, you may want to choose a Roth IRA, since those often have no minimums. The difference between the traditional IRA and the Roth IRA is how taxes are levied. With a traditional IRA, you can fund the account with pre-tax income. In other words, every dollar you put in an IRA is a dollar you do not have to claim as income. However, you will have to pay ordinary income tax on your IRA distributions once you reach retirement. Roth IRAs are funded with money that has already been taxed, so you can take distributions tax-free in retirement. Many gig workers choose a Roth IRA because their current tax burden is low. If you anticipate earning more over the course of your career, using a Roth IRA for retirement investments can protect you from the taxman in retirement. Whether you choose a Roth or a traditional IRA, the contribution limit per year, as of 2018, is $5,500 for workers under 50, and $6,500 for anyone who is 50+. 3. Avoid the bite of investment fees While no investor wants to lose portfolio growth to fees, it's especially important for gig workers to choose asset allocations that will minimize investment fees. That's because gig workers are likely to have less money to invest, so every dollar needs to be working hard for them. Investing in index funds is one good way to make sure investment fees don't suck the life out of your retirement account. Index funds are mutual funds that are constructed to mimic a specific market index, like the S\u0026P 500. Since there is no portfolio manager who is choosing investments, there is no management fee for index funds. (See also: How to Start Investing With Just $100) 4. Embrace automation One of the toughest challenges of being a gig worker is the fact that your income is variable — which makes it very difficult to plan on contributing the same amount each month. This is where technology comes in. To start, set up an automatic transfer of an amount of money you will not miss. Whether you can spare $50 per week or $5 per month, having a small amount of money quietly moving into your IRA gives you a little cushion that you don't have to think about. From there, consider using a savings app to handle retirement savings for you. For instance, Digit will analyze your checking account's inflow and outflow, and will determine an amount that is safe to save without triggering an overdraft, and automatically move that amount into a savings account. You can then transfer your Digit savings into your retirement account. 5. Invest found money An excellent way to make sure you're maxing out your contributions each year is to change your view of \"found money.\" For instance, if you receive a birthday check from your grandmother, only spend half of it and put the rest in your retirement account. Similarly, if you receive a tax refund (which is a little less likely if you're a gig worker paying quarterly estimated taxes), send at least half of the refund toward your retirement. Any gig workers who often receive cash can also make their own rules about the cash they receive. For instance, you could decide that every $5 bill you get has to go into retirement savings. That will help you change your view of the money and give you a way to boost your retirement savings. Like this article? Pin it! This article is from Emily Guy Birken of Wise Bread, an award-winning personal finance and credit card comparison website. Read more great articles from Wise Bread: How to Get a High Rating and Make More Money as an Uber Driver Can You Really Make a Living in the Gig Economy? How the Sandwich Generation Can Protect Their Retirement What Kind of Auto Insurance Do Uber Drivers Need? Don't Get Audited! How Your Side Gig Needs to Handle Taxes",
  "author": "Emily Guy Birken",
  "published": "Mon, 16 Nov 2020 22:12:58 +0000",
  "source": "http://feeds.killeraces.com/wisebread",
  "categories": [
    "Career and Income",
    "Budgeting",
    "Retirement",
    "gig economy",
    "lyft",
    "part-time job",
    "retirement fund",
    "retirement tips",
    "saving for retirement",
    "side job",
    "Uber"
  ],
  "byline": "",
  "length": 5825,
  "excerpt": "Even if your full-time job consists of several gig economy jobs, you can successfully save for retirement — here's how.",
  "siteName": "Wise Bread",
  "favicon": "",
  "text": "ShareThisWe are in the midst of a major economic shift. While workers in the past could expect to keep a stable job with a traditional employer for decades, workers of today have found they must either cobble together a career from a variety of gigs, or supplement a lackluster salary from a traditional job by doing freelance work in their spare time. Though you can make a living (and possibly even a good one) in the gig economy, this kind of work does leave gig workers vulnerable in one very important way: retirement planning. Without the backing of an employer-sponsored retirement account, many gig workers are not saving enough for their golden years. According to a recent report by Betterment, seven out of 10 full-time gig workers say they are unprepared to maintain their current lifestyle during retirement, while three out of 10 say they don't regularly set aside any money for retirement. So what's a gig worker to do if they don't want to be driving for Uber and taking TaskRabbit jobs into their 70s and 80s? Here are five things you can do to save for retirement as a member of the gig economy. (See also: 15 Lucrative Side Hustles for City Dwellers) 1. Take stock of what you have Many people don't have a clear idea of how much money they have. And it's impossible to plan your retirement if you don't know where you are today. So any retirement savings should start with a look at what you already have in the accounts in your name. Add up how much is in your checking and savings accounts, any neglected retirement accounts you may have picked up from previous traditional jobs, cash on hand if your gig work relies on cash tips, or any other financial accounts. The sum total could add up to more than you realize if you haven't recently taken stock of where you are. Even if you truly have nothing more than pocket lint and a couple quarters to your name, it's better to know where you are than proceed without a clear picture of your financial reality. (See also: These 13 Numbers Are Crucial to Understanding Your Finances) 2. Open an IRA If you don't already have a retirement account that you can contribute to, then you need to set one up ASAP. You can't save for retirement if you don't have an account to put money in. IRAs are specifically created for individual investors and you can easily get started with one online. If you have money from a 401(k) to roll over, you have more options available to you, as some IRAs have a minimum investment amount (typically $1,000). If you have less than that to open your account, you may want to choose a Roth IRA, since those often have no minimums. The difference between the traditional IRA and the Roth IRA is how taxes are levied. With a traditional IRA, you can fund the account with pre-tax income. In other words, every dollar you put in an IRA is a dollar you do not have to claim as income. However, you will have to pay ordinary income tax on your IRA distributions once you reach retirement. Roth IRAs are funded with money that has already been taxed, so you can take distributions tax-free in retirement. Many gig workers choose a Roth IRA because their current tax burden is low. If you anticipate earning more over the course of your career, using a Roth IRA for retirement investments can protect you from the taxman in retirement. Whether you choose a Roth or a traditional IRA, the contribution limit per year, as of 2018, is $5,500 for workers under 50, and $6,500 for anyone who is 50+. 3. Avoid the bite of investment fees While no investor wants to lose portfolio growth to fees, it's especially important for gig workers to choose asset allocations that will minimize investment fees. That's because gig workers are likely to have less money to invest, so every dollar needs to be working hard for them. Investing in index funds is one good way to make sure investment fees don't suck the life out of your retirement account. Index funds are mutual funds that are constructed to mimic a specific market index, like the S\u0026P 500. Since there is no portfolio manager who is choosing investments, there is no management fee for index funds. (See also: How to Start Investing With Just $100) 4. Embrace automation One of the toughest challenges of being a gig worker is the fact that your income is variable — which makes it very difficult to plan on contributing the same amount each month. This is where technology comes in. To start, set up an automatic transfer of an amount of money you will not miss. Whether you can spare $50 per week or $5 per month, having a small amount of money quietly moving into your IRA gives you a little cushion that you don't have to think about. From there, consider using a savings app to handle retirement savings for you. For instance, Digit will analyze your checking account's inflow and outflow, and will determine an amount that is safe to save without triggering an overdraft, and automatically move that amount into a savings account. You can then transfer your Digit savings into your retirement account. 5. Invest found money An excellent way to make sure you're maxing out your contributions each year is to change your view of \"found money.\" For instance, if you receive a birthday check from your grandmother, only spend half of it and put the rest in your retirement account. Similarly, if you receive a tax refund (which is a little less likely if you're a gig worker paying quarterly estimated taxes), send at least half of the refund toward your retirement. Any gig workers who often receive cash can also make their own rules about the cash they receive. For instance, you could decide that every $5 bill you get has to go into retirement savings. That will help you change your view of the money and give you a way to boost your retirement savings. Like this article? Pin it!",
  "image": "https://www.wisebread.com/files/fruganomics/blog-images/man_glasses_laptop_881009178.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \n                                  \n          \n\n                                  \n                                    \n      \n\n\n\u003cp\u003e\u003ca href=\"https://www.wisebread.com/5-ways-gig-economy-workers-can-save-for-retirement\" title=\"5 Ways Gig Economy Workers Can Save for Retirement\" rel=\"nofollow\"\u003eShareThis\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWe are in the midst of a major economic shift. While workers in the past could expect to keep a stable job with a traditional employer for decades, workers of today have found they must either cobble together a career from a variety of gigs, or supplement a lackluster salary from a traditional job by doing freelance work in their spare time.\u003c/p\u003e\n\u003cp\u003eThough you can make a living (and possibly even a good one) in the gig economy, this kind of work does leave gig workers vulnerable in one very important way: retirement planning.\u003c/p\u003e\n\u003cp\u003eWithout the backing of an employer-sponsored retirement account, many gig workers are not saving enough for their golden years. According to a recent report by Betterment, \u003ca href=\"https://www.betterment.com/wp-content/uploads/2018/05/The-Gig-Economy-Freelancing-and-Retirement-Betterment-Survey-2018_edited.pdf\" target=\"_blank\" rel=\"noopener\"\u003eseven out of 10 full-time gig workers\u003c/a\u003e say they are unprepared to maintain their current lifestyle during retirement, while three out of 10 say they don\u0026#39;t regularly set aside any money for retirement.\u003c/p\u003e\n\u003cp\u003eSo what\u0026#39;s a gig worker to do if they don\u0026#39;t want to be driving for Uber and taking TaskRabbit jobs into their 70s and 80s? Here are five things you can do to save for retirement as a member of the gig economy. (See also: \u003ca href=\"https://www.wisebread.com/15-lucrative-side-hustles-for-city-dwellers?ref=seealso\" target=\"_blank\" rel=\"noopener\"\u003e15 Lucrative Side Hustles for City Dwellers\u003c/a\u003e)\u003c/p\u003e\n\u003ch2\u003e1. Take stock of what you have\u003c/h2\u003e\n\u003cp\u003eMany people don\u0026#39;t have a clear idea of how much money they have. And it\u0026#39;s impossible to plan your retirement if you don\u0026#39;t know where you are today. So any retirement savings should start with a look at what you already have in the accounts in your name.\u003c/p\u003e\n\u003cp\u003eAdd up how much is in your checking and savings accounts, any neglected retirement accounts you may have picked up from previous traditional jobs, cash on hand if your gig work relies on cash tips, or any other financial accounts. The sum total could add up to more than you realize if you haven\u0026#39;t recently taken stock of where you are.\u003c/p\u003e\n\u003cp\u003eEven if you truly have nothing more than pocket lint and a couple quarters to your name, it\u0026#39;s better to know where you are than proceed without a clear picture of your financial reality. (See also: \u003ca href=\"https://www.wisebread.com/these-13-numbers-are-the-keys-to-understanding-your-finances?ref=seealso\" target=\"_blank\" rel=\"noopener\"\u003eThese 13 Numbers Are Crucial to Understanding Your Finances\u003c/a\u003e)\u003c/p\u003e\n\u003ch2\u003e2. Open an IRA\u003c/h2\u003e\n\u003cp\u003eIf you don\u0026#39;t already have a retirement account that you can contribute to, then you need to set one up ASAP. You can\u0026#39;t save for retirement if you don\u0026#39;t have an account to put money in.\u003c/p\u003e\n\u003cp\u003eIRAs are specifically created for individual investors and you can easily get started with one online. If you have money from a 401(k) to roll over, you have more options available to you, as some IRAs have a minimum investment amount (typically $1,000). If you have less than that to open your account, you may want to choose a \u003ca href=\"https://www.wisebread.com/5-retirement-accounts-you-dont-need-a-ton-of-money-to-open?ref=internal\" target=\"_blank\" rel=\"noopener\"\u003eRoth IRA\u003c/a\u003e, since those often have no minimums.\u003c/p\u003e\n\u003cp\u003eThe difference between the traditional IRA and the Roth IRA is how taxes are levied. With a traditional IRA, you can fund the account with pre-tax income. In other words, every dollar you put in an IRA is a dollar you do not have to claim as income. However, you will have to pay ordinary income tax on your IRA distributions once you reach retirement. Roth IRAs are funded with money that has already been taxed, so you can take distributions tax-free in retirement.\u003c/p\u003e\n\u003cp\u003eMany gig workers choose a Roth IRA because their current tax burden is low. If you anticipate earning more over the course of your career, using a Roth IRA for retirement investments can protect you from the taxman in retirement.\u003c/p\u003e\n\u003cp\u003eWhether you choose a Roth or a traditional IRA, the contribution limit per year, as of 2018, is $5,500 for workers under 50, and $6,500 for anyone who is 50+.\u003c/p\u003e\n\u003ch2\u003e3. Avoid the bite of investment fees\u003c/h2\u003e\n\u003cp\u003eWhile no investor wants to lose portfolio growth to fees, it\u0026#39;s especially important for gig workers to choose asset allocations that will minimize investment fees. That\u0026#39;s because gig workers are likely to have less money to invest, so every dollar needs to be working hard for them.\u003c/p\u003e\n\u003cp\u003eInvesting in index funds is one good way to make sure investment fees don\u0026#39;t suck the life out of your retirement account. Index funds are mutual funds that are constructed to mimic a specific market index, like the S\u0026amp;P 500. Since there is no portfolio manager who is choosing investments, there is no management fee for index funds. (See also: \u003ca href=\"https://www.wisebread.com/how-to-start-investing-with-just-100?ref=seealso\" target=\"_blank\" rel=\"noopener\"\u003eHow to Start Investing With Just $100\u003c/a\u003e)\u003c/p\u003e\n\u003ch2\u003e4. Embrace automation\u003c/h2\u003e\n\u003cp\u003eOne of the toughest challenges of being a gig worker is the fact that your income is variable — which makes it very difficult to plan on contributing the same amount each month. This is where technology comes in.\u003c/p\u003e\n\u003cp\u003eTo start, set up an automatic transfer of an amount of money you will not miss. Whether you can spare $50 per week or $5 per month, having a small amount of money quietly moving into your IRA gives you a little cushion that you don\u0026#39;t have to think about.\u003c/p\u003e\n\u003cp\u003eFrom there, consider \u003ca href=\"https://www.wisebread.com/5-microsaving-tools-to-help-you-start-saving-now?ref=internal\" target=\"_blank\" rel=\"noopener\"\u003eusing a savings app\u003c/a\u003e to handle retirement savings for you. For instance, Digit will analyze your checking account\u0026#39;s inflow and outflow, and will determine an amount that is safe to save without triggering an overdraft, and automatically move that amount into a savings account. You can then transfer your Digit savings into your retirement account.\u003c/p\u003e\n\u003ch2\u003e5. Invest found money\u003c/h2\u003e\n\u003cp\u003eAn excellent way to make sure you\u0026#39;re maxing out your contributions each year is to change your view of \u0026#34;found money.\u0026#34; For instance, if you receive a birthday check from your grandmother, only spend half of it and put the rest in your retirement account. Similarly, if you receive a tax refund (which is a little less likely if you\u0026#39;re a gig worker paying quarterly estimated taxes), send at least half of the refund toward your retirement.\u003c/p\u003e\n\u003cp\u003eAny gig workers who often receive cash can also make their own rules about the cash they receive. For instance, you could decide that every $5 bill you get has to go into retirement savings. That will help you change your view of the money and give you a way to \u003ca href=\"https://www.wisebread.com/5-savings-tricks-you-havent-tried-yet?ref=internal\" target=\"_blank\" rel=\"noopener\"\u003eboost your retirement savings\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eLike this article? Pin it!\u003c/h2\u003e\n\n\n\n        \n      \n      \n              \n      \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
