{
  "id": "f1c7bb65-2e05-48d2-bbcf-a61666a43b63",
  "title": "10 Best Places To Sell Plants To Make Money",
  "link": "https://www.makingsenseofcents.com/2025/05/where-to-sell-plants.html",
  "description": "Want to know where to sell plants to make money? If you love plants, then you may have thought about selling houseplants. Houseplants are a fantastic and affordable way to add greenery to a space and bring the outdoors in. I have over 200 (yes, over two hundred!) houseplants at home, and I’ve bought plants... The post 10 Best Places To Sell Plants To Make Money appeared first on Making Sense Of Cents.",
  "author": "Alexis Schroeder",
  "published": "Fri, 23 May 2025 11:00:00 +0000",
  "source": "https://www.makingsenseofcents.com/feed",
  "categories": [
    "Extra Income",
    "How To Sell Stuff",
    "Start A Business",
    "Work From Home"
  ],
  "byline": "Alexis Schroeder",
  "length": 12396,
  "excerpt": "Want to know where to sell plants for the most money? Learn the best places to sell plants online and locally, plus tips to grow your plant side hustle.",
  "siteName": "Making Sense Of Cents",
  "favicon": "",
  "text": "Want to know where to sell plants to make money? If you love plants, then you may have thought about selling houseplants. Houseplants are a fantastic and affordable way to add greenery to a space and bring the outdoors in. I have over 200 (yes, over two hundred!) houseplants at home, and I’ve bought plants… Want to know where to sell plants to make money? If you love plants, then you may have thought about selling houseplants. Houseplants are a fantastic and affordable way to add greenery to a space and bring the outdoors in. I have over 200 (yes, over two hundred!) houseplants at home, and I’ve bought plants from almost anywhere you can think of!  There are a few things you need to know to successfully sell houseplants so that you can make extra income. My guide will walk you through everything you need to know to sell houseplants! Where To Sell Houseplants Here’s a list of the best places to sell houseplants.  1. Etsy  Etsy is a popular place to sell houseplants of all kinds. You can find common and rare houseplants on this site, along with seeds and plant-related supplies. If you do a quick search on Etsy for houseplants, you’ll find dozens and dozens of plant listings ranging from $5 to the hundreds.  An important thing to keep in mind is that the USDA (U.S. Department of Agriculture) has regulations in place that may prohibit shipping certain plants across state or national borders.  Besides that, when shipping live plants, you’ll need to package them carefully to prevent damage from transit or weather. Your listing on Etsy should have high-quality photos, detailed descriptions, and even helpful tips on plant care.  Since Etsy has many other plant sellers, stay competitive by finding a unique angle like rare plants, stylish planters, eco-friendly packaging, etc.  I have bought plants on Etsy, and so has my sister (she recently bought 3 coconut palm sprouts as gifts for family members!). 2. Facebook I’ve bought so many plants on Facebook, particularly Facebook plant groups. This is a great place to sell houseplants, along with Facebook Marketplace. Facebook Marketplace allows for shipping on eligible items, and you can also sell locally, offering porch pickup or meetup at a public/safe location. When selling houseplants in Facebook groups or Facebook Marketplace, make sure you use high-quality photos taken in well-lit areas from multiple angles. It also helps to know the measurements of the plant since photos can be distorted. 3. Amazon Yes, you can sell houseplants on Amazon! Selling on Amazon has the benefit of reaching a large customer base, but there are a few things you need to know. You’ll need to have a Seller Account and check plant regulations. Some plants may be restricted due to agricultural laws. Live plants need secure packaging so they’re shipped safely to their new home. I do want to say Amazon seems to be much more competitive than other platforms, and I’ve never really heard of people going to Amazon to buy houseplants. But it is an option, so people must be buying and selling on there. 4. Ship My Plants Ship My Plants is an online service designed for selling plants. This platform helps make the process convenient and easy to ship plants by providing the tools and packaging. Ship My Plants offers premade, sturdy boxes specifically designed for houseplants. You also get tracking options and insurance options for plant shipments. Since Ship My Plants understands the specific needs of plants, this makes the shipping process smoother for both you as the seller and your customers. Using Ship My Plants to sell houseplants does come with a fee, which is based on the size, weight, and distance of your shipment. If you use the packaging from Ship My Plant, that also comes with an additional cost, along with the added insurance if you decide to get that. 5. Plantly Plantly is an online marketplace to buy and sell houseplants. With Plantly, you can ship plants and get help with packaging, shipping, and tracking. Plantly uses eco-friendly packaging designed to protect plants during shipping and weather. Plantly also gives insurance and tracking options for added peace of mind. There are fees to use Plantly’s services, which depend on the weight, size, and destination of your package. However, Plantly usually has competitive rates, so it can be worth it. 6. eBay EBay can be a great place to sell rare and unique houseplants people can’t find locally. EBay has a huge audience around the world and also gives the option of selling items with a fixed price or auction-style listing. Keep in mind that eBay charges fees which are typically up to 12% of the sale price. EBay has quite a few plant sellers, which is why it’s important to stand out by selling rare plants, using high-quality photos, and having competitive pricing (make sure you research what similar plants to yours list for on eBay). Here are some of my personal indoor plants. 7. Farmers markets Farmers markets can be a profitable and rewarding way to reach houseplant buyers. Farmers markets tend to attract crowds that are into natural living, so with that comes houseplants. Compared to running a brick-and-mortar store, a farmers market can have much lower start-up costs. You’ll usually only need to pay for booth fees, buying your tent and table (and decorations), packaging, and the plants themselves. Depending on the market and your location, you might have competition from other plant sellers, which is why it’s important to find a way to make yourself stand out. 8. Plant swaps I’ve been to several plant swaps, and they’re a great way to buy houseplants and also trade houseplants. However, some plant swaps have rules and regulations regarding selling houseplants, so you’ll want to make sure ahead of time you’re in the clear. Plant swaps are a great way to connect with fellow plant enthusiasts and even promote your business. It’s a fun and low-cost way to network with others who share your passion.  9. Selling plants on your own site Another way to sell houseplants is selling via your own website. Selling plants on your own website has benefits like having full control of everything including design, pricing, and customer experience.  However, there’s more work on your part to get the site up and running and market your own plants. This option is for people in it for the long haul, as it can take time for your site to gain traction and trust from houseplant enthusiasts. A great way to get people to your site is by providing helpful plant information and tips and as much value as possible.  10. Local plant shops Local plant shops can be a great way to sell houseplants, especially if you sell houseplants they don’t carry since this makes you way less of a competitor. However, keep in mind you’ll likely give them a cut since you’re using their space to sell houseplants.  I’ve seen independent plant sellers sell at local plant shops for special events, as this brings more people to the store because they get to see unique plants they don’t usually see at the plant store. As long as you respect the local plant shop’s space and pay them a fair cut, it can lead to a mutually beneficial working relationship where both businesses gain. Here are some more of my personal indoor plants. Frequently Asked Questions Below are answers to common questions about selling houseplants. Is it profitable to sell plants? Selling houseplants can be profitable, especially if you focus on the right houseplants and have a good marketing and sales strategy. Rare or unique plants in high demand are usually the way to go, especially since these usually can’t be found at local plant shops. Growing and propagating plants can be a low initial investment too, but patience is key.  Is it legal to sell plants from home? It can be legal to sell plants from home, but there are a few things to consider, such as local zoning laws, whether or not you need a permit, or a sales tax and business license.  Do I need a business license to sell plants? Whether or not you need a business license depends on where you live, the volume of your sales, and how you operate your plant business. Here are some general guidelines to follow. If you’re selling locally on Facebook Marketplace or Craigslist, you may not need a business license depending on where you live. If you’re selling frequently and earning a significant income, a business license may be required.  Selling online (like having your own site or selling on Etsy) is a whole different ball game. You may need to register your business with your local government (such as by getting a nursery license) as this allows you to legally operate and can be required for tax purposes. What is the most profitable plant to sell? The most profitable plant to sell is always changing, and demand in the market fluctuates quite often. For example, a few years ago, the philodendron “Ring of Fire” and monstera Thai Constellation used to be super expensive. That is, until places like Home Depot and even local grocery stores started selling them in mass supply.  Certain types of begonias and philodendrons are going for a pretty penny, and the more established and large a rare plant is, the higher the price tag. Finding rare plants of a large size is not common.  What is the best place to sell plants online? The best place to sell plants online depends on the type of plants you’re selling and how you want to manage shipping. For example, Etsy is a great platform to sell rare or specialty plants, as well as plant-related accessories and pots. Etsy has a strong community of plant lovers, so people tend to go there to find rare or hard-to-find plant varieties.  However, Facebook Marketplace or local Facebook groups are a great option if you don’t want to deal with shipping and would rather do porch pickup or local pickup instead.  Do nurseries buy plants? Some nurseries buy plants, but this depends on if the plants are unique, healthy, or in demand. For example, common plants are usually grown by nurseries or they wholesale source them from suppliers. However, if you have something rare or unique that is hard to find, nurseries may be more interested in purchasing them from you. What kind of plants can you sell? People buy every type of plant you can think of – houseplants, succulents, outdoor plants, cacti, herbs, bulbs, perennials, vegetable plants (like peppers and tomatoes), fruit trees (like mangos and apples), and everything in between. Related to this, you may also be able to sell plant subscription boxes, decorative plant pots, fertilizer, plant kits, and more. What is the best way to ship plants for sale? The best way to ship plants is to package them securely so they stay safe during transit. This can be hard for some plants, as you can probably guess. You’ll want to start by gently wrapping the plant and roots, and you may need to test out a few processes to see what works best. You’ll also want a sturdy box with little room for the plant to move around, and add padding like crumpled paper or bubble wrap to keep it stable. Make sure the box is clearly labeled as “Live Plants” and try to ship early in the week to avoid weekend delays. Also, always check weather conditions and avoid shipping during extreme heat or cold (whatever weather the plant is not used to!). Best Places To Sell Houseplants – Summary I hope you enjoyed my article on how to sell houseplants. I’ve been obsessed with houseplants for years (seriously, I’m running out of space), and I think this could be a great side hustle for someone who loves plants. Whether it’s propagating your favorite cuttings or trading rare finds with fellow plant lovers, it’s a rewarding experience. Are you interested in selling houseplants as a side hustle? Recommended reading: 16 Best Selling Apps For Selling Stuff Online And Locally How To Decide What Business To Start In 8 Simple Steps How To Make $5,000 A Month – 13 Real Ways How To Sell On Etsy Successfully 29 Best Jobs In Nature To Make Money 15 Outdoor Jobs For People Who Love Being Outside",
  "image": "https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Best-Places-To-Sell-Plants-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp data-kb-block=\"kb-adv-heading4101_a8a8ab-85\"\u003eWant to know where to sell plants to make money? If you love plants, then you may have thought about selling houseplants. Houseplants are a fantastic and affordable way to add greenery to a space and bring the outdoors in. I have over 200 (yes, over two hundred!) houseplants at home, and I’ve bought plants…\u003c/p\u003e\u003cdiv\u003e\n\u003cp\u003eWant to know \u003cstrong\u003ewhere to sell plants to make money\u003c/strong\u003e?\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you love plants, then you may have thought about selling houseplants.\u003c/p\u003e\n\n\n\n\u003cp\u003eHouseplants are a fantastic and affordable way to add greenery to a space and bring the outdoors in. I have over 200 (yes, over two hundred!) houseplants at home, and I’ve bought plants from almost anywhere you can think of! \u003c/p\u003e\n\n\n\n\u003cp\u003eThere are a few things you need to know to successfully sell houseplants so that you can \u003ca href=\"https://www.makingsenseofcents.com/extra-income\"\u003emake extra income\u003c/a\u003e. My guide will walk you through everything you need to know to sell houseplants!\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2\u003e\u003cstrong\u003eWhere To Sell Houseplants\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eHere’s a list of the best places to sell houseplants. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e1. Etsy \u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eEtsy is a popular place to sell houseplants of all kinds. You can find common and rare houseplants on this site, along with seeds and plant-related supplies. If you do a quick search on Etsy for houseplants, you’ll find dozens and dozens of plant listings ranging from $5 to the hundreds. \u003c/p\u003e\n\n\n\n\u003cp\u003eAn important thing to keep in mind is that the USDA (U.S. Department of Agriculture) has regulations in place that may prohibit shipping certain plants across state or national borders. \u003c/p\u003e\n\n\n\n\u003cp\u003eBesides that, when shipping live plants, you’ll need to package them carefully to prevent damage from transit or weather. Your listing on Etsy should have high-quality photos, detailed descriptions, and even helpful tips on plant care. \u003c/p\u003e\n\n\n\n\u003cp\u003eSince Etsy has many other plant sellers, stay competitive by finding a unique angle like rare plants, stylish planters, eco-friendly packaging, etc. \u003c/p\u003e\n\n\n\n\u003cp\u003eI have bought plants on Etsy, and so has my sister (she recently bought \u003ca href=\"https://bit.ly/3RvRmt6\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e3 coconut palm\u003c/a\u003e sprouts as gifts for family members!).\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e2. Facebook\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eI’ve bought so many plants on Facebook, particularly Facebook plant groups. This is a great place to sell houseplants, along with Facebook Marketplace.\u003c/p\u003e\n\n\n\n\u003cp\u003eFacebook Marketplace allows for shipping on eligible items, and you can also sell locally, offering porch pickup or meetup at a public/safe location.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen selling houseplants in Facebook groups or Facebook Marketplace, make sure you use high-quality photos taken in well-lit areas from multiple angles. It also helps to know the measurements of the plant since photos can be distorted.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e3. Amazon\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eYes, you can sell houseplants on Amazon!\u003c/p\u003e\n\n\n\n\u003cp\u003eSelling on Amazon has the benefit of reaching a large customer base, but there are a few things you need to know. You’ll need to have a Seller Account and check plant regulations.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome plants may be restricted due to agricultural laws. Live plants need secure packaging so they’re shipped safely to their new home.\u003c/p\u003e\n\n\n\n\u003cp\u003eI do want to say Amazon seems to be much more competitive than other platforms, and I’ve never really heard of people going to Amazon to buy houseplants. But it is an option, so people must be buying and selling on there.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e4. Ship My Plants\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eShip My Plants is an online service designed for selling plants. This platform helps make the process convenient and easy to ship plants by providing the tools and packaging. Ship My Plants offers premade, sturdy boxes specifically designed for houseplants. You also get tracking options and insurance options for plant shipments.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince Ship My Plants understands the specific needs of plants, this makes the shipping process smoother for both you as the seller and your customers. Using Ship My Plants to sell houseplants does come with a fee, which is based on the size, weight, and distance of your shipment. If you use the packaging from Ship My Plant, that also comes with an additional cost, along with the added insurance if you decide to get that.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e5. Plantly\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003ePlantly is an online marketplace to buy and sell houseplants. With Plantly, you can ship plants and get help with packaging, shipping, and tracking. Plantly uses eco-friendly packaging designed to protect plants during shipping and weather.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlantly also gives insurance and tracking options for added peace of mind. There are fees to use Plantly’s services, which depend on the weight, size, and destination of your package. However, Plantly usually has competitive rates, so it can be worth it.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e6. eBay\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eEBay can be a great place to sell rare and unique houseplants people can’t find locally. EBay has a huge audience around the world and also gives the option of selling items with a fixed price or auction-style listing. Keep in mind that eBay charges fees which are typically up to 12% of the sale price.\u003c/p\u003e\n\n\n\n\u003cp\u003eEBay has quite a few plant sellers, which is why it’s important to stand out by selling rare plants, using high-quality photos, and having competitive pricing (make sure you research what similar plants to yours list for on eBay).\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"847\" data-pin-description=\"10 Best Places To Sell Plants To Make Money\" src=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/10-Best-Places-To-Sell-Plants-To-Make-Money-1024x847.png\" alt=\"Here are some of my personal indoor plants. 10 Best Places To Sell Plants To Make Money\" srcset=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/10-Best-Places-To-Sell-Plants-To-Make-Money-1024x847.png 1024w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/10-Best-Places-To-Sell-Plants-To-Make-Money-300x248.png 300w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/10-Best-Places-To-Sell-Plants-To-Make-Money-768x635.png 768w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/10-Best-Places-To-Sell-Plants-To-Make-Money.png 1436w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-pin-media=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/10-Best-Places-To-Sell-Plants-To-Make-Money.png\"/\u003e\u003cfigcaption\u003e\u003cem\u003eHere are some of my personal indoor plants.\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003ch3\u003e\u003cstrong\u003e7. Farmers markets\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eFarmers markets can be a profitable and rewarding way to reach houseplant buyers. Farmers markets tend to attract crowds that are into natural living, so with that comes houseplants. Compared to running a brick-and-mortar store, a farmers market can have much lower start-up costs.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll usually only need to pay for booth fees, buying your tent and table (and decorations), packaging, and the plants themselves. Depending on the market and your location, you might have competition from other plant sellers, which is why it’s important to find a way to make yourself stand out.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e8. Plant swaps\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eI’ve been to several plant swaps, and they’re a great way to buy houseplants and also trade houseplants. However, some plant swaps have rules and regulations regarding selling houseplants, so you’ll want to make sure ahead of time you’re in the clear.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlant swaps are a great way to connect with fellow plant enthusiasts and even promote your business. It’s a fun and low-cost way to network with others who share your passion. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e9. Selling plants on your own site\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eAnother way to sell houseplants is selling via your own website. Selling plants on your own website has benefits like having full control of everything including design, pricing, and customer experience. \u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, there’s more work on your part to get the site up and running and market your own plants. This option is for people in it for the long haul, as it can take time for your site to gain traction and trust from houseplant enthusiasts.\u003c/p\u003e\n\n\n\n\u003cp\u003eA great way to get people to your site is by providing helpful plant information and tips and as much value as possible. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003e10. Local plant shops\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eLocal plant shops can be a great way to sell houseplants, especially if you sell houseplants they don’t carry since this makes you way less of a competitor. However, keep in mind you’ll likely give them a cut since you’re using their space to sell houseplants. \u003c/p\u003e\n\n\n\n\u003cp\u003eI’ve seen independent plant sellers sell at local plant shops for special events, as this brings more people to the store because they get to see unique plants they don’t usually see at the plant store.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs long as you respect the local plant shop’s space and pay them a fair cut, it can lead to a mutually beneficial working relationship where both businesses gain.\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"894\" height=\"1024\" data-pin-description=\"Where to sell plants locally and online\" src=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-894x1024.jpeg\" alt=\"Here are some more of my personal indoor plants. Where to sell plants locally and online\" srcset=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-894x1024.jpeg 894w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-262x300.jpeg 262w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-768x880.jpeg 768w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online.jpeg 1224w\" sizes=\"(max-width: 894px) 100vw, 894px\" data-pin-media=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online.jpeg\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20width=\u0026#39;894\u0026#39;%20height=\u0026#39;1024\u0026#39;%20viewBox=\u0026#39;0%200%20894%201024\u0026#39;%3E%3C/svg%3E\" data-src=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-894x1024.jpeg\" data-srcset=\"https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-894x1024.jpeg 894w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-262x300.jpeg 262w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online-768x880.jpeg 768w, https://www.makingsenseofcents.com/wp-content/uploads/2025/03/Where-to-sell-plants-locally-and-online.jpeg 1224w\"/\u003e\u003cfigcaption\u003e\u003cem\u003eHere are some more of my personal indoor plants.\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003ch2\u003e\u003cstrong\u003eFrequently Asked Questions\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eBelow are answers to common questions about selling houseplants.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eIs it profitable to sell plants?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eSelling houseplants can be profitable, especially if you focus on the right houseplants and have a good marketing and sales strategy. Rare or unique plants in high demand are usually the way to go, especially since these usually can’t be found at local plant shops. Growing and propagating plants can be a low initial investment too, but patience is key. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eIs it legal to sell plants from home?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eIt can be legal to sell plants from home, but there are a few things to consider, such as local zoning laws, whether or not you need a permit, or a sales tax and business license. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eDo I need a business license to sell plants?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eWhether or not you need a business license depends on where you live, the volume of your sales, and how you operate your plant business. Here are some general guidelines to follow.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you’re selling locally on Facebook Marketplace or Craigslist, you may not need a business license depending on where you live. If you’re selling frequently and earning a significant income, a business license may be required. \u003c/p\u003e\n\n\n\n\u003cp\u003eSelling online (like having your own site or selling on Etsy) is a whole different ball game. You may need to register your business with your local government (such as by getting a nursery license) as this allows you to legally operate and can be required for tax purposes.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eWhat is the most profitable plant to sell?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe most profitable plant to sell is always changing, and demand in the market fluctuates quite often. For example, a few years ago, the philodendron “Ring of Fire” and monstera Thai Constellation used to be super expensive. That is, until places like Home Depot and even local grocery stores started selling them in mass supply. \u003c/p\u003e\n\n\n\n\u003cp\u003eCertain types of begonias and philodendrons are going for a pretty penny, and the more established and large a rare plant is, the higher the price tag. Finding rare plants of a large size is not common. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eWhat is the best place to sell plants online?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe best place to sell plants online depends on the type of plants you’re selling and how you want to manage shipping.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, Etsy is a great platform to sell rare or specialty plants, as well as plant-related accessories and pots. Etsy has a strong community of plant lovers, so people tend to go there to find rare or hard-to-find plant varieties. \u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, Facebook Marketplace or local Facebook groups are a great option if you don’t want to deal with shipping and would rather do porch pickup or local pickup instead. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eDo nurseries buy plants?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eSome nurseries buy plants, but this depends on if the plants are unique, healthy, or in demand. For example, common plants are usually grown by nurseries or they wholesale source them from suppliers. However, if you have something rare or unique that is hard to find, nurseries may be more interested in purchasing them from you.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eWhat kind of plants can you sell?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003ePeople buy every type of plant you can think of – houseplants, succulents, outdoor plants, cacti, herbs, bulbs, perennials, vegetable plants (like peppers and tomatoes), fruit trees (like mangos and apples), and everything in between. Related to this, you may also be able to sell plant subscription boxes, decorative plant pots, fertilizer, plant kits, and more.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e\u003cstrong\u003eWhat is the best way to ship plants for sale?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe best way to ship plants is to package them securely so they stay safe during transit. This can be hard for some plants, as you can probably guess. You’ll want to start by gently wrapping the plant and roots, and you may need to test out a few processes to see what works best. You’ll also want a sturdy box with little room for the plant to move around, and add padding like crumpled paper or bubble wrap to keep it stable. Make sure the box is clearly labeled as “Live Plants” and try to ship early in the week to avoid weekend delays. Also, always check weather conditions and avoid shipping during extreme heat or cold (whatever weather the plant is not used to!).\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2\u003e\u003cstrong\u003eBest Places To Sell Houseplants – Summary\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eI hope you enjoyed my article on how to sell houseplants.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’ve been obsessed with houseplants for years (seriously, I’m running out of space), and I think this could be a great side hustle for someone who loves plants. Whether it’s propagating your favorite cuttings or trading rare finds with fellow plant lovers, it’s a rewarding experience.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eAre you interested in selling houseplants as a side hustle?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\u003cem\u003eRecommended reading:\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.makingsenseofcents.com/2024/01/best-selling-apps.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e16 Best Selling Apps For Selling Stuff Online And Locally\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.makingsenseofcents.com/2025/03/how-to-decide-what-business-to-start.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow To Decide What Business To Start In 8 Simple Steps\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.makingsenseofcents.com/2025/03/how-to-make-5000-a-month.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow To Make $5,000 A Month – 13 Real Ways\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.makingsenseofcents.com/2025/02/how-i-made-my-side-hustle-my-full-time-dream-job.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow To Sell On Etsy Successfully\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.makingsenseofcents.com/2024/04/jobs-in-nature.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e29 Best Jobs In Nature To Make Money\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.makingsenseofcents.com/2019/05/list-of-outdoor-jobs.html\"\u003e15 Outdoor Jobs For People Who Love Being Outside\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-05-23T11:00:00Z",
  "modifiedTime": "2025-05-25T20:24:18Z"
}
