{
  "id": "1c65a51c-ef5d-4ec2-8f0c-2cbdaf360172",
  "title": "Who was Jimmy Carter? From peanut farmer to US president",
  "link": "https://timesofindia.indiatimes.com/world/us/from-peanut-farmer-to-us-president-who-was-jimmy-carter-legacy-of-leadership-diplomacy-and-humanitarianism/articleshow/116780992.cms",
  "description": "",
  "author": "TOI World Desk",
  "published": "2024-12-30T06:22:21+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 4213,
  "excerpt": "US News: Jimmy Carter’s legacy extends far beyond his presidency.",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Carter’s humanitarian work earned him widespread respect and recognition, culminating in the 2002 Nobel Peace Prize for his work in conflict resolution and promoting global democracy.Jimmy Carter’s legacy extends far beyond his presidency. After leaving the White House in 1981, Carter devoted himself to humanitarian causes through the Carter Center, a nonprofit organization he and his wife, Rosalynn, founded in 1982. The Carter Center became a global leader in promoting peace, fighting diseases, and advancing human rights, with notable initiatives such as efforts to combat malaria, guinea worm disease, and the promotion of free and fair elections around the world.Carter’s humanitarian work earned him widespread respect and recognition, culminating in the 2002 Nobel Peace Prize for his work in conflict resolution and promoting global democracy. His post-presidential years marked a period of tireless service, as he traveled to some of the world’s most challenging regions to mediate conflicts, provide aid, and encourage democratic governance.In addition to his global peace efforts, Carter was also a dedicated advocate for affordable housing through Habitat for Humanity, working alongside volunteers to build homes for those in need. His deep commitment to social justice was evident in his unwavering dedication to these causes, even as his health declined in recent years.A tumultuous presidencyCarter’s presidency, which spanned from 1977 to 1981, was marked by both significant achievements and serious struggles. While he brokered the Camp David Accords, an unparalleled success in Middle Eastern diplomacy, his administration faced intense challenges at home, including the 1979 energy crisis, soaring inflation, and the infamous Iran hostage crisis, which saw 52 Americans held captive in Tehran for over a year.Despite these challenges, Carter’s vision for a more just and peaceful world shaped his foreign policy decisions, including his focus on human rights, and his landmark agreement to limit nuclear arms with the Soviet Union. His presidency’s economic difficulties, particularly the deep recession of the late 1970s, and the inability to resolve the Iran hostage crisis, hampered his political standing and contributed to his defeat in the 1980 presidential election to Ronald Reagan.However, Carter’s post-presidential career would prove far more enduring than his time in office. His leadership in global humanitarian efforts and his ability to reconcile with his critics made him a beloved figure in both the United States and abroad.The final chapter: A family manCarter’s final years were shaped by his enduring relationship with his wife, Rosalynn, whom he often credited as a source of strength throughout his life. The couple’s partnership was one of the longest in American political history, spanning nearly eight decades. They weathered personal and professional storms together, including the 2020 Covid-19 pandemic, during which they isolated together in their modest home in Plains, Georgia. Rosalynn Carter’s passing in November 2023 left a profound impact on her husband, and his final months were marked by both grief and reflection.In February 2023, after a series of health crises, including a diagnosis of melanoma that spread to his liver and brain, Carter entered hospice care. His decision to forgo further medical treatments and spend his final days at home was consistent with his life’s philosophy of personal dignity and humility.Funeral plans and tributesCarter’s memorial service will follow a carefully planned schedule, reflecting his lifelong commitment to family, tradition, and public service. The public will have an opportunity to pay respects in Atlanta, where he will lie in repose at the Carter Center before being flown to Washington, D.C. for a state funeral at the National Cathedral. The service will be attended by dignitaries and heads of state, offering a final tribute to a man whose life spanned nearly a century of American history.After the national ceremonies, Carter will return to Plains, where he will be buried on the grounds of his family’s home, completing a life marked by extraordinary service to his country and the world.",
  "image": "https://static.toiimg.com/thumb/msid-116781046,width-1070,height-580,imgsize-1388614,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-116781046,imgsize-1388614,width-400,resizemode-4/116781046.jpg\" alt=\"From peanut farmer to US president: Who was Jimmy Carter? Legacy of leadership, diplomacy, and humanitarianism\" title=\"Carter’s humanitarian work earned him widespread respect and recognition, culminating in the 2002 Nobel Peace Prize for his work in conflict resolution and promoting global democracy.\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"Carter’s humanitarian work earned him widespread respect and recognition, culminating in the 2002 Nobel Peace Prize for his work in conflict resolution and promoting global democracy.\"\u003eCarter’s humanitarian work earned him widespread respect and recognition, culminating in the 2002 Nobel Peace Prize for his work in conflict resolution and promoting global democracy.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003e\u003ca href=\"https://timesofindia.indiatimes.com/topic/jimmy-carter\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eJimmy Carter\u003c/a\u003e’s legacy extends far beyond his presidency. After leaving the White House in 1981, Carter devoted himself to humanitarian causes through the Carter Center, a nonprofit organization he and his wife, Rosalynn, founded in 1982. The Carter Center became a global leader in promoting peace, fighting diseases, and advancing human rights, with notable initiatives such as efforts to combat malaria, guinea worm disease, and the promotion of free and fair elections around the world.\u003cbr/\u003eCarter’s humanitarian work earned him widespread respect and recognition, culminating in the 2002 \u003ca href=\"https://timesofindia.indiatimes.com/topic/nobel-peace-prize\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eNobel Peace Prize\u003c/a\u003e for his work in conflict resolution and promoting global democracy. His post-presidential years marked a period of tireless service, as he traveled to some of the world’s most challenging regions to mediate conflicts, provide aid, and encourage democratic governance.\u003cbr/\u003eIn addition to his global peace efforts, Carter was also a dedicated advocate for affordable housing through Habitat for Humanity, working alongside volunteers to build homes for those in need. His deep commitment to social justice was evident in his unwavering dedication to these causes, even as his health declined in recent years.\u003c/p\u003e\u003cp\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eA tumultuous presidency\u003c/span\u003e\u003cbr/\u003eCarter’s presidency, which spanned from 1977 to 1981, was marked by both significant achievements and serious struggles. While he brokered the Camp David Accords, an unparalleled success in Middle Eastern diplomacy, his administration faced intense challenges at home, including the 1979 energy crisis, soaring inflation, and the infamous Iran hostage crisis, which saw 52 Americans held captive in Tehran for over a year.\u003c/p\u003e\u003cp\u003eDespite these challenges, Carter’s vision for a more just and peaceful world shaped his foreign policy decisions, including his focus on human rights, and his landmark agreement to limit nuclear arms with the Soviet Union. His presidency’s economic difficulties, particularly the deep recession of the late 1970s, and the inability to resolve the Iran hostage crisis, hampered his political standing and contributed to his defeat in the 1980 presidential election to Ronald Reagan.\u003cbr/\u003eHowever, Carter’s post-presidential career would prove far more enduring than his time in office. His leadership in global humanitarian efforts and his ability to reconcile with his critics made him a beloved figure in both the United States and abroad.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe final chapter: A family man\u003c/span\u003e\u003cbr/\u003eCarter’s final years were shaped by his enduring relationship with his wife, Rosalynn, whom he often credited as a source of strength throughout his life. The couple’s partnership was one of the longest in American political history, spanning nearly eight decades. They weathered personal and professional storms together, including the 2020 Covid-19 pandemic, during which they isolated together in their modest home in Plains, Georgia. Rosalynn Carter’s passing in November 2023 left a profound impact on her husband, and his final months were marked by both grief and reflection.\u003cbr/\u003eIn February 2023, after a series of health crises, including a diagnosis of melanoma that spread to his liver and brain, Carter entered hospice care. His decision to forgo further medical treatments and spend his final days at home was consistent with his life’s philosophy of personal dignity and humility.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eFuneral plans and tributes\u003c/span\u003e\u003cbr/\u003eCarter’s memorial service will follow a carefully planned schedule, reflecting his lifelong commitment to family, tradition, and public service. The public will have an opportunity to pay respects in Atlanta, where he will lie in repose at the Carter Center before being flown to Washington, D.C. for a state funeral at the National Cathedral. The service will be attended by dignitaries and heads of state, offering a final tribute to a man whose life spanned nearly a century of American history.\u003c/p\u003e\u003cp\u003eAfter the national ceremonies, Carter will return to Plains, where he will be buried on the grounds of his family’s home, completing a life marked by extraordinary service to his country and the world.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-30T06:22:00+05:30",
  "modifiedTime": null
}
