{
  "id": "1dbd248f-9960-4b6c-a96c-821e5211a692",
  "title": "Marco Rubio Says \"Absurd\" For US Government Vessels To Pay In Panama Canal",
  "link": "https://www.ndtv.com/world-news/marco-rubio-says-absurd-for-us-government-vessels-to-pay-in-panama-canal-7652607",
  "description": "US Secretary of State Marco Rubio said Thursday it was \"absurd\" for US naval vessels to pay to transit the Panama Canal, after Panama's president denied an agreement on free passage.",
  "author": "",
  "published": "Fri, 07 Feb 2025 04:37:44 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 1732,
  "excerpt": "US Secretary of State Marco Rubio said Thursday it was \"absurd\" for US naval vessels to pay to transit the Panama Canal, after Panama's president denied an agreement on free passage.",
  "siteName": "www.ndtv.com",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Marco Rubio, however, stopped short of insisting that an agreement had been reached. Santo Domingo: US Secretary of State Marco Rubio said Thursday it was \"absurd\" for US naval vessels to pay to transit the Panama Canal, after Panama's president denied an agreement on free passage.\"I find it absurd that we would have to pay fees to transit a zone we are obligated to protect in time of conflict. Those are our expectations,\" Rubio told reporters in the Dominican Republic.Rubio, however, stopped short of insisting that an agreement had been reached.\"They're a democratically elected government. They have rules; they have laws. They're going to follow their process, but our expectations remain the same,\" he said.A State Department social media posting on Wednesday said that Panama would exempt US government vessels from fees, days after a visit by Rubio.President Jose Raul Mulino called the remark untrue and \"intolerable.\"President Donald Trump has threatened to seize the Panama Canal, pointing to the growing influence of China.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day \"Process Of Deportation Not New\": S Jaishankar On US Sending Back 104 Indians",
  "image": "https://c.ndtvimg.com/2025-02/b4rm3hto_marco-rubio_625x300_07_February_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                                                                                                \u003cp\u003e\u003cimg title=\"Marco Rubio Says \u0026#34;Absurd\u0026#34; For US Government Vessels To Pay In Panama Canal\" alt=\"Marco Rubio Says \u0026#34;Absurd\u0026#34; For US Government Vessels To Pay In Panama Canal\" id=\"story_image_main\" data-src=\"https://c.ndtvimg.com/2025-02/q7t3006k_marco-rubio_625x300_07_February_25.jpeg?downsize=545:307\" height=\"240\" width=\"320\" src=\"https://c.ndtvimg.com/2025-02/q7t3006k_marco-rubio_625x300_07_February_25.jpeg?downsize=545:307\"/\u003e\n                                            \u003c/p\u003e\n                                                                                \u003cp\u003eMarco Rubio, however, stopped short of insisting that an agreement had been reached.\u003c/p\u003e\n                                    \u003c/div\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eSanto Domingo: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eUS Secretary of State Marco Rubio said Thursday it was \u0026#34;absurd\u0026#34; for US naval vessels to pay to transit the Panama Canal, after Panama\u0026#39;s president denied an agreement on free passage.\u003c/p\u003e\u003cp\u003e\u0026#34;I find it absurd that we would have to pay fees to transit a zone we are obligated to protect in time of conflict. Those are our expectations,\u0026#34; Rubio told reporters in the Dominican Republic.\u003c/p\u003e\u003cp\u003eRubio, however, stopped short of insisting that an agreement had been reached.\u003c/p\u003e\u003cp\u003e\u0026#34;They\u0026#39;re a democratically elected government. They have rules; they have laws. They\u0026#39;re going to follow their process, but our expectations remain the same,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eA State Department social media posting on Wednesday said that Panama would exempt US government vessels from fees, days after a visit by Rubio.\u003c/p\u003e\u003cp\u003ePresident Jose Raul Mulino called the remark untrue and \u0026#34;intolerable.\u0026#34;\u003c/p\u003e\u003cp\u003ePresident Donald Trump has threatened to seize the Panama Canal, pointing to the growing influence of China.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003e\u0026#34;Process Of Deportation Not New\u0026#34;: S Jaishankar On US Sending Back 104 Indians\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
