{
  "id": "20c799e8-36d0-4d4a-8d76-bde4dcb35423",
  "title": "China's Xi Jinping Urges G20 Leaders To Help \"Cool\" Ukraine Crisis",
  "link": "https://www.ndtv.com/world-news/russia-ukraine-conflict-chinas-xi-jinping-urges-g20-leaders-to-help-cool-ukraine-crisis-7051720",
  "description": "Chinese President Xi Jinping urged G20 leaders Monday to support efforts to de-escalate the war in Ukraine and reach a \"political solution,\" state media reported.",
  "author": "",
  "published": "Tue, 19 Nov 2024 05:37:58 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 2443,
  "excerpt": "Chinese President Xi Jinping urged G20 leaders Monday to support efforts to de-escalate the war in Ukraine and reach a \u0026quot;political solution,\u0026quot; state media reported.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Rio de Janeiro: Chinese President Xi Jinping urged G20 leaders Monday to support efforts to de-escalate the war in Ukraine and reach a \"political solution,\" state media reported.His remarks at the G20 summit in Brazil come shortly after Ukraine received a US green light to launch long-range missiles provided by Washington against targets inside Russia.\"The G20 should support the United Nations and its Security Council in playing a greater role, and support all efforts conducive to the peaceful settlement of crises,\" Xi said, according to Chinese state broadcaster CCTV.He called for leaders to avoid \"spillovers\" from battlefields and escalation of fighting, and to help \"cool the Ukraine crisis and seek a political solution.\"War in Ukraine continues to rage since Russia's invasion in 2022.China presents itself as a neutral party in the war and says it is not sending lethal assistance to either side, unlike the United States and other Western nations.But it remains a close political and economic ally of Russia. NATO members have branded Beijing a \"decisive enabler\" of the war, which it has never condemned.Following the long-range missile policy shift by US President Joe Biden, who leaves office in January, German Chancellor Olaf Scholz said Monday his country was sending Ukraine 4,000 AI-guided drones.Xi, in his speech Monday, also called for efforts to shore up multilateral trade systems and warned against \"politicizing economic issues\" without naming any specific countries.His comments come before US President-elect Donald Trump reenters the White House in January, after campaigning on pledges to enact sweeping tariffs on China and others.Washington also unveiled sharp tariff hikes this year on Chinese goods, notably on products like electric vehicle batteries and solar cells, as the United States tries to grow its domestic clean energy sectors.\"We must avoid politicizing economic issues, artificially dividing the global market, and avoid practicing protectionism in the name of green and low-carbon development,\" Xi said.In seeking cooperation on artificial intelligence, he added that this should not become \"a game of rich countries and the wealthy.\"Xi called for \"all sides to stop fighting\" in Gaza as well, saying the war between Israel and Hamas has \"brought heavy suffering,\" CCTV reported.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-11/5cn0aavo_xi-jingping-g20_625x300_19_November_24.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eRio de Janeiro: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eChinese President Xi Jinping urged G20 leaders Monday to support efforts to de-escalate the war in Ukraine and reach a \u0026#34;political solution,\u0026#34; state media reported.\u003c/p\u003e\u003cp\u003eHis remarks at the G20 summit in Brazil come shortly after Ukraine received a US green light to launch long-range missiles provided by Washington against targets inside Russia.\u003c/p\u003e\u003cp\u003e\u0026#34;The G20 should support the United Nations and its Security Council in playing a greater role, and support all efforts conducive to the peaceful settlement of crises,\u0026#34; Xi said, according to Chinese state broadcaster CCTV.\u003c/p\u003e\u003cp\u003eHe called for leaders to avoid \u0026#34;spillovers\u0026#34; from battlefields and escalation of fighting, and to help \u0026#34;cool the Ukraine crisis and seek a political solution.\u0026#34;\u003c/p\u003e\u003cp\u003eWar in Ukraine continues to rage since Russia\u0026#39;s invasion in 2022.\u003c/p\u003e\u003cp\u003eChina presents itself as a neutral party in the war and says it is not sending lethal assistance to either side, unlike the United States and other Western nations.\u003c/p\u003e\u003cp\u003eBut it remains a close political and economic ally of Russia. NATO members have branded Beijing a \u0026#34;decisive enabler\u0026#34; of the war, which it has never condemned.\u003c/p\u003e\u003cp\u003eFollowing the long-range missile policy shift by US President Joe Biden, who leaves office in January, German Chancellor Olaf Scholz said Monday his country was sending Ukraine 4,000 AI-guided drones.\u003c/p\u003e\u003cp\u003eXi, in his speech Monday, also called for efforts to shore up multilateral trade systems and warned against \u0026#34;politicizing economic issues\u0026#34; without naming any specific countries.\u003c/p\u003e\u003cp\u003eHis comments come before US President-elect Donald Trump reenters the White House in January, after campaigning on pledges to enact sweeping tariffs on China and others.\u003c/p\u003e\u003cp\u003eWashington also unveiled sharp tariff hikes this year on Chinese goods, notably on products like electric vehicle batteries and solar cells, as the United States tries to grow its domestic clean energy sectors.\u003c/p\u003e\u003cp\u003e\u0026#34;We must avoid politicizing economic issues, artificially dividing the global market, and avoid practicing protectionism in the name of green and low-carbon development,\u0026#34; Xi said.\u003c/p\u003e\u003cp\u003eIn seeking cooperation on artificial intelligence, he added that this should not become \u0026#34;a game of rich countries and the wealthy.\u0026#34;\u003c/p\u003e\u003cp\u003eXi called for \u0026#34;all sides to stop fighting\u0026#34; in Gaza as well, saying the war between Israel and Hamas has \u0026#34;brought heavy suffering,\u0026#34; CCTV reported.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-19T05:37:58+05:30",
  "modifiedTime": null
}
