{
  "id": "2616d488-162d-4682-9e60-a64f667aaf73",
  "title": "Musk orders US federal workers to report on work by Monday or resign",
  "link": "https://www.yahoo.com/news/musk-orders-us-federal-workers-213635585.html",
  "description": "",
  "author": "",
  "published": "2025-02-22T21:36:35Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Valerie Volcovici",
  "length": 4209,
  "excerpt": "WASHINGTON (Reuters) -The Trump administration sent emails on Saturday evening to U.S. federal government employees telling them to detail their work...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "By Valerie VolcoviciWASHINGTON (Reuters) -The Trump administration sent emails on Saturday evening to U.S. federal government employees telling them to detail their work accomplishments from the previous week by Monday night or risk losing their jobs.The emails came shortly after Elon Musk, the billionaire head of the Trump administration's Department of Government Efficiency, posted on the social media site X that not responding to the email request would be viewed as a resignation.\"All federal employees will shortly receive an email requesting to understand what they got done last week,\" Musk posted on X. \"Failure to respond will be taken as a resignation.\"Musk's post came just hours after President Donald Trump posted on his own social media network, Truth Social, that DOGE should get more aggressive in its attempts to downsize and reshape the federal workforce.As of Saturday evening, emails were sent to employees across federal agencies, including the Securities and Exchange Commission, National Oceanic and Atmospheric Administration, the Centers for Disease Control and Prevention and others with the subject line, \"What did you do last week?\"The email, seen by Reuters, asks employees to reply with five bullet points summarizing \"what you accomplished at work last week,\" and to copy their managers.The email, which was sent from a human resources address from the Office of Personnel Management, gives employees until 11:59 p.m. EST on Monday to respond.It is unclear what legal basis Musk has to terminate federal workers if they fail to respond to his request and what would happen to employees that cannot detail confidential work.Workers at the Consumer Financial Protection Bureau also received the email, according to people with knowledge of the matter. However, most agency staff had been ordered not to perform any tasks since early this month, creating a conundrum. The agency is also under temporary court order not to resume mass firings pending the outcome of legal proceedings.A spokesperson for DOGE did not immediately respond to a request for comment.UNION PROMISES FIGHTThe AFGE, the union representing federal employees, said in a statement it will challenge any \"unlawful terminations.\"“Once again, Elon Musk and the Trump administration have shown their utter disdain for federal employees and the critical services they provide to the American people,\" said AFGE national president Everett Kelley.The Trump administration's fast-paced and controversial process to reduce government spending by shrinking the federal workforce led by Musk and his young aides at the cost-cutting DOGE has led to haphazard firings that resulted in numerous mistakes and forced several agencies to quickly rehire vital employees, such as those working on nuclear safety, defense and power generation.The first wave of job cuts has targeted workers who are easier to fire, such as probationary employees on the job for less than two years or those who have started new roles within an agency.The indiscriminate firings have led to DOGE terminating people whose jobs are not funded by taxpayers and have begun to anger people across the country who are concerned about a loss of services and the impact of federal job losses on local economies.Trump has repeatedly talked about Musk as the functional leader of DOGE, which is not a cabinet-level department, but the White House said in a court filing this month that Musk had no authority over DOGE and was not an employee of the program.Some federal agencies sent follow-up emails to employees advising staff not to respond to the email over the weekend as they assess its validity and devise a protocol for responding to the message.\"To be clear, this is irregular, unexpected and warrants further validation by management,\" said one email sent to NOAA employees seen by Reuters.The Executive Office for United States Attorneys also sent an email, seen by Reuters, to employees, advising them to wait to respond until they verify the validity of the emails.(Reporting by Valerie Volcovici; additional reporting by Sarah N. Lynch and Douglas Gillison in Washington and Chris Prentice in New York; Editing by Paul Simao and Rod Nickel)",
  "image": "https://media.zenfs.com/en/reuters.com/3e7ea7ab748af2cffd68dc55c5668161",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eBy Valerie Volcovici\u003c/p\u003e\u003cp\u003eWASHINGTON (Reuters) -The Trump administration sent emails on Saturday evening to U.S. federal government employees telling them to detail their work accomplishments from the previous week by Monday night or risk losing their jobs.\u003c/p\u003e\u003cp\u003eThe emails came shortly after Elon Musk, the billionaire head of the Trump administration\u0026#39;s Department of Government Efficiency, posted on the social media site X that not responding to the email request would be viewed as a resignation.\u003c/p\u003e\u003cp\u003e\u0026#34;All federal employees will shortly receive an email requesting to understand what they got done last week,\u0026#34; Musk posted on X. \u0026#34;Failure to respond will be taken as a resignation.\u0026#34;\u003c/p\u003e\u003cp\u003eMusk\u0026#39;s post came just hours after President Donald Trump posted on his own social media network, Truth Social, that DOGE should get more aggressive in its attempts to downsize and reshape the federal workforce.\u003c/p\u003e\u003cp\u003eAs of Saturday evening, emails were sent to employees across federal agencies, including the Securities and Exchange Commission, National Oceanic and Atmospheric Administration, the Centers for Disease Control and Prevention and others with the subject line, \u0026#34;What did you do last week?\u0026#34;\u003c/p\u003e\u003cp\u003eThe email, seen by Reuters, asks employees to reply with five bullet points summarizing \u0026#34;what you accomplished at work last week,\u0026#34; and to copy their managers.\u003c/p\u003e\u003cp\u003eThe email, which was sent from a human resources address from the Office of Personnel Management, gives employees until 11:59 p.m. EST on Monday to respond.\u003c/p\u003e\u003cp\u003eIt is unclear what legal basis Musk has to terminate federal workers if they fail to respond to his request and what would happen to employees that cannot detail confidential work.\u003c/p\u003e\u003cp\u003eWorkers at the Consumer Financial Protection Bureau also received the email, according to people with knowledge of the matter. However, most agency staff had been ordered not to perform any tasks since early this month, creating a conundrum. The agency is also under temporary court order not to resume mass firings pending the outcome of legal proceedings.\u003c/p\u003e\u003cp\u003eA spokesperson for DOGE did not immediately respond to a request for comment.\u003c/p\u003e\u003cp\u003eUNION PROMISES FIGHT\u003c/p\u003e\u003cp\u003eThe AFGE, the union representing federal employees, said in a statement it will challenge any \u0026#34;unlawful terminations.\u0026#34;\u003c/p\u003e\u003cp\u003e“Once again, Elon Musk and the Trump administration have shown their utter disdain for federal employees and the critical services they provide to the American people,\u0026#34; said AFGE national president Everett Kelley.\u003c/p\u003e\u003cp\u003eThe Trump administration\u0026#39;s fast-paced and controversial process to reduce government spending by shrinking the federal workforce led by Musk and his young aides at the cost-cutting DOGE has led to haphazard firings that resulted in numerous mistakes and forced several agencies to quickly rehire vital employees, such as those working on nuclear safety, defense and power generation.\u003c/p\u003e\u003cp\u003eThe first wave of job cuts has targeted workers who are easier to fire, such as probationary employees on the job for less than two years or those who have started new roles within an agency.\u003c/p\u003e\u003cp\u003eThe indiscriminate firings have led to DOGE terminating people whose jobs are not funded by taxpayers and have begun to anger people across the country who are concerned about a loss of services and the impact of federal job losses on local economies.\u003c/p\u003e\u003cp\u003eTrump has repeatedly talked about Musk as the functional leader of DOGE, which is not a cabinet-level department, but the White House said in a court filing this month that Musk had no authority over DOGE and was not an employee of the program.\u003c/p\u003e\u003cp\u003eSome federal agencies sent follow-up emails to employees advising staff not to respond to the email over the weekend as they assess its validity and devise a protocol for responding to the message.\u003c/p\u003e\u003cp\u003e\u0026#34;To be clear, this is irregular, unexpected and warrants further validation by management,\u0026#34; said one email sent to NOAA employees seen by Reuters.\u003c/p\u003e\u003cp\u003eThe Executive Office for United States Attorneys also sent an email, seen by Reuters, to employees, advising them to wait to respond until they verify the validity of the emails.\u003c/p\u003e\u003cp\u003e(Reporting by Valerie Volcovici; additional reporting by Sarah N. Lynch and Douglas Gillison in Washington and Chris Prentice in New York; Editing by Paul Simao and Rod Nickel)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-22T21:36:35Z",
  "modifiedTime": null
}
