{
  "id": "2eb87d88-ecd3-4d20-95ce-4feaab951148",
  "title": "Fact-checking Trump claims about war in Ukraine",
  "link": "https://www.bbc.com/news/articles/c9814k2jlxko",
  "description": "President Donald Trump appeared to accuse Ukraine of being responsible for the war with Russia.",
  "author": "",
  "published": "Wed, 19 Feb 2025 17:48:12 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Matt Murphy \u0026 Jake Horton",
  "length": 6405,
  "excerpt": "President Donald Trump appeared to accuse Ukraine of being responsible for the war with Russia.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Matt Murphy \u0026 Jake HortonBBC VerifyGetty ImagesUS President Donald Trump has appeared to accuse Ukraine of being responsible for the war with Russia, in a flurry of claims from his Mar-a-Lago mansion in Florida.Speaking to reporters, Trump also made claims about President Volodymyr Zelensky's popularity and observed that Ukraine had yet to hold scheduled elections due to martial law. He later doubled down on those comments in a fiery Truth Social post on Wednesday.Trump's accusations - some of which appeared to mirror common Russian talking points about the war - came just hours after US officials met a Russian delegation in Riyadh to open talks to end the conflict, which has raged for almost three years.Zelensky later accused Trump of \"living in a disinformation space\" created by Russia.BBC Verify has fact-checked Trump's claims.Claim: Zelensky is a 'dictator without elections'Trump initially drew attention to the fact that Ukraine has not held a presidential election since 2019, when Zelensky - previously a comedian with no political base - swept to power.He repeated the claims in a Truth Social post in which he accused the Ukrainian leader of being a \"dictator without elections\". Zelensky's first five-year term of office was due to come to an end in May 2024. However, Ukraine has been under martial law since the Russian invasion in February 2022, which means elections are suspended.Ukraine's martial laws were drafted in 2015 - shortly after Russia annexed the Crimean Peninsula and years before Zelensky and his Servant of the People party came to power.Independent observers from the OSCE said the 2019 election had been \"competitive and fundamental freedoms were generally respected\". Zelensky won 73% of the vote in the second-round run-off.Zelensky has vowed to hold a new election once the conflict ends and has yet to confirm that he intends to stand. Some experts have observed that holding elections in Ukraine before the conflict ends would be practically impossible, as Russian attacks on many cities persist and millions of citizens are displaced abroad or living under Russian occupation.Trump's intervention on the subject came just hours after the Kremlin questioned Zelensky's legitimacy as his term in office has ended, a claim Moscow has repeatedly made in the past months. On 28 January, Russia's President Vladimir Putin called Zelensky \"illegitimate\" in an interview with Russian media.Referring to the electoral situation, Trump appeared aware that it had been a frequent Russian allegation used to undermine Zelensky, saying in his news conference: \"That's not a Russian thing, that's something coming from me, from other countries.\"For his part, Zelensky has previously said it would be \"absolutely irresponsible to throw the topic of elections\" in the middle of the conflict.Trump questioned on Ukraine not being invited to US-Russia talksClaim: 'I hate to say it, but he's down at 4% approval rating'President Trump also claimed that Zelensky's approval rating has fallen to 4%.It's unclear what source the president was citing as he didn't provide evidence. We have asked the White House to clarify this.Official polling is limited and it is extremely difficult to carry out accurate surveys during a time of war. Millions of Ukrainians have fled and Russia has occupied around a fifth of the country.However, some polling has been possible to carry out by telephone. A survey conducted this month found that 57% of Ukrainians said they trusted the president, according to the Ukraine-based Kyiv International Institute of Sociology.However, that was down from 77% at the end of 2023, and 90% in May 2022 - suggesting that the president has suffered a drop-off in his popularity.Some other polls suggest Zelensky trailing his nearest rival, former army chief Valerii Zaluzhnyi, in the first round of any future election, indicating the two would face each other in a run-off.Getty ImagesGen Valerii Zaluzhnyi could be a rival to President Zelensky were he to run in any future election, some polls suggestIn the wake of Trump's comments, some major Russian media outlets seized on the claim and cited a poll carried out by Ukrainian MP and Zelensky critic, Oleksandr Dubinsky, on Telegram which they claimed backed up Trump's assessment.Dubinsky has been charged with treason in Ukraine, and accused of \"operating at the behest of Russian intelligence\" - which he denies.Claim: 'You should have never started it'Ukrainian authorities expressed dissatisfaction over not being part of Tuesday's talks in Riyadh. But Trump dismissed these concerns, telling reporters that Ukraine had had three years to end the war, before appearing to blame Kyiv for starting the conflict.\"You should have never started it,\" he said. The Kremlin has previously accused Ukraine of starting the war against Russia.\"It was they who started the war in 2014. Our goal is to stop this war. And we did not start this war in 2022,\" Russian President Vladimir Putin told US talk show host Tucker Carlson in February 2024.Ukraine didn't start the war. Russia launched a full-scale invasion of Ukraine in February 2022, having annexed Crimea in 2014.The annexation came after Ukraine's pro-Russian president was ousted by popular demonstrations.Trump says Ukraine could have made a deal earlierRosenberg: How Putin and Trump shook up the world in a weekWho was at the table at US-Russia talks in Saudi Arabia?Russia also backed proxy forces who seized areas of eastern Ukraine, and it accused the new government in Kyiv of discrimination and genocide against Russian speakers. The International Court of Justice has rejected Moscow's claims.After the failure of agreements which aimed to end the post-2014 conflict - Russia began a massive build-up of troops on its border with Ukraine in late 2021.Putin launched the invasion on 24 February 2022, stating that the aim of the operation was to \"demilitarise and denazify\" the pro-Western government of Volodymyr Zelensky and prevent the country from joining Nato.In Ukraine's last parliamentary elections, support for far-right candidates was 2%. It should also be noted that Zelensky is Jewish and that his party has been regarded as centrist.And while Nato officials said in 2021 that Ukraine was a candidate to join the Western alliance in the future, it was not part of any formal process.Additional reporting by BBC Monitoring.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eMatt Murphy \u0026amp; Jake Horton\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC Verify\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ca29/live/407c7240-eeba-11ef-b016-3f382c6f5494.jpg.webp\" alt=\"Getty Images President Donald Trump speaks to reporters from a lectern bearing the seal of the US president. An American flag and a flag bearing the president\u0026#39;s seal are behind him.  He wears a dark suit and a blue tie. \"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUS President Donald Trump has appeared to accuse Ukraine of being responsible for the war with Russia, in a flurry of claims from his Mar-a-Lago mansion in Florida.\u003c/p\u003e\u003cp\u003eSpeaking to reporters, Trump also made claims about President Volodymyr Zelensky\u0026#39;s popularity and observed that Ukraine had yet to hold scheduled elections due to martial law. He later doubled down on those comments in a fiery Truth Social post on Wednesday.\u003c/p\u003e\u003cp\u003eTrump\u0026#39;s accusations - some of which appeared to mirror common Russian talking points about the war - came just hours after US officials met a Russian delegation in Riyadh to open talks to end the conflict, which has raged for almost three years.\u003c/p\u003e\u003cp\u003eZelensky later accused Trump of \u0026#34;living in a disinformation space\u0026#34; created by Russia.\u003c/p\u003e\u003cp\u003eBBC Verify has fact-checked Trump\u0026#39;s claims.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eClaim: Zelensky is a \u0026#39;dictator without elections\u0026#39;\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eTrump initially drew attention to the fact that Ukraine has not held a presidential election since 2019,  when Zelensky - previously a comedian with no political base - swept to power.\u003c/p\u003e\u003cp\u003eHe repeated the claims in a Truth Social post in which he accused the Ukrainian leader of being a \u0026#34;dictator without elections\u0026#34;. \u003c/p\u003e\u003cp\u003eZelensky\u0026#39;s first five-year term of office was due to come to an end in May 2024. However, Ukraine has been under martial law since the Russian invasion in February 2022, which means elections are suspended.\u003c/p\u003e\u003cp\u003eUkraine\u0026#39;s martial laws were drafted in 2015 - shortly after Russia annexed the Crimean Peninsula and years before Zelensky and his Servant of the People party came to power.\u003c/p\u003e\u003cp\u003eIndependent observers from the OSCE said the 2019 election \u003ca target=\"_blank\" href=\"https://www.osce.org/odihr/elections/ukraine/439574\"\u003ehad been \u0026#34;competitive and fundamental freedoms were generally respected\u0026#34;\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eZelensky \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/world-europe-48007487\"\u003ewon 73% of the vote\u003c/a\u003e in the second-round run-off.\u003c/p\u003e\u003cp\u003eZelensky has vowed to hold a new election once the conflict ends and has yet to confirm that he intends to stand. Some experts have observed that holding elections in Ukraine before the conflict ends would be practically impossible, as Russian attacks on many cities persist and millions of citizens are displaced abroad or living under Russian occupation.\u003c/p\u003e\u003cp\u003eTrump\u0026#39;s intervention on the subject came just hours after the Kremlin questioned Zelensky\u0026#39;s legitimacy as his term in office has ended, a claim Moscow has repeatedly made in the past months. On 28 January, Russia\u0026#39;s President Vladimir Putin called Zelensky \u0026#34;illegitimate\u0026#34; in an interview with Russian media.\u003c/p\u003e\u003cp\u003eReferring to the electoral situation, Trump appeared aware that it had been a frequent Russian allegation used to undermine Zelensky, saying in his news conference: \u0026#34;That\u0026#39;s not a Russian thing, that\u0026#39;s something coming from me, from other countries.\u0026#34;\u003c/p\u003e\u003cp\u003eFor his part, Zelensky has previously said it would be \u0026#34;absolutely irresponsible to throw the topic of elections\u0026#34; in the middle of the conflict.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eTrump questioned on Ukraine not being invited to US-Russia talks\u003c/figcaption\u003e\u003c/p\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eClaim: \u0026#39;I hate to say it, but he\u0026#39;s down at 4% approval rating\u0026#39;\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePresident Trump also claimed that Zelensky\u0026#39;s approval rating has fallen to 4%.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s unclear what source the president was citing as he didn\u0026#39;t provide evidence. We have asked the White House to clarify this.\u003c/p\u003e\u003cp\u003eOfficial polling is limited and it is extremely difficult to carry out accurate surveys during a time of war. Millions of Ukrainians have fled and Russia has occupied around a fifth of the country.\u003c/p\u003e\u003cp\u003eHowever, some polling has been possible to carry out by telephone. A survey conducted this month found that 57% of Ukrainians said they trusted the president, according to the Ukraine-based \u003ca target=\"_blank\" href=\"https://www.kiis.com.ua/?lang=eng\u0026amp;cat=reports\u0026amp;id=1466\u0026amp;page=3\"\u003eKyiv International Institute of Sociology\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eHowever, that was down from 77% at the end of 2023, and 90% in May 2022 - suggesting that the president has suffered a drop-off in his popularity.\u003c/p\u003e\u003cp\u003eSome other polls suggest Zelensky trailing his nearest rival, former army chief Valerii Zaluzhnyi, in the first round of any future election, indicating the two would face each other in a run-off.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5370/live/97f33180-eeba-11ef-b016-3f382c6f5494.jpg.webp\" alt=\"Getty Images Valerii Zaluzhnyi speaks at a conference. He is wearing military fatigues and has a microphone. \"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eGen Valerii Zaluzhnyi could be a rival to President Zelensky were he to run in any future election, some polls suggest\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn the wake of Trump\u0026#39;s comments, some major Russian media outlets seized on the claim and cited a poll carried out by Ukrainian MP and Zelensky critic, Oleksandr Dubinsky, on Telegram which they claimed backed up Trump\u0026#39;s assessment.\u003c/p\u003e\u003cp\u003eDubinsky \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/world-europe-67425906\"\u003ehas been charged with treason in Ukraine\u003c/a\u003e, and accused of \u0026#34;operating at the behest of Russian intelligence\u0026#34; - which he denies.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eClaim: \u0026#39;You should have never started it\u0026#39;\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUkrainian authorities expressed dissatisfaction over not being part of Tuesday\u0026#39;s talks in Riyadh. But Trump dismissed these concerns, telling reporters that Ukraine had had three years to end the war, before appearing to blame Kyiv for starting the conflict.\u003c/p\u003e\u003cp\u003e\u0026#34;You should have never started it,\u0026#34; he said. The Kremlin has previously accused Ukraine of starting the war against Russia.\u003c/p\u003e\u003cp\u003e\u0026#34;It was they who started the war in 2014. Our goal is to stop this war. And we did not start this war in 2022,\u0026#34; Russian President Vladimir Putin told US talk show host Tucker Carlson in February 2024.\u003c/p\u003e\u003cp\u003eUkraine didn\u0026#39;t start the war. Russia launched a full-scale invasion of Ukraine in February 2022, having annexed Crimea in 2014.\u003c/p\u003e\u003cp\u003eThe annexation came after Ukraine\u0026#39;s pro-Russian president was ousted by popular demonstrations.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cd0n5e1pdz9o\"\u003eTrump says Ukraine could have made a deal earlier\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/c3w16z7dvz7o\"\u003eRosenberg: How Putin and Trump shook up the world in a week\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/c743jl8k4kko\"\u003eWho was at the table at US-Russia talks in Saudi Arabia?\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eRussia also backed proxy forces who seized areas of eastern Ukraine, and it accused the new government in Kyiv of discrimination and genocide against Russian speakers. The \u003ca target=\"_blank\" href=\"https://www.icj-cij.org/public/files/case-related/182/182-20220316-ORD-01-00-EN.pdf\"\u003eInternational Court of Justice\u003c/a\u003e has rejected Moscow\u0026#39;s claims.\u003c/p\u003e\u003cp\u003eAfter the failure of agreements which aimed to end the post-2014 conflict - Russia began a massive build-up of troops on its border with Ukraine in late 2021.\u003c/p\u003e\u003cp\u003ePutin launched the invasion on 24 February 2022, stating that the aim of the operation was to \u0026#34;demilitarise and denazify\u0026#34; the pro-Western government of Volodymyr Zelensky and prevent the country from joining Nato.\u003c/p\u003e\u003cp\u003eIn Ukraine\u0026#39;s last parliamentary elections, \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/64718139\"\u003esupport for far-right candidates was 2%\u003c/a\u003e. It should also be noted that Zelensky is Jewish and that his party has been regarded as centrist.\u003c/p\u003e\u003cp\u003eAnd while Nato officials said in 2021 that Ukraine was a candidate to join the Western alliance in the future, it was not part of any formal process.\u003c/p\u003e\u003cp\u003e\u003ci id=\"additional-reporting-by-bbc-monitoring.\"\u003eAdditional reporting by BBC Monitoring. \u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7a0c/live/c1979800-eeba-11ef-bd1b-d536627785f2.png.webp\" alt=\"The BBC Verify logo\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-19T12:37:01.272Z",
  "modifiedTime": null
}
