{
  "id": "2fc0b975-fe79-43af-963d-738affae690e",
  "title": "India is staring at an 'oil shock' as U.S. sanctions on Russian crude loom",
  "link": "https://www.cnbc.com/2025/01/17/us-sanctions-on-russian-oil-india-impact.html",
  "description": "India is now staring at the possibility of an oil shock after the U.S. decided to implement sweeping sanctions on Russia's oil industry.",
  "author": "",
  "published": "Fri, 17 Jan 2025 06:20:44 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Lee Ying Shan",
  "length": 7303,
  "excerpt": "India is now staring at the possibility of an oil shock after the U.S. decided to implement sweeping sanctions on Russia's oil industry.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Russia's President Vladimir Putin (R) speaks with India's Prime Minister Narendra Modi (L) during a visit to the shipyard Zvezda, as Rosneft Russian oil giant chief Igor Sechin (C) accompanies them, outside the far-eastern Russian port of Vladivostok on September 4, 2019, ahead of the start of the Eastern Economic Forum hosted by Russia. Alexander Nemenov | Afp | Getty ImagesIndia's days of buying cheap Russian oil could be over.Sweeping sanctions by the U.S. against Russia's energy companies and operators of vessels that transport oil will complicate Indian efforts to keep importing cheap Russian crude and could push up inflation in Asia's third-largest economy, analysts said.The country could be looking at a potential oil shock, said Bob McNally, president of Rapidan Energy Group.\"India will be more affected than China by sanctions, since India imports much greater amount of its oil from Russia than China,\" he told CNBC.Last Friday, the U.S. Treasury announced sanctions on two Russian oil producers, along with 183 vessels which are primarily oil tankers that have been shipping barrels of Russian crude. At present, tankers sanctioned by the U.S. are still permitted to offload crude oil until March 12.The South Asian nation imported a significant 88% of its oil needs between April and November 2024, little changed from a year earlier, according to government data. Around 40% of those imports came from Russia, data from trade intelligence firm Kpler showed. Out of the newly sanctioned 183 tankers, 75 of them have transported Russian oil to India in the past, according to data provided by Kpler. Just last year alone, the 183 sanctioned tankers transported around 687 million barrels of crude, of which 30% were shipped to India.\"Most of these barrels went to Indian refiners and, hence, the impact will likely be largest there,\" BNP Paribas' senior commodities strategist Aldo Spanier said in a research note following the sanctions.The new U.S. sanctions were deeper and broader than foreseen by markets, and the disruptions are expected to amplify, Spanier added.India's Ministry of Petroleum and Natural Gas did not respond to a CNBC request for comment.Stock Chart IconStock chart iconOil prices year-on-yearThe sanctions are also coming at a time when India is tipped to surpass China as the number one oil consumer in the world in 2025, accounting for 25% of total oil consumption growth globally.Increasing demand for transportation fuels and home cooking fuels is set to spur this growth of 330,000 barrels per day this year — the most of any country, forecasts by the U.S. Energy Information Administration showed. India consumed 5.3 million barrels per day in 2023, EIA's most recent data showed. This consumption is expected to have increased by 220,000 barrels per day last year.India wasn't always this dependent on Russian oil.As recently as 2021, Russian oil accounted for just 12% of India's oil imports by volume. By 2024, that share had spiked to 37.6%, Muyu Xu, senior oil analyst at Kpler told CNBC.The catalyst for increased oil imports was the Ukraine war, which prompted some Western countries to impose sanctions against Russia and curtail their purchases of Russian crude. As prices of Russian oil fell, India was able to hoover up supplies cheaply from companies that were not under sanctions.The discount of Russia's crude, Urals, to the global benchmark Brent has averaged around $12 per barrel from last August to October, according to S\u0026P Global's most recently published data last November. In 2024, Russia's Urals were also cheaper by $4 per barrel compared to oil from Iraq, one of India's main sources of crude oil imports, data from Kpler showed.\"If India were to fully comply with U.S. sanctions, we could see a sharp decline in Russian crude arrivals in February and potentially March,\" Xu added.Supply disruptions to India could be as high as 500,000 barrels per day, Rystad Energy's senior analyst Viktor Kurilov shared via email.No more cheap alternatives?While the impact may eventually be mitigated as affected importers scramble to source alternative suppliers in the Middle East, some industry watchers say that the relief might still take a few weeks to months to materialize.Even then, the price of oil from these alternative sources will not be as cheap. The world's crude benchmark Brent recently advanced to a five-month high to around $80 per barrel following the announcement of the sanctions, after a year of languishing from oversupply and weak demand.Prices of Middle Eastern crude, which are amongst India's alternatives, have also surged this week, data provided by Kpler suggested.\"Depending on how quickly Russia resolves its logistical challenges and how cooperative India and China remain with the sanctions, oil prices could spike for a few weeks,\" Kpler's Xu said.Additionally, as Donald Trump's inauguration draws closer, the world's supply of cheap Iranian crude, is also facing the risk of tighter sanctions. Iran made up 4% of the world's oil production in 2023, according to an EIA report released last year.\"It is [also] a bit of a double whammy for the key importer [India] as Iran will likely face new sanctions pressure with the incoming Trump administration,\" Helima Croft, global head of commodity strategy at RBC Capital Markets, told CNBC.If the new sanctions are coupled with a potential curb on Iranian crude, Brent prices could rise even higher to $90 per barrel, Goldman Sachs wrote in a note published after the announcement of the sanctions.An Indian economy pain pointThe Indian economy is \"significantly vulnerable\" to fluctuations in oil prices, a research paper published in 2023 established. Domestic retail prices of gasoline and diesel surge \"like rockets\" in response to rising crude oil prices, Abdhut Deheri, assistant economics professor at the Vellore Institute of Technology and M. Ramachandran from Pondicherry University's department of economics said in the research paper.Analysis from the Reserve Bank of India in 2019 found that every $10 per barrel rise in oil prices could lead to a 0.4% increase in headline inflation. \"High oil prices, if passed to consumers, could further hurt their purchasing power at a time when income and GDP growth have slowed,\" Dhiraj Nim, an economist at ANZ. However, weak consumer demand could deter producers from passing on the cost burden to consumers, which means it could dent companies' profits instead, Nim added. Although if the government chooses to shoulder the additional costs, it would strain its finances.Not only will China and India have to pay more for the oil they consume, they will need to pay more to have it delivered to their shores because oil tanker rates have also risen, said Andy Lipow, president of energy consultancy Lipow Oil Associates.Combined with a stronger U.S. dollar and weaker rupee, the impact on the India economy will be magnified, said Lipow. India's rupee recently plunged to a record low as a result of pressure from a strong greenback and selling by foreign portfolio investors. The country is no stranger to protests over high fuel prices. In 2018, widespread protests across the country against record-high petrol and diesel prices led to the closure of businesses and schools  in several regions.",
  "image": "https://image.cnbcfm.com/api/v1/image/108088124-1737094671733-gettyimages-1165923167-AFP_1K00QQ.jpeg?v=1737094708\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108088124\" data-test=\"InlineImage\"\u003e\u003cp\u003eRussia\u0026#39;s President Vladimir Putin (R) speaks with India\u0026#39;s Prime Minister Narendra Modi (L) during a visit to the shipyard Zvezda, as Rosneft Russian oil giant chief Igor Sechin (C) accompanies them, outside the far-eastern Russian port of Vladivostok on September 4, 2019, ahead of the start of the Eastern Economic Forum hosted by Russia. \u003c/p\u003e\u003cp\u003eAlexander Nemenov | Afp | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIndia\u0026#39;s days of buying cheap Russian oil could be over.\u003c/p\u003e\u003cp\u003eSweeping sanctions by the U.S. against Russia\u0026#39;s energy companies and operators of vessels that transport oil will complicate Indian efforts to keep importing cheap Russian crude and could push up inflation in Asia\u0026#39;s third-largest economy, analysts said.\u003c/p\u003e\u003cp\u003eThe country could be looking at a potential oil shock, said Bob McNally, president of Rapidan Energy Group.\u003c/p\u003e\u003cp\u003e\u0026#34;India will be more affected than China by sanctions, since India imports much greater amount of its oil from Russia than China,\u0026#34; he told CNBC.\u003c/p\u003e\u003cp\u003eLast Friday, the \u003ca href=\"https://www.cnbc.com/2025/01/10/oil-jumps-more-than-4percent-brent-breaks-80-as-traders-worry-about-tougher-russia-sanctions.html\"\u003eU.S. Treasury announced sanctions on two Russian oil producers\u003c/a\u003e, along with 183 vessels which are primarily oil tankers that have been shipping barrels of Russian crude. At present, tankers sanctioned by the U.S. are still \u003ca href=\"https://home.treasury.gov/news/press-releases/jy2777\" target=\"_blank\"\u003epermitted to offload crude oil until March 12\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe South Asian nation \u003ca href=\"https://ppac.gov.in/download.php?file=whatsnew/1734692384_Snapshot-of-India-Oil-and-Gas-data-Nov-2024_Final_01.pdf\" target=\"_blank\"\u003eimported a significant 88% of its oil needs\u003c/a\u003e between April and November 2024, little changed from a year earlier, according to government data. Around 40% of those imports came from Russia, data from trade intelligence firm Kpler showed. \u003c/p\u003e\u003cp\u003eOut of the newly sanctioned 183 tankers, 75 of them have transported Russian oil to India in the past, according to data provided by Kpler. Just last year alone, the 183 sanctioned tankers transported around 687 million barrels of crude, of which 30% were shipped to India.\u003c/p\u003e\u003cp\u003e\u0026#34;Most of these barrels went to Indian refiners and, hence, the impact will likely be largest there,\u0026#34; BNP Paribas\u0026#39; senior commodities strategist Aldo Spanier said in a research note following the sanctions.\u003c/p\u003e\u003cp\u003eThe new U.S. sanctions were deeper and broader than foreseen by markets, and the disruptions are expected to amplify, Spanier added.\u003c/p\u003e\u003cp\u003eIndia\u0026#39;s Ministry of Petroleum and Natural Gas did not respond to a CNBC request for comment.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv role=\"button\" tabindex=\"0\"\u003e\u003csvg xmlns=\"http://www.w3.org/2000/svg\" width=\"256\" height=\"256\" viewBox=\"0 0 256 256\" aria-labelledby=\"title desc\" role=\"img\" focusable=\"false\" preserveAspectRatio=\"xMinYMin\"\u003e\u003ctitle\u003eStock Chart Icon\u003c/title\u003e\u003cdesc\u003eStock chart icon\u003c/desc\u003e\u003cg transform=\"translate(1.4065934065934016 1.4065934065934016) scale(2.81 2.81)\"\u003e\u003cpath d=\"M 87.994 0 H 69.342 c -1.787 0 -2.682 2.16 -1.418 3.424 l 5.795 5.795 l -33.82 33.82 L 28.056 31.196 l -3.174 -3.174 c -1.074 -1.074 -2.815 -1.074 -3.889 0 L 0.805 48.209 c -1.074 1.074 -1.074 2.815 0 3.889 l 3.174 3.174 c 1.074 1.074 2.815 1.074 3.889 0 l 15.069 -15.069 l 14.994 14.994 c 1.074 1.074 2.815 1.074 3.889 0 l 1.614 -1.614 c 0.083 -0.066 0.17 -0.125 0.247 -0.202 l 37.1 -37.1 l 5.795 5.795 C 87.84 23.34 90 22.445 90 20.658 V 2.006 C 90 0.898 89.102 0 87.994 0 z\" transform=\" matrix(1 0 0 1 0 0) \" stroke-linecap=\"round\"\u003e\u003c/path\u003e\u003cpath d=\"M 65.626 37.8 v 49.45 c 0 1.519 1.231 2.75 2.75 2.75 h 8.782 c 1.519 0 2.75 -1.231 2.75 -2.75 V 23.518 L 65.626 37.8 z\" transform=\" matrix(1 0 0 1 0 0) \" stroke-linecap=\"round\"\u003e\u003c/path\u003e\u003cpath d=\"M 47.115 56.312 V 87.25 c 0 1.519 1.231 2.75 2.75 2.75 h 8.782 c 1.519 0 2.75 -1.231 2.75 -2.75 V 42.03 L 47.115 56.312 z\" transform=\" matrix(1 0 0 1 0 0) \" stroke-linecap=\"round\"\u003e\u003c/path\u003e\u003cpath d=\"M 39.876 60.503 c -1.937 0 -3.757 -0.754 -5.127 -2.124 l -6.146 -6.145 V 87.25 c 0 1.519 1.231 2.75 2.75 2.75 h 8.782 c 1.519 0 2.75 -1.231 2.75 -2.75 V 59.844 C 41.952 60.271 40.933 60.503 39.876 60.503 z\" transform=\" matrix(1 0 0 1 0 0) \" stroke-linecap=\"round\"\u003e\u003c/path\u003e\u003cpath d=\"M 22.937 46.567 L 11.051 58.453 c -0.298 0.298 -0.621 0.562 -0.959 0.8 V 87.25 c 0 1.519 1.231 2.75 2.75 2.75 h 8.782 c 1.519 0 2.75 -1.231 2.75 -2.75 V 48.004 L 22.937 46.567 z\" transform=\" matrix(1 0 0 1 0 0) \" stroke-linecap=\"round\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/svg\u003e\u003cp\u003e\u003cimg src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eOil prices year-on-year\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe sanctions are also coming at a time when \u003ca href=\"https://www.eia.gov/todayinenergy/detail.php?id=64084\" target=\"_blank\"\u003eIndia is tipped to surpass China\u003c/a\u003e as the number one oil consumer in the world in 2025, accounting for 25% of total oil consumption growth globally.\u003c/p\u003e\u003cp\u003eIncreasing demand for transportation fuels and home cooking fuels is set to spur this growth of 330,000 barrels per day this year — the most of any country, forecasts by the U.S. \u003ca href=\"https://www.eia.gov/todayinenergy/detail.php?id=64084\" target=\"_blank\"\u003eEnergy Information Administration showed\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eIndia consumed 5.3 million barrels per day in 2023, EIA\u0026#39;s most recent data showed. This consumption is expected to have increased by 220,000 barrels per day last year.\u003c/p\u003e\u003cp\u003eIndia wasn\u0026#39;t always this dependent on Russian oil.\u003c/p\u003e\u003cp\u003eAs recently as 2021, Russian oil accounted for just 12% of India\u0026#39;s oil imports by volume. By 2024, that share had spiked to 37.6%, Muyu Xu, senior oil analyst at Kpler told CNBC.\u003c/p\u003e\u003cp\u003eThe catalyst for increased oil imports was the Ukraine war, which prompted some Western countries to impose sanctions against Russia and curtail their purchases of Russian crude. As prices of Russian oil fell, India was able to hoover up supplies cheaply from companies that were not under sanctions.\u003c/p\u003e\u003cp\u003eThe discount of Russia\u0026#39;s crude, Urals, to the global benchmark Brent has averaged around $12 per barrel from last August to October, according to S\u0026amp;P Global\u0026#39;s \u003ca href=\"https://www.spglobal.com/commodity-insights/en/news-research/latest-news/crude-oil/111224-g7-crude-tankers-return-to-russia-as-urals-trades-close-to-price-cap\" target=\"_blank\"\u003emost recently published data\u003c/a\u003e last November. In 2024, Russia\u0026#39;s Urals were also cheaper by $4 per barrel compared to oil from Iraq, one of \u003ca href=\"https://www.nbr.org/publication/oil-for-india/\" target=\"_blank\"\u003eIndia\u0026#39;s main sources of crude oil imports\u003c/a\u003e, data from Kpler showed.\u003c/p\u003e\u003cp\u003e\u0026#34;If India were to fully comply with U.S. sanctions, we could see a sharp decline in Russian crude arrivals in February and potentially March,\u0026#34; Xu added.\u003c/p\u003e\u003cp\u003eSupply disruptions to India could be as high as 500,000 barrels per day, Rystad Energy\u0026#39;s senior analyst Viktor Kurilov shared via email.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eNo more cheap alternatives?\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eWhile the impact may eventually be mitigated as affected importers scramble to source alternative suppliers in the Middle East, some industry watchers say that the relief might still take a few weeks to months to materialize.\u003c/p\u003e\u003cp\u003eEven then, the price of oil from these alternative sources will not be as cheap. The world\u0026#39;s crude benchmark Brent recently advanced to a five-month high to around $80 per barrel following the announcement of the sanctions, after a year of languishing from oversupply and weak demand.\u003c/p\u003e\u003cp\u003ePrices of Middle Eastern crude, which are amongst India\u0026#39;s alternatives, have also surged this week, data provided by Kpler suggested.\u003c/p\u003e\u003cp\u003e\u0026#34;Depending on how quickly Russia resolves its logistical challenges and how cooperative India and China remain with the sanctions, oil prices could spike for a few weeks,\u0026#34; Kpler\u0026#39;s Xu said.\u003c/p\u003e\u003cp\u003eAdditionally, as Donald Trump\u0026#39;s inauguration draws closer, the world\u0026#39;s supply of cheap Iranian crude, is also facing the risk of tighter sanctions. Iran \u003ca href=\"https://www.eia.gov/tools/faqs/faq.php?id=709\u0026amp;amp;t=6\" target=\"_blank\"\u003emade up 4% of the world\u0026#39;s oil production\u003c/a\u003e in 2023, according to an EIA report released last year.\u003c/p\u003e\u003cp\u003e\u0026#34;It is [also] a bit of a double whammy for the key importer [India] as Iran will likely face new sanctions pressure with the incoming Trump administration,\u0026#34; Helima Croft, global head of commodity strategy at RBC Capital Markets, told CNBC.\u003c/p\u003e\u003cp\u003eIf the new sanctions are coupled with a potential curb on Iranian crude, Brent prices could rise even higher to $90 per barrel, Goldman Sachs wrote in a note published after the announcement of the sanctions.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eAn Indian economy pain point\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eThe Indian economy is \u0026#34;significantly vulnerable\u0026#34; to fluctuations in oil prices, \u003ca href=\"https://www.sciencedirect.com/science/article/abs/pii/S1703494923000117\" target=\"_blank\"\u003ea research paper published in 2023 established\u003c/a\u003e. Domestic retail prices of gasoline and diesel surge \u0026#34;like rockets\u0026#34; in response to rising crude oil prices, Abdhut Deheri, assistant economics professor at the Vellore Institute of Technology and M. Ramachandran from Pondicherry University\u0026#39;s department of economics said in the research paper.\u003c/p\u003e\u003cp\u003eAnalysis from the Reserve Bank of India in 2019 found that every $10 per barrel rise in oil prices \u003ca href=\"https://openknowledge.worldbank.org/server/api/core/bitstreams/26cee11a-e560-5be3-8619-86c31243f738/content\" target=\"_blank\"\u003ecould lead to a 0.4% increase in headline inflation\u003c/a\u003e. \u003c/p\u003e\u003cp\u003e\u0026#34;High oil prices, if passed to consumers, could further hurt their purchasing power at a time when income and GDP growth have slowed,\u0026#34; Dhiraj Nim, an economist at ANZ. \u003c/p\u003e\u003cp\u003eHowever, weak consumer demand could deter producers from passing on the cost burden to consumers, which means it could dent companies\u0026#39; profits instead, Nim added. Although if the government chooses to shoulder the additional costs, it would strain its finances.\u003c/p\u003e\u003cp\u003eNot only will China and India have to pay more for the oil they consume, they will need to pay more to have it delivered to their shores because oil tanker rates have also risen, said Andy Lipow, president of energy consultancy Lipow Oil Associates.\u003c/p\u003e\u003cp\u003eCombined with a stronger U.S. dollar and weaker rupee, the impact on the India economy will be magnified, said Lipow. \u003c/p\u003e\u003cp\u003eIndia\u0026#39;s rupee recently plunged to a record low as a result of \u003ca href=\"https://www.cnbc.com/2025/01/09/dollar-rise-impact-on-china-yuan-rupee-won-yen.html\"\u003epressure from a strong greenback and selling by foreign portfolio investors.\u003c/a\u003e \u003c/p\u003e\u003cp\u003eThe country is no stranger to protests over high fuel prices. In 2018, \u003ca href=\"https://www.reuters.com/article/india-election-protests/india-govt-under-fire-over-fuel-prices-opposition-unites-for-protests-idUKL3N1VW2M3/\" target=\"_blank\"\u003ewidespread protests across the country\u003c/a\u003e against record-high petrol and diesel prices led to the closure of businesses and schools  in several regions.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-17T06:06:36Z",
  "modifiedTime": "2025-01-17T06:20:44Z"
}
