{
  "id": "328cdc4a-1205-4248-9f11-61ad53c63eb5",
  "title": "Yuri Grigorovich, Considered Among Greatest Choreographers Ever, Dies At 98",
  "link": "https://www.ndtv.com/world-news/russian-ballet-maestro-yuri-grigorovich-dies-at-98-8454948#publisher=newsstand",
  "description": "Russian ballet maestro Yuri Grigorovich, considered one of the greatest choreographers of the 20th century, has died at the age of 98, the Bolshoi Theatre said on Monday.",
  "author": "",
  "published": "Tue, 20 May 2025 00:52:18 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Reuters",
  "length": 3624,
  "excerpt": "Russian ballet maestro Yuri Grigorovich, considered one of the greatest choreographers of the 20th century, has died at the age of 98, the Bolshoi Theatre said on Monday.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Quick Reads Summary is AI generated, newsroom reviewed. Russian ballet maestro Yuri Grigorovich has died at 98, Bolshoi Theatre says.He served as artistic director of the Bolshoi Ballet from 1964 to 1995.Grigorovich was known for ballets like Spartacus and Romeo and Juliet. Moscow: Russian ballet maestro Yuri Grigorovich, considered one of the greatest choreographers of the 20th century, has died at the age of 98, the Bolshoi Theatre said on Monday.Grigorovich, artistic director of the Bolshoi Ballet in Moscow from 1964-1995, was famed for productions of Spartacus, Ivan the Terrible, Romeo and Juliet and many other ballets. He was especially celebrated for his focus on the male dancer, for whom he made roles requiring extraordinary strength and technique.His friend Nina Alovert, a celebrated dance photographer, posted a memoir on Facebook in which she called him \"the love of my life in the ballet world\".In Spartacus, she said, he created \"a powerful ballet epic, which shows a hero who has set himself in opposition to a gigantic and soulless state machine. This theme was absolutely unusual for Soviet society, where the individual was always diminished.\"Natalia Beizerova, a Russian ballet lover and blogger, told Reuters: \"Each of his ballets is a box of philosophical thoughts ... His silent ballets say more than any words, this is his absolute genius.\"Grigorovich was born in 1927, a decade after the Bolshevik Revolution, and ballet was always part of his life - his uncle Georgy Rozai had studied with the legendary dancer Vaslav Nijinsky. Grigorovich performed as a soloist with Leningrad's Kirov ballet before becoming a choreographer.During his long tenure at the Bolshoi, it staged frequent international tours and enhanced its reputation as one of the world's great companies. But the 1991 collapse of the Soviet Union brought uncertainty, financial worries, internal rows and a flight of talent abroad.DANCERS' STRIKEIn 1995, Grigorovich resigned after months of conflict with management over performers' contracts, triggering the first dancers' strike at the Bolshoi in its more than 200-year history. As the lights dimmed at the start of a scheduled performance, a dancer stepped through the curtain to tell the stunned audience there would be no show that night.Grigorovich created a new ballet company in Krasnodar, southern Russia, although he eventually returned to the Bolshoi in 2008 to work again as a choreographer and ballet master.He won the highest Russian and Soviet awards, including People's Artist of the USSR and Hero of Socialist Labour.By coincidence, his death was announced on the same day as that of one of his favourite dancers, Yuri Vladimirov, who was 83.Grigorovich's wife Natalia Bessmertnova, a prima ballerina at the Bolshoi, died of cancer in 2008. In 2017, the Bolshoi marked his 90th birthday with two months of special performances.Valery Gergiev, head of the Bolshoi and Mariinsky theatres, told Izvestia newspaper that Grigorovich was \"a legendary figure who will continue to command respect and admiration for decades to come\".The Bolshoi said in a statement that it would \"faithfully cherish his memory and protect his priceless legacy\". (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2025-05/jleib494_russian-choreographer-yuri-grigorovich-afp_625x300_19_May_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                        \u003cdiv\u003e\n                \u003cdiv\u003e\n                            \u003cp\u003eQuick Reads\u003c/p\u003e\n                                \u003cp\u003e\n                                    Summary is AI generated, newsroom reviewed.\n                                \u003c/p\u003e\n                            \u003c/div\u003e\n                \u003cdiv\u003e\u003cp\u003eRussian ballet maestro Yuri Grigorovich has died at 98, Bolshoi Theatre says.\u003c/p\u003e\u003cp\u003eHe served as artistic director of the Bolshoi Ballet from 1964 to 1995.\u003c/p\u003e\u003cp\u003eGrigorovich was known for ballets like Spartacus and Romeo and Juliet.\u003c/p\u003e\u003c/div\u003e\n                                                                        \n        \u003c/div\u003e                                                                                \u003cp\u003e\u003cb\u003eMoscow: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eRussian ballet maestro Yuri Grigorovich, considered one of the greatest choreographers of the 20th century, has died at the age of 98, the Bolshoi Theatre said on Monday.\u003c/p\u003e\u003cp\u003eGrigorovich, artistic director of the Bolshoi Ballet in Moscow from 1964-1995, was famed for productions of Spartacus, Ivan the Terrible, Romeo and Juliet and many other ballets. He was especially celebrated for his focus on the male dancer, for whom he made roles requiring extraordinary strength and technique.\u003c/p\u003e\u003cp\u003eHis friend Nina Alovert, a celebrated dance photographer, posted a memoir on Facebook in which she called him \u0026#34;the love of my life in the ballet world\u0026#34;.\u003c/p\u003e\u003cp\u003eIn Spartacus, she said, he created \u0026#34;a powerful ballet epic, which shows a hero who has set himself in opposition to a gigantic and soulless state machine. This theme was absolutely unusual for Soviet society, where the individual was always diminished.\u0026#34;\u003c/p\u003e\u003cp\u003eNatalia Beizerova, a Russian ballet lover and blogger, told Reuters: \u0026#34;Each of his ballets is a box of philosophical thoughts ... His silent ballets say more than any words, this is his absolute genius.\u0026#34;\u003c/p\u003e\u003cp\u003eGrigorovich was born in 1927, a decade after the Bolshevik Revolution, and ballet was always part of his life - his uncle Georgy Rozai had studied with the legendary dancer Vaslav Nijinsky. Grigorovich performed as a soloist with Leningrad\u0026#39;s Kirov ballet before becoming a choreographer.\u003c/p\u003e\u003cp\u003eDuring his long tenure at the Bolshoi, it staged frequent international tours and enhanced its reputation as one of the world\u0026#39;s great companies. But the 1991 collapse of the Soviet Union brought uncertainty, financial worries, internal rows and a flight of talent abroad.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eDANCERS\u0026#39; STRIKE\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eIn 1995, Grigorovich resigned after months of conflict with management over performers\u0026#39; contracts, triggering the first dancers\u0026#39; strike at the Bolshoi in its more than 200-year history. As the lights dimmed at the start of a scheduled performance, a dancer stepped through the curtain to tell the stunned audience there would be no show that night.\u003c/p\u003e\u003cp\u003eGrigorovich created a new ballet company in Krasnodar, southern Russia, although he eventually returned to the Bolshoi in 2008 to work again as a choreographer and ballet master.\u003c/p\u003e\u003cp\u003eHe won the highest Russian and Soviet awards, including People\u0026#39;s Artist of the USSR and Hero of Socialist Labour.\u003c/p\u003e\u003cp\u003eBy coincidence, his death was announced on the same day as that of one of his favourite dancers, Yuri Vladimirov, who was 83.\u003c/p\u003e\u003cp\u003eGrigorovich\u0026#39;s wife Natalia Bessmertnova, a prima ballerina at the Bolshoi, died of cancer in 2008. In 2017, the Bolshoi marked his 90th birthday with two months of special performances.\u003c/p\u003e\u003cp\u003eValery Gergiev, head of the Bolshoi and Mariinsky theatres, told Izvestia newspaper that Grigorovich was \u0026#34;a legendary figure who will continue to command respect and admiration for decades to come\u0026#34;.\u003c/p\u003e\u003cp\u003eThe Bolshoi said in a statement that it would \u0026#34;faithfully cherish his memory and protect his priceless legacy\u0026#34;.\u003cbr/\u003e \u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                                                                \n                                                                                \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-19T20:11:39+05:30",
  "modifiedTime": null
}
