{
  "id": "39638475-ec70-4eca-8830-8517d1a05f4c",
  "title": "Canada Ex-Central Banker Mark Carney Launches PM Bid",
  "link": "https://www.ndtv.com/world-news/canada-ex-central-banker-mark-carney-launches-pm-bid-7491725",
  "description": "Mark Carney, the former governor of Canada's central bank, on Thursday launched his bid to succeed Justin Trudeau as Liberal Party leader and prime minister, immediately becoming a frontrunner in the race.",
  "author": "",
  "published": "Fri, 17 Jan 2025 04:56:24 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 2150,
  "excerpt": "Mark Carney, the former governor of Canada\u0026#039;s central bank, on Thursday launched his bid to succeed Justin Trudeau as Liberal Party leader and prime minister, immediately becoming a frontrunner in the race.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Ottawa: Mark Carney, the former governor of Canada's central bank, on Thursday launched his bid to succeed Justin Trudeau as Liberal Party leader and prime minister, immediately becoming a frontrunner in the race.The 59-year-old Harvard- and Oxford-educated economist kicked off his campaign at a hockey rink in Edmonton, Alberta where he grew up.\"I'm doing this because Canada is the best country in the world, but it still could be even better,\" Carney told a crowd of supporters.Pitching himself as an outsider and an unconventional politician with strong economic chops, he vowed to get the Canadian economy \"back on track\" and beat back Donald Trump's tariffs threat.Carney is expected to go head-to-head with his friend, former deputy prime minister Chrystia Freeland, who is scheduled to announce her leadership bid on Sunday.Freeland's surprise resignation in December, after clashing with her boss over how to respond to Trump's threat to impose 25 percent tariffs on Canadian imports, precipitated a political crisis that saw Trudeau last week announce he was quitting too.Whoever wins the leadership will automatically become prime minister and inherit a party that is 20 points behind the Conservatives led by Pierre Poilievre in the polls. They could also face snap elections as early as March.A relative unknown to most Canadians, on Thursday Carney immediately went on the offensive against Poilievre, accusing him of putting forward \"bad ideas, naive and dangerous ideas.\"At the same time, the former UN special envoy on climate action acknowledged that Canada's climate measures such as a carbon levy -- which Poilievre wants to scrap -- have not worked for all Canadians.Meanwhile, in a recent appearance on \"The Daily Show\" Carney playfully pushed back at Trump's unlikely plan for Canada to become the 51st US state, telling host Jon Stewart: \"We're not moving in with you.\"\"We can be friends,\" he added. \"Friends with benefits.\"Stewart responded that he felt like Carney was breaking up with him during the interview.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2025-01/1i6gdak4_mark-carney_625x300_17_January_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eOttawa: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eMark Carney, the former governor of Canada\u0026#39;s central bank, on Thursday launched his bid to succeed Justin Trudeau as Liberal Party leader and prime minister, immediately becoming a frontrunner in the race.\u003c/p\u003e\u003cp\u003eThe 59-year-old Harvard- and Oxford-educated economist kicked off his campaign at a hockey rink in Edmonton, Alberta where he grew up.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m doing this because Canada is the best country in the world, but it still could be even better,\u0026#34; Carney told a crowd of supporters.\u003c/p\u003e\u003cp\u003ePitching himself as an outsider and an unconventional politician with strong economic chops, he vowed to get the Canadian economy \u0026#34;back on track\u0026#34; and beat back Donald Trump\u0026#39;s tariffs threat.\u003c/p\u003e\u003cp\u003eCarney is expected to go head-to-head with his friend, former deputy prime minister Chrystia Freeland, who is scheduled to announce her leadership bid on Sunday.\u003c/p\u003e\u003cp\u003eFreeland\u0026#39;s surprise resignation in December, after clashing with her boss over how to respond to Trump\u0026#39;s threat to impose 25 percent tariffs on Canadian imports, precipitated a political crisis that saw Trudeau last week announce he was quitting too.\u003c/p\u003e\u003cp\u003eWhoever wins the leadership will automatically become prime minister and inherit a party that is 20 points behind the Conservatives led by Pierre Poilievre in the polls. They could also face snap elections as early as March.\u003c/p\u003e\u003cp\u003eA relative unknown to most Canadians, on Thursday Carney immediately went on the offensive against Poilievre, accusing him of putting forward \u0026#34;bad ideas, naive and dangerous ideas.\u0026#34;\u003c/p\u003e\u003cp\u003eAt the same time, the former UN special envoy on climate action acknowledged that Canada\u0026#39;s climate measures such as a carbon levy -- which Poilievre wants to scrap -- have not worked for all Canadians.\u003c/p\u003e\u003cp\u003eMeanwhile, in a recent appearance on \u0026#34;The Daily Show\u0026#34; Carney playfully pushed back at Trump\u0026#39;s unlikely plan for Canada to become the 51st US state, telling host Jon Stewart: \u0026#34;We\u0026#39;re not moving in with you.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We can be friends,\u0026#34; he added. \u0026#34;Friends with benefits.\u0026#34;\u003c/p\u003e\u003cp\u003eStewart responded that he felt like Carney was breaking up with him during the interview.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-17T04:56:24+05:30",
  "modifiedTime": null
}
