{
  "id": "419ff341-74b9-46b9-8efe-fe62f873840e",
  "title": "DC winter snow storm: Timing, how much to expect by Monday",
  "link": "https://www.yahoo.com/news/dc-winter-snow-storm-timing-221724899.html",
  "description": "",
  "author": "",
  "published": "2025-01-02T22:17:24Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Mike Thomas",
  "length": 7242,
  "excerpt": "A storm system is expected to move through the Plains and Midwest this weekend, potentially bringing our most meaningful snowfall in years.",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "The BriefA storm system headed towards the D.C. region could bring a decent shot of more than 6 inches of snow to the area.The storm system is expected Sunday night, after a weekend of freezing temperatures.The FOX 5 Weather Team is continuing to monitor the potential for snow and their impact to closures Monday.WASHINGTON - A storm system is expected to move through the Plains and Midwest this weekend, potentially bringing our most meaningful snowfall in years.A Weather Model Shows The Threat For Snow Showers and Snow Squalls in the DC Region on Friday Afternoon.What to expect Friday?On Friday, a powerful cold front will sweep the region during the afternoon. This is the leading edge of some much colder air that will be heading into the D.C. region ahead of the weekend. High temperatures will go from being seasonable for early January in the lower to middle 40s, to high temperatures only in the lower to middle 30s through the weekend. Overnight low temperatures will plummet as well, with overnight lows falling back into the teens and 20s for both Saturday and Sunday mornings.Weather Model Shows The Threat For A Light Coating Of Snow On Friday Afternoon.The big story of the weekend is the cold. The vast majority of the weekend will be dry, with clouds battling sunshine from time to time and temperatures struggling to make it far above freezing each afternoon. The cold is key, because it is what we call \"preparing the ground for snow\" by the end of the weekend. By cooling the ground temperature below freezing across the region through the weekend, this means that once the snow starts falling it should stick almost immediately instead of losing some to initial snow melt. The snow could start falling as early as Sunday night across the D.C. region.Cold Air Will Be Reinforced Friday As A Powerful Cold Front Sweeps The RegionWhat is a snow squall?Models are suggesting a period of widespread snow showers and the potential for snow squalls as it passes through the region. Sometimes referred to as \"mini blizzards\"...a snow squall is a brief but intense period of snowfall that can reduce visibility and lead to a quick coating to an inch or more of snow in a very short period of time. They tend to move on as quickly as they begin. They are a hazard to travelers though as roads can quickly become snow covered as they roll through, though they tend to clear quickly after they pass.Most weather models are showing this as being a threat at this time, though no weather models show heavy amounts of snow on the ground, most do show the threat for a quick coating to an inch or so across much of the D.C. area. While it is not expected to be a long-lasting impact event, it is important that folks understand that as these snow showers cross over the D.C. region they could come down briefly heavy. Most squalls last only about 20-30 minutes however, and end as quickly as they begin. Cold and dry air behind the front should cause skies to rapidly clear Friday night, and temperatures will plummet into the weekend.The European Weather Model forecasting snowfall across the DC region early Monday morning.When will the snow start in D.C.?Computer weather model guidance does differ on the timing of exactly when the snow will start to fall in the D.C. region, but the weather team is leaning towards a start on Sunday night, possibly sometime after 6:00 p.m. The exact timing should come into view in the days ahead. Snow is expected to be heaviest during the overnight and early morning hours of Monday.Forecast Calling For A Cold, But Mostly Dry Weekend In DC, With Snow Starting Later Sunday NightWill schools close on Monday?Next week is supposed to be when most of the region heads back to school and work after the holiday vacation period comes to an end. Assuming the forecast holds however, it is very likely that students across our region may add an additional day or two to their vacations given the timing of this storm system.Find the latest school closings here.Forecasts Show High Probability of Cold across the Eastern United States through Mid-JanuaryHow much snow is expected? DC, Virginia, Maryland forecastWeather models have shown various solutions over the past couple of days. Just about all of them have at least a couple inches of snow in the DC region, though numbers in some of the more reliable guidance have been higher, with some indicating the potential for over half a foot of snow in and around the immediate DC region.While numbers can and probably will change in the days ahead, most of Maryland, D.C., and Northern Virginia should expect around 4-8\". Communities closer to Charlottesville and Richmond in southern Virginia could receive 2\".Some areas in West Virginia may see as much as 12\", but we are still monitoring for the threat of a bit of a northern shift in the guidance.We could see more mixing than models show with a sneaky warm nose.The boom upside for most of the region is in the 6-10\" range, and the bust downside is in the 1-3\" range.The highest totals will probably land somewhere north of I-70 and the PA turnpike.We really have to monitor the trends with the system over the next couple of days though, as some have suggested some mixed precipitation is possible, which would cut down on some of the expected totals.First call snow totals show 4-8\" for much of the region, with a potential northern shift in totals.Despite these high totals, there are no indications that this would approach blizzard criteria for the D.C. region, as the storm is not rapidly intensifying and winds are not expected to be overly strong with this system. We believe that the threat for over a foot of snow in D.C. proper is relatively low with this system.When was the last time D.C. saw a snowstorm?It has three years since the Washington, D.C. metro region was last impacted by a storm that brought over half a foot of snow. On January 3, 2022 a post-New Year's snowstorm blanketed most of the D.C. region in four to eight inches of snowfall, with parts of southern Maryland picking up over a foot of snow. The storm famously shut down I-95 in Virginia, stranding some motorist on the highway for over 24 hours.The FOX 5 Weather Team has been closely monitoring the forecast progression of the storm system moving towards the D.C. region this weekend, which may be our most meaningful snowfall since that system three years ago.The FOX 5 Weather Team will continue to provide update on this storm in the days ahead, and will continue to refine timing and snowfall totals as well. We should have a good idea of what we are expecting across our region by Saturday. Regardless of how much snow does fall, confidence is high on a period of very cold air settling in across the eastern half of the country behind this system. It could end being our coldest period of the entire winter. Whether or not more snow risks will show up within this cold period remains to be seen, but lets focus on one system at a time.Stay Ahead of winter weather on FOX Local, with live exclusive updates every day at 7:30 p.m. ahead of this storm system. Here's how to watch FOX Local on your smart TV and on the go. The SourceThis story includes reporting from FOX 5 meteorologist Mike Thomas.html",
  "image": "https://s.yimg.com/ny/api/res/1.2/MuaDnEM71DDYO3PJb_1gaA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzI-/https://media.zenfs.com/en/wttg_fox_local_articles_147/190880a934ea628b22bf5b388ee1fb0f",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003e\u003cstrong\u003eThe Brief\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eA storm system headed towards the D.C. region could bring a decent shot of more than 6 inches of snow to the area.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eThe storm system is expected Sunday night, after a weekend of freezing temperatures.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eThe FOX 5 Weather Team is continuing to monitor the potential for snow and their impact to closures Monday.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eWASHINGTON\u003c/strong\u003e - \u003c/span\u003eA storm system is expected to move through the Plains and Midwest this weekend, potentially bringing our most meaningful snowfall in years.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;A Weather Model Shows The Threat For Snow Showers and Snow Squalls in the DC Region on Friday Afternoon.\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/OSB7cIj0TG_oW1F.mKwlhw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/3306f1abcab1df07db439eed6297d51b\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eA Weather Model Shows The Threat For Snow Showers and Snow Squalls in the DC Region on Friday Afternoon.\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2\u003eWhat to expect Friday?\u003c/h2\u003e\u003cp\u003eOn Friday, a powerful cold front will sweep the region during the afternoon. This is the leading edge of some much colder air that will be heading into the D.C. region ahead of the weekend. High temperatures will go from being seasonable for early January in the lower to middle 40s, to high temperatures only in the lower to middle 30s through the weekend. Overnight low temperatures will plummet as well, with overnight lows falling back into the teens and 20s for both Saturday and Sunday mornings.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;Weather Model Shows The Threat For A Light Coating Of Snow On Friday Afternoon.\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/eqPNcy2K0PT0xreQV8hkVg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/eb1157a09cba8072daa2c5cc3c4aa605\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eWeather Model Shows The Threat For A Light Coating Of Snow On Friday Afternoon.\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe big story of the weekend is the cold. The vast majority of the weekend will be dry, with clouds battling sunshine from time to time and temperatures struggling to make it far above freezing each afternoon. The cold is key, because it is what we call \u0026#34;preparing the ground for snow\u0026#34; by the end of the weekend. By cooling the ground temperature below freezing across the region through the weekend, this means that once the snow starts falling it should stick almost immediately instead of losing some to initial snow melt. The snow could start falling as early as Sunday night across the D.C. region.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;Cold Air Will Be Reinforced Friday As A Powerful Cold Front Sweeps The Region\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/pDXiSeJf_Ds0KvfmSg8hQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/26b5e288306e1cca3596e68696761592\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCold Air Will Be Reinforced Friday As A Powerful Cold Front Sweeps The Region\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3\u003eWhat is a snow squall?\u003c/h3\u003e\u003cp\u003eModels are suggesting a period of widespread snow showers and the potential for snow squalls as it passes through the region. Sometimes referred to as \u0026#34;mini blizzards\u0026#34;...a snow squall is a brief but intense period of snowfall that can reduce visibility and lead to a quick coating to an inch or more of snow in a very short period of time. They tend to move on as quickly as they begin. They are a hazard to travelers though as roads can quickly become snow covered as they roll through, though they tend to clear quickly after they pass.\u003c/p\u003e\u003cp\u003eMost weather models are showing this as being a threat at this time, though no weather models show heavy amounts of snow on the ground, most do show the threat for a quick coating to an inch or so across much of the D.C. area. While it is not expected to be a long-lasting impact event, it is important that folks understand that as these snow showers cross over the D.C. region they could come down briefly heavy. Most squalls last only about 20-30 minutes however, and end as quickly as they begin. Cold and dry air behind the front should cause skies to rapidly clear Friday night, and temperatures will plummet into the weekend.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;The European Weather Model forecasting snowfall across the DC region early Monday morning.\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/CsiX0YvdyUv_G5PsVFLulg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/7263591d94fb228b35aa8ee2422629d4\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eThe European Weather Model forecasting snowfall across the DC region early Monday morning.\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2\u003eWhen will the snow start in D.C.?\u003c/h2\u003e\u003cp\u003eComputer weather model guidance does differ on the timing of exactly when the snow will start to fall in the D.C. region, but the weather team is leaning towards a start on Sunday night, possibly sometime after 6:00 p.m. The exact timing should come into view in the days ahead. Snow is expected to be heaviest during the overnight and early morning hours of Monday.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;Forecast Calling For A Cold, But Mostly Dry Weekend In DC, With Snow Starting Later Sunday Night\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/lhGVeqFdu.d7QvJbsWqIjw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/f793308ee7cdbb88954786ebba955a08\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eForecast Calling For A Cold, But Mostly Dry Weekend In DC, With Snow Starting Later Sunday Night\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2\u003eWill schools close on Monday?\u003c/h2\u003e\u003cp\u003eNext week is supposed to be when most of the region heads back to school and work after the holiday vacation period comes to an end. Assuming the forecast holds however, it is very likely that students across our region may add an additional day or two to their vacations given the timing of this storm system.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.fox5dc.com/closings\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Find the latest school closings here.;elm:context_link;itc:0;sec:content-canvas\"\u003eFind the latest school closings here.\u003c/a\u003e\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;Forecasts Show High Probability of Cold across the Eastern United States through Mid-January\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/7pEcnyehnaxMjCUgZ64kkA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/bf9e9213a7b2d3a5c2bbaa693cfa2574\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eForecasts Show High Probability of Cold across the Eastern United States through Mid-January\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2\u003eHow much snow is expected? DC, Virginia, Maryland forecast\u003c/h2\u003e\u003cp\u003eWeather models have shown various solutions over the past couple of days. Just about all of them have at least a couple inches of snow in the DC region, though numbers in some of the more reliable guidance have been higher, with some indicating the potential for over half a foot of snow in and around the immediate DC region.\u003c/p\u003e\u003cp\u003eWhile numbers can and probably will change in the days ahead, most of Maryland, D.C., and Northern Virginia should expect around 4-8\u0026#34;. Communities closer to Charlottesville and Richmond in southern Virginia could receive 2\u0026#34;.\u003c/p\u003e\u003cp\u003eSome areas in West Virginia may see as much as 12\u0026#34;, but we are still monitoring for the threat of a bit of a northern shift in the guidance.\u003c/p\u003e\u003cp\u003eWe could see more mixing than models show with a sneaky warm nose.\u003c/p\u003e\u003cp\u003eThe boom upside for most of the region is in the 6-10\u0026#34; range, and the bust downside is in the 1-3\u0026#34; range.\u003c/p\u003e\u003cp\u003eThe highest totals will probably land somewhere north of I-70 and the PA turnpike.\u003c/p\u003e\u003cp\u003eWe really have to monitor the trends with the system over the next couple of days though, as some have suggested some mixed precipitation is possible, which would cut down on some of the expected totals.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\u0026lt;div\u0026gt;First call snow totals show 4-8\u0026#34; for much of the region, with a potential northern shift in totals.\u0026lt;/div\u0026gt;\" loading=\"lazy\" width=\"960\" height=\"540\" decoding=\"async\" data-nimg=\"1\" src=\"https://s.yimg.com/ny/api/res/1.2/aHYec2WoJvj3nHdOv2qz0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/wttg_fox_local_articles_147/096f9d5bbd2b0e059bc8d28c232f9d6c\"/\u003e\u003c/p\u003e\u003cdialog aria-label=\"Modal Dialog\" aria-modal=\"true\"\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eFirst call snow totals show 4-8\u0026#34; for much of the region, with a potential northern shift in totals.\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eDespite these high totals, there are no indications that this would approach blizzard criteria for the D.C. region, as the storm is not rapidly intensifying and winds are not expected to be overly strong with this system. We believe that the threat for over a foot of snow in D.C. proper is relatively low with this system.\u003c/p\u003e\u003ch2\u003eWhen was the last time D.C. saw a snowstorm?\u003c/h2\u003e\u003cp\u003eIt has three years since the Washington, D.C. metro region was last impacted by a storm that brought over half a foot of snow. On January 3, 2022 a post-New Year\u0026#39;s snowstorm blanketed most of the D.C. region in four to eight inches of snowfall, with parts of southern Maryland picking up over a foot of snow. The storm famously shut down I-95 in Virginia, stranding some motorist on the highway for over 24 hours.\u003c/p\u003e\u003cp\u003eThe FOX 5 Weather Team has been closely monitoring the forecast progression of the storm system moving towards the D.C. region this weekend, which may be our most meaningful snowfall since that system three years ago.\u003c/p\u003e\u003cp\u003eThe FOX 5 Weather Team will continue to provide update on this storm in the days ahead, and will continue to refine timing and snowfall totals as well. We should have a good idea of what we are expecting across our region by Saturday. Regardless of how much snow does fall, confidence is high on a period of very cold air settling in across the eastern half of the country behind this system. It could end being our coldest period of the entire winter. Whether or not more snow risks will show up within this cold period remains to be seen, but lets focus on one system at a time.\u003c/p\u003e\u003cp\u003eStay Ahead of winter weather on FOX Local, with live exclusive updates every day at 7:30 p.m. ahead of this storm system. \u003ca href=\"https://www.fox5dc.com/fox-local\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Here\u0026#39;s how to watch FOX Local on your smart TV and on the go. ;elm:context_link;itc:0;sec:content-canvas\"\u003eHere\u0026#39;s how to watch FOX Local on your smart TV and on the go. \u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Source\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThis story includes reporting from FOX 5 meteorologist Mike Thomas.\u003c/p\u003e\u003cp\u003ehtml\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-02T22:17:24Z",
  "modifiedTime": null
}
