{
  "id": "44279ae4-bf55-4ee9-82d5-7aaf52ae0a72",
  "title": "Israel Expands Operations In Gaza To Dismantle Hamas, Free Hostages",
  "link": "https://www.ndtv.com/world-news/israel-expands-operations-in-gaza-to-dismantle-hamas-free-hostages-8434686#publisher=newsstand",
  "description": "The Israeli Defense Forces (IDF) intensified their military operations in Gaza, launching strikes and mobilising additional troops.",
  "author": "",
  "published": "Sat, 17 May 2025 05:48:11 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 5018,
  "excerpt": "The Israeli Defense Forces (IDF) intensified their military operations in Gaza, launching strikes and mobilising additional troops.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Jerusalem: The Israeli Defense Forces (IDF) intensified their military operations in Gaza, launching strikes and mobilising additional troops.The IDF said that the latest strikes are part of preparations to expand the operations, with key goals including the dismantling of Hamas and the safe return of hostages.Sharing a post on X, the IDF wrote, \"The IDF has begun conducting extensive strikes and mobilising troops to achieve operational control in the areas of Gaza, over the past day. This is part of preparations to expand operations and fulfill the objectives of the war -- including the release of hostages and the dismantling of the Hamas terrorist organisation.\"The post added, \"IDF troops will continue to operate in order to protect Israeli civilians and achieve the objectives of the war.\"⭕️ The IDF has begun conducting extensive strikes and mobilizing troops to achieve operational control in the areas of Gaza, over the past day.This is part of preparations to expand operations and fulfill the objectives of the war — including the release of hostages and the…— Israel Defense Forces (@IDF) May 16, 2025Earlier, the IDF carried out targeted airstrikes on Houthi-controlled infrastructure in Yemen's Hudaydah and Salif ports, claiming the facilities were being used to transfer weapons.\"The IDF struck and dismantled terrorist infrastructure sites belonging to the Houthi terrorist regime in the Hudaydah and Salif Ports in Yemen. These ports are used to transfer weapons and are a further example of the Houthi's systematic and cynical exploitation of civilian infrastructure in order to advance terrorist activities,\" the IDF said in a post on X.It added, \"The strikes were conducted after numerous advanced warnings issued by the IDF to the population in the area in order to mitigate the risk of harm to civilian population in the areas of these sites. Any hostile activity in these ports will continue to be prevented.\"⭕️ The IDF struck and dismantled terrorist infrastructure sites belonging to the Houthi terrorist regime in the Hudaydah and Salif Ports in Yemen.These ports are used to transfer weapons and are a further example of the Houthi's systematic and cynical exploitation of civilian… pic.twitter.com/PGJAB0YenL— Israel Defense Forces (@IDF) May 16, 2025Meanwhile, amid the ongoing Israel-Hamas conflict, US President Donald Trump stressed the importance of addressing the humanitarian situation in Gaza, where many are facing severe food shortages and said that a lot of people are starving in the region.While speaking with reporters aboard Air Force One, Trump said, \"A lot of good things are going to happen over the next month. We have to help out the Palestinians. A lot of people are starving in Gaza, so we have to look at both sides. But we are going to do a good job.\"The World Food Programme (WFP) in a release on Monday had said that the populations across the Gaza Strip are at risk of famine as fighting surged again, border crossings are still closed, and food is dangerously scarce.It further said that hunger and malnutrition intensified sharply since all aid was blocked from entering on March 2.According to the Integrated Food Security Phase Classification (IPC) snapshot released on May 12, 4,70,000 people in Gaza are facing catastrophic hunger (IPC Phase 5), and the entire population is experiencing acute food insecurity.The report warned of a sharp rise in acute malnutrition, projecting that 71,000 children and more than 17,000 mothers will urgently require treatment. At the beginning of 2025, agencies estimated 60,000 children would need treatment.UN World Food Programme's Executive Director Cindy McCain had said, \"Families in Gaza are starving while the food they need is sitting at the border. We can't get it to them because of the renewed conflict and the total ban on humanitarian aid imposed in early March. It's imperative that the international community acts urgently to get aid flowing into Gaza again. If we wait until after a famine is confirmed, it will already be too late for many people.\"The vast majority of children in Gaza are facing extreme food deprivation, as confirmed by 17 UN agencies and NGOs in the IPC report. Coupled with the severely limited access to health services and critical shortages of clean water and sanitation, rapid increases in acute malnutrition are expected in North Gaza, Gaza and Rafah governorates.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day Army Details How 6 Terrorists Were Eliminated In 2 Encounters In J\u0026K",
  "image": "https://c.ndtvimg.com/2024-10/p5kd7dj_israeli-army-in-gaza_625x300_07_October_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                                                        \u003cp\u003e\u003cb\u003eJerusalem: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Israeli Defense Forces (IDF) intensified their military operations in Gaza, launching strikes and mobilising additional troops.\u003c/p\u003e\u003cp\u003eThe IDF said that the latest strikes are part of preparations to expand the operations, with key goals including the dismantling of Hamas and the safe return of hostages.\u003c/p\u003e\u003cp\u003eSharing a post on X, the IDF wrote, \u0026#34;The IDF has begun conducting extensive strikes and mobilising troops to achieve operational control in the areas of Gaza, over the past day. This is part of preparations to expand operations and fulfill the objectives of the war -- including the release of hostages and the dismantling of the Hamas terrorist organisation.\u0026#34;\u003c/p\u003e\u003cp\u003eThe post added, \u0026#34;IDF troops will continue to operate in order to protect Israeli civilians and achieve the objectives of the war.\u0026#34;\u003c/p\u003e\u003cblockquote\u003e\u003cp dir=\"ltr\" lang=\"en\"\u003e⭕️ The IDF has begun conducting extensive strikes and mobilizing troops to achieve operational control in the areas of Gaza, over the past day.\u003cbr/\u003eThis is part of preparations to expand operations and fulfill the objectives of the war — including the release of hostages and the…\u003c/p\u003e— Israel Defense Forces (@IDF) \u003ca href=\"https://twitter.com/IDF/status/1923490625002840522?ref_src=twsrc%5Etfw\"\u003eMay 16, 2025\u003c/a\u003e\u003c/blockquote\u003e\u003cp\u003eEarlier, the IDF carried out targeted airstrikes on Houthi-controlled infrastructure in Yemen\u0026#39;s Hudaydah and Salif ports, claiming the facilities were being used to transfer weapons.\u003c/p\u003e\u003cp\u003e\u0026#34;The IDF struck and dismantled terrorist infrastructure sites belonging to the Houthi terrorist regime in the Hudaydah and Salif Ports in Yemen. These ports are used to transfer weapons and are a further example of the Houthi\u0026#39;s systematic and cynical exploitation of civilian infrastructure in order to advance terrorist activities,\u0026#34; the IDF said in a post on X.\u003c/p\u003e\u003cp\u003eIt added, \u0026#34;The strikes were conducted after numerous advanced warnings issued by the IDF to the population in the area in order to mitigate the risk of harm to civilian population in the areas of these sites. Any hostile activity in these ports will continue to be prevented.\u0026#34;\u003c/p\u003e\u003cblockquote\u003e\u003cdiv dir=\"ltr\" lang=\"en\"\u003e\u003cp\u003e⭕️ The IDF struck and dismantled terrorist infrastructure sites belonging to the Houthi terrorist regime in the Hudaydah and Salif Ports in Yemen.\u003c/p\u003e\u003cp\u003eThese ports are used to transfer weapons and are a further example of the Houthi\u0026#39;s systematic and cynical exploitation of civilian… \u003ca href=\"https://t.co/PGJAB0YenL\"\u003epic.twitter.com/PGJAB0YenL\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e— Israel Defense Forces (@IDF) \u003ca href=\"https://twitter.com/IDF/status/1923403452211732818?ref_src=twsrc%5Etfw\"\u003eMay 16, 2025\u003c/a\u003e\u003c/blockquote\u003e\u003cp\u003eMeanwhile, amid the ongoing Israel-Hamas conflict, US President Donald Trump stressed the importance of addressing the humanitarian situation in Gaza, where many are facing severe food shortages and said that a lot of people are starving in the region.\u003c/p\u003e\u003cp\u003eWhile speaking with reporters aboard Air Force One, Trump said, \u0026#34;A lot of good things are going to happen over the next month. We have to help out the Palestinians. A lot of people are starving in Gaza, so we have to look at both sides. But we are going to do a good job.\u0026#34;\u003c/p\u003e\u003cp\u003eThe World Food Programme (WFP) in a release on Monday had said that the populations across the Gaza Strip are at risk of famine as fighting surged again, border crossings are still closed, and food is dangerously scarce.It further said that hunger and malnutrition intensified sharply since all aid was blocked from entering on March 2.\u003c/p\u003e\u003cp\u003eAccording to the Integrated Food Security Phase Classification (IPC) snapshot released on May 12, 4,70,000 people in Gaza are facing catastrophic hunger (IPC Phase 5), and the entire population is experiencing acute food insecurity.\u003c/p\u003e\u003cp\u003eThe report warned of a sharp rise in acute malnutrition, projecting that 71,000 children and more than 17,000 mothers will urgently require treatment. At the beginning of 2025, agencies estimated 60,000 children would need treatment.\u003c/p\u003e\u003cp\u003eUN World Food Programme\u0026#39;s Executive Director Cindy McCain had said, \u0026#34;Families in Gaza are starving while the food they need is sitting at the border. We can\u0026#39;t get it to them because of the renewed conflict and the total ban on humanitarian aid imposed in early March. It\u0026#39;s imperative that the international community acts urgently to get aid flowing into Gaza again. If we wait until after a famine is confirmed, it will already be too late for many people.\u0026#34;\u003c/p\u003e\u003cp\u003eThe vast majority of children in Gaza are facing extreme food deprivation, as confirmed by 17 UN agencies and NGOs in the IPC report. Coupled with the severely limited access to health services and critical shortages of clean water and sanitation, rapid increases in acute malnutrition are expected in North Gaza, Gaza and Rafah governorates.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                                                                \n                                                                                \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003eArmy Details How 6 Terrorists Were Eliminated In 2 Encounters In J\u0026amp;K\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
