{
  "id": "51860728-d39a-46f6-bc0e-98cd14e2d2d7",
  "title": "Russia warns against 'hypotheses' after Azerbaijan Airlines crash",
  "link": "https://www.bbc.com/news/articles/cvgp3qx0q7wo",
  "description": "The Russia-bound passenger plane went down in Kazakhstan with the loss of 38 lives.",
  "author": "",
  "published": "Thu, 26 Dec 2024 20:25:46 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Henri Astier",
  "length": 5067,
  "excerpt": "The Russia-bound passenger plane went down in Kazakhstan with the loss of 38 lives.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Emergency crews at scene of Kazakhstan plane crashThe Russian government has cautioned against promoting \"hypotheses\" about the cause of the crash of a Russia-bound passenger plane that killed 38 people in Kazakhstan on Wednesday.Some aviation experts suggested that the Azerbaijan Airlines plane had been hit by air defence systems over the Russian republic of Chechnya and pro-government media in Azerbaijan quote officials as saying a Russian missile was responsible.Before it went down near the Kazakh city of Aktau, the plane was diverted across the Caspian Sea, from its destination in Chechnya to western Kazakhstan.Twenty nine of the 67 people on board survived. Azerbaijan held a national day of mourning on Thursday for the victims of the crash.ReutersThe Embraer 190 caught fire and split apart as it landed\"This is a great tragedy that has become a tremendous sorrow for the Azerbaijani people,\" President Ilham Aliyev said on Thursday.In Moscow, Kremlin spokesman Dmitry Peskov said: \"It would be wrong to put forward any hypotheses before the investigation's conclusions. We, of course, will not do this, and no-one should do this. We need to wait until the investigation is completed.\"The chief prosecutor in Kazakhstan said later that the investigation had not yet come to any conclusions.But some commentators in Azerbaijani media say that Azerbaijan expects Russia to admit shooting down the plane.Several TV channels, which are under strict control of the Azerbaijani government, on Thursday started broadcasting interviews with experts who have openly spoken about the possibility that Russia was responsible.AnewZ channel said a preliminary investigation had concluded that the plane had been hit by shrapnel from a surface-to-air missile from Russia's Pantsir-S defence system. Another pro-government website, Caliber, quoted government sources as saying that no-one was claiming the plane had come under attack intentionally, but that Baku expected an apology from Russia.When asked about the reports, the chief prosecutor's office in Baku told the BBC that every version was being investigated. As they try to avoid annoying Russian President Vladimir Putin, it will be very difficult for the Azerbaijani government to blame Russia directly unless it admits to shooting down the plane. It seems that the investigation committee comprised of Azerbaijani and Kazakh officials possibly already have evidence for this, but they are waiting for Russia to announce it first. Moscow will then have to answer questions such as why Russia did not close its airspace if there was military activity, and why it did not let the plane land as soon as possible - instead of directing it towards Aktau for landing.The Embraer 190 aircraft took off from the Azerbaijani capital Baku on Wednesday morning. It was due to fly to Grozny in Chechnya but it was diverted because of fog, the airline said.A surviving passenger told Russian TV he believed the pilot had tried twice to land in dense fog over Grozny before \"the third time, something exploded... some of the aircraft skin had blown out\".The plane was redirected to Aktau airport, some 450km (280 miles) to the east. Footage shows the aircraft heading towards the ground at high speed 3km (1.9 miles) short of the runway, before bursting into flames as it lands.Kazakh authorities have recovered the flight data recorder and an investigation is under way. Shortly after the crash, reports from Russian state-controlled TV said the most likely cause was a strike from a flock of birds.But that kind of collision typically results in the plane gliding towards the nearest airfield, aviation analyst Richard Aboulafia told Reuters news agency. \"You can lose control of the plane, but you don't fly wildly off course as a consequence,\" he said.Justin Crump of risk advisory company Sibylline said the pattern of damage inside and outside the plane indicated that Russian air defence active in Grozny may have caused the crash.\"It looks very much like the detonation of an air defence missile to the rear and to the left of the aircraft, if you look at the pattern of shrapnel that we see,\" he told BBC Radio 4.Chechnya has already been hit by Ukrainian drone strikes this month and authorities in neighbouring Ingushetia said the Russian region had been targeted for the first time since the war in Ukraine began. A shopping centre was hit when a drone was shot down in nearby North Ossetia, killing one woman, reports said.Those on board were mostly Azerbaijani nationals, but there were also some passengers from Russia, Kazakhstan, and Kyrgyzstan.Video footage showed survivors crawling out of the wreckage, some with visible injuries. The injured were taken to hospital. On Thursday, Azerbaijan's Azertac news agency said seven were in a good enough condition to fly back to Baku. Azerbaijan Airlines told reporters that the plane had been fully serviced in October and had no technical malfunctions.Embraer, a Brazilian manufacturer and a smaller rival to Boeing and Airbus, has a strong safety record.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eEmergency crews at scene of Kazakhstan plane crash\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe Russian government has cautioned against promoting \u0026#34;hypotheses\u0026#34; about the cause of the crash of a Russia-bound passenger plane that killed 38 people in Kazakhstan on Wednesday.\u003c/p\u003e\u003cp\u003eSome aviation experts suggested that the Azerbaijan Airlines plane had been hit by air defence systems over the Russian republic of Chechnya and pro-government media in Azerbaijan quote officials as saying a Russian missile was responsible.\u003c/p\u003e\u003cp\u003eBefore it went down near the Kazakh city of Aktau, the plane was diverted across the Caspian Sea, from its destination in Chechnya to western Kazakhstan.\u003c/p\u003e\u003cp\u003eTwenty nine of the 67 people on board survived. Azerbaijan held a national day of mourning on Thursday for the victims of the crash.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/47ab/live/3301d4d0-c376-11ef-97a2-cbf1b309e0fa.jpg.webp\" alt=\"Reuters Emergency crews at the crash site of an Azerbaijan Airlines passenger plane near the city of Aktau, Kazakhstan, 25 December 2024\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe Embraer 190 caught fire and split apart as it landed\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;This is a great tragedy that has become a tremendous sorrow for the Azerbaijani people,\u0026#34; President Ilham Aliyev said on Thursday.\u003c/p\u003e\u003cp\u003eIn Moscow, Kremlin spokesman Dmitry Peskov said: \u0026#34;It would be wrong to put forward any hypotheses before the investigation\u0026#39;s conclusions. We, of course, will not do this, and no-one should do this. We need to wait until the investigation is completed.\u0026#34;\u003c/p\u003e\u003cp\u003eThe chief prosecutor in Kazakhstan said later that the investigation had not yet come to any conclusions.\u003c/p\u003e\u003cp\u003eBut some commentators in Azerbaijani media say that Azerbaijan expects Russia to admit shooting down the plane.\u003c/p\u003e\u003cp\u003eSeveral TV channels, which are under strict control of the Azerbaijani government, on Thursday started broadcasting interviews with experts who have openly spoken about the possibility that Russia was responsible.\u003c/p\u003e\u003cp\u003eAnewZ channel said a preliminary investigation had concluded that the plane had been hit by shrapnel from a surface-to-air missile from Russia\u0026#39;s Pantsir-S defence system. \u003c/p\u003e\u003cp\u003eAnother pro-government website, Caliber, quoted government sources as saying that no-one was claiming the plane had come under attack intentionally, but that Baku expected an apology from Russia.\u003c/p\u003e\u003cp\u003eWhen asked about the reports, the chief prosecutor\u0026#39;s office in Baku told the BBC that every version was being investigated. \u003c/p\u003e\u003cp\u003eAs they try to avoid annoying Russian President Vladimir Putin, it will be very difficult for the Azerbaijani government to blame Russia directly unless it admits to shooting down the plane. \u003c/p\u003e\u003cp\u003eIt seems that the investigation committee comprised of Azerbaijani and Kazakh officials possibly already have evidence for this, but they are waiting for Russia to announce it first. \u003c/p\u003e\u003cp\u003eMoscow will then have to answer questions such as why Russia did not close its airspace if there was military activity, and why it did not let the plane land as soon as possible - instead of directing it towards Aktau for landing.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/acb4/live/dafc3450-c37b-11ef-a2ca-e99d0c9a24e3.png.webp\" alt=\"Map of Caspian Sea\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe Embraer 190 aircraft took off from the Azerbaijani capital Baku on Wednesday morning. It was due to fly to Grozny in Chechnya but it was diverted because of fog, the airline said.\u003c/p\u003e\u003cp\u003eA surviving passenger told Russian TV he believed the pilot had tried twice to land in dense fog over Grozny before \u0026#34;the third time, something exploded... some of the aircraft skin had blown out\u0026#34;.\u003c/p\u003e\u003cp\u003eThe plane was redirected to Aktau airport, some 450km (280 miles) to the east. Footage shows the aircraft heading towards the ground at high speed 3km (1.9 miles) short of the runway, before bursting into flames as it lands.\u003c/p\u003e\u003cp\u003eKazakh authorities have recovered the flight data recorder and an investigation is under way. Shortly after the crash, reports from Russian state-controlled TV said the most likely cause was a strike from a flock of birds.\u003c/p\u003e\u003cp\u003eBut that kind of collision typically results in the plane gliding towards the nearest airfield, aviation analyst Richard Aboulafia told Reuters news agency. \u0026#34;You can lose control of the plane, but you don\u0026#39;t fly wildly off course as a consequence,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eJustin Crump of risk advisory company Sibylline said the pattern of damage inside and outside the plane indicated that Russian air defence active in Grozny may have caused the crash.\u003c/p\u003e\u003cp\u003e\u0026#34;It looks very much like the detonation of an air defence missile to the rear and to the left of the aircraft, if you look at the pattern of shrapnel that we see,\u0026#34; he told BBC Radio 4.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eChechnya has already been hit by Ukrainian drone strikes this month and authorities in neighbouring Ingushetia said the Russian region had been targeted for the first time since the war in Ukraine began. \u003c/p\u003e\u003cp\u003eA shopping centre was hit when a drone was shot down in nearby North Ossetia, killing one woman, reports said.\u003c/p\u003e\u003cp\u003eThose on board were mostly Azerbaijani nationals, but there were also some passengers from Russia, Kazakhstan, and Kyrgyzstan.\u003c/p\u003e\u003cp\u003eVideo footage showed survivors crawling out of the wreckage, some with visible injuries. \u003c/p\u003e\u003cp\u003eThe injured were taken to hospital. On Thursday, Azerbaijan\u0026#39;s Azertac news agency said seven were in a good enough condition to fly back to Baku. \u003c/p\u003e\u003cp\u003eAzerbaijan Airlines told reporters that the plane had been fully serviced in October and had no technical malfunctions.\u003c/p\u003e\u003cp\u003eEmbraer, a Brazilian manufacturer and a smaller rival to Boeing and Airbus, has a strong safety record.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-26T11:36:08.732Z",
  "modifiedTime": null
}
