{
  "id": "55c26fc5-b9cb-4b32-a229-7e2a4ef6d0bf",
  "title": "Elon Musk backs Warren Buffett’s proposal to ‘end the deficit in 5 minutes’ as the bold idea gains steam again",
  "link": "https://finance.yahoo.com/news/elon-musk-backs-warren-buffett-151100160.html",
  "description": "",
  "author": "",
  "published": "2025-06-10T15:11:00Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Jing Pan",
  "length": 2738,
  "excerpt": "“This is the way.”",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "The Washington Post/Getty Images Moneywise and Yahoo Finance LLC may earn commission or revenue through links in the content below. The U.S. government has been running budget deficits for years — consistently spending more than it collects. And while neither party has managed to rein in the red ink, legendary investor Warren Buffett once offered a surprisingly simple fix. Advertisement: High Yield Savings Offers Powered by Money.com - Yahoo may earn commission from the links above. \"I could end the deficit in five minutes,” Buffett told CNBC’s Becky Quick in a 2011 interview. “You just pass a law that says that any time there's a deficit of more than 3% of GDP, all sitting members of Congress are ineligible for re-election.” Now, that old clip is going viral again — and it's gaining fresh support in high places. Thanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how BlackRock CEO Larry Fink has an important message for the next wave of American retirees — here's how he says you can best weather the US retirement crisis Nervous about the stock market in 2025? Find out how you can access this $1B private real estate fund (with as little as $10) Utah Senator Mike Lee reposted the video on X, asking the public, “Would you support this amendment?” The question sparked a wave of responses, including one from Tesla CEO and X owner Elon Musk, who replied: “100%. This is the way.” But Lee isn’t just crowdsourcing opinions — he’s trying to turn the idea into a reality. “I’m drafting a constitutional amendment to oust every member of Congress whenever inflation exceeds 3%. It’s better to disqualify politicians than for an entire nation to suffer under the yoke of inflation,” he wrote on X. While Lee referenced both inflation and deficits, the logic echoes Buffett’s frustration: tying lawmakers’ job security to the nation’s fiscal health. Economists have long noted a connection between excessive government spending and inflation. The late Nobel Prize–winning economist Milton Friedman once famously said, “What produces [inflation] is too much government spending and too much government creation of money and nothing else,” adding, “Only Washington can create money.” But enshrining that accountability into law — especially one that threatens every member of Congress with job loss — is a heavy lift. Buffett’s threshold was a deficit of more than 3% of GDP. In fiscal 2024, the U.S. economy generated $28.83 trillion in GDP, while the federal government spent $6.75 trillion and collected $4.92 trillion in revenue. That left a $1.83 trillion deficit — or 6.3% of GDP.",
  "image": "https://media.zenfs.com/en/moneywise_ecomm_711/2921ba48022152645b431d8cea630c80",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e   \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"Elon Musk\" loading=\"eager\" height=\"427\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eThe Washington Post/Getty Images  \u003c/figcaption\u003e \u003c/figure\u003e   \u003cp\u003e\u003cem\u003eMoneywise and Yahoo Finance LLC may earn commission or revenue through links in the content below.\u003c/em\u003e\u003c/p\u003e   \u003cp\u003eThe U.S. government has been running budget deficits for years — consistently spending more than it collects. And while neither party has managed to rein in the red ink, legendary investor Warren Buffett once offered a surprisingly simple fix.\u003c/p\u003e   \u003cdiv\u003e\u003ch2\u003eAdvertisement: High Yield Savings Offers \u003c/h2\u003e  \u003cp\u003ePowered by Money.com - Yahoo may earn commission from the links above. \u003c/p\u003e\u003c/div\u003e   \u003cp\u003e\u0026#34;I could end the deficit in five minutes,” Buffett told CNBC’s Becky Quick in a 2011 interview. “You just pass a law that says that any time there\u0026#39;s a deficit of more than 3% of GDP, all sitting members of Congress are ineligible for re-election.”\u003c/p\u003e   \u003cp\u003eNow, that old clip is going viral again — and it\u0026#39;s gaining fresh support in high places.\u003c/p\u003e      \u003cul\u003e\u003cli\u003e \u003cp\u003eThanks to Jeff Bezos, you can now \u003ca href=\"https://moneywise.com/investing/real-estate/invest-vacation-rental-homes?throw=DM1_yahoofinance\u0026amp;placement_syn=placement_1\u0026amp;utm_source=syn_yahoofinance_mon_aff\u0026amp;utm_medium=Z\u0026amp;utm_campaign=106042\u0026amp;utm_content=syn_dd83bdc2-5cc4-47c7-b926-8eb5f71df94d\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:become a landlord for as little as $100;elm:context_link;itc:0;sec:content-canvas\"\u003ebecome a landlord for as little as $100\u003c/a\u003e — and no, you don\u0026#39;t have to deal with tenants or fix freezers. Here\u0026#39;s how\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eBlackRock CEO Larry Fink has an important message for the next wave of American retirees — \u003ca href=\"https://moneywise.com/managing-money/retirement-planning/larry-fink-retirees-hybrid?throw=DM2_yahoofinance\u0026amp;placement_syn=placement_1\u0026amp;utm_source=syn_yahoofinance_mon_aff\u0026amp;utm_medium=Z\u0026amp;utm_campaign=106042\u0026amp;utm_content=syn_092baacd-e2e2-41af-9ef3-296629f9bb79\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:here\u0026#39;s how he says you can best weather the US retirement crisis;elm:context_link;itc:0;sec:content-canvas\"\u003ehere\u0026#39;s how he says you can best weather the US retirement crisis\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eNervous about the stock market in 2025? Find out how you can \u003ca href=\"https://moneywise.com/real-estate/real-estate/diversify-with-real-estate?throw=DM3_yahoofinance\u0026amp;placement_syn=placement_1\u0026amp;utm_source=syn_yahoofinance_mon_aff\u0026amp;utm_medium=Z\u0026amp;utm_campaign=106042\u0026amp;utm_content=syn_7025e06c-50f8-44ee-8e39-4ab89e86643b\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:access this $1B private real estate fund (with as little as $10);elm:context_link;itc:0;sec:content-canvas\"\u003eaccess this $1B private real estate fund (with as little as $10)\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e      \u003cp\u003eUtah Senator Mike Lee reposted the video on X, asking the public, “Would you support this amendment?”\u003c/p\u003e   \u003cp\u003eThe question sparked a wave of responses, including one from Tesla CEO and X owner Elon Musk, who replied: “100%. This is the way.”\u003c/p\u003e   \u003cp\u003eBut Lee isn’t just crowdsourcing opinions — he’s trying to turn the idea into a reality.\u003c/p\u003e   \u003cp\u003e“I’m drafting a constitutional amendment to oust every member of Congress whenever inflation exceeds 3%. It’s better to disqualify politicians than for an entire nation to suffer under the yoke of inflation,” he wrote on X.\u003c/p\u003e      \u003cp\u003eWhile Lee referenced both inflation and deficits, the logic echoes Buffett’s frustration: tying lawmakers’ job security to the nation’s fiscal health.\u003c/p\u003e   \u003cp\u003eEconomists have long noted a connection between excessive government spending and inflation. The late Nobel Prize–winning economist Milton Friedman once famously said, “What produces [inflation] is too much government spending and too much government creation of money and nothing else,” adding, “Only Washington can create money.”\u003c/p\u003e      \u003cp\u003eBut enshrining that accountability into law — especially one that threatens every member of Congress with job loss — is a heavy lift.\u003c/p\u003e   \u003cp\u003eBuffett’s threshold was a deficit of more than 3% of GDP. In fiscal 2024, the U.S. economy generated $28.83 trillion in GDP, while the federal government spent $6.75 trillion and collected $4.92 trillion in revenue. That left a $1.83 trillion deficit — or 6.3% of GDP.\u003c/p\u003e \u003c/div\u003e      \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-10T15:11:00Z",
  "modifiedTime": null
}
