{
  "id": "6566403e-af88-4fef-9b29-84f5e82721f8",
  "title": "Fear, pain and hunger: The dire impact of U.S. funding cuts in Africa",
  "link": "https://www.washingtonpost.com/world/2025/02/04/africa-trump-musk-usaid-funding-cuts/",
  "description": "Across Africa, the policies of the Trump administration are already having profound consequences for some of the world’s poorest and most vulnerable people.",
  "author": "Katharine Houreld, Rachel Chason",
  "published": "Tue, 04 Feb 2025 22:08:56 +0000",
  "source": "http://feeds.washingtonpost.com/rss/world",
  "categories": null,
  "byline": "Katharine Houreld, Rachel Chason",
  "length": 9927,
  "excerpt": "Across Africa, the policies of the Trump administration are already having profound consequences for some of the world’s poorest and most vulnerable people.",
  "siteName": "The Washington Post",
  "favicon": "https://www.washingtonpost.com/touch-icon-iphone-retina.png",
  "text": "NAIROBI — Soup kitchens can no longer feed the hungry. First responders are unable to reach the dead and wounded. Mothers and fathers search in vain for the medicines that keep them alive.Across Africa, in bombed-out Sudanese cities, Kenyan clinics and Mauritanian refugee camps, the policies of the Trump administration are already having profound consequences for some of the world’s most vulnerable people.The president’s decision to cancel or suspend billions of dollars’ worth of foreign aid — followed by ill-defined exemptions — are deepening humanitarian crises and putting an untold number of lives at risk, according to front-line aid workers and civilians who rely on American-funded programs.Last week, thousands of “stop-work” orders went out to employees and contractors for the United States Agency for International Development, or USAID, which has long been Washington’s main vehicle for global aid. USAID spent $40 billion of the $68 billion that the U.S. allocated for foreign aid programs last year, making it the world’s single biggest donor — providing food, health care and clean water for tens of millions of people. Over the past five years, countries in sub-Saharan Africa have accounted for more than a third of U.S. foreign assistance spending.“We spent the weekend feeding USAID into the wood chipper,” billionaire Elon Musk, whom Trump has put in charge of a new pseudo-government office tasked with cutting waste, boasted Monday on X. Calling the agency a “radical-left political psy op” and “a criminal organization,” Musk said it was “time for it to die.”Later on Monday, Secretary of State Marco Rubio unveiled plans to restructure and potentially abolish USAID, citing “systems and processes [that] … often result in discord in the foreign policy and foreign relations of the United States.”Traditionally, USAID has enjoyed strong bipartisan support in Washington. In addition to saving lives, its backers say it helps stabilize some of the world’s poorest and most volatile regions while acting as a bulwark against Russian and Chinese influence.“We are the richest nation in the history of nations,” a senior U.S. government official told The Washington Post on Tuesday, speaking on the condition of anonymity because he was not authorized to speak to the press. “Despite the potential of individual program exemptions, tens of millions of people in East Africa alone are not receiving any humanitarian aid today.”In the most desperate places, like war-ravaged Sudan, the fallout has been immediate. Half the population of 50 million needs food aid, and famine is spreading as Islamist militias and their allies in the military battle a paramilitary accused by Washington of genocide. The USAID suspension has halted national food programs serving millions and shuttered hundreds of community kitchens that operate in areas too dangerous for big agencies to enter.A humanitarian worker in Sudan, who like others in this story spoke on the condition of anonymity to avoid retaliation against their employer, said their organization got a stop-work order for grants covering hundreds of millions of dollars.“It means that over 8 million people in extreme levels of hunger could die of starvation,” said the aid worker. “What’s next? What do we do?”In the besieged capital of Khartoum, more than two-thirds of soup kitchens have closed in the last week, said Hajooj Kuka, who handles external communications for Sudan’s civilian-run volunteer Emergency Response Rooms.“It was a complete blackout overnight,” he said. “People are on the brink of starvation anyway … they cannot last three days or a week without food.” Kuka said most families they serve were living on that one meal a day.USAID had also provided security funds to the Emergency Response Rooms, cells of pro-democracy demonstrators that have worked to alleviate the suffering of the civil war. More than 60 of their volunteers have been killed since the conflict erupted nearly two years ago, and the young people moving food and medicine across the front lines are often arrested and abused by combatants on both sides, who suspect them of being spies.One volunteer is being hunted by a militia; another volunteer was recently tortured to try to reveal his whereabouts, according to Kuka. Normally, he said, USAID funding could help him escape; now they are trying to move him between safe houses as the militias advance.“We are saying our goodbyes,” he messaged, followed by a broken-heart emoji.An internal report prepared by aid groups providing health services in Sudan and shared with The Post said more than half of the 10 million people targeted to receive health care probably would lose access because of the cuts. One medical group, which had treated more than 19,000 civilians, mostly women, in the past two months in Darfur, said it could no longer offer services without alternative funding.“There was no transition, just an abrupt stop,” an employee said.A worker for another medical aid group recounted receiving a desperate call on Saturday from health officials in Omdurman, northwest of the capital, begging them to send an ambulance to a market that had just been bombed.“Unfortunately I told them that the ambulance is no longer available because of the suspension; it was a rented vehicle so the owner took it back,” the medical aid worker said. At least 54 people were killed and 158 injured in the attack, local authorities said.The medical organization said their suspension orders also apply to vaccinations, prenatal care for mothers, birth attendants for delivery and treatment for malaria in countries across East Africa. Last week, after Rubio issued a waiver exempting programs that provide “lifesaving humanitarian assistance,” the medical group said it was allowed to continue portions of its work in one African nation, but similar programs in other places were still on hold — compounding confusion over whether, and how, they are allowed to operate.“Our work is to save lives,” said another employee of the organization. If it stops, she said, “certainly people will die.”The funding crisis coincides with massive global upheaval: More people than ever in Africa are hungry, and the continent — where the median age is 19 — is experiencing conflict more widespread than at any point since the end of World War II.In the Mbera refugee camp in Mauritania, home to more than 100,000 people who have fled the crisis in neighboring Mali, the U.S. aid cuts have caused “a panic,” said camp coordinator Mohamed Ag Malhad.Malhad’s family arrived here in 2012 after fleeing Islamist extremists in Mali. He estimated that the U.S. provides about 30 percent of funding for the camp. Already, a school that served 500 students was told to suspend classes. A program for social psychologists in the camp and another that works to identify the most vulnerable refugees are on hold.“What will this big gap cause in terms of damage?” Malhad wondered. “Damage in terms of livelihood. Damage in terms of education. Damage in terms of health.”Abdallah Ag Mohamed, who runs the school, called “Hope,” was working out on Jan. 27 when he got an email about the cuts. A month of funding for the school costs only about $5,300, he said, but means everything for the students. Teachers have continued working without pay.The stop-work orders have also grounded efforts to contain a deadly hemorrhagic Marburg outbreak in Tanzania, the spread of an mpox variant killing children in West Africa, as well as the monitoring of a dangerous bird flu that has been identified in 49 countries, according to Atul Gawande, the former head of global health at USAID.“Consequences aren’t in some distant future. They are immediate,” he wrote on X.After a bipartisan outcry, Rubio on Saturday announced a specific carve-out to enable continued funding for PEPFAR — a universally celebrated HIV/AIDS program launched by former president George W. Bush that is credited with saving millions of lives in Africa and which 20 million people still depend on. Despite the exemption, many PEPFAR initiatives have been thrown into chaos.In South Africa, Anele Yawa, secretary general of the Treatment Action Campaign, said more than 15,000 people who had previously provided HIV testing, counseling and other social prevention programs were forced to stop working abruptly, and many had not returned. Deliveries of antiretroviral medicines to homes and contact tracing were no longer happening, she said. Many clinics that shut down last week were still closed.“I’m told that drugs are still being withheld at clinics in Africa,” Sen. Bill Cassidy (R-Louisiana) said Monday on X. “This must be reversed immediately,” he added, calling PEPFAR “the epitome of soft power.”At a shuttered clinic in Johannesburg on Tuesday, an HIV-positive man pulled up on a scooter. He was due for his six-month checkup, when his doctor normally would prescribe his next round of pills. He would run out of medication in two weeks, he said; as a foreigner, he was afraid to go to a government hospital, fearing deportation. Like others seeking help, he spoke on the condition of anonymity to protect his privacy.“I’ll make a plan,” he said, climbing back aboard his motorbike.In Kenya, a mother of three said on Friday morning that her usual clinic had given her only one month out of her usual six-month prescription of anti-retroviral medicine amid concerns over shortages. The Kenyan health minister has said the country has six months’ worth of medication, but clinics have already resorted to rationing.“If I die, who will take care of my children?” she asked. She made the rounds again on Monday and was able to get 30 more days’ of medicine.“Another month of life,” she said, rolling the pills in her palm.Chason reported from Mbera camp, Mauritania. Tabelo Timse in Johannesburg and Hafiz Haroun and Rael Ombuor in Nairobi contributed to this report.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AQ6C5R27T22P3DXXZOPRDTGQGU.jpg\u0026w=1440",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"K6CZCUXOO5GR3J3G74HTTXJITU\" data-el=\"text\" dir=\"null\"\u003eNAIROBI — Soup kitchens can no longer feed the hungry. First responders are unable to reach the dead and wounded. Mothers and fathers search in vain for the medicines that keep them alive.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"77XUUAUCIFEFXLBAVGEUGFQ3VU\" data-el=\"text\" dir=\"null\"\u003eAcross Africa, in bombed-out Sudanese cities, Kenyan clinics and Mauritanian refugee camps, the policies of the Trump administration are already having profound consequences for some of the world’s most vulnerable people.\u003c/p\u003e\u003c/div\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"KUWH6NTDLFHB7ITEMYYKVO2S6A\" data-el=\"text\" dir=\"null\"\u003eThe president’s decision to cancel or suspend billions of dollars’ worth of foreign aid — followed by ill-defined exemptions — are deepening humanitarian crises and putting an untold number of lives at risk, according to front-line aid workers and civilians who rely on American-funded programs.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"QFQXMO6GEFF7JA6S5VWBZHSVFM\" data-el=\"text\" dir=\"null\"\u003eLast week, thousands of “stop-work” orders went out to employees and contractors for the United States Agency for International Development, or \u003ca href=\"https://www.washingtonpost.com/politics/2025/02/02/usaid-musk-trump-faq/\" target=\"_blank\"\u003eUSAID\u003c/a\u003e, which has long been Washington’s main vehicle for global aid. USAID spent $40 billion of the $68 billion that the U.S. allocated for foreign aid programs last year, making it the world’s \u003ca href=\"https://www.washingtonpost.com/politics/2025/02/03/trump-musk-usaid/3328d70e-e222-11ef-ab83-bb30e4340014_story.html\" target=\"_blank\"\u003esingle biggest donor\u003c/a\u003e — providing food, health care and clean water for tens of millions of people. Over the past five years, countries in sub-Saharan Africa have accounted for more than a third of U.S. foreign assistance spending.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"KTEORPRLVVBVJAHFG3AET5UJVM\" data-el=\"text\" dir=\"null\"\u003e“We spent the weekend feeding USAID into the wood chipper,” billionaire Elon Musk, whom Trump has put in charge of a new pseudo-government office tasked with cutting waste, \u003ca href=\"https://x.com/elonmusk/status/1886307316804263979\" target=\"_blank\"\u003eboasted Monday on X. \u003c/a\u003eCalling the agency a “radical-left political psy op” and “a criminal organization,” Musk \u003ca href=\"https://x.com/elonmusk/status/1886102414194835755\" target=\"_blank\"\u003esaid \u003c/a\u003eit was “time for it to die.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"DOQUFYOKZVF5VIYADJ5FSFHTQQ\" data-el=\"text\" dir=\"null\"\u003eLater on Monday, Secretary of State Marco Rubio \u003ca href=\"https://www.washingtonpost.com/national-security/2025/02/03/usaid-rubio-trump-musk/\" target=\"_blank\"\u003eunveiled plans\u003c/a\u003e to restructure and potentially abolish USAID, citing “systems and processes [that] … often result in discord in the foreign policy and foreign relations of the United States.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"UDWJBRM4QNCZDOYMRB53BMRUKY\" data-el=\"text\" dir=\"null\"\u003eTraditionally, USAID has enjoyed strong bipartisan support in Washington. In addition to saving lives, its backers say it helps stabilize some of the world’s poorest and most volatile regions while acting as a bulwark against Russian and Chinese influence.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"UGIRG45FXBAHJKG4WQMZMK5SRA\" data-el=\"text\" dir=\"null\"\u003e“We are the richest nation in the history of nations,” a senior U.S. government official told The Washington Post on Tuesday, speaking on the condition of anonymity because he was not authorized to speak to the press. “Despite the potential of individual program exemptions, tens of millions of people in East Africa alone are not receiving any humanitarian aid today.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"MYX632RMFBHANFLKUZLPXU636U\" data-el=\"text\" dir=\"null\"\u003eIn the most desperate places, like \u003ca href=\"https://www.washingtonpost.com/world/2025/01/18/sudan-war-rsf-burhan-wad-madani/\" target=\"_blank\"\u003ewar-ravaged\u003c/a\u003e Sudan, the fallout has been immediate. Half the population of 50 million needs food aid, and famine is spreading as Islamist militias and their allies in the military battle a paramilitary \u003ca href=\"https://www.washingtonpost.com/national-security/2025/01/16/sudan-sanctions-abdel-fattah-al-burha/\" target=\"_blank\"\u003eaccused by Washington of genocide\u003c/a\u003e. The USAID suspension has halted national food programs serving millions and shuttered hundreds of community kitchens that operate in areas too dangerous for big agencies to enter.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"MEOKLMCQVBC5XJFWR3FZF2MXIM\" data-el=\"text\" dir=\"null\"\u003eA humanitarian worker in Sudan, who like others in this story spoke on the condition of anonymity to avoid retaliation against their employer, said their organization got a stop-work order for grants covering hundreds of millions of dollars.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"IIF53G6MHVAVBHKVFMBQVNQEHI\" data-el=\"text\" dir=\"null\"\u003e“It means that over 8 million people in extreme levels of hunger could die of starvation,” said the aid worker. “What’s next? What do we do?”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"KNPN6B5GGVFWZCUFH2LCNOJQWE\" data-el=\"text\" dir=\"null\"\u003eIn the besieged capital of Khartoum, more than two-thirds of soup kitchens have closed in the last week, said Hajooj Kuka, who handles external communications for Sudan’s civilian-run volunteer Emergency Response Rooms.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"VDT7KMI7G5DUDGYERIZDVYLU6U\" data-el=\"text\" dir=\"null\"\u003e“It was a complete blackout overnight,” he said. “People are on the brink of starvation anyway … they cannot last three days or a week without food.” Kuka said most families they serve were living on that one meal a day.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"KJJP5IF4ZRAI3EKV5BCQMTR3GQ\" data-el=\"text\" dir=\"null\"\u003eUSAID had also provided security funds to the \u003ca href=\"https://www.washingtonpost.com/world/2024/05/12/sudan-war-rsf-el-fashir/\" target=\"_blank\"\u003eEmergency Response Rooms\u003c/a\u003e, cells of pro-democracy demonstrators that have worked to alleviate the suffering of the civil war. More than 60 of their volunteers have been killed since the conflict erupted nearly two years ago, and the young people moving food and medicine across the front lines are often arrested and abused by combatants on both sides, who suspect them of being spies.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"V5A7LPQ3AFHKBFPE3UU3ESYTDQ\" data-el=\"text\" dir=\"null\"\u003eOne volunteer is being hunted by a militia; another volunteer was recently tortured to try to reveal his whereabouts, according to Kuka. Normally, he said, USAID funding could help him escape; now they are trying to move him between safe houses as the militias advance.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"WNUH3346Z5AIVK6F2PCHPMCSZ4\" data-el=\"text\" dir=\"null\"\u003e“We are saying our goodbyes,” he messaged, followed by a broken-heart emoji.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"IXVPEX7L5ND3LOAKM4EI5DDZIM\" data-el=\"text\" dir=\"null\"\u003eAn internal report prepared by aid groups providing health services in Sudan and shared with The Post said more than half of the 10 million people targeted to receive health care probably would lose access because of the cuts. One medical group, which had treated more than 19,000 civilians, mostly women, in the past two months in Darfur, said it could no longer offer services without alternative funding.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"LZKRQAWXRBEV3IRL2M3OMNMHJE\" data-el=\"text\" dir=\"null\"\u003e“There was no transition, just an abrupt stop,” an employee said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"NFHZF6YOR5G2TCQIFC6CDGWVGY\" data-el=\"text\" dir=\"null\"\u003eA worker for another medical aid group recounted receiving a desperate call on Saturday from health officials in Omdurman, northwest of the capital, begging them to send an ambulance to a market that had just been bombed.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"ZGE4CX3KHZH3BOASLPTQMZ63GI\" data-el=\"text\" dir=\"null\"\u003e“Unfortunately I told them that the ambulance is no longer available because of the suspension; it was a rented vehicle so the owner took it back,” the medical aid worker said. At least 54 people were killed and 158 injured in the attack, local authorities said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"BCN3UFL52RFVRHTSHA3JJSQC5A\" data-el=\"text\" dir=\"null\"\u003eThe medical organization said their suspension orders also apply to vaccinations, prenatal care for mothers, birth attendants for delivery and treatment for malaria in countries across East Africa. Last week, after \u003ca href=\"https://www.washingtonpost.com/national-security/2025/01/28/state-department-foreign-aid-trump-waiver/\" target=\"_blank\"\u003eRubio issued a waiver\u003c/a\u003e exempting programs that provide “lifesaving humanitarian assistance,” the medical group said it was allowed to continue portions of its work in one African nation, but similar programs in other places were still on hold — compounding confusion over whether, and how, they are allowed to operate.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"QCLSBS4IMRDSXJ67BBFTMFDOLM\" data-el=\"text\" dir=\"null\"\u003e“Our work is to save lives,” said another employee of the organization. If it stops, she said, “certainly people will die.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RLJKD2OYSBASHMEEU4WXEFZCUE\" data-el=\"text\" dir=\"null\"\u003eThe funding crisis coincides with massive global upheaval: More people than ever in Africa are hungry, and the continent — where the median age is 19 — is experiencing conflict more widespread than at any point since the end of World War II.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"IGZT2YK6NJFPDM32626UUROQGY\" data-el=\"text\" dir=\"null\"\u003eIn the Mbera refugee camp in Mauritania, home to more than 100,000 people who have fled the crisis in neighboring Mali, the U.S. aid cuts have caused “a panic,” said camp coordinator Mohamed Ag Malhad.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"2OEG2SRGKVHKXEUSQEVROOVRWI\" data-el=\"text\" dir=\"null\"\u003eMalhad’s family arrived here in 2012 after fleeing Islamist extremists in Mali. He estimated that the U.S. provides about 30 percent of funding for the camp. Already, a school that served 500 students was told to suspend classes. A program for social psychologists in the camp and another that works to identify the most vulnerable refugees are on hold.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"FP3KYEBFMBATBEC7JCGL6EWMFA\" data-el=\"text\" dir=\"null\"\u003e“What will this big gap cause in terms of damage?” Malhad wondered. “Damage in terms of livelihood. Damage in terms of education. Damage in terms of health.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"E2SNZQEM4ZCJVARIAIKTCYOPEU\" data-el=\"text\" dir=\"null\"\u003eAbdallah Ag Mohamed, who runs the school, called “Hope,” was working out on Jan. 27 when he got an email about the cuts. A month of funding for the school costs only about $5,300, he said, but means everything for the students. Teachers have continued working without pay.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"VZCUEVXF4BEEPLIWYNDYDYPQLI\" data-el=\"text\" dir=\"null\"\u003eThe stop-work orders have also grounded efforts to contain a deadly hemorrhagic Marburg outbreak in Tanzania, the spread of an mpox variant killing children in West Africa, as well as the monitoring of a dangerous bird flu that has been identified in 49 countries, according to Atul Gawande, the former head of global health at USAID.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"JJUGSGUEH5EUNMNZDN2DGFSUYA\" data-el=\"text\" dir=\"null\"\u003e“Consequences aren’t in some distant future. They are immediate,” he \u003ca href=\"https://x.com/Atul_Gawande/status/1883538449489330436\" target=\"_blank\"\u003ewrote on X\u003c/a\u003e.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"SHXR7XR525DH3JZEO6DSIWDWLU\" data-el=\"text\" dir=\"null\"\u003eAfter a bipartisan outcry, Rubio on Saturday announced a specific carve-out to enable continued funding for PEPFAR — a universally celebrated \u003ca href=\"https://www.washingtonpost.com/world/2025/01/29/pepfar-trump-hiv-aids-aid-pause/\" target=\"_blank\"\u003eHIV/AIDS program\u003c/a\u003e launched by former president George W. Bush that is credited with saving millions of lives in Africa and which 20 million people still depend on. Despite the exemption, many PEPFAR initiatives have been thrown into chaos.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"2YIE24TQ3RCTJGVL5TYMKMJ2QE\" data-el=\"text\" dir=\"null\"\u003eIn South Africa, Anele Yawa, secretary general of the Treatment Action Campaign, said more than 15,000 people who had previously provided HIV testing, counseling and other social prevention programs were forced to stop working abruptly, and many had not returned. Deliveries of antiretroviral medicines to homes and contact tracing were no longer happening, she said. Many clinics that shut down last week were still closed.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"3V426DVVLBGDFEGKBFZH5EQDUQ\" data-el=\"text\" dir=\"null\"\u003e“I’m told that drugs are still being withheld at clinics in Africa,” Sen. Bill Cassidy (R-Louisiana) \u003ca href=\"https://x.com/senbillcassidy/status/1886546867548512456?s=46\u0026amp;t=DBY3iDaPv6S5ppr42eCo7A\" target=\"_blank\"\u003esaid Monday on X\u003c/a\u003e. “This must be reversed immediately,” he added, calling PEPFAR “the epitome of soft power.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"JGCR7O2Y7JCMJFZOPBEEJJNZFU\" data-el=\"text\" dir=\"null\"\u003eAt a shuttered clinic in Johannesburg on Tuesday, an HIV-positive man pulled up on a scooter. He was due for his six-month checkup, when his doctor normally would prescribe his next round of pills. He would run out of medication in two weeks, he said; as a foreigner, he was afraid to go to a government hospital, fearing deportation. Like others seeking help, he spoke on the condition of anonymity to protect his privacy.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"J2ZYCAVN7BGBFKQ6HSEGIKAZBY\" data-el=\"text\" dir=\"null\"\u003e“I’ll make a plan,” he said, climbing back aboard his motorbike.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"3FLB2DBFPJCT3JTTDN7QHUKNZ4\" data-el=\"text\" dir=\"null\"\u003eIn Kenya, a mother of three said on Friday morning that her usual clinic had given her only one month out of her usual six-month prescription of anti-retroviral medicine amid concerns over shortages. The Kenyan health minister has said the country has six months’ worth of medication, but clinics have already resorted to rationing.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"6Q2P5KLG6ZFKFF62VY5MTJTROI\" data-el=\"text\" dir=\"null\"\u003e“If I die, who will take care of my children?” she asked. She made the rounds again on Monday and was able to get 30 more days’ of medicine.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"SS7UL3LTSVFRJF53CWWQOSXZTE\" data-el=\"text\" dir=\"null\"\u003e“Another month of life,” she said, rolling the pills in her palm.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"5HMVTD2UJVFVNFFPTJWQ6HTQ7E\" data-el=\"text\" dir=\"null\"\u003e\u003ci\u003eChason reported from Mbera camp, Mauritania. Tabelo Timse in Johannesburg and Hafiz Haroun and Rael Ombuor in Nairobi contributed to this report.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-02-04T22:08:57.569Z",
  "modifiedTime": "2025-02-05T00:32:10.445Z"
}
