{
  "id": "74bbef1c-7fc9-46eb-ad41-b908f77d8c68",
  "title": "Watching China's youngest-ever astronauts blast off from the Gobi Desert",
  "link": "https://www.bbc.com/news/articles/c5yp47prg7jo",
  "description": "The BBC’s Laura Bicker sees the Shenzhou 19 spacecraft take off, as China chases its dreams of space dominance.",
  "author": "",
  "published": "Tue, 29 Oct 2024 21:52:20 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Laura Bicker",
  "length": 8675,
  "excerpt": "The BBC’s Laura Bicker sees the Shenzhou 19 spacecraft take off, as China chases its dreams of space dominance.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "China spacecraft launches in mission to space stationThe ground vibrates beneath us as soon as the countdown ends and the spacecraft takes to the skies. Flames shoot out of the rocket launcher lighting up the Gobi Desert, which is then filled with a deafening roar.The BBC was given rare access to Jiuquan Satellite launch centre in Gansu and we were just over a kilometre away when the Shenzhou 19 spacecraft blasted off early on Wednesday.It is crewed by three taikonauts - China’s word for astronauts - who are the latest in a series of explorers to head to the country’s homegrown space station, Tiangong, or \"Heavenly Palace\".They will use it as a base for six months to conduct experiments and carry out spacewalks as the country tries to gain experience and intelligence for its eventual mission to put someone from China on the Moon by 2030.Just two years ago, President Xi Jinping declared that \"to explore the vast cosmos, develop the space industry and build China into a space power is our eternal dream”. But some in Washington see the country’s ambition and fast-paced progress as a real threat.Earlier this year, Nasa chief Bill Nelson said the US and China were “in effect, in a race” to return to the Moon, where he fears Beijing wants to stake territorial claims.He told legislators that he believed their civilian space programme was also a military programme.EFEAstronauts (L-R) Wang Haoze, Song Lingdong and Cai Xuzhe wave before the launch'Dreams that spark glory'However, in Dongfeng Space City, a town built to support the launch site, China’s space programme is celebrated.Every street light is adorned with the national flag. Cartoon-like astronaut figurines and sculptures sit in the centre of children’s parks and plastic rockets are a centrepiece on most traffic roundabouts.A huge poster with Xi Jinping on one side and a photo of the Shenzhou spacecraft on the other greets you as you drive into the main compound.Hundreds have gathered in the dark after midnight to wave flags and brightly coloured lights as the Taikonauts make their last few steps on Earth before heading to the launch site.The brass band strikes up Ode to the Motherland as young children, kept up late for the occasion, their cheeks adorned with the Chinese flag, all shout in full song.This is a moment of national pride.The pilot of this mission, Cai Xuzhe, is a veteran but he’s travelling with a new generation of Chinese-trained taikonauts born in 1990 – including China’s first female space engineer, Wang Haoze.“Their youthful energy has made me feel younger and even more confident,” he told the gathered media ahead of take-off.“Inspired by dreams that spark glory, and by glory that ignites new dreams, we assure the party and the people that we will stay true to our mission, with our hearts and minds fully devoted. We will strive to achieve new accomplishments in China’s crewed space programme.”Standing to his left, beaming, is Song Lingdong. He recalls watching one of China’s first space station missions as a 13-year-old with “excitement and awe”. He chose to become a pilot in the hope that this is how he could serve his country.All three convey their deep sense of national pride, and state media has emphasised that this will be its “youngest crew” to date.The message is clear: this is a new generation of space travellers and an investment in the country’s future.China has already selected its next group of astronauts and they will train for potential lunar missions as well as to crew the space station.“I am determined not to let down the trust placed in me,” says Song. “I will strive to make our country’s name shine once again in space.”BBC/ Xiqing WangChina’s name has been \"shining brightly\" a lot lately when it comes to headlines about its space programme.Earlier this year, the country achieved a historic first by retrieving rock and soil samples from the far side of the Moon.In 2021, China safely landed a spacecraft on Mars and released its Zhurong rover – becoming just the second nation to do so.China also has a fleet of satellites in space and has plans for many more.In August it launched the first 18 of what it hopes will eventually be a constellation of 14,000 satellites providing broadband internet coverage from space, which it hopes will one day rival SpaceX’s Starlink.Elon Musk, Starlink's chief executive, admitted on his own platform X that China’s space programme is far more advanced than people realise.But others in the US are voicing even greater concerns, as they fear this technology can be weaponised.The head of US Space Command, General Stephen Whiting, told a space symposium in April that China and Russia were both investing heavily in space at a “breath-taking speed”.He claimed that since 2018, China has tripled the amount of intelligence, surveillance and reconnaissance satellites it has in orbit, building a “kill web over the Pacific Ocean to find, fix, track and target United States and allied military capabilities”.The new space raceChina’s space exploration is a “collective mission for humanity”, says Li Yingliang, director of the general technology bureau of China’s Manned Space Agency, dismissing US concerns as “unnecessary”.“I don’t think this should be called a competition… China has long upheld the notion of peaceful use of space in its manned space programme. In the future, we will further develop international co-operation in various aspects of manned space technology, all based on sharing and collaboration,” he adds.But the new space race is no longer about getting to the Moon. It’s about who will control its resources.The Moon contains minerals, including rare earths, metals like iron and titanium - and helium too, which is used in everything from superconductors to medical equipment.Estimates for the value of all this vary wildly, from billions to quadrillions. So it’s easy to see why some see the Moon as a place to make lots of money. However, it’s also important to note that this would be a very long-term investment - and the tech needed to extract and return these lunar resources is some way off, writes the BBC's science editor Rebecca Morelle. Chinese experts at the launch centre were keen to point out the benefits of Beijing’s space station experiments.“We study bones, muscles, nerve cells, and the effects of microgravity on them. Through this research, we’ve discovered that osteoporosis on Earth is actually similar to bone loss in space. If we can uncover unique patterns in space, we might be able to develop special medications to counteract bone loss and muscle atrophy,” said Zhang Wei, from the Chinese Academy of Sciences.“Many of these experimental results can be applied on Earth.”BBC/ Xiqing WangChina is, at times, trying to downplay its advances. At the launch of a roadmap for its space ambitions, which include building a research station on the Moon, returning samples of Venus’s atmosphere to Earth and launching more than 30 space missions by the middle of this century, Ding Chibiao from the Chinese Academy of Sciences said the country did not have a great number of achievements “compared to developed nations”.And even here at the launch centre, they admit to “significant challenges” as they try to land a crew on the Moon.“The technology is complex, there's a tight schedule, and there are a lot of challenges,” said Lin Xiqiang, spokesperson for the China Manned Space Agency.“We'll keep up the spirit of 'two bombs and one star'. We will maintain our self-confidence and commitment to self-improvement, keep working together and keep pushing forward. We'll make the Chinese people's dream of landing on the Moon a reality in the near future.”That’s perhaps why President Xi appears to be prioritising the country’s space programme even as the economy is in a slow decline.And even though they are bringing along international press to witness their progress – there are key restrictions.We have been kept in a hotel three hours from the launch site and transported back and forth by bus, a total journey of 12 hours, rather than leave us on site for a few hours.A simple trip to a friendly local restaurant was carefully guarded by a line of security personnel.We also noticed a large sign in town holds a stern warning: “It’s a crime to leak secrets. It’s an honour to keep secrets. You’ll be jailed if you leak secrets. You’ll be happy if you keep secrets. You’ll be shot if you sell secrets.”China is taking no chances with its new technology, as its rivalry with the United States is no longer just here on Earth. The world’s two most powerful countries could soon be staking territorial claims well beyond this planet.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/acb0/live/89b40b10-9651-11ef-9260-19e6a950e830.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eChina spacecraft launches in mission to space station\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe ground vibrates beneath us as soon as the countdown ends and the spacecraft takes to the skies. Flames shoot out of the rocket launcher lighting up the Gobi Desert, which is then filled with a deafening roar.\u003c/p\u003e\u003cp\u003eThe BBC was given rare access to Jiuquan Satellite launch centre in Gansu and we were just over a kilometre away when the Shenzhou 19 spacecraft blasted off early on Wednesday.\u003c/p\u003e\u003cp\u003eIt is crewed by three taikonauts - China’s word for astronauts - who are the latest in a series of explorers to head to the country’s homegrown space station, Tiangong, or \u0026#34;Heavenly Palace\u0026#34;.\u003c/p\u003e\u003cp\u003eThey will use it as a base for six months to conduct experiments and carry out spacewalks as the country tries to gain experience and intelligence for its eventual mission to put someone from China on the Moon by 2030.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eJust two years ago, President Xi Jinping declared that \u0026#34;to explore the vast cosmos, develop the space industry and build China into a space power is our eternal dream”. \u003c/p\u003e\u003cp\u003eBut some in Washington see the country’s ambition and fast-paced progress as a real threat.\u003c/p\u003e\u003cp\u003eEarlier this year, Nasa chief Bill Nelson said the US and China were “in effect, in a race” to return to the Moon, where he fears Beijing wants to stake territorial claims.\u003c/p\u003e\u003cp\u003eHe told legislators that he believed their civilian space programme was also a military programme.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e734/live/5317a7e0-963f-11ef-90df-3f1823a91773.jpg.webp\" loading=\"lazy\" alt=\"EFE Astronauts (from left to right) Wang Haoze, Song Lingdong and Cai Xuzhe walk to the car that will take them to the site of the Shenzhou-19 Manned Spaceflight Mission near Jiuquan in Gansu Province, Chin\"/\u003e\u003cspan\u003eEFE\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eAstronauts (L-R) Wang Haoze, Song Lingdong and Cai Xuzhe wave before the launch\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003e\u0026#39;Dreams that spark glory\u0026#39;\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHowever, in Dongfeng Space City, a town built to support the launch site, China’s space programme is celebrated.\u003c/p\u003e\u003cp\u003eEvery street light is adorned with the national flag. \u003c/p\u003e\u003cp\u003eCartoon-like astronaut figurines and sculptures sit in the centre of children’s parks and plastic rockets are a centrepiece on most traffic roundabouts.\u003c/p\u003e\u003cp\u003eA huge poster with Xi Jinping on one side and a photo of the Shenzhou spacecraft on the other greets you as you drive into the main compound.\u003c/p\u003e\u003cp\u003eHundreds have gathered in the dark after midnight to wave flags and brightly coloured lights as the Taikonauts make their last few steps on Earth before heading to the launch site.\u003c/p\u003e\u003cp\u003eThe brass band strikes up Ode to the Motherland as young children, kept up late for the occasion, their cheeks adorned with the Chinese flag, all shout in full song.\u003c/p\u003e\u003cp\u003eThis is a moment of national pride.\u003c/p\u003e\u003cp\u003eThe pilot of this mission, Cai Xuzhe, is a veteran but he’s travelling with a new generation of Chinese-trained taikonauts born in 1990 – including China’s first female space engineer, Wang Haoze.\u003c/p\u003e\u003cp\u003e“Their youthful energy has made me feel younger and even more confident,” he told the gathered media ahead of take-off.\u003c/p\u003e\u003cp\u003e“Inspired by dreams that spark glory, and by glory that ignites new dreams, we assure the party and the people that we will stay true to our mission, with our hearts and minds fully devoted. We will strive to achieve new accomplishments in China’s crewed space programme.”\u003c/p\u003e\u003cp\u003eStanding to his left, beaming, is Song Lingdong. \u003c/p\u003e\u003cp\u003eHe recalls watching one of China’s first space station missions as a 13-year-old with “excitement and awe”. He chose to become a pilot in the hope that this is how he could serve his country.\u003c/p\u003e\u003cp\u003eAll three convey their deep sense of national pride, and state media has emphasised that this will be its “youngest crew” to date.\u003c/p\u003e\u003cp\u003eThe message is clear: this is a new generation of space travellers and an investment in the country’s future.\u003c/p\u003e\u003cp\u003eChina has already selected its next group of astronauts and they will train for potential lunar missions as well as to crew the space station.\u003c/p\u003e\u003cp\u003e“I am determined not to let down the trust placed in me,” says Song. “I will strive to make our country’s name shine once again in space.”\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/27ad/live/732504b0-95e5-11ef-ba4d-5b04a90bcb33.jpg.webp\" loading=\"lazy\" alt=\"BBC/ Xiqing Wang The base of the rocket encased in blue scaffolding\"/\u003e\u003cspan\u003eBBC/ Xiqing Wang\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eChina’s name has been \u0026#34;shining brightly\u0026#34; a lot lately when it comes to headlines about its space programme.\u003c/p\u003e\u003cp\u003eEarlier this year, the country achieved a historic first by retrieving rock and soil samples from the far side of the Moon.\u003c/p\u003e\u003cp\u003eIn 2021, China safely landed a spacecraft on Mars and released its Zhurong rover – becoming just the second nation to do so.\u003c/p\u003e\u003cp\u003eChina also has a fleet of satellites in space and has plans for many more.\u003c/p\u003e\u003cp\u003eIn August it launched the first 18 of what it hopes will eventually be a constellation of 14,000 satellites providing broadband internet coverage from space, which it hopes will one day rival SpaceX’s Starlink.\u003c/p\u003e\u003cp\u003eElon Musk, Starlink\u0026#39;s chief executive, admitted on his own platform X that China’s space programme is far more advanced than people realise.\u003c/p\u003e\u003cp\u003eBut others in the US are voicing even greater concerns, as they fear this technology can be weaponised.\u003c/p\u003e\u003cp\u003eThe head of US Space Command, General Stephen Whiting, told a space symposium in April that China and Russia were both investing heavily in space at a “breath-taking speed”.\u003c/p\u003e\u003cp\u003eHe claimed that since 2018, China has tripled the amount of intelligence, surveillance and reconnaissance satellites it has in orbit, building a “kill web over the Pacific Ocean to find, fix, track and target United States and allied military capabilities”.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eThe new space race\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eChina’s space exploration is a “collective mission for humanity”, says Li Yingliang, director of the general technology bureau of China’s Manned Space Agency, dismissing US concerns as “unnecessary”.\u003c/p\u003e\u003cp\u003e“I don’t think this should be called a competition… China has long upheld the notion of peaceful use of space in its manned space programme. In the future, we will further develop international co-operation in various aspects of manned space technology, all based on sharing and collaboration,” he adds.\u003c/p\u003e\u003cp\u003eBut the new space race is no longer about getting to the Moon. It’s about who will control its resources.\u003c/p\u003e\u003cp\u003eThe Moon contains minerals, including rare earths, metals like iron and titanium - and helium too, which is used in everything from superconductors to medical equipment.\u003c/p\u003e\u003cp\u003eEstimates for the value of all this vary wildly, from billions to quadrillions. So it’s easy to see why some see the Moon as a place to make lots of money. However, it’s also important to note that this would be a very long-term investment - and the tech needed to extract and return these lunar resources is some way off, \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cxwwjlrk1mlo\"\u003ewrites the BBC\u0026#39;s science editor Rebecca Morelle\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eChinese experts at the launch centre were keen to point out the benefits of Beijing’s space station experiments.\u003c/p\u003e\u003cp\u003e“We study bones, muscles, nerve cells, and the effects of microgravity on them. Through this research, we’ve discovered that osteoporosis on Earth is actually similar to bone loss in space. If we can uncover unique patterns in space, we might be able to develop special medications to counteract bone loss and muscle atrophy,” said Zhang Wei, from the Chinese Academy of Sciences.\u003c/p\u003e\u003cp\u003e“Many of these experimental results can be applied on Earth.”\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e4bc/live/b50b22b0-95e5-11ef-9260-19e6a950e830.jpg.webp\" loading=\"lazy\" alt=\"BBC/ Xiqing Wang A building next to the launch pad, which has the words - China, Jiuquan, Satellite Launch Centre - in Mandarin\"/\u003e\u003cspan\u003eBBC/ Xiqing Wang\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eChina is, at times, trying to downplay its advances. \u003c/p\u003e\u003cp\u003eAt the launch of a roadmap for its space ambitions, which include building a research station on the Moon, returning samples of Venus’s atmosphere to Earth and launching more than 30 space missions by the middle of this century, Ding Chibiao from the Chinese Academy of Sciences said the country did not have a great number of achievements “compared to developed nations”.\u003c/p\u003e\u003cp\u003eAnd even here at the launch centre, they admit to “significant challenges” as they try to land a crew on the Moon.\u003c/p\u003e\u003cp\u003e“The technology is complex, there\u0026#39;s a tight schedule, and there are a lot of challenges,” said Lin Xiqiang, spokesperson for the China Manned Space Agency.\u003c/p\u003e\u003cp\u003e“We\u0026#39;ll keep up the spirit of \u0026#39;two bombs and one star\u0026#39;. We will maintain our self-confidence and commitment to self-improvement, keep working together and keep pushing forward. We\u0026#39;ll make the Chinese people\u0026#39;s dream of landing on the Moon a reality in the near future.”\u003c/p\u003e\u003cp\u003eThat’s perhaps why President Xi appears to be prioritising the country’s space programme even as the economy is in a slow decline.\u003c/p\u003e\u003cp\u003eAnd even though they are bringing along international press to witness their progress – there are key restrictions.\u003c/p\u003e\u003cp\u003eWe have been kept in a hotel three hours from the launch site and transported back and forth by bus, a total journey of 12 hours, rather than leave us on site for a few hours.\u003c/p\u003e\u003cp\u003eA simple trip to a friendly local restaurant was carefully guarded by a line of security personnel.\u003c/p\u003e\u003cp\u003eWe also noticed a large sign in town holds a stern warning: “It’s a crime to leak secrets. It’s an honour to keep secrets. You’ll be jailed if you leak secrets. You’ll be happy if you keep secrets. You’ll be shot if you sell secrets.”\u003c/p\u003e\u003cp\u003eChina is taking no chances with its new technology, as its rivalry with the United States is no longer just here on Earth. \u003c/p\u003e\u003cp\u003eThe world’s two most powerful countries could soon be staking territorial claims well beyond this planet.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-29T21:52:20.321Z",
  "modifiedTime": null
}
