{
  "id": "7636a17c-2daa-4728-a544-450b586b3f19",
  "title": "Boeing denies drop in output after report of 737 setback",
  "link": "https://finance.yahoo.com/news/boeing-slowed-production-737-max-055352957.html",
  "description": "",
  "author": "",
  "published": "2025-04-01T05:53:52Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Reuters",
  "length": 2534,
  "excerpt": "Boeing's progress in reaching a production ceiling of 38 of the jets a month, imposed by the Federal Aviation Administration in the wake of an in-flight...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. In This Article: (Reuters) -Boeing on Tuesday denied fluctuations in the production of its 737 MAX jetliner after an industry publication said it had hit a key target only to fall back due to industrial delays. Boeing's progress in reaching a production ceiling of 38 of the jets a month, imposed by the Federal Aviation Administration in the wake of an in-flight blowout just over a year ago, is crucial to the planemaker's recovery from a string of crises. Aviation news service The Air Current reported that output of Boeing's best-selling jet had reached 38 planes in February and then fallen to a rate of 31 per month due to delays in fitting wing systems. A Boeing spokesperson, in a statement responding to the report, said the 737 program had not reached a rate of 38 a month so far this year, and production had not been reduced. The spokesperson did not give a current production rate or comment on the reported details surrounding wing production. \"Our team continues to focus on production stability and quality as we methodically increase 737 production,” the spokesperson said. The Air Current reported that unfinished assembly tasks in wing systems installation had spiked sharply, with the issue persisting through March. Boeing slowed some earlier parts of its wing production to catch up with the delays, it added. Citing people familiar with its progress, the publication reported that Boeing was pulling in help from across the factory and was slowing parts of its process to allow machinists to deal with the bottleneck, which one called \"a significant backlog\". Boeing's production of its major cash cow was capped at 38 a month by federal regulators following the mid-air blowout of a door plug on an Alaska Airlines jet early last year. The company has been reviewing its quality systems as it restores output. Boeing has said it hopes to return to a speed of 38 a month and then push on to 42 some time this year, subject to approval. Ryanair CEO Michael O'Leary, who as one of Boeing's largest customers is briefed regularly on the progress of jets on order, said last week that Boeing had produced 32 MAX jets in March and aimed to reach 38 a month by the end of April. Boeing also aims to reach 42 a month by September or October and 48 within 12-18 months, he told Reuters in an interview. (Reporting by Rhea Rose Abraham in Bengaluru, Tim Hepher in Paris; Editing by Rashmi Aich, Savio D'Souza and Jan Harvey)",
  "image": "https://media.zenfs.com/en/reuters-finance.com/daf573f1e737414f03efd2d15d52e9f0",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e \u003cdiv role=\"heading\" aria-level=\"2\" aria-label=\"Unlock stock picks and a broker-level newsfeed that powers Wall Street.\"\u003e\u003cp\u003e\u003cspan\u003eUnlock stock picks and a broker-level newsfeed that powers Wall Street.\u003c/span\u003e\u003c/p\u003e \u003c/div\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e  \u003cp\u003e(Reuters) -Boeing on Tuesday denied fluctuations in the production of its 737 MAX jetliner after an industry publication said it had hit a key target only to fall back due to industrial delays.\u003c/p\u003e  \u003cp\u003eBoeing\u0026#39;s progress in reaching a production ceiling of 38 of the jets a month, imposed by the Federal Aviation Administration in the wake of an in-flight blowout just over a year ago, is crucial to the planemaker\u0026#39;s recovery from a string of crises.\u003c/p\u003e    \u003cp\u003eAviation news service The Air Current reported that output of Boeing\u0026#39;s best-selling jet had reached 38 planes in February and then fallen to a rate of 31 per month due to delays in fitting wing systems.\u003c/p\u003e  \u003cp\u003eA Boeing spokesperson, in a statement responding to the report, said the 737 program had not reached a rate of 38 a month so far this year, and production had not been reduced.\u003c/p\u003e  \u003cp\u003eThe spokesperson did not give a current production rate or comment on the reported details surrounding wing production.\u003c/p\u003e  \u003cp\u003e\u0026#34;Our team continues to focus on production stability and quality as we methodically increase 737 production,” the spokesperson said.\u003c/p\u003e  \u003cp\u003eThe Air Current reported that unfinished assembly tasks in wing systems installation had spiked sharply, with the issue persisting through March. Boeing slowed some earlier parts of its wing production to catch up with the delays, it added.\u003c/p\u003e  \u003cp\u003eCiting people familiar with its progress, the publication reported that Boeing was pulling in help from across the factory and was slowing parts of its process to allow machinists to deal with the bottleneck, which one called \u0026#34;a significant backlog\u0026#34;.\u003c/p\u003e    \u003cp\u003eBoeing\u0026#39;s production of its major cash cow was capped at 38 a month by federal regulators following the mid-air blowout of a door plug on an Alaska Airlines jet early last year. The company has been reviewing its quality systems as it restores output.\u003c/p\u003e  \u003cp\u003eBoeing has said it hopes to return to a speed of 38 a month and then push on to 42 some time this year, subject to approval.\u003c/p\u003e  \u003cp\u003eRyanair CEO Michael O\u0026#39;Leary, who as one of Boeing\u0026#39;s largest customers is briefed regularly on the progress of jets on order, said last week that Boeing had produced 32 MAX jets in March and aimed to reach 38 a month by the end of April.\u003c/p\u003e  \u003cp\u003eBoeing also aims to reach 42 a month by September or October and 48 within 12-18 months, he told Reuters in an interview.\u003c/p\u003e  \u003cp\u003e(Reporting by Rhea Rose Abraham in Bengaluru, Tim Hepher in Paris; Editing by Rashmi Aich, Savio D\u0026#39;Souza and Jan Harvey)\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e    \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-545e2e86-7de9-4fc8-945b-db12843b8cfa\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-e43c6485-a683-4db5-9c7e-9a4c98c77a6a\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-a2219d37-ccfb-4478-9f54-aa62c3e32aa3\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-8a44a6de-354f-4abc-8b02-5a5197163c4d\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-286146ae-38a4-4e56-8dc1-fe435354f899\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-31a738aa-0818-46dd-b75b-77a5dd7b9927\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-1f629c46-ffdc-4131-8295-8cb7b1fb157d\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-01T05:53:52Z",
  "modifiedTime": null
}
