{
  "id": "77350f98-6e3f-4558-b379-0cceb4dfdef1",
  "title": "RFK Jr. kept asking to see the science that vaccines were safe. After he saw it, he dismissed it",
  "link": "https://www.yahoo.com/news/rfk-jr-presented-science-vaccines-003219171.html",
  "description": "",
  "author": "",
  "published": "2025-01-31T00:32:19Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "LAURAN NEERGAARD and MIKE STOBBE",
  "length": 5581,
  "excerpt": "The man who hopes to be President Donald Trump’s health secretary repeatedly asked to see “data” or “science” showing vaccines are safe – but when an...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "WASHINGTON (AP) — The man who hopes to be President Donald Trump’s health secretary repeatedly asked to see “data” or “science” showing vaccines are safe – but when an influential Republican senator showed him evidence, he dismissed it.Robert F. Kennedy Jr. spent two days this week insisting to senators that he’s not anti-vaccine. He said that he instead supports vaccinations and will follow the science in overseeing the $1.7 trillion Department of Health and Human Services, which, among other duties, oversees vaccine research, approval and recommendations.But Kennedy repeatedly refused to acknowledge scientific consensus that childhood vaccines don’t cause autism and that COVID-19 vaccines saved millions of lives, and he falsely asserted the government has no good vaccine safety monitoring. While appearing to ignore mainstream science, he cited flawed or tangential research to make his points, such as suggesting Black people may need different vaccines than whites.His responses raised concern among health experts that Kennedy lacks basic skills needed for the job.“He ignores science. He cherry-picks sometimes fraudulent studies. Sometimes he takes well-done studies and takes little pieces of them out of context,” said Dr. Sean O’Leary of the American Academy of Pediatrics.He worries that Kennedy could further damage public confidence in vaccines and “we will see return of diseases that we really haven’t seen much of and unfortunately children will suffer.”Kennedy “in many ways demonstrated his lack of capacity to really understand some details around science and evidence that I think he would really need to know,” said Dr. Georges Benjamin of the American Public Health Association.The science on vaccines is clear to doctors and scientists — but not to KennedySen. Bill Cassidy, a Louisiana Republican and physician, said the science is clear that measles and other childhood vaccines are safe and not linked to autism.Kennedy said if shown the data he would recommend those vaccines and “not only will I do that but I will apologize for any statements that misled people otherwise.”So Cassidy pulled out and read aloud definitive scientific conclusions that vaccines don’t cause autism. Kennedy rebuffed him, instead mentioning a recent paper that outside experts have called fundamentally flawed — and Cassidy agreed “has some issues” – in an attempt to counter decades of rigorous studies.The senator told Kennedy his history of “undermining confidence in vaccines with unfounded or misleading arguments concerns me” – and risks casting “a shadow over President Trump’s legacy” if people die of vaccine-preventable diseases should he become health secretary.Sen. Maggie Hassan, a Democrat from New Hampshire, said there’s a real-world ramification for “re-litigating and churning settled science” – diverting money and time that could be spent finding the real cause of autism.Kennedy ignored science showing COVID-19 vaccines saved millions of livesKennedy claimed there's no good surveillance system to know that COVID-19 vaccines are safe and lifesaving.The U.S. tracks vaccine safety through multiple monitoring systems including electronic medical records from a list of health systems. The Centers for Disease Control and Prevention also checks how vaccines fare internationally, such as during the pandemic when large databases from Israel and the U.K. helped reinforce that the new mRNA vaccines were safe and lowering deaths from the coronavirus.“You’re applying for the job — clearly you should know this,\" said Democratic Sen. Bernie Sanders of Vermont. “The scientific community has established that COVID vaccines saved millions of lives and you’re casting doubt.”Kennedy declines to back a vaccine that prevents cancer in womenAAP's O'Leary said there are about 35,000 cases of cancer related to the HPV virus that could be prevented by that vaccine, including 4,000 deaths per year. “We are already seeing decreases in the number of cases of HPV-related cancers as a result of HPV vaccination.”Kennedy didn't answer directly when asked if he stood by claims that the HPV vaccine could cause cancer or other disease. He instead brought up a pending lawsuit and suggested a jury — of non-scientists — would decide.Kennedy's unfounded comment about race and vaccine schedulesSen. Angela Alsobrooks, a Maryland Democrat, asked Kennedy about prior comments that Black people might need a different vaccination schedule than whites. Alsobrooks, who is Black, asked how Kennedy thought she should have been vaccinated differently.Kennedy referred to some earlier papers suggesting people of African-American ancestry had a stronger immune response to measles and rubella vaccines than white people.Vaccination recommendations aren’t based on race but on biological factors such as someone’s age and risk of a specific disease. Some studies show Black Americans are more hesitant than whites to receive certain vaccines.“That is so dangerous,” Alsobrooks told Kennedy.“There’s no evidence that there needs to be a different vaccine schedule based on race,” said Dr. Amesh Adalja of the Johns Hopkins Center for Health Security. Such statements could make different populations wrongly believe “well, maybe I don’t need as many vaccines” as are recommended.___AP Medical Writer Carla K. Johnson contributed.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
  "image": "https://s.yimg.com/ny/api/res/1.2/YdceCur3NuN.bZyXN9yTNQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap.org/92cc2f1494ac5e65ebfcf310c311c6ba",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eWASHINGTON (AP) — The man who hopes to be President Donald Trump’s health secretary repeatedly asked to see “data” or “science” showing vaccines are safe – but when an influential Republican senator showed him evidence, he dismissed it.\u003c/p\u003e\u003cp\u003eRobert F. Kennedy Jr. spent two days this week insisting to senators that he’s not anti-vaccine. He said that he instead supports vaccinations and will follow the science in overseeing the $1.7 trillion Department of Health and Human Services, which, among other duties, oversees vaccine research, approval and recommendations.\u003c/p\u003e\u003cp\u003eBut Kennedy repeatedly refused to acknowledge scientific consensus that childhood vaccines don’t cause autism and that COVID-19 vaccines saved millions of lives, and he falsely asserted the government has no good vaccine safety monitoring. While appearing to ignore mainstream science, he cited flawed or tangential research to make his points, such as suggesting Black people may need different vaccines than whites.\u003c/p\u003e\u003cp\u003eHis responses raised concern among health experts that Kennedy lacks basic skills needed for the job.\u003c/p\u003e\u003cp\u003e“He ignores science. He cherry-picks sometimes fraudulent studies. Sometimes he takes well-done studies and takes little pieces of them out of context,” said Dr. Sean O’Leary of the American Academy of Pediatrics.\u003c/p\u003e\u003cp\u003eHe worries that Kennedy could further damage public confidence in vaccines and “we will see return of diseases that we really haven’t seen much of and unfortunately children will suffer.”\u003c/p\u003e\u003cp\u003eKennedy “in many ways demonstrated his lack of capacity to really understand some details around science and evidence that I think he would really need to know,” said Dr. Georges Benjamin of the American Public Health Association.\u003c/p\u003e\u003cp\u003eThe science on vaccines is clear to doctors and scientists — but not to Kennedy\u003c/p\u003e\u003cp\u003eSen. Bill Cassidy, a Louisiana Republican and physician, said the science is clear that measles and other childhood vaccines are safe and not linked to autism.\u003c/p\u003e\u003cp\u003eKennedy said if shown the data he would recommend those vaccines and “not only will I do that but I will apologize for any statements that misled people otherwise.”\u003c/p\u003e\u003cp\u003eSo Cassidy pulled out and read aloud definitive scientific conclusions that vaccines don’t cause autism. Kennedy rebuffed him, instead mentioning a recent paper that outside experts have called fundamentally flawed — and Cassidy agreed “has some issues” – in an attempt to counter decades of rigorous studies.\u003c/p\u003e\u003cp\u003eThe senator told Kennedy his history of “undermining confidence in vaccines with unfounded or misleading arguments concerns me” – and risks casting “a shadow over President Trump’s legacy” if people die of vaccine-preventable diseases should he become health secretary.\u003c/p\u003e\u003cp\u003eSen. Maggie Hassan, a Democrat from New Hampshire, said there’s a real-world ramification for “re-litigating and churning settled science” – diverting money and time that could be spent finding the real cause of autism.\u003c/p\u003e\u003cp\u003eKennedy ignored science showing COVID-19 vaccines saved millions of lives\u003c/p\u003e\u003cp\u003eKennedy claimed there\u0026#39;s no good surveillance system to know that COVID-19 vaccines are safe and lifesaving.\u003c/p\u003e\u003cp\u003eThe U.S. tracks vaccine safety through multiple monitoring systems including electronic medical records from a list of health systems. The Centers for Disease Control and Prevention also checks how vaccines fare internationally, such as during the pandemic when large databases from Israel and the U.K. helped reinforce that the new mRNA vaccines were safe and lowering deaths from the coronavirus.\u003c/p\u003e\u003cp\u003e“You’re applying for the job — clearly you should know this,\u0026#34; said Democratic Sen. Bernie Sanders of Vermont. “The scientific community has established that COVID vaccines saved millions of lives and you’re casting doubt.”\u003c/p\u003e\u003cp\u003eKennedy declines to back a vaccine that prevents cancer in women\u003c/p\u003e\u003cp\u003eAAP\u0026#39;s O\u0026#39;Leary said there are about 35,000 cases of cancer related to the HPV virus that could be prevented by that vaccine, including 4,000 deaths per year. “We are already seeing decreases in the number of cases of HPV-related cancers as a result of HPV vaccination.”\u003c/p\u003e\u003cp\u003eKennedy didn\u0026#39;t answer directly when asked if he stood by claims that the HPV vaccine could cause cancer or other disease. He instead brought up a pending lawsuit and suggested a jury — of non-scientists — would decide.\u003c/p\u003e\u003cp\u003eKennedy\u0026#39;s unfounded comment about race and vaccine schedules\u003c/p\u003e\u003cp\u003eSen. Angela Alsobrooks, a Maryland Democrat, asked Kennedy about prior comments that Black people might need a different vaccination schedule than whites. Alsobrooks, who is Black, asked how Kennedy thought she should have been vaccinated differently.\u003c/p\u003e\u003cp\u003eKennedy referred to some earlier papers suggesting people of African-American ancestry had a stronger immune response to measles and rubella vaccines than white people.\u003c/p\u003e\u003cp\u003eVaccination recommendations aren’t based on race but on biological factors such as someone’s age and risk of a specific disease. Some studies show Black Americans are more hesitant than whites to receive certain vaccines.\u003c/p\u003e\u003cp\u003e“That is so dangerous,” Alsobrooks told Kennedy.\u003c/p\u003e\u003cp\u003e“There’s no evidence that there needs to be a different vaccine schedule based on race,” said Dr. Amesh Adalja of the Johns Hopkins Center for Health Security. Such statements could make different populations wrongly believe “well, maybe I don’t need as many vaccines” as are recommended.\u003c/p\u003e\u003cp\u003e___\u003c/p\u003e\u003cp\u003eAP Medical Writer Carla K. Johnson contributed.\u003c/p\u003e\u003cp\u003e___\u003c/p\u003e\u003cp\u003eThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-31T16:44:41Z",
  "modifiedTime": null
}
