{
  "id": "863416a3-9e49-4db3-929e-34a2c2fcc930",
  "title": "US judge declines to block Elon Musk's DOGE from Labor Department systems",
  "link": "https://www.yahoo.com/news/us-judge-declines-block-elon-040115653.html",
  "description": "",
  "author": "",
  "published": "2025-02-08T04:01:15Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Reuters",
  "length": 3440,
  "excerpt": "The temporary ruling by U.S. District Judge John Bates in Washington, D.C., is the first step in a lawsuit against the Labor Department by one of the largest...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "(Reuters) -A federal judge on Friday declined to block Elon Musk's government cost-cutting department from accessing the U.S. Department of Labor's systems, an initial setback for the government employee unions resisting his efforts to shrink the federal bureaucracy.The temporary ruling by U.S. District Judge John Bates in Washington, D.C., is the first step in a lawsuit against the Labor Department by one of the largest U.S. labor unions, which alleges billionaire Musk could obtain sensitive information about investigations into his own companies and competitors by accessing government computer systems.Bates ruled that \"although the Court harbors concerns about defendants’ alleged conduct,\" the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) had not shown it was harmed by the Labor Department's actions.AFL-CIO President Liz Shuler said in a statement that the decision was \"a setback, but not a defeat,\" and that the union would provide more evidence to support its claims. A Department of Labor spokesperson did not immediately respond to a request for comment sent late on Friday.President Donald Trump has deputized Musk, the world's richest person and owner of electric vehicle company Tesla, space technology company SpaceX and other businesses, with leading the so-called Department of Government Efficiency, or DOGE, to identify fraud and waste in the government.Musk's efforts have alarmed lawmakers and advocacy groups who say he is overstepping his authority by seeking to dismantle agencies responsible for critical government programs and fire federal workers en masse.Another group of federal employee unions and retirees has sued the Treasury Department to block what it says is the unlawful transmission of sensitive payment records to DOGE personnel. Treasury temporarily agreed on Wednesday not to give further access while the case plays out.In the Labor Department lawsuit, the AFL-CIO asked the court to block what it said was Musk's imminent plan to access department systems.The union, which represents roughly 800,000 government workers, said that would potentially give Musk access to non-public information from the Occupational Safety and Health Administration's probes into SpaceX, Tesla and his tunneling company, The Boring Company, as well as investigations into his competitors.The union also said that in the absence of court intervention, DOGE could access Bureau of Labor Statistics data about the health of the economy and sensitive information about government employees, including the identities of those who have filed worker compensation claims or sought protection for wage and hour complaints.The White House has said Musk will recuse himself from matters in which he has a conflict of interest. As a so-called special government employee, he is subject to some but not all conflict-of-interest and ethics rules for federal workers.Musk's rapid takeover of U.S. government agencies has enabled the South African-born businessman to exert unprecedented control over America's 2.2-million-member federal workforce and begin a dramatic reshaping of government.Musk has already moved to shut down the U.S. Agency for International Development and says USAID is canceling scores of government consulting contracts and underutilized leases.(Reporting by Jack Queen in New York and David Bario, Editing by Alexia Garamfalvi, William Mallard and Shri Navaratnam)",
  "image": "https://media.zenfs.com/en/reuters.com/bf2a2619f31b95a4715541d5e467705c",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003e(Reuters) -A federal judge on Friday declined to block Elon Musk\u0026#39;s government cost-cutting department from accessing the U.S. Department of Labor\u0026#39;s systems, an initial setback for the government employee unions resisting his efforts to shrink the federal bureaucracy.\u003c/p\u003e\u003cp\u003eThe temporary ruling by U.S. District Judge John Bates in Washington, D.C., is the first step in a lawsuit against the Labor Department by one of the largest U.S. labor unions, which alleges billionaire Musk could obtain sensitive information about investigations into his own companies and competitors by accessing government computer systems.\u003c/p\u003e\u003cp\u003eBates ruled that \u0026#34;although the Court harbors concerns about defendants’ alleged conduct,\u0026#34; the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) had not shown it was harmed by the Labor Department\u0026#39;s actions.\u003c/p\u003e\u003cp\u003eAFL-CIO President Liz Shuler said in a statement that the decision was \u0026#34;a setback, but not a defeat,\u0026#34; and that the union would provide more evidence to support its claims. A Department of Labor spokesperson did not immediately respond to a request for comment sent late on Friday.\u003c/p\u003e\u003cp\u003ePresident Donald Trump has deputized Musk, the world\u0026#39;s richest person and owner of electric vehicle company Tesla, space technology company SpaceX and other businesses, with leading the so-called Department of Government Efficiency, or DOGE, to identify fraud and waste in the government.\u003c/p\u003e\u003cp\u003eMusk\u0026#39;s efforts have alarmed lawmakers and advocacy groups who say he is overstepping his authority by seeking to dismantle agencies responsible for critical government programs and fire federal workers en masse.\u003c/p\u003e\u003cp\u003eAnother group of federal employee unions and retirees has sued the Treasury Department to block what it says is the unlawful transmission of sensitive payment records to DOGE personnel. Treasury temporarily agreed on Wednesday not to give further access while the case plays out.\u003c/p\u003e\u003cp\u003eIn the Labor Department lawsuit, the AFL-CIO asked the court to block what it said was Musk\u0026#39;s imminent plan to access department systems.\u003c/p\u003e\u003cp\u003eThe union, which represents roughly 800,000 government workers, said that would potentially give Musk access to non-public information from the Occupational Safety and Health Administration\u0026#39;s probes into SpaceX, Tesla and his tunneling company, The Boring Company, as well as investigations into his competitors.\u003c/p\u003e\u003cp\u003eThe union also said that in the absence of court intervention, DOGE could access Bureau of Labor Statistics data about the health of the economy and sensitive information about government employees, including the identities of those who have filed worker compensation claims or sought protection for wage and hour complaints.\u003c/p\u003e\u003cp\u003eThe White House has said Musk will recuse himself from matters in which he has a conflict of interest. As a so-called special government employee, he is subject to some but not all conflict-of-interest and ethics rules for federal workers.\u003c/p\u003e\u003cp\u003eMusk\u0026#39;s rapid takeover of U.S. government agencies has enabled the South African-born businessman to exert unprecedented control over America\u0026#39;s 2.2-million-member federal workforce and begin a dramatic reshaping of government.\u003c/p\u003e\u003cp\u003eMusk has already moved to shut down the U.S. Agency for International Development and says USAID is canceling scores of government consulting contracts and underutilized leases.\u003c/p\u003e\u003cp\u003e(Reporting by Jack Queen in New York and David Bario, Editing by Alexia Garamfalvi, William Mallard and Shri Navaratnam)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-08T04:01:15Z",
  "modifiedTime": null
}
