{
  "id": "86b0e11d-af1b-4cc4-84b9-bc59d70237d8",
  "title": "Deep inside U.S. economy, more sticker prices start going up due to tariffs, and inventory is headed down",
  "link": "https://www.cnbc.com/2025/06/27/deep-inside-economy-more-sticker-prices-start-to-go-up-due-to-tariffs.html",
  "description": "Across U.S. distribution networks, inside retail and manufacturing warehouses, there's a widespread move to adjust prices higher due to tariffs.",
  "author": "",
  "published": "Fri, 27 Jun 2025 16:52:37 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Lori Ann LaRocco",
  "length": 8037,
  "excerpt": "Across U.S. distribution networks, inside retail and manufacturing warehouses, there's a widespread move to adjust prices higher due to tariffs.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Albany Times Union/hearst Newspapers | Hearst Newspapers | Getty ImagesOn the surface of the U.S. economy, prices are higher. The latest inflation data out on Friday from the government showed a bigger uptick than forecast. On Thursday, Nike said it took a $1 billion hit due to tariffs and the fact that price increases have yet to be implemented.Inside the U.S. economy, within distribution networks that manage inventory, there are fewer items overall due to the trade war, but more goods on which sticker prices are going up.\"We are now seeing multiple customers increasing pricing,\" said Ryan Martin, president of distribution and fulfillment for ITS Logistics.While price tags are placed on items at the manufacturer, Martin said over the past month his company has started re-ticketing \"millions of units of products for many customers,\" items ranging from apparel to consumer products in the warehouse being prepped for eventual delivery or immediate transport to stores.Depending on the product, price increases range from 8%-15%, he said.\"This is creating additional inflation,\" Martin said. It is happening in e-commerce as well, he said, though the price change is reflected online, not on the product.A new survey from the Footwear Distributors and Retailers of America for Q2 shows 55% of respondents expect their average retail price to rise between 6%-10% in 2025 as a result of tariffs.Martin says the last time he saw this amount of re-ticketing was during the pandemic, and it was much higher then.\"Everything was getting more expensive at that time, transportation, labor and quantities of product,\" he said. \"We saw increases across all products, including food and beverage,\" he said. \"Re-ticketing was between 30%-40%.\"It's not just higher prices but less inventoryWith current concerns about trade uncertainty and consumer softness, retailers and manufacturing clients are managing inventory by shrinking SKU counts and importing fewer SKUs they are keeping. The Bureau of Economic Analysis reported that gross domestic product shrank by 0.5% in the first quarter of 2025.\"The overall inventory footprint is smaller,\" said Martin. \"You are looking at three months of inventory on hand now versus six.\"Supply chain data from the warehouse sector and the growing number of empty shipping containers at ports are pointing to a more mild peak season (the summer buildup of inventory for the back-to-school and holiday shopping periods).Warehouse inventory levels are down 6% month over month, according to the Logistics Managers' Index.Comparing readings from the first half of June to later in the month, growth in inventories started to slow down, which suggests that an increase in early June was temporary, according to Zachary Rogers, associate professor of supply chain management at Colorado State University. \"Because of how long it takes inventories to move through systems, we haven't seen any big shifts in transportation yet,\" said Rogers. \"Warehouse capacity did move from mild contraction to mild expansion.\"The data for the full month of June is not in yet, but Rogers said it is highly unlikely the results would change in any meaningful way. \"We're far enough along that we basically know where they'll end up,\" he said.Rogers explained the mild expansion seen earlier in the month was consistent with the containers that were processed at the ports. U.S. importers have been hesitant to pull forward full ocean freight orders because of the tariffs. The 50% tariff on Chinese goods is still too high for many retailers, even after a recent pause in higher tariffs President Donald Trump has threatened on Chinese goods.The West Coast ports are now seeing a small bump in containers starting to arrive for the holidays. But based on the Port of Los Angeles Optimizer, which tracks the ocean trade destined for the Ports of Los Angeles and Long Beach, July imports will be lower than July 2024.\"This is notable because July moving into August is when we would expect to see the numbers going up,\" Rogers said.  On the East Coast, the situation is different.The Port of New York and New Jersey, the largest port on the East Coast, released its May monthly container data on Thursday, showing the port processed 774,698 twenty-foot equivalent units, or TEUs.\"The tariffs are certainly not going to impact us anywhere near as much as they are going to be on the West Coast because we don't depend on China as much as our West Coast counterparts,\" Bethann Rooney, director of the Port of New York and New Jersey, told CNBC. \"We've already seen an increase in volumes from Europe, Southeast Asia, India and Vietnam. I don't anticipate a significant surge in July, but we are going to see strong volumes.\"But Rooney added the shift is relatively small as far as rerouting of supply chains sourcing in Europe and Southeast Asia. \"We are seeing maybe a 1% change year over year,\" she said. \"Cumulatively, it makes an impact. But we're certainly not seeing a tremendous change in routing, although it is clear that many beneficial cargo owners [U.S. companies] are changing their sourcing or diversifying their sourcing.\"Empty shipping containers sit at ports longerAnother leading indicator of future freight orders is the movement of empties. Empty container trade is necessary to keep the flow of exports moving. CNBC analysis of empty containers shows there is no rush of empties leaving the Ports of Los Angeles and Long Beach to go back to be refilled.During the pandemic, empties were a priority to return to Asia so they could be refilled and exported back to the United States.\"The fact that so many empty containers are still sitting at the ports also suggests that importers are not expecting our normal August-September peak season,\" Rogers said. Trucking and warehousing will see some activity at the wholesale/distribution level throughout Q3, thanks to the wave of goods coming into the ports, with those goods eventually moving to retailers in September and October. But Rogers added, \"At this point, though, it seems highly unlikely that we will see a normal peak season.\"\"Even at present inventory levels, we already have a ton of inventory on hand, and with the tariffs that are still in place, I would expect that imports, particularly those related to manufacturing, will be lower than what we would have expected at the beginning of the year,\" he said.Another warning sign is a dramatic fall in the ocean freight rate average on the trans-Pacific route from the Far East to the U.S. West Coast since an earlier spike in June. Average spot rates have plummeted from the Far East to the U.S. West Coast by 39% since June 1, according to Peter Sand, chief shipping analyst at Xeneta. \"The Transpacific into U.S. West Coast is the key battleground for carriers when it comes to China exports, so spot rates have fallen harder and faster as they prioritized bringing capacity back onto this trade in the immediate aftermath of the lowering of 145% tariffs,\" he said.Sand said it is only a matter of time before shippers do the same on the U.S. East Coast, and spot rates begin to fall sharply there as well.This pullback in orders is being closely watched by economists. Oxford Economics wrote in a recent note that on the import side, consumer goods continued to trend lower with a $4.3 billion decline after the $33 billion fall in April. \"This was partially offset by a gain in autos, while other categories were mostly unchanged. We expect imports will trend lower over the course of the year as effective tariff rates remain elevated and the economy slows,\" it stated.\"Indecision is the best decision right now with shippers because of all the tariff talk,\" Martin said. \"No one knows what will happen tomorrow or understands the cost structure. It's better to have lean inventories in this case,\" he added. Correction: Warehouse inventory levels are down 6% month over month, according to the Logistics Managers' Index. An earlier version of this article misstated the name of the index.",
  "image": "https://image.cnbcfm.com/api/v1/image/108165146-1751033769832-gettyimages-2178398753-tu100724_pricechopperteaching2.jpeg?v=1751033796\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"SpecialReportArticle-ArticleBody-6\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"SpecialReportArticle-articleBody-6-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108165146\" data-test=\"InlineImage\"\u003e\u003cp\u003eAlbany Times Union/hearst Newspapers | Hearst Newspapers | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOn the surface of the U.S. economy, prices are higher. The \u003ca href=\"https://www.cnbc.com/2025/06/27/pce-inflation-report-may-2025-.html\"\u003elatest inflation data\u003c/a\u003e out on Friday from the government showed a bigger uptick than forecast. On Thursday, Nike said it took a $1 billion hit due to tariffs and the fact that \u003ca href=\"https://www.cnbc.com/2025/06/26/nike-nke-q4-2025-earnings.html\"\u003eprice increases have yet to be implemented\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eInside the U.S. economy, within distribution networks that manage inventory, there are fewer items overall due to the trade war, but more goods on which sticker prices are going up.\u003c/p\u003e\u003cp\u003e\u0026#34;We are now seeing multiple customers increasing pricing,\u0026#34; said Ryan Martin, president of distribution and fulfillment for ITS Logistics.\u003c/p\u003e\u003cp\u003eWhile price tags are placed on items at the manufacturer, Martin said over the past month his company has started re-ticketing \u0026#34;millions of units of products for many customers,\u0026#34; items ranging from apparel to consumer products in the warehouse being prepped for eventual delivery or immediate transport to stores.\u003c/p\u003e\u003cp\u003eDepending on the product, price increases range from 8%-15%, he said.\u003c/p\u003e\u003cp\u003e\u0026#34;This is creating additional inflation,\u0026#34; Martin said. It is happening in e-commerce as well, he said, though the price change is reflected online, not on the product.\u003c/p\u003e\u003cp\u003eA new survey from the Footwear Distributors and Retailers of America for Q2 shows 55% of respondents expect their average retail price to rise between 6%-10% in 2025 as a result of tariffs.\u003c/p\u003e\u003cp\u003eMartin says the last time he saw this amount of re-ticketing was during the pandemic, and it was much higher then.\u003c/p\u003e\u003cp\u003e\u0026#34;Everything was getting more expensive at that time, transportation, labor and quantities of product,\u0026#34; he said. \u0026#34;We saw increases across all products, including food and beverage,\u0026#34; he said. \u0026#34;Re-ticketing was between 30%-40%.\u0026#34;\u003c/p\u003e\u003ch3\u003eIt\u0026#39;s not just higher prices but less inventory\u003c/h3\u003e\u003cp\u003eWith current concerns about trade uncertainty and consumer softness, retailers and manufacturing clients are managing inventory by shrinking SKU counts and importing fewer SKUs they are keeping. The Bureau of Economic Analysis reported that gross domestic product shrank by 0.5% in the first quarter of 2025.\u003c/p\u003e\u003cp\u003e\u0026#34;The overall inventory footprint is smaller,\u0026#34; said Martin. \u0026#34;You are looking at three months of inventory on hand now versus six.\u0026#34;\u003c/p\u003e\u003cp\u003eSupply chain data from the warehouse sector and the growing number of empty shipping containers at ports are pointing to a more mild peak season (the summer buildup of inventory for the back-to-school and holiday shopping periods).\u003c/p\u003e\u003cp\u003eWarehouse inventory levels are down 6% month over month, according to the Logistics Managers\u0026#39; Index.\u003c/p\u003e\u003cp\u003eComparing readings from the first half of June to later in the month, growth in inventories started to slow down, which suggests that an increase in early June was temporary, according to Zachary Rogers, associate professor of supply chain management at Colorado State University. \u0026#34;Because of how long it takes inventories to move through systems, we haven\u0026#39;t seen any big shifts in transportation yet,\u0026#34; said Rogers. \u0026#34;Warehouse capacity did move from mild contraction to mild expansion.\u0026#34;\u003c/p\u003e\u003cp\u003eThe data for the full month of June is not in yet, but Rogers said it is highly unlikely the results would change in any meaningful way. \u0026#34;We\u0026#39;re far enough along that we basically know where they\u0026#39;ll end up,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eRogers explained the mild expansion seen earlier in the month was consistent with the containers that were processed at the ports. U.S. importers have been hesitant to pull forward full ocean freight orders because of the tariffs. The 50% tariff on Chinese goods is still too high for many retailers, even after a recent pause in higher tariffs President \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e has threatened on Chinese goods.\u003c/p\u003e\u003cp\u003eThe West Coast ports are now seeing a \u003ca href=\"https://www.cnbc.com/2025/06/24/new-freight-wave-china-tariffs-la-long-beach-ports.html\"\u003esmall bump\u003c/a\u003e in containers starting to arrive for the holidays. But based on the Port of Los Angeles Optimizer, which tracks the ocean trade destined for the Ports of Los Angeles and Long Beach, July imports will be lower than July 2024.\u003c/p\u003e\u003cp\u003e\u0026#34;This is notable because July moving into August is when we would expect to see the numbers going up,\u0026#34; Rogers said.  \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOn the East Coast, the situation is different.\u003c/p\u003e\u003cp\u003eThe Port of New York and New Jersey, the largest port on the East Coast, released its May monthly container data on Thursday, showing the port processed 774,698 twenty-foot equivalent units, or TEUs.\u003c/p\u003e\u003cp\u003e\u0026#34;The tariffs are certainly not going to impact us anywhere near as much as they are going to be on the West Coast because we don\u0026#39;t depend on China as much as our West Coast counterparts,\u0026#34; Bethann Rooney, director of the Port of New York and New Jersey, told CNBC. \u0026#34;We\u0026#39;ve already seen an increase in volumes from Europe, Southeast Asia, India and Vietnam. I don\u0026#39;t anticipate a significant surge in July, but we are going to see strong volumes.\u0026#34;\u003c/p\u003e\u003cp\u003eBut Rooney added the shift is relatively small as far as rerouting of supply chains sourcing in Europe and Southeast Asia. \u0026#34;We are seeing maybe a 1% change year over year,\u0026#34; she said. \u0026#34;Cumulatively, it makes an impact. But we\u0026#39;re certainly not seeing a tremendous change in routing, although it is clear that many beneficial cargo owners [U.S. companies] are changing their sourcing or diversifying their sourcing.\u0026#34;\u003c/p\u003e\u003ch3\u003eEmpty shipping containers sit at ports longer\u003c/h3\u003e\u003cp\u003eAnother leading indicator of future freight orders is the movement of empties. Empty container trade is necessary to keep the flow of exports moving. CNBC analysis of empty containers shows there is no rush of empties leaving the Ports of Los Angeles and Long Beach to go back to be refilled.\u003c/p\u003e\u003cp\u003eDuring the pandemic, empties were a priority to return to Asia so they could be refilled and exported back to the United States.\u003c/p\u003e\u003cp\u003e\u0026#34;The fact that so many empty containers are still sitting at the ports also suggests that importers are not expecting our normal August-September peak season,\u0026#34; Rogers said. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTrucking and warehousing will see some activity at the wholesale/distribution level throughout Q3, thanks to the wave of goods coming into the ports, with those goods eventually moving to retailers in September and October. But Rogers added, \u0026#34;At this point, though, it seems highly unlikely that we will see a normal peak season.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Even at present inventory levels, we already have a ton of inventory on hand, and with the tariffs that are still in place, I would expect that imports, particularly those related to manufacturing, will be lower than what we would have expected at the beginning of the year,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eAnother warning sign is a dramatic fall in the ocean freight rate average on the trans-Pacific route from the Far East to the U.S. West Coast since an earlier spike in June. Average spot rates have plummeted from the Far East to the U.S. West Coast by 39% since June 1, according to Peter Sand, chief shipping analyst at Xeneta. \u0026#34;The Transpacific into U.S. West Coast is the key battleground for carriers when it comes to China exports, so spot rates have fallen harder and faster as they prioritized bringing capacity back onto this trade in the immediate aftermath of the lowering of 145% tariffs,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eSand said it is only a matter of time before shippers do the same on the U.S. East Coast, and spot rates begin to fall sharply there as well.\u003c/p\u003e\u003cp\u003eThis pullback in orders is being closely watched by economists. Oxford Economics wrote in a recent note that on the import side, consumer goods continued to trend lower with a $4.3 billion decline after the $33 billion fall in April. \u0026#34;This was partially offset by a gain in autos, while other categories were mostly unchanged. We expect imports will trend lower over the course of the year as effective tariff rates remain elevated and the economy slows,\u0026#34; it stated.\u003c/p\u003e\u003cp\u003e\u0026#34;Indecision is the best decision right now with shippers because of all the tariff talk,\u0026#34; Martin said. \u0026#34;No one knows what will happen tomorrow or understands the cost structure. It\u0026#39;s better to have lean inventories in this case,\u0026#34; he added. \u003c/p\u003e\u003cp\u003e\u003cem\u003eCorrection: Warehouse inventory levels are down 6% month over month, according to the Logistics Managers\u0026#39; Index. An earlier version of this article misstated the name of the index.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108165088\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000380697\" aria-labelledby=\"Placeholder-ArticleBody-Video-108165088\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108165089-17510282071751028204-40455692173-1080pnbcnews.jpg?v=1751028206\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Core inflation rate rose to 2.7% in May, personal income falls\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-06-27T14:50:21Z",
  "modifiedTime": "2025-06-27T16:52:37Z"
}
