{
  "id": "959e50c6-b82c-4aae-b378-8a1c8a09141c",
  "title": "OpenAI emails show Elon Musk wanted for-profit structure in 2017",
  "link": "https://www.cnbc.com/2024/12/13/openai-says-elon-musk-wanted-it-to-be-for-profit-in-2017.html",
  "description": "OpenAI on Friday posted screenshots showing that Elon Musk, one of its co-founders, pushed for the company to have a for-profit structure as far back as 2017.",
  "author": "",
  "published": "Fri, 13 Dec 2024 21:08:23 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Hayden Field",
  "length": 8380,
  "excerpt": "OpenAI on Friday posted screenshots showing that Elon Musk, one of its co-founders, pushed for the company to have a for-profit structure as far back as 2017.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "The logo of OpenAI is shown on a mobile phone in front of a computer screen displaying the photographs of Sam Altman, left, and Elon Musk, March 14, 2024.Muhammed Selim Korkutata | Anadolu | Getty ImagesOpenAI on Friday clapped back against Elon Musk, one of its co-founders, after the billionaire asked a federal court in November to stop the ChatGPT maker from converting to a fully for-profit business.In a blog post on the OpenAI website titled \"Elon Musk wanted an OpenAI for-profit,\" the startup alleged that in 2017 Musk \"not only wanted, but actually created, a for-profit\" to serve as the company's proposed new structure.\"When he didn't get majority equity and full control, he walked away and told us we would fail,\" OpenAI wrote in the blog post. \"Now that OpenAI is the leading AI research lab and Elon runs a competing AI company, he's asking the court to stop us from effectively pursuing our mission.\"Musk and xAI did not immediately respond to requests for comment.Since Musk announced the debut of his OpenAI competitor xAI in July 2023, the startup has released its Grok chatbot and is raising up to $6 billion at a $50 billion valuation, in part to buy 100,000 Nvidia chips, CNBC reported Nov. 15.Musk was questioning OpenAI's nonprofit model from Day 1, a member of OpenAI's legal team told CNBC.OpenAI's \"structure doesn't seem optimal,\" Musk wrote in a November 2015 email to OpenAI CEO Sam Altman, according to screenshots shared in the blog post. He added that receiving a \"salary from the nonprofit muddies the alignment of incentives\" and that it's \"probably better to have a standard C corp with a parallel nonprofit.\"In a text conversation with former board member Shivon Zilis, OpenAI co-founder Greg Brockman wrote that a conversation he had with Musk \"turned into talking about structure\" and that Musk \"said non-profit was def the right one early on, may not be the right one now,\" according to blog screenshots.Musk forwarded an article about China's strategy for AI research facilities to Brockman and fellow OpenAI co-founder Ilya Sutskever. Musk wrote that China \"will do whatever it takes to obtain what we develop. Maybe another reason to change course,\" per the blog post.Brockman agreed, and he wrote that starting in 2018, OpenAI's path would need to be a \"Al research + hardware for-profit,\" according to the blog post. Musk wrote back, \"Let's talk Sat or Sun. I have a tentative game plan that l'd like to run by you.\"Altman, Brockman, Musk and others negotiated terms for the planned OpenAI for-profit in the fall of 2017, but the talks fell apart due to disagreements about equity, control and who would be CEO, according to the blog. Musk initially proposed that he should \"unequivocally have initial control of the company\" but said \"this will change quickly\" when the board has 12 to 16 members, per screenshots.Musk created a public benefit corporation called \"Open Artificial Intelligence Technologies, Inc\" in September 2017, according to screenshots included in OpenAI's blog post. A few days later, OpenAI rejected Musk's proposed terms for the for-profit and offered to keep the conversation going, but Musk responded that his offer was \"no longer on the table\" and that \"discussions are over,\" per screenshots.In January 2018, Musk proposed that OpenAI spin into Tesla, his electric vehicle company, according to the blog.\"The only paths I can think of are a major expansion of OpenAl and a major expansion of Tesla Al. Perhaps both simultaneously. The former would require a major increase in funds donated and highly credible people joining our board. The current board situation is very weak,\" Musk wrote, according to the blog. He added that \"OpenAI is on a path of certain failure relative to Google.\"Brockman responded with a lengthy plan, including the idea that the company should \"try our best to remain a non-profit,\" according to screenshots. In February 2018, Musk resigned as co-chair of OpenAI.OpenAI's complex historyOpenAI debuted in 2015 as a nonprofit and then in 2019 converted into a \"capped-profit\" model, in which the OpenAI nonprofit was the governing entity for its for-profit subsidiary. Altman said onstage Dec. 4 at The New York Times DealBook Summit that the company decided to go to a capped-profit structure in part because Musk stopped funding it.Thanks largely to the viral spread of ChatGPT, which debuted in November 2022, OpenAI has become one of the hottest, and at times one of the most controversial, startups on the planet. The company's valuation has climbed to $157 billion since it launched ChatGPT. OpenAI has raised about $13 billion from Microsoft, and it closed its latest $6.6 billion round in October, led by Thrive Capital and including participation from chipmaker Nvidia, SoftBank and others.The company also received a $4 billion revolving line of credit, bringing its total liquidity to more than $10 billion. OpenAI expects about $5 billion in losses on $3.7 billion in revenue this year, CNBC confirmed in September with a person familiar with the situation.OpenAI is now in the midst of a potentially two-year process of converting into a fully for-profit public benefit corporation, which could make it more attractive to investors. The restructuring plan would also allow OpenAI to retain its nonprofit status as a separate entity, CNBC previously reported.OpenAI has faced increasing competition from startups such as Musk's xAI and Anthropic, as well as tech giants such as Google, Amazon and Meta. The generative AI market is predicted to top $1 trillion in revenue within a decade, and business spending on generative AI surged 500% in 2024, according to recent data from Menlo Ventures.A thorny legal battleAttorneys representing Musk, his AI startup xAI and Zilis filed for a preliminary injunction against OpenAI on Nov. 29.In their motion for preliminary injunction, attorneys for Musk argued that OpenAI should be prohibited from \"benefitting from wrongfully obtained competitively sensitive information or coordination via the Microsoft-OpenAI board interlocks.\"The latest court filings represent an escalation in the legal feud between Musk, OpenAI and Altman, as well as other long-involved parties and backers, including tech investor Reid Hoffman and Microsoft.In March, Musk sued Open AI — and co-founders Altman and Brockman — in a San Francisco state court, alleging breach of contract and fiduciary duty. In the suit, Musk claimed that the early OpenAI team had set out to develop artificial general intelligence \"for the benefit of humanity,\" but that the project had been transformed into a for-profit entity that's largely controlled by principal shareholder Microsoft.In June, Musk withdrew that complaint, and he later refiled in federal court. Attorneys for Musk in the federal suit, led by Marc Toberoff in Los Angeles, argued in their complaint that OpenAI had violated federal racketeering, or RICO, laws.In November, they expanded their complaint to include allegations that Microsoft and OpenAI had violated antitrust laws when the ChatGPT maker allegedly asked investors to agree to not invest in rival companies, including Musk's xAI.\"Microsoft and OpenAI now seek to cement this dominance by cutting off competitors' access to investment capital (a group boycott), while continuing to benefit from years' worth of shared competitively sensitive information during generative AI's formative years,\" the lawyers wrote in the November filing. They added that the terms OpenAI asked investors to agree to amounted to a \"group boycott\" that \"blocks xAI's access to essential investment capital.\"Altman at the DealBook Summit denied that OpenAI investors aren't allowed to invest in competitors. Altman said investors are welcome to do so but that the company will stop their \"information rights,\" such as sharing its research road map and other materials.Microsoft has invested nearly $14 billion in OpenAI but revealed in October that it would record a $1.5 billion loss in the current period largely due to an expected loss from the AI startup.Microsoft gave up its observer seat on OpenAI's board in July. However, the Federal Trade Commission will continue to monitor the influence of the two companies over the AI industry, CNBC reported.— CNBC's Lora Kolodny contributed reporting.WATCH: OpenAI releases AI video generation tool Sora",
  "image": "https://image.cnbcfm.com/api/v1/image/107399197-1712754405821-gettyimages-2087343447-AA_19032024_1586598.jpeg?v=1734122012\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-107399197\" data-test=\"InlineImage\"\u003e\u003cp\u003eThe logo of OpenAI is shown on a mobile phone in front of a computer screen displaying the photographs of Sam Altman, left, and Elon Musk, March 14, 2024.\u003c/p\u003e\u003cp\u003eMuhammed Selim Korkutata | Anadolu | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOpenAI on Friday clapped back against Elon Musk, one of its co-founders, after the billionaire \u003ca href=\"https://www.cnbc.com/2024/11/30/elon-musk-asks-court-to-block-openai-from-converting-to-a-for-profit.html\"\u003easked a federal court\u003c/a\u003e in November to stop the ChatGPT maker from converting to a fully for-profit business.\u003c/p\u003e\u003cp\u003eIn \u003ca href=\"https://openai.com/index/elon-musk-wanted-an-openai-for-profit/\" target=\"_blank\"\u003ea blog post\u003c/a\u003e on the OpenAI website titled \u0026#34;Elon Musk wanted an OpenAI for-profit,\u0026#34; the startup alleged that in 2017 Musk \u0026#34;not only wanted, but actually created, a for-profit\u0026#34; to serve as the company\u0026#39;s proposed new structure.\u003c/p\u003e\u003cp\u003e\u0026#34;When he didn\u0026#39;t get majority equity and full control, he walked away and told us we would fail,\u0026#34; OpenAI wrote in the blog post. \u0026#34;Now that OpenAI is the leading AI research lab and Elon runs a competing AI company, he\u0026#39;s asking the court to stop us from effectively pursuing our mission.\u0026#34;\u003c/p\u003e\u003cp\u003eMusk and xAI did not immediately respond to requests for comment.\u003c/p\u003e\u003cp\u003eSince Musk announced the \u003ca href=\"https://www.cnbc.com/2023/07/12/elon-musk-launches-his-new-company-xai.html\"\u003edebut\u003c/a\u003e of his OpenAI competitor xAI in July 2023, the startup has released its Grok chatbot and is raising up to $6 billion at a $50 billion valuation, in part to buy 100,000 \u003ca href=\"https://www.cnbc.com/quotes/NVDA/\"\u003eNvidia\u003c/a\u003e chips, CNBC \u003ca href=\"https://www.cnbc.com/2024/11/15/elon-musks-xai-raising-up-to-6-billion-to-purchase-100000-nvidia-chips-for-memphis-data-center.html\"\u003ereported\u003c/a\u003e Nov. 15.\u003c/p\u003e\u003cp\u003eMusk was questioning OpenAI\u0026#39;s nonprofit model from Day 1, a member of OpenAI\u0026#39;s legal team told CNBC.\u003c/p\u003e\u003cp\u003eOpenAI\u0026#39;s \u0026#34;structure doesn\u0026#39;t seem optimal,\u0026#34; Musk wrote in a November 2015 email to OpenAI CEO Sam Altman, according to screenshots shared in the blog post. He added that receiving a \u0026#34;salary from the nonprofit muddies the alignment of incentives\u0026#34; and that it\u0026#39;s \u0026#34;probably better to have a standard C corp with a parallel nonprofit.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a text conversation with former board member Shivon Zilis, OpenAI co-founder Greg Brockman wrote that a conversation he had with Musk \u0026#34;turned into talking about structure\u0026#34; and that Musk \u0026#34;said non-profit was def the right one early on, may not be the right one now,\u0026#34; according to blog screenshots.\u003c/p\u003e\u003cp\u003eMusk forwarded an article about China\u0026#39;s strategy for AI research facilities to Brockman and fellow OpenAI co-founder Ilya Sutskever. Musk wrote that China \u0026#34;will do whatever it takes to obtain what we develop. Maybe another reason to change course,\u0026#34; per the blog post.\u003c/p\u003e\u003cp\u003eBrockman agreed, and he wrote that starting in 2018, OpenAI\u0026#39;s path would need to be a \u0026#34;Al research + hardware for-profit,\u0026#34; according to the blog post. Musk wrote back, \u0026#34;Let\u0026#39;s talk Sat or Sun. I have a tentative game plan that l\u0026#39;d like to run by you.\u0026#34;\u003c/p\u003e\u003cp\u003eAltman, Brockman, Musk and others negotiated terms for the planned OpenAI for-profit in the fall of 2017, but the talks fell apart due to disagreements about equity, control and who would be CEO, according to the blog. Musk initially proposed that he should \u0026#34;unequivocally have initial control of the company\u0026#34; but said \u0026#34;this will change quickly\u0026#34; when the board has 12 to 16 members, per screenshots.\u003c/p\u003e\u003cp\u003eMusk created a public benefit corporation called \u0026#34;Open Artificial Intelligence Technologies, Inc\u0026#34; in September 2017, according to screenshots included in OpenAI\u0026#39;s blog post. A few days later, OpenAI rejected Musk\u0026#39;s proposed terms for the for-profit and offered to keep the conversation going, but Musk responded that his offer was \u0026#34;no longer on the table\u0026#34; and that \u0026#34;discussions are over,\u0026#34; per screenshots.\u003c/p\u003e\u003cp\u003eIn January 2018, Musk proposed that OpenAI spin into \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-6\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/TSLA/\"\u003eTesla\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e, his electric vehicle company, according to the blog.\u003c/p\u003e\u003cp\u003e\u0026#34;The only paths I can think of are a major expansion of OpenAl and a major expansion of Tesla Al. Perhaps both simultaneously. The former would require a major increase in funds donated and highly credible people joining our board. The current board situation is very weak,\u0026#34; Musk wrote, according to the blog. He added that \u0026#34;OpenAI is on a path of certain failure relative to Google.\u0026#34;\u003c/p\u003e\u003cp\u003eBrockman responded with a lengthy plan, including the idea that the company should \u0026#34;try our best to remain a non-profit,\u0026#34; according to screenshots. In February 2018, Musk resigned as co-chair of OpenAI.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eOpenAI\u0026#39;s complex history\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eOpenAI debuted in 2015 as a nonprofit and then in 2019 converted into a \u0026#34;capped-profit\u0026#34; model, in which the OpenAI nonprofit was the \u003ca href=\"https://www.cnbc.com/2024/06/11/openai-insider-stock-sales-are-raising-concern-among-ex-employees-.html\"\u003egoverning entity\u003c/a\u003e for its for-profit subsidiary. Altman said onstage Dec. 4 at The New York Times DealBook Summit that the company decided to go to a capped-profit structure in part because Musk stopped funding it.\u003c/p\u003e\u003cp\u003eThanks largely to the viral spread of ChatGPT, which debuted in November 2022, OpenAI has become one of the hottest, and at times one of the most \u003ca href=\"https://www.cnbc.com/2024/05/24/openai-sends-internal-memo-releasing-former-employees-from-non-disparagement-agreements-sam-altman.html\"\u003econtroversial\u003c/a\u003e, startups on the planet. The company\u0026#39;s valuation has climbed to $157 billion since it launched ChatGPT. OpenAI has raised about $13 billion from \u003ca href=\"https://www.cnbc.com/quotes/MSFT/\"\u003eMicrosoft\u003c/a\u003e, and it \u003ca href=\"https://www.cnbc.com/2024/10/02/openai-raises-at-157-billion-valuation-microsoft-nvidia-join-round.html\"\u003eclosed its latest $6.6 billion round in October\u003c/a\u003e, led by Thrive Capital and including participation from chipmaker \u003ca href=\"https://www.cnbc.com/quotes/NVDA/\"\u003eNvidia\u003c/a\u003e, SoftBank and others.\u003c/p\u003e\u003cp\u003eThe company also received a \u003ca href=\"https://www.cnbc.com/2024/10/03/openai-gets-4-billion-revolving-credit-line-on-top-of-latest-funding.html\"\u003e$4 billion revolving line of credit\u003c/a\u003e, bringing its total liquidity to more than $10 billion. OpenAI expects about $5 billion in losses on $3.7 billion in revenue this year, CNBC confirmed in September with a person familiar with the situation.\u003c/p\u003e\u003cp\u003eOpenAI is now in the midst of a potentially two-year process of converting into a fully for-profit public benefit corporation, which could make it more attractive to investors. The restructuring plan would also allow OpenAI to retain its nonprofit status as a separate entity, CNBC previously \u003ca href=\"https://www.cnbc.com/2024/09/25/openai-cto-mira-murati-announces-shes-leaving-the-company.html\"\u003ereported\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eOpenAI has faced increasing competition from startups such as Musk\u0026#39;s xAI and Anthropic, as well as tech giants such as \u003ca href=\"https://www.cnbc.com/quotes/GOOGL/\"\u003eGoogle\u003c/a\u003e, \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-15\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/AMZN/\"\u003eAmazon\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-16\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/META/\"\u003eMeta\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e. The generative AI market is \u003ca href=\"https://www.bloomberg.com/professional/insights/data/generative-ai-races-toward-1-3-trillion-in-revenue-by-2032/?os=4209072\u0026amp;amp;amp;amp;ref=app#:~:text=Generative%20AI%20is%20poised%20to,our%20proprietary%20market%2Dsizing%20model.\" target=\"_blank\"\u003epredicted to top $1 trillion\u003c/a\u003e in revenue within a decade, and business spending on generative AI \u003ca href=\"https://www.cnbc.com/2024/11/20/business-spending-on-ai-surged-500percent-this-year-to-13point8-billion-says-menlo-ventures.html\"\u003esurged 500% in 2024\u003c/a\u003e, according to recent data from Menlo Ventures.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eA thorny legal battle\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eAttorneys representing Musk, his AI startup xAI and Zilis \u003ca href=\"https://www.cnbc.com/2024/11/30/elon-musk-asks-court-to-block-openai-from-converting-to-a-for-profit.html\"\u003efiled for a preliminary injunction\u003c/a\u003e against OpenAI on Nov. 29.\u003c/p\u003e\u003cp\u003eIn their motion for preliminary injunction, attorneys for Musk argued that OpenAI should be prohibited from \u0026#34;benefitting from wrongfully obtained competitively sensitive information or coordination via the Microsoft-OpenAI board interlocks.\u0026#34;\u003c/p\u003e\u003cp\u003eThe latest court filings represent an escalation in the legal feud between Musk, OpenAI and Altman, as well as other long-involved parties and backers, including tech investor Reid Hoffman and \u003ca href=\"https://www.cnbc.com/quotes/MSFT/\"\u003eMicrosoft\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIn March, Musk \u003ca href=\"https://www.cnbc.com/2024/03/05/read-the-complaint-in-elon-musk-v-sam-altman-greg-brockman-openai.html\"\u003esued Open AI\u003c/a\u003e — and co-founders Altman and Brockman — in a San Francisco state court, alleging breach of contract and fiduciary duty. In the suit, Musk claimed that the early OpenAI team had set out to develop \u003ca href=\"https://www.cnbc.com/2024/03/05/read-the-complaint-in-elon-musk-v-sam-altman-greg-brockman-openai.html\"\u003eartificial general intelligence\u003c/a\u003e \u0026#34;for the benefit of humanity,\u0026#34; but that the project had been transformed into a for-profit entity that\u0026#39;s largely controlled by principal shareholder \u003ca href=\"https://www.cnbc.com/quotes/MSFT/\"\u003eMicrosoft\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIn June, Musk withdrew that complaint, and he later \u003ca href=\"https://www.cnbc.com/2024/08/05/elon-musk-revives-lawsuit-against-openai-sam-altman-in-federal-court.html\"\u003erefiled in federal court.\u003c/a\u003e Attorneys for Musk in the federal suit, led by Marc Toberoff in Los Angeles, argued in their complaint that OpenAI had violated federal racketeering, or RICO, laws.\u003c/p\u003e\u003cp\u003eIn November, they expanded their complaint to include allegations that Microsoft and OpenAI had violated antitrust laws when the ChatGPT maker allegedly asked investors to agree to not invest in rival companies, including Musk\u0026#39;s xAI.\u003c/p\u003e\u003cp\u003e\u0026#34;Microsoft and OpenAI now seek to cement this dominance by cutting off competitors\u0026#39; access to investment capital (a group boycott), while continuing to benefit from years\u0026#39; worth of shared competitively sensitive information during generative AI\u0026#39;s formative years,\u0026#34; the lawyers wrote in the November filing. They added that the terms OpenAI asked investors to agree to amounted to a \u0026#34;group boycott\u0026#34; that \u0026#34;blocks xAI\u0026#39;s access to essential investment capital.\u0026#34;\u003c/p\u003e\u003cp\u003eAltman at the DealBook Summit denied that OpenAI investors aren\u0026#39;t allowed to invest in competitors. Altman said investors are welcome to do so but that the company will stop their \u0026#34;information rights,\u0026#34; such as sharing its research road map and other materials.\u003c/p\u003e\u003cp\u003eMicrosoft has invested nearly $14 billion in OpenAI but \u003ca href=\"https://www.cnbc.com/2024/10/30/microsoft-msft-q1-earnings-report-2025.html\"\u003erevealed in October\u003c/a\u003e that it would \u003ca href=\"https://www.cnbc.com/2024/10/30/microsoft-cfo-says-openai-investment-will-cut-into-profit-this-quarter.html\"\u003erecord a $1.5 billion loss\u003c/a\u003e in the current period largely due to an \u003ca href=\"https://www.cnbc.com/2024/09/27/openai-sees-5-billion-loss-this-year-on-3point7-billion-in-revenue.html\"\u003eexpected loss\u003c/a\u003e from the AI startup.\u003c/p\u003e\u003cp\u003eMicrosoft gave up its \u003ca href=\"https://www.cnbc.com/2024/07/11/microsoft-giving-up-openai-board-observer-seat-doesnt-settle-concerns.html\"\u003eobserver seat\u003c/a\u003e on OpenAI\u0026#39;s board in July. However, the Federal Trade Commission will continue to monitor the influence of the two companies over the AI industry, CNBC reported.\u003c/p\u003e\u003cp\u003e\u003cem\u003e— CNBC\u0026#39;s Lora Kolodny contributed reporting.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWATCH: \u003c/strong\u003e\u003ca href=\"https://www.cnbc.com/video/2024/12/09/openai-releases-ai-video-generation-tool-sora.html\"\u003eOpenAI releases AI video generation tool Sora\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108073337\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000360404\" aria-labelledby=\"Placeholder-ArticleBody-Video-108073337\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108073338-17337692971733769289-37481426421-1080pnbcnews.jpg?v=1733769295\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"OpenAI releases AI video generation tool Sora\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-13T19:48:57Z",
  "modifiedTime": "2024-12-13T21:08:23Z"
}
