{
  "id": "a14ae9ab-be9f-4451-80d0-e7eefc391907",
  "title": "India Reaches Out To US, UK, Russia Following 'Operation Sindoor'",
  "link": "https://www.ndtv.com/world-news/india-reaches-out-to-us-uk-russia-saudi-arabia-following-operation-sindoor-8349039#publisher=newsstand",
  "description": "India reached out to several leading countries, including the US, Russia, the UK and Saudi Arabia, early Wednesday and briefed them about the military strike it carried out on nine terror targets in Pakistan and Pakistan-occupied-Kashmir.",
  "author": "",
  "published": "Wed, 07 May 2025 05:05:46 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 1586,
  "excerpt": "India reached out to several leading countries, including the US, Russia, the UK and Saudi Arabia, early Wednesday and briefed them about the military strike it carried out on nine terror targets in Pakistan and Pakistan-occupied-Kashmir.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "New Delhi: India reached out to several leading countries, including the US, Russia, the UK and Saudi Arabia, early Wednesday and briefed them about the military strike it carried out on nine terror targets in Pakistan and Pakistan-occupied-Kashmir, sources said.The strikes were carried out in retaliation for the Pahalgam terror attack.\"Senior Indian officials have spoken to their counterparts in a number of countries to brief them on the steps taken by India,\" said a source.\"Among these are the US, the UK, Saudi Arabia, the United Arab Emirates and Russia,\" it said.India's actions came two weeks after the Pahalgam terror attack that triggered widespread outrage in India and abroad.\"These steps come in the wake of the barbaric Pahalgam terrorist attack in which 25 Indians and one Nepali citizen were murdered,\" the defence ministry said in a statement.\"We are living up to the commitment that those responsible for this attack will be held accountable,\" it said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day Okhla Landfill - Delhi's Ragpickers: The Harsh Reality | NDTV Ground Report",
  "image": "https://c.ndtvimg.com/2025-05/gaguoetg_operation-sindoor_625x300_07_May_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                                                        \u003cp\u003e\u003cb\u003eNew Delhi: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eIndia reached out to several leading countries, including the US, Russia, the UK and Saudi Arabia, early Wednesday and briefed them about the military strike it carried out on nine terror targets in Pakistan and Pakistan-occupied-Kashmir, sources said.\u003c/p\u003e\u003cp\u003eThe strikes were carried out in retaliation for the Pahalgam terror attack.\u003c/p\u003e\u003cp\u003e\u0026#34;Senior Indian officials have spoken to their counterparts in a number of countries to brief them on the steps taken by India,\u0026#34; said a source.\u003c/p\u003e\u003cp\u003e\u0026#34;Among these are the US, the UK, Saudi Arabia, the United Arab Emirates and Russia,\u0026#34; it said.\u003c/p\u003e\u003cp\u003eIndia\u0026#39;s actions came two weeks after the Pahalgam terror attack that triggered widespread outrage in India and abroad.\u003c/p\u003e\u003cp\u003e\u0026#34;These steps come in the wake of the barbaric Pahalgam terrorist attack in which 25 Indians and one Nepali citizen were murdered,\u0026#34; the defence ministry said in a statement.\u003c/p\u003e\u003cp\u003e\u0026#34;We are living up to the commitment that those responsible for this attack will be held accountable,\u0026#34; it said.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                                                                \n                                                                                \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003eOkhla Landfill - Delhi\u0026#39;s Ragpickers: The Harsh Reality | NDTV Ground Report\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-07T05:05:46+05:30",
  "modifiedTime": null
}
