{
  "id": "ac57398c-b681-495c-95f9-d7d32d8b49f2",
  "title": "Oracle to buy $40 billion of Nvidia chips for OpenAI's US data center, FT reports",
  "link": "https://finance.yahoo.com/news/oracle-buy-40-billion-nvidia-181443286.html",
  "description": "",
  "author": "",
  "published": "2025-05-23T18:14:43Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Reuters",
  "length": 1842,
  "excerpt": "The data center, situated in Abilene, Texas, is part of the U.S. Stargate Project, led by top AI firms in the country, to boost America's heft in the...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: (Reuters) -Oracle will spend around $40 billion on Nvidia's higher-performance chips to power OpenAI's new U.S. data center, the Financial Times reported on Friday. The data center, situated in Abilene, Texas, is part of the U.S. Stargate Project, led by top AI firms in the country, to boost America's heft in the artificial intelligence industry amid heating global competition. The cloud service provider will purchase around 400,000 of Nvidia's most powerful GB200 chips and lease the computing power to OpenAI, the report said, citing several people familiar with the matter. OpenAI and Oracle did not immediately respond to Reuters' requests for comment, while an Nvidia spokesperson declined to comment. The data center is expected to be fully operational by mid-next year, and Oracle has agreed to lease the site for 15 years, the report said. JPMorgan has provided a bulk of the debt financing across two loans totaling $9.6 billion, while the site's owners, Crusoe and U.S. investment firm Blue Owl Capital, have invested around $5 billion in cash, the FT report added. The data center will help OpenAI reduce its dependence on its largest backer Microsoft as the ChatGPT maker's demand for power has outstripped the supply Microsoft can provide. For Oracle, the data center and Stargate present an opportunity for the firm to boost its cloud computing capabilities and catch up to market leaders Microsoft, Amazon and Google. OpenAI, Oracle, and Nvidia are also involved in a Stargate project in the Middle East, where a new massive AI data center will be constructed in the United Arab Emirates, likely using over a hundred thousand Nvidia chips. The first phase of the UAE data center will come online in 2026. (Reporting by Zaheer Kachwala in Bengaluru; Editing by Vijay Kishore)",
  "image": "https://media.zenfs.com/en/reuters-finance.com/bfe189a13d4328f44e5ff9c3c6b1201f",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e   \u003cp\u003e(Reuters) -Oracle will spend around $40 billion on Nvidia\u0026#39;s higher-performance chips to power OpenAI\u0026#39;s new U.S. data center, the Financial Times reported on Friday.\u003c/p\u003e   \u003cp\u003eThe data center, situated in Abilene, Texas, is part of the U.S. Stargate Project, led by top AI firms in the country, to boost America\u0026#39;s heft in the artificial intelligence industry amid heating global competition.\u003c/p\u003e      \u003cp\u003eThe cloud service provider will purchase around 400,000 of Nvidia\u0026#39;s most powerful GB200 chips and lease the computing power to OpenAI, the report said, citing several people familiar with the matter.\u003c/p\u003e   \u003cp\u003eOpenAI and Oracle did not immediately respond to Reuters\u0026#39; requests for comment, while an Nvidia spokesperson declined to comment.\u003c/p\u003e   \u003cp\u003eThe data center is expected to be fully operational by mid-next year, and Oracle has agreed to lease the site for 15 years, the report said.\u003c/p\u003e   \u003cp\u003eJPMorgan has provided a bulk of the debt financing across two loans totaling $9.6 billion, while the site\u0026#39;s owners, Crusoe and U.S. investment firm Blue Owl Capital, have invested around $5 billion in cash, the FT report added.\u003c/p\u003e      \u003cp\u003eThe data center will help OpenAI reduce its dependence on its largest backer Microsoft as the ChatGPT maker\u0026#39;s demand for power has outstripped the supply Microsoft can provide.\u003c/p\u003e   \u003cp\u003eFor Oracle, the data center and Stargate present an opportunity for the firm to boost its cloud computing capabilities and catch up to market leaders Microsoft, Amazon and Google.\u003c/p\u003e   \u003cp\u003eOpenAI, Oracle, and Nvidia are also involved in a Stargate project in the Middle East, where a new massive AI data center will be constructed in the United Arab Emirates, likely using over a hundred thousand Nvidia chips.\u003c/p\u003e   \u003cp\u003eThe first phase of the UAE data center will come online in 2026.\u003c/p\u003e   \u003cp\u003e(Reporting by Zaheer Kachwala in Bengaluru; Editing by Vijay Kishore)\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e      \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-23T18:14:43Z",
  "modifiedTime": null
}
