{
  "id": "bc879770-0f2d-4b78-84f1-668cd15908a9",
  "title": "Sahara desert, once lush and green, was home to mysterious human lineage",
  "link": "https://www.yahoo.com/news/sahara-desert-once-lush-green-144755991.html",
  "description": "",
  "author": "",
  "published": "2025-04-04T14:47:55Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Will Dunham",
  "length": 3862,
  "excerpt": "(Reuters) -The Sahara Desert is one of Earth's most arid and desolate places, stretching across a swathe of North Africa that spans parts of 11 countries and...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "By Will Dunham(Reuters) -The Sahara Desert is one of Earth's most arid and desolate places, stretching across a swathe of North Africa that spans parts of 11 countries and covers an area comparable to China or the United States. But it has not always been so inhospitable.During a period from about 14,500 to 5,000 years ago, it was a lush green savannah rich in bodies of water and teeming with life. And, according to DNA obtained from the remains of two individuals who lived about 7,000 years ago in what is now Libya, it was home to a mysterious lineage of people isolated from the outside world.Researchers analyzed the first genomes from people who lived in what is called the \"Green Sahara.\" They obtained DNA from the bones of two females buried at a rock shelter called Takarkori in remote southwestern Libya. They were naturally mummified, representing the oldest-known mummified human remains.\"At the time, Takarkori was a lush savannah with a nearby lake, unlike today's arid desert landscape,\" said archaeogeneticist Johannes Krause of the Max Planck Institute for Evolutionary Anthropology, one of the authors of the study published this week in the journal Nature.The genomes reveal that the Takarkori individuals were part of a distinct and previously unidentified human lineage that lived separated from sub-Saharan and Eurasian populations for thousands of years.\"Intriguingly, the Takarkori people show no significant genetic influence from sub-Saharan populations to the south or Near Eastern and prehistoric European groups to the north. This suggests they remained genetically isolated despite practicing animal husbandry - a cultural innovation that originated outside Africa,\" Krause said.Archeological evidence indicates that these people were pastoralists, herding domesticated animals. Artifacts found at the site include tools made of stone, wood and animal bones, pottery, woven baskets and carved figurines.The ancestry of the two Takarkori individuals was found to have derived from a North African lineage that separated from sub-Saharan populations around 50,000 years ago. That roughly coincides with when other human lineages spread beyond the continent and into the Middle East, Europe and Asia - becoming the ancestors of all people outside Africa.\"The Takarkori lineage likely represents a remnant of the genetic diversity present in northern Africa between 50,000 and 20,000 years ago,\" Krause said.\"From 20,000 years ago onward, genetic evidence shows an influx of groups from the Eastern Mediterranean, followed by migrations from Iberia and Sicily around 8,000 years ago. However, for reasons still unknown, the Takarkori lineage persisted in isolation for much longer than expected. Since the Sahara only became habitable about 15,000 years ago, their original homeland remains uncertain,\" Krause said.Their lineage remained isolated throughout most of its existence before the Sahara again became uninhabitable. At the end of a warmer and wetter climate stage called the African Humid Period, the Sahara transformed into the world's largest hot desert roughly around 3,000 BC.Members of our species Homo sapiens who spread beyond Africa encountered and interbred with Neanderthal populations already present in parts of Eurasia, leaving a lasting genetic legacy in non-African populations today. But the Green Sahara people carried only trace amounts of Neanderthal DNA, illustrating that they had scant contact with outside populations.Although the Takarkori population itself disappeared around 5,000 years ago when the African Humid Period ended and the desert returned, traces of their ancestry persist among various North African groups today, Krause said.\"Their genetic legacy offers a new perspective on the region's deep history,\" Krause said.(Reporting by Will Dunham in Washington; Editing by Daniel Wallis)",
  "image": "https://media.zenfs.com/en/reuters.com/13f405115b00a793efbf630b8189e3cf",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eBy Will Dunham\u003c/p\u003e\u003cp\u003e(Reuters) -The Sahara Desert is one of Earth\u0026#39;s most arid and desolate places, stretching across a swathe of North Africa that spans parts of 11 countries and covers an area comparable to China or the United States. But it has not always been so inhospitable.\u003c/p\u003e\u003cp\u003eDuring a period from about 14,500 to 5,000 years ago, it was a lush green savannah rich in bodies of water and teeming with life. And, according to DNA obtained from the remains of two individuals who lived about 7,000 years ago in what is now Libya, it was home to a mysterious lineage of people isolated from the outside world.\u003c/p\u003e\u003cp\u003eResearchers analyzed the first genomes from people who lived in what is called the \u0026#34;Green Sahara.\u0026#34; They obtained DNA from the bones of two females buried at a rock shelter called Takarkori in remote southwestern Libya. They were naturally mummified, representing the oldest-known mummified human remains.\u003c/p\u003e\u003cp\u003e\u0026#34;At the time, Takarkori was a lush savannah with a nearby lake, unlike today\u0026#39;s arid desert landscape,\u0026#34; said archaeogeneticist Johannes Krause of the Max Planck Institute for Evolutionary Anthropology, one of the authors of the study published this week in the journal Nature.\u003c/p\u003e\u003cp\u003eThe genomes reveal that the Takarkori individuals were part of a distinct and previously unidentified human lineage that lived separated from sub-Saharan and Eurasian populations for thousands of years.\u003c/p\u003e\u003cp\u003e\u0026#34;Intriguingly, the Takarkori people show no significant genetic influence from sub-Saharan populations to the south or Near Eastern and prehistoric European groups to the north. This suggests they remained genetically isolated despite practicing animal husbandry - a cultural innovation that originated outside Africa,\u0026#34; Krause said.\u003c/p\u003e\u003cp\u003eArcheological evidence indicates that these people were pastoralists, herding domesticated animals. Artifacts found at the site include tools made of stone, wood and animal bones, pottery, woven baskets and carved figurines.\u003c/p\u003e\u003cp\u003eThe ancestry of the two Takarkori individuals was found to have derived from a North African lineage that separated from sub-Saharan populations around 50,000 years ago. That roughly coincides with when other human lineages spread beyond the continent and into the Middle East, Europe and Asia - becoming the ancestors of all people outside Africa.\u003c/p\u003e\u003cp\u003e\u0026#34;The Takarkori lineage likely represents a remnant of the genetic diversity present in northern Africa between 50,000 and 20,000 years ago,\u0026#34; Krause said.\u003c/p\u003e\u003cp\u003e\u0026#34;From 20,000 years ago onward, genetic evidence shows an influx of groups from the Eastern Mediterranean, followed by migrations from Iberia and Sicily around 8,000 years ago. However, for reasons still unknown, the Takarkori lineage persisted in isolation for much longer than expected. Since the Sahara only became habitable about 15,000 years ago, their original homeland remains uncertain,\u0026#34; Krause said.\u003c/p\u003e\u003cp\u003eTheir lineage remained isolated throughout most of its existence before the Sahara again became uninhabitable. At the end of a warmer and wetter climate stage called the African Humid Period, the Sahara transformed into the world\u0026#39;s largest hot desert roughly around 3,000 BC.\u003c/p\u003e\u003cp\u003eMembers of our species Homo sapiens who spread beyond Africa encountered and interbred with Neanderthal populations already present in parts of Eurasia, leaving a lasting genetic legacy in non-African populations today. But the Green Sahara people carried only trace amounts of Neanderthal DNA, illustrating that they had scant contact with outside populations.\u003c/p\u003e\u003cp\u003eAlthough the Takarkori population itself disappeared around 5,000 years ago when the African Humid Period ended and the desert returned, traces of their ancestry persist among various North African groups today, Krause said.\u003c/p\u003e\u003cp\u003e\u0026#34;Their genetic legacy offers a new perspective on the region\u0026#39;s deep history,\u0026#34; Krause said.\u003c/p\u003e\u003cp\u003e(Reporting by Will Dunham in Washington; Editing by Daniel Wallis)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-04T14:47:55Z",
  "modifiedTime": null
}
