{
  "id": "bf2764c1-6dfb-4617-9614-37c0a8b01c7c",
  "title": "US teacher put on leave after allegedly calling Palestinian child an extremist",
  "link": "https://www.yahoo.com/news/us-teacher-put-leave-allegedly-020942504.html",
  "description": "",
  "author": "",
  "published": "2025-01-26T02:09:42Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Kanishka Singh",
  "length": 2004,
  "excerpt": "A public teacher in Pennsylvania was put on leave after allegedly calling a Palestinian American middle school student an extremist, the school district and ...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "By Kanishka SinghWASHINGTON (Reuters) - A public teacher in Pennsylvania was put on leave after allegedly calling a Palestinian American middle school student an extremist, the school district and a Muslim advocacy group said.WHY IT'S IMPORTANTHuman rights advocates say there has been a rise in anti-Muslim, anti-Palestinian and antisemitic hate in the U.S. since the start of Israel's war in Gaza following an Oct. 7, 2023, attack by the Palestinian militant group Hamas.KEY QUOTESThe Central Dauphin School District said on Saturday it had learned about the allegations that the teacher made the derogatory comment last week in an after-school program.\"The teacher involved in the alleged incident is on administrative leave pending our investigation,\" the district said in a statement, adding it had no tolerance for racist speech.The Council on American Islamic Relations said the allegation was that the teacher had remarked, \"I do not negotiate with terrorists,\" when the Palestinian American student asked for a seat change.The district and CAIR did not name the teacher or the student. CAIR said it was in touch with the child's parents.CONTEXTRecent U.S. incidents involving children include the attempted drowning of a 3-year-old Palestinian American girl in Texas and the fatal stabbing of a 6-year-old Palestinian American boy in Illinois.Other incidents include the stabbing of a Palestinian American man in Texas, the beating of a Muslim man in New York, a violent mob attack on pro-Palestinian protesters in California and the shooting of three Palestinian American students in Vermont.Incidents raising alarm over antisemitism include threats of violence against Jews at Cornell University that led to a conviction and sentencing, an unsuccessful plot to attack a New York City Jewish center and physical assaults against a Jewish man in Michigan, a rabbi in Maryland and two Jewish students at a Chicago university.(Reporting by Kanishka Singh in Washington; Editing by William Mallard)",
  "image": "https://media.zenfs.com/en/reuters.com/a70546c79168ca5ea24d57b2f088e85e",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eBy Kanishka Singh\u003c/p\u003e\u003cp\u003eWASHINGTON (Reuters) - A public teacher in Pennsylvania was put on leave after allegedly calling a Palestinian American middle school student an extremist, the school district and a Muslim advocacy group said.\u003c/p\u003e\u003cp\u003eWHY IT\u0026#39;S IMPORTANT\u003c/p\u003e\u003cp\u003eHuman rights advocates say there has been a rise in anti-Muslim, anti-Palestinian and antisemitic hate in the U.S. since the start of Israel\u0026#39;s war in Gaza following an Oct. 7, 2023, attack by the Palestinian militant group Hamas.\u003c/p\u003e\u003cp\u003eKEY QUOTES\u003c/p\u003e\u003cp\u003eThe Central Dauphin School District said on Saturday it had learned about the allegations that the teacher made the derogatory comment last week in an after-school program.\u003c/p\u003e\u003cp\u003e\u0026#34;The teacher involved in the alleged incident is on administrative leave pending our investigation,\u0026#34; the district said in a statement, adding it had no tolerance for racist speech.\u003c/p\u003e\u003cp\u003eThe Council on American Islamic Relations said the allegation was that the teacher had remarked, \u0026#34;I do not negotiate with terrorists,\u0026#34; when the Palestinian American student asked for a seat change.\u003c/p\u003e\u003cp\u003eThe district and CAIR did not name the teacher or the student. CAIR said it was in touch with the child\u0026#39;s parents.\u003c/p\u003e\u003cp\u003eCONTEXT\u003c/p\u003e\u003cp\u003eRecent U.S. incidents involving children include the attempted drowning of a 3-year-old Palestinian American girl in Texas and the fatal stabbing of a 6-year-old Palestinian American boy in Illinois.\u003c/p\u003e\u003cp\u003eOther incidents include the stabbing of a Palestinian American man in Texas, the beating of a Muslim man in New York, a violent mob attack on pro-Palestinian protesters in California and the shooting of three Palestinian American students in Vermont.\u003c/p\u003e\u003cp\u003eIncidents raising alarm over antisemitism include threats of violence against Jews at Cornell University that led to a conviction and sentencing, an unsuccessful plot to attack a New York City Jewish center and physical assaults against a Jewish man in Michigan, a rabbi in Maryland and two Jewish students at a Chicago university.\u003c/p\u003e\u003cp\u003e(Reporting by Kanishka Singh in Washington; Editing by William Mallard)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-26T02:09:42Z",
  "modifiedTime": null
}
