{
  "id": "bf8dcd62-a7a9-4bfb-82ca-170336abf09b",
  "title": "'Never expected he will run for Canadian Prime Ministership,' says Indian-origin MP Chandra Arya's father",
  "link": "https://timesofindia.indiatimes.com/nri/never-expected-he-will-run-for-canadian-prime-ministership-says-indian-origin-mp-chandra-aryas-father/articleshow/117342161.cms",
  "description": "Chandra Arya, an Indian-origin MP from Nepean, Ottawa, announces his candidacy for Canadian Prime Minister after Justin Trudeau's resignation. His platform includes transforming Canada into a republic, raising the retirement age, citizen-based taxation, and recognizing Palestine. Arya's father and brother highlight his unexpected political journey and dedication.",
  "author": "TOI World Desk",
  "published": "2025-01-18T04:14:19+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3774,
  "excerpt": "NRI News: Chandra Arya, an Indian-origin MP from Nepean, Ottawa, announces his candidacy for Canadian Prime Minister after Justin Trudeau's resignation. His pla",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "K Govindaiah and Chandra Arya (Picture credit: PTI/ Agencies)The father of Indian-origin MP Chandra Arya said he never expected his son to run for the position of Prime Minister of Canada following Justin Trudeau's resignation.K Govindaiah told news agency PTI that neither they nor Arya had anticipated this move. He also recalled that his father-in-law had once predicted Arya would become a great politician, a prediction now being fulfilled.\"We never expected, and he too never expected, that he will run for Prime Ministership. My father-in-law said he will become a great politician, and it is coming true,\" he said.Arya, the MP from Nepean, Ottawa, was born in Karnataka.Srinivasa Govindaiah, Chandra Arya's brother, said that Arya was the only person to have been elected as an MP within a short period of arriving in Canada. He also revealed that Arya was the first from their family to go to Canada without any contacts. Even after being elected for the first time, there was an anti-government wave, so Arya began working for his constituency from the very next day, as per Srinivasa.\"...he is the only person to have been elected as an MP, within a short period of entering Canada. There are many Indian-origin MPs who are settled there for generations. But he was the first person from our family to go there, and he did not have any contacts over there. He worked honestly... Even after getting elected for the first time, there was an anti-government wave happening there. So from the next day, he started working for the constituency. He was never doing any other business apart from politics at that time. Whatever job was assigned to him, as a Member of Parliament, he used to do,\" he told PTI.Arya's announcement of candidacy Chandra Arya recently announced his candidacy for the Liberal leadership following Justin Trudeau's resignation as Canadian Prime Minister and leader of the Liberal Party. Arya, who represents the riding of Nepean in Ottawa, made the announcement via social media platform X.In his campaign pledge, Arya said, \"I am running to be the next Prime Minister of Canada to lead a small, more efficient government to rebuild our nation and secure prosperity for future generations.\" His platform includes transforming Canada into a sovereign republic, raising the retirement age, implementing a citizenship-based taxation system, and recognizing Palestine's statehood.Arya stressed the struggles faced by many Canadians, particularly younger people, with affordability and the challenges encountered by the working middle class. He emphasized the need for leadership that is unafraid to make significant decisions to rebuild the economy, restore hope, create equal opportunities, and secure prosperity for future generations.Past stance on key issuesArya's positions have not always aligned with government policies. In 2023, he supported a petition urging the Liberals to review their proposed foreign agent registry plans following reports of foreign interference in Canadian politics. Although the registry legislation was approved, its implementation is still pending.As an advocate for Hindu Canadian interests, Arya has had disagreements with fellow parliamentarians, including NDP leader Jagmeet Singh and Liberal colleague Sukh Dhaliwal, regarding Ottawa-New Delhi relations and the activities of Sikh separatists in Canada.During a personal visit to India last year, Arya met with Prime Minister Narendra Modi. Global Affairs Canada clarified that Arya's journey was on his own initiative and did not represent the government of Canada.Arya also opposed a motion seeking to categorize the 1984 anti-Sikh riots as genocide, claiming to be the sole MP present in the House of Commons who prevented its passage through opposition.",
  "image": "https://static.toiimg.com/thumb/msid-117343147,width-1070,height-580,imgsize-1045801,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-117343147,imgsize-1045801,width-400,resizemode-4/117343147.jpg\" alt=\"\u0026#39;Never expected he will run for Canadian Prime Ministership,\u0026#39; says Indian-origin MP Chandra Arya\u0026#39;s father\" title=\"K Govindaiah and Chandra Arya (Picture credit: PTI/ Agencies)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"K Govindaiah and Chandra Arya (Picture credit: PTI/ Agencies)\"\u003eK Govindaiah and Chandra Arya (Picture credit: PTI/ Agencies)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eThe father of Indian-origin MP Chandra \u003ca href=\"https://timesofindia.indiatimes.com/topic/arya\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eArya\u003c/a\u003e said he never expected his son to run for the position of Prime Minister of Canada following \u003ca href=\"https://timesofindia.indiatimes.com/topic/justin-trudeau\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eJustin Trudeau\u003c/a\u003e\u0026#39;s resignation.\u003cbr/\u003eK Govindaiah told news agency PTI that neither they nor Arya had anticipated this move. He also recalled that his father-in-law had once predicted Arya would become a great politician, a prediction now being fulfilled.\u003cbr/\u003e\u0026#34;We never expected, and he too never expected, that he will run for Prime Ministership. My father-in-law said he will become a great politician, and it is coming true,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eArya, the MP from Nepean, Ottawa, was born in Karnataka.\u003cbr/\u003eSrinivasa Govindaiah, Chandra Arya\u0026#39;s brother, said that Arya was the only person to have been elected as an MP within a short period of arriving in Canada. He also revealed that Arya was the first from their family to go to Canada without any contacts. Even after being elected for the first time, there was an anti-government wave, so Arya began working for his constituency from the very next day, as per Srinivasa.\u003cbr/\u003e\u0026#34;...he is the only person to have been elected as an MP, within a short period of entering Canada. There are many Indian-origin MPs who are settled there for generations. But he was the first person from our family to go there, and he did not have any contacts over there. He worked honestly... Even after getting elected for the first time, there was an anti-government wave happening there. So from the next day, he started working for the constituency. He was never doing any other business apart from politics at that time. Whatever job was assigned to him, as a Member of Parliament, he used to do,\u0026#34; he told PTI.\u003c/p\u003e\u003cp data-pos=\"27\"\u003e\u003ch3\u003eArya\u0026#39;s announcement of candidacy \u003c/h3\u003e\u003c/p\u003e\u003cp\u003eChandra Arya recently announced his candidacy for the Liberal leadership following Justin Trudeau\u0026#39;s resignation as Canadian Prime Minister and leader of the Liberal Party. Arya, who represents the riding of Nepean in Ottawa, made the announcement via social media platform X.\u003cbr/\u003eIn his campaign pledge, Arya said, \u0026#34;I am running to be the next Prime Minister of Canada to lead a small, more efficient government to rebuild our nation and secure prosperity for future generations.\u0026#34; His platform includes transforming Canada into a sovereign republic, raising the retirement age, implementing a citizenship-based taxation system, and recognizing Palestine\u0026#39;s statehood.\u003c/p\u003e\u003cp\u003eArya stressed the struggles faced by many Canadians, particularly younger people, with affordability and the challenges encountered by the working middle class. He emphasized the need for leadership that is unafraid to make significant decisions to rebuild the economy, restore hope, create equal opportunities, and secure prosperity for future generations.\u003c/p\u003e\u003cp data-pos=\"41\"\u003e\u003ch3\u003ePast stance on key issues\u003c/h3\u003e\u003c/p\u003e\u003cp\u003eArya\u0026#39;s positions have not always aligned with government policies. In 2023, he supported a petition urging the Liberals to review their proposed foreign agent registry plans following reports of foreign interference in Canadian politics. Although the registry legislation was approved, its implementation is still pending.\u003cbr/\u003eAs an advocate for Hindu Canadian interests, Arya has had disagreements with fellow parliamentarians, including NDP leader Jagmeet Singh and Liberal colleague Sukh Dhaliwal, regarding Ottawa-New Delhi relations and the activities of Sikh separatists in Canada.\u003cbr/\u003eDuring a personal visit to India last year, Arya met with Prime Minister Narendra Modi. Global Affairs Canada clarified that Arya\u0026#39;s journey was on his own initiative and did not represent the government of Canada.\u003cbr/\u003eArya also opposed a motion seeking to categorize the 1984 anti-Sikh riots as genocide, claiming to be the sole MP present in the House of Commons who prevented its passage through opposition.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-18T04:14:00+05:30",
  "modifiedTime": null
}
