{
  "id": "c7b60f5b-e134-4cbe-9806-c0a78fbe98b8",
  "title": "At least 34 people killed in Russian ballistic missile attack on Sumy",
  "link": "https://www.bbc.com/news/articles/c4g4262x4x1o",
  "description": "Photos and videos of the aftermath show bloodied bodies scattered in the streets around the impact of the missiles.",
  "author": "",
  "published": "Sun, 13 Apr 2025 18:46:40 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "James Waterhouse",
  "length": 3862,
  "excerpt": "Photos and videos of the aftermath show bloodied bodies scattered in the streets around the impact of the missiles.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "James WaterhouseBBC Ukraine CorrespondentReporting fromSumyBarbara TaschBBC NewsReporting fromLondonAt least 34 people have been killed and 117 injured, including 15 children, after a Russian attack on the centre of Sumy, according to Ukrainian authorities. Two Iskander-variant ballistic missiles struck at around 10:15 local time (08:15 BST), both hitting the area around Sumy State University and its congress centre.Images and videos of the aftermath show bloodied bodies scattered in the streets around the impact of the missiles. At least two children were killed.Ukrainian President Volodymyr Zelensky said among the injured was a girl born this year, adding that medics were doing \"everything they can\" to save as many lives as possible.\"The strike hit right in the heart of the city on Palm Sunday,\" he said in his evening video message. \"Only completely deranged scum can do something like this.\"Moscow has not yet publicly commented on the attack.Ukrainian authorities told the BBC that 20 buildings were damaged, including four educational institutions, as well as cafes, shops and five apartment buildings. Ten cars and trams were also hit. Zelensky called for a \"tough\" response from other nations, adding that \"talks have never stopped ballistic missiles and air bombs\".\"Russia wants exactly this kind of terror and is dragging out this war. Without pressure on the aggressor, peace is impossible,\" he said. The university's congress centre is often used for children's classes, according to BBC Ukrainian, with local residents saying that the space is an \"educational hub for the entire city\" and \"very actively rented out for various courses, clubs, and master classes\".Officials in Sumy have told the BBC that the missiles were packed with cluster munitions, which can kill indiscriminately over a wide area.They have caused burning vehicles and bent trees where the deaths seem to have been concentrated.Nataliia, who gave only her first name, had been taking her child and other children to a shelter when the second strike hit her car.\"If we hadn't moved to the shelter on time we would have been in the car and we would be dead,\" she told the BBC.Svitlana Smirnova, 51, told the BBC she had run for shelter when the strike took place, after attending church with her friends on Palm Sunday.\"A friend of mine was injured in a bus which was hit here. She is seriously injured, she is in the hospital, was operated on, she is still unconscious. She was riding with her son who was also injured,\" she said.Sunday's strikes have been widely condemned by world leaders.Keith Kellogg, the US special envoy to Ukraine, said the attack \"crosses any line of decency\" and was why US President Donald Trump \"is working hard to end this war\".UK Prime Minister Sir Keir Starmer has also condemned the attack as \"horrific\".\"President Zelensky has shown his commitment to peace, President Putin must now agree to a full and immediate ceasefire without conditions - as Ukraine has done,\" he said. French President Emmanuel Macron said the Sumy strikes highlighted the urgent need to impose a ceasefire on Russia.\"Everyone knows: this war was initiated by Russia alone. And today, it is clear that Russia alone chooses to continue it - with blatant disregard for human lives, international law, and the diplomatic efforts of President Trump,\" the French President posted on X. Both Starmer and Macron have been working together on plans for a so-called \"coalition of the willing\" to enforce any peace deal in Ukraine.The attack comes after US envoy Steve Witkoff met Russian President Vladimir Putin in St Petersburg on Friday.The Kremlin said the meeting lasted more than four hours and focused on \"aspects of a Ukrainian settlement\". The meeting, Witkoff's third with Putin this year, was described by Russian special envoy Kirill Dmitriev as \"productive\".",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a817/live/87b50910-18ae-11f0-b1b3-7358f8d35a35.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eJames Waterhouse\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC Ukraine Correspondent\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eReporting from\u003csvg viewBox=\"0 0 32 32\" width=\"1em\" height=\"1em\" category=\"personalisation\" icon=\"location\"\u003e\u003cpath d=\"M12.3 11c0 2.1 1.7 3.7 3.7 3.7s3.7-1.7 3.7-3.7-1.6-3.7-3.7-3.7S12.3 9 12.3 11zm2.9 20c-3-4.4-5.6-8.5-7.3-12.1-1.5-3-2.1-5.6-2.1-7.9C5.7 5.5 10.1 1 16 1s10.3 4.6 10.3 10c0 2.3-.7 4.9-2.1 7.9-1.7 3.6-4.3 7.7-7.3 12.1h-1.7z\"\u003e\u003c/path\u003e\u003c/svg\u003eSumy\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBarbara Tasch\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC News\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eReporting from\u003csvg viewBox=\"0 0 32 32\" width=\"1em\" height=\"1em\" category=\"personalisation\" icon=\"location\"\u003e\u003cpath d=\"M12.3 11c0 2.1 1.7 3.7 3.7 3.7s3.7-1.7 3.7-3.7-1.6-3.7-3.7-3.7S12.3 9 12.3 11zm2.9 20c-3-4.4-5.6-8.5-7.3-12.1-1.5-3-2.1-5.6-2.1-7.9C5.7 5.5 10.1 1 16 1s10.3 4.6 10.3 10c0 2.3-.7 4.9-2.1 7.9-1.7 3.6-4.3 7.7-7.3 12.1h-1.7z\"\u003e\u003c/path\u003e\u003c/svg\u003eLondon\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAt least 34 people have been killed and 117 injured, including 15 children, after a Russian attack on the centre of Sumy, according to Ukrainian authorities. \u003c/p\u003e\u003cp\u003eTwo Iskander-variant ballistic missiles struck at around 10:15 local time (08:15 BST), both hitting the area around Sumy State University and its congress centre.\u003c/p\u003e\u003cp\u003eImages and videos of the aftermath show bloodied bodies scattered in the streets around the impact of the missiles. At least two children were killed.\u003c/p\u003e\u003cp\u003eUkrainian President Volodymyr Zelensky said among the injured was a girl born this year, adding that medics were doing \u0026#34;everything they can\u0026#34; to save as many lives as possible.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;The strike hit right in the heart of the city on Palm Sunday,\u0026#34; he said in his evening video message. \u0026#34;Only completely deranged scum can do something like this.\u0026#34;\u003c/p\u003e\u003cp\u003eMoscow has not yet publicly commented on the attack.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUkrainian authorities told the BBC that 20 buildings were damaged, including four educational institutions, as well as cafes, shops and five apartment buildings. Ten cars and trams were also hit. \u003c/p\u003e\u003cp\u003eZelensky called for a \u0026#34;tough\u0026#34; response from other nations, adding that \u0026#34;talks have never stopped ballistic missiles and air bombs\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Russia wants exactly this kind of terror and is dragging out this war. Without pressure on the aggressor, peace is impossible,\u0026#34; he said. \u003c/p\u003e\u003cp\u003eThe university\u0026#39;s congress centre is often used for children\u0026#39;s classes, according to BBC Ukrainian, with local residents saying that the space is an \u0026#34;educational hub for the entire city\u0026#34; and \u0026#34;very actively rented out for various courses, clubs, and master classes\u0026#34;.\u003c/p\u003e\u003cp\u003eOfficials in Sumy have told the BBC that the missiles were packed with cluster munitions, which can kill indiscriminately over a wide area.\u003c/p\u003e\u003cp\u003eThey have caused burning vehicles and bent trees where the deaths seem to have been concentrated.\u003c/p\u003e\u003cp\u003eNataliia, who gave only her first name, had been taking her child and other children to a shelter when the second strike hit her car.\u003c/p\u003e\u003cp\u003e\u0026#34;If we hadn\u0026#39;t moved to the shelter on time we would have been in the car and we would be dead,\u0026#34; she told the BBC.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSvitlana Smirnova, 51, told the BBC she had run for shelter when the strike took place, after attending church with her friends on Palm Sunday.\u003c/p\u003e\u003cp\u003e\u0026#34;A friend of mine was injured in a bus which was hit here. She is seriously injured, she is in the hospital, was operated on, she is still unconscious. She was riding with her son who was also injured,\u0026#34; she said.\u003c/p\u003e\u003cp\u003eSunday\u0026#39;s strikes have been widely condemned by world leaders.\u003c/p\u003e\u003cp\u003eKeith Kellogg, the US special envoy to Ukraine, said the attack \u0026#34;crosses any line of decency\u0026#34; and was why US President Donald Trump \u0026#34;is working hard to end this war\u0026#34;.\u003c/p\u003e\u003cp\u003eUK Prime Minister Sir Keir Starmer has also condemned the attack as \u0026#34;horrific\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;President Zelensky has shown his commitment to peace, President Putin must now agree to a full and immediate ceasefire without conditions - as Ukraine has done,\u0026#34; he said. \u003c/p\u003e\u003cp\u003eFrench President Emmanuel Macron said the Sumy strikes highlighted the urgent need to impose a ceasefire on Russia.\u003c/p\u003e\u003cp\u003e\u0026#34;Everyone knows: this war was initiated by Russia alone. And today, it is clear that Russia alone chooses to continue it - with blatant disregard for human lives, international law, and the diplomatic efforts of President Trump,\u0026#34; the\u003cb id=\"\"\u003e \u003c/b\u003eFrench President posted on X.\u003cb id=\"\"\u003e \u003c/b\u003e\u003c/p\u003e\u003cp\u003eBoth Starmer and Macron have been working together on plans for a so-called \u0026#34;coalition of the willing\u0026#34; to enforce any peace deal in Ukraine.\u003c/p\u003e\u003cp\u003eThe attack comes after US envoy Steve Witkoff met Russian President Vladimir Putin in St Petersburg on Friday.\u003c/p\u003e\u003cp\u003eThe Kremlin said the meeting lasted more than four hours and focused on \u0026#34;aspects of a Ukrainian settlement\u0026#34;. The meeting, Witkoff\u0026#39;s third with Putin this year, was described by Russian special envoy Kirill Dmitriev as \u0026#34;productive\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-13T12:08:22.233Z",
  "modifiedTime": "2025-04-13T18:46:40.485Z"
}
