{
  "id": "ce09780c-34ec-4d75-a05e-2d99100fa2c8",
  "title": "Iran Says 4th Round Of Indirect Talks With US Set For Rome",
  "link": "https://www.ndtv.com/world-news/iran-says-4th-round-of-indirect-talks-with-us-set-for-rome-8300128#publisher=newsstand",
  "description": "Iranian Foreign Minister Seyed Abbas Araghchi has said that the fourth round of the Omani-mediated indirect nuclear talks between Iran and the US will be held in Rome on Saturday, media reported.",
  "author": "",
  "published": "Thu, 01 May 2025 05:31:35 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Indo-Asian News Service",
  "length": 2372,
  "excerpt": "Iranian Foreign Minister Seyed Abbas Araghchi has said that the fourth round of the Omani-mediated indirect nuclear talks between Iran and the US will be held in Rome on Saturday, media reported.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Tehran: Iranian Foreign Minister Seyed Abbas Araghchi has said that the fourth round of the Omani-mediated indirect nuclear talks between Iran and the US will be held in Rome on Saturday, media reported.Araghchi made the remarks on the sidelines of a Cabinet meeting in Tehran on Wednesday while responding to questions about the ongoing talks with the US on Tehran's nuclear programme and Washington's sanctions.He noted that Oman, as the talks' host, had decided to hold the fourth round in Rome due to technical and logistical reasons, Xinhua news agency reported.The Iranian Foreign Minister said that the location Oman selected to host the negotiations was of no particular importance to Iran.\"Of importance to us are the contents of the negotiations and the mediator,\" he added.Araghchi told media on Wednesday that, as confirmed by Oman, the new round of discussions is scheduled to be held in the Italian capital, continuing a format aimed at reviving the Joint Comprehensive Plan of Action (JCPOA) and facilitating the lifting of US-led sanctions.The Rome meeting will be preceded by a separate round of consultations between Iran and the three European signatories to the 2015 nuclear accord -- the UK, France, and Germany -- on Friday.Araghchi acknowledged that the influence of the E3 has waned due to their alignment with Washington's pressure policies, but emphasised Tehran's willingness to keep the European parties engaged.Commenting on the US hostile measures, such as the imposition of fresh sanctions against Iran despite the ongoing negotiations, he noted that such actions would definitely convey a negative message.Araghchi noted that the International Atomic Energy Agency (IAEA) currently played no role in the negotiations, but \"will play an important role in the future if an agreement is reached\".He said, although no time frame had been decided for the talks' conclusion, Iran naturally was not interested in \"attritional negotiations and is not after wasting time\".The first and third rounds of the indirect talks between Iran and the US, headed by the Iranian Foreign Minister and US Special Envoy to the Middle East Steve Witkoff, were held in the Omani capital Muscat on April 12 and 26, and the second one in Rome on April 19.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-10/mguesljg_iran-fm-abbas-araghchi_625x300_13_October_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                                                        \u003cp\u003e\u003cb\u003eTehran: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eIranian Foreign Minister Seyed Abbas Araghchi has said that the fourth round of the Omani-mediated indirect nuclear talks between Iran and the US will be held in Rome on Saturday, media reported.\u003c/p\u003e\u003cp\u003eAraghchi made the remarks on the sidelines of a Cabinet meeting in Tehran on Wednesday while responding to questions about the ongoing talks with the US on Tehran\u0026#39;s nuclear programme and Washington\u0026#39;s sanctions.\u003c/p\u003e\u003cp\u003eHe noted that Oman, as the talks\u0026#39; host, had decided to hold the fourth round in Rome due to technical and logistical reasons, Xinhua news agency reported.\u003c/p\u003e\u003cp\u003eThe Iranian Foreign Minister said that the location Oman selected to host the negotiations was of no particular importance to Iran.\u003c/p\u003e\u003cp\u003e\u0026#34;Of importance to us are the contents of the negotiations and the mediator,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eAraghchi told media on Wednesday that, as confirmed by Oman, the new round of discussions is scheduled to be held in the Italian capital, continuing a format aimed at reviving the Joint Comprehensive Plan of Action (JCPOA) and facilitating the lifting of US-led sanctions.\u003c/p\u003e\u003cp\u003eThe Rome meeting will be preceded by a separate round of consultations between Iran and the three European signatories to the 2015 nuclear accord -- the UK, France, and Germany -- on Friday.\u003c/p\u003e\u003cp\u003eAraghchi acknowledged that the influence of the E3 has waned due to their alignment with Washington\u0026#39;s pressure policies, but emphasised Tehran\u0026#39;s willingness to keep the European parties engaged.\u003c/p\u003e\u003cp\u003eCommenting on the US hostile measures, such as the imposition of fresh sanctions against Iran despite the ongoing negotiations, he noted that such actions would definitely convey a negative message.\u003c/p\u003e\u003cp\u003eAraghchi noted that the International Atomic Energy Agency (IAEA) currently played no role in the negotiations, but \u0026#34;will play an important role in the future if an agreement is reached\u0026#34;.\u003c/p\u003e\u003cp\u003eHe said, although no time frame had been decided for the talks\u0026#39; conclusion, Iran naturally was not interested in \u0026#34;attritional negotiations and is not after wasting time\u0026#34;.\u003c/p\u003e\u003cp\u003eThe first and third rounds of the indirect talks between Iran and the US, headed by the Iranian Foreign Minister and US Special Envoy to the Middle East Steve Witkoff, were held in the Omani capital Muscat on April 12 and 26, and the second one in Rome on April 19.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                                                                \n                                                                                \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-01T05:31:17+05:30",
  "modifiedTime": null
}
