{
  "id": "ce79fc3d-1472-4af5-9f3f-5774c7c7235a",
  "title": "Gaza ceasefire will end if Hamas does not return hostages Saturday, Netanyahu says",
  "link": "https://www.washingtonpost.com/world/2025/02/11/israel-war-gaza-ceasefire-jordan-egypt-news-hamas/",
  "description": "Israel’s security cabinet held an emergency meeting Tuesday following word from Hamas that three Israel hostages would not be released Saturday as agreed.",
  "author": "Kelly Kasulis Cho, Abbie Cheeseman, Adam Taylor",
  "published": "Wed, 12 Feb 2025 00:40:03 +0000",
  "source": "http://feeds.washingtonpost.com/rss/world",
  "categories": null,
  "byline": "Kelly Kasulis Cho, Abbie Cheeseman, Adam Taylor, Michael Birnbaum, Dan Diamond, Lior Soroka, Sammy Westfall",
  "length": 14148,
  "excerpt": "Israel’s security cabinet held an emergency meeting Tuesday following word from Hamas that three Israel hostages would not be released Saturday as agreed.",
  "siteName": "The Washington Post",
  "favicon": "https://www.washingtonpost.com/_next/static/media/180x180.0704205d.png",
  "text": "Israeli Prime Minister Benjamin Netanyahu said in an address Tuesday that Israel would end the Gaza ceasefire if hostages held by Hamas are not returned as scheduled this weekend.“If Hamas does not return our hostages by Saturday noon, the ceasefire will end and the IDF will return to intense fighting until a final victory over Hamas,\" Netanyahu said, adding that he already ordered the Israel Defense Forces to amass inside and around the Gaza Strip.The Israeli leader’s remarks came as President Donald Trump said that Hamas needed to release all remaining hostages by noon Saturday or “all bets were off.”“I don’t want to do two and then we do another two and another week, and then we do four and three weeks. They either have them out by Saturday at 12 o’clock or all bets are off,” Trump told reporters at the White House, where he was hosting Jordanian King Abdullah II.An Israel official, speaking on condition of anonymity to discuss sensitive plans, said that the Israeli Prime Minister’s position echoed “President Trump’s statement regarding the release of the hostages — that all of them will be released on Saturday.”Under the terms of a ceasefire reached last month, three hostages were scheduled to be released from Gaza on Saturday. However, Hamas said Monday it would delay the release “until further notice” over accusations of Israeli ceasefire violations — the first major setback for the ceasefire and hostage-release deal.Hamas blamed the delay on recent Israeli shelling and gunfire in Gaza, along with an insufficient flow of aid. The group said in a statement that it had announced its decision early to leave a door open for negotiators to resolve issues with the ceasefire before the weekend.In recent days, Hamas has said that aid, including emergency tents and other shelters, is not entering the territory fast enough and has called for stepped-up medical evacuations. Aid groups have said they are struggling to scale up the demand for tents.The move by Hamas came as Trump said Palestinians displaced from Gaza to neighboring countries, under his proposal for the United States to “own” Gaza and develop real estate there, would not have the right to return to the enclave. He made the remarks in an interview with Fox News host Bret Baier that aired Monday evening.Here’s what else to know:Secretary of State Marco Rubio met with Egyptian Foreign Minister Badr Abdelatty on Monday. Rubio stressed “the importance of close cooperation” in post-conflict planning for Gaza and emphasized that “Hamas can never govern Gaza or threaten Israel again,” according to a State Department readout.Egypt’s Foreign Ministry appeared to push back Monday against Trump’s stated plan for Gaza, issuing a statement that called for the protection of Palestinians’ rights.Israeli Prime Minister Benjamin Netanyahu called his meeting with Trump last week, during which Trump unveiled his plan for Gaza, “the most significant” he had “ever had with an American president.” Israel sees “eye to eye with the U.S. administration on all the goals of the war,” Netanyahu said to Israel’s legislature on Monday.In response to Trump’s remarks about his plans for Gaza, more than 110 nongovernmental organizations signed a joint statement denouncing “any effort or initiative, and any calls for, the forcible displacement of Palestinians from Gaza,” according to A New Policy, an advocacy group.The U.N. human rights office said images of “emaciated Israeli hostages” released Saturday by Hamas under the ceasefire agreement were “deeply distressing,” as are the “severe conditions” reported by Palestinian detainees released by Israel under the deal. Its statement Monday also expressed concern over “the public parading of hostages released by Hamas.”Live coverage contributors 7Trump meets with Jordan’s king as he pushes Gaza takeover planReturn to menuThe United States will take and hold Gaza while Palestinians there move to Jordan and Egypt, President Donald Trump said Tuesday during a meeting with Jordan’s King Abdullah II.The Oval Office conversation was Trump’s first visit with an Arab leader since moving back into the White House, and it was a measure of his unwillingness to budge on his desire for a U.S. takeover of Gaza. Although Trump’s tone was friendly Tuesday, his message was almost sure to kindle a blaze for Abdullah at home, where taking a fresh influx of Palestinian refugees would be politically destabilizing.Speaking in the Oval Office, Trump repeatedly asserted that the United States would take over Gaza — but again refused to specify how.“We’re going to take it, we’re going to hold it, we’re going to cherish it,” he told reporters. Asked how the United States would claim the Palestinian territory, Trump cited “U.S. authority.”The Jordanian king tried hard not to be pulled into the discussion, wary of alienating a U.S. leader who greenlights at least $1.5 billion in aid for Jordan every year. But with the eyes of his own nation upon him, Abdullah also could not acquiesce to Trump’s demand to take in Gazans.Any response to taking Gaza refugees would need to be multilateral and not rest solely on Jordan, the king said.“This is something that we as Arabs will be coming to the United States with, something that we’re going to talk about later. We’ll discuss all these options,” Abdullah said.He said the focus must be on finding a solution that works for all parties, but he demurred on discussing Trump’s demands, saying he wanted to wait until Egyptians could present their own ideas. He also said that Jordan had already taken in 2,000 children from Gaza, a move that Trump praised and said came as a surprise to U.S. leaders.This is an excerpt from a full story.Trump pressures Egypt and Jordan to take Palestinians displaced from GazaReturn to menuPalestinians displaced from Gaza would not have the right to return there, President Donald Trump said in an interview with Fox News aired on Feb. 10. (Video: Fox News)President Donald Trump said Monday that he would consider withholding aid from Jordan and Egypt if they don’t comply with his request to take in Palestinians from Gaza, further pushing his controversial plan for the United States to “take over” and “own” the enclave to rebuild it while displacing its residents to a “permanent place.”Asked by a reporter Monday whether he would withhold aid from Egypt and Jordan if they didn’t comply, he answered: “Yeah, maybe, sure, why not? If they don’t, I would conceivably withhold aid, yes.” In a televised interview broadcast later Monday, Fox News host Bret Baier asked Trump whether displaced Palestinians would have the right to return to Gaza later under the president’s plan. “No, they wouldn’t, because they’re going to have much better housing. In other words, I’m talking about building a permanent place for them,” Trump responded.He added that he believed he could strike a “deal” with Egypt and Jordan and claimed that the United States gives both countries “billions and billions of dollars a year.” The United States provided Jordan with almost $1.7 billion in foreign aid in fiscal 2023, the most recent period with complete data, and it gave Egypt about $1.5 billion, according to the government’s foreign assistance website.While the sum of aid is large, experts have raised doubts about whether the threat would be enough to push Egypt’s government toward an action it has vehemently rejected. “I can’t imagine” that even withholding all aid would be “anywhere near enough pressure to get Egypt to accept hosting a massive population of Palestinians,” said Timothy Kaldas, deputy director of the Washington-based Tahrir Institute for Middle East Policy.“Trump’s proposal both creates new problems while making resolving existing ones more difficult,” Kaldas said. While the pressure on aid “does not give him the leverage he needs to compel Cairo to accept his proposal,” his plan to displace Palestinians from Gaza “has inflated the Israeli government’s ambitions,” which could make “reaching a realistic and implementable deal all the more difficult.”Trump on Monday also made threatening remarks about the Israel-Hamas ceasefire deal, saying that “all hell is going to break out” if Hamas does not release all remaining Israeli hostages by noon Saturday. Hamas had said it would delay the release of three Israeli hostages set for Saturday “until further notice,” blaming Israeli gunfire in Gaza and an insufficient flow of aid.“We must avoid at all costs resumption of hostilities in Gaza that would lead to immense tragedy,” U.N. Secretary General António Guterres wrote Tuesday in a post on X. “I appeal to Hamas to proceed with the planned liberation of hostages. Both sides must fully abide by their commitments in the ceasefire agreement \u0026 resume serious negotiations.”Israel confirms death of Shlomo Mantzur, believed to be oldest hostage in Gaza Return to menuIsraeli authorities on Tuesday confirmed the death of Shlomo Mantzur, 86, who was believed to be the oldest hostage held in Gaza, saying he was killed during the Oct. 7, 2023, Hamas attack on Israel.“During the brutal terrorist assault by the Hamas murderers on October 7, he was murdered and abducted to Gaza,” Israeli Prime Minister Benjamin Netanyahu said in a statement. “We share in the family’s deep mourning. We will neither rest nor be silent until he is returned for burial in Israel.”Israeli media had previously reported that Mantzur was among the hostages who would be released in the first phase of the ceasefire deal between Israel and Hamas. Basem Naim, a senior Hamas official, told The Washington Post in late January that the group had given Israel the names of eight hostages whose bodies would be released in the first phase.“The decision to confirm his death was based on intelligence gathered in recent months,” the Israel Defense Forces said in a statement. It is not immediately clear if Mantzur’s body would be given to Israel in the next stage of hostage releases, set for Saturday. Hamas said Monday it would delay the release of three Israeli hostages on Saturday “until further notice” because of what it said were Israeli violations of the ceasefire deal.“For months, we lived between hope and fear, and today, we are overtaken with grief,” Lior Carmel, chairman of Kibbutz Kissufim, said in a statement Tuesday. Mantzur was one of the founders of the kibbutz.Mantzur’s family, in a statement, called him “a pillar of strength.”He was “a man of high morals and values, a lover of humanity, who always helped others wholeheartedly,” they said. “We call upon decision-makers to make a brave and ethical decision to bring all hostages home immediately — the living for rehabilitation and the deceased for proper burial in their homeland.”Trump says ‘Let hell break out’ in Gaza if hostages aren’t returned by SaturdayReturn to menuPresident Donald Trump said on Feb. 10 that the Gaza ceasefire deal is off if all hostages are not released by noon on Saturday. (Video: The Washington Post)President Donald Trump issued an ultimatum to Hamas on Monday saying that if all Israeli hostages are not released from Gaza by Saturday “all hell is going to break out.”While he said the decision to end the ceasefire ultimately falls on Israel, Trump said in remarks to reporters that “If all of the hostages aren’t returned by Saturday at 12 o’clock … I would say, cancel it and all bets are off and let hell break out.” He did not specify whether that meant noon or midnight.When asked whether he meant retaliation, Trump said, “You’ll find out, and they’ll find out, too. Hamas will find out what I mean.”Asked whether he could rule out any U.S. involvement after that Saturday deadline, Trump replied, “We’ll see what happens.”Trump’s strong comments came after Hamas earlier in the day said it would delay “until further notice” the release of three Israeli hostages set for Saturday — the first major setback for the ceasefire and hostage-release deal.Trump made similar threats in the past, saying in early January that “all hell will break out” in the Middle East if the remaining hostages in Hamas captivity in Gaza were not released by the time he took office later that month.Middle East conflict President Donald Trump on Monday said he would consider withholding aid from Jordan and Egypt if they do not comply with his request to take in Palestinians from Gaza. Follow live updates on the ceasefire and the hostages remaining in Gaza.The Israel-Gaza war: On Oct. 7, 2023, Hamas militants launched an unprecedented cross-border attack on Israel, killing about 1,200 people and taking civilian hostages. Israel declared war on Hamas in response, launching a ground invasion that fueled the biggest displacement in the region since Israel’s creation in 1948. In July 2024, Hamas leader Ismail Haniyeh was killed in an attack Hamas has blamed on Israel.Hezbollah: In late 2024, Israel and Lebanon’s Hezbollah agreed to a ceasefire deal, bringing a tenuous halt to more than a year of hostilities that included an Israeli invasion of southern Lebanon. Israel’s airstrikes into Lebanon had been intense and deadly, killing over 1,400 people including Hasan Nasrallah, Hezbollah’s longtime leader. The Israel-Lebanon border has a history of violence that dates back to Israel’s founding.Gaza crisis: In the Gaza Strip, Israel has waged one of this century’s most destructive wars, killing tens of thousands and plunging at least half of the population into “famine-like conditions.” For months, Israel has resisted pressure from Western allies to allow more humanitarian aid into the enclave.U.S. involvement: Despite tensions between Israeli Prime Minister Benjamin Netanyahu and some U.S. politicians, including former President Joe Biden, the United States supports Israel with weapons, funds aid packages, and has vetoed or abstained from the United Nations’ ceasefire resolutions.Live briefing: Gaza ceasefire will end if Hamas does not return hostages Saturday, Netanyahu saysJordan, home to millions of Palestinians, fears Trump’s Gaza proposalTrump’s Gaza plan is the latest U.S. attempt to transform Middle East",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BNVPRRW725A6LOSEEUMLOE3D5E_size-normalized.jpg\u0026w=1440",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle aria-label=\"All updates\" data-qa=\"main\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"UOETBUWRBBHZVDCIC3Q7P2DQKQ\" data-el=\"text\" dir=\"null\"\u003eIsraeli Prime Minister Benjamin Netanyahu said in an address Tuesday that Israel would end the Gaza ceasefire if hostages held by Hamas are not returned as scheduled this weekend.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"V6SI6VTN5VH5RHMMM7C4THB7UY\" data-el=\"text\" dir=\"null\"\u003e“If Hamas does not return our hostages by Saturday noon, the ceasefire will end and the IDF will return to intense fighting until a final victory over Hamas,\u0026#34; Netanyahu said, adding that he already ordered the Israel Defense Forces to amass inside and around the Gaza Strip.\u003c/p\u003e\u003c/div\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"WLA6PXC73BDO5F5V4JB5LKKJOI\" data-el=\"text\" dir=\"null\"\u003eThe Israeli leader’s remarks came as President Donald Trump said that Hamas needed to release all remaining hostages by noon Saturday or “all bets were off.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"PKKRS5H5EJEUXL37LTJ2K6Y3M4\" data-el=\"text\" dir=\"null\"\u003e“I don’t want to do two and then we do another two and another week, and then we do four and three weeks. They either have them out by Saturday at 12 o’clock or all bets are off,” Trump told reporters at the White House, where he was hosting Jordanian King Abdullah II.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RIITSEN4JNF7RITQA2FITWDA2I\" data-el=\"text\" dir=\"null\"\u003eAn Israel official, speaking on condition of anonymity to discuss sensitive plans, said that the Israeli Prime Minister’s position echoed “President Trump’s statement regarding the release of the hostages — that all of them will be released on Saturday.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RPQ32RLLJFDCXK3HRJS5KM32RA\" data-el=\"text\" dir=\"null\"\u003eUnder the terms of a ceasefire reached last month, three hostages were scheduled to be released from Gaza on Saturday. However, Hamas said Monday it would delay the release “until further notice” over accusations of Israeli ceasefire violations — the first major setback for the ceasefire and hostage-release deal.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"ZROH4A3RUFBNZDGUFMBXKH2WRM\" data-el=\"text\" dir=\"null\"\u003eHamas blamed the delay on recent Israeli shelling and gunfire in Gaza, along with an insufficient flow of aid. The group said in a statement that it had announced its decision early to leave a door open for negotiators to resolve issues with the ceasefire before the weekend.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"F4LUHO77BVG3DAJ2ALFXITFGTM\" data-el=\"text\" dir=\"null\"\u003eIn recent days, Hamas has said that aid, including emergency tents and other shelters, is not entering the territory fast enough and has called for stepped-up medical evacuations. Aid groups have said they are struggling to scale up the demand for tents.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RIDX27IKEVB3ZKYES3MHNPSNY4\" data-el=\"text\" dir=\"null\"\u003eThe move by Hamas came as Trump said Palestinians \u003ca href=\"https://www.washingtonpost.com/world/2025/02/05/gaza-trump-ethnic-cleansing-displacement/\" target=\"_blank\"\u003edisplaced\u003c/a\u003e from Gaza to neighboring countries, under his proposal for the United States to “own” Gaza and develop real estate there, would not have the right to return to the enclave. He made the remarks in an interview with Fox News host Bret Baier that aired Monday evening.\u003c/p\u003e\u003cp data-qa=\"article-body\"\u003e\u003ch3 data-qa=\"article-header\" data-contentid=\"5SR7ZWWMOFGL7IRETWP3BKRBYY\" data-apitype=\"header\" level=\"3\" id=\"5SR7ZWWMOFGL7IRETWP3BKRBYY\"\u003eHere’s what else to know:\u003c/h3\u003e\u003c/p\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cul data-contentid=\"K55SL4SVHZD35IBAI4VXBN7SB4\" data-apitype=\"list\"\u003e\u003cli\u003e\u003cspan\u003eSecretary of State Marco Rubio met with Egyptian Foreign Minister Badr Abdelatty on Monday. Rubio stressed “the importance of close cooperation” in post-conflict planning for Gaza and emphasized that “Hamas can never govern Gaza or threaten Israel again,” according to a State Department \u003ca href=\"https://www.state.gov/secretary-rubios-meeting-with-egyptian-foreign-minister-abdelatty/\" target=\"_blank\"\u003ereadout\u003c/a\u003e.\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eEgypt’s Foreign Ministry appeared to push back Monday against Trump’s stated plan for Gaza, issuing a \u003ca href=\"https://x.com/MfaEgypt/status/1889017656751391168/photo/1\" target=\"_blank\"\u003estatement \u003c/a\u003ethat called for the protection of Palestinians’ rights.\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eIsraeli Prime Minister Benjamin\u003cb\u003e \u003c/b\u003eNetanyahu called his meeting with Trump last week, during which Trump unveiled his plan for Gaza, “the most significant” he had “ever had with an American president.” Israel sees “eye to eye with the U.S. administration on all the goals of the war,” Netanyahu said to Israel’s legislature on Monday.\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eIn response to Trump’s remarks about his plans for Gaza, more than 110 nongovernmental organizations signed a \u003ca href=\"https://anewpolicy.org/statement-by-non-governmental-organizations-on-president-trumps-recent-statements-endorsing-the-ethnic-cleansing-of-palestinians-in-gaza/\" target=\"_blank\"\u003ejoint statement \u003c/a\u003edenouncing “any effort or initiative, and any calls for, the forcible displacement of Palestinians from Gaza,” according to A New Policy, an advocacy group.\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eThe U.N. human rights office said images of “emaciated Israeli hostages” released Saturday by Hamas under the ceasefire agreement were “deeply distressing,” as are the “severe conditions” reported by Palestinian detainees released by Israel under the deal. Its statement Monday also expressed concern over “the public parading of hostages released by Hamas.”\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv role=\"group\" aria-roledescription=\"carousel\" data-testid=\"author-box\" id=\"author-box\"\u003e\u003cp\u003e\u003ch2\u003e\u003cstrong\u003eLive coverage contributors\u003c/strong\u003e 7\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cli id=\"link-HXOM7VYXNRCZHKOMSO5LOA2MQA\" data-qa=\"article-body\" data-testid=\"article-body-card\" data-luf-content-card=\"true\"\u003e\u003carticle aria-label=\"Trump meets with Jordan’s king as he pushes Gaza takeover plan\" data-qa=\"story-container\"\u003e\u003cdiv data-qa=\"LUF-inline-story\" id=\"link-HXOM7VYXNRCZHKOMSO5LOA2MQA\"\u003e\u003ch2 data-qa=\"headline\"\u003eTrump meets with Jordan’s king as he pushes Gaza takeover plan\u003c/h2\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Michael Birnbaum avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Fd92defb6-e8e9-4116-b147-535164ba751a.png\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Fd92defb6-e8e9-4116-b147-535164ba751a.png\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Fd92defb6-e8e9-4116-b147-535164ba751a.png\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Dan Diamond avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Fd00e2dc4-af48-4eec-8d13-68d968bd8914.png\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Fd00e2dc4-af48-4eec-8d13-68d968bd8914.png\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Fd00e2dc4-af48-4eec-8d13-68d968bd8914.png\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"S2PM3XW35BAJZOZ3VI4QOJREKU\" data-el=\"text\" dir=\"null\"\u003eThe United States will take and hold Gaza while Palestinians there move to Jordan and Egypt, President \u003ca href=\"https://www.washingtonpost.com/donald-trump/\" target=\"_blank\"\u003eDonald Trump\u003c/a\u003e said Tuesday during a meeting with Jordan’s King Abdullah II.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"H3M4QTSC6VGNXEKURIAYB67VMA\" data-el=\"text\" dir=\"null\"\u003eThe Oval Office conversation was Trump’s first visit with an Arab leader since moving back into the White House, and it was a measure of his unwillingness to budge on his desire for a U.S. takeover of Gaza. Although Trump’s tone was friendly Tuesday, his message was almost sure to kindle a blaze for Abdullah at home, where taking a fresh influx of Palestinian refugees would be \u003ca href=\"https://www.washingtonpost.com/world/2025/02/09/trump-gaza-proposal-jordan-palestinians/\" target=\"_blank\"\u003epolitically destabilizing\u003c/a\u003e.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"ZO2TARQTOJG35DWWEFAUF5SSMI\" data-el=\"text\" dir=\"null\"\u003eSpeaking in the Oval Office, Trump repeatedly asserted that the United States would take over Gaza — but again refused to specify how.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"6WT2I37AKZEXXB273MVS2K5OZA\" data-el=\"text\" dir=\"null\"\u003e“We’re going to take it, we’re going to hold it, we’re going to cherish it,” he told reporters. Asked how the United States would claim the Palestinian territory, Trump cited “U.S. authority.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"LVOIGZIO2FFABLCZC6ILG2O3WQ\" data-el=\"text\" dir=\"null\"\u003eThe Jordanian king tried hard not to be pulled into the discussion, wary of alienating a U.S. leader who greenlights at least $1.5 billion in aid for Jordan every year. But with the eyes of his own nation upon him, Abdullah also could not acquiesce to Trump’s demand to take in Gazans.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"Z5Y7XUQTSVGWFPLXHXHDO7OQCI\" data-el=\"text\" dir=\"null\"\u003eAny response to taking Gaza refugees would need to be multilateral and not rest solely on Jordan, the king said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"Q3CH5N44AVCSRHUZAONDQMAZWU\" data-el=\"text\" dir=\"null\"\u003e“This is something that we as Arabs will be coming to the United States with, something that we’re going to talk about later. We’ll discuss all these options,” Abdullah said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"TUF4KPAI7NHVDEJFBXJD4GATNM\" data-el=\"text\" dir=\"null\"\u003eHe said the focus must be on finding a solution that works for all parties, but he demurred on discussing Trump’s demands, saying he wanted to wait until Egyptians could present their own ideas. He also said that Jordan had already taken in 2,000 children from Gaza, a move that Trump praised and said came as a surprise to U.S. leaders.\u003c/p\u003e\u003cp\u003eThis is an excerpt from a full story.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/li\u003e\u003cli id=\"link-ZBEFI7WWMZGVXMK7IKQKR5LWUU\" data-qa=\"article-body\" data-testid=\"article-body-card\" data-luf-content-card=\"true\"\u003e\u003carticle aria-label=\"Trump pressures Egypt and Jordan to take Palestinians displaced from Gaza\" data-qa=\"story-container\"\u003e\u003cdiv data-qa=\"LUF-inline-story\" id=\"link-ZBEFI7WWMZGVXMK7IKQKR5LWUU\"\u003e\u003ch2 data-qa=\"headline\"\u003eTrump pressures Egypt and Jordan to take Palestinians displaced from Gaza\u003c/h2\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Kelly Kasulis Cho avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F9a968f29-7732-45e9-b110-9ef1e4c42571.jpg\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F9a968f29-7732-45e9-b110-9ef1e4c42571.jpg\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F9a968f29-7732-45e9-b110-9ef1e4c42571.jpg\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Abbie Cheeseman avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Ff709ad7c-8b67-4bf6-b77d-b979c71c2299.jpg\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Ff709ad7c-8b67-4bf6-b77d-b979c71c2299.jpg\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Ff709ad7c-8b67-4bf6-b77d-b979c71c2299.jpg\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cdiv data-qa=\"article-body\" data-testid=\"article-video\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cp\u003ePalestinians displaced from Gaza would not have the right to return there, President Donald Trump said in an interview with Fox News aired on Feb. 10. (Video: Fox News)\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"FCGROI673JALTDWYYPGHZBD454\" data-el=\"text\" dir=\"null\"\u003ePresident Donald Trump said Monday that he would consider withholding aid from Jordan and Egypt if they don’t comply with his request to take in Palestinians from Gaza, further pushing his controversial plan for the United States to “\u003ca href=\"https://www.washingtonpost.com/politics/2025/02/04/trump-netanyahu-meeting/?itid=lk_inline_manual_78\" target=\"_blank\"\u003etake over\u003c/a\u003e” and “own” the enclave to rebuild it while displacing its residents to a “permanent place.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"T7QKW2HLDVG2RAYCCZYLZB3NPU\" data-el=\"text\" dir=\"null\"\u003eAsked by a reporter Monday whether he would withhold aid from Egypt and Jordan if they didn’t comply, he answered: “Yeah, maybe, sure, why not? If they don’t, I would conceivably withhold aid, yes.” \u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RC7DX5LTNVEKVIZHOVEKJYGBX4\" data-el=\"text\" dir=\"null\"\u003eIn a televised interview broadcast later Monday, Fox News host Bret Baier asked Trump whether displaced Palestinians would have the right to return to Gaza later under the president’s plan. “No, they wouldn’t, because they’re going to have much better housing. In other words, I’m talking about building a permanent place for them,” Trump responded.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"5LPQUQEREZAVHMZWEH5FR2D6JM\" data-el=\"text\" dir=\"null\"\u003eHe added that he believed he could strike a “deal” with Egypt and Jordan and claimed that the United States gives both countries “billions and billions of dollars a year.” The United States provided Jordan with almost \u003ca href=\"https://www.foreignassistance.gov/cd/jordan/2023/obligations/0\" target=\"_blank\"\u003e$1.7 billion\u003c/a\u003e in foreign aid in fiscal 2023, the most recent period with complete data, and it gave Egypt about \u003ca href=\"https://www.foreignassistance.gov/cd/egypt/2023/obligations/0\" target=\"_blank\"\u003e$1.5 billion\u003c/a\u003e, according to the government’s foreign assistance website.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"PIB24WPWUZECNDLPL3Q5SN7KXA\" data-el=\"text\" dir=\"null\"\u003eWhile the sum of aid is large, experts have raised doubts about whether the threat would be enough to push Egypt’s government toward an action it has vehemently rejected. “I can’t imagine” that even withholding all aid would be “anywhere near enough pressure to get Egypt to accept hosting a massive population of Palestinians,” said Timothy Kaldas, deputy director of the Washington-based Tahrir Institute for Middle East Policy.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"5HR4WTACCBE4ZKPSID5ZV7GTHU\" data-el=\"text\" dir=\"null\"\u003e“Trump’s proposal both creates new problems while making resolving existing ones more difficult,” Kaldas said. While the pressure on aid “does not give him the leverage he needs to compel Cairo to accept his proposal,” his plan to displace Palestinians from Gaza “has inflated the Israeli government’s ambitions,” which could make “reaching a realistic and implementable deal all the more difficult.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"BMXIECQ7SNCEHMMRIUO7TI6XFI\" data-el=\"text\" dir=\"null\"\u003eTrump on Monday also made threatening remarks about the Israel-Hamas ceasefire deal, saying that “all hell is going to break out” if Hamas does not release all remaining Israeli hostages by noon Saturday. Hamas had said it would delay the release of three Israeli hostages set for Saturday “until further notice,” blaming Israeli gunfire in Gaza and an insufficient flow of aid.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"D3HRBCTUSVGA5NXKZHRE6GTNAE\" data-el=\"text\" dir=\"null\"\u003e“We must avoid at all costs resumption of hostilities in Gaza that would lead to immense tragedy,” U.N. Secretary General António Guterres \u003ca href=\"https://x.com/antonioguterres/status/1889229088705200179\" target=\"_blank\"\u003ewrote Tuesday\u003c/a\u003e in a post on X. “I appeal to Hamas to proceed with the planned liberation of hostages. Both sides must fully abide by their commitments in the ceasefire agreement \u0026amp; resume serious negotiations.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/li\u003e\u003cli id=\"link-EKYB3NUHXFGRZOBULASRJY6JDU\" data-qa=\"article-body\" data-testid=\"article-body-card\" data-luf-content-card=\"true\"\u003e\u003carticle aria-label=\"Israel confirms death of Shlomo Mantzur, believed to be oldest hostage in Gaza \" data-qa=\"story-container\"\u003e\u003cdiv data-qa=\"LUF-inline-story\" id=\"link-EKYB3NUHXFGRZOBULASRJY6JDU\"\u003e\u003ch2 data-qa=\"headline\"\u003eIsrael confirms death of Shlomo Mantzur, believed to be oldest hostage in Gaza \u003c/h2\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Abbie Cheeseman avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Ff709ad7c-8b67-4bf6-b77d-b979c71c2299.jpg\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Ff709ad7c-8b67-4bf6-b77d-b979c71c2299.jpg\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2Ff709ad7c-8b67-4bf6-b77d-b979c71c2299.jpg\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Lior Soroka avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F00ed57d1-a65c-458d-9b4c-9b06c874784b.png\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F00ed57d1-a65c-458d-9b4c-9b06c874784b.png\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F00ed57d1-a65c-458d-9b4c-9b06c874784b.png\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"EZQBRKJTE5FBBONS7OWDEEF43Y\" data-el=\"text\" dir=\"null\"\u003eIsraeli authorities on Tuesday confirmed the death of Shlomo Mantzur, 86, who was believed to be the oldest hostage held in Gaza, saying he was killed during the Oct. 7, 2023, Hamas attack on Israel.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"DUX5TW5N4FCULCSMMTSPI7OJ6A\" data-el=\"text\" dir=\"null\"\u003e“During the brutal terrorist assault by the Hamas murderers on October 7, he was murdered and abducted to Gaza,” Israeli Prime Minister Benjamin Netanyahu said in a statement. “We share in the family’s deep mourning. We will neither rest nor be silent until he is returned for burial in Israel.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"AJQJCR4SJZA6HBSQPWCUSRGWOM\" data-el=\"text\" dir=\"null\"\u003eIsraeli media had previously reported that Mantzur was among the hostages who would be released in the first phase of the ceasefire deal between Israel and Hamas. Basem Naim, a senior Hamas official, told The Washington Post in late January that the group had given Israel the names of eight hostages whose bodies would be released in the first phase.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"3JODLTEBE5CG7KST3C4F2BKBOI\" data-el=\"text\" dir=\"null\"\u003e“The decision to confirm his death was based on intelligence gathered in recent months,” the Israel Defense Forces said in a statement. It is not immediately clear if Mantzur’s body would be given to Israel in the next stage of hostage releases, set for Saturday. Hamas said Monday it would delay the release of three Israeli hostages on Saturday “until further notice” because of what it said were Israeli violations of the ceasefire deal.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"3FAXK6OSKJHEPF4ZVDTJW6L3UQ\" data-el=\"text\" dir=\"null\"\u003e“For months, we lived between hope and fear, and today, we are overtaken with grief,” Lior Carmel, chairman of Kibbutz Kissufim, said in a statement Tuesday. Mantzur was one of the founders of the kibbutz.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"CCHC2BYK5NDIJMKH7TUCL2PJMM\" data-el=\"text\" dir=\"null\"\u003eMantzur’s family, in a statement, called him “a pillar of strength.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"V2XLXM3TVZFW7DMKAAXK7RDA3Y\" data-el=\"text\" dir=\"null\"\u003eHe was “a man of high morals and values, a lover of humanity, who always helped others wholeheartedly,” they said. “We call upon decision-makers to make a brave and ethical decision to bring all hostages home immediately — the living for rehabilitation and the deceased for proper burial in their homeland.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/li\u003e\u003cli id=\"link-FVLWHO65QZEY5LVXHQ3IS4AULE\" data-qa=\"article-body\" data-testid=\"article-body-card\" data-luf-content-card=\"true\"\u003e\u003carticle aria-label=\"Trump says ‘Let hell break out’ in Gaza if hostages aren’t returned by Saturday\" data-qa=\"story-container\"\u003e\u003cdiv data-qa=\"LUF-inline-story\" id=\"link-FVLWHO65QZEY5LVXHQ3IS4AULE\"\u003e\u003ch2 data-qa=\"headline\"\u003eTrump says ‘Let hell break out’ in Gaza if hostages aren’t returned by Saturday\u003c/h2\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-chromatic=\"ignore\" alt=\"Sammy Westfall avatar\" loading=\"lazy\" decoding=\"async\" data-nimg=\"intrinsic\" srcset=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F8b2f76a4-59c6-4974-8334-7e764fdb9766.jpeg\u0026amp;w=260 1x, https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F8b2f76a4-59c6-4974-8334-7e764fdb9766.jpeg\u0026amp;w=540 2x\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https%3A%2F%2Fs3.amazonaws.com%2Farc-authors%2Fwashpost%2F8b2f76a4-59c6-4974-8334-7e764fdb9766.jpeg\u0026amp;w=540\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cdiv data-qa=\"article-body\" data-testid=\"article-video\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cp\u003ePresident Donald Trump said on Feb. 10 that the Gaza ceasefire deal is off if all hostages are not released by noon on Saturday. (Video: The Washington Post)\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"2PI6B47OEJET3JR3EOGEMHP3BI\" data-el=\"text\" dir=\"null\"\u003ePresident Donald Trump issued an ultimatum to Hamas on Monday saying that if all Israeli hostages are not released from Gaza by Saturday “all hell is going to break out.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"SQEFLVFG3FF35H4O5EC6ZPHHWI\" data-el=\"text\" dir=\"null\"\u003eWhile he said the decision to end the ceasefire ultimately falls on Israel, Trump said in remarks to reporters that\u003cb\u003e \u003c/b\u003e“If all of the hostages aren’t returned by Saturday at 12 o’clock … I would say, cancel it and all bets are off and let hell break out.” He did not specify whether that meant noon or midnight.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"7ZB2WHMXJFBCHANWLSRCRYDGLQ\" data-el=\"text\" dir=\"null\"\u003eWhen asked whether he meant retaliation, Trump said, “You’ll find out, and they’ll find out, too. Hamas will find out what I mean.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"V2L3Z4IU6NBANBPRE3U5KDTWPE\" data-el=\"text\" dir=\"null\"\u003eAsked whether he could rule out any U.S. involvement after that Saturday deadline, Trump replied, “We’ll see what happens.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"WV52A5CIJBH6HICGASNYKSJJQU\" data-el=\"text\" dir=\"null\"\u003eTrump’s strong comments came after Hamas earlier in the day said it would delay “until further notice” the release of three Israeli hostages set for Saturday — the first major setback for the ceasefire and hostage-release deal.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"Y3SNTSZCTRHC7LUQFEWIWLZDXY\" data-el=\"text\" dir=\"null\"\u003eTrump made similar threats in the past, saying in early January that “\u003ca href=\"https://www.washingtonpost.com/world/2025/01/13/gaza-trump-hell-pay-casualties-deaths/\" target=\"_blank\"\u003eall hell will break out\u003c/a\u003e” in the Middle East if the remaining hostages in Hamas captivity in Gaza were not released by the time he took office later that month.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/li\u003e\u003cdiv\u003e\u003cdiv data-qa=\"content\" data-testid=\"linkbox\"\u003e\u003ch3 data-qa=\"linkbox-headline\"\u003eMiddle East conflict \u003c/h3\u003e\u003cp\u003ePresident Donald Trump on Monday said he would consider withholding aid from Jordan and Egypt if they do not comply with his request to take in Palestinians from Gaza. Follow \u003ca href=\"https://www.washingtonpost.com/world/2025/02/11/israel-war-gaza-ceasefire-jordan-egypt-news-hamas/\" target=\"_blank\"\u003elive updates on the ceasefire\u003c/a\u003e and the \u003ca href=\"https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/\" target=\"_blank\"\u003ehostages remaining in Gaza\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eThe Israel-Gaza war: \u003c/b\u003eOn Oct. 7, 2023, \u003ca href=\"https://www.washingtonpost.com/world/2023/10/09/hamas-israel-war-explainer/\" target=\"_blank\"\u003eHamas militants\u003c/a\u003e launched an unprecedented \u003ca href=\"https://www.washingtonpost.com/world/2023/10/07/israel-gaza-hamas-attack-palestinians/\" target=\"_blank\"\u003ecross-border attack\u003c/a\u003e on Israel, killing about 1,200 people and taking civilian hostages. \u003ca href=\"https://www.washingtonpost.com/world/2024/04/07/israel-hamas-gaza-war-timeline-anniversary/\" target=\"_blank\"\u003eIsrael declared war on Hamas\u003c/a\u003e in response, launching a ground invasion that \u003ca href=\"https://www.washingtonpost.com/world/interactive/2023/gaza-palestine-displacement-rafah-maps-photos/\" target=\"_blank\"\u003efueled the biggest displacement\u003c/a\u003e in the region since \u003ca href=\"https://www.washingtonpost.com/history/2023/11/03/israel-nakba-history-1948/?itid=lk_inline_enhanced-template\" target=\"_blank\"\u003eIsrael’s creation in 1948\u003c/a\u003e. In July 2024, \u003ca href=\"https://www.washingtonpost.com/world/2024/07/31/hamas-leader-assassinated-iran-israel/\" target=\"_blank\"\u003eHamas leader Ismail Haniyeh was killed\u003c/a\u003e in an attack Hamas has blamed on Israel.\u003c/p\u003e\u003cp\u003e\u003cb\u003eHezbollah:\u003c/b\u003e In late 2024,\u003cb\u003e \u003c/b\u003eIsrael and Lebanon’s Hezbollah \u003ca href=\"https://www.washingtonpost.com/world/2024/11/26/israel-hezbollah-lebanon-ceasefire-biden/\" target=\"_blank\"\u003eagreed to a ceasefire deal\u003c/a\u003e, bringing a tenuous halt to more than a year of hostilities that included an\u003ca href=\"https://www.washingtonpost.com/world/2024/09/30/israel-lebanon-ground-invasion-hezbollah-war/\" target=\"_blank\"\u003e Israeli invasion of southern Lebanon\u003c/a\u003e.  Israel’s airstrikes into Lebanon had \u003ca href=\"https://www.washingtonpost.com/world/2024/10/02/israeli-strikes-lebanon-deadliest/\" target=\"_blank\"\u003ebeen intense and deadly\u003c/a\u003e, killing over 1,400 people including \u003ca href=\"https://www.washingtonpost.com/world/2024/09/28/hasan-nasrallah-hezbollah-israel-beirut/\" target=\"_blank\"\u003eHasan Nasrallah\u003c/a\u003e, Hezbollah’s longtime leader. The \u003ca href=\"https://www.washingtonpost.com/world/2024/09/25/israel-lebanon-border-conflicts-history-hezbollah/\" target=\"_blank\"\u003eIsrael-Lebanon border has a history of violence\u003c/a\u003e that dates back to Israel’s founding.\u003c/p\u003e\u003cp\u003e\u003cb\u003eGaza crisis: \u003c/b\u003eIn the Gaza Strip, Israel has waged one of this century’s \u003ca href=\"https://www.washingtonpost.com/investigations/interactive/2023/israel-war-destruction-gaza-record-pace/\" target=\"_blank\"\u003emost destructive wars\u003c/a\u003e, killing tens of thousands and plunging at least half of the population into “\u003ca href=\"https://www.washingtonpost.com/world/2024/03/18/gaza-famine-food-hunger/\" target=\"_blank\"\u003efamine-like conditions.\u003c/a\u003e” For months, Israel has resisted pressure from Western allies to allow \u003ca href=\"https://www.washingtonpost.com/world/2024/03/03/gaza-aid-convoy-israel-war/\" target=\"_blank\"\u003emore humanitarian aid into the enclave\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eU.S. involvement: \u003c/b\u003eDespite \u003ca href=\"https://www.washingtonpost.com/world/2024/03/05/biden-netanyahu-gantz/\" target=\"_blank\"\u003etensions between Israeli Prime Minister Benjamin Netanyahu and some U.S. politicians\u003c/a\u003e, including former President Joe Biden, the United States supports Israel with \u003ca href=\"https://www.washingtonpost.com/national-security/2024/03/29/us-weapons-israel-gaza-war/\" target=\"_blank\"\u003eweapons\u003c/a\u003e, funds \u003ca href=\"https://www.washingtonpost.com/politics/2024/02/12/house-ukraine-johnson-senate/\" target=\"_blank\"\u003eaid packages\u003c/a\u003e, and has \u003ca href=\"https://www.washingtonpost.com/national-security/2024/02/20/israel-gaza-ceasefire-us-veto/\" target=\"_blank\"\u003evetoed \u003c/a\u003eor \u003ca href=\"https://www.washingtonpost.com/world/2024/03/25/israel-us-gaza-hamas-gallant/\" target=\"_blank\"\u003eabstained\u003c/a\u003e from the United Nations’ ceasefire resolutions.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"collections-main\" itid=\"\"\u003e\u003cul data-testid=\"collections-list\" data-qa=\"collections-wrapper\"\u003e\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/world/2025/02/11/israel-war-gaza-ceasefire-jordan-egypt-news-hamas/\"\u003e\u003cdiv data-qa=\"text-card-link\"\u003e\u003cp\u003e\u003cspan\u003eLive briefing: Gaza ceasefire will end if Hamas does not return hostages Saturday, Netanyahu says\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cimg data-chromatic=\"ignore\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BNVPRRW725A6LOSEEUMLOE3D5E_size-normalized.jpg\u0026amp;w=767\u0026amp;h=511\" loading=\"lazy\" alt=\"\" height=\"511\" width=\"767\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/world/2025/02/09/trump-gaza-proposal-jordan-palestinians/\"\u003e\u003cdiv data-qa=\"text-card-link\"\u003e\u003cp\u003e\u003cspan\u003eJordan, home to millions of Palestinians, fears Trump’s Gaza proposal\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cimg data-chromatic=\"ignore\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/23KV6XJEGEGUEMVJY6KIEPXP3M_size-normalized.JPG\u0026amp;w=767\u0026amp;h=511\" loading=\"lazy\" alt=\"\" height=\"511\" width=\"767\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/national-security/2025/02/09/trump-gaza-development-intervention/\"\u003e\u003cdiv data-qa=\"text-card-link\"\u003e\u003cp\u003e\u003cspan\u003eTrump’s Gaza plan is the latest U.S. attempt to transform Middle East\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cimg data-chromatic=\"ignore\" src=\"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VIIH5CCXMYI6RGEJA66MCMT7JM.jpg\u0026amp;w=767\u0026amp;h=511\" loading=\"lazy\" alt=\"\" height=\"511\" width=\"767\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-qa=\"newsletter\" aria-label=\"\"\u003e\u003cp\u003e\u003cimg data-chromatic=\"ignore\" src=\"https://www.washingtonpost.com/dr/resources/images/generic-newsletter-signup.png\" alt=\"\" width=\"166\" height=\"110\" loading=\"lazy\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg data-chromatic=\"ignore\" src=\"https://www.washingtonpost.com/dr/resources/images/generic-newsletter-signup.png\" alt=\"\" width=\"166\" height=\"110\" loading=\"lazy\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-02-11T07:14:40.044Z",
  "modifiedTime": "2025-02-11T23:33:45.147Z"
}
