{
  "id": "d4a5e5b3-0064-4977-82a6-b8d466781db8",
  "title": "Pentagon details Iran bombing amid questions about scope of damage",
  "link": "https://www.washingtonpost.com/national-security/2025/06/26/hegseth-caine-iran-nuclear-damage-assessment/",
  "description": "Pete Hegsth and Gen. Dan Caine touted the U.S. attack on a covert nuclear facility but sidestepped questions about the fate of Iran’s uranium stockpile.",
  "author": "Dan Lamothe, Alex Horton",
  "published": "Thu, 26 Jun 2025 21:37:36 +0000",
  "source": "http://feeds.washingtonpost.com/rss/world",
  "categories": null,
  "byline": "Dan Lamothe, Alex Horton",
  "length": 10153,
  "excerpt": "Pete Hegsth and Gen. Dan Caine touted the U.S. attack on a covert nuclear facility but sidestepped questions about the fate of Iran’s uranium stockpile.",
  "siteName": "The Washington Post",
  "favicon": "https://www.washingtonpost.com/touch-icon-iphone-retina.png",
  "text": "Top Pentagon officials on Thursday revealed new details about the U.S. bombing of Iran’s nuclear facilities and the subsequent defense of a military base that faced a retaliatory attack, describing both as intricate operations with little margin for error while sidestepping questions about the fate of Tehran’s uranium stockpile.Gen. Dan Caine, chairman of the Joint Chiefs of Staff, told reporters that Sunday’s aerial raid on Iran — Operation Midnight Hammer — followed a secret project that traces to 2009 and a small team within the Pentagon’s Defense Threat Reduction Agency. Its members, he said, spent years studying Tehran’s construction of an underground lair to enrich uranium and how the U.S. military might strike the facility should Iran attain the ability to develop a nuclear weapon.“You do not build a multilayered underground bunker complex with centrifuges and other equipment in a mountain for any peaceful purpose,” Caine said.That team’s 15 years of work laid the foundation, he said, for this past weekend’s operation in which six B-2 stealth bombers — under the cover of darkness — each dropped two 30,000-pound bunker-busting rounds on the Fordow nuclear enrichment facility. The first bomb “forcibly removed” a concrete cap Iran installed to try to shield the complex from an attack, with the next 11 falling precisely down mountaintop vents to maximize destruction inside, Caine explained. A seventh B-2 carrying two additional bombs flew with the other six bombers as a backup, and later dropped that ordnance on Iran’s Natanz nuclear facility before returning home to Missouri with the other aircraft that participated.Caine said the military does not “grade our own homework,” leaving the damage assessments for the U.S. intelligence community to complete. But the bombs used — known formally as the Massive Ordnance Penetrator (MOP), or Guided Bomb Unit 57 — were built specifically for the mission, released according to plan, hit their intended targets, and exploded as intended, the general said.“We know that the trailing jets saw the first weapons function and the pilots stated, quote: ‘This was the brightest explosion that I’ve ever seen. It literally looked like daylight,’” Caine added.These and other details were revealed Thursday as President Donald Trump and Defense Secretary Pete Hegseth continued to voice outrage at the disclosure of a classified early assessment of the bombing’s outcome. The document, produced by the Pentagon’s Defense Intelligence Agency, suggested the attack may have set back the Iranian nuclear program by months, rather than years.Trump and Hegseth have said the strike “obliterated” Tehran’s nuclear development capacity, but Caine has continued to be more selective in his language pending a complete, final intelligence analysis. The head of the International Atomic Energy Agency, Rafael Mariano Grossi, told a French broadcaster on Thursday that Fordow suffered “enormous damage” and its centrifuges are “no longer operational,” but he stopped short of affirming Trump’s public assessment.“I think annihilated is too much,” Grossi said.Media coverage of the preliminary intelligence report — which officials labeled “low-confidence” in nature — upset the president and led him on Wednesday to direct Hegseth and Caine to brief the Pentagon press corps, officials familiar with the matter said, speaking on the condition of anonymity because of the issue’s sensitivity. Trump announced the news conference on social media and said it would be held to “fight for the Dignity of our Great American Pilots.” An extensive portion of Hegseth’s and Caine’s remarks Thursday emphasized the bravery of the aircrews involved.After the preliminary assessment’s disclosure prompted scrutiny of Trump’s claims, CIA Director John Ratcliffe issued a statement saying the agency “can confirm that a body of credible intelligence indicates Iran’s Nuclear Program has been severely damaged by the recent, targeted strikes.” He cited without specifics new information “from a historically reliable and accurate source/method that several key Iranian nuclear facilities were destroyed and would have to be built over a period of years.”Hegseth opened Thursday’s news conference by attacking the news media for reporting the initial intelligence assessment, repeating his earlier allegations that journalists had been “hunting for scandals” to make Trump look bad. The preliminary assessment, he claimed, had been “leaked because someone had an agenda to … make it look like this historic strike wasn’t successful.”As Hegseth, a former Fox News personality, repeatedly and bitterly criticized the assembled reporters, he sought to bolster claims that he and Trump have made about the damage caused by Sunday’s strikes, citing other, unspecified intelligence findings he said he had seen and the CIA statement issued by Ratcliffe.“It’s almost personal,” he declared at one point, lamenting “the way in which leaks are used to try to disparage the outcome or muddy the waters about the impact of what happened.”Anyone possessing “two eyes, some ears and a brain,” he said, would recognize that the enormous firepower the Air Force used in the operation would have a “devastating effect.” Asked how he could feel so confident of that just a few days after the strike, he cited the “skill of the men and women, and the capabilities of the systems they employed, and the recognition so far that it was a highly successful mission.”Hegseth claimed the operation was the “most complex and secretive military operation in history,” neglecting to mention other major missions, including the D-Day landing on the French shore of Normandy during World War II.His performance appeared to appease the president, who called it “One of the greatest, most professional, and most ‘confirming’ News Conferences I have ever seen!”But Hegseth’s tone and delivery disappointed some in the Defense Department, given its nonpartisan mission.“Not a good look,” said one senior defense official, speaking like some others on the condition of anonymity to avoid retaliation. Since announcing the operation, Trump and Hegseth have conflated tactical success — the planes dropped their bombs on the desired target — with their stated strategic goal of permanently destroying Iran’s nuclear program. Privately, defense officials have cautioned that the distinction is an important one: That the bombs functioned properly does not necessarily mean the strikes achieved everything that war planners hoped they would.While Caine described the bombs performing well in controlled tests against mock facilities, experts have stressed that the extent of the damage will depend on how well analysts gauged the thickness of rock and soil at Fordow, among other variables that would have affected the performance of the bombs.“Your intel on interiors needs to be spot-on,” a defense official said.Other experts who are knowledgeable about long-standing U.S. calculus surrounding Fordow have agreed that if the bombs hit their targets, Iran’s program probably suffered a significant setback.Dan Shapiro, a Pentagon official during the Biden administration and U.S. ambassador to Israel during the Obama administration, said in a social media post on Thursday that he was “very familiar with the plan” to use bunker busters against Fordow and had little doubt based on Caine’s description of the operation that a major blast would occur and “render centrifuges inoperable.”“That’s separate from legitimate questions about the status of enriched uranium, residual centrifuges elsewhere \u0026 Iranian intentions.” Shapiro wrote. “But with regard to the strike on Fordow, I have little doubt that the facility and equipment in it will be unusable for a considerable period of time.”Caine, as a military officer, sought to avoid the briefing’s partisan vitriol. But he did face difficult questions, including whether he had been asked by Trump or Hegseth to provide a “more rosy intelligence assessment” of the strike.“No, I have not, and no, I would not,” Caine responded, adding that his job is to provide options to the president and other senior leaders, and then execute the orders they issue.The Trump administration has been dogged by questions about whether uranium at the Fordow facility had been removed before the strikes. Satellite images captured last week showed numerous cargo trucks lined up near the underground complex. Hegseth, asked about the imagery, deflected and said there is “nothing that I’ve seen” that suggests the United States did not hit “what we wanted to hit in those locations.”Caine praised the pilots and other service members involved in the bombing raid and the U.S. soldiers who operated two Patriot missile-defense systems on Monday as Iran launched ballistic missiles at al-Udeid Air Base in Qatar in response to the U.S. attack.The bomber crews included members of the active-duty Air Force and the Missouri Air National Guard at Whiteman Air Force Base, Caine said.“They were male and female aviators on this mission, and a crew member told me when I talked to them on video the other day that this felt like the Super Bowl — the thousands of scientists, airmen, and maintainers all coming together,” Caine said.When the pilots went to work Friday, Caine said, “they kissed their loved ones goodbye, not knowing when or if they’d be home.” They returned to Whiteman on Sunday after a 36-hour mission.The ensuing attack on the air base in Qatar, on Monday, required quick thinking by about 44 U.S. soldiers who defended the installation from the incoming ballistic missiles, the general added.Trump has said that Iran notified the United States in advance of its attack.The Iranian strike on al-Udeid occurred about 7:30 p.m. as the sun set in Qatar. Caine said the U.S. response is believed to be the “largest single Patriot engagement in U.S. military history.” He declined to specify how many interceptor rounds the soldiers fired, citing operational security.“Our U.S. air defenders had only seconds to make complex decisions with strategic impact,” Caine said. They are, he said, “unsung heroes.”",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/N6UGTNRN6KIPL4JUN5PQVYNVO4_size-normalized.jpg\u0026w=1440",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp data-apitype=\"text\" data-contentid=\"UXNI4HK73RHSHKOZJTWZQACVGA\" data-el=\"text\" dir=\"null\"\u003eTop Pentagon officials on Thursday revealed new details about the \u003ca href=\"https://www.washingtonpost.com/world/2025/06/21/israel-iran-live-updates-us-trump/\" target=\"_blank\"\u003eU.S. bombing of Iran’s nuclear facilities\u003c/a\u003e and the subsequent defense of a military base that faced a retaliatory attack, describing both as intricate operations with little margin for error while sidestepping questions about the fate of Tehran’s uranium stockpile.\u003c/p\u003e\u003c/div\u003e\u003cp data-apitype=\"text\" data-contentid=\"4IVVW6T4EZAHZKEIVVG3X7C6FU\" data-el=\"text\" dir=\"null\"\u003eGen. Dan Caine, chairman of the Joint Chiefs of Staff, told reporters that Sunday’s aerial raid on Iran — Operation Midnight Hammer — followed a secret project that traces to 2009 and a small team within the Pentagon’s Defense Threat Reduction Agency. Its members, he said, spent years studying Tehran’s construction of an underground lair to enrich uranium and how the U.S. military might strike the facility should Iran attain the ability to develop a nuclear weapon.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"YLGHMU7G7BGF3JJZAYJNKC23LY\" data-el=\"text\" dir=\"null\"\u003e“You do not build a multilayered underground bunker complex with centrifuges and other equipment in a mountain for any peaceful purpose,” Caine said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"7EYHA4KTWNHOLJNG4OYA22G5BI\" data-el=\"text\" dir=\"null\"\u003eThat team’s 15 years of work laid the foundation, he said, for this past weekend’s operation in which six B-2 stealth bombers — under the cover of darkness — each dropped two \u003ca href=\"https://www.washingtonpost.com/national-security/2025/06/17/massive-ordnance-penetrator-iran-bunker-buster/\" target=\"_blank\"\u003e30,000-pound bunker-busting rounds\u003c/a\u003e on the Fordow nuclear enrichment facility. The first bomb “forcibly removed” a concrete cap Iran installed to try to shield the complex from an attack, with the next 11 falling precisely down mountaintop vents to maximize destruction inside, Caine explained. A seventh B-2 carrying two additional bombs flew with the other six bombers as a backup, and later dropped that ordnance on Iran’s Natanz nuclear facility before returning home to Missouri with the other aircraft that participated.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"HAVSDPSE6VEURKLEKQULOHDSKY\" data-el=\"text\" dir=\"null\"\u003eCaine said the military does not “grade our own homework,” leaving the damage assessments for the U.S. intelligence community to complete. But the bombs used — known formally as the Massive Ordnance Penetrator (MOP), or Guided Bomb Unit 57 — were built specifically for the mission, released according to plan, hit their intended targets, and exploded as intended, the general said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"NUBRXIASMBDA5JVNDEK23TADQQ\" data-el=\"text\" dir=\"null\"\u003e“We know that the trailing jets saw the first weapons function and the pilots stated, quote: ‘This was the brightest explosion that I’ve ever seen. It literally looked like daylight,’” Caine added.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"WSMKERTRNVG4XKDA2NXGCQKDQ4\" data-el=\"text\" dir=\"null\"\u003eThese and other details were revealed Thursday as President Donald Trump and Defense Secretary Pete Hegseth continued to voice outrage at the disclosure of a \u003ca href=\"https://www.washingtonpost.com/national-security/2025/06/24/us-iran-bomb-assessment-nuclear-sites-not-destroyed/\" target=\"_blank\"\u003eclassified early assessment\u003c/a\u003e of the bombing’s outcome. The document, produced by the Pentagon’s Defense Intelligence Agency, suggested the attack may have set back the Iranian nuclear program by months, rather than years.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"COHC3TOPSNA7ZND4BFO3BPNYUM\" data-el=\"text\" dir=\"null\"\u003eTrump and Hegseth have said the strike “obliterated” Tehran’s nuclear development capacity, but Caine has continued to be \u003ca href=\"https://www.washingtonpost.com/national-security/2025/06/22/us-iran-bombing-nuclear-damage/\" target=\"_blank\"\u003emore selective in his language\u003c/a\u003e pending a complete, final intelligence analysis. The head of the International Atomic Energy Agency, Rafael Mariano Grossi, \u003ca href=\"https://www.rfi.fr/fr/podcasts/le-grand-invit%C3%A9-international/20250626-aiea-rafael-grossi-programme-nucl%C3%A9aire-iran-%C3%A9normes-d%C3%A9g%C3%A2ts-guerre-israel\" target=\"_blank\"\u003etold a French broadcaster\u003c/a\u003e on Thursday that Fordow suffered “enormous damage” and its centrifuges are “no longer operational,” but he stopped short of affirming Trump’s public assessment.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"NPLPJ6FMXZH3DC6AQJOONZKD64\" data-el=\"text\" dir=\"null\"\u003e“I think annihilated is too much,” Grossi said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"6W3UPBYA3JCCDP345GZKDVOS54\" data-el=\"text\" dir=\"null\"\u003eMedia coverage of the preliminary intelligence report — which officials labeled “low-confidence” in nature — upset the president and led him on Wednesday to direct Hegseth and Caine to brief the Pentagon press corps, officials familiar with the matter said, speaking on the condition of anonymity because of the issue’s sensitivity. Trump announced the news conference on social media and said it would be held to “fight for the Dignity of our Great American Pilots.” An extensive portion of Hegseth’s and Caine’s remarks Thursday emphasized the bravery of the aircrews involved.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"M2TR6LUG25EVZJRSSNNYUY3ORI\" data-el=\"text\" dir=\"null\"\u003eAfter the preliminary assessment’s disclosure prompted scrutiny of Trump’s claims, CIA Director John Ratcliffe issued a statement saying the agency “can confirm that a body of credible intelligence indicates Iran’s Nuclear Program has been severely damaged by the recent, targeted strikes.” He cited without specifics new information “from a historically reliable and accurate source/method that several key Iranian nuclear facilities were destroyed and would have to be built over a period of years.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"IIITBCUGOZAJFFLERT3FYBPUDE\" data-el=\"text\" dir=\"null\"\u003eHegseth opened Thursday’s news conference by attacking the news media for reporting the initial intelligence assessment, repeating his earlier allegations that journalists had been “hunting for scandals” to make Trump look bad. The preliminary assessment, he claimed, had been “leaked because someone had an agenda to … make it look like this historic strike wasn’t successful.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"SL7HK3I5XNESDG4GWDOI4T6QMM\" data-el=\"text\" dir=\"null\"\u003eAs Hegseth, a former Fox News personality, repeatedly and bitterly criticized the assembled reporters, he sought to bolster claims that he and Trump have made about the damage caused by Sunday’s strikes, citing other, unspecified intelligence findings he said he had seen and the CIA statement issued by Ratcliffe.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"AHWBEEGLOVHBLFCEY4Q6NE2U6A\" data-el=\"text\" dir=\"null\"\u003e“It’s almost personal,” he declared at one point, lamenting “the way in which leaks are used to try to disparage the outcome or muddy the waters about the impact of what happened.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"K7IGQFGIORCGTBTVU5CK5FAY7Y\" data-el=\"text\" dir=\"null\"\u003eAnyone possessing “two eyes, some ears and a brain,” he said, would recognize that the enormous firepower the Air Force used in the operation would have a “devastating effect.” Asked how he could feel so confident of that just a few days after the strike, he cited the “skill of the men and women, and the capabilities of the systems they employed, and the recognition so far that it was a highly successful mission.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"ZZAONYWRXVHKZPJVJZ54CKGJEE\" data-el=\"text\" dir=\"null\"\u003eHegseth claimed the operation was the “most complex and secretive military operation in history,” neglecting to mention other major missions, including the D-Day landing on the French shore of Normandy during World War II.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"FC6BQPX265DYLKXXOHIIAYBH3A\" data-el=\"text\" dir=\"null\"\u003eHis performance appeared to appease the president, who called it “One of the greatest, most professional, and most ‘confirming’ News Conferences I have ever seen!”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JVGRK5VIQJGLLKAGWATNQUJSMM\" data-el=\"text\" dir=\"null\"\u003eBut Hegseth’s tone and delivery disappointed some in the Defense Department, given its nonpartisan mission.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"Z7RZPVKLARAIDHL23PBJ7HTCSE\" data-el=\"text\" dir=\"null\"\u003e“Not a good look,” said one senior defense official, speaking like some others on the condition of anonymity to avoid retaliation. \u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"KTETIFFSSZGF3CJZWLIOHG67J4\" data-el=\"text\" dir=\"null\"\u003eSince announcing the operation, Trump and Hegseth have conflated tactical success — the planes dropped their bombs on the desired target — with their stated strategic goal of permanently destroying Iran’s nuclear program. Privately, defense officials have cautioned that the distinction is an important one: That the bombs functioned properly does not necessarily mean the strikes achieved everything that war planners hoped they would.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JIOTB2GVTJAE7FBC4K4UE6B6SU\" data-el=\"text\" dir=\"null\"\u003eWhile Caine described the bombs performing well in controlled tests against mock facilities, experts have stressed that the extent of the damage will depend on how well analysts gauged the thickness of rock and soil at Fordow, among other variables that would have affected the performance of the bombs.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"KLYJAL3AP5FBHOCQLZDTFCX2CM\" data-el=\"text\" dir=\"null\"\u003e“Your intel on interiors needs to be spot-on,” a defense official said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JGIBM2EQ2ZDUTJNYUP6D5CHEN4\" data-el=\"text\" dir=\"null\"\u003eOther experts who are knowledgeable about long-standing U.S. calculus surrounding Fordow have agreed that if the bombs hit their targets, Iran’s program probably suffered a significant setback.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"FQ46XF23YNHN5BFNA2PXTE46CU\" data-el=\"text\" dir=\"null\"\u003eDan Shapiro, a Pentagon official during the Biden administration and U.S. ambassador to Israel during the Obama administration, said in a social media post on Thursday that he was “very familiar with the plan” to use bunker busters against Fordow and had little doubt based on Caine’s description of the operation that a major blast would occur and “render centrifuges inoperable.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"B6VSCSO73ZHL5CF4IJTAI243SA\" data-el=\"text\" dir=\"null\"\u003e“That’s separate from legitimate questions about the status of enriched uranium, residual centrifuges elsewhere \u0026amp; Iranian intentions.” Shapiro wrote. “But with regard to the strike on Fordow, I have little doubt that the facility and equipment in it will be unusable for a considerable period of time.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"G6NUTB46KBHXDCY4JWNRBJPX24\" data-el=\"text\" dir=\"null\"\u003eCaine, as a military officer, sought to avoid the briefing’s partisan vitriol. But he did face difficult questions, including whether he had been asked by Trump or Hegseth to provide a “more rosy intelligence assessment” of the strike.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"IZ4GIDVO2NFKNBMSYVD74ESP5Q\" data-el=\"text\" dir=\"null\"\u003e“No, I have not, and no, I would not,” Caine responded, adding that his job is to provide options to the president and other senior leaders, and then execute the orders they issue.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JNJQXF3MN5HQ5A6DRXA75APHKU\" data-el=\"text\" dir=\"null\"\u003eThe Trump administration has been dogged by questions about whether uranium at the Fordow facility had been removed before the strikes. \u003ca href=\"https://www.washingtonpost.com/investigations/2025/06/22/iran-strikes-nuclear-site-damage-visuals/\" target=\"_blank\"\u003eSatellite images captured last week\u003c/a\u003e showed numerous cargo trucks lined up near the underground complex. Hegseth, asked about the imagery, deflected and said there is “nothing that I’ve seen” that suggests the United States did not hit “what we wanted to hit in those locations.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"34BCLBNA2VALJA7QY55LSLDQMA\" data-el=\"text\" dir=\"null\"\u003eCaine praised the pilots and other service members involved in the bombing raid and the U.S. soldiers who operated two Patriot missile-defense systems on Monday as Iran launched ballistic missiles at al-Udeid Air Base in Qatar in response to the U.S. attack.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"7534O7PUVRG2LE4A3HRLYNBKSE\" data-el=\"text\" dir=\"null\"\u003eThe bomber crews included members of the active-duty Air Force and the Missouri Air National Guard at Whiteman Air Force Base, Caine said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"4ABRNOUZYFCTZDRMAMCVBVPOJY\" data-el=\"text\" dir=\"null\"\u003e“They were male and female aviators on this mission, and a crew member told me when I talked to them on video the other day that this felt like the Super Bowl — the thousands of scientists, airmen, and maintainers all coming together,” Caine said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"HGFJSDJNW5AXNJ4UBQGEWL2CTM\" data-el=\"text\" dir=\"null\"\u003eWhen the pilots went to work Friday, Caine said, “they kissed their loved ones goodbye, not knowing when or if they’d be home.” They returned to Whiteman on Sunday after a 36-hour mission.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"YHIOZR32NNDM7MRJJLRNAKWS7M\" data-el=\"text\" dir=\"null\"\u003eThe ensuing attack on the air base in Qatar, on Monday, required quick thinking by about 44 U.S. soldiers who defended the installation from the incoming ballistic missiles, the general added.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"3WKHLWUSA5EI5CHCHDYZ6L26WU\" data-el=\"text\" dir=\"null\"\u003eTrump has said that Iran notified the United States in advance of its attack.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"H4ZK2CQYBJGJXBK7G54BTVT5HQ\" data-el=\"text\" dir=\"null\"\u003eThe Iranian strike on al-Udeid occurred about 7:30 p.m. as the sun set in Qatar. Caine said the U.S. response is believed to be the “largest single Patriot engagement in U.S. military history.” He declined to specify how many interceptor rounds the soldiers fired, citing operational security.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"XDKOVU7LWRAQJLFHQN47QOJ53Q\" data-el=\"text\" dir=\"null\"\u003e“Our U.S. air defenders had only seconds to make complex decisions with strategic impact,” Caine said. They are, he said, “unsung heroes.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-06-26T15:32:50.866Z",
  "modifiedTime": "2025-06-26T22:42:44.304Z"
}
