{
  "id": "d6c6c6a2-6573-4461-bf9e-186c8f6786d5",
  "title": "Telescope finds promising hints of life on distant planet",
  "link": "https://www.bbc.com/news/articles/c39jj9vkr34o",
  "description": "Scientists find new but tentative evidence that a faraway world orbiting another star may be home to life.",
  "author": "",
  "published": "Thu, 17 Apr 2025 00:01:17 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Pallab Ghosh",
  "length": 5172,
  "excerpt": "Scientists find new but tentative evidence that a faraway world orbiting another star may be home to life.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250409-091508-0ef9b7676-web-2.19.1-12/apple-touch-icon.png",
  "text": "Scientists have found new but tentative evidence that a faraway world orbiting another star may be home to life.A Cambridge team studying the atmosphere of a planet called K2-18b has detected signs of molecules which on Earth are only produced by simple organisms.This is the second, and more promising, time chemicals associated with life have been detected in the planet's atmosphere by Nasa's James Webb Space Telescope (JWST).But the team and independent astronomers stress that more data is needed to confirm these results.The lead researcher, Prof Nikku Madhusudhan, told me at his lab at Cambridge University's Institute of Astronomy that he hopes to obtain the clinching evidence soon.\"This is the strongest evidence yet there is possibly life out there. I can realistically say that we can confirm this signal within one to two years.\"K2-18b is two and a half times the size of Earth and is seven hundred trillion miles away from us.JWST is so powerful that it can analyse the chemical composition of the planet's atmosphere from the light that passes through from the small red Sun it orbits.The Cambridge group has found that the atmosphere seems to contain the chemical signature of at least one of two molecules that are associated with life: dimethyl sulphide (DMS) and dimethyl disulphide (DMDS). On Earth, these gases are produced by marine phytoplankton and bacteria.Prof Madhusudhan said he was surprised by how much gas was apparently detected during a single observation window.\"The amount we estimate of this gas in the atmosphere is thousands of times higher than what we have on Earth,\" he said.\"So, if the association with life is real, then this planet will be teeming with life,\" he told me.Prof Madhusudhan went further: \"If we confirm that there is life on k2-18b it should basically confirm that life is very common in the galaxy\".There are lots of \"ifs\" and \"buts\" at this stage, as Prof Madhusudhan's team freely admits.Firstly, this latest detection is not at the standard required to claim a discovery. For that, the researchers need to be about 99.99999% sure that their results are correct and not a fluke reading. In scientific jargon that is a five sigma result. These latest results are only three sigma, 99.7%. Which sounds a lot, but it is not enough to convince the scientific community. But it is much more than the one sigma result of 68% the team obtained 18 months ago,, which was greeted with much scepticism at the time.But even if the Cambridge team obtains a five sigma result, that won't be conclusive proof that life exists on the planet, according to Prof Catherine Heymans of Edinburgh University and Scotland's Astronomer Royal, who is independent of the research team.\"Even with that certainty, there is still the question of what is the origin of this gas,\" she told BBC News.\"On Earth it is produced by microorganisms in the ocean, but even with perfect data we can't say for sure that this is of a biological origin on an alien world because loads of strange things happen in in the Universe and we don't know what other geological activity could be happening on this planet that might produce the molecules.\"That view is one the Cambridge team agree with; they are working with other groups to see if DMS and DMDS can be produced by non-living means in the lab.Other research groups have put forward alternative, lifeless, explanations for the data obtained from K2-18b. There is a strong scientific debate not only about whether DMS and DMDS are present but also the planet's composition.The reason many researchers infer that the planet has a vast liquid ocean is the absence of the gas amonia in K2-18b's atmosphere. Their theory is that the ammonia is absorbed by a vast body of water below . But it could equally be explained by an ocean of molten rock, which would preclude life, according to Prof Oliver Shorttle of Cambridge University.\"Everything we know about planets orbiting other stars comes from the tiny amounts of light that glance off their atmospheres. So it is an incredibly tenuous signal that we are having to read, not only for signs of life, but everything else.\"With K2-18b part of the scientific debate is still about the structure of the planet,\" he said.Dr Nicolas Wogan at Nasa's Ames Research Center has yet another interpretation of the data. He published research suggesting that K2-18b is a mini gas giant with no surface. Both these alternative interpretations have also been challenged by other groups on the grounds that they are inconsistent with the data from JWST, which highlights the strong scientific debate surrounding K2-18b.Prof Madhusudhan acknowledges that there is still a scientific mountain to climb if he is to answer one of the biggest questions in science. But he believes he and his team are on the right track.\"Decades from now, we may look back at this point in time and recognise it was when the living universe came within reach,\" he said.\"This could be the tipping point, where suddenly the fundamental question of whether we're alone in the universe is one we're capable of answering.\"The research has been published in The Astrophysical Journal Letters.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0b0e/live/6fd33320-16b1-11f0-b1b3-7358f8d35a35.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eScientists have found new but tentative evidence that a faraway world orbiting another star may be home to life.\u003c/p\u003e\u003cp\u003eA Cambridge team studying the atmosphere of a planet called K2-18b has detected signs of molecules which on Earth are only produced by simple organisms.\u003c/p\u003e\u003cp\u003eThis is the second, and more promising, time chemicals associated with life have been detected in the planet\u0026#39;s atmosphere by Nasa\u0026#39;s James Webb Space Telescope (JWST).\u003c/p\u003e\u003cp\u003eBut the team and independent astronomers stress that more data is needed to confirm these results.\u003c/p\u003e\u003cp\u003eThe lead researcher, Prof Nikku Madhusudhan, told me at his lab at Cambridge University\u0026#39;s Institute of Astronomy that he hopes to obtain the clinching evidence soon.\u003c/p\u003e\u003cp\u003e\u0026#34;This is the strongest evidence yet there is possibly life out there. I can realistically say that we can confirm this signal within one to two years.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eK2-18b is two and a half times the size of Earth and is seven hundred trillion miles away from us.\u003c/p\u003e\u003cp\u003eJWST is so powerful that it can analyse the chemical composition of the planet\u0026#39;s atmosphere from the light that passes through from the small red Sun it orbits.\u003c/p\u003e\u003cp\u003eThe Cambridge group has found that the atmosphere seems to contain the chemical signature of at least one of two molecules that are associated with life: dimethyl sulphide (DMS) and dimethyl disulphide (DMDS). On Earth, these gases are produced by marine phytoplankton and bacteria.\u003c/p\u003e\u003cp\u003eProf Madhusudhan said he was surprised by how much gas was apparently detected during a single observation window.\u003c/p\u003e\u003cp\u003e\u0026#34;The amount we estimate of this gas in the atmosphere is thousands of times higher than what we have on Earth,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;So, if the association with life is real, then this planet will be teeming with life,\u0026#34; he told me.\u003c/p\u003e\u003cp\u003eProf Madhusudhan went further: \u0026#34;If we confirm that there is life on k2-18b it should basically confirm that life is very common in the galaxy\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThere are lots of \u0026#34;ifs\u0026#34; and \u0026#34;buts\u0026#34; at this stage, as Prof Madhusudhan\u0026#39;s team freely admits.\u003c/p\u003e\u003cp\u003eFirstly, this latest detection is not at the standard required to claim a discovery. \u003c/p\u003e\u003cp\u003eFor that, the researchers need to be about 99.99999% sure that their results are correct and not a fluke reading. In scientific jargon that is a five sigma result. \u003c/p\u003e\u003cp\u003eThese latest results are only three sigma, 99.7%. Which sounds a lot, but it is not enough to convince the scientific community. \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/science-environment-66786611\"\u003eBut it is much more than the one sigma result of 68% the team obtained 18 months ago,\u003c/a\u003e, which was greeted with much scepticism at the time.\u003c/p\u003e\u003cp\u003eBut even if the Cambridge team obtains a five sigma result, that won\u0026#39;t be conclusive proof that life exists on the planet, according to Prof Catherine Heymans of Edinburgh University and Scotland\u0026#39;s Astronomer Royal, who is independent of the research team.\u003c/p\u003e\u003cp\u003e\u0026#34;Even with that certainty, there is still the question of what is the origin of this gas,\u0026#34; she told BBC News.\u003c/p\u003e\u003cp\u003e\u0026#34;On Earth it is produced by microorganisms in the ocean, but even with perfect data we can\u0026#39;t say for sure that this is of a biological origin on an alien world because loads of strange things happen in in the Universe and we don\u0026#39;t know what other geological activity could be happening on this planet that might produce the molecules.\u0026#34;\u003c/p\u003e\u003cp\u003eThat view is one the Cambridge team agree with; they are working with other groups to see if DMS and DMDS can be produced by non-living means in the lab.\u003c/p\u003e\u003cp\u003eOther research groups have put forward alternative, lifeless, explanations for the data obtained from K2-18b. There is a strong scientific debate not only about whether DMS and DMDS are present but also the planet\u0026#39;s composition.\u003c/p\u003e\u003cp\u003eThe reason many researchers infer that the planet has a vast liquid ocean is the absence of the gas amonia in K2-18b\u0026#39;s atmosphere. Their theory is that the ammonia is absorbed by a vast body of water below . But it could equally be explained by an ocean of molten rock, which would preclude life, according to Prof Oliver Shorttle of Cambridge University.\u003c/p\u003e\u003cp\u003e\u0026#34;Everything we know about planets orbiting other stars comes from the tiny amounts of light that glance off their atmospheres. So it is an incredibly tenuous signal that we are having to read, not only for signs of life, but everything else.\u003c/p\u003e\u003cp\u003e\u0026#34;With K2-18b part of the scientific debate is still about the structure of the planet,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eDr Nicolas Wogan at Nasa\u0026#39;s Ames Research Center has yet another interpretation of the data. He \u003ca target=\"_blank\" href=\"https://arxiv.org/pdf/2401.11082\"\u003epublished research suggesting that K2-18b is a mini gas giant with no surface\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eBoth these alternative interpretations have also been challenged by other groups on the grounds that they are inconsistent with the data from JWST, which highlights the strong scientific debate surrounding K2-18b.\u003c/p\u003e\u003cp\u003eProf Madhusudhan acknowledges that there is still a scientific mountain to climb if he is to answer one of the biggest questions in science. But he believes he and his team are on the right track.\u003c/p\u003e\u003cp\u003e\u0026#34;Decades from now, we may look back at this point in time and recognise it was when the living universe came within reach,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;This could be the tipping point, where suddenly the fundamental question of whether we\u0026#39;re alone in the universe is one we\u0026#39;re capable of answering.\u0026#34;\u003c/p\u003e\u003cp\u003eThe research has been published in The Astrophysical Journal Letters.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-17T00:01:17.468Z",
  "modifiedTime": "2025-04-17T00:01:17.468Z"
}
