{
  "id": "d93c5243-d8d2-49fe-81d5-1ccc3ffd499f",
  "title": "Suspect in Colorado fire attack planned for a year, FBI says",
  "link": "https://www.bbc.com/news/articles/cy8ng0g4k2no",
  "description": "Officials say the suspect wanted to target Zionists and researched Molotov cocktails online.",
  "author": "",
  "published": "Mon, 02 Jun 2025 23:30:57 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Madeline Halpert",
  "length": 5745,
  "excerpt": "Officials say the suspect wanted to target Zionists and researched Molotov cocktails online.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250529-103858-de9d27ef1-web-2.22.3-1/apple-touch-icon.png",
  "text": "A man accused of throwing Molotov cocktails at demonstrators attending a march for Israeli hostages in Colorado on Sunday planned the attack for a year, investigators say.Mohammed Sabry Soliman, 45, who is charged with a federal hate crime as well as state charges of attempted murder, assault and use of an explosive device, made a brief appearance in court on Monday. Officials say the Egyptian national targeted a group of pro-Israel protesters at an outdoor mall in Boulder and shouted \"Free Palestine\" as he threw incendiary devices, injuring eight of them.At least 16 unlit Molotov cocktails were found nearby afterwards. Investigators say he targeted the group after finding them online.It is the latest attack on members of America's Jewish community.The weekly demonstration was organised by Run for Their Lives, which raises awareness about Israeli hostages still held in Gaza.Officials say Mr Soliman threw two incendiary devices into the gathering at the Pearl Street Mall, with eight of the victims suffering burns. Twelve people, including four men and four women between the ages of 52 and 88, were taken to the hospital, with injuries ranging from minor to serious.Officials previously said there were eight victims, but on Monday four more came forward with minor injuries. What we know about the attack in ColoradoThe eldest of the victims is a Holocaust survivor, Rabbi Israel Wilhelm, the Chabad director at the University of Colorado Boulder, told the BBC's US partner CBS News.The attacked happened on the beginning of the Jewish holiday of Shavuot.The suspect appeared in court on Monday via a video feed from the Boulder County Jail for less than five minutes, standing and wearing an orange jumpsuit. He answered \"yes\" to some procedural questions from the judge, but otherwise did not speak. The court scheduled a date for the formal filing of charges this Thursday.Officials said on Monday they believe he acted alone.In an interview after his arrest, Mr Soliman told police he had been planning the attack for a year, to take place after his daughter's high school graduation, according to an arrest warrant affidavit from the FBI. He told police he wanted to \"kill all Zionists\" and would carry out the attack again, the court documents stated. In addition to the unlit Molotov cocktails, backpack weed sprayer containing octane gasoline was found nearby.Mr Soliman dressed up as a gardener with an orange vest to get as close to the group of people as possible, according to police.He said he had been watching YouTube videos on how to make Molotov cocktails, according to the affidavit. Investigators say he told them he learned to shoot a gun in hope of obtaining a concealed-carry permit, but ended up using Molotov cocktails because his immigration status prevented him from accessing firearms.Mr Soliman drove from his home in Colorado Springs to Boulder, arriving five minutes before the group's meeting, according to court documents. He allegedly said he bought petrol on his way to the attack. According to the FBI, throughout the interview, Mr Soliman said he hated Zionists and targeted them because they need to stop taking over \"our land\", which he said was a reference to the Palestinian territories. Mr Soliman allegedly told officials he left his iPhone hidden in a desk drawer with messages to his family, wife and five children. His wife later brought the iPhone to officials, according to court documents. Law enforcement officials said on Monday there was no previous indication that the defendant was a threat. \"We fully intended to hold Mr Soliman accountable for his actions, and these charges are the first step,\" Acting US Attorney for the District of Colorado J Bishop Grewell told a press conference on Monday. Mr Soliman moved to Colorado Springs three years ago and previously spent 17 years living in Kuwait.In 2022, Mr Soliman arrived in California on a non-immigrant visa that expired in February 2023, multiple sources have told CBS News.Homeland security officials said he filed for asylum a month after arriving, but did not provide details about the outcome of that immigration case or whether it was resolved.President Donald Trump's deputy chief of staff for policy, Stephen Miller, said on X that Mr Soliman was given a work permit by the Biden administration after he had overstayed his visa.\"In light of yesterday's horrific attack, all terrorists, their family members, and terrorist sympathizers here on a visa should know that under the Trump administration we will find you, revoke your visa, and deport you,\" US Secretary of State Marco Rubio said on X.Mr Soliman has been working as a food delivery driver for Uber since 2023, a company spokesperson told CBS. According to the company, when he began working for them, he met all Uber requirements, including passing a criminal and driving history background check, providing a photo ID and holding a valid Social Security number.Trump said in a social media post that attacks like the one Mr Soliman allegedly carried out would not be tolerated. \"This is yet another example of why we must keep our Borders SECURE, and deport Illegal, Anti-American Radicals from our Homeland,\" he said.The Jewish community in the US has faced a series of attacks during the Israel-Gaza war, which erupted on 7 October 2023 when Hamas attacked southern Israel, triggering an Israeli military campaign that is ongoing.Last month two Israel embassy aides were shot and killed outside Washington DC's Capital Jewish Museum. Investigators said the assailant shouted \"Free Palestine\". In April, a suspect firebombed the residence of Pennsylvania Governor Josh Shapiro, who is Jewish. Officials said they were considering hate crime charges.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9631/live/8b920b70-3fda-11f0-b74d-91fa6007fac5.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eA man accused of throwing Molotov cocktails at demonstrators attending a march for Israeli hostages in Colorado on Sunday planned the attack for a year, investigators say.\u003c/p\u003e\u003cp\u003eMohammed Sabry Soliman, 45, who is charged with a federal hate crime as well as state charges of attempted murder, assault and use of an explosive device, made  a brief appearance in court on Monday. \u003c/p\u003e\u003cp\u003eOfficials say the Egyptian national targeted a group of pro-Israel protesters at an outdoor mall in Boulder and shouted \u0026#34;Free Palestine\u0026#34; as he threw incendiary devices, injuring eight of them.\u003c/p\u003e\u003cp\u003eAt least 16 unlit Molotov cocktails were found nearby afterwards. Investigators say he targeted the group after finding them online.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIt is the latest attack on members of America\u0026#39;s Jewish community.\u003c/p\u003e\u003cp\u003eThe weekly demonstration was organised by Run for Their Lives, which raises awareness about Israeli hostages still held in Gaza.\u003c/p\u003e\u003cp\u003eOfficials say Mr Soliman threw two incendiary devices into the gathering at the Pearl Street Mall, with eight of the victims suffering burns. \u003c/p\u003e\u003cp\u003eTwelve people, including four men and four women between the ages of 52 and 88, were taken to the hospital, with injuries ranging from minor to serious.\u003c/p\u003e\u003cp\u003eOfficials previously said there were eight victims, but on Monday four more came forward with minor injuries. \u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.com/news/articles/c74n3122pgpo\"\u003eWhat we know about the attack in Colorado\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe eldest of the victims is a Holocaust survivor, Rabbi Israel Wilhelm, the Chabad director at the University of Colorado Boulder, told the BBC\u0026#39;s US partner CBS News.\u003c/p\u003e\u003cp\u003eThe attacked happened on the beginning of the Jewish holiday of Shavuot.\u003c/p\u003e\u003cp\u003eThe suspect appeared in court on Monday via a video feed from the Boulder County Jail for less than five minutes, standing and wearing an orange jumpsuit. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHe answered \u0026#34;yes\u0026#34; to some procedural questions from the judge, but otherwise did not speak. The court scheduled a date for the formal filing of charges this Thursday.\u003c/p\u003e\u003cp\u003eOfficials said on Monday they believe he acted alone.\u003c/p\u003e\u003cp\u003eIn an interview after his arrest, Mr Soliman told police he had been planning the attack for a year, to take place after his daughter\u0026#39;s high school graduation, according to an arrest warrant affidavit from the FBI. \u003c/p\u003e\u003cp\u003eHe told police he wanted to \u0026#34;kill all Zionists\u0026#34; and would carry out the attack again, the court documents stated. \u003c/p\u003e\u003cp\u003eIn addition to the unlit Molotov cocktails, backpack weed sprayer containing octane gasoline was found nearby.\u003c/p\u003e\u003cp\u003eMr Soliman dressed up as a gardener with an orange vest to get as close to the group of people as possible, according to police.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHe said he had been watching YouTube videos on how to make Molotov cocktails, according to the affidavit. \u003c/p\u003e\u003cp\u003eInvestigators say he told them he learned to shoot a gun in hope of obtaining a concealed-carry permit, but ended up using Molotov cocktails because his immigration status prevented him from accessing firearms.\u003c/p\u003e\u003cp\u003eMr Soliman drove from his home in Colorado Springs to Boulder, arriving five minutes before the group\u0026#39;s meeting, according to court documents. He allegedly said he bought petrol on his way to the attack. \u003c/p\u003e\u003cp\u003eAccording to the FBI, throughout the interview, Mr Soliman said he hated Zionists and targeted them because they need to stop taking over \u0026#34;our land\u0026#34;, which he said was a reference to the Palestinian territories. \u003c/p\u003e\u003cp\u003eMr Soliman allegedly told officials he left his iPhone hidden in a desk drawer with messages to his family, wife and five children. His wife later brought the iPhone to officials, according to court documents. \u003c/p\u003e\u003cp\u003eLaw enforcement officials said on Monday there was no previous indication that the defendant was a threat. \u003c/p\u003e\u003cp\u003e\u0026#34;We fully intended to hold Mr Soliman accountable for his actions, and these charges are the first step,\u0026#34; Acting US Attorney for the District of Colorado J Bishop Grewell told a press conference on Monday. \u003c/p\u003e\u003cp\u003eMr Soliman moved to Colorado Springs three years ago and previously spent 17 years living in Kuwait.\u003c/p\u003e\u003cp\u003eIn 2022, Mr Soliman arrived in California on a non-immigrant visa that expired in February 2023, multiple sources have told CBS News.\u003c/p\u003e\u003cp\u003eHomeland security officials said he filed for asylum a month after arriving, but did not provide details about the outcome of that immigration case or whether it was resolved.\u003c/p\u003e\u003cp\u003ePresident Donald Trump\u0026#39;s deputy chief of staff for policy, Stephen Miller, said on X that Mr Soliman was given a work permit by the Biden administration after he had overstayed his visa.\u003c/p\u003e\u003cp\u003e\u0026#34;In light of yesterday\u0026#39;s horrific attack, all terrorists, their family members, and terrorist sympathizers here on a visa should know that under the Trump administration we will find you, revoke your visa, and deport you,\u0026#34; US Secretary of State Marco Rubio said on X.\u003c/p\u003e\u003cp\u003eMr Soliman has been working as a food delivery driver for Uber since 2023, a company spokesperson told CBS. \u003c/p\u003e\u003cp\u003eAccording to the company, when he began working for them, he met all Uber requirements, including passing a criminal and driving history background check, providing a photo ID and holding a valid Social Security number.\u003c/p\u003e\u003cp\u003eTrump said in a social media post that attacks like the one Mr Soliman allegedly carried out would not be tolerated. \u003c/p\u003e\u003cp\u003e\u0026#34;This is yet another example of why we must keep our Borders SECURE, and deport Illegal, Anti-American Radicals from our Homeland,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eThe Jewish community in the US has faced a series of attacks during the Israel-Gaza war, which erupted on 7 October 2023 when Hamas attacked southern Israel, triggering an Israeli military campaign that is ongoing.\u003c/p\u003e\u003cp\u003eLast month two Israel embassy aides were shot and killed outside Washington DC\u0026#39;s Capital Jewish Museum. Investigators said the assailant shouted \u0026#34;Free Palestine\u0026#34;. \u003c/p\u003e\u003cp\u003eIn April, a suspect firebombed the residence of Pennsylvania Governor Josh Shapiro, who is Jewish. Officials said they were considering hate crime charges. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-02T22:34:59.985Z",
  "modifiedTime": "2025-06-02T23:30:57.166Z"
}
