{
  "id": "df46d606-bc23-4f91-95b4-32fe3eeac7b0",
  "title": "Remember That Asteroid NASA Deflected in a Test of Saving Earth? We Have Bad News",
  "link": "https://www.yahoo.com/news/remember-asteroid-nasa-deflected-test-125701231.html",
  "description": "",
  "author": "",
  "published": "2025-07-11T12:57:01Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Victor Tangermann",
  "length": 3125,
  "excerpt": "In late 2022, NASA celebrated its Double Asteroid Redirection Test (DART) as a massive success, a proof of concept for saving humanity in case a similar...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "In late 2022, NASA celebrated its Double Asteroid Redirection Test (DART) as a massive success, a proof of concept for saving humanity in case a similar space rock were to ever head straight for Earth.The small spacecraft smashed into asteroid Didymos' moonlet Dimorphos at a violent 14,000 mph, knocking it severely off course.But three years later, astronomers found that the collision had some unintended consequences. As detailed in a paper published last week in the Planetary Science Journal, a team led by the University of Maryland found that the DART spacecraft ejected a massive barrage of boulders, some of which carried more than three times the energy of the spacecraft itself.\"We succeeded in deflecting an asteroid, moving it from its orbit,\" said lead author and UMD research scientist Tony Farnham in a statement about the research. \"Our research shows that while the direct impact of the DART spacecraft caused this change, the boulders ejected gave an additional kick that was almost as big.\"The researchers warn that much like a game of pool, smashing a spacecraft into an asteroid to save the Earth could set off a powerful sequence of events that needs to be taken into account.\"That additional factor changes the physics we need to consider when planning these types of missions,\" Farnham added.Pictures taken by a tiny spacecraft called LICIACube, developed by the Italian Space Agency and which has been hanging around the impact site to assess the aftermath, allowed astronomers to track 104 boulders, which ranged anywhere from 0.6 to 11.8 feet in radius, as they hurtled away from Dimorphos.But the researchers observed something strange about the behavior of those boulders.\"We saw that the boulders weren't scattered randomly in space,\" Farnham explained. \"Instead, they were clustered in two pretty distinct groups, with an absence of material elsewhere, which means that something unknown is at work here.\"The team hypothesizes that \"DART's solar panels likely hit two big boulders, called Atabaque and Bodhran, on the asteroid,\" as second author and UMD astronomy professor Jessica Sunshine explained, right before DART's main body made contact.DART \"hit a surface that was rocky and full of large boulders, resulting in chaotic and filamentary structures in its ejecta patterns,\" Sunshine added.Fortunately, thanks to the European Space Agency's Hera mission, which is scheduled to rendezvous with the asteroid system next year, we could soon have \"another direct view of the impact's aftermath,\" Farnham said.The astronomer and his colleagues are hoping to use the latest data to help their peers make more informed decisions when it comes to future deflection missions like DART.\"If an asteroid was tumbling toward us, and we knew we had to move it a specific amount to prevent it from hitting Earth, then all these subtleties become very, very important,\" Sunshine explained.\"You can think of it as a cosmic pool game,\" she added. \"We might miss the pocket if we don't consider all the variables.\"More on DART: Debris From When NASA Smashed Asteroid Appears to Be Headed Back Toward Earth",
  "image": "https://media.zenfs.com/en/futurism_981/ff9983e9de0f4a0e93c1d37b935c3d84",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eIn late 2022, NASA celebrated its Double Asteroid Redirection Test (DART) as a \u003ca href=\"https://futurism.com/the-byte/nasa-asteroid-deflection-successful\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:massive success;elm:context_link;itc:0;sec:content-canvas\"\u003emassive success\u003c/a\u003e, a proof of concept for saving humanity in case a similar space rock were to ever head straight for Earth.\u003c/p\u003e\u003cp\u003eThe small spacecraft smashed into asteroid Didymos\u0026#39; moonlet Dimorphos at a violent 14,000 mph, knocking it severely off course.\u003c/p\u003e\u003cp\u003eBut three years later, astronomers found that the collision had some unintended consequences. As detailed in a \u003ca href=\"https://iopscience.iop.org/article/10.3847/PSJ/addd1a\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:paper;elm:context_link;itc:0;sec:content-canvas\"\u003epaper\u003c/a\u003e published last week in the \u003cem\u003ePlanetary Science Journal\u003c/em\u003e, a team led by the University of Maryland found that the DART spacecraft ejected a massive barrage of boulders, some of which carried more than three times the energy of the spacecraft itself.\u003c/p\u003e\u003cp\u003e\u0026#34;We succeeded in deflecting an asteroid, moving it from its orbit,\u0026#34; said lead author and UMD research scientist Tony Farnham in a \u003ca href=\"https://phys.org/news/2025-07-massive-boulders-ejected-dart-mission.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:statement;elm:context_link;itc:0;sec:content-canvas\"\u003estatement\u003c/a\u003e about the research. \u0026#34;Our research shows that while the direct impact of the DART spacecraft caused this change, the boulders ejected gave an additional kick that was almost as big.\u0026#34;\u003c/p\u003e\u003cp\u003eThe researchers warn that much like a game of pool, smashing a spacecraft into an asteroid to save the Earth could set off a powerful sequence of events that needs to be taken into account.\u003c/p\u003e\u003cp\u003e\u0026#34;That additional factor changes the physics we need to consider when planning these types of missions,\u0026#34; Farnham added.\u003c/p\u003e\u003cp\u003ePictures taken by a tiny spacecraft called LICIACube, developed by the Italian Space Agency and which has been hanging around the impact site to assess the aftermath, allowed astronomers to track 104 boulders, which ranged anywhere from 0.6 to 11.8 feet in radius, as they hurtled away from Dimorphos.\u003c/p\u003e\u003cp\u003eBut the researchers observed something strange about the behavior of those boulders.\u003c/p\u003e\u003cp\u003e\u0026#34;We saw that the boulders weren\u0026#39;t scattered randomly in space,\u0026#34; Farnham explained. \u0026#34;Instead, they were clustered in two pretty distinct groups, with an absence of material elsewhere, which means that something unknown is at work here.\u0026#34;\u003c/p\u003e\u003cp\u003eThe team hypothesizes that \u0026#34;DART\u0026#39;s solar panels likely hit two big boulders, called Atabaque and Bodhran, on the asteroid,\u0026#34; as second author and UMD astronomy professor Jessica Sunshine explained, right before DART\u0026#39;s main body made contact.\u003c/p\u003e\u003cp\u003eDART \u0026#34;hit a surface that was rocky and full of large boulders, resulting in chaotic and filamentary structures in its ejecta patterns,\u0026#34; Sunshine added.\u003c/p\u003e\u003cp\u003eFortunately, thanks to the European Space Agency\u0026#39;s Hera mission, which is scheduled to rendezvous with the asteroid system \u003ca href=\"https://www.yahoo.com/news/europe-deploys-spacecraft-investigate-extraterrestrial-222013103.html\" data-ylk=\"slk:next year;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003enext year\u003c/a\u003e, we could soon have \u0026#34;another direct view of the impact\u0026#39;s aftermath,\u0026#34; Farnham said.\u003c/p\u003e\u003cp\u003eThe astronomer and his colleagues are hoping to use the latest data to help their peers make more informed decisions when it comes to future deflection missions like DART.\u003c/p\u003e\u003cp\u003e\u0026#34;If an asteroid was tumbling toward us, and we knew we had to move it a specific amount to prevent it from hitting Earth, then all these subtleties become very, very important,\u0026#34; Sunshine explained.\u003c/p\u003e\u003cp\u003e\u0026#34;You can think of it as a cosmic pool game,\u0026#34; she added. \u0026#34;We might miss the pocket if we don\u0026#39;t consider all the variables.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMore on DART:\u003c/strong\u003e \u003cem\u003e\u003ca href=\"https://www.yahoo.com/news/debris-nasa-smashed-asteroid-appears-125906151.html\" data-ylk=\"slk:Debris From When NASA Smashed Asteroid Appears to Be Headed Back Toward Earth;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eDebris From When NASA Smashed Asteroid Appears to Be Headed Back Toward Earth\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-11T12:57:01Z",
  "modifiedTime": null
}
