{
  "id": "e6ae3987-bff8-413c-a400-fc5feabc6daa",
  "title": "Trump says EU and Mexico face 30% tariff from August",
  "link": "https://www.bbc.com/news/articles/cyvj13d9ylpo",
  "description": "The US president warned both trading partners would face additional tariffs if they retaliated.",
  "author": "",
  "published": "Sun, 13 Jul 2025 00:29:55 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Jude Sheerin",
  "length": 4666,
  "excerpt": "The US president warned both trading partners would face additional tariffs if they retaliated.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/apple-touch-icon.png",
  "text": "Jude SheerinBBC News, WashingtonGetty ImagesPresident Donald Trump has announced that the European Union and Mexico will face a 30% tariff on imports to the US from 1 August.He warned he would impose even higher import taxes if either of the US trading partners decided to retaliate.The 27-member EU said earlier this week it hoped to agree a deal with Washington before 1 August.Trump has this week also said the US will impose new tariffs on goods from Japan, South Korea, Canada and Brazil, also starting from 1 August. Similar letters were sent this week to a number of smaller US trade partners. In the letter sent on Friday to European Commission President Ursula von der Leyen, Trump wrote: \"We have had years to discuss our trading relationship with the European Union, and have concluded that we must move away from these long-term-large, and persistent, trade deficits, engendered by your tariff, and non-tariff, policies and trade barriers.\"\"Our relationship has been, unfortunately, far from reciprocal,\" the letter added.In his letters to the EU and Mexico, Trump warned that if either trade partner retaliated with import duties of their own against the US, he would hit back by raising tariffs by a similar percentage over and above the 30%.Canada's Carney talked tough on Trump - now some say he's backing downThe EU has been a frequent target of Trump's criticism. On 2 April, he proposed a 20% tariff for goods from the bloc, as well as dozens of other trade partners. He then threatened to raise the EU import taxes to 50% as trade talks stalled.Washington and Brussels had hoped to reach an agreement before a deadline of 9 July, but there have been no announcements on progress.In 2024, the US trade deficit with the bloc was $235.6bn (€202bn; £174bn), according to the office of the US trade representative.Von der Leyen said the EU remained ready \"to continue working towards an agreement by Aug 1\".\"Few economies in the world match the European Union's level of openness and adherence to fair trading practices,\" her statement added.\"We will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required.\"Chip Somodevilla/Getty ImagesLast month Donald Trump met other world leaders at the G7 summit in CanadaFrance's President Emmanuel Macron said he was in \"very strong disapproval\" of Trump's announcement. If no agreement is reached, the French leader suggested the EU plan \"speeding up the preparation of credible countermeasures\".Italian Prime Minister Giorgia Meloni said in a statement she trusted \"a fair agreement\" could be reached, adding: \"It would make no sense to trigger a trade war between the two sides of the Atlantic.\" Dutch Prime Minister Dick Schoof said on social media that the EU \"must remain united and resolute\" in its aim to reach a \"mutually beneficial\" deal with the US. Germany's Association of the Automotive Industry warned about the prospect of rising costs for German carmakers and suppliers, and said it was \"regrettable that there is a threat of a further escalation of the trade conflict\".EPAMexican President Claudia Sheinbaum is still confident of reaching a deal with TrumpIn his letter to Mexico's leader, Trump said the country had not done enough to stop North America becoming a \"Narco-Trafficking Playground\".\"Mexico has been helping me secure the border, BUT, what Mexico has done, is not enough,\" Trump added.Mexican President Claudia Sheinbaum expressed confidence that a deal could be reached.\"We believe, based on what our colleagues discussed yesterday, that we will reach an agreement with the USA and that we will, of course, achieve better conditions,\" Sheinbaum said on Saturday.\"We are clear on what we can work with the USA and we are clear on what we cannot,\" she added. \"And there is something that is never negotiated, ever, and that is the sovereignty of our country\".Earlier on Saturday, the Mexican economy and foreign ministries called Trump's tariffs an \"unfair deal\" in a joint statement.Trump's letter did not say if Mexico goods traded within the 2020 United States-Mexico-Canada Agreement would be exempt from the proposed 1 August tariff hikes, as the White House said would be the case with Canada. Earlier this week, the White House sent a letter to Canada threatening a 35% tariff.As of Saturday, the Trump administration has now proposed tariff conditions on 24 countries and the EU. On 12 April, White House trade adviser Peter Navarro set a goal to secure \"90 deals in 90 days\". So far, the president has announced the outlines of two such pacts with the United Kingdom and Vietnam amid ongoing negotiations.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eJude Sheerin\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC News, Washington\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9a44/live/bf030010-5f2c-11f0-a883-a7b58f2b254f.jpg.webp\" loading=\"eager\" alt=\"Getty Images Donald Trump\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePresident Donald Trump has announced that the European Union and Mexico will face a 30% tariff on imports to the US from 1 August.\u003c/p\u003e\u003cp\u003eHe warned he would impose even higher import taxes if either of the US trading partners decided to retaliate.\u003c/p\u003e\u003cp\u003eThe 27-member EU said earlier this week it hoped to agree a deal with Washington before 1 August.\u003c/p\u003e\u003cp\u003eTrump has this week also said the US will impose new tariffs on goods from Japan, South Korea, Canada and Brazil, also starting from 1 August. Similar letters were sent this week to a number of smaller US trade partners. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn the letter sent on Friday to European Commission President Ursula von der Leyen, Trump wrote: \u0026#34;We have had years to discuss our trading relationship with the European Union, and have concluded that we must move away from these long-term-large, and persistent, trade deficits, engendered by your tariff, and non-tariff, policies and trade barriers.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Our relationship has been, unfortunately, far from reciprocal,\u0026#34; the letter added.\u003c/p\u003e\u003cp\u003eIn his letters to the EU and Mexico, Trump warned that if either trade partner retaliated with import duties of their own against the US, he would hit back by raising tariffs by a similar percentage over and above the 30%.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.com/news/articles/cvg81518yyyo\"\u003eCanada\u0026#39;s Carney talked tough on Trump - now some say he\u0026#39;s backing down\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe EU has been a frequent target of Trump\u0026#39;s criticism. On 2 April, he proposed a 20% tariff for goods from the bloc, as well as dozens of other trade partners. He then threatened to raise the EU import taxes to 50% as trade talks stalled.\u003c/p\u003e\u003cp\u003eWashington and Brussels had hoped to reach an agreement before a deadline of 9 July, but there have been no announcements on progress.\u003c/p\u003e\u003cp\u003eIn 2024, the US trade deficit with the bloc was $235.6bn (€202bn; £174bn), according to the office of the US trade representative.\u003c/p\u003e\u003cp\u003eVon der Leyen said the EU remained ready \u0026#34;to continue working towards an agreement by Aug 1\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Few economies in the world match the European Union\u0026#39;s level of openness and adherence to fair trading practices,\u0026#34; her statement added.\u003c/p\u003e\u003cp\u003e\u0026#34;We will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b173/live/fe7967e0-5f7f-11f0-b5c5-012c5796682d.jpg.webp\" loading=\"lazy\" alt=\"Chip Somodevilla/Getty Images World leaders gather at the G7 summit in Canada.  Italian Prime Minister Giorgia Meloni, French President Emmanuel Macron, Canadian Prime Minister Mark Carney, U.S. President Donald Trump, British Prime Minister Keir Starmer, German Chancellor Friedrich Merz, and European Union Commission President Ursula von der Leyen are pictured in front of mountains.\"/\u003e\u003cspan\u003eChip Somodevilla/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eLast month Donald Trump met other world leaders at the G7 summit in Canada\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFrance\u0026#39;s President Emmanuel Macron said he was in \u0026#34;very strong disapproval\u0026#34; of Trump\u0026#39;s announcement. \u003c/p\u003e\u003cp\u003eIf no agreement is reached, the French leader suggested the EU plan \u0026#34;speeding up the preparation of credible countermeasures\u0026#34;.\u003c/p\u003e\u003cp\u003eItalian Prime Minister Giorgia Meloni said in a statement she trusted \u0026#34;a fair agreement\u0026#34; could be reached, adding: \u0026#34;It would make no sense to trigger a trade war between the two sides of the Atlantic.\u0026#34; \u003c/p\u003e\u003cp\u003eDutch Prime Minister Dick Schoof said on social media that the EU \u0026#34;must remain united and resolute\u0026#34; in its aim to reach a \u0026#34;mutually beneficial\u0026#34; deal with the US. \u003c/p\u003e\u003cp\u003eGermany\u0026#39;s Association of the Automotive Industry warned about the prospect of rising costs for German carmakers and suppliers, and said it was \u0026#34;regrettable that there is a threat of a further escalation of the trade conflict\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/534c/live/8d70bcb0-5f7a-11f0-bfab-05b7e52aafec.jpg.webp\" loading=\"lazy\" alt=\"EPA Mexican President Claudia Sheinbaum speaks at a press conference at the National Palace in Mexico City\"/\u003e\u003cspan\u003eEPA\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eMexican President Claudia Sheinbaum is still confident of reaching a deal with Trump\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn his letter to Mexico\u0026#39;s leader, Trump said the country had not done enough to stop North America becoming a \u0026#34;Narco-Trafficking Playground\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Mexico has been helping me secure the border, BUT, what Mexico has done, is not enough,\u0026#34; Trump added.\u003c/p\u003e\u003cp\u003eMexican President Claudia Sheinbaum expressed confidence that a deal could be reached.\u003c/p\u003e\u003cp\u003e\u0026#34;We believe, based on what our colleagues discussed yesterday, that we will reach an agreement with the USA and that we will, of course, achieve better conditions,\u0026#34; Sheinbaum said on Saturday.\u003c/p\u003e\u003cp\u003e\u0026#34;We are clear on what we can work with the USA and we are clear on what we cannot,\u0026#34; she added. \u0026#34;And there is something that is never negotiated, ever, and that is the sovereignty of our country\u0026#34;.\u003c/p\u003e\u003cp\u003eEarlier on Saturday, the Mexican economy and foreign ministries called Trump\u0026#39;s tariffs an \u0026#34;unfair deal\u0026#34; in a joint statement.\u003c/p\u003e\u003cp\u003eTrump\u0026#39;s letter did not say if Mexico goods traded within the 2020 United States-Mexico-Canada Agreement would be exempt from the proposed 1 August tariff hikes, as the White House said would be the case with Canada. \u003c/p\u003e\u003cp\u003eEarlier this week, the White House sent a letter to Canada threatening a 35% tariff.\u003c/p\u003e\u003cp\u003eAs of Saturday, the Trump administration has now proposed tariff conditions on 24 countries and the EU. \u003c/p\u003e\u003cp\u003eOn 12 April, White House trade adviser Peter Navarro set a goal to secure \u0026#34;90 deals in 90 days\u0026#34;.  \u003c/p\u003e\u003cp\u003eSo far, the president has announced the outlines of two such pacts with the United Kingdom and Vietnam amid ongoing negotiations. \u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-12T13:16:15.989Z",
  "modifiedTime": "2025-07-13T00:29:55.582Z"
}
