{
  "id": "ee29693a-2e3b-4560-b456-4ee8ded190d4",
  "title": "Mark Zuckerberg slams Biden; says cos need more 'masculine energy'",
  "link": "https://timesofindia.indiatimes.com/world/us/mark-zuckerberg-slams-biden-says-cos-need-more-masculine-energy/articleshow/117162829.cms",
  "description": "",
  "author": "",
  "published": "2025-01-12T06:14:34+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "Bloomberg",
  "length": 1441,
  "excerpt": "Mark Zuckerberg lamented the rise of \"culturally neutered\" companies that have sought to distance themselves from \"masculine energy,\" adding that it's.",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Meta CEO Mark Zuckerberg.Mark Zuckerberg lamented the rise of \"culturally neutered\" companies that have sought to distance themselves from \"masculine energy,\" adding that it's good if a culture \"celebrates the aggression a bit more.\" \"Masculine energy I think is good, and obviously society has plenty of that, but I think that corporate culture was really trying to get away from it,\" Zuckerberg said during a nearly three-hour-long conversation with podcaster Joe Rogan published on Friday. \"It's like you want feminine energy, you want masculine energy,\" Zuckerberg said during the episode of The Joe Rogan Experience. In the interview, Zuckerberg expressed discomfort about engaging with the traditional press, adding that podcasts are helping to fuel a \"sea change in terms of who are the voices that matter.\" Zuckerberg criticised the Biden administration during the Rogan interview, claiming White House officials would \"scream\" and \"curse\" at Meta employees amid discussions about how to moderate content related to Covid-19 during the pandemic. \"It was brutal,\" Zuckerberg said, adding that the administration overstepped in its requests to take down posts about the pandemic, including satire, sowing distrust among the electorate. He previously wrote about these complaints in a letter to Congress in August. \"The US govt should be defending its companies, not be at the tip of the spear attacking its companies,\" Zuckerberg said.",
  "image": "https://static.toiimg.com/thumb/msid-117162847,width-1070,height-580,imgsize-32438,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-117162847,imgsize-32438,width-400,resizemode-4/117162847.jpg\" alt=\"Mark Zuckerberg slams Biden; says cos need more \u0026#39;masculine energy\u0026#39;\" title=\"Meta CEO Mark Zuckerberg.\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"Meta CEO Mark Zuckerberg.\"\u003eMeta CEO Mark Zuckerberg.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003e\u003ca href=\"https://timesofindia.indiatimes.com/topic/mark-zuckerberg\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eMark Zuckerberg\u003c/a\u003e lamented the rise of \u0026#34;culturally neutered\u0026#34; companies that have sought to distance themselves from \u0026#34;masculine energy,\u0026#34; adding that it\u0026#39;s good if a culture \u0026#34;celebrates the aggression a bit more.\u0026#34; \u0026#34;Masculine energy I think is good, and obviously society has plenty of that, but I think that corporate culture was really trying to get away from it,\u0026#34; Zuckerberg said during a nearly three-hour-long conversation with podcaster Joe Rogan published on Friday. \u003cbr/\u003e\u0026#34;It\u0026#39;s like you want feminine energy, you want masculine energy,\u0026#34; Zuckerberg said during the episode of The Joe Rogan Experience. \u003cbr/\u003eIn the interview, Zuckerberg expressed discomfort about engaging with the traditional press, adding that podcasts are helping to fuel a \u0026#34;sea change in terms of who are the voices that matter.\u0026#34;\u003cbr/\u003e Zuckerberg criticised the Biden administration during the Rogan interview, claiming White House officials would \u0026#34;scream\u0026#34; and \u0026#34;curse\u0026#34; at Meta employees amid discussions about how to moderate content related to Covid-19 during the pandemic. \u003c/p\u003e\u003cp\u003e\u0026#34;It was brutal,\u0026#34; Zuckerberg said, adding that the administration overstepped in its requests to take down posts about the pandemic, including satire, sowing distrust among the electorate. He previously wrote about these complaints in a letter to Congress in August. \u0026#34;The US govt should be defending its companies, not be at the tip of the spear attacking its companies,\u0026#34; Zuckerberg said. \u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-12T06:14:00+05:30",
  "modifiedTime": null
}
