{
  "id": "f2c19764-ce2e-462b-850c-fe960bb14b8f",
  "title": "US judge blocks Trump administration's effort to shut down consumer financial protection bureau",
  "link": "https://timesofindia.indiatimes.com/world/us/us-judge-blocks-trump-administrations-effort-to-shut-down-consumer-financial-protection-bureau/articleshow/119681945.cms",
  "description": "A federal judge stopped the Trump administration's effort to close the Consumer Financial Protection Bureau, preserving its function until a final verdict is reached. The court's intervention aims to prevent irreparable harm, helping maintain consumer protections established after the 2008 financial crisis.",
  "author": "TOI World Desk",
  "published": "2025-03-29T05:56:56+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 2716,
  "excerpt": "US News: A federal judge stopped the Trump administration's effort to close the Consumer Financial Protection Bureau, preserving its function until a final ver",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "US President Donald Trump (File Image)A US federal judge on Friday halted the Trump administration's attempt to dismantle the Consumer Financial Protection Bureau, marking the latest legal setback in the White House's swift push to reshape the federal government.Judge Amy Berman Jackson issued a preliminary injunction to ensure the agency's continuation until she delivers a final verdict on a lawsuit aiming to protect the agency. She stated that judicial action was necessary and essential to prevent the agency's closure.The judge determined that without judicial intervention, the Trump administration would swiftly shut down the agency established by Congress following the 2008 financial crisis, AP news agency reported.Deepak Gupta, attorney representing CFPB workers, welcomed the ruling, stating it halts the unprecedented attempt to dismantle the CFPB and maintains its crucial consumer protection work. \"We're heartened by the decision and look forward to continuing to press our case in court,\" he said in a statement. A March 10 hearing revealed the internal disruption at the agency after staff were instructed to cease work. Adam Martinez, the chief operating officer, described the agency entering \"wind-down mode\" after Trump dismissed Rohit Chopra on February 1.The interim director appointed by Trump halted all operations, terminated £100 million in contracts and dismissed 70 staff members. Martinez noted that current leadership adopted a more systematic approach compared to their initial actions when Elon Musk's Department of Government Efficiency representatives arrived.The CFPB oversees consumer protection against financial fraud and deceptive practices, handling complaints and monitoring banks to safeguard student loan borrowers.After dismissing the agency's director last month, US President Donald Trump told reporters that the agency should be abolished. On the same day DOGE workers gained access to the CFPB headquarters, Musk posted \"CFPB RIP\" on his social media platform, X. However, once the lawsuit was underway, agency officials walked back some of their earlier positions, asserting in court that they had no intention of dismantling the agency. They also instructed staff to resume certain operations, leading to confusion among employees. \"If the defendants are not restrained, they will dismantle the agency before the court has the chance to determine whether the law allows them to do so. As the defendants' own witness warned, the damage will be irreversible,\" Judge Berman Jackson wrote, as per Reuters. In a strongly worded ruling, she dismissed key evidence presented by justice department lawyers, describing some claims as \"a charade for the court's benefit.\"",
  "image": "https://static.toiimg.com/thumb/msid-119682167,width-1070,height-580,imgsize-24950,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-119682167,imgsize-24950,width-400,resizemode-4/119682167.jpg\" alt=\"US judge blocks Trump administration\u0026#39;s effort to shut down consumer financial protection bureau\" title=\"US President Donald Trump (File Image)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"US President Donald Trump (File Image)\"\u003eUS President Donald Trump (File Image)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eA US federal judge on Friday halted the Trump administration\u0026#39;s attempt to dismantle the Consumer Financial Protection Bureau, marking the latest legal setback in the White House\u0026#39;s swift push to reshape the federal government.\u003cbr/\u003eJudge Amy Berman Jackson issued a preliminary injunction to ensure the agency\u0026#39;s continuation until she delivers a final verdict on a lawsuit aiming to protect the agency. She stated that judicial action was necessary and essential to prevent the agency\u0026#39;s closure.\u003cbr/\u003eThe judge determined that without judicial intervention, the Trump administration would swiftly shut down the agency established by Congress following the 2008 financial crisis, AP news agency reported.\u003cbr/\u003eDeepak Gupta, attorney representing CFPB workers, welcomed the ruling, stating it halts the unprecedented attempt to dismantle the CFPB and maintains its crucial consumer protection work. \u0026#34;We\u0026#39;re heartened by the decision and look forward to continuing to press our case in court,\u0026#34; he said in a statement. \u003c/p\u003e\u003cp\u003eA March 10 hearing revealed the internal disruption at the agency after staff were instructed to cease work. Adam Martinez, the chief operating officer, described the agency entering \u0026#34;wind-down mode\u0026#34; after Trump dismissed Rohit Chopra on February 1.\u003cbr/\u003eThe interim director appointed by Trump halted all operations, terminated £100 million in contracts and dismissed 70 staff members. Martinez noted that current leadership adopted a more systematic approach compared to their initial actions when Elon Musk\u0026#39;s Department of Government Efficiency representatives arrived.\u003cbr/\u003eThe CFPB oversees consumer protection against financial fraud and deceptive practices, handling complaints and monitoring banks to safeguard student loan borrowers.\u003cbr/\u003eAfter dismissing the agency\u0026#39;s director last month, US President Donald Trump told reporters that the agency should be abolished. On the same day DOGE workers gained access to the CFPB headquarters, Musk posted \u0026#34;CFPB RIP\u0026#34; on his social media platform, X.\u003cbr/\u003e However, once the lawsuit was underway, agency officials walked back some of their earlier positions, asserting in court that they had no intention of dismantling the agency. They also instructed staff to resume certain operations, leading to confusion among employees.\u003cbr/\u003e \u0026#34;If the defendants are not restrained, they will dismantle the agency before the court has the chance to determine whether the law allows them to do so. As the defendants\u0026#39; own witness warned, the damage will be irreversible,\u0026#34; Judge Berman Jackson wrote, as per Reuters.\u003cbr/\u003e In a strongly worded ruling, she dismissed key evidence presented by justice department lawyers, describing some claims as \u0026#34;a charade for the court\u0026#39;s benefit.\u0026#34;\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-29T05:56:00+05:30",
  "modifiedTime": null
}
