{
  "id": "f87e92c2-6612-4695-84c1-3c87360ef4be",
  "title": "We must not turn blind eye to antisemitism, says Dutch king after attacks on Israeli football fans",
  "link": "https://www.bbc.com/news/articles/cx2y33ee1klo",
  "description": "Willem-Alexander says Jewish people must feel safe in the Netherlands after Israeli football supporters come under attack.",
  "author": "",
  "published": "Sat, 09 Nov 2024 00:49:30 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Paul Kirby",
  "length": 5977,
  "excerpt": "Willem-Alexander says Jewish people must feel safe in the Netherlands after Israeli football supporters come under attack.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Clashes in Amsterdam as Maccabi Tel Aviv play AjaxThe Dutch king says Jewish people must feel safe in the Netherlands, after violent attacks against Israeli football fans in the centre of Amsterdam.Willem-Alexander said \"our history has taught us how intimidation goes from bad to worse,\" adding that the country could not ignore \"antisemitic behaviour\".Youths on scooters had criss-crossed the Dutch capital in \"hit-and-run\" attacks on Maccabi Tel Aviv supporters who were visiting Amsterdam for a Europa League match, authorities said.Police said five people were treated in hospital and others suffered minor injuries. At least 62 people have been arrested.\"My heart goes out to the victims and to their families here and in Israel as well,\" Amsterdam's Mayor Femke Halsema told a press conference on Friday.Dutch Prime Minister Dick Schoof flew back early from a summit of EU leaders in Budapest where he said he had been following developments with horror. \"The perpetrators will be tracked down and prosecuted,\" he promised. The violence on Thursday night was condemned by leaders across Europe, the US and Israel. For many, it was especially shocking coming on the eve of commemorations marking Kristallnacht, the 1938 Nazi pogroms against German Jews.Three-quarters of Jewish people in the Netherlands were murdered during the Holocaust in World War Two.Israeli fans describe violence in AmsterdamAre you in Amsterdam? Please share your experiences here. The king alluded to that history, saying: \"Jews must feel safe in the Netherlands, everywhere and at all times. We put our arms around them and will not let them go.”US President Joe Biden said the attacks \"echo dark moments in history when Jews were persecuted\". There had already been trouble and some arrests the night before Thursday's match, involving Maccabi fans as well as pro-Palestinian protesters.Police chief Peter Holla confirmed there had been incidents \"on both sides\". Israeli supporters had removed a Palestinian flag from a wall and set it alight and attacked a taxi, although there had been no further trouble until the following night, he said.There were also reports of supporters setting off fireworks. One unverified video showed fans going down an escalator chanting anti-Arab slogans.The Palestinian Ministry of Foreign Affairs condemned \"anti-Arab chants\" and an \"attack on the Palestinian flag,\" calling on the Dutch government to \"protect Palestinians and Arabs\" living in the Netherlands.The national co-ordinator for combating antisemitism in the Netherlands said a line had been crossed and the \"readiness to commit such violence was disgusting\".EPA-EFE/REX/ShutterstockThe mayor of Amsterdam, Femke Halsema, said she was deeply ashamed of the riotsMayor Halsema said Dutch counter-terror co-ordinator NCTV had not flagged any concrete threat about the game itself as there was no animosity between the fans of the two clubs. There was no trouble at the game in which Ajax inflicted a heavy 5-0 defeat on the visiting team. But the unrest spiralled out of control soon afterwards. Halsema spoke of fans being \"attacked, abused and pelted with fireworks\" as they walked from the Johan Cruyff Arena to the centre of Amsterdam.Police initially said it was unclear who had taken part in the riots, although the mayor later spoke of young men on scooters. She was careful not to give details about the ethnic backgrounds of those involved in the attack, emphasising that it was part of the police investigation.Several videos circulated on social media, with one showing a man being kicked and beaten on the ground and another showing someone being run over. In some unverified videos, people could be heard shouting pro-Palestinian slogans.Two British visitors said they came under attack as they tried to help an Israeli beaten up by people on mopeds. Jacob, 33, told the BBC he saw \"10 people stamping and kicking\" the man, and that they had seen \"lots of little gangs chasing people\".EPA-EFE/REX/ShutterstockRiot police had to put up a security cordon around a bus carrying Israeli supportersAsked whether locals had been provoked by a Palestinian flag being torn down in the city, the mayor said what had happened in the centre of her city had nothing to do with protests about the situation in the Middle East.\"I am deeply ashamed of the behaviour that unfolded,\" Halsema told reporters. \"On Telegram [messaging] groups people talked of going to hunt down Jews. It's so terrible I can't find the words for it.\"In a statement, Telegram said it had closed a group chat on the platform which \"may have been linked to the disturbance\". The company said it did not tolerate \"calls to violence\" and would cooperate with the Dutch authorities.The mayor confirmed reports that taxi drivers had been involved in the attacks, after the head of the Netherlands' Central Jewish Committee (CJO) said they had \"moved in groups and cornered their targets\". Israeli airline El Al said it was operating free \"rescue flights\" to Amsterdam to bring passengers back to Israel. On Friday, those flights started arriving back at Israel's Ben Gurion airport, where passengers were swarmed by reporters in the arrival hall and asked to share their experiences of the violence.Israeli President Isaac Herzog spoke of a \"pogrom\" against Maccabi fans and Israeli citizens. Herzog said on X that he trusted the Dutch authorities would act immediately to \"protect, locate and rescue all Israelis and Jews under attack\".The violence in Amsterdam has raised questions about security for Israeli fans elsewhere in Europe.Israel's national security council had urged fans to avoid a basketball game in the Italian city of Bologna on Friday due to the risk of \"copycat actions\", though there were no reports of violence following the EuroLeague fixture.According to Italian media, Bologna's police chief assigned a special escort to the Israeli players for their travel to the match, which Virtus Bologna won 84-77.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/73e3/live/6d9efc70-9dfc-11ef-82c3-45a801b7330b.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eClashes in Amsterdam as Maccabi Tel Aviv play Ajax\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe Dutch king says Jewish people must feel safe in the Netherlands, after violent attacks against Israeli football fans in the centre of Amsterdam.\u003c/p\u003e\u003cp\u003eWillem-Alexander said \u0026#34;our history has taught us how intimidation goes from bad to worse,\u0026#34; adding that the country could not ignore \u0026#34;antisemitic behaviour\u0026#34;.\u003c/p\u003e\u003cp\u003eYouths on scooters had criss-crossed the Dutch capital in \u0026#34;hit-and-run\u0026#34; attacks on Maccabi Tel Aviv supporters who were visiting Amsterdam for a Europa League match, authorities said.\u003c/p\u003e\u003cp\u003ePolice said five people were treated in hospital and others suffered minor injuries. At least 62 people have been arrested.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;My heart goes out to the victims and to their families here and in Israel as well,\u0026#34; Amsterdam\u0026#39;s Mayor Femke Halsema told a press conference on Friday.\u003c/p\u003e\u003cp\u003eDutch Prime Minister Dick Schoof flew back early from a summit of EU leaders in Budapest where he said he had been following developments with horror.  \u003c/p\u003e\u003cp\u003e\u0026#34;The perpetrators will be tracked down and prosecuted,\u0026#34; he promised. \u003c/p\u003e\u003cp\u003eThe violence on Thursday night was condemned by leaders across Europe, the US and Israel. For many, it was especially shocking coming on the eve of commemorations marking Kristallnacht, the 1938 Nazi pogroms against German Jews.\u003c/p\u003e\u003cp\u003eThree-quarters of Jewish people in the Netherlands were murdered during the Holocaust in World War Two.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/ckgv4mdr9y8o\"\u003eIsraeli fans describe violence in Amsterdam\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003eAre you in Amsterdam? Please share your experiences \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/send/u190021617\"\u003ehere\u003c/a\u003e. \u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe king alluded to that history, saying: \u0026#34;Jews must feel safe in the Netherlands, everywhere and at all times. We put our arms around them and will not let them go.”\u003c/p\u003e\u003cp\u003eUS President Joe Biden said the attacks \u0026#34;echo dark moments in history when Jews were persecuted\u0026#34;. \u003c/p\u003e\u003cp\u003eThere had already been trouble and some arrests the night before Thursday\u0026#39;s match, involving Maccabi fans as well as pro-Palestinian protesters.\u003c/p\u003e\u003cp\u003ePolice chief Peter Holla confirmed there had been incidents \u0026#34;on both sides\u0026#34;. Israeli supporters had removed a Palestinian flag from a wall and set it alight and attacked a taxi, although there had been no further trouble until the following night, he said.\u003c/p\u003e\u003cp\u003eThere were also reports of supporters setting off fireworks. One unverified video showed fans going down an escalator chanting anti-Arab slogans.\u003c/p\u003e\u003cp\u003eThe Palestinian Ministry of Foreign Affairs condemned \u0026#34;anti-Arab chants\u0026#34; and an \u0026#34;attack on the Palestinian flag,\u0026#34; calling on the Dutch government to \u0026#34;protect Palestinians and Arabs\u0026#34; living in the Netherlands.\u003c/p\u003e\u003cp\u003eThe national co-ordinator for combating antisemitism in the Netherlands said a line had been crossed and the \u0026#34;readiness to commit such violence was disgusting\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9cee/live/d86f94e0-9dfe-11ef-82c3-45a801b7330b.jpg.webp\" loading=\"lazy\" alt=\"EPA-EFE/REX/Shutterstock Amsterdam Mayor Femka Halsema gives a press conference with the police chief and public prosecutor on Friday 8 November\"/\u003e\u003cspan\u003eEPA-EFE/REX/Shutterstock\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe mayor of Amsterdam, Femke Halsema, said she was deeply ashamed of the riots\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eMayor Halsema said Dutch counter-terror co-ordinator NCTV had not flagged any concrete threat about the game itself as there was no animosity between the fans of the two clubs. There was no trouble at the game in which Ajax inflicted a heavy 5-0 defeat on the visiting team. \u003c/p\u003e\u003cp\u003eBut the unrest spiralled out of control soon afterwards. \u003c/p\u003e\u003cp\u003eHalsema spoke of fans being \u0026#34;attacked, abused and pelted with fireworks\u0026#34; as they walked from the Johan Cruyff Arena to the centre of Amsterdam.\u003c/p\u003e\u003cp\u003ePolice initially said it was unclear who had taken part in the riots, although the mayor later spoke of young men on scooters. She was careful not to give details about the ethnic backgrounds of those involved in the attack, emphasising that it was part of the police investigation.\u003c/p\u003e\u003cp\u003eSeveral videos circulated on social media, with one showing a man being kicked and beaten on the ground and another showing someone being run over. In some unverified videos, people could be heard shouting pro-Palestinian slogans.\u003c/p\u003e\u003cp\u003eTwo British visitors said they came under attack as they tried to help an Israeli beaten up by people on mopeds. Jacob, 33, told the BBC he saw \u0026#34;10 people stamping and kicking\u0026#34; the man, and that they had seen \u0026#34;lots of little gangs chasing people\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a8eb/live/c3072ad0-9dab-11ef-9260-19e6a950e830.jpg.webp\" loading=\"lazy\" alt=\"EPA-EFE/REX/Shutterstock Dutch riot police in Amsterdam throw a security cordon around a bus carrying Maccabi Tel Aviv fans\"/\u003e\u003cspan\u003eEPA-EFE/REX/Shutterstock\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eRiot police had to put up a security cordon around a bus carrying Israeli supporters\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAsked whether locals had been provoked by a Palestinian flag being torn down in the city, the mayor said what had happened in the centre of her city had nothing to do with protests about the situation in the Middle East.\u003c/p\u003e\u003cp\u003e\u0026#34;I am deeply ashamed of the behaviour that unfolded,\u0026#34; Halsema told reporters. \u0026#34;On Telegram [messaging] groups people talked of going to hunt down Jews. It\u0026#39;s so terrible I can\u0026#39;t find the words for it.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a statement, Telegram said it had closed a group chat on the platform which \u0026#34;may have been linked to the disturbance\u0026#34;. The company said it did not tolerate \u0026#34;calls to violence\u0026#34; and would cooperate with the Dutch authorities.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe mayor confirmed reports that taxi drivers had been involved in the attacks, after the head of the Netherlands\u0026#39; Central Jewish Committee (CJO) said they had \u0026#34;moved in groups and cornered their targets\u0026#34;. \u003c/p\u003e\u003cp\u003eIsraeli airline El Al said it was operating free \u0026#34;rescue flights\u0026#34; to Amsterdam to bring passengers back to Israel. \u003c/p\u003e\u003cp\u003eOn Friday, those flights started arriving back at Israel\u0026#39;s Ben Gurion airport, where passengers were swarmed by reporters in the arrival hall and asked to share their experiences of the violence.\u003c/p\u003e\u003cp\u003eIsraeli President Isaac Herzog spoke of a \u0026#34;pogrom\u0026#34; against Maccabi fans and Israeli citizens. \u003c/p\u003e\u003cp\u003eHerzog said on X that he trusted the Dutch authorities would act immediately to \u0026#34;protect, locate and rescue all Israelis and Jews under attack\u0026#34;.\u003c/p\u003e\u003cp\u003eThe violence in Amsterdam has raised questions about security for Israeli fans elsewhere in Europe.\u003c/p\u003e\u003cp\u003eIsrael\u0026#39;s national security council had urged fans to avoid a basketball game in the Italian city of Bologna on Friday due to the risk of \u0026#34;copycat actions\u0026#34;, though there were no reports of violence following the EuroLeague fixture.\u003c/p\u003e\u003cp\u003eAccording to Italian media, Bologna\u0026#39;s police chief assigned a special escort to the Israeli players for their travel to the match, which Virtus Bologna won 84-77.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-08T07:00:33.386Z",
  "modifiedTime": null
}
