[
  {
    "id": "be8a55fb-54af-4f7f-9ad4-15975299a84b",
    "title": "​How a tiny village in a deserted part of Spain became a centre for gay weddings",
    "link": "https://www.theguardian.com/travel/2025/mar/18/how-a-tiny-village-in-a-deserted-part-of-spain-became-a-centre-for-gay-weddings",
    "description": "A couple of hours’ drive from Madrid, Campillo de Ranas has played a huge role in promoting same-sex marriage – and revived the fortunes of the ‘black villages’ of GuadalajaraDriving north-east out of Madrid on the A2 motorway, the industrial sprawl seemed as never-ending as the roaring river of traffic. The change, when it came, was sudden and complete. After Peñarrubia the heavy traffic vanished, and with it the industrial estates and dull dormitory towns. We were now in Guadalajara, a province of Castilla-La Mancha which, with an average of just five inhabitants per square kilometre, has been described as “the largest demographic desert in Europe”.The Spanish call places like this la España vaciada. The word for “empty” is vacío, but vaciada means “emptied”, as if there were something deliberate about the way the fabric of rural Spanish society has been worn threadbare by depopulation and underdevelopment. Continue reading...",
    "author": "Paul Richardson",
    "published": "Tue, 18 Mar 2025 07:00:01 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Spain holidays",
      "Europe holidays",
      "Gay and lesbian travel",
      "Travel"
    ]
  },
  {
    "id": "9ef8158c-7084-4178-9097-679d1512d59d",
    "title": "‘We love watching the landscape respond to each season’: why hiking long-distance trails in bite-size chunks is more fun",
    "link": "https://www.theguardian.com/travel/2025/mar/17/we-love-watching-the-landscape-respond-to-each-season-why-hiking-long-distance-trails-in-bite-size-chunks-is-more-fun",
    "description": "Tackling a long-distance walk like the Thames Path or South Downs Way in short sections makes it manageable – and more spontaneous, tooIt is 7.30am. The sky is a pink-and-gold blur, and the breeze is invigorating. It’s a perfect day to walk from my London home to the source of the River Thames. I’m travelling light – phone, sandwich, water bottle – so I need nothing but a pair of capacious pockets. I have been walking the 185-mile Thames Path National Trail, with my friend Rhiannon, for more than four years. We do it bit by bit, a section at a time. No need to carry a heavy backpack. No need to book a hotel or pitch a tent. No need to use up weeks of precious holiday. No need to fret about whether we may fall out, or whether one of us will prove more ruggedly resilient than the other; nor any of the myriad factors that must be considered when planning a long-distance hike with a companion. And yes, we’re always back in time for a night in our own beds.These are just some of the practical benefits of hiking a long-distance trail in bite-size chunks, which compensate for the extra time we spend on travelling and logistics. This morning, for example, I must catch a bus, a tube and then a train to get to the point where we finished six months previously. But by 9am I’m at Henley on-Thames, almost exactly as Rhiannon arrives from her Surrey home. We will walk for just over 12 miles, stopping anywhere we fancy – the Stanley Spencer Gallery in Cookham and a Marlow church distracted us on the last stretch – eventually reaching Tilehurst, where we’ll catch different trains home. Continue reading...",
    "author": "Annabel Abbs",
    "published": "Mon, 17 Mar 2025 07:00:40 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Walking holidays",
      "England holidays",
      "United Kingdom holidays",
      "Travel",
      "Walking",
      "Life and style"
    ]
  },
  {
    "id": "650484c1-285f-4f3f-98d0-7bf7645b7264",
    "title": "In Europe and Japan, Luxury Sleeper Trains",
    "link": "https://www.nytimes.com/2025/03/18/travel/luxury-sleeper-trains-europe-japan.html",
    "description": "From the Lake District in England to a lush island in Japan, here’s a way to travel — and sleep — in style.",
    "author": "Stephanie Rosenbloom",
    "published": "Tue, 18 Mar 2025 09:00:33 +0000",
    "image": "",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Railroads",
      "Travel and Vacations",
      "Luxury Goods and Services",
      "Venice Simplon-Orient Express",
      "Cornwall (England)",
      "England",
      "Fukuoka (Japan)",
      "Kyushu (Japan)",
      "Italy",
      "Paris (France)",
      "traintravel"
    ]
  },
  {
    "id": "37742a15-b24d-474d-9c4c-adad6273c6ea",
    "title": "What’s in Your Emergency Travel Bag?",
    "link": "https://www.nytimes.com/2025/03/18/travel/emergency-bag-essentials-pack.html",
    "description": "Whether you call it a save-the-day stash or an absolute essentials kit, it contains those five or six things that can make or break a vacation.",
    "author": "Shannon Sims",
    "published": "Tue, 18 Mar 2025 09:00:18 +0000",
    "image": "https://static01.nyt.com/images/2025/02/20/travel/00travel101-savethedaybag-illo/00travel101-savethedaybag-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Luggage and Packing",
      "Airlines and Airplanes",
      "Content Type: Service",
      "Travel and Vacations",
      "Handbags and Purses",
      "Cosmetics and Toiletries"
    ]
  },
  {
    "id": "927a47d7-c32e-47b9-951b-a1ecb521fef6",
    "title": "Dr Salter's Daydream in London, England",
    "link": "https://www.atlasobscura.com/places/dr-salters-daydream",
    "description": "This group of sculptures, collectively known as \"Dr Salter's Daydream,\" depict Dr. Alfred Salter, his wife Ada, their daughter Joyce, and their cat. Created by Diane Gorvin, the sculptures were originally unveiled in 1991 but have since moved to their current location. Dr. Alfred Salter arrived in Bermondsey in 1898, a newly qualified doctor shocked by the poverty and misfortune he encountered. Bermondsey wasn't just where Dr. Salter practiced medicine; it became his home. He and Ada, who he met through the Bermondsey Settlement, an organization offering education and social opportunities to the disadvantaged, chose to live amongst those they served. Alfred offered free medical care, a radical act at the time that drew criticism from his peers. Ada was a force in local politics, a suffragist and later Mayor of Bermondsey. As the first female mayor of a London borough, she advocated tirelessly for improved housing and green spaces. The original sculpture captured Dr. Salter in his later years, daydreaming of happier times with his young daughter Joyce. Tragically, Joyce died of scarlet fever in 1910, a victim of the very conditions her parents fought so hard to improve. This personal tragedy fueled their commitment to social reform. In 2011 the statue of Dr. Salter was stolen, and when recast, the reinstallation provided an opportunity to right a historical oversight. When the statue of Ada was added, it became the first public sculpture of a female politician in London.",
    "author": "",
    "published": "Tue, 18 Mar 2025 17:00:00 -0400",
    "image": "https://img.atlasobscura.com/QxxEV39ZcCTD815UY96qY1lMiFqXUjaDI3UYty7Vxdk/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9kODY0/ZDgzYi1mMzMwLTRh/MjgtYThkMS1kZDFh/YjIzMzMzMTM3NDFi/MGI4MTQ3MmNjMTJm/YTZfQWRhX1NhbHRl/cl9zdGF0dWVfMjAy/NC0wMS0xMC5qcGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "public art",
      "women's history",
      "history",
      "statues"
    ]
  },
  {
    "id": "d99dea79-1989-43ac-8e29-7deaf12297fd",
    "title": "Zvezda in Ljubljana, Slovenia",
    "link": "https://www.atlasobscura.com/places/zvezda",
    "description": "Some of the most extraordinary cakes in Ljubljana are found at Zvezda (which means “star”), one of a small local chain of fashionable patisseries. If the idea of Mitteleuropa makes you dream of sitting for long spells at a café decked in flowers, eating cakes, sipping coffee, thinking Great Thoughts, and possibly sketching in a notebook with your head at a rakish slant, this is the place to live out that fantasy. All of Slovenia is west of Vienna, the heart of middle Europe, so it follows that its capital has its own grand café tradition.  You can lose yourself in rows of jewel box cakes calling out to you from the vitrine here. The most traditional are Prekmurska gibanica (a filling layer cake from Prekmurje, eastern Slovenia, made of poppy seeds, apples, walnut, and sweet curd cheese), kremna rezina (a famous cake from Lake Bled, with custard and cream sandwiched between millefeuille), and strudel (that one you probably know, as it is a pan-alpine favorite, but I love their warm plum is truly special). You can also try their potica, Slovenia’s national dessert, a sort of breadier bundt cake rolled in walnuts. Their original cakes are just as worthy of attention: “chocolate dream cake” is an ultra-sophisticated Nutella mousse situation. There’s also the pear crostata or the ultra-dense, death-by-chocolate “chocolatino.” Don’t worry, your slice will be flanked with whipped cream.",
    "author": "",
    "published": "Tue, 18 Mar 2025 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/Kv852rzGJ6OgH3uWjRW1i_dNopnPvs6eISte78z5N_4/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8wNzEy/N2I3ZTk0NjQyMjNj/M2VfWnZlemRhIGNh/a2Ugc2hvcCAyLmpw/Zw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "chocolate",
      "sweets",
      "bakery",
      "cake"
    ]
  },
  {
    "id": "2534cda8-79d8-4789-a5a3-a93131c463d3",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "1e0932a2-53f3-4b90-bae3-72e8b22a7441",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "48b1f012-422d-4bb1-a976-559bb476494c",
    "title": "Everyone Says I’m Running Away",
    "link": "https://www.nomadicmatt.com/travel-blogs/everyone-say-im-running-away/",
    "description": "I’m not sure why, but there is this perception out there that anyone who travels long-term and isn’t interested in settling down or getting a conventional job must be running away from something. In this post, I explain what I'm running away from... The post Everyone Says I’m Running Away appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 18 Mar 2025 08:00:08 +0000",
    "image": "https://media.nomadicmatt.com/2025/runningaway.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings",
      "backpacking",
      "fear",
      "long term travel",
      "travel inspiration"
    ]
  },
  {
    "id": "3413b07b-cc97-431f-bc6b-cbc9acf192fe",
    "title": "What I Pack for My Travels: Your Guide to Packing",
    "link": "https://www.nomadicmatt.com/travel-blogs/packing/",
    "description": "Over the years, what I carry in my bag has changed a lot. Most of that change has to do with the fact that I now carry a lot of gear related to blogging, but it also reflects the fact that I’ve learned a lot about packing since I first hit the road in 2006. And trust me, there is a lot to learn! The post What I Pack for My Travels: Your Guide to Packing appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 17 Mar 2025 11:00:39 +0000",
    "image": "https://media.nomadicmatt.com/altpackingmatt_001.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "backpacking",
      "gear",
      "packing"
    ]
  }
]
