[
  {
    "id": "6abd71ef-cb85-4db2-a30c-7d0451fbd567",
    "title": "‘The river that runs in the sky’: readers choose their wonders of the world",
    "link": "https://www.theguardian.com/travel/2025/jan/17/the-river-that-runs-in-the-sky-readers-choose-their-wonders-of-the-world",
    "description": "From Margate to Uzbekistan our tipsters reveal the special sites that made a lasting impression on themThomas Telford’s Pontcysyllte Aqueduct is the centrepiece of a world heritage site that crosses three counties and two countries. They call it “the river that runs in the sky”, and there is a rough magic to standing halfway across, looking down on the tumbling River Dee, source of the slow-moving flow at your heels, water Telford drew from Horseshoe Falls for his impossible project. Rather than a chain of locks cut across the valley, his iron trough spans it, joints sealed with red Welsh flannel dipped in boiling sugar. Opened in 1805, it is the highest, longest aqueduct in Britain.…Fiona Collins Continue reading...",
    "author": "Guardian readers",
    "published": "Fri, 17 Jan 2025 07:00:22 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Travel",
      "Adventure travel",
      "Top 10s"
    ]
  },
  {
    "id": "aace32dd-a28d-4c0b-907f-4d97911d4984",
    "title": "An arty stay in cider land: a brush with the Somerset countryside",
    "link": "https://www.theguardian.com/travel/2025/jan/16/art-painting-holiday-somerset-countryside-cabin",
    "description": "A cosy cabin offers not just a place to stay but a chance to learn from local artists and discover the gentle, rolling landscape and its farm produceFrost tints the landscape silver as we set up our easels in the watery morning sunlight. On the horizon is Burrow Hill, a gentle surge in the pancake-flat Somerset scene. Local artist Frances Watts talks me through how to mix colour palettes and then, with her help, I attempt to capture some of the wintry magic in oils.I’d come to Kingsbury Episcopi, 20 minutes west of Yeovil, to stay in the new Craftsman’s Cabin, set in its own meadow on the edge of the Somerset Levels and Moors. Built by hand, the interior brims with work by artists from the area – some of Frances’ paintings hang on the walls. Those who stay can arrange an outdoor painting session, connecting more deeply with the pretty countryside and taking a keepsake home. Continue reading...",
    "author": "Jane Dunford",
    "published": "Thu, 16 Jan 2025 07:00:02 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Somerset holidays",
      "Learning holidays",
      "England holidays",
      "Travel",
      "Short breaks"
    ]
  },
  {
    "id": "c0a99e53-5057-45e2-97aa-0b41410c4216",
    "title": "Concord’s Colonial Inn in Concord, Massachusetts",
    "link": "https://www.atlasobscura.com/places/concords-colonial-inn",
    "description": "Within the town of Concord, Massachusetts, history is everywhere. Whether it be sites related to literary icons or the famed battles, it seems like almost every street corner has a story to tell. That includes the Colonial Inn, a renowned establishment once owned by Henry David Thoreau’s family, and, according to some, haunted by guests of centuries past. The Colonial Inn today is comprised of three historic homes that were combined together in 1897. The original structure was built in 1716 by James Minot, and his family later sold it to John Thoreau, the maternal grandfather of Henry David Thoreau, in 1799. The property remained in the Thoreau family for many years, and it’s where the famed writer and poet resided while he attended Harvard. It later came to be known as the Thoreau House and was purchased at auction by John Maynard Keyes, who combined it with two other homes to form its current structure. Perhaps the most iconic aspect of the Colonial Inn’s history is the role it played during the very first battles of the American Revolution in 1775. The central section of the main building was used as a storehouse for arms and ammunition for the Concord Minutemen. However, when the smoke cleared and the guns fell silent, the Colonial Inn found itself at the center of a much more gruesome spectacle. Many injured soldiers required medical care, and the local doctor, Timothy Minot Jr., grandson of the original builder, had them taken to the inn. Dr. Minot converted one room into a makeshift operating room, and given the limited understanding of battlefield medicine at the time, many died. Another room was converted into a morgue. Some guests of the inn have since reported that these rooms, in particular, possess a creepy, unsettling atmosphere. The first documented record of paranormal activity occurred in 1966, when Mrs. Judith Fellenz wrote to innkeeper after she celebrated her wedding night with her husband. Fellenz recalled how she was awoken in the middle of the night seeing a grayish figure at the side of her bed, which stood still for a moment, then slowly floated to the foot of the bed in front of the fireplace. Strange activity isn’t limited to these two rooms, however; both visitors and staff have reported seeing various apparitions on the premises, including an older woman and a slim man sitting in the Liberty Room, which some theorize might be Thoreau and his aunt keeping the area company. Another reported phenomenon are items mysteriously vanishing, only to reappear sometime later in unusual and strange locations. Whether you are a history enthusiast, a fan of Thoreau, or have in interest in the supernatural, Concord’s Colonial Inn is certainly worth a visit.",
    "author": "",
    "published": "Fri, 17 Jan 2025 15:00:00 -0500",
    "image": "https://img.atlasobscura.com/75cXEFziNodbeoFDHKbqLlJdL4EHxOdV0M1Fpa8T2qo/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy81NWMz/ZjAzMS00OWMwLTQy/NzEtODUzOS00YWJh/MTkwNjQyN2YwM2Zj/ZTQ5MGQ1MDk4NzYy/NjFfMzkxNTkwNDI3/XzEwMTU4MTAzNjA3/MDk5NTY3XzUzNjY4/NjEyMjYzMjg2MzEz/MzRfbi5qcGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "american revolution",
      "haunted",
      "hotels"
    ]
  },
  {
    "id": "f0e44483-fa30-497e-950c-411da10151b6",
    "title": "Eriksbergskranen in Gothenburg, Sweden",
    "link": "https://www.atlasobscura.com/places/eriksbergskranen",
    "description": "Gothenburg has functioned as one of Sweden’s primary ports and industrial centers for centuries. In recent decades, however, some companies that were originally located closer to the city center have closed or moved, and the areas have been redeveloped, sometimes incorporating the older industrial buildings and other structures into the newly developed neighborhoods. One of the most notable examples of this is Eriksbergskranen (or Eriksbergs Crane), a giant gantry crane that looms over a neighborhood on the north side of the Göta river, downstream from the city center. The modern-day neighborhood of Eriksberg was originally the site of a shipbuilding company named Eriksbergs Mekaniska Verkstads, which was established in 1850. This company grew to become one of the largest shipbuilding companies in Sweden. Despite increased international competition in the 1960s, the company invested in obtaining an 80-meter-tall gantry crane, which was erected at the site in 1969. However, Eriksbergs Mekaniska Verkstads would continue to have difficulty staying competitive with shipbuilders in other countries, and in 1979, the company would close down. Although many of the shipbuilding company’s buildings and other structures were dismantled or demolished, Eriksbergskranen remained in place. For a while, the crane was used as a viewing platform and a bungee jumping location. Eventually, the area was redeveloped as a residential neighborhood, and the dock underneath the crane was converted into a marina. The gantry crane itself was given legal protection in 2012, and it is now regarded as the key defining landmark of the neighborhood that has grown around it as well as the largest of the gantry cranes left from Sweden’s shipbuilding past.",
    "author": "",
    "published": "Fri, 17 Jan 2025 14:00:00 -0500",
    "image": "https://img.atlasobscura.com/qS-Eh38jSh8vOkz5cr-xAw5QEajFMq-sMjX0PgeoHew/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy83NTc1/MmUwNC1jNDhkLTRi/OGEtOTUzMS1hMGU3/ZTE0NDE0MmE0MWUx/NDk2ODAxZDg1OTAz/NzFfY3JhbmUyLmpw/Zw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "construction",
      "machines"
    ]
  },
  {
    "id": "a62a7a9e-96d2-4155-bbc3-2ba48a40209a",
    "title": "American Airlines Accused of Discrimination by Interracial Couple",
    "link": "https://www.nytimes.com/2025/01/17/travel/american-airlines-discrimination.html",
    "description": "In a lawsuit, two newlyweds say they were detained after a passenger and airline employees wrongly suspected the Black husband of trafficking his white wife.",
    "author": "Christine Chung",
    "published": "Fri, 17 Jan 2025 23:23:34 +0000",
    "image": "https://static01.nyt.com/images/2025/01/17/multimedia/17travel-american1-vqzl/17travel-american1-vqzl-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "American Airlines",
      "Discrimination",
      "Race and Ethnicity",
      "Airlines and Airplanes",
      "Suits and Litigation (Civil)"
    ]
  },
  {
    "id": "1b547c74-7f8d-49bf-9ef4-e706ede87c59",
    "title": "5 Intimacy Retreats to Improve Your Sex Life",
    "link": "https://www.nytimes.com/2025/01/16/travel/intimacy-retreats-sexual-wellness.html",
    "description": "At these retreats in places like Costa Rica, California and the Berkshires, you’ll learn how to express your desires, enhance intimacy and build self-confidence.",
    "author": "Caren Osten Gerszberg",
    "published": "Thu, 16 Jan 2025 10:00:28 +0000",
    "image": "https://static01.nyt.com/images/2025/01/16/travel/16sexual-wellness-illo/16sexual-wellness-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Content Type: Service",
      "Travel and Vacations",
      "Sex",
      "Yoga",
      "Therapy and Rehabilitation",
      "Dating and Relationships",
      "Spas",
      "Hotels and Travel Lodgings",
      "Blue Spirit (Nosara, Costa Rica, Hotel)",
      "Costa Rica",
      "Esalen Institute",
      "Big Sur (Calif)",
      "Kripalu Center for Yoga \u0026 Health (Stockbridge, Mass)",
      "Stockbridge (Mass)",
      "Back to the Body LLC",
      "Joshua Tree (Calif)",
      "Spain",
      "Yucatan Peninsula (Mexico)",
      "SHA Wellness SAU",
      "Miraval Resort \u0026 Spa (Tucson, Ariz, Hotel)",
      "Tucson (Ariz)"
    ]
  },
  {
    "id": "d461766b-e401-4d90-a426-472daa484d2c",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "3ff15a7a-1ea1-4601-9190-2b7d0ec89870",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "8b17a764-bc73-4107-bb2c-3a036d837d5b",
    "title": "SafetyWing Travel Insurance: Which Plan Is Right For You?",
    "link": "https://www.nomadicmatt.com/travel-blogs/safetywing-insurance/",
    "description": "Whether you’re traveling to Europe for two weeks or planning an epic round-the-world adventure, you need travel insurance. Seriously. I know, it’s not a fun topic to read about. And yes, it will add to your travel budget. But after almost two decades on the road, I’ve learned the hard way just how important travel... The post SafetyWing Travel Insurance: Which Plan Is Right For You? appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 15 Jan 2025 08:05:37 +0000",
    "image": "https://media.nomadicmatt.com/2025/safetywingreview1.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "safetywing",
      "travel insurance"
    ]
  },
  {
    "id": "e43af14a-2901-4b01-a64e-8decbce40241",
    "title": "Announcement: I’m Releasing a New Book!",
    "link": "https://www.nomadicmatt.com/travel-blogs/httw-pre-sale/",
    "description": "Big news! I am releasing a new book! It’s a massively updated version of my NYT bestselling travel guide, How to Travel the World on $50 a Day. Except this new edition is called How to Travel the World on $75 a Day. Why the new edition? Well, because of inflation…and the changed way we... The post Announcement: I’m Releasing a New Book! appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 14 Jan 2025 12:57:14 +0000",
    "image": "https://media.nomadicmatt.com/2025/httwlaunch3.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Advice",
      "budget travel",
      "travel planning"
    ]
  }
]
