[
  {
    "id": "42fc4818-8562-4410-8a00-5fef0b889139",
    "title": "How a dawn chorus break in Gloucestershire opened my ears to the birds",
    "link": "https://www.theguardian.com/travel/2025/may/22/gloucestershire-birdwatching-slimbridge-partially-sighted",
    "description": "I’m partially sighted so birding has always felt out of reach for me. But a stay at Slimbridge wetlands centre learning to identify bird song helped me connect with natureSilhouettes dart across a lake and the pale morning sky. Avocets screech high-pitched cries, defending their eggs from a squawking crow that circles above, while a barnacle goose with a barking call flies overhead.There are 12 of us watching and listening on a dawn chorus workshop at the Wildfowl and Wetlands Trust (WWT) Slimbridge centre in Gloucestershire. Being partially sighted, birding has felt out of reach for me. But this morning is about identifying birdsong, and I’m curious as to whether this will help me feel a deeper connection with nature. Continue reading...",
    "author": "Caroline Butterwick",
    "published": "Thu, 22 May 2025 06:00:50 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Gloucestershire holidays",
      "Wildlife holidays",
      "Cotswolds holidays",
      "United Kingdom holidays",
      "England holidays",
      "Travel"
    ]
  },
  {
    "id": "93ed4d64-c610-4075-a288-b6371e098cc1",
    "title": "An alternative Tuscany in northern Italy: fairytale hills and terracotta villages in Lombardy’s Oltrepò Pavese",
    "link": "https://www.theguardian.com/travel/2025/may/21/alternative-tuscany-italy-lombardy-oltrepo-pavese",
    "description": "Rising from the Po valley to the green Apennines, this little-visited region has good living down to a tee, with its fine wines, great food and historic villages‘Look at the colour,” says tasting expert Carlo Veronese, sitting at a restaurant table in the village of Bosmenso. “Check how flexible it is, then give it a sniff and think about what you smell.” Only after we have given proper attention to appearance, structure and aroma do we taste the speciality before us.We are not trying fine wines, however, but what many say is the world’s best salami: salame di Varzi, made in 15 villages around the town of the same name in south-east Lombardy. Continue reading...",
    "author": "Liz Boulter",
    "published": "Wed, 21 May 2025 06:00:19 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Italy holidays",
      "Genoa holidays",
      "Milan holidays",
      "Europe holidays",
      "Travel"
    ]
  },
  {
    "id": "f22a1516-80b3-4e75-af30-7d38dc36047c",
    "title": "Bell Mountain in Hiawassee, Georgia",
    "link": "https://www.atlasobscura.com/places/bell-mountain",
    "description": "If you climb the steep grade to the 3,424 foot knob, you’ll be rewarded with a beautiful view of Lake Chatuge below and mountains in the distance. But first, cresting the top of the hill, you’ll be met with a lot of graffiti. The top of the knob has two rocky peaks. You might think this is a natural wonder, but you’d be wrong: In 1963, men from a nearby North Carolina town thought they could mine the top of the mountain for minerals. They ripped the top of the peak apart, but were fruitless. The top of Bell Mountain is what was left. It now erodes into the nearby Lake Chatuge. After the mining failure, Bell Mountain was purchased by a local man named Hal Herrin, who sought to protect it from further abuse. The mountain has been a favorite for local hikers. It was also a great place to off-road. Deep ruts were carved into what was a gravel and dirt road as off-roaders made their way to the top. After Hal passed, his estate gifted the Bell Mountain land to Towns County. In 2016, Bell Mountain became a park and historical site, the road was graded and paved, and the observation decks were installed. According to a plaque at the site, a newspaper editor visited in 1883 and described Bell Mountain, saying, “As we reached the summit the greatest sight that he moral eye ever rested upon met our gaze, it is impossible for the pen to do justice to this scene, for several famous tourists who have visited this mountain pronounce it the ‘grandest view in America.’” The vandalism at the top is at odds with the beautiful 360-degree views, demonstrating how this natural place has been at war with humans throughout its existence.",
    "author": "",
    "published": "Thu, 22 May 2025 17:00:00 -0400",
    "image": "https://img.atlasobscura.com/C-pX7balrN96--77Voy-nqBhA2l0guWTj9p5JPkS0ks/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9hZjI0/OTQ2YS0xMTMyLTQz/YzQtYTU3Yi00ZDEw/NDRiOGVhZWYzOWI1/Y2QxZmZlZTk1ZDU0/YzhfSU1HXzMyMjMu/anBn.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "graffiti",
      "mountains"
    ]
  },
  {
    "id": "26110366-e65c-477a-8287-864c49917e6f",
    "title": "Temple of Augustus in Ankara, Turkey",
    "link": "https://www.atlasobscura.com/places/augustus-temple-turkey",
    "description": "Ankara does not typically top the itinerary of those visiting Turkey either for its sandy beaches or for the historical sites of its bustling megacity, Istanbul. The relatively unknown capital often serves as a mere transit point for those traveling to or from the nearby Fairy Chimneys of Cappadocia. It could therefore come as surprise to many that the city had once been a bustling Roman metropolis in Asia Minor. Verifiable settlement history of Ankara dates back to the time of the Phrygian Kingdom, which had ruled over much of Western Anatolia before the Persian conquests in the 7th Century BC. The Hellenistic Period ensuing upon Alexander’s excursions against the Persians had seen the arrival and settlement of an ancient Celtic-speaking people by the name of Galatians who would soon establish their own political rule in the area. It was after the integration of the territories of the Galatian Kingdom into the expanding Roman Empire that Ankara (then known as Ancyra) would steadily evolve into a bustling provincial center of Roman rule in Asia Minor. A temple would be inaugurated at the heart of the city to honor Emperor Augustus, and it would be through an inscription on this temple that a 16th Century Flemish ambassador of the Holy Roman Emperor to the Ottomans had been able to transcribe the full autobiographical text of Res Gestae Divi Augusti (The Deeds of the Divine Augustus) and take it back to Europe. The temple’s ruins now stand in the middle of one of the country’s holiest Muslim sites dedicated to an influential 15th Century Anatolian Sufi mystic and saint by the name of Hacı Bayram-ı Veli, whose tomb and mosque just adjacent to the temple attract thousands of devout Muslims.",
    "author": "",
    "published": "Thu, 22 May 2025 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/NCkYnSY622QNILySeu0Zm42EBMmZFAf6H2kzLtLtwIQ/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy80NTIz/ODZlNy03MGQ5LTQ1/ODQtYWUxMi1jMjA1/ZDRjYTMzOWM0MThi/NjA4NzRmZDZjMTQ4/ZGJfSU1HXzExNTEu/SlBH.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "temples"
    ]
  },
  {
    "id": "01bc50d6-caee-4b6f-bebd-d20d92facd29",
    "title": "The Enduring Appeal of the American Drive-In",
    "link": "https://www.nytimes.com/2025/05/22/travel/drive-in-theaters-america.html",
    "description": "Has anything really changed at drive-in theaters across the country? A photographer based in Bozeman, Mont., visited a few to find out.",
    "author": "Janie Osborne",
    "published": "Thu, 22 May 2025 09:01:46 +0000",
    "image": "https://static01.nyt.com/images/2025/05/22/multimedia/22travel-drive-ins-silver-02-pbtm/22travel-drive-ins-silver-02-pbtm-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Drive-in Theaters",
      "Travel and Vacations",
      "Family Business",
      "United Drive-In Theatre Owners Assn",
      "Butte (Mont)",
      "Idaho Falls (Idaho)",
      "Wyoming"
    ]
  },
  {
    "id": "2222f756-a2e4-4b11-8720-930d9f6b996e",
    "title": "Aix-en-Provence Celebrates Cézanne With Monthslong Series of Events",
    "link": "https://www.nytimes.com/2025/05/21/travel/france-cezanne-aix-en-provence-celebration.html",
    "description": "Aix-en-Provence, the French city where the artist spent most of his life, is celebrating all things Cézanne this summer with the reopening of his estate and studio.",
    "author": "Alexis Steinman and Gabrielle Voinot",
    "published": "Wed, 21 May 2025 09:01:31 +0000",
    "image": "https://static01.nyt.com/images/2025/05/21/multimedia/21trav-aix-cezanne-kzlf/21trav-aix-cezanne-kzlf-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Art",
      "Museums",
      "Travel and Vacations",
      "Musee Granet",
      "Cezanne, Paul",
      "Aix-en-Provence (France)"
    ]
  },
  {
    "id": "2c00d105-79c1-4057-9e6b-d205574bdb23",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "3d75d00b-0d29-4401-8ab5-a78ec64b7b80",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "c539ac4e-79f1-467c-92d1-354172b00dba",
    "title": "The Business Platinum Card® from American Express Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/business-platinum-card-review/",
    "description": "Advertiser Disclosure Terms apply to American Express benefits and offers. Enrollment may be required for select American Express benefits and offers. Visit americanexpress.com to learn more. Over the past nineteen years as a business owner, I’ve used countless business cards. Some have been amazing and elevated both my travel and my business. Others have been…well,... The post The Business Platinum Card® from American Express Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 20 May 2025 13:36:41 +0000",
    "image": "https://media.nomadicmatt.com/2025/amexplatbiz.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Points \u0026 Miles"
    ]
  },
  {
    "id": "1df41e26-51fa-46f5-9847-bde8234dadf3",
    "title": "How to Travel on a Budget",
    "link": "https://www.nomadicmatt.com/travel-blogs/how-to-travel-on-a-budget/",
    "description": "Travel has become really expensive. Post-COVID, the entire world seems to be traveling again and prices just keep rising. I am astonished at how high they have gotten. But it’s a product of rising costs and out-of-control demand. Everyone just wants to travel. We’re all looking for an escape. Fortunately, it’s not all bad. Airfare... The post How to Travel on a Budget appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 19 May 2025 12:00:16 +0000",
    "image": "https://media.nomadicmatt.com/2025/budgettravelmatt1.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Tips",
      "budget travel"
    ]
  }
]
