[
  {
    "id": "3b206362-1235-4a82-a299-4493b1a22941",
    "title": "Spring in Ibiza: enjoy a mellow Balearic beat before the crowds arrive",
    "link": "https://www.theguardian.com/travel/2025/mar/01/spring-in-ibiza-enjoy-a-mellow-balearic-beat-before-the-crowds-arrive",
    "description": "Out of season, the island is more about natural charms than techno, but the sun still shines and the resident community keeps its unique spirit aliveIbiza in the off-season. The big resort hotels are shuttered, the beach bars sealed up, the superclubs powered down until their showy reopening parties get the summer started again in late April. By July, the ratio will be back to 20 visitors to every one resident, but for now the island is as empty as it gets.The sun is shining though, the air bright and warm, the sky a salted Balearic blue. And crowds still gather, here and there. At the Trotting Races, for example, in the Sant Rafael hippodrome in the centre of the island. A peculiar island tradition that supposedly began with charioteers during Ibiza’s Roman occupation, the sport requires jockeys to ride on little wheeled carts harnessed to horses that keep a briskish, semi-hurried pace, as if slightly late for an appointment. Kids and old boys seem to love it, the latter laying small bets on the races and dropping shots of brandy in their coffee. My horse, Maldiva des Puig, comes a distant third. Continue reading...",
    "author": "Stephen Phelan",
    "published": "Sat, 01 Mar 2025 07:00:33 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Ibiza holidays",
      "Europe holidays",
      "Spain holidays",
      "Travel",
      "Balearic Islands holidays"
    ]
  },
  {
    "id": "5a59bf65-12a7-4a01-a41f-fc5915f1bdfd",
    "title": "From wildlife in Andalucía to an alternative camino in Galicia: readers’ travel tips on unsung Spain",
    "link": "https://www.theguardian.com/travel/2025/feb/28/readers-travel-tips-quiet-side-of-spain",
    "description": "Our tipsters share their favourite seafood haunts, pristine beaches and under-the-radar citiesThe city and the province of Jaén can be overlooked by tourists heading to nearby Granada or Córdoba. That’s a shame, given that they are filled with Renaissance architecture, including a magnificent cathedral, and renowned as one of the homes of olive oil. Thanks to its historic position between Christian Castilla and Muslim Granada, the city is surrounded by castles. I recommend staying at the Parador de Jaén. It sits at the top of the hill of Santa Catalina next to the castle, and the views from its rooms towards the Sierra Morena mountains are unparalleled. Felix Continue reading...",
    "author": "Guardian readers",
    "published": "Fri, 28 Feb 2025 07:00:51 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Spain holidays",
      "Top 10s",
      "Europe holidays",
      "Travel"
    ]
  },
  {
    "id": "f6ac57a6-0c6e-4fb1-9b27-38a62b8be715",
    "title": "Travel Rewards Programs Now: Too Many Points, Not Enough Seats",
    "link": "https://www.nytimes.com/2025/02/28/travel/rewards-points-miles.html",
    "description": "As rewards programs proliferate and shift to spending rather than miles flown, it has become harder to earn awards. We explain why, and help you plan a strategy to maximize your rewards.",
    "author": "Ryan Craggs",
    "published": "Fri, 28 Feb 2025 10:01:45 +0000",
    "image": "https://static01.nyt.com/images/2025/02/28/travel/28points-update-illo/28points-update-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Airlines and Airplanes",
      "Content Type: Service",
      "Frequent Flier Programs",
      "Credit Cards",
      "Travel and Vacations"
    ]
  },
  {
    "id": "50525e35-fef7-4111-be39-1d1371a4a290",
    "title": "Canada Urges Its Travelers to Stay Home as Trade War With U.S. Continues",
    "link": "https://www.nytimes.com/2025/02/27/travel/canada-tariffs-us-tourism.html",
    "description": "Last year, Canadians visiting the United States were responsible for $20.5 billion in spending. Some are now changing their travel plans as the neighboring nations battle over trade.",
    "author": "Claire Fahy",
    "published": "Thu, 27 Feb 2025 21:42:44 +0000",
    "image": "https://static01.nyt.com/images/2025/02/27/multimedia/27canada-us-tourism-zhcw/27canada-us-tourism-zhcw-mediumSquareAt3X-v2.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "United States Politics and Government",
      "Travel and Vacations",
      "Canada",
      "International Trade and World Market",
      "Airlines and Airplanes",
      "North Dakota",
      "Trudeau, Justin",
      "Trump, Donald J",
      "Air Canada",
      "United States Travel Assn",
      "Protectionism (Trade)",
      "United States International Relations"
    ]
  },
  {
    "id": "f860f74b-62d9-46d3-9623-c92c2554b949",
    "title": "Fontana della Terrina in Roma, Italy",
    "link": "https://www.atlasobscura.com/places/fontana-della-terrina",
    "description": "In Rome's Piazza Chiesa Nuova, near the Chiesa di Santa Maria in Vallicella, sits an unassuming fountain with an unexpected past. The Fontana della Terrina was sculpted by Giacomo della Porta, a student of Michelangelo and a man whose resume would be the envy of most renaissance artists of the era. His talents extended beyond masonry—he was entrusted with the technical execution of several domes and fountains throughout Rome, including completing the dome of St. Peter’s Basilica after Michelangelo’s death. But if Porta were to stroll through Rome today, not only would he fail to recognize his own fountain—he probably wouldn’t even find it. Originally, the Fontana della Terrina stood proudly in the bustling Campo de' Fiori marketplace, where it had an open, airy design and no lid to speak of. It was fed by the Acqua Vergine aqueduct, and water gently bubbled over four bronze dolphins, which were originally intended for the Turtle Fountain (Fontana delle Tartarughe) in nearby Piazza Mattei. Unfortunately, what started as an elegant public water feature quickly devolved into a soggy health hazard. Vendors at the market used it to wash fruits, vegetables, and meat, while animals drank from it and passersby found... other creative ways to pollute it. Within 50 years, the once-charming fountain had become less of a picturesque landmark and more of a medieval petri dish. Pope Gregory XV was bothered by the grimy mess and decided Rome deserved better. He ordered a cover for the fountain—transforming it into a giant stone soup tureen. Who actually designed the lid remains a mystery and the dolphins were removed and vanished. In 1889, the fountain was removed by the city to install a bronze statue of Giordano Bruno, the philosopher and scientist who was burned alive in Campo di Fiori in 1600 after being declared a heretic by the Pope Clemente VIII. The statue remains there today, standing as a solemn reminder of the importance of free thought—while the fountain itself was unceremoniously shuffled off to storage, where it gathered dust for decades. In 1924, city workers stumbled upon the forgotten tureen in storage and put it in its current location, slightly sunken below street level near a city bus stop. These days, most people pass by the fountain without giving it a second glance. But if they do stop to look, they’ll find the faded remnants of a single inscription around the top left by the mysterious lid-maker: \"Love God and do not fail, do good and let it be said. MDCXXII.\"",
    "author": "",
    "published": "Fri, 28 Feb 2025 17:00:00 -0500",
    "image": "https://img.atlasobscura.com/AugsNSVe6E1eD27NR8UmQyn81QtbBm-oNQh5XYG96jU/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy80NWZi/YjUwNy1lNTM4LTRm/Y2UtYmNjYS0zMTZj/MmRhZDRlYjY0NWVh/NWZlZGQxNzM1NWNm/YzVfMl9JTUdfMDEw/OS5naWY.gif",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "fountains"
    ]
  },
  {
    "id": "b4ca2d64-aa9b-4e80-a7c4-a57fed69dff2",
    "title": "Deir el-Medina in Luxor, Egypt",
    "link": "https://www.atlasobscura.com/places/deir-el-medina",
    "description": "The lesser-known historical site of Deir el-Medina. or Valley of the Artisans, in Egypt is a gateway beyond the high tombs, royal palaces, temples, and ancient homes of the elite. In ancient times, this village was home to skilled workers, primarily the painters and sculptors responsible for the tombs in the Valley of the Kings and Valley of the Queens. These people gave their lives to the very writing intended to converse with the Gods, meticulously designed to keep maat (an ancient Egyptian concept meaning order and harmony). Outside these tombs isfet (chaos) reigned.  In ancient Egypt, only a small percentage of the population could read or write. Literacy was a privilege of the scribes, who were trained in hieroglyphs and hieratic. Due to the special requirements of the tombs, Deir el-Medina had an unusually high concentration of literate people, sending and reading messages to one another. Residents shared their ideas, told mythological stories and diarized their thoughts and worries, all here in Egypt's 3,500-year-old writing club. Here you will find houses as well as the tombs of high-ranking scribes and artisans. In one tomb you will find, painted onto the wall, a prostrate man, praying at the foot of a palm tree, dates falling like the burnt dough of Renenutet. The prayer is a humble one, not for glory, power, or ego, but for drinking water. Surrounding the figure, his words—depicted in hieroglyphs—float around him, spreading outward, in a request to the ancient Egyptian gods. There are three painted tombs in total, and a vast area of mud-brick homes to explore. This includes a temple dedicated to the goddess Hathor. The site provides a unique insight into the daily lives of ancient Egyptians, including their religious practices, family and work routines. Excavations have revealed thousands of artifacts including love letters, literature, and joke.",
    "author": "",
    "published": "Fri, 28 Feb 2025 15:00:00 -0500",
    "image": "https://img.atlasobscura.com/qvX7noDASnZ9c4BfomWjJdF3dIe6eMte1onmE2UCe80/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy84MGU3/ZWY2MC0yZGRiLTRm/MzYtOTIzNS02YzQw/ODIzYmUyNmQ1YzA2/ZGM5MDAzZmY2YjY1/YzNfMjAyNTAxMDJf/MTMxNjExLmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "archeology",
      "ancient egypt",
      "ancient"
    ]
  },
  {
    "id": "bca31a6a-2856-490c-ae20-cd16e4f8a610",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "2b671b98-06f9-4cc6-a066-b69886c4dcb3",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "3760d9b4-57a3-4f38-be4f-91333470a003",
    "title": "How to Get Around Central America on a Budget",
    "link": "https://www.nomadicmatt.com/travel-blogs/how-to-get-around-central-america/",
    "description": "Surrounded by the Pacific and Atlantic Oceans, Central America is a magical region that is perfect for backpacking. The area is full of rainforests, unexplored Mayan ruins, gorgeous beaches, incredible reefs, cheap prices, delicious food, and welcoming people. It can be difficult arranging transportation throughout the region. In this post, I’ll provide some helpful tips... The post How to Get Around Central America on a Budget appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 26 Feb 2025 13:13:57 +0000",
    "image": "https://media.nomadicmatt.com/2023/lafortunacostarica.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Central America"
    ]
  },
  {
    "id": "87b5f8d7-51dc-4703-bbfc-4ef4332e97e6",
    "title": "Come See Me on Book Tour!",
    "link": "https://www.nomadicmatt.com/travel-blogs/book-tour-2025/",
    "description": "I’m going on a book tour! My next book, How to Travel the World on $75 a Day, is coming out on March 25th and I’m going on a book tour to talk about it and the current state of travel! This is my first book tour in six years and I’m very excited to... The post Come See Me on Book Tour! appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 25 Feb 2025 12:59:49 +0000",
    "image": "https://media.nomadicmatt.com/2025/tourposttitle.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings"
    ]
  }
]
