[
  {
    "id": "558f413c-6c0d-4d35-a77f-55a36c990d7a",
    "title": "The ghostly allure of Dungeness, Kent",
    "link": "https://www.theguardian.com/travel/2025/apr/13/otherworldly-ghostly-allure-of-dungeness-kent",
    "description": "It’s an arid and mysterious place, yet it’s precisely these charms that captivate visitors – and our writer‘It’s a Marmite place, you either love it or hate it,” says the lady making us coffee at Ness Café, as we gaze across the flat, arid landscape that is Dungeness beach, a chunk of Arizona on the Kent coast. Certainly it’s not for everyone. Some find it too bleak, depressing even. Others lean into it, the endless stretch of shingle and the looming presence of a nuclear power station at the southern end that lends a distinctly apocalyptic feel. Throw in the surreal afterthought of a miniature railway that runs across the beach and there really is nowhere else quite like it.The place has long been an inspiration for artists, photographers, architects and writers, drawn by the otherworldly atmosphere, the strange clash of styles and the shifting blue-grey light. Continue reading...",
    "author": "Emma Cook",
    "published": "Sun, 13 Apr 2025 10:01:11 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Kent holidays",
      "England holidays",
      "Travel",
      "Life and style",
      "Europe holidays",
      "United Kingdom holidays",
      "Derek Jarman"
    ]
  },
  {
    "id": "bb5139ce-a258-4ab8-beb9-b3af9ba09ec0",
    "title": "What’s new in Portugal? 10 reasons to visit in 2025",
    "link": "https://www.theguardian.com/travel/2025/apr/12/whats-new-in-portugal-10-reasons-to-holiday-visit",
    "description": "From modern art in Lisbon and yoga on the Algarve to food festivals, coastal hikes, surfing and cycling, it’s all going on in one of Europe’s favourite destinationsThe hilltop town about 40 minutes’ drive from Lisbon is celebrating 30 years of Unesco world heritage status. Sintra was the first European site listed as a cultural landscape, thanks to its fairytale architecture set among lush parks and gardens. There are 30 events taking place throughout the year, especially aimed at young people, culminating in the Sintra PH30 festival in December. Initiatives include outdoor activities such as geocaching, orienteering, mountain biking, hiking and running; escape rooms, murder mysteries and ghost experiences in and around the town’s historic buildings; behind-the-scenes visits to restoration sites and conservation projects; and live music and talks.ph30.parquesdesintra.pt Continue reading...",
    "author": "Rachel Dixon",
    "published": "Sat, 12 Apr 2025 11:00:44 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Portugal holidays",
      "Europe holidays",
      "Food and drink",
      "Surfing holidays",
      "Yoga holidays",
      "Travel"
    ]
  },
  {
    "id": "f3e5410e-e971-401a-bfdb-159836cc5c07",
    "title": "The Cyclone in Brooklyn, New York",
    "link": "https://www.atlasobscura.com/places/the-cyclone",
    "description": "The Coney Island Cyclone, built in Brooklyn in 1927,  was the brainchild of two Russian immigrant brothers, Jack and Irving Rosenthal. It was built near the site of the nation’s first commercially successful coaster, the 1884 Switchback Railway. The Rosenthal brothers continued as innovators in the amusement industry, managing and later owning the successful Palisades Amusement Park in Bergen County, New Jersey. The Cyclone roller coaster would go on to outlive all of its rival Golden Age coasters.  The Cyclone was declared a New York City landmark in 1988, along with the Statue of Liberty, the Brooklyn Bridge, and the World Trade Center. In 1991, it was placed on the National Register of Historic Places. Today the Cyclone is the only operational wooden roller coaster left on Coney Island and one of the last Golden Age rollers in the world.   The Cyclone is classified as a “gravity ride of the wooden track twister type.” A chain carries the three 4,000-pound, eight-person cars up to the first and highest plunge of 85 feet. After the initial drop, the cars then travel on their own momentum for the duration of the ride. The little cars speed along 2,640 feet of track, twisting through 6 turns and 12 drops. Riders are subjected to 3.75 g of force as the cars approach speeds of up to 60 miles per hour. It’s all over in just a minute and fifty seconds. On its annual opening day, the Cyclone celebrates with speeches, dedications and a traditional egg cream christening of the front car by Brooklyn’s Borough President. The park offers free admission for the first 100 Cyclone riders, with some people even queueing up the night before to be the first to ride. There have been so many tales told about the Cyclone that it is sometimes hard to tell fact from fiction. Famous American aviator Charles Lindbergh has been quoted as saying that his ride on the Cyclone was more thrilling than his historic first solo flight across the Atlantic Ocean. (Whether that was true or not, it did make for great publicity.)",
    "author": "",
    "published": "Fri, 11 Apr 2025 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/nkaUMcgKYhVjsN66oDgSLz9JHQOIfd0BdzOBuQkD1b8/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8xMWQ1/MmExYS1jMzYyLTQw/OGItYjA1Zi0wMmEy/MjJiODhhMjBhOGNj/YTNiYzI0MmNjZjQx/ZmJfQ3ljbG9uZTIu/SlBH.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "theme parks",
      "landmarks",
      "roller coasters"
    ]
  },
  {
    "id": "ac03fd7d-80bb-4645-a0c7-c34bd28aed69",
    "title": "Catafalque of La Torre de Esteban Hambrán in La Torre de Esteban Hambrán, Spain",
    "link": "https://www.atlasobscura.com/places/catafalco-de-la-torre-de-esteban-hambran",
    "description": "A catafalque is a decorated wooden framework that supports the coffin of a distinguished person during a funeral. But the catafalque in the local church in La Torre de Esteban Hambrán, Spain is more than that. It is a most unique example of funerary art from the Baroque era. It is the only example in the world of this kind of funerary monument. This impressive piece of art is a perfect example of the Spanish Baroque style and at the same time a reminder that death awaits us all. This incredible piece of funerary art was lost for decades. Back in 1936, it was removed from the main nave of the temple and hidden in some sort of warehouse within the church tower so that it would not be damaged during the Spanish Civil War. It was hidden so well that it was not found until 1985 when during renovation work of the Santa María Magdalena church a group of workers came across it. After some restoration work, it was finally exposed in November of 1985, resuming the tradition of only exposing it during the month of November. The catafalque, which the local town hall claims has an unidentified author, was created in 1753 and belongs to the Brotherhood of the Holy Souls. It has a three-sided semi-hexagonal shape with a height of 5.30 meters and a length of 9.60 meters. The structure is embellished with five levels' worth of panels of oil on canvas paintings. All of the paintings allude to death and many of them include a short, sarcastic funerary poem.",
    "author": "",
    "published": "Fri, 11 Apr 2025 15:00:00 -0400",
    "image": "https://img.atlasobscura.com/nKYp750D9mPpiOVP-IIilrzatTyJm18K9m0cl9igHAU/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy81NTE5/MmE4Mi00MjhmLTRl/NzUtOGM0MC00ODZk/Yzg4ZWU5YzYxMTJi/ODg1ODhlYTgwNTEw/NGVfOTU5MzBkN2Mt/ZTUwOS00Y2I5LTk1/MTEtZWJjODIwN2Jm/NTgxZTk2NjllY2Yz/M2QxYzNkYTY2X0lN/R18zNzEzLmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "catholic",
      "spanish civil war",
      "funeral art"
    ]
  },
  {
    "id": "2be9fe0a-d498-4a4f-a83c-2ef44c3d9b58",
    "title": "Travel and Tariffs: How Hotels, Airlines, Cruise Lines and Travelers are Faring",
    "link": "https://www.nytimes.com/2025/04/10/travel/tariffs-and-the-travel-industry.html",
    "description": "The travel industry doesn’t know what to expect from whipsawing U.S. policies. But concerns are hitting the bottom line, which could mean higher prices, and more confusion, for tourists.",
    "author": "Elaine Glusac",
    "published": "Thu, 10 Apr 2025 15:46:09 +0000",
    "image": "https://static01.nyt.com/images/2025/04/10/multimedia/00trav-tariffs-jlbz/00trav-tariffs-jlbz-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Customs (Tariff)",
      "Prices (Fares, Fees and Rates)",
      "United States Politics and Government",
      "US Dollar (Currency)",
      "Airlines and Airplanes",
      "Hotels and Travel Lodgings",
      "Cruises",
      "Trump, Donald J"
    ]
  },
  {
    "id": "d8143e98-4712-49c5-9847-117d88a458f0",
    "title": "Lofoten, Norway, a High-Latitude Version of Paradise",
    "link": "https://www.nytimes.com/2025/04/10/travel/lofoten-norway-hiking-animal-watching.html",
    "description": "This remote archipelago is a dreamy base for adventure, with backcountry ski slopes reached by boat, hiking trails that offer views for miles and deep fjords to sail.",
    "author": "Caroline Van Hemert",
    "published": "Thu, 10 Apr 2025 09:00:11 +0000",
    "image": "",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Sailboats and Sailing",
      "Cod (Fish)",
      "Seafood",
      "Skiing",
      "Mountains",
      "Eagles (Birds)",
      "Mountaineering",
      "Lofoten Islands (Norway)"
    ]
  },
  {
    "id": "7f133fde-bd96-4f9e-8994-a7df3e3d4982",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "d7ee143f-feea-4907-8042-d368418e556f",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "963f0c51-0a1d-445b-809d-4b88898b5bae",
    "title": "My New Book on Budget Travel is Now Available!",
    "link": "https://www.nomadicmatt.com/travel-blogs/new-budget-travel-book/",
    "description": "Today is the day! My new book, How to Travel the World on $75 a Day, is out NOW! (Woo! Hoo!) This newly updated edition of my New York Times best-selling book will help you travel on a budget. The last edition of the book came out in 2017 and, since then, a lot has... The post My New Book on Budget Travel is Now Available! appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 07 Apr 2025 14:57:21 +0000",
    "image": "https://media.nomadicmatt.com/2025/mattnewbook1.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "books",
      "guidebooks",
      "httw"
    ]
  },
  {
    "id": "5dc9eadb-8c0e-4970-9a32-4dfcc0a3a34d",
    "title": "Where I Find the Best Travel Deals",
    "link": "https://www.nomadicmatt.com/travel-blogs/find-travel-deals/",
    "description": "There are incredible travel deals happening all the time. In this post, I share with you where I go to get the best flight, hotel, tour deals when I'm looking to travel - and the one site that you should never ever use when you are planning a trip! The post Where I Find the Best Travel Deals appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 07 Apr 2025 13:01:50 +0000",
    "image": "https://media.nomadicmatt.com/2024/mattbarcelonabackpack.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Tips",
      "accommodation",
      "Airlines",
      "budget travel",
      "Cheap Flights",
      "How to Save For Your Trip"
    ]
  }
]
