[
  {
    "id": "9bd8b509-ee48-44e2-880f-c120ae8e2610",
    "title": "Decay Chain",
    "link": "https://xkcd.com/3071/",
    "description": "",
    "author": "",
    "published": "Wed, 02 Apr 2025 04:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/decay_chain.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "e6c5bf19-5dc3-489e-ad55-c93b443d2334",
    "title": "Orogeny",
    "link": "https://xkcd.com/3070/",
    "description": "",
    "author": "",
    "published": "Mon, 31 Mar 2025 04:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/orogeny.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "da537bd5-a500-479b-beb1-dd3907dd398b",
    "title": "5 of the Most Important Poops in History",
    "link": "https://www.cracked.com/article_45031_5-of-the-most-important-poops-in-history.html?newsletter-cat=science-history",
    "description": "By Jesse Published: January 09th, 2025",
    "author": "",
    "published": "Thu, 09 Jan 2025 08:00:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "be3bb650-c825-4c16-a32b-1875f540b25e",
    "title": "Deleted Scenes From ‘The Blues Brothers’ Were Rescued by the FBI",
    "link": "https://www.cracked.com/article_45033_deleted-scenes-from-the-blues-brothers-were-rescued-by-the-fbi.html?newsletter-cat=movies-tv",
    "description": "By JM McNab Published: January 09th, 2025",
    "author": "",
    "published": "Thu, 09 Jan 2025 06:40:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "7ec314ed-b1f8-4ba4-a594-303b5d7b035d",
    "title": "Comic for 2021.12.21",
    "link": "http://explosm.net/comics/6060/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Tue, 21 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "91536fa5-24b6-4a0a-9e0d-a43f1ad6482c",
    "title": "Comic for 2021.12.20",
    "link": "http://explosm.net/comics/6059/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Mon, 20 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "ae2919c3-a87c-4dc8-906e-e676db145b66",
    "title": "Law office partners push lawyers to rush cases, lawyer maliciously complies: 'Partners thought it should take me about 15-20 minutes... it would take me at least 1.5 hours'",
    "link": "https://cheezburger.com/39995653/law-office-partners-push-lawyers-to-rush-cases-lawyer-maliciously-complies-partners-thought-it",
    "description": "If your bosses are pushing for \"quantity over quality,\" you might want to freshen up your resume and start applying for other jobs. Why? Well, firstly it's an indicator that they don't care about the product they're putting out. You can produce a product quickly and have it still be a good product. As they say, you can have something that is made quickly, cheaply, or high-quality, and you can pick two of those options. If you want something good done fast, it'll cost you. If you want lots of things done cheaply and fast, that's going to make the product's quality suffer a bit. It's always a dilemma for bosses, who want to save money and get the most bang for their buck. For employees, this might translate to rushing around and turning in shoddy work just to make their deadlines. If you work hard to gain your job position, you probably want to make a difference in your field. So when this lawyer's bosses started insisting on quantity over quality, they were not happy about it. Imagine if you took 90 minutes to produce a report, and now the boss wants it done in 20 minutes. That's not great! You can check out the full story below to see how this person handled the sudden change. Next, read about this social media manager who tried to promote an author's work, only to receive \"4 emails in 15 minutes telling me all the things I was doing wrong.\"",
    "author": "Remy Millisky",
    "published": "Fri, 04 Apr 2025 14:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "boss",
      "workplace-stories",
      "jobs",
      "job",
      "lawyer",
      "bosses",
      "work",
      "workplace"
    ]
  },
  {
    "id": "eadf1350-27fe-4c5b-912c-b36f479f39f6",
    "title": "Nomadic RV couple fights over thermostat, boyfriend hides space heater from heat-loving girlfriend: 'She's been cranking the space heater to 85˚ and leaving it on!'",
    "link": "https://cheezburger.com/39971077/nomadic-rv-couple-fights-over-thermostat-boyfriend-hides-space-heater-from-heat-loving-girlfriend",
    "description": "RV life can present itself with a unique set of challenges. There is a reason why people are fascinated by the idea of a more nomadic lifestyle, even if it's something that they could never endure themselves.Personally speaking, I need the stability of an unmovable home, a place where I can come back to at the end of the day that is just a bit less dependent on the elements. In other words, I would never end up like either person in this relationship because I would never seriously consider RV life for even a long weekend if I could help it. That being said, I can relate to having to adjust to the different preferred temperatures of your significant other once both parties are sharing space.",
    "author": "Ben Weiss",
    "published": "Fri, 04 Apr 2025 13:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "Dating-Relationships",
      "aita",
      "AITAH",
      "relationships",
      "couples",
      "breakup",
      "funny",
      "toxic relationship",
      "entitled people"
    ]
  },
  {
    "id": "0f6d64eb-2f83-4e43-a945-7fc4ba5b4dec",
    "title": "'He showed up just when we needed him’: Stray kitten appears the same week their beloved dog passes, becomes an unexpected blessing and beloved new family member",
    "link": "https://cheezburger.com/39905541/he-showed-up-just-when-we-needed-him-stray-kitten-appears-the-same-week-their-beloved-dog-passes",
    "description": "Hey there friends and feline enthusiasts. Losing a beloved pet is one of the most heartbreaking experiences a family can go through. It creates a space in your home and your heart that feels impossible to fill. So when a tiny, scrappy kitten appeared in the yard just days after this family lost their sweet dog, it felt like more than a coincidence. It felt like something bigger.For two weeks, they fed him every night, unsure if he had a home or if he would let them get close. Eventually, they were able to bring him inside, where a vet confirmed he was just 12 weeks old and born the very same week their dog had passed. Covered in dirt and severely underweight, he clearly needed a family just as much as they needed him.They named him Franklin, and over the past five months, he has settled into their lives like he was meant to be there all along. From play-fighting with their other dog to sleeping on his human's chest every night, Franklin has become a source of joy and healing. His soft purrs and tiny coos are daily reminders that sometimes the universe delivers exactly what you need right when you need it most. And now our hearts have been officially warmed.",
    "author": "kalila courban",
    "published": "Thu, 03 Apr 2025 14:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "wholesome",
      "hilarious",
      "cat",
      "adorable",
      "heartwarming",
      "cute",
      "felines",
      "cute cats",
      "goofball",
      "feline",
      "sweet",
      "goofy",
      "silly",
      "Cats",
      "funny"
    ]
  },
  {
    "id": "642458e2-f8e2-4eab-9439-33353bf06db4",
    "title": "Cookie Jar Confessions: 27 Comedic Chonky Cat Child Memes (Intrusive Thoughts Edition)",
    "link": "https://cheezburger.com/39959301/cookie-jar-confessions-27-comedic-chonky-cat-child-memes-intrusive-thoughts-edition",
    "description": "Every chonky cat child has a secret to confess. Usually it has to do with where they have been stashing their stolen treats, but today they are confessing to something much more serious. For today, the chonkers of the cat world are coming clean about their intrusive thoughts and what they have made them do. Which as you can imagine must contain some seriously strange behaviors, considering that these creatures consider hiding stolen treats to be a normal part of everyday life.So if you have been wanting to know why your fur baby has been behaving strangely, or you simply love indulging in the gossipy goodness of clawminal cat children, then we recommend locking into this list with three seatbelts and holding on tight for a wild ride.",
    "author": "Laurent Shinar",
    "published": "Thu, 03 Apr 2025 13:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "funny cat memes",
      "cat",
      "confessions",
      "edition",
      "child",
      "stoner thoughts",
      "comedy",
      "chonky",
      "cookie jar"
    ]
  },
  {
    "id": "a02627fa-c904-4f70-bfb1-75e1e01172c6",
    "title": "Every Witch Way But Loose",
    "link": "https://www.penny-arcade.com/news/post/2025/04/04/every-witch-way-but-loose",
    "description": "You might be as surprised as we were to learn that dreaded continuity could rear its ugly and reptilian head. Like the mudfish, it had gone dormant in the murk and has only now begun to whip and writhe.",
    "author": "",
    "published": "Fri, 04 Apr 2025 17:19:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "83ebcec3-9e8a-42d6-b34b-2c7e8c1dab1e",
    "title": "Every Witch Way But Loose",
    "link": "https://www.penny-arcade.com/comic/2025/04/04/every-witch-way-but-loose",
    "description": "New Comic: Every Witch Way But Loose",
    "author": "",
    "published": "Fri, 04 Apr 2025 07:01:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "1dc034c3-a5b1-4150-bb75-1711c6e0c5fe",
    "title": "The Glam Gals",
    "link": "https://awkwardfamilyphotos.com/2025-glamourous-gals",
    "description": "“My mom and I did “mother/daughter” glamour shots at a local motel in a janky hotel room in the late 90s. The photographer thought it would be a lovely idea to have us sit back to back and be encircled by black and white feather boas. He also commented on my “beautiful eyes.” At the time,... The post The Glam Gals appeared first on AwkwardFamilyPhotos.com.",
    "author": "Team Awkward",
    "published": "Fri, 14 Feb 2025 23:23:12 +0000",
    "image": "https://s3.awkwardfamilyphotos.com/wp-content/uploads/2025/02/19112053/glam-731x1024.png",
    "source": "https://awkwardfamilyphotos.com/feed/",
    "categories": [
      "Misc",
      "Mom"
    ]
  },
  {
    "id": "125cacb9-b74f-410a-a7bd-6d61fccea23b",
    "title": "Big Red",
    "link": "https://awkwardfamilyphotos.com/2024/bigred",
    "description": "“My amazing mullet!” (submitted by Annie) The post Big Red appeared first on AwkwardFamilyPhotos.com.",
    "author": "Team Awkward",
    "published": "Thu, 23 Jan 2025 02:54:52 +0000",
    "image": "https://s3.awkwardfamilyphotos.com/wp-content/uploads/2024/12/22185449/inbound3669388423149842718.jpg",
    "source": "https://awkwardfamilyphotos.com/feed/",
    "categories": [
      "Kids",
      "Misc"
    ]
  },
  {
    "id": "ebc69701-fa6d-46b7-a97e-6a340d32e12c",
    "title": "Saturday Morning Breakfast Cereal - Yup",
    "link": "https://www.smbc-comics.com/comic/yup",
    "description": "Click here to go see the bonus panel!Hovertext:There's a whole genre of robots taking selfies next to sterilized planets.Today's News:",
    "author": "Zach Weinersmith",
    "published": "Fri, 04 Apr 2025 15:10:17 -0400",
    "image": "https://www.smbc-comics.com/comics/1743793829-20250404.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "41793f10-4baf-425c-8bca-d50fc32bc929",
    "title": "Saturday Morning Breakfast Cereal - Ritual",
    "link": "https://www.smbc-comics.com/comic/ritual-2",
    "description": "Click here to go see the bonus panel!Hovertext:Later, Satan decides to call in sick on summoning day.Today's News:",
    "author": "Zach Weinersmith",
    "published": "Thu, 03 Apr 2025 12:43:24 -0400",
    "image": "https://www.smbc-comics.com/comics/1743698628-20250403.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "47c8172d-3d64-47aa-aa6c-5afa6b35057e",
    "title": "It’s FRIDAY",
    "link": "https://thebloggess.com/2025/04/04/its-friday-5/",
    "description": "First off, giant thanks to everyone who commented on my last post, because it made me feel so much less alone and it also convinced me to not try to outrun unconsciousness in the future after reading so many stories of broken bones. THANK YOU. Secondly, it’s Friday and that means you need to comeContinue reading \"It’s FRIDAY\"",
    "author": "thebloggess",
    "published": "Fri, 04 Apr 2025 20:40:22 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "640adf66-1ec4-438a-8525-9827555d472f",
    "title": "Having a human body is bullshit",
    "link": "https://thebloggess.com/2025/03/31/having-a-human-body-is-bullshit/",
    "description": "So I’ve written before about the fact that I have vasovagal syncope (although I’m not sure I’ve ever used the technical term for it) but it’s basically where I pass out if my anxiety gets too bad. It only happens a few tines a year and it even happens when I’m not aware that I’mContinue reading \"Having a human body is bullshit\"",
    "author": "thebloggess",
    "published": "Mon, 31 Mar 2025 20:53:39 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "a68793bd-844c-4424-abfc-af01868460f1",
    "title": "Artax",
    "link": "http://theoatmeal.com/comics/artax?no_popup=1",
    "description": "A comic about a horse in a swamp.View on my website",
    "author": "Matthew Inman",
    "published": "2025-04-03T14:33:00+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/artax_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "411023f3-bf33-49d4-82af-ee5e260f8d90",
    "title": "CPAP dreams",
    "link": "http://theoatmeal.com/comics/cpap_dreams?no_popup=1",
    "description": "A comic about a CPAP machineView on my website",
    "author": "Matthew Inman",
    "published": "2025-03-23T16:32:15+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/cpap_dreams_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "2f1ac094-6105-4c4e-8a51-d6581df06a13",
    "title": "Error'd: Mais Que Nada",
    "link": "https://thedailywtf.com/articles/mais-que-nada",
    "description": "I never did explain the elusive off-by-one I hinted at, did I? A little meta, perhaps. It is our practice at Error'd to supply five nuggets of joy each week. But in episode previous-plus-one, you actually got six! (Or maybe, depending on how you count them, that's yet another off-by-one. I slay me.) If that doesn't tickle you enough, just wait until you hear what Dave L. brought us. Meanwhile... \"YATZP\" scoffed self-styled Foo AKA F. Yet Another Time Zone P*, I guess. Not wrong. According to Herr Aka F., \"German TV teletext (yes, we still have it!) botched the DST start (upper right corner). The editors realized it and posted a message stating as much, sent from the 'future' (i.e. correct) time zone.\"   Michael R. wrote in with a thought-provoker. If I'm representing one o'clock as 1:00, two o'clock as 2:00, and so forth, why should zero o'clock be the only time represented with not just one, but TWO leading zeroes? Logically, zero o'clock should be represented simply by :00, right?   Meanwhile, (just) Randy points out that somebody failed to pay attention to detail. \"Did a full-scroll on Baeldung's members page and saw this. Sometimes, even teachers don't get it right.\"   In case Michael R. is still job-hunting Gary K. has found the perfect position for everyone. That is, assuming the tantalizingly missing Pay Range section conforms to the established pattern. \"Does this mean I should put my qualifications in?\" he wondered. Run, don't walk.   And in what I think is an all-time first for us, Dave L. brings (drum roll) an audio Error'd \"I thought you'd like this recording from my Garmin watch giving me turn-by-turn directions: In 280.097 feet turn right. That's two hundred eighty feet and ONE POINT ONE SIX FOUR INCHES. Accuracy to a third of a millimeter!\" Don't move your hand! Alas, your browser does not support this audio.   [Advertisement] Keep all your packages and Docker containers in one place, scan for vulnerabilities, and control who can access different feeds. ProGet installs in minutes and has a powerful free version with a lot of great features that you can upgrade when ready.Learn more.",
    "author": "Lyle Seaman",
    "published": "Fri, 04 Apr 2025 06:30:00 GMT",
    "image": "https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/266/screenshot_20250330_095044.png",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Error'd"
    ]
  },
  {
    "id": "cda6afe4-fe6e-47c8-b541-c4afa666a8b2",
    "title": "Representative Line: Get Explosive",
    "link": "https://thedailywtf.com/articles/get-explosive",
    "description": "Sean sends us a one-line function that is a delight, if by delight you mean \"horror\". You'll be shocked to know it's PHP. function proget(){foreach($_GET as $k=\u003e$v){if($k==\"h\"){$GLOBALS[\"h\"]=1;}$p=explode(\",\",$k);}return($p);} //function to process GET headers Based on the comment, proget is a shorthand for process_get_parameters. Which is sort of what it does. Sort of. Let's go through this. We iterate across our $_GET parameters using $k for the key, $v for the value, but we never reference the value so forget it exists. We're iterating across every key. The first thing we check is if a key \"h\" exists. We don't look at its value, we just check if it exists, and if it does, we set a global variable. And this, right here, is enough for this to be a WTF. The logic of \"set a global variable based on the existence of a query parameter regardless of the value of the query parameter\" is… a lot. But then, somehow, this actually gets more out there. We explode the key on commas (explode being PHP's much cooler name for split), which implies… our keys may be lists of values? Which I feel like is an example of someone not understanding what a \"key\" is. But worse than that, we just do this for every key, and return the results of performing that operation on the last key. Which means that if this function is doing anything at all, it's entirely dependent on the order of the keys. Which, PHP does order the keys by the order they're added, which I take to mean that if the URL has query params like ?foo=1\u0026h=0\u0026a,b,c,d=wtf. Or, if we're being picky about encoding, ?foo=1\u0026h=0\u0026a%2Cb%2Cc%2Cd=wtf. The only good news here is that PHP handles the encoding/decoding for you, so the explode will work as expected. This is the kind of bad code that leaves me with lots of questions, and I'm not sure I want any of the answers. How did this happen, and why are questions best left unanswered, because I think the answers might cause more harm. [Advertisement] Plan Your .NET 9 Migration with ConfidenceYour journey to .NET 9 is more than just one decision.Avoid migration migraines with the advice in this free guide. Download Free Guide Now!",
    "author": "Remy Porter",
    "published": "Thu, 03 Apr 2025 06:30:00 GMT",
    "image": "",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Representative Line"
    ]
  },
  {
    "id": "228afe11-3965-4bec-a368-359fa4a98a9f",
    "title": "01/15/21 PHD comic: 'NEW BOOK! Out of Your Mind!'",
    "link": "http://www.phdcomics.com/comics.php?f=2051",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"NEW BOOK! Out of Your Mind!\" - originally published 1/15/2021 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Mon, 31 Jan 2022 11:24:26 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd011525s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "d4e6efe3-ace6-4844-b7f3-0edab54c3b0e",
    "title": "08/31/23 PHD comic: 'New Book! Oliver's Great Big Universe!'",
    "link": "http://www.phdcomics.com/comics.php?f=2050",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"New Book! Oliver's Great Big Universe!\" - originally published 8/31/2023 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Tue, 14 Dec 2021 11:53:03 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd083123s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "d2dcb6ea-8bb5-4553-ba3d-32a0c5e8e6e1",
    "title": "Trump Tariffs Upend Global Economic Order",
    "link": "https://theonion.com/trump-tariffs-upend-global-economic-order/",
    "description": "Economists warn that, if left in place, Trump’s sweeping tariffs on U.S. trade partners will wreak havoc on households, businesses, and financial markets across the world, upending a global economic order that America benefited from and helped create. What do you think? The post Trump Tariffs Upend Global Economic Order appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Fri, 04 Apr 2025 19:56:09 +0000",
    "image": "https://theonion.com/wp-content/uploads/2025/02/Face-Asian.jpg?w=200",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "American Voices",
      "Donald Trump",
      "Vol 61: Issue 14"
    ]
  },
  {
    "id": "4ed6b26e-b341-4999-9305-bb60b5839bf5",
    "title": "Parents Gently Explain To Child That Their Money In Heaven Now",
    "link": "https://theonion.com/parents-gently-explain-to-child-that-their-money-in-heaven-now/",
    "description": "HUNTSVILLE, AL—In an effort to comfort the child by telling her the funds had gone to a far better place, local parents Blake and Allison McKee gently explained to their daughter Friday that their money was in heaven now, sources confirmed. “Honey, the reason we’re sitting you down today is because even though our life […] The post Parents Gently Explain To Child That Their Money In Heaven Now appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Fri, 04 Apr 2025 18:36:38 +0000",
    "image": "",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "News",
      "Money",
      "Stock Market",
      "Vol 61: Issue 14"
    ]
  },
  {
    "id": "028c44f2-54cd-4f13-928d-1ea3248a8fd7",
    "title": "Sunday Secrets",
    "link": "https://postsecret.com/2025/03/30/sunday-secrets-549/",
    "description": "The post Sunday Secrets appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 30 Mar 2025 00:07:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2025/03/killed.jpg?resize=526%2C378\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "93c2418b-9556-4c2f-a5be-2635229be699",
    "title": "frank(@)postsecret.com",
    "link": "https://postsecret.com/2025/03/30/frankpostsecret-com/",
    "description": "—email— Hi FrankI see you posted my secret last week. But you only showed the side that said to put it in the freezer. That wasn’t the secret! The secret itself was on the other side. It would appear when you freeze the postcard.-M —email—Hi M,Your postcard has had an interesting journey in my home. My […] The post frank(@)postsecret.com appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 30 Mar 2025 00:05:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2025/03/freezer.jpg?resize=526%2C351\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  }
]
