[
  {
    "id": "2efe3646-48c0-4af0-b2dc-093ae441a01b",
    "title": "Australian Open Day 2 live updates, schedules, highlights",
    "link": "https://www.espn.com/tennis/story/_/id/43387952/australian-open-day-2-live-updates-schedules-highlights",
    "description": "After rain interrupted the opening day of the 2025 Australian Open, the weather looks more favourable for Day 2, and there are stars in action everywhere.",
    "author": "ESPN staff",
    "published": "Sun, 12 Jan 2025 19:12:28 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "cf9219b2-2773-4d20-acff-590d4e70d412",
    "title": "As Djokovic's career nears the end, his unrivaled greatness stands out even more",
    "link": "https://www.espn.com/tennis/story/_/id/43214042/australian-open-novak-djokovic-age-win",
    "description": "While Djokovic is adamant he will keep playing, this could be his last Australian Open, and it's worth enjoying his legendary career.",
    "author": "Jake Michaels",
    "published": "Sun, 12 Jan 2025 02:56:43 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "9782bb9a-b634-4851-b76b-98c11da7325f",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "9c9ee3f3-b9e0-45c3-b630-f03cf22687dc",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "ac7bef62-9757-4a1e-a876-ee72a827deaf",
    "title": "One of Basavareddy’s dream dinner guests? His Australian Open opponent Djokovic!",
    "link": "https://www.atptour.com/en/news/basavareddy-2025-off-court-feature",
    "description": "Nishesh Basavareddy could hardly have asked for a more exciting start to his Australian Open career. The 19-year-old American will take on 10-time champion Novak Djokovic on Monday at Melbourne Park. Competing in his first main-draw match at a major would have represented a milestone moment for Basvareddy no matter the opponent, but he now knows he will face one of his childhood idols. “I’ve hit on Arthur Ashe, I will hit on Laver [before the match], so I’ll use that experience a little bit, but I think it will be really cool to just take in the whole moment,” Basavareddy told ATPTour.com ahead of his maiden Lexus ATP Head2Head meeting with Djokovic. “Hopefully it is a packed crowd. This is where you dream about playing as a little kid.” Basavareddy has seen Djokovic up close before: he was a tournament hitting partner at the 2023 Nitto ATP Finals, where the Serbian triumphed. Although he did not share a practice court with Djokovic during that week in Turin, it remained a highly formative experience for Basavareddy, who was playing college tennis at the time. “The [Nitto ATP Finals] is the highest-level event there is in tennis,” reflected the former Stanford University Cardinal standout. “The top eight guys at that time, seeing them in person was almost a little [surreal], because that is the first time I had seen a lot of those guys. Now to be here about a year later, is definitely a little surreal. But I think that week gave me a lot of confidence, seeing that the level wasn’t as far as I thought it was. I think that was huge for me.” Basavareddy did not have to think long when asked about the Djokovic matches he remembers most: The Serbian’s 2019 Wimbledon final win against Roger Federer, and his five-hour, 53-minute 2012 Australian Open championship-match victory against Rafael Nadal. Basavareddy was only six years old when that match took place. “I just remember how much mental strength both those guys had to fight for that whole match, and also them cramping in the post-match celebrations,” he said. “Obviously it was a painful moment for them, but I also think it was a pretty cool moment for tennis fans to see how much they had put into it.” Djokovic also came up when Basavareddy was put to the test by ATPTour.com’s quickfire off-court Q \u0026 A. Which of the Serbian's matches does the 2024 Next Gen ATP Finals presented by PIF competitor wish he could have played? And which baseball star would he happily accept as a tour guide? Read on to find out more about the #NextGenATP star. [ATP APP] If you could have dinner with any three people, who would they be and why? Novak [Djokovic], LeBron [James]… I’m trying to think of a businessman or something like that… But I'll skip that and go Roger [Federer]. Three great athletes that I can ask a lot of questions to. If you could switch places with one person for the day, who would it be and why? Maybe Shohei Ohtani. He’s a pretty famous person and Japan's a pretty cool country. Maybe he'd show me a good time. Is there any particular match from the past that makes you wish you could have been the one who had played it? Maybe Djokovic [against Alcaraz] at the Paris Olympics. I think winning a gold medal is really cool, the way he's able to do that in that atmosphere. I think that'd be really cool to win a gold medal. Is there anything cool you've done off court that you've only done because you're a tennis player? I think just visiting all sorts of places. I've never really done vacations outside of tennis. I was able to go to Lake Como, which is one of the best places I've been to, or last year I went to Chile and did dune buggies in the desert there. I don’t think I would have done that if it wasn't for tennis. So it's all the different experiences I've had. What are your biggest hobbies away from tennis? I like to play video games on my phone, and maybe get into some more PlayStation. I like to watch TV. I just finished Outer Banks, that was good, or White Collar was good as well. I also do a little bit of go-karting at home, sometimes that’s fun. I also like to watch different sports. What is your dream day without tennis? To visit a cool place. I like sightseeing and seeing different things. You travel with tennis a lot. If you could visit one place just for vacation, where would it be? I haven't really been in Asia, so maybe Japan or Korea. I’ve heard those places are nice. [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 12 Jan 2025 20:45:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Player Features",
      "Nishesh Basavareddy",
      "2025",
      "Australian Open"
    ]
  },
  {
    "id": "ea23eb51-6b67-485e-9e22-19ae30f9a010",
    "title": "Who has the best five-set record in tennis?",
    "link": "https://www.atptour.com/en/news/australian-open-2025-best-five-set-records",
    "description": "Kei Nishikori earned the fifth two-set comeback of his career Sunday at the Australian Open, where he rallied past Thiago Monteiro 4-6, 6-7(4), 7-5, 6-2, 6-3. Once the former No. 4 in the PIF ATP Rankings battled from two sets down, it was no surprise that he finished the job. The Japanese star has long been one of the best deciding-set players in tennis. But does Nishikori own the best five-set record in the Open Era? Close, but not quite. Best Five-Set Records (Full Career In Open Era)  Player  Record  Winning %  1) Bjorn Borg  27-6  81.8%  2) Johan Kriek  18-4  81.8%  3) Novak Djokovic  40-11  78.4%  4) Kei Nishikori  29-8  78.4%  5) Adrian Mannarino  14-4  77.8%  6) Tommy Robredo  17-5  77.3%  7) Aaron Krickstein  28-9  75.7%  8) Harold Solomon  18-6  75%  9) Thierry Champion  11-4  73.3%  10) Nick Kyrgios  11-4  73.3% *Chart reflects players who have only competed in the Open Era, 15-match minimum According to the Infosys ATP Win/Loss Index, Bjorn Borg, a member of the ATP No. 1 Club, owns the best five-set record in the Open Era among players who have played at least 15 five-setters. The Swede tallied a 27-6 record for a winning percentage of 81.8. Johan Kriek earned the same winning percentage, but claimed fewer wins (18-4). Among active players, 99-time tour-level titlist Novak Djokovic leads the way with a 78.4 winning percentage (40-11). Nishikori is slightly behind with his 78.4 winning percentage and a 29-8 record. \"It's good to have that record because I always have good confidence, and players know that I have good records,\" Nishikori said. \"It's good pressure for them if I have that. But maybe, like, six, seven years ago I started realising that.\" Nishikori has won eight of his nine five-setters at the Australian Open. He will next take on 12th seed Tommy Paul or Christopher O'Connell. Carlos Alcaraz owns an astonishing 12-1 five-set record. However, he did not meet the 15-match minimum to qualify for the leaderboard. However, even if the Spaniard loses his next two five-setters, he will be near the top of the list with an 80 per cent winning rate. [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 12 Jan 2025 12:31:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Player Features",
      "Australian Open",
      "2025",
      "Kei Nishikori"
    ]
  },
  {
    "id": "b05ba592-9eec-4614-abd5-f6a0d18bb439",
    "title": "'Feels like home' - Sabalenka starts title defence with win",
    "link": "https://www.bbc.com/sport/tennis/articles/cd64qngqyqno",
    "description": "Aryna Sabalenka opens her Australian Open title defence with a straight-set victory over American Sloane Stephens.",
    "author": "",
    "published": "Sun, 12 Jan 2025 10:46:24 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "f47bb4fe-1b54-452e-8756-1f5ddaed6ad6",
    "title": "Fearnley ready for 'hostile' pro-Kyrgios crowd - day two preview",
    "link": "https://www.bbc.com/sport/tennis/articles/c8j871lk19eo",
    "description": "Britain's Jacob Fearnley is expecting a febrile atmosphere when he faces Nick Kyrgios at the Australian Open, while Jack Draper and Jodie Burrage also play on day two.",
    "author": "",
    "published": "Sun, 12 Jan 2025 10:04:52 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "8df6d628-c191-4e84-9388-203a772dc102",
    "title": "Australian Open 2025 Day 1 Recap",
    "link": "https://www.perfect-tennis.com/australian-open-2025-day-1-recap/",
    "description": "Day one at the 2025 Australian is complete, and the rain meant several matches were pushed back to tomorrow. Fortunately, utilising Sunday as the opening day spreads the first-round matches across three days, making things more manageable for the schedulers. On the covered courts, Kei Nishikori and Casper Ruud played the toughest matches of the …",
    "author": "Jonathan",
    "published": "Sun, 12 Jan 2025 14:23:39 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  },
  {
    "id": "13c4b41e-9435-433d-96f7-19e7306aa8b0",
    "title": "Australian Open Draw 2025",
    "link": "https://www.perfect-tennis.com/australian-open-draw-2025/",
    "description": "The 2025 Australian Open is upon us, and the draw took place on Thursday evening in Melbourne.  All the big names are present, with defending champion Jannik Sinner the top seed. While Zverev’s strong end to the season bumped him up to the second-seed position. Ten-time Australian Open champions Novak Djokovic and Carlos Alcaraz landed …",
    "author": "Jonathan",
    "published": "Thu, 09 Jan 2025 11:11:57 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  }
]
