[
  {
    "id": "89d2ee89-dae2-4efe-bc21-3e5246629482",
    "title": "The week in tennis: Nadal and Djokovic's final matchup, and Sabalenka earns No. 1",
    "link": "https://www.espn.com/tennis/story/_/id/41927267/rafa-nadal-novak-djokovic-final-match-aryna-sabalenka-no-1-iga-swiatek",
    "description": "Nadal and Djokovic played one last time, while Sabalenka overtook Swiatek for No. 1 without playing a match.",
    "author": "D'Arcy Maine",
    "published": "Tue, 22 Oct 2024 10:13:11 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "9325fe26-9113-4727-9864-aff8f3bfda7f",
    "title": "The week in tennis: Sinner cements the No. 1 ranking, Nadal sets retirement date",
    "link": "https://www.espn.com/tennis/story/_/id/41798817/jannik-sinner-no-1-rafa-nadal-retirement-wuhan-open-sabalenka-gauff",
    "description": "Sinner will end the year at No. 1 -- while Sabalenka has a chance to as well. And Nadal confirmed his final tournament.",
    "author": "D'Arcy Maine",
    "published": "Tue, 15 Oct 2024 10:34:57 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "724c6f58-0427-4901-b71f-fa5aaa5f2d85",
    "title": "The Best Tennis Players Do These 3 Things - Essential Tennis Podcast #412",
    "link": "https://essentialtennis.podbean.com/e/the-best-tennis-players-do-these-3-things-essential-tennis-podcast-412/",
    "description": "If you want to be a great tennis player then you MUST do the three things revealed in this special episode of the Essential Tennis Podcast, PERIOD. The best players on your local courts do them and the weakest ones don’t, so don’t miss any of these insights because they’ll level up your game fast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 30 Aug 2024 22:53:48 -0500",
    "image": "https://mcdn.podbean.com/mf/web/enxkcvxwg2zukxa9/Podcast412.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "3aea16b1-f67c-47e4-8269-9a4d5f64feeb",
    "title": "3 Advanced Doubles Tactics - Essential Tennis Podcast #411",
    "link": "https://essentialtennis.podbean.com/e/3-advanced-doubles-tactics-essential-tennis-podcast-411/",
    "description": "If you’re a doubles player looking to take your game to the next level then this is the episode of the Essential Tennis Podcast you've been waiting for. You’re about to learn 3 advanced tactics that will pressure your opponents and win you free points.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 16 Aug 2024 21:57:26 -0500",
    "image": "https://mcdn.podbean.com/mf/web/9ckq8q5efekb42q4/Podcast411.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "95e967a1-f3a5-40ff-a065-4f40a0d014e3",
    "title": "What is the Paris tennis schedule?",
    "link": "https://www.atptour.com/en/news/paris-2024-schedule",
    "description": "The final ATP Masters 1000 of the season, the Rolex Paris Masters, continues Tuesday with a thrilling order of play. Among the stars who will play are second seed Carlos Alcaraz and home favourite Arthur Fils. View the full Tuesday order of play below to see who is competing, on which court, and when they are scheduled. [ATP APP]  ORDER OF PLAY - TUESDAY, 29 OCTOBER 2024 COURT CENTRAL start 11 a.m. First Round - Arthur Fils (FRA) vs [PR] Marin Cilic (CRO) First Round - [14] Frances Tiafoe (USA) vs [WC] Giovanni Mpetshi Perricard (FRA) First Round - [LL] Zizou Bergs (BEL) vs [WC] Richard Gasquet (FRA) Not Before 7 p.m. Second Round - Nicolas Jarry (CHI) vs [2] Carlos Alcaraz (ESP) Not Before 8:30 p.m. Second Round - [7] Casper Ruud (NOR) vs Jordan Thompson (AUS) COURT 1 start 11 a.m. First Round - Jan-Lennard Struff (GER) vs [16] Lorenzo Musetti (ITA) Second Round - Francisco Cerundolo (ARG) vs [6] Andrey Rublev First Round - Matteo Arnaldi (ITA) vs [13] Holger Rune (DEN) Not Before 3:30 p.m. First Round - Ben Shelton (USA) vs [Q] Corentin Moutet (FRA) Second Round - [10] Stefanos Tsitsipas (GRE) vs Alejandro Tabilo (CHI) COURT 2 start 11 a.m. Alex Michelsen (USA) vs [12] Hubert Hurkacz (POL) Alexei Popyrin (AUS) vs Matteo Berrettini (ITA) Karen Khachanov vs [PR] Pablo Carreno Busta (ESP) Not Before 3:30 p.m. [9] Alex de Minaur (AUS) vs Mariano Navone (ARG) Jack Draper (GBR) vs Jiri Lehecka (CZE) [3] Rohan Bopanna (IND) / Matthew Ebden (AUS) vs Marcelo Melo (BRA) / Alexander Zverev (GER) [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 29 Oct 2024 00:58:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Paris",
      "Tournament News",
      "2024"
    ]
  },
  {
    "id": "b92c9fa6-852b-40d8-8464-b435a957f77e",
    "title": "The Nitto ATP Finals doubles field is set!",
    "link": "https://www.atptour.com/en/news/nitto-atp-finals-2024-doubles-field-is-set",
    "description": "The doubles field for the 2024 Nitto ATP Finals is now set. Following Nathaniel Lammons and Jackson Withrow’s loss in the Rolex Paris Masters, Wesley Koolhof/Nikola Mektic, Rohan Bopanna/Matthew Ebden, Kevin Krawietz/Tim Puetz and Harri Heliovaara/Henry Patten have all qualified for the season finale. Those teams join Marcelo Arevalo/Mate Pavic, Marcel Granollers/Horacio Zeballos, Simone Bolelli/Andrea Vavassori and Max Purcell/Jordan Thompson in Turin. The year-end championships will take place at Inalpi Arena from 10-17 November. Koolhof and Mektic, the 2020 Nitto ATP Finals champions, qualified for the season finale for the second time as a team. Four years ago, the Dutch-Croatian duo lifted the trophy at The O2 in London. They have claimed four titles in 2024, triumphing in Auckland, Rotterdam, Indian Wells and Shanghai. Two of those events, Indian Wells and Shanghai, are ATP Masters 1000 tournaments. Koolhof and Mektic also made the final in ’s-Hertogenbosch and Basel. Bopanna and Ebden will compete together at the Nitto ATP Finals for the second consecutive year. They began the year on a high by winning the Australian Open. They also triumphed in Miami, made the Adelaide final and the semi-finals at Roland Garros. The Indian and Australian made the semi-finals in Turin last year, when they fell to Granollers and Zeballos. Bopanna is a two-time runner-up at the Nitto ATP Finals, advancing to the championship match in 2012 with Mahesh Bhupathi and 2015 with Florin Mergea. He also competed in the event in 2011 with Aisam-Ul-Haq Qureshi. Krawietz and Puetz will play in the year-end championships as a duo for the first time. Krawietz competed in the tournament each season from 2019-21, twice with Andreas Mies (2019-20) and once with Horia Tecau (2021). Puetz will make his debut. The Germans emerged victorious in Hamburg, reached a major final at the US Open and also made championship matches in Brisbane and Halle. They battled to semi-finals in both Indian Wells and Miami, while also reaching the Australian Open and Wimbledon quarter-finals. Heliovaara and Patten began their partnership during the clay-court season and teaming has paid dividends. After claiming glory in Marrakech and Lyon, they went on a dream run at Wimbledon to their first major trophy. The Finnish and British team also triumphed in Stockholm and made the final in Bucharest and Beijing. Heliovaara competed in the Nitto ATP Finals in 2022 with Lloyd Glasspool. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 28 Oct 2024 22:51:00 Z",
    "image": "/-/media/images/news/2024/10/28/22/31/bopanna-ebden-nitto-atp-finals-2024-qualification-graphic.jpg",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "2024 Nitto ATP Finals Qualifications",
      "Nitto ATP Finals",
      "Doubles",
      "2024",
      "Wesley Koolhof",
      "Nikola Mektic",
      "Rohan Bopanna",
      "Matthew Ebden",
      "Kevin Krawietz",
      "Tim Puetz",
      "Harri Heliovaara",
      "Henry Patten"
    ]
  },
  {
    "id": "c1e2f1b2-556f-4947-8192-0aa75a5a0832",
    "title": "Draper out to 'shake up' world's best after key win",
    "link": "https://www.bbc.com/sport/tennis/articles/c8jyyvnn9kzo",
    "description": "In the wake of Jack Draper claiming the biggest title of his career, BBC Sport analyses his transformation over the past 12 months.",
    "author": "",
    "published": "Mon, 28 Oct 2024 11:30:12 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "60a486aa-db64-4875-9599-086b6e9c8258",
    "title": "Halep to stay 'patient' after another comeback loss",
    "link": "https://www.bbc.com/sport/tennis/articles/cjr4283n3d3o",
    "description": "Former Wimbledon champion Simona Halep loses on her latest WTA Tour comeback, having won just once since returning from a doping ban in March.",
    "author": "",
    "published": "Mon, 28 Oct 2024 13:57:28 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "c7c6ab91-5bea-4f3b-9cfe-1535b67d0e9f",
    "title": "The Power and Precision of Giovanni Mpetshi Perricard’s Serve",
    "link": "https://www.perfect-tennis.com/the-power-and-precision-of-giovanni-mpetshi-perricards-serve/",
    "description": "When it comes to dominating on serve, Giovanni Mpetshi Perricard isn’t just knocking on the door—he’s kicking it down. The Frenchman just lifted his first ATP 500 title in Basel, and he’s gone from 205th in the world at the start of the season to 31st in the ATP rankings. Challenger titles in Nottingham, Cuernavaca, …",
    "author": "Jonathan",
    "published": "Mon, 28 Oct 2024 14:43:10 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Tennis News",
      "Tennis Opinions"
    ]
  },
  {
    "id": "e352f4c2-766f-4f41-a1d2-79d83ab620b8",
    "title": "Paris Masters Draw 2024",
    "link": "https://www.perfect-tennis.com/paris-masters-draw-2024/",
    "description": "The final Masters 1000 of the season is here, and coincidentally, it’s the final time that the Paris Masters will be played in Bercy. From 2025, the event will take place 25km to the northwest at the Paris La Défense Arena. The draw occurred Friday at 7.30 pm local time, and Novak Djokovic is not …",
    "author": "Jonathan",
    "published": "Fri, 25 Oct 2024 18:38:38 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Paris Masters",
      "Tennis News"
    ]
  }
]
