[
  {
    "id": "c8c6f9d4-e7f3-48e8-8a32-fce459f06e75",
    "title": "Forehands, titles and what-ifs: How Rafael Nadal broke tennis math",
    "link": "https://www.espn.com/tennis/story/_/id/40211136/2024-french-open-rafael-nadal-broke-tennis-math-stats-titles",
    "description": "As Rafael Nadal announces his upcoming retirement, it's worth remembering just how much he stands out when looking at the raw numbers.",
    "author": "Bill Connelly",
    "published": "Thu, 10 Oct 2024 11:06:47 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "d3e7abc6-25c6-4a23-b082-a0996dfe6d80",
    "title": "'What a career': From Federer to Alcaraz, tributes pour in after Nadal announces retirement",
    "link": "https://www.espn.com/tennis/story/_/id/41716721/rafael-nadal-retirement-roger-federer-coco-gauff-carlos-alcaraz-reaction",
    "description": "Sports stars and more gave Nadal his flowers as the 22-time Grand Slam champion announced that this year's Davis Cup will be his final tournament.",
    "author": "ESPN",
    "published": "Thu, 10 Oct 2024 11:06:43 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "da9f5871-b8c6-41b9-ad5c-9014a5a87bee",
    "title": "The Best Tennis Players Do These 3 Things - Essential Tennis Podcast #412",
    "link": "https://essentialtennis.podbean.com/e/the-best-tennis-players-do-these-3-things-essential-tennis-podcast-412/",
    "description": "If you want to be a great tennis player then you MUST do the three things revealed in this special episode of the Essential Tennis Podcast, PERIOD. The best players on your local courts do them and the weakest ones don’t, so don’t miss any of these insights because they’ll level up your game fast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 30 Aug 2024 22:53:48 -0500",
    "image": "https://mcdn.podbean.com/mf/web/enxkcvxwg2zukxa9/Podcast412.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "b5c132ed-6334-4999-acd6-6e31effe060b",
    "title": "3 Advanced Doubles Tactics - Essential Tennis Podcast #411",
    "link": "https://essentialtennis.podbean.com/e/3-advanced-doubles-tactics-essential-tennis-podcast-411/",
    "description": "If you’re a doubles player looking to take your game to the next level then this is the episode of the Essential Tennis Podcast you've been waiting for. You’re about to learn 3 advanced tactics that will pressure your opponents and win you free points.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 16 Aug 2024 21:57:26 -0500",
    "image": "https://mcdn.podbean.com/mf/web/9ckq8q5efekb42q4/Podcast411.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "815b4423-020f-4ecb-8704-876979757894",
    "title": "Djokovic denied 100th title as Sinner wins in Shanghai",
    "link": "https://www.bbc.com/sport/tennis/articles/c8j72gx3kp1o",
    "description": "Novak Djokovic misses the opportunity to claim the 100th title of his stellar career as Jannik Sinner wins a high-quality Shanghai Masters final.",
    "author": "",
    "published": "Sun, 13 Oct 2024 10:46:58 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "99536bf7-b4b7-474f-a795-df0f59121682",
    "title": "Sabalenka wins third consecutive Wuhan Open final",
    "link": "https://www.bbc.com/sport/tennis/articles/cvglj7r6r11o",
    "description": "Aryna Sabalenka becomes the first player to win the Wuhan Open three times by defeating home hope Zheng Qinwen in Sunday's final.",
    "author": "",
    "published": "Sun, 13 Oct 2024 12:50:15 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "556126e6-3b81-4ff2-a885-6f5289d9ff5e",
    "title": "Sinner dominated this critical area against Djokovic in Shanghai...",
    "link": "https://www.atptour.com/en/news/sinner-djokovic-shanghai-2024-final-brain-game",
    "description": "The start of the point was not the problem for Novak Djokovic. It was the end. Jannik Sinner defeated Djokovic 7-6(4), 6-3 in the final of the Rolex Shanghai Masters on Sunday by winning just five more points (65-60) overall than the Serbian. In a match that showcased parity all over the stats sheet, the Italian dominated one critical area — the ability to finish points off with winners. Winners: Sinner - Aces = 9 - Forehand = 6 - Backhand = 4 - Volleys = 4 - Total = 23 Winners: Djokovic - Aces = 4 - Forehand = 4 - Backhand = 1 - Volleys = 3 - Total = 12 Your 2024 Men's Singles Champion in Shanghai 🏆@janniksin | @SH_RolexMasters | #RolexShanghaiMasters pic.twitter.com/hASdvUH1GS — ATP Tour (@atptour) October 13, 2024 Sinner clubbed 23 winners to Djokovic’s 12. There was no other match stat where such a gap between the two players existed. Both committed 23 unforced errors for the match. Both put 82 per cent of their backhands in play. Djokovic actually put slightly more forehands in the court (86% to 84%) and hit them harder (81 mph to 79 mph) on average throughout the final. But when it came time to finish off the good work building the point, it was Sinner who proved to be twice as good as Djokovic. When isolating baseline points, Sinner collected 10 winners to just five for Djokovic. The Serbian won the battle of longer rallies of nine shots or longer by eight points to six. It proved inconsequential to the final outcome in Shanghai. When Sinner needed to end the point, his movement, shot selection and court position proved superior to the former No. 1 in the PIF ATP Rankings.   One micro-battle that highlighted the strategic advantage Sinner enjoyed in the match can be seen with the first shot hit after the serve, commonly known as Serve +1. Total Serve +1 Forehands - Sinner = 62% (28/45) - Djokovic = 42% (15/36) Sinner Serve +1 Groundstrokes Won - Forehand = 61% (17/28) - Backhand = 53% (9/17) Djokovic Serve +1 Groundstrokes Won - Forehand = 53% (8/15) - Backhand = 52% (11/21) [ATP APP] Sinner dominated with Serve +1 forehands in this match, hitting this shot 62 per cent of the time. Djokovic struggled mightily to find his Serve +1 forehand, only hitting it 42 per cent of the time. Sinner won 61 per cent of his Serve +1 forehand points, while Djokovic was only at 53 per cent. This had a negative flow-on effect for the rest of the point for the Serbian. Too many Serve +1 backhands equals too much baseline parity in Djokovic’s service games. That makes it increasingly more challenging for the Serbian to manufacture winners at the end of the point. Djokovic also turned his attention to the front of the court to apply pressure to Sinner, but this turned out to be one of the rare matches in which Djokovic was not able to build a winning margin at the net. He only won 45% (5/11) points coming forward, while Sinner collected a tidy five of six points won. It is almost 12 months since Djokovic won his last ATP Tour title at the Nitto ATP Finals in Turin last November. At 37 years of age, the recent Paris Olympics gold medalist Djokovic is fast approaching the twilight of his career. This match identifies where his younger opponents will forge an advantage against him. It’s not in building the point. It’s in finishing it. [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 13 Oct 2024 17:57:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Brain Game",
      "Shanghai",
      "2024",
      "Jannik Sinner"
    ]
  },
  {
    "id": "76e5c9eb-5e9a-494f-abae-1ac79ccc3ba2",
    "title": "Sinner on special Shanghai moment: 'I'm going to enjoy this'",
    "link": "https://www.atptour.com/en/news/sinner-reaction-shanghai-2024-final",
    "description": "Jannik Sinner has established himself as a powerhouse on the ATP Tour in 2024, marking his authority at the highest level. In a display that underpinned his standout season, Sinner muscled his way past Novak Djokovic 7-6(4), 6-3 in Sunday’s championship match at the Rolex Shanghai Masters. In claiming his Tour-leading seventh title of 2024, the World No. 1 claimed a personal best 65th win of the season, shining a light on the improvements he has made to his game. “I changed some things. I feel like physically I'm ready to play for a longer amount of time at the highest level possible,” said Sinner, who improved to 8-2 on the season vs. Top-5 players on hard courts. “Mentally I'm ready to accept every tough situation on the court, and I think that's the biggest step I have made forward. “I’m just trying to stay as calm as possible and to keep working hard. It doesn't really matter if you have a good week or a bad week, I’m just trying to improve daily, to be mature enough to understand what's working, and I feel like that for me made a big impact this year, and hopefully it's going to help me also for next year.” The last selfie of the week, now with a trophy in hand 🏆🙂‍↕️@janniksin | @SH_RolexMasters | #RolexShanghaiMasters pic.twitter.com/s3djDV78Fb — ATP Tour (@atptour) October 13, 2024 Sinner, who secured ATP Year-End No. 1 presented by PIF honours after Saturday’s semi-final win against Tomas Machac, held his nerve to improve to 24-8 in tie-breaks in 2024 after sealing the opening set. From there, the Italian clicked into gear to become the youngest Shanghai champion after one hour and 37 minutes. “I’m going to enjoy this,” added Sinner, who became the first player to win three ATP Masters 1000 titles in one season since Rafael Nadal in 2018. “It is a very special moment, winning any tournament is amazing, but especially this one here, so we're going to enjoy it, for sure, but nothing crazy.” Djokovic was bidding to become just the third man to win 100 tour-level titles (Connors, Federer), but came unstuck against the bruising ballstriking of the World No. 1. With his third consecutive victory against Djokovic, Sinner levelled the pair’s Lexus ATP Head2Head series at 4-4. Sinner, who became the first player to win more than six ATP Tour titles in one season since Andy Murray won nine in 2016, credits the nature of his working environment to his prolonged success on the court in 2024. “I will keep working hard, me and my team. I have these two new members in my team where I feel like I can learn many things,” said Sinner, who started working with physio Ulises Badio and fitness trainer Marco Panichi last month. “With Simone [Vagnozzi] and Darren [Cahill], it's a great combination of coaches and the all-around team, it helps me a lot, it's very comfortable to stay with them. “I always feel like it’s part of the family already, so it's nice. We will keep working hard. We're going to try out some new things off the court, just to see what's going to help me or not. I feel like the work there will never stop, so I'm looking forward to that.” [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 13 Oct 2024 15:20:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Match Reaction",
      "Shanghai",
      "Jannik Sinner",
      "Novak Djokovic",
      "2024"
    ]
  },
  {
    "id": "f95b4070-fe64-4cee-be46-7948faf07572",
    "title": "Sinner Defeats Djokovic to Win Shanghai Rolex Masters",
    "link": "https://www.perfect-tennis.com/sinner-defeats-djokovic-to-win-shanghai-rolex-masters/",
    "description": "Jannik Sinner is the 2024 Shanghai Masters champion after defeating Novak Djokovic 7-6(4), 6-3. Another clean performance from him and the typical display of precision hitting that has propelled him to the world’s number-one spot this season. The Italian headed in as the betting favourite, and after a tight first set that resulted in a …",
    "author": "Jonathan",
    "published": "Sun, 13 Oct 2024 14:51:09 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Shanghai Masters",
      "Tennis News"
    ]
  },
  {
    "id": "197718ab-a859-4dd3-8496-6950098f2254",
    "title": "Shanghai Masters 2024 Semi Final Recap",
    "link": "https://www.perfect-tennis.com/shanghai-masters-2024-semi-final-recap/",
    "description": "Jannik Sinner and Novak Djokovic will meet on Sunday’s 2024 Shanghai Rolex Masters final, as both have advanced out of the semi-finals. The pair both went in as heavy favourites, with Sinner dominating this season, racking up 63 wins and Djokovic holding an imperious 9-0 H2H record against Fritz. Sinner was the first to book …",
    "author": "Jonathan",
    "published": "Sat, 12 Oct 2024 14:42:20 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Shanghai Masters",
      "Tennis News"
    ]
  }
]
