[
  {
    "id": "483b30a5-20e9-4ee6-8fc8-4db3d7236bb9",
    "title": "Way-too-early Grand Slam predictions for the rest of 2025",
    "link": "https://www.espn.com/tennis/story/_/id/43568647/way-too-early-grand-slam-predictions-rest-2025",
    "description": "Madison Keys won her first Grand Slam and Jannik Sinner defended his Australian Open title. What does this mean for the rest of the year? We take a look.",
    "author": "D'Arcy Maine",
    "published": "Sun, 26 Jan 2025 16:15:19 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "621523fc-5c31-4245-8baf-b5f5872ab6d3",
    "title": "'He's in a different universe right now': Jannik Sinner's dominance on display at Australian Open",
    "link": "https://www.espn.com/tennis/story/_/id/43568988/australian-open-men-final-winner-jannik-sinner-alexander-zverev",
    "description": "Sinner won his second Australian Open title, cementing his place as the best in the world. Will he get only better from here?",
    "author": "Jake Michaels",
    "published": "Sun, 26 Jan 2025 11:08:23 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "e5cd0e55-04fa-4cd6-af1c-41dee56e6710",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "8eb499a1-2fed-440a-a334-7892bb5e9b99",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "6fb359c4-9be2-4ba9-a011-db0ab016d8e3",
    "title": "Scouting Report: Alcaraz, Djokovic lead stacked field in Doha, Zverev headlines Rio action",
    "link": "https://www.atptour.com/en/news/doha-rio-2025-scouting-report",
    "description": "A host of the ATP Tour’s biggest stars will return to action this week with ATP 500 events taking place in Doha and Rio de Janeiro, respectively. World No. 3 and recent Rotterdam champion Carlos Alcaraz will lead the field at the Qatar ExxonMobil Open in Doha. Two-time Doha titlist Novak Djokovic will also feature in a stacked field at the hard-court event, which has been upgraded to an ATP 500. Alexander Zverev, the No. 2 in the PIF ATP Rankings, and Joao Fonseca continue their quest for success on the South American clay as they lead the charge at the Rio Open presented by Claro. ATPTour.com breaks down five things to watch at each event. FIVE THINGS TO WATCH IN DOHA: 1) Alcaraz’s Doha Debut: The 21-year-old Spaniard will this week make his debut at the ATP 500, where he will be the top seed. Alcaraz holds a 9-1 record this season, including a run to the Australian Open quarter-finals and his first indoor title in Rotterdam. Pitted in the same half of the draw in Doha, Alcaraz would have the possibility to avenge his loss to Djokovic in Melbourne if the two reach the semi-finals. 2) Djokovic Aims For 100th Crown: A two-time titlist in Doha, Djokovic is bidding to join Jimmy Connors (109) and Roger Federer (103) as the only men to clinch 100 tour-level titles. The Serbian will have his work cut out from the outset when he faces 10-time ATP Tour champion Matteo Berrettini in the first round. Djokovic will also accompany former World No. 7 Fernando Verdasco on the doubles court in the Spaniard’s final ATP Tour event. 3) De Minaur’s Doha Quest: After falling to Alcaraz in the Rotterdam final earlier this month, second seed and World No. 6 Alex de Minaur could have the opportunity to earn revenge in Doha. The Australian trails the Spaniard 0-3 in their Lexus ATP Head2Head series, and a fourth meeting at ATP 500 level awaits if both are able to reach the championship match. 4) Medvedev, Rublev Among Former Champions: Top 10 stars Daniil Medvedev and Andrey Rublev triumphed in Doha in 2023 and 2020, respectively. Defending champion Karen Khachanov and two-time winner Roberto Bautista Agut are also in the hunt for more glory at the Qatari event. 5) Arevalo \u0026 Pavic Chase First Title In 2025: Marcelo Arevalo and Mate Pavic clinched ATP Year-End Doubles No. 1 team presented by PIF honours in 2024, and will be seeking their first title of the new season as top seeds in Doha. The Salvadoran-Croatian duo reached the semi-finals in Adelaide and Rotterdam, and the quarter-finals at the Australian Open. [ATP APP] FIVE THINGS TO WATCH IN RIO: 1) Zverev The Man To Stop: Top seed Zverev will aim to bounce back quickly from his quarter-final exit in Buenos Aires last week, where he was defeated by the eventual runner up Francisco Cerundolo in three sets. The German reached his third major final at the Australian Open last month, but will now look to reignite his best form on the clay, where he has won eight of his 23 tour-level titles. 2) More Musetti Magic? Top 20 star Lorenzo Musetti will open against a qualifier in his bid to win a third ATP Tour title, and first since 2022. The Italian was forced to withdraw due to a calf injury prior to his quarter-final clash in Buenos Aires last week and aims to retrieve the level that helped him clinch the bronze medal at the Paris Olympics last year. 3) In-Form Fonseca: Fonseca burst onto the scene 12 months ago in Rio, where he defeated Arthur Fils and Cristian Garin en route to the quarter-finals. The 18-year-old returns to his hometown this week as an ATP Tour champion, having made history in Buenos Aires on Sunday. Fonseca clinched his first tour-level title to become the youngest South American champion in the ATP Tour era (since 1990), and will look to emulate that form on home soil, where he faces Alexandre Muller in the first round. Let’s keep going, Joao 💪 A message from your #ArgOpen2025 Champion 👇@ArgentinaOpen pic.twitter.com/9ijzXOgdk1 — ATP Tour (@atptour) February 16, 2025 4) Can Baez Defend His Title? Sebastian Baez won his maiden ATP 500 title in Rio last year, when he dropped just one set en route to his fifth tour-level crown. The Argentine returns in 2025 with just one tour-level win to his name this season, seeking a big response to his second-round exit at his home ATP 250 in Buenos Aires last week. 5) Former Champs Gonzalez/Molteni Headline Doubles: For the second straight week, Maximo Gonzalez and Andres Molteni will compete as the top seeds. The 2023 Rio champions will aim to reclaim the title and respond to their first-round loss in Buenos Aires last week. [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 16 Feb 2025 23:39:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Scouting Report",
      "Doha",
      "Rio de Janeiro",
      "2025",
      "Carlos Alcaraz",
      "Alexander Zverev",
      "Novak Djokovic"
    ]
  },
  {
    "id": "e2695456-fd7c-43a8-b064-95999e765a27",
    "title": "Fonseca makes history in Buenos Aires, wins first ATP Tour title",
    "link": "https://www.atptour.com/en/news/cerundolo-fonseca-buenos-aires-2025-final",
    "description": "Joao Fonseca’s eye-catching ascent hit new heights on Sunday at the IEB+ Argentina Open in Buenos Aires, where he captured his maiden tour-level title. The 18-year-old Brazilian produced a dazzling performance to defeat fifth seed Francisco Cerundolo 6-4, 7-6(1), becoming the youngest South American to win a title in the ATP Tour era (since 1990). Competing in his first tour-level final, Fonseca twice unsuccessfully served for the match but regrouped in style to sink a fourth Argentine of the week amid a raucous atmosphere in the capital. “Unbelievable week, even in Argentina there are some Brazilians cheering for me,” an emotional Fonseca said. “That’s just amazing. Every Brazilian, everyone from their country wants this support from your own country. For me, this [moment] that I’m living is just unbelievable. “I want to thank my family, my friends and my sponsors for just helping me achieve my dream, which is to play tennis. Of course I want to be No. 1, of course I want to win Slams, titles, but my dream is just to play tennis, and I’m living it.” Joao is NOW 🌟18-year-old prodigy Fonseca is the 10th youngest champion in ATP Tour history@ArgentinaOpen | #ArgOpen2025 pic.twitter.com/OmlB7ocC72— ATP Tour (@atptour) February 16, 2025 One year ago, Fonseca was No. 648 in the PIF ATP Rankings. He has enjoyed a meteoric rise in the 52 weeks since. The teen has begun his 2025 season on a high, winning an ATP Challenger Tour title, upsetting Andrey Rublev as a qualifier at the Australian Open, and now claiming his first ATP Tour trophy. Fonseca was on the brink of defeat in his quarter-final against Mariano Navone, but showed his fighting spirit to save two match points and complete an epic comeback victory. Having won three of his four matches prior to the final in deciding sets, Fonseca may have been fatigued. Yet the teenager found an extra burst of energy to motor through a blistering second-set tie-break against Cerundolo. Sunday’s championship match proved to be a battle between two blistering forehands, and it was Fonseca who was successful in using his own to dictate the baseline exchanges. The Brazilian outhit Cerundolo in their maiden Lexus ATP Head2Head series, striking 26 winners, including 17 from the forehand side, to the Argentine's 16. With his one-hour, 45-minute victory, Fonseca became the 10th-youngest titlist in ATP Tour history. The reigning Next Gen ATP Finals presented by PIF champion will climb to a career-high No. 68 in the PIF ATP Rankings on Monday. Youngest Champions in ATP Tour era (since 1990)  Player  Event  Age  1) Lleyton Hewitt  1998 Adelaide  16y 10m 18d  2) Andrei Medvedev  1992 Genoa  17y 9m 21d  3) Andrei Medvedev  1992 Stuttgart  17y 10m 19d  4) Andrei Medvedev  1992 Bordeaux   18y 20d  5) Kei Nishikori  2008 Delray Beach  18y 1m 19d  6) Rafael Nadal  2004 Sopot  18y 2m 12d  7) Lleyton Hewitt  1999 Delray Beach  18y 2m 15d  8) Carlos Alcaraz  2021 Umag  18y 2m 20d  9) Michael Chang  1990 Toronto  18y 5m 7d  10) Joao Fonseca  2025 Buenos Aires  18y 5m 26d Chasing his fourth ATP Tour title, Buenos Aires-native Cerundolo struggled to contain the heat on his favoured forehand wing. The Argentine misplaced seven forehands in an error-strewn seventh game to give Fonseca an ultimately unassailable lead in the first set. In stark contrast to Fonseca, who struck cleanly from his forehand wing, further errors began to creep back into Cerundolo’s game in the second set. The 26-year-old fired back-to-back forehands wide in the fifth game. Fonseca showed the first signs of nerves when serving out the match at 5-4, and 6-5, but retrieved his level in a commanding tie-break to become the lowest-ranked champion in tournament history (World No. 99). Fonseca became the second-youngest South American to win a title in the Open Era, behind only Guillermo Perez-Roldan, who won Munich, Athens and Buenos Aires in 1987. The 18-year-old gained entry into the ATP 250 in Buenos Aires through the Next Gen Accelerator, which was expanded this year, allowing 20-and-under players ranked in the Top 250 eligibility for one ATP 250 main draw spot and two ATP 250 qualifying events this season. [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 16 Feb 2025 22:12:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Match Report",
      "Buenos Aires",
      "Francisco Cerundolo",
      "Joao Fonseca",
      "2025"
    ]
  },
  {
    "id": "1ff63382-78a0-43fd-abc1-b3487130bf77",
    "title": "Raducanu beats Sakkari in Dubai to end losing run",
    "link": "https://www.bbc.com/sport/tennis/articles/c74e48g35qko",
    "description": "Britain's Emma Raducanu ends her losing run with a straight sets victory over Greece's Maria Sakkari in the first round of the Dubai Tennis Championships.",
    "author": "",
    "published": "Sun, 16 Feb 2025 18:28:53 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "2d6a0679-4374-4df6-bcb5-f0ebf909bdfb",
    "title": "'A dream' - teenager Fonseca wins first ATP Tour title",
    "link": "https://www.bbc.com/sport/tennis/articles/cx2j2y1vrrko",
    "description": "Teenager Joao Fonseca underlines why he is one of tennis' most promising stars by beating Francisco Cerundolo to claim his first ATP Tour title.",
    "author": "",
    "published": "Sun, 16 Feb 2025 21:46:45 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "2ed100d3-be2c-43d9-b79c-d961fe641f80",
    "title": "Sinner Dominates in One Sided Australian Open Final",
    "link": "https://www.perfect-tennis.com/sinner-dominates-in-one-sided-australian-open-final/",
    "description": "Jannik Sinner successfully defended his Australian Open title on Sunday, landing his third Grand Slam commandingly with a 6-3, 7-6(4), 6-3 victory over Alexander Zverev. Sinner was ruthless from the baseline and did not face a single break point throughout the two-hour, 42-minute final. The Italian showed his extra firepower from the outset, which has …",
    "author": "Jonathan",
    "published": "Sun, 26 Jan 2025 15:28:28 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  },
  {
    "id": "07adf55b-2ff2-496b-b506-5c8bb64d28d3",
    "title": "Australian Open 2025 Day 13 Semi Final Recap",
    "link": "https://www.perfect-tennis.com/australian-open-2025-day-13-semi-final-recap/",
    "description": "Jannik Sinner and Alexander Zverev will face off in Sunday’s 2025 Australian Open final after winning their semi-finals on Friday. Alexander Zverev was the first to move into Sunday’s showpiece, defeating Novak Djokovic when the Serb retired after losing the first set on a tiebreak. Novak had not hit a tennis ball since his win …",
    "author": "Jonathan",
    "published": "Fri, 24 Jan 2025 13:42:20 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  }
]
