[
  {
    "id": "93602ecc-2d7b-473f-971e-268cc300bbec",
    "title": "Way-too-early Grand Slam predictions for the rest of 2025",
    "link": "https://www.espn.com/tennis/story/_/id/43568647/way-too-early-grand-slam-predictions-rest-2025",
    "description": "Madison Keys won her first Grand Slam and Jannik Sinner defended his Australian Open title. What does this mean for the rest of the year? We take a look.",
    "author": "D'Arcy Maine",
    "published": "Sun, 26 Jan 2025 16:15:19 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "d9ccaee3-b481-495d-aaa3-29f4239ce441",
    "title": "'He's in a different universe right now': Jannik Sinner's dominance on display at Australian Open",
    "link": "https://www.espn.com/tennis/story/_/id/43568988/australian-open-men-final-winner-jannik-sinner-alexander-zverev",
    "description": "Sinner won his second Australian Open title, cementing his place as the best in the world. Will he get only better from here?",
    "author": "Jake Michaels",
    "published": "Sun, 26 Jan 2025 11:08:23 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "67ffe6d1-c7bb-44fd-9fe0-96c454d02528",
    "title": "Kvitova to resume playing after birth of her son",
    "link": "https://www.bbc.com/sport/tennis/articles/cdxnzqgx47vo",
    "description": "Two-time Wimbledon champion Petra Kvitova announces she will return to tennis in February following a 15-month break during which she gave birth to a son.",
    "author": "",
    "published": "Mon, 03 Feb 2025 16:42:41 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "62c4a807-9816-47cc-a986-2c4e826193b5",
    "title": "Britain's Kartal beaten by Volynets in Abu Dhabi",
    "link": "https://www.bbc.com/sport/tennis/articles/c8xqy52deezo",
    "description": "Great Britain's Sonay Kartal is knocked out in the first round of the Abu Dhabi Open after American Katie Volynets fights back to win in three sets.",
    "author": "",
    "published": "Mon, 03 Feb 2025 15:58:26 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "5066775a-b7a5-41b4-9b90-8fdd525e1f21",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "e464caef-2993-472d-8b7f-ba50a67d6862",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "1ff7bcb6-76de-4ca5-b94a-f42e3588e7fd",
    "title": "Medvedev outlasts Wawrinka in attritional battle in Rotterdam",
    "link": "https://www.atptour.com/en/news/medvedev-wawrinka-rotterdam-2025-monday",
    "description": "Daniil Medvedev was put through his paces Monday, but remains alive upon return to the ABN AMRO Open in Rotterdam. The second seed rallied to an entertaining 6-7(8), 6-4, 6-1 triumph over fellow former champion Stan Wawrinka. Medvedev let slip two set points in the first set, but recovered well to move into the second round at the indoor hard-court ATP 500 in Rotterdam in his first appearance since he won the title in 2023. “When you have some confidence, you win some sets which you should lose. When you don’t have the confidence, you lose some sets which you should win,\" Medvedev said when asked of his reaction to losing the first set. \"I was like ‘I’m not playing so bad at the moment’, so if I continued to push and try to play better it could work out, and I am happy that it did. Hopefully I can play better and better in the next matches. “He played good, but it’s Stan, he always plays good. Of course, he is not at his peak when he was winning Grand Slams. I never played him when he was at this level, and it's a pity because I would love it as a challenge. I am pretty sure there would be some matches where he would chop me, and somewhere I would fight. Stan is also an amazing guy. In my opinion, he is one of the humblest, nicest guys on Tour.” Victorious Meddy 👊 The No. 2 seed completes the comeback against Wawrinka to move into the second round in Rotterdam 👏@abnamroopen | #abnamroopen | @DaniilMedwed pic.twitter.com/p7F98HhOHF — ATP Tour (@atptour) February 3, 2025 Wawrinka, the 2015 titlist in Rotterdam, competed admirably but ultimately ran out of gas as Medvedev cruised across the line. The 28-year-old will next face Italian qualifier Mattia Bellucci. If Medvedev can go on to seal the title this week, it will be his first since the 2023 ATP Masters 1000 in Rome. It would also be the first time that the former World No. 1 has won the same event twice, after his previous 20 titles have all come at different tournaments. Having overcome Medvedev in each of their two previous Lexus ATP Head2Head meetings, Wawrinka was aware of the task ahead and his game plan was evident from the outset. Not only did the 39-year-old engage in the gruelling rallies, but he went after Medvedev with his sustained aggression. Wawrinka fended off a 29-shot set point, which doubled as the longest rally of the opener, by asserting his dominance and finishing the point at the forecourt. He used this pattern of play to trouble Medvedev for much of the 69-minute first set, during which the Swiss player won 12 out of 17 points when at the net, according to Infosys ATP Stats. Medvedev returned from the toilet break he took at the end of the first set as a completely different player. The No. 7 in the PIF ATP Rankings upped his own level of aggression, which began to gradually draw more errors from Wawrinka and drastically reduce his winner count, which fell from 16 to 5 between the two sets. As the encounter wore on, Wawrinka further struggled to rediscover the range that was firing winners from all angles of the court in the first set. Medvedev finished with a flourish in the final set, in which he did not face a single break point, en route to improving to 3-2 in the pair’s Lexus ATP Head2Head series. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 03 Feb 2025 21:16:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Match Report",
      "Rotterdam",
      "2025",
      "Daniil Medvedev",
      "Stan Wawrinka"
    ]
  },
  {
    "id": "4a91cebd-9944-45d9-886b-ffe5076010e3",
    "title": "Burruchaga's battle: Argentine wins second-longest Challenger final in history",
    "link": "https://www.atptour.com/en/news/burruchaga-mena-piracicaba-challenger-2025-final",
    "description": "Roman Andres Burruchaga won’t soon forget his maiden ATP Challenger Tour title run in Piracicaba, Brazil. The 23-year-old spent nearly seven hours on court Sunday, due to heavy rain all week postponing several matches. Burruchaga won a three-hour, two-minute semi-final against home hope Gustavo Heide before returning to court and winning the second-longest Challenger final in history (three hours, 45 minutes). The Argentine saved a championship point, surviving countryman Facundo Mena 7-6(8), 6-7(6), 7-6(4) to lift the Brasil Tennis Challenger trophy. Longest ATP Challenger Tour finals in history (since 1978) Match Event Length Van Assche d. Humbert 2023 Pau 3 hours, 56 minutes Burruchaga d. Mena 2025 Piracicaba 3 hours, 45 minutes Following his triumph, Burruchaga is up to No. 131 in the PIF ATP Rankings, seven spots shy of tying his career high. Cleveland American Colton Smith also captured his first Challenger title at the Cleveland Open, where he downed Eliot Spizzirri 6-4, 6-7(6), 6-3 in the final. The 21-year-old Smith, who is a senior at the University of Arizona, was competing in just his seventh Challenger event. He reached the Sioux Falls Challenger final last October in just his fourth outing at that level. Smith is at a career-high No. 259 in the PIF ATP Rankings. Colton Smith in action at the Cleveland Open. Credit: Samuel Herr Brisbane Australian Tristan Schoolkate scored his second Challenger crown on home soil at the Brisbane QTC Tennis International #1. The 23-year-old arrived at the event following a second-round showing at the Australian Open, where he took a set off eventual champion Jannik Sinner. Only Schoolkate and 13th seed Holger Rune won a set against Sinner in Melbourne. Seeded fifth in Brisbane, Schoolkate defeated Marek Gengel 7-6(3), 7-6(4) in the final. Koblenz World No. 159 Ugo Blanchet survived a dramatic week at the Koblenz Open to lift his second Challenger trophy. The Frenchman needed a deciding set in four of his five matches, including his 6-3, 3-6, 7-6(5) final victory against Italian Luca Nardi, who served for the title at 6-5 in the decider. But the 26-year-old Blanchet held his nerve all week, even saving a match point in his second-round match against Max Hans Rehberg. Ugo Blanchet reigns in Koblenz 👑The Frenchman battles past Nardi 6-3, 3-6, 7-6(5) to claim his second career Challenger title in a thrilling final!#ATPChallenger | @FFTennis pic.twitter.com/ItERklhCaq— ATP Challenger Tour (@ATPChallenger) February 2, 2025",
    "author": "",
    "published": "Mon, 03 Feb 2025 19:33:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Challenger",
      "Piracicaba",
      "Roman Andres Burruchaga",
      "2025"
    ]
  },
  {
    "id": "9b1738b3-c53c-4ab2-9321-067a6aaaa59a",
    "title": "Sinner Dominates in One Sided Australian Open Final",
    "link": "https://www.perfect-tennis.com/sinner-dominates-in-one-sided-australian-open-final/",
    "description": "Jannik Sinner successfully defended his Australian Open title on Sunday, landing his third Grand Slam commandingly with a 6-3, 7-6(4), 6-3 victory over Alexander Zverev. Sinner was ruthless from the baseline and did not face a single break point throughout the two-hour, 42-minute final. The Italian showed his extra firepower from the outset, which has …",
    "author": "Jonathan",
    "published": "Sun, 26 Jan 2025 15:28:28 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  },
  {
    "id": "d201fb3a-229b-47aa-a730-3d1676896968",
    "title": "Australian Open 2025 Day 13 Semi Final Recap",
    "link": "https://www.perfect-tennis.com/australian-open-2025-day-13-semi-final-recap/",
    "description": "Jannik Sinner and Alexander Zverev will face off in Sunday’s 2025 Australian Open final after winning their semi-finals on Friday. Alexander Zverev was the first to move into Sunday’s showpiece, defeating Novak Djokovic when the Serb retired after losing the first set on a tiebreak. Novak had not hit a tennis ball since his win …",
    "author": "Jonathan",
    "published": "Fri, 24 Jan 2025 13:42:20 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Australian Open",
      "Grand Slams",
      "Tennis News"
    ]
  }
]
