{
  "id": "089f5bbf-a0d1-4053-b1ca-81445325d9ad",
  "title": "Ripping up Jaguar history would be 'big mistake', says brand boss",
  "link": "https://www.autocar.co.uk/car-news/new-cars/ripping-jaguar-history-would-be-big-mistake-says-brand-boss",
  "description": "Big step was needed because of move to EVs and arrival of Chinese brands Rawdon Glover reveals why the controversial rebrand was so vital to Jaguar's future Rawdon Glover, managing director of Jaguar, says you can never remind people enough about why the brand had to change. So, from the top, it was due to the fact that Jaguar was “at a pivotal point in its history”, with all its products and platforms coming to the end of the road. While the BMW-rivalling era of Jaguars had been critically well received, they had not done well in the marketplace, so “economically, the Jaguar model didn’t make sense”. Glover said “going south” with Jaguar’s pricing was “not an option” so “instead, partly informed by our history, [we decided] actually we should take Jaguar upmarket. “We should take Jaguar back to a positioning of when it was much more successful in the marketplace and really try and restore that real lustre that the brand definitely had, and we definitely see. “That’s why the brand still has such a strong affinity. But the interesting thing about Jaguar is most of the affinity tends to be with what we’ve done historically, not what we’ve been doing recently.” The decision was taken to move the products upmarket and, with a firm eye on future legislation, to make them all-electric too. In doing both those things, said Glover, “you need to take the brand with you”, hence the rebranding of Jaguar alongside the radically different cars and powertrains. However good the new cars might be, Glover said that in doubling the price of the new Jaguars, “you need to make sure the brand can actually carry it. You need to look at how you manage the brand and all of the experiences associated with that brand.” Before that, said Glover, an “elegant sunset” for winding down the existing Jaguar range is ongoing. While some models are on sale in other global markets, Jaguar no longer has a new car retail presence in the UK. “There’s no real playbook for that, because nobody else has done it before,” he said. “It’s definitely been a really interesting challenge to take that on. We’re quite a long way through it. We will have this period now of ‘breathing space’ to really build the [new] brand, the awareness, the interest, before we actually start taking orders further down the track.” While “there are times in a brand’s life when, particularly if it’s really successful, you tweak with tiny, little incremental changes, and that’s entirely appropriate”, something more drastic was needed for Jaguar because it was not in that position. The move towards EVs and “the increasing threat from Chinese brands” meant a small step would not be appropriate. Glover said: “We needed to make one really big step, because the environment is changing. The competitive set is changing. We think client habits are changing. Across the board, it wasn’t the time for Jaguar to take a little tentative step, which is probably what caught some people off guard in terms of it being a really big step for Jaguar. “But the ‘why’ is really important for me, becausewhen you take in all of those contextual factors, it demands a change of that magnitude.” When that change was first revealed to the world, initially as a rebranding in November and then with the unveiling of the Type 00 concept car a month later, Glover was acutely aware that reaction was at best mixed. (“Some commentators completely got it. Others haven’t. Similarly, some enthusiast groups have got it and others haven’t and we need to take them on that journey.”) But he is unwavering about why this needed to be done. “The team is absolutely unflinching on this: what it’s going to take for Jaguar to succeed and the way that we’re going to do it,” he said. “The design teams, the engineering teams – everybody’s been involved in getting it this far.” Returning to enthusiasts, Glover is frustrated that “messages get filtered” and about the sentiment that this new Jaguar is not for those who have loved and bought into the brand to date. “One example being: ’we are leaving our customers behind; we don’t care about our current customers’. That came from some of the negative commentary. But that was never the intention,” he said. “I can understand how that has been interpreted, because we’re basically saying Jaguar needs to attract a new audience. But that doesn’t mean to say we’re not interested in our current audience. Quite the opposite. [We] want to take as many of that current audience on that journey with us as possible. “We probably could have done a better job in just laying that out and explaining the narrative about why we were making the change, why the change was so dramatic. I think that was probably lost in that story. There’s definitely learning in that process.” Are there comparisons with how JLR reinvented the Land Rover Defender and upset the purists? “It’s definitely a good parallel,” said Glover. “From the experiences in the reaction, and then parallels in what we’re doing. “People ask me with Jaguar how you can completely break production, take a new concept, double the price point and increase the volume. “We’ve already done it. We did exactly that with Defender. We took an icon that was cherished and we reimagined it. Most people would say it’s an authentic Defender. It does what a Defender should do. “It operates at a completely different price point and we’ve tripled the volume and doubled the price point. We’re not looking to triple the Jaguar volume, but it’s an indication that these things can be done.” Much like the Defender reboot before it, the deep passion within Gaydon for its brands’ storied cars will become even more evident closer to launch. When Jaguar starts talking beyond brand and design, said Glover, this “phase of the communication will help enormously” with those who are not convinced about what Jaguar is doing. “There are clearly lots and lots of people out there that love Jaguars and heritage and history of the brand,” he said. “But the people here are exactly the same. “Many people like that are in this organisation. You’re in our head office today in Gaydon and there’s about 20,000 people here. For many, the reason they’re here is because their grandfather worked at Jaguar, their father worked here, and they have an affinity with it and they are deeply passionate about what we do. They care and they also really understand. “I quite often get asked why I’ve cut the umbilical cord with Jaguar’s history, to which my response is [I’ve done] quite the opposite. “We’ve looked at our history and what we’re going to be doing is not a literal interpretation. If you’re looking for a literal interpretation, we’d have just gone and done an E-Type restomod and been rightly criticised. “But if you look at Jaguar’s history and look at those moments in its history when it was really successful and really relevant, culturally, socially, commercially, it’s because it was very, very clear about what it was about. There are some beautiful, iconic vehicles in our history and it’s understanding what was different about those.” While there are nods to previous Jaguars in the design of the Type 00, Glover said “it’s not an E-Type and nor should it be” yet it does have “the essence of the brand” in it. “The essence of the brand is that sense of having the strength of conviction of what we’re doing,” he said. “If everybody else is turning right, maybe we’re okay to turn left. When we’re questioned or challenged about our history, I’m at pains to point out that the spirit of what we’re doing is absolutely in keeping with our history. “What we absolutely haven’t done is just ripped up the past and said we only look forward. It would be a big mistake. What’s happening in the market, with lots and lots of Chinese competitors, if we want to get into a ‘tech fest’ with those brands or a commodity pricing competition, that’s not a game we can win. “But those brands don’t have 90 years of storied history. They don’t have Le Mans wins. They don’t have associations with some of the iconic people that we do. And why would you not want to lean into that from that sense?”",
  "author": "",
  "published": "Wed, 5 Mar 2025 00:05:18 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Mark Tisshaw",
  "length": 6789,
  "excerpt": "Rawdon Glover reveals why the controversial rebrand was so vital to Jaguar's future",
  "siteName": "Autocar",
  "favicon": "",
  "text": "“There’s no real playbook for that, because nobody else has done it before,” he said. “It’s definitely been a really interesting challenge to take that on. We’re quite a long way through it. We will have this period now of ‘breathing space’ to really build the [new] brand, the awareness, the interest, before we actually start taking orders further down the track.” While “there are times in a brand’s life when, particularly if it’s really successful, you tweak with tiny, little incremental changes, and that’s entirely appropriate”, something more drastic was needed for Jaguar because it was not in that position. The move towards EVs and “the increasing threat from Chinese brands” meant a small step would not be appropriate. Glover said: “We needed to make one really big step, because the environment is changing. The competitive set is changing. We think client habits are changing. Across the board, it wasn’t the time for Jaguar to take a little tentative step, which is probably what caught some people off guard in terms of it being a really big step for Jaguar. “But the ‘why’ is really important for me, becausewhen you take in all of those contextual factors, it demands a change of that magnitude.” When that change was first revealed to the world, initially as a rebranding in November and then with the unveiling of the Type 00 concept car a month later, Glover was acutely aware that reaction was at best mixed. (“Some commentators completely got it. Others haven’t. Similarly, some enthusiast groups have got it and others haven’t and we need to take them on that journey.”) But he is unwavering about why this needed to be done. “The team is absolutely unflinching on this: what it’s going to take for Jaguar to succeed and the way that we’re going to do it,” he said. “The design teams, the engineering teams – everybody’s been involved in getting it this far.” Returning to enthusiasts, Glover is frustrated that “messages get filtered” and about the sentiment that this new Jaguar is not for those who have loved and bought into the brand to date. “One example being: ’we are leaving our customers behind; we don’t care about our current customers’. That came from some of the negative commentary. But that was never the intention,” he said. “I can understand how that has been interpreted, because we’re basically saying Jaguar needs to attract a new audience. But that doesn’t mean to say we’re not interested in our current audience. Quite the opposite. [We] want to take as many of that current audience on that journey with us as possible. “We probably could have done a better job in just laying that out and explaining the narrative about why we were making the change, why the change was so dramatic. I think that was probably lost in that story. There’s definitely learning in that process.” Are there comparisons with how JLR reinvented the Land Rover Defender and upset the purists? “It’s definitely a good parallel,” said Glover. “From the experiences in the reaction, and then parallels in what we’re doing. “People ask me with Jaguar how you can completely break production, take a new concept, double the price point and increase the volume. “We’ve already done it. We did exactly that with Defender. We took an icon that was cherished and we reimagined it. Most people would say it’s an authentic Defender. It does what a Defender should do. “It operates at a completely different price point and we’ve tripled the volume and doubled the price point. We’re not looking to triple the Jaguar volume, but it’s an indication that these things can be done.” Much like the Defender reboot before it, the deep passion within Gaydon for its brands’ storied cars will become even more evident closer to launch. When Jaguar starts talking beyond brand and design, said Glover, this “phase of the communication will help enormously” with those who are not convinced about what Jaguar is doing. “There are clearly lots and lots of people out there that love Jaguars and heritage and history of the brand,” he said. “But the people here are exactly the same. “Many people like that are in this organisation. You’re in our head office today in Gaydon and there’s about 20,000 people here. For many, the reason they’re here is because their grandfather worked at Jaguar, their father worked here, and they have an affinity with it and they are deeply passionate about what we do. They care and they also really understand. “I quite often get asked why I’ve cut the umbilical cord with Jaguar’s history, to which my response is [I’ve done] quite the opposite. “We’ve looked at our history and what we’re going to be doing is not a literal interpretation. If you’re looking for a literal interpretation, we’d have just gone and done an E-Type restomod and been rightly criticised. Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. Mark Tisshaw Title: Editor Mark is a journalist with more than a decade of top-level experience in the automotive industry. He first joined Autocar in 2009, having previously worked in local newspapers. He has held several roles at Autocar, including news editor, deputy editor, digital editor and his current position of editor, one he has held since 2017. From this position he oversees all of Autocar’s content across the print magazine, autocar.co.uk website, social media, video, and podcast channels, as well as our recent launch, Autocar Business. Mark regularly interviews the very top global executives in the automotive industry, telling their stories and holding them to account, meeting them at shows and events around the world. Mark is a Car of the Year juror, a prestigious annual award that Autocar is one of the main sponsors of. He has made media appearances on the likes of the BBC, and contributed to titles including What Car?, Move Electric and Pistonheads, and has written a column for The Sun. used cars for sale In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/new-jaguar-logo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003e“There’s no real playbook for that, because nobody else has done it before,” he said. “It’s definitely been a really interesting challenge to take that on. We’re quite a long way through it. We will have this period now of ‘breathing space’ to really build the [new] brand, the awareness, the interest, before we actually start taking orders further down the track.”\u003c/p\u003e\n\u003cp\u003eWhile “there are times in a brand’s life when, particularly if it’s really successful, you tweak with tiny, little incremental changes, and that’s entirely appropriate”, something more drastic was needed for Jaguar because it was not in that position.\u003c/p\u003e\n\u003cp\u003eThe move towards EVs and “the increasing threat from Chinese brands” meant a small step would not be appropriate.\u003c/p\u003e\n\u003cp\u003eGlover said: “We needed to make one really big step, because the environment is changing. The competitive set is changing. We think client habits are changing. Across the board, it wasn’t the time for Jaguar to take a little tentative step, which is probably what caught some people off guard in terms of it being a really big step for Jaguar.\u003c/p\u003e\n\u003cp\u003e“But the ‘why’ is really important for me, becausewhen you take in all of those contextual factors, it demands a change of that magnitude.”\u003c/p\u003e\n\u003cp\u003eWhen that change was first revealed to the world, initially as a rebranding in November and then with the unveiling of the \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/fresh-pictures-jaguar-enters-new-age-radical-type-00-concept\"\u003eType 00 concept car\u003c/a\u003e a month later, Glover was acutely aware that reaction was at best mixed. (“Some commentators completely got it. Others haven’t. Similarly, some enthusiast groups have got it and others haven’t and we need to take them on that journey.”) But he is unwavering about why this needed to be done.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Jaguar copy nothing\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/jaguar-brand-copy-nothing.jpg?itok=bTeGW8S1\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/jaguar-brand-copy-nothing.jpg?itok=bTeGW8S1\"/\u003e\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003e“The team is absolutely unflinching on this: what it’s going to take for Jaguar to succeed and the way that we’re going to do it,” he said. “The design teams, the engineering teams – everybody’s been involved in getting it this far.”\u003c/p\u003e\n\u003cp\u003eReturning to enthusiasts, Glover is frustrated that “messages get filtered” and about the sentiment that this new Jaguar is not for those who have loved and bought into the brand to date.\u003c/p\u003e\n\u003cp\u003e“One example being: ’we are leaving our customers behind; we don’t care about our current customers’. That came from some of the negative commentary. But that was never the intention,” he said.\u003c/p\u003e\n\u003cp\u003e“I can understand how that has been interpreted, because we’re basically saying Jaguar needs to attract a new audience. But that doesn’t mean to say we’re not interested in our current audience. Quite the opposite. [We] want to take as many of that current audience on that journey with us as possible.\u003c/p\u003e\n\u003cp\u003e“We probably could have done a better job in just laying that out and explaining the narrative about why we were making the change, why the change was so dramatic. I think that was probably lost in that story. There’s definitely learning in that process.”\u003c/p\u003e\n\u003cp\u003eAre there comparisons with how JLR reinvented the \u003ca href=\"https://www.autocar.co.uk/car-review/land-rover/defender\"\u003eLand Rover Defender\u003c/a\u003e and upset the purists? “It’s definitely a good parallel,” said Glover. “From the experiences in the reaction, and then parallels in what we’re doing.\u003c/p\u003e\n\u003cp\u003e“People ask me with Jaguar how you can completely break production, take a new concept, double the price point and increase the volume.\u003c/p\u003e\n\u003cp\u003e“We’ve already done it. We did exactly that with Defender. We took an icon that was cherished and we reimagined it. Most people would say it’s an authentic Defender. It does what a Defender should do.\u003c/p\u003e\n\u003cp\u003e“It operates at a completely different price point and we’ve tripled the volume and doubled the price point. We’re not looking to triple the Jaguar volume, but it’s an indication that these things can be done.”\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003e\u003cimg alt=\"Land Rover Defender climbing muddy hill\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/land-rover-defender-review-2024-01-off-road_1.jpg?itok=G_hl7ax0\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/land-rover-defender-review-2024-01-off-road_1.jpg?itok=G_hl7ax0\"/\u003e\u003c/p\u003e\n\u003cp\u003eMuch like the Defender reboot before it, the deep passion within Gaydon for its brands’ storied cars will become even more evident closer to launch. When Jaguar starts talking beyond brand and design, said Glover, this “phase of the communication will help enormously” with those who are not convinced about what Jaguar is doing.\u003c/p\u003e\n\u003cp\u003e“There are clearly lots and lots of people out there that love Jaguars and heritage and history of the brand,” he said. “But the people here are exactly the same.\u003c/p\u003e\n\u003cp\u003e“Many people like that are in this organisation. You’re in our head office today in Gaydon and there’s about 20,000 people here. For many, the reason they’re here is because their grandfather worked at Jaguar, their father worked here, and they have an affinity with it and they are deeply passionate about what we do. They care and they also really understand.\u003c/p\u003e\n\u003cp\u003e“I quite often get asked why I’ve cut the umbilical cord with Jaguar’s history, to which my response is [I’ve done] quite the opposite.\u003c/p\u003e\n\u003cp\u003e“We’ve looked at our history and what we’re going to be doing is not a literal interpretation. If you’re looking for a literal interpretation, we’d have just gone and done an E-Type restomod and been rightly criticised.            \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/mark-tisshaw\"\u003eMark Tisshaw\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/mark-tisshaw\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/dsc_3243.jpg\" width=\"1066\" height=\"1066\" alt=\"mark-tisshaw-autocar\" title=\"Mark Tisshaw\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eEditor \u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eMark is a journalist with more than a decade of top-level experience in the automotive industry. He first joined Autocar in 2009, having previously worked in local newspapers. He has held several roles at Autocar, including news editor, deputy editor, digital editor and his current position of editor, one he has held since 2017.\u003c/p\u003e\n\u003cp\u003eFrom this position he oversees all of Autocar’s content across the print magazine, autocar.co.uk website, social media, video, and podcast channels, as well as our recent launch, \u003ca href=\"https://www.autocar.co.uk/autocar-business\"\u003eAutocar Business\u003c/a\u003e. Mark regularly interviews the very top global executives in the automotive industry, telling their stories and holding them to account, meeting them at shows and events around the world.\u003c/p\u003e\n\u003cp\u003eMark is a \u003ca href=\"https://www.caroftheyear.org/\" target=\"_blank\"\u003eCar of the Year\u003c/a\u003e juror, a prestigious annual award that Autocar is one of the main sponsors of. He has made media appearances on the likes of the BBC, and contributed to titles including \u003ca href=\"https://www.whatcar.com/\" target=\"_blank\"\u003eWhat Car?\u003c/a\u003e, \u003ca href=\"https://www.moveelectric.com\"\u003eMove Electric\u003c/a\u003e and \u003ca href=\"https://www.pistonheads.com/\"\u003ePistonheads\u003c/a\u003e, and has written a column for \u003ca href=\"https://www.thesun.co.uk/motors/19200859/\"\u003eThe Sun\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused   cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogo.png\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "1970-01-01T01:00:00Z",
  "modifiedTime": null
}
