{
  "id": "0a371d06-8a72-4fb7-89d5-58faf994ed8a",
  "title": "Kia India exports one lakh CKD vehicles",
  "link": "https://www.autocarindia.com/industry/kia-india-exports-one-lakh-ckd-vehicles-433659#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Kia India has exported one lakh made-in-India CKD kits of its vehicles to international markets since June 2020, from its only plant in India, located in Anantapur, Andhra Pradesh. India accounts for 50 percent of Kia’s global CKD exports Kia aims to export 38,000 CKD kits from India this year Syros compact SUV will be the next Kia model to be made at India plant Kia India plans to export 38,000 CKD kits this year India accounts for 50 percent of Kia’s global CKD exports. In 2024, Kia India expects to export over 38,000 CKD units to markets such as Uzbekistan, Ecuador, and Vietnam. The company’s exports primarily include the Seltos, Sonet, and Carens, which are heavily localised in India. Kia aims to expand its made-in-India CKD exports to newer markets like the Middle East and Africa, with plans to double export volumes by 2030. Kia India’s Anantapur plant has a manufacturing capacity of 3,00,000 units annually. In addition to exporting CKD kits abroad, the plant supplies vehicles to the domestic market and exports fully built units to select countries. The plant began trial production in early 2019, with the Seltos rolling out for series production in the same year. More recently, the local assembly of the flagship Carnival MPV has also started here with imported kits.  Kia India will introduce the Syros compact SUV in the coming months. Just like the Sonet, Carens, and Seltos, India is likely to serve as a mother plant for the Syros as well. The Syros will go on sale with an ICE powertrain first, followed by an EV a little later. Additionally, there are plans to introduce the Carens facelift and the Carens EV next year, which will be Kia’s first mainstream EV for the Indian market. Also See: Kia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 N Mahindra BE 6e, XEV 9e prices to be revealed on November 26",
  "author": "Akbar Merchant",
  "published": "Mon, 25 Nov 2024 19:02:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Akbar Merchant",
  "length": 1964,
  "excerpt": "Apart from CKD kits, Kia India also exports fully built units of the Seltos, Sonet, and Carens to international markets.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Apart from CKD kits, Kia India also exports fully built units of the Seltos, Sonet, and Carens to international markets. Kia India has exported one lakh made-in-India CKD kits of its vehicles to international markets since June 2020, from its only plant in India, located in Anantapur, Andhra Pradesh.India accounts for 50 percent of Kia’s global CKD exportsKia aims to export 38,000 CKD kits from India this yearSyros compact SUV will be the next Kia model to be made at India plantKia India plans to export 38,000 CKD kits this yearIndia accounts for 50 percent of Kia’s global CKD exports. In 2024, Kia India expects to export over 38,000 CKD units to markets such as Uzbekistan, Ecuador, and Vietnam. The company’s exports primarily include the Seltos, Sonet, and Carens, which are heavily localised in India. Kia aims to expand its made-in-India CKD exports to newer markets like the Middle East and Africa, with plans to double export volumes by 2030.Kia India’s Anantapur plant has a manufacturing capacity of 3,00,000 units annually. In addition to exporting CKD kits abroad, the plant supplies vehicles to the domestic market and exports fully built units to select countries. The plant began trial production in early 2019, with the Seltos rolling out for series production in the same year. More recently, the local assembly of the flagship Carnival MPV has also started here with imported kits. Kia India will introduce the Syros compact SUV in the coming months. Just like the Sonet, Carens, and Seltos, India is likely to serve as a mother plant for the Syros as well. The Syros will go on sale with an ICE powertrain first, followed by an EV a little later. Additionally, there are plans to introduce the Carens facelift and the Carens EV next year, which will be Kia’s first mainstream EV for the Indian market.Also See:Kia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 NMahindra BE 6e, XEV 9e prices to be revealed on November 26ImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241125071134_Kia_India_line_up_1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eApart from CKD kits, Kia India also exports fully built units of the Seltos, Sonet, and Carens to international markets. \u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eKia India has exported one lakh made-in-India CKD kits of its vehicles to international markets since June 2020, from its only plant in India, located in Anantapur, Andhra Pradesh.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eIndia accounts for 50 percent of Kia’s global CKD exports\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eKia aims to export 38,000 CKD kits from India this year\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSyros compact SUV will be the next Kia model to be made at India plant\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia India plans to export 38,000 CKD kits this year\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eIndia accounts for 50 percent of Kia’s global CKD exports. In 2024, Kia India expects to export over 38,000 CKD units to markets such as Uzbekistan, Ecuador, and Vietnam. The company’s exports primarily include the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/seltos\"\u003eSeltos\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/sonet\"\u003eSonet\u003c/a\u003e\u003c/strong\u003e, and \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/carens\"\u003eCarens\u003c/a\u003e\u003c/strong\u003e, which are heavily localised in India. Kia aims to expand its made-in-India CKD exports to newer markets like the Middle East and Africa, with plans to double export volumes by 2030.\u003c/p\u003e\u003cp\u003eKia India’s Anantapur plant has a manufacturing capacity of 3,00,000 units annually. In addition to exporting CKD kits abroad, the plant supplies vehicles to the domestic market and exports fully built units to select countries. The plant began trial production in early 2019, with the Seltos rolling out for series production in the same year. More recently, the local assembly of the flagship \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/carnival\"\u003eCarnival MPV\u003c/a\u003e\u003c/strong\u003e has also started here with imported kits. \u003c/p\u003e\u003cp\u003eKia India will introduce the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-syros-panoramic-sunroof-confirmed-433658\"\u003eSyros compact SUV\u003c/a\u003e\u003c/strong\u003e in the coming months. Just like the Sonet, Carens, and Seltos, India is likely to serve as a mother plant for the Syros as well. The Syros will go on sale with an ICE powertrain first, followed by an EV a little later. Additionally, there are plans to introduce the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-carens-facelift-production-to-start-in-may-2025-433029\"\u003eCarens facelift\u003c/a\u003e\u003c/strong\u003e and the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-carens-ev-spied-in-india-ahead-of-2025-launch-432944\"\u003eCarens EV\u003c/a\u003e\u003c/strong\u003e next year, which will be Kia’s first mainstream EV for the Indian market.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-ev6-gt-to-get-650hp-powertrain-from-hyundai-ioniq-5-n-433631\"\u003e\u003cstrong\u003eKia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 N\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mahindra-be-6e-xev-9e-prices-to-be-revealed-on-november-26-433639\"\u003e\u003cstrong\u003eMahindra BE 6e, XEV 9e prices to be revealed on November 26\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-433659\"\u003e\u003cul id=\"tab-id-433659\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-433659\" href=\"#.\" rel=\"#tab-images-container-433659\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-433659\" href=\"#.\" rel=\"#tab-videos-container-433659\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-25T19:02:00+05:30",
  "modifiedTime": null
}
