{
  "id": "125d58be-8650-492b-a2e3-48285efe76cc",
  "title": "Porsche Taycan Sales Are A Disaster, But Cayenne Saves The Day",
  "link": "https://www.carscoops.com/2024/10/porsche-taycan-sales-down-50-cayenne-saves-the-day/",
  "description": "Deliveries of Porsche's electric sedan dropped 50 percent to just 14,000 from January to September, while Cayenne sales grew 21 percent",
  "author": "Chris Chilton",
  "published": "Sat, 12 Oct 2024 21:22:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Industry",
    "Porsche",
    "Porsche 718",
    "Porsche 911",
    "Porsche Cayenne",
    "Porsche Macan",
    "Porsche Panamera",
    "Porsche Taycan",
    "Reports",
    "Sales"
  ],
  "byline": "Chris Chilton",
  "length": 3941,
  "excerpt": "Deliveries of Porsche's electric sedan dropped 50 percent to just 14,000 from January to September, while Cayenne sales grew 21 percent",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "Deliveries of Porsche's electric sedan dropped 50 percent to just 14,000 from January to September, while Cayenne sales grew 21 percent 4 hours ago by Chris Chilton Global deliveries of the Porsche Taycan slumped 50 percent in the first nine months of 2024 and slid 35 percent in the US. The switchover to a new model is partly to blame, but the 29 percent drop in Porsche’s China sales of all models is a major factor. Total Porsche sales fell 7 percent to 226,026, but the Cayenne was up 21 percent and 718 registrations rallied by 10 percent. The Taycan is giving Porsche’s sales team a major headache. Global deliveries of the electric four-door sedan for the first nine months of 2024 were half that of the corresponding period in 2023, and fell 35 percent in the US, new data from the automaker reveals. Some of the blame goes to the model changeover, Porsche having revealed a facelifted Taycan in the spring that offers only small changes but vastly improved range and performance. And maybe some buyers bought or have ordered the new Macan Electric instead. But a bigger problem for Porsche – and for every other Western brand operating in the Far East – is the collapse of the Chinese market. Worldwide Porsche Sales Porsche’s global output for Jan-Sep slid 7 percent from 226,026 to 242,722, and its number one market, North America, dropped 5 percent to 61,471, while Europe increased its Porsche purchase frequency by 1 percent. But China deliveries went into freefall, shrinking by 29 percent to just 43,280. The country that until recently was Porsche’s biggest market is now in third place behind the US and Europe, and in danger of falling to fourth. Related: Porsche Taycan Recall Means You’re Stuck Charging To 80% Until 2025 Only 14,042 Porsche buyers chose a Taycan in the the first nine months, making it the brand’s least popular model line, even trailing the aging 718 series. And the Taycan’s combustion cousin, the Panamera, also had a rough first three financial quarters of 2024. Sales fell 20 percent to 21,056, Porsche again attributing the drop to a model switchover and a tough situation in China. US Porsche Sales The Macan did even worse, its sales dropping 21 percent (to 55,000), but the 911 inflated its customer base by 2 percent to 39,744 globally. And the 718 Boxster and Cayman grew their sales figures by 10 percent worldwide as buyers rushed to get orders in before the ICE model was deleted in Europe due to cybersecurity rules (it’s still on sale in the US). But moving an extra 1,800 examples of the 718s isn’t what saved Porsche’s Jan-Sep period from being a total disaster. It was the ever-reliable Caynene. The SUV was refreshed in late 2023 and the new lineup – including an S that swapped a boring V6 for a brawny V8 – found 21 percent more customers. Sales totaled 77,686, making it the automaker’s most popular vehicle by a mile. What do you think Porsche needs to do to kickstart Taycan sales? Build a more affordable entry-level car, a more radical redesign, or something else? Drop a comment below and let us know. Porsche Sales By Region",
  "image": "https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-3086558\"\u003e\n            \n            \u003carticle\u003e\n                \u003cdiv\u003e\n                    \u003cheader\u003e\n                        \n                        \u003cp\u003e\n                            Deliveries of Porsche\u0026#39;s electric sedan dropped 50 percent to just 14,000 from January to September, while Cayenne sales grew 21 percent                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003e4 hours ago\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2024/10/Cayenne-Oct1124-copy.webp 2535w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/Cayenne-Oct1124-copy-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/Cayenne-Oct1124-copy-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/Cayenne-Oct1124-copy-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/Cayenne-Oct1124-copy-1536x864.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/Cayenne-Oct1124-copy-2048x1152.webp 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy-1024x576.webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy.webp 2535w, https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy-1536x864.webp 1536w, https://www.carscoops.com/wp-content/uploads/2024/10/Cayenne-Oct1124-copy-2048x1152.webp 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" Porsche Taycan Sales Are A Disaster, But Cayenne Saves The Day\" width=\"2535\" height=\"1426\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/chris-chilton-cc/\"\u003e\u003cspan\u003eChris Chilton\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/header\u003e\n\n                    \u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eGlobal deliveries of the Porsche Taycan slumped 50 percent in the first nine months of 2024 and slid 35 percent in the US.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe switchover to a new model is partly to blame, but the 29 percent drop in Porsche’s China sales of all models is a major factor.\u003c/li\u003e\n\n\n\n\u003cli\u003eTotal Porsche sales fell 7 percent to 226,026, but the Cayenne was up 21 percent and 718 registrations rallied by 10 percent.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eThe \u003ca href=\"https://www.carscoops.com/tag/porsche-taycan/\"\u003eTaycan\u003c/a\u003e is giving Porsche’s sales team a major headache. Global deliveries of the electric four-door sedan for the first nine months of 2024 were half that of the corresponding period in 2023, and fell 35 percent in the US, new data from the automaker reveals.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eSome of the blame goes to the model changeover, Porsche having revealed a \u003ca href=\"https://www.carscoops.com/2024/02/porsche-let-you-go-wild-configuring-your-new-2025-taycan/\"\u003efacelifted Taycan\u003c/a\u003e in the spring that offers only small changes but vastly improved range and performance. And maybe some buyers bought or have ordered the new Macan Electric instead. But a bigger problem for Porsche – and for every other Western brand operating in the Far East – is the collapse of the Chinese market.\u003c/p\u003e\n\n\n\n\u003ch5\u003eWorldwide Porsche Sales\u003c/h5\u003e\n\n\n\n            \n            \n\n\n\u003cp\u003ePorsche’s global output for Jan-Sep slid 7 percent from 226,026 to 242,722, and its number one market, North America, dropped 5 percent to 61,471, while Europe increased its Porsche purchase frequency by 1 percent. But China deliveries went into freefall, shrinking by 29 percent to just 43,280. The country that until recently was Porsche’s biggest market is now in third place behind the US and Europe, and in danger of falling to fourth.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.carscoops.com/2024/10/porsche-tells-taycan-owners-to-charge-up-to-80-until-q1-2025-or-battery-may-short-circuit/\"\u003ePorsche Taycan Recall Means You’re Stuck Charging To 80% Until 2025\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eOnly 14,042 \u003ca href=\"https://www.carscoops.com/tag/porsche/\"\u003ePorsche\u003c/a\u003e buyers chose a Taycan in the the first nine months, making it the brand’s least popular model line, even trailing the aging 718 series. And the Taycan’s combustion cousin, the Panamera, also had a rough first three financial quarters of 2024. Sales fell 20 percent to 21,056, Porsche again attributing the drop to a model switchover and a tough situation in China.\u003c/p\u003e\n\n\n\n\u003ch5\u003eUS Porsche Sales\u003c/h5\u003e\n\n\n\n            \n            \n\n\n\u003cp\u003eThe Macan did even worse, its sales dropping 21 percent (to 55,000), but the 911 inflated its customer base by 2 percent to 39,744 globally. And the 718 Boxster and Cayman grew their sales figures by 10 percent worldwide as buyers rushed to get orders in before the ICE model was deleted in Europe due to cybersecurity rules (it’s still on sale in the US).\u003c/p\u003e\n\n\n\n\u003cp\u003eBut moving an extra 1,800 examples of the 718s isn’t what saved Porsche’s Jan-Sep period from being a total disaster. It was the ever-reliable \u003ca href=\"https://www.carscoops.com/tag/porsche-cayenne/\"\u003eCaynene\u003c/a\u003e. The SUV was refreshed in late 2023 and the new lineup – including an S that swapped a boring V6 for a brawny V8 – found 21 percent more customers. Sales totaled 77,686, making it the automaker’s most popular vehicle by a mile.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat do you think Porsche needs to do to kickstart Taycan sales? Build a more affordable entry-level car, a more radical redesign, or something else? Drop a comment below and let us know.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch5\u003ePorsche Sales By Region\u003c/h5\u003e\n\n\n\n            \n            \n                        \n                    \u003c/div\u003e\n\n                    \n                    \n\n                    \n                    \n                                        \n                    \n                \u003c/div\u003e\n                                \n                \n            \u003c/article\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-12T21:22:00Z",
  "modifiedTime": "2024-10-12T19:16:09Z"
}
