{
  "id": "158c3bd7-bef5-4baf-b619-e44cd6d9f3c6",
  "title": "Hyundai Teases Upcoming Ioniq 6 N",
  "link": "https://www.thetruthaboutcars.com/cars/news-blog/hyundai-teases-upcoming-ioniq-6-n-44514562?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
  "description": "The automaker from Korea will be serving an extra helping of kimchi on the Ioniq 6 when the N variant debuts later this year.",
  "author": "Matthew Guy",
  "published": "Thu, 12 Jun 2025 19:30:00 +0000",
  "source": "https://www.thetruthaboutcars.com/feed/",
  "categories": [
    "News Blog"
  ],
  "byline": "Matthew Guy",
  "length": 2090,
  "excerpt": "The automaker from Korea will be serving an extra helping of kimchi on the Ioniq 6 when the N variant debuts later this year.",
  "siteName": "Ttac",
  "favicon": "https://cdn-fastly.thetruthaboutcars.com/resources/themes/ttac/imgs-responsive/ttac-apple-touch-icon.png",
  "text": "Set to build on the psychotic but tremendous Ioniq 5 N, this swoopy sedan is likely to give a drubbing to other hot EV sedans such as the Tesla Model 3 Performance. While specific power numbers have yet to surface, its hatchback/crossover brother is capable of belting out a maximum of 641 horsepower and 568 lb-ft of torque when the so-called N Grin Boost function is engaged. Thumbing that button allows for a sub-four second 0 - 60 mph acceleration time.Where the Hyundai is likely to have a massive advantage over something like the M3P is in terms of driver engagement. Assuming the engineering team ports Hyundai’s excellent N e-Shift and N Active Sound+ technologies o the Ioniq 6 N, and there’s no reason to imagine it will not, this four-door will rip and snort and fart like a tuned performance car powered by gasoline. The shift program permits the car to emulate a dual-clutch gearbox, allowing aural cues on the track and even introducing noise/vibration/harshness into the equation.Is that the fastest way around a circuit? Probably not. But there’s more to life than retina detaching acceleration in a straight line, a trait common enough to just about every powerful EV, even ones not focused on performance. With those tangible sensations baked into the car, it feels much less like a video game than one might imagine (and initially dismiss as a gimmick). Styling will get a tweak on the Ioniq 6 when it earns the N badge, with Hyundai promising “advanced aerodynamics” and a wide stance. These teaser photos, which have been aggressively brightened for your viewing pleasure (and because your author is blind as a bat these days), reveal no shortage of aero addenda including a big rear wing in addition to what’s already on the car.Look for an official debut of the Hyundai ioniq 6 N at the Goodwood Festival of Speed, a veddy British soirée for gearheads scheduled to take place mid-July.[Images: Hyundai]Become a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by subscribing to our newsletter.",
  "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/06/12/15062/post.jpg?size=1200x628",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"element-160390\"\u003e\n    \u003cp\u003eSet to build on the psychotic but tremendous Ioniq 5 N, this swoopy sedan is likely to give a drubbing to other hot EV sedans such as the Tesla Model 3 Performance. While specific power numbers have yet to surface, its hatchback/crossover brother is capable of belting out a maximum of 641 horsepower and 568 lb-ft of torque when the so-called N Grin Boost function is engaged. Thumbing that button allows for a sub-four second 0 - 60 mph acceleration time.\u003c/p\u003e\u003cp\u003eWhere the Hyundai is likely to have a massive advantage over something like the M3P is in terms of driver engagement. Assuming the engineering team ports Hyundai’s excellent N e-Shift and N Active Sound+ technologies o the Ioniq 6 N, and there’s no reason to imagine it will not, this four-door will rip and snort and fart like a tuned performance car powered by gasoline. The shift program permits the car to emulate a dual-clutch gearbox, allowing aural cues on the track and even introducing noise/vibration/harshness into the equation.\u003c/p\u003e\u003cp\u003eIs that the fastest way around a circuit? Probably not. But there’s more to life than retina detaching acceleration in a straight line, a trait common enough to just about every powerful EV, even ones not focused on performance. With those tangible sensations baked into the car, it feels much less like a video game than one might imagine (and initially dismiss as a gimmick).\u003c/p\u003e\n\u003c/div\u003e\u003cdiv id=\"element-160393\"\u003e\n    \u003cp\u003eStyling will get a tweak on the Ioniq 6 when it earns the N badge, with Hyundai promising “advanced aerodynamics” and a wide stance. These teaser photos, which have been aggressively brightened for your viewing pleasure (and because your author is blind as a bat these days), reveal no shortage of aero addenda including a big rear wing in addition to what’s already on the car.\u003c/p\u003e\u003cp\u003eLook for an official debut of the Hyundai ioniq 6 N at the Goodwood Festival of Speed, a veddy British soirée for gearheads scheduled to take place mid-July.\u003c/p\u003e\u003cp\u003e[Images: Hyundai]\u003c/p\u003e\u003cp\u003e\u003ci\u003eBecome a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by \u003ca href=\"https://email.thetruthaboutcars.com/newsletter-signup/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esubscribing to our newsletter\u003c/a\u003e.\u003c/i\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-12T15:30:00-04:00",
  "modifiedTime": "2025-06-12T15:30:00-04:00"
}
