{
  "id": "16bfb12f-e910-4a84-b23d-8b29a2d0d49c",
  "title": "Jeep Avenger",
  "link": "https://www.autocar.co.uk/car-review/jeep/avenger",
  "description": "The least traditional Jeep gets a hybrid off-roader option that impresses on the rough stuff The Jeep Avenger has to us always felt slightly oxymoronic in its conception as a diddy urban crossover from a brand so intrinsically associated with go-anywhere mud-plugging.The Avenger Electric, mildly electrified eHybrid and pure-petrol variants are competent and charming family runarounds but have little of the off-roading ability of the likes of the larger Wrangler and Grand Cherokee.But now the Avenger can follow its forebears and rangemates at least some way off the beaten track with the addition of this new 4xe range-topper, which adds an off-road-flavoured makeover to the eHybrid, along with an electric motor on the rear axle for four-wheel drive. It is, you might say, the Jeepiest version of the least Jeepy Jeep. This is actually the smallest 4x4 Jeep has offered in about three decades, and while it's far removed from the old CJs and Wranglers that went before, there’s a certain whiff of the WW2 original in the Avenger 4xe’s compact footprint and Scrappy-Doo character. “Lemme at 'em!” it yelps, brandishing its beefier bumpers, roof bars, tow hooks and underbody cladding - the telltale cues to its rugged, range-topping billing and the chief differentiators from the standard eHybrid.It's on sale now in the UK in three trim levels, with prices starting from £30,999, ahead of deliveries beginning in May. But is it the new gem of an expansive Avenger line-up? Read on to find out.",
  "author": "",
  "published": "Mon, 19 May 2025 12:00:00 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Deputy editor Follow:",
  "length": 17058,
  "excerpt": "The least traditional Jeep gets a hybrid off-roader option that impresses on the rough stuff",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The Jeep Avenger has to us always felt slightly oxymoronic in its conception as a diddy urban crossover from a brand so intrinsically associated with go-anywhere mud-plugging. The Avenger Electric, mildly electrified eHybrid and pure-petrol variants are competent and charming family runarounds but have little of the off-roading ability of the likes of the larger Wrangler and Grand Cherokee. But now the Avenger can follow its forebears and rangemates at least some way off the beaten track with the addition of this new 4xe range-topper, which adds an off-road-flavoured makeover to the eHybrid, along with an electric motor on the rear axle for four-wheel drive. It is, you might say, the Jeepiest version of the least Jeepy Jeep.  This is actually the smallest 4x4 Jeep has offered in about three decades, and while it's far removed from the old CJs and Wranglers that went before, there’s a certain whiff of the WW2 original in the Avenger 4xe’s compact footprint and Scrappy-Doo character. “Lemme at 'em!” it yelps, brandishing its beefier bumpers, roof bars, tow hooks and underbody cladding - the telltale cues to its rugged, range-topping billing and the chief differentiators from the standard eHybrid. It's on sale now in the UK in three trim levels, with prices starting from £30,999, ahead of deliveries beginning in May. But is it the new gem of an expansive Avenger line-up? Read on to find out.  Verdict An efficient and effective hybrid with the option of genuine off-road ability GoodGood energy efficiencyThe most well-rounded AvengerBadOther mild hybrids are more engaging to drivePracticality isn't its strong suit DESIGN \u0026 STYLING8 Pros Choice of hybrid and pure-petrol power Cons Slight loss of foot space for passenger behind driver Jeep says it's giving customers the \"freedom of choice\" with the Avenger's threefold powertrain offering: electric, manual petrol and automatic hybrid. Despite their mechanical differences, the e-Hybrid looks virtually identical to the EV. The only noticeable change is the addition of a green ‘e’ badge to denote its electrification. The manual petrol lacks this badging and looks rather plain at the rear, but at least it doesn't lose any of the Avenger's character. It uses a 99bhp 1.2-litre three-cylinder turbo engine to hit 0-62mph in 10.6sec and go on to a top speed of 110mph. Jeep claims an economy figure of 50.4mpg.  As for the e-Hybrid, it's similar to the Alfa Romeo Tonale and other Jeep e-Hybrids in using a beefy mild hybrid system. The same Puretech engine as in the manual is assisted by a 48V hybrid system, a 0.9kWh battery under the passenger's seat and a 28bhp electric motor in the six-speed dual-clutch automatic gearbox. In all, its peak outputs stand at 127bhp and 151lb ft of torque. The 4xe's stickers, cladding and roof bars give it away as the most outdoorsy of the Avengers, along with a 10mm suspension lift, a new multi-link rear suspension set-up for improved articulation, and the addition of some chunkier mud-and-snow tyres - or you can optionally upgrade them to even beefier all-terrains. It's powered by an unusual powertrain that combines that familiar mild-hybridised 1.2-litre triple with a pair of 28bhp electric motors (one at the rear axle, one in the gearbox) for a total output of 143bhp and the capability to split torque output 50:50 across both axles. Both axles are driven at speeds under 18mph, but beyond that the rear motor can be idled when it's not needed to maximise efficiency - which according to WLTP figures is roughly on a par with the front-driven Ford Puma.  Pros Commanding driving positionPlenty of storage Cons Touchscreen is basic and slowBoot is far smaller than rivalsSwitchgear starting to feel a bit out of date Inside, the manual and the e-Hybrid are almost the same as the electric version - save for blue 'e' badges in the EV.  You sit high but have more than enough space and adjustment to find to your preferred driving position and all-round visibility is pretty good.  There's a 7.0in digital instrument cluster behind the steering wheel or a 10.25in one on the top two specification levels. This sits alongside a 10.25in infotainment touchscreen, on which everything is laid out logically and the graphics are crisp enough. Apple CarPlay and Android Auto are also included as standard.  Thankfully, the petrol Avenger is as spacious and practical as the EV. The centre console conceals a large storage area and the door pockets are roomy enough for a typical drinks bottle. The extremely useful shelf in front of the passenger remains in place too. It's not quite as plush as the Kia Niro or Hyundai Kona inside, but the Avenger has its own character, which many drivers might end up preferring. Don't expect especially spacious rear quarters, though, particularly not behind a taller driver. Because the e-Hybrid's battery is positioned underneath the driver's seat, rear foot space is slightly impacted there.  The boot is slightly larger than in the EV, measuring 380 litres instead of 355 litres. It still lags far behind the Kona's 466 litres, though, and the 397 litres of the Toyota Yaris Cross.  It would be nice if the 4xe package extended to a more special treatment in the cabin. The off-roader gets a smattering of badges, some rubber floor mats and a more hard-wearing seat fabric but is otherwise identical to the standard car inside - and while it’s a sensibly arranged and quite comfortable cabin, it does feel a little basic in the context of a range-topper, and some of the physical Stellantis-group switchgear and graphical interfaces are starting to feel their age.  ENGINES \u0026 PERFORMANCE7 Pros Good mid-range power deliveryHandy electric-only driving around town Cons Gruff engine note when pressuredSlow dual-clutch automatic gearbox4xe's extra motor doesn't make itself massively known The e-Hybrid’s engine appears rather measly on paper, and with a 0-62mph sprint of 10.9sec, it won’t be winning any sprint races. But it's torquey off the line, bolstered by an E-Boost feature that adds 40lb ft of torque for an extra push in acceleration.  It also feels gutsier than the figures suggest in the mid-range. Indeed, Jeep says the e-Hybrid offers 30% faster acceleration between 30-60mph than the manual petrol Avenger. You can feel the difference on faster B-roads and motorways. However, the gearbox can disappoint, because it doesn't always shift up or down when you need it to. The set-up can sound quite gruff when you put your foot down too, in marked contrast to the near-slient serenity offered by the Avenger Electric. The e-Hybrid can drive for up to 1km (0.6 miles) on electric power alone, which is more than most mild hybrids but a long way short of a good full hybrid system like Toyota’s. Still, it comes in useful when you're manoeuvring or driving around town, and it’s here where the e-Hybrid excels, offering a refined and quiet driving experience when taking off from a set of lights or trundling through traffic. In the 4xe, even with the assistance of a couple of EV motors, the petrol engine remains a thrashy and strained powerplant when pushing on, and the addition of a bit of extra power doesn’t translate to any great boost in pep: you feel every one of those 9.5 seconds on the way to 62mph. But at lower speeds, it’s a more refined system that manages gearshifts sensibly and transitions between electric and petrol power smoothly and quietly when you’re under way. In keeping with its off-road aspirations, the 4xe is equipped with Snow and Sand \u0026 Mud drive modes with their own gearbox calibrations and traction control settings, while Sport mode liberates the full output from all power sources. Pair this with manual shifts and the most powerful Avenger does a passable impression of a warm hatch on the twistier bits, although it still needs to be worked hard and the more outdoorsy rubber gets a bit scrabbly and screechy if you’re particularly boisterous.  We've yet to sample the manual petrol, but this review will be updated as soon as we get our hands on one.  RIDE \u0026 HANDLING7 Pros Accurate and agileSmooth on faster roadsCompact footprint inspires confidence on tight roads Cons Struggles for composure at lower speedsSome roll in the cornersMore rugged 4xe is prone to rolling and screeching in hard bends Because it doesn't have a large battery, the e-Hybrid is a lot lighter than the EV and its direct steering means it feels light and agile in the corners. It can’t quite match the Ford Puma for agility, though, and tighter corners cause some body roll and lean. It's not entertaining, although it is competent and neat. Its ride is also acceptable, but the gripes we had about the EV are also apparent in the e-Hybrid: the flat seats and lack of lumbar adjustment make themselves known on rougher roads. However, the e-Hybrid is a much better option for long-distance driving. It's smooth at higher speeds, although the suspension can struggle on lumpier surfaces. Around town, it struggles to absorb rigid cracks and bumps. It can get a bit lairy, with larger bumps crashing into the cabin.  Happily, the 4xe's suspension lift doesn’t invite comical amounts of roll in corners and the chassis tweaks do little to dent the Avenger’s commendable cruising refinement and predictable steering. Unfortunately, they also don't do much to improve the slightly busy secondary ride, which means that shoddily finished surfaces – so most British roads – can become slightly tiring after a while.  Naturally, the 4xe is more of a bridleway botherer than a Moab monster, but we were extremely impressed by its performance on a challenging off-road course. It handled severely rutted tracks capably, allowing for the odd knock on the underside and scrape of the skidplate (perhaps a few more milimetres of lift would be welcome) and maintained traction on even the loosest, slipperiest surfaces. Plus, the extra shove from the rear motor meant it could scamper up ascents that you would think possible only in something like the Land Rover Defender.  A low-range function and hill descent control are notable by their absence in the most unforgiving stretches, but only the hardiest of mountaineers would really miss them. MPG \u0026 RUNNING COSTS8 Pros Efficient in town and long-distance drivingMuch lower price than Avenger Electric4xe adds a second driven axle but maintains impressive economy Cons Not as efficient as some rivals officiallyRelated Fiat 600 Hybrid is cheaper The e-Hybrid has some enticing official efficiency figures: 57.6mpg and CO2 emissions of 111g/km. That's a chunk more MPG than the mild-hybrid Puma officially achieves (52mpg), and our test drive yielded a creditable 52.2mpg. Even the 4xe is capable of returning more than 50mpg, according to WLTP figures, which makes it one of the most efficient combustion-engined 4x4s on the market. Yet the real deal-maker is the e-Hybrid’s £26,000 price, which boosts its credibility in a crowded sector. Although it’s more expensive than the pure-petrol Avenger and just beaten by the related Fiat 600 Hybrid, it matches the Puma Hybrid and beats the Peugeot 2008 Hybrid. It’s also almost £10,000 cheaper than the Avenger EV.  Meanwhile, the manual petrol Avenger, which we've yet to test, officially averages 50.4mpg and has an even lower list price of £23,600.  The range-topping Summit version of the front-driven e-Hybrid, which we tested, costs £29,200 and offers 18in wheels, an electrochromatic rear-view mirror, keyless entry, a 180deg reversing camera, automatic headlights, semi-autonomous driving features and a powered tailgate.  The top-rung 4xe meanwhile starts at £30,999 and caps out at £35,000 with the special The North Face Edition.  Verdict An efficient and effective hybrid with the option of genuine off-road ability GoodGood energy efficiencyThe most well-rounded AvengerBadOther mild hybrids are more engaging to drivePracticality isn't its strong suit So, should you choose the Avenger over the Avenger Electric? The e-Hybrid is impressively efficient and just as easy to use around town – all while being £10,000 cheaper and never needing to spend time at a charger. It's arguably the most well-rounded version of the Avenger we’ve tested so far. The 4xe, meanwhile, takes what's great about this little Jeep and adds a hit of genuine off-road ability that massively boosts its use case outside of the city - sacrificing just a little in the way of affordability and refinement. But ultimately, with the likes of the Suzuki Jimny, Suzuki Ignis and Fiat Panda 4x4 no longer available in the UK, the affordable compact off-roader is an endangered breed, so the 4xe is an especially welcome addition to the market. TECHNICAL SPECS Model tested: Jeep Avenger e-Hybrid 4xe Engine: 3 cyls, 1199cc, turbocharged, petrol, plus 48V hybrid system + 2x EV motors Transmission: 6-spd dual-clutch automatic Electric motor/s: 1x gearbox-mounted electric motor, 1x rear axle motor Model tested Jeep Avenger e-Hybrid 4xe Engine 3 cyls, 1199cc, turbocharged, petrol, plus 48V hybrid system + 2x EV motors View all specs and rivals Transmission 6-spd dual-clutch automatic Electric motor/s 1x gearbox-mounted electric motor, 1x rear axle motor Fuel economy 51.4mpg (claimed) Fuel economy 51.4mpg (claimed) Felix Page Felix is Autocar's deputy editor, responsible for leading the brand's agenda-shaping coverage across all facets of the global automotive industry - both in print and online. He has interviewed the most powerful and widely respected people in motoring, covered the reveals and launches of today's most important cars, and broken some of the biggest automotive stories of the last few years.  New Jeep Avenger cars in stock In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/jeep-avenger-4xe-2025-review-front-corner-14.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \n    \u003cdiv\u003e\n\u003cp\u003eThe \u003cstrong\u003eJeep Avenger\u003c/strong\u003e has to us always felt slightly oxymoronic in its conception as a diddy urban \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/top-10-best-crossover-hatchbacks\"\u003ecrossover\u003c/a\u003e from a brand so intrinsically associated with go-anywhere mud-plugging.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/avenger-electric\"\u003eAvenger Electric\u003c/a\u003e, mildly electrified eHybrid and pure-petrol variants are competent and charming family runarounds but have little of the off-roading ability of the likes of the larger \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/wrangler\"\u003eWrangler\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/grand-cherokee\"\u003eGrand Cherokee\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBut now the Avenger can follow its forebears and rangemates at least some way off the beaten track with the addition of this new 4xe range-topper, which adds an off-road-flavoured makeover to the eHybrid, along with an electric motor on the rear axle for four-wheel drive. It is, you might say, the Jeepiest version of the least Jeepy Jeep. \u003c/p\u003e\n\u003cp\u003eThis is actually the smallest 4x4 Jeep has offered in about three decades, and while it\u0026#39;s far removed from the old CJs and Wranglers that went before, there’s a certain whiff of the WW2 original in the Avenger 4xe’s compact footprint and Scrappy-Doo character. “Lemme at \u0026#39;em!” it yelps, brandishing its beefier bumpers, roof bars, tow hooks and underbody cladding - the telltale cues to its rugged, range-topping billing and the chief differentiators from the standard eHybrid.\u003c/p\u003e\u003c/div\u003e\n\n                    \n              \u003cdiv\u003e\n              \u003cdiv\u003e\n\u003cp\u003eIt\u0026#39;s on sale now in the UK in three trim levels, with prices starting from £30,999, ahead of deliveries beginning in May. But is it the new gem of an expansive Avenger line-up? Read on to find out. \u003c/p\u003e\n\n\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eAn efficient and effective hybrid with the option of genuine off-road ability\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eGood energy efficiency\u003c/p\u003e\u003cp\u003eThe most well-rounded Avenger\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOther mild hybrids are more engaging to drive\u003c/p\u003e\u003cp\u003ePracticality isn\u0026#39;t its strong suit\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n            \u003c/div\u003e\n      \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n                                            \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eChoice of hybrid and pure-petrol power\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eSlight loss of foot space for passenger behind driver\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003eJeep says it\u0026#39;s giving customers the \u0026#34;freedom of choice\u0026#34; with the Avenger\u0026#39;s threefold powertrain offering: electric, manual petrol and automatic hybrid.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDespite their mechanical differences, the e-Hybrid looks virtually identical to the EV. The only noticeable change is the addition of a green ‘e’ badge to denote its electrification.\u003c/p\u003e\n\u003cp\u003eThe manual petrol lacks this badging and looks rather plain at the rear, but at least it doesn\u0026#39;t lose any of the Avenger\u0026#39;s character. It uses a \u003cspan\u003e99bhp\u003c/span\u003e 1.2-litre three-cylinder turbo engine to hit 0-62mph in 10.6sec and go on to a top speed of 110mph. Jeep claims an economy figure of 50.4mpg. \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs for the e-Hybrid, it\u0026#39;s similar to the \u003ca href=\"https://www.autocar.co.uk/car-review/alfa-romeo/tonale\"\u003eAlfa Romeo Tonale\u003c/a\u003e and other Jeep e-Hybrids in using a beefy mild hybrid system. T\u003c/span\u003ehe same Puretech engine as in the manual is assisted by a 48V hybrid system, a 0.9kWh battery under the passenger\u0026#39;s seat and a 28bhp electric motor in the six-speed dual-clutch automatic gearbox. In all, its peak outputs stand at 127bhp and 151lb ft of torque.\u003c/p\u003e\n\u003cp\u003eThe 4xe\u0026#39;s stickers, cladding and roof bars give it away as the most outdoorsy of the Avengers, along with a 10mm suspension lift, a new multi-link rear suspension set-up for improved articulation, and the addition of some chunkier mud-and-snow tyres - or you can optionally upgrade them to even beefier all-terrains.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s powered by an unusual powertrain that combines that familiar mild-hybridised 1.2-litre triple with a pair of 28bhp electric motors (one at the rear axle, one in the gearbox) for a total output of 143bhp and the capability to split torque output 50:50 across both axles.\u003c/p\u003e\n\u003cp\u003eBoth axles are driven at speeds under 18mph, but beyond that the rear motor can be idled when it\u0026#39;s not needed to maximise efficiency - which according to WLTP figures is roughly on a par with the front-driven \u003ca href=\"https://www.autocar.co.uk/car-review/ford/puma\"\u003eFord Puma\u003c/a\u003e. \u003c/p\u003e\n\u003c/div\u003e\n                                          \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eCommanding driving position\u003c/p\u003e\u003cp\u003ePlenty of storage\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eTouchscreen is basic and slow\u003c/p\u003e\u003cp\u003eBoot is far smaller than rivals\u003c/p\u003e\u003cp\u003eSwitchgear starting to feel a bit out of date\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eInside, the manual and the e-Hybrid are almost the same as the electric version - save for blue \u0026#39;e\u0026#39; badges in the EV. \u003c/p\u003e\n\u003cp\u003eYou sit high but have more than enough space and adjustment to find to your preferred driving position and all-round visibility is pretty good. \u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s a 7.0in digital instrument cluster behind the steering wheel or a 10.25in one on the top two specification levels. This sits alongside a 10.25in infotainment touchscreen, on which everything is laid out logically and the graphics are crisp enough. \u003ca href=\"https://www.autocar.co.uk/car-news/consumer/what-apple-carplay-and-how-does-it-work\"\u003eApple CarPlay\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-news/consumer/what-android-auto-and-how-does-it-work\"\u003eAndroid Auto\u003c/a\u003e are also included as standard. \u003c/p\u003e\n\u003cp\u003eThankfully, the petrol Avenger is as spacious and practical as the EV. The centre console conceals a large storage area and the door pockets are roomy enough for a typical drinks bottle. The extremely useful shelf in front of the passenger remains in place too.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s not quite as plush as the \u003ca href=\"https://www.autocar.co.uk/car-review/kia/niro\"\u003eKia Niro\u003c/a\u003e or \u003ca href=\"https://www.autocar.co.uk/car-review/hyundai/kona\"\u003eHyundai Kona\u003c/a\u003e inside, but the Avenger has its own character, which many drivers might end up preferring.\u003c/p\u003e\n\u003cp\u003eDon\u0026#39;t expect especially spacious rear quarters, though, particularly not behind a taller driver. Because the e-Hybrid\u0026#39;s battery is positioned underneath the driver\u0026#39;s seat, rear foot space is slightly impacted there. \u003c/p\u003e\n\u003cp\u003eThe boot is slightly larger than in the EV, measuring 380 litres instead of 355 litres. It still lags far behind the Kona\u0026#39;s 466 litres, though, and the 397 litres of the Toyota Yaris Cross. \u003c/p\u003e\n\u003cp\u003eIt would be nice if the 4xe package extended to a more special treatment in the cabin. The off-roader gets a smattering of badges, some rubber floor mats and a more hard-wearing seat fabric but is otherwise identical to the standard car inside - and while it’s a sensibly arranged and quite comfortable cabin, it does feel a little basic in the context of a range-topper, and some of the physical Stellantis-group switchgear and graphical interfaces are starting to feel their age. \u003c/p\u003e\n\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eGood mid-range power delivery\u003c/p\u003e\u003cp\u003eHandy electric-only driving around town\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eGruff engine note when pressured\u003c/p\u003e\u003cp\u003eSlow dual-clutch automatic gearbox\u003c/p\u003e\u003cp\u003e4xe\u0026#39;s extra motor doesn\u0026#39;t make itself massively known\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe e-Hybrid’s engine appears rather measly on paper, and with a 0-62mph sprint of 10.9sec, it won’t be winning any sprint races. But it\u0026#39;s torquey off the line, bolstered by an E-Boost feature that adds 40lb ft of torque for an extra push in acceleration. \u003c/p\u003e\n\u003cp\u003eIt also feels gutsier than the figures suggest in the mid-range. Indeed, Jeep says the e-Hybrid offers 30% faster acceleration between 30-60mph than the manual petrol Avenger.\u003c/p\u003e\n\u003cp\u003eYou can feel the difference on faster B-roads and motorways. However, the gearbox can disappoint, because it doesn\u0026#39;t always shift up or down when you need it to.\u003c/p\u003e\n\u003cp\u003eThe set-up can sound quite gruff when you put your foot down too, in marked contrast to the near-slient serenity offered by the Avenger Electric.\u003c/p\u003e\n\u003cp\u003eThe e-Hybrid can drive for up to 1km (0.6 miles) on electric power alone, which is more than most mild hybrids but a long way short of a good full hybrid system like \u003ca href=\"https://www.autocar.co.uk/car-review/toyota\"\u003eToyota\u003c/a\u003e’s.\u003c/p\u003e\n\u003cp\u003eStill, it comes in useful when you\u0026#39;re manoeuvring or driving around town, and it’s here where the e-Hybrid excels, offering a refined and quiet driving experience when taking off from a set of lights or trundling through traffic.\u003c/p\u003e\n\u003cp\u003eIn the 4xe, even with the assistance of a couple of EV motors, the petrol engine remains a thrashy and strained powerplant when pushing on, and the addition of a bit of extra power doesn’t translate to any great boost in pep: you feel every one of those 9.5 seconds on the way to 62mph. But at lower speeds, it’s a more refined system that manages gearshifts sensibly and transitions between electric and petrol power \u003cspan\u003esmoothly and quietly \u003c/span\u003ewhen you’re under way.\u003c/p\u003e\n\u003cp\u003eIn keeping with its off-road aspirations, the 4xe is equipped with Snow and Sand \u0026amp; Mud drive modes with their own gearbox calibrations and traction control settings, while Sport mode liberates the full output from all power sources.\u003c/p\u003e\n\u003cp\u003ePair this with manual shifts and the most powerful Avenger does a passable impression of a warm hatch on the twistier bits, although it still needs to be worked hard and the more outdoorsy rubber gets a bit scrabbly and screechy if you’re particularly boisterous. \u003c/p\u003e\n\u003cp\u003eWe\u0026#39;ve yet to sample the manual petrol, but this review will be updated as soon as we get our hands on one. \u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\u003cdiv data-id=\"ride\" id=\"chapter-ride\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eRIDE \u0026amp; HANDLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eAccurate and agile\u003c/p\u003e\u003cp\u003eSmooth on faster roads\u003c/p\u003e\u003cp\u003eCompact footprint inspires confidence on tight roads\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eStruggles for composure at lower speeds\u003c/p\u003e\u003cp\u003eSome roll in the corners\u003c/p\u003e\u003cp\u003eMore rugged 4xe is prone to rolling and screeching in hard bends\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eBecause it doesn\u0026#39;t have a large battery, the e-Hybrid is a lot lighter than the EV and its direct steering means it feels light and agile in the corners.\u003c/p\u003e\n\u003cp\u003eIt can’t quite match the Ford Puma for agility, though, and tighter corners cause some body roll and lean. It\u0026#39;s not entertaining, although it is competent and neat.\u003c/p\u003e\n\u003cp\u003eIts ride is also acceptable, but the gripes we had about the EV are also apparent in the e-Hybrid: the flat seats and lack of lumbar \u003cspan\u003eadjustment \u003c/span\u003emake themselves known on rougher roads.\u003c/p\u003e\n\u003cp\u003eHowever, the e-Hybrid is a much better option for long-distance driving. It\u0026#39;s smooth a\u003cspan\u003et higher speeds\u003c/span\u003e, although the suspension can struggle on lumpier surfaces. Around town, it struggles to absorb rigid cracks and bumps. It can get a bit lairy, with larger bumps crashing into the cabin. \u003c/p\u003e\n\u003cp\u003eHappily, the 4xe\u0026#39;s suspension lift doesn’t invite comical amounts of roll in corners and the chassis tweaks do little to dent the Avenger’s commendable cruising refinement and predictable steering. Unfortunately, they also don\u0026#39;t do much to improve the slightly busy secondary ride, which means that shoddily finished surfaces – so most British roads – can become slightly tiring after a while. \u003c/p\u003e\n\u003cp\u003eNaturally, the 4xe is more of a bridleway botherer than a Moab monster, but we were extremely impressed by its performance on a challenging off-road course. It handled severely rutted tracks capably, allowing for the odd knock on the underside and scrape of the skidplate (perhaps a few more milimetres of lift would be welcome) and maintained traction on even the loosest, slipperiest surfaces. Plus, the extra shove from the rear motor meant it could scamper up ascents that you would think possible only in something like the \u003ca href=\"https://www.autocar.co.uk/car-review/land-rover/defender\"\u003eLand Rover Defender\u003c/a\u003e. \u003c/p\u003e\n\u003cp\u003eA low-range function and hill descent control are notable by their absence in the most unforgiving stretches, but only the hardiest of mountaineers would really miss them.\u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n \n\n \n\u003cdiv data-id=\"mpg\" id=\"chapter-mpg\"\u003e\n                                    \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eMPG \u0026amp; RUNNING COSTS\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eEfficient in town and long-distance driving\u003c/p\u003e\u003cp\u003eMuch lower price than Avenger Electric\u003c/p\u003e\u003cp\u003e4xe adds a second driven axle but maintains impressive economy\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eNot as efficient as some rivals officially\u003c/p\u003e\u003cp\u003eRelated Fiat 600 Hybrid is cheaper\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe e-Hybrid has some enticing official efficiency figures: 57.6mpg and CO2 emissions of 111g/km. That\u0026#39;s a chunk more MPG than the mild-hybrid Puma officially achieves (52mpg), and our test drive yielded a creditable 52.2mpg.\u003c/p\u003e\n\u003cp\u003eEven the 4xe is capable of returning more than 50mpg, according to WLTP figures, which makes it one of the most efficient combustion-engined 4x4s on the market.\u003c/p\u003e\n\u003cp\u003eYet the real deal-maker is the e-Hybrid’s £26,000 price, which boosts its credibility in a crowded sector.\u003c/p\u003e\n\u003cp\u003eAlthough it’s more expensive than the pure-petrol Avenger and just beaten by the related Fiat 600 Hybrid\u003cspan\u003e,\u003c/span\u003e it matches the Puma Hybrid and beats the \u003ca href=\"https://www.autocar.co.uk/car-review/peugeot/2008\"\u003ePeugeot 2008\u003c/a\u003e Hybrid. It’s also almost £10,000 cheaper than the Avenger EV. \u003c/p\u003e\n\u003cp\u003eMeanwhile, the manual petrol Avenger, which we\u0026#39;ve yet to test, officially averages 50.4mpg and has an even lower list price of £23,600. \u003c/p\u003e\n\u003cp\u003eThe range-topping Summit version of the front-driven e-Hybrid, which we tested, costs £29,200 and offers 18in wheels, an electrochromatic rear-view mirror, keyless entry, a 180deg reversing camera, automatic headlights, semi-autonomous driving features and a powered tailgate. \u003c/p\u003e\n\u003cp\u003eThe top-rung 4xe meanwhile starts at £30,999 and caps out at £35,000 with the special The North Face Edition. \u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n         \u003cdiv\u003e\n                                    \n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eAn efficient and effective hybrid with the option of genuine off-road ability\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eGood energy efficiency\u003c/p\u003e\u003cp\u003eThe most well-rounded Avenger\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOther mild hybrids are more engaging to drive\u003c/p\u003e\u003cp\u003ePracticality isn\u0026#39;t its strong suit\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eSo, should you choose the Avenger over the Avenger Electric? The \u003cspan\u003ee-Hybrid\u003c/span\u003e is impressively efficient and just as easy to use around town – all while being £10,000 cheaper and never needing to spend time at a charger. It\u0026#39;s arguably the most well-rounded version of the Avenger we’ve tested so far.\u003c/p\u003e\n\u003cp\u003eThe 4xe, meanwhile, takes what\u0026#39;s great about this little Jeep and adds a hit of genuine off-road ability that massively boosts its use case outside of the city - sacrificing just a little in the way of affordability and refinement. But ultimately, with the likes of the \u003ca href=\"https://www.autocar.co.uk/car-review/suzuki/jimny\"\u003eSuzuki Jimny\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/suzuki/ignis\"\u003eSuzuki Ignis\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/fiat/panda\"\u003eFiat Panda\u003c/a\u003e 4x4 no longer available in the UK, the affordable compact off-roader is an endangered breed, so the 4xe is an especially welcome addition to the market.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n                      \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003e\u003ch2\u003eTECHNICAL SPECS\u003c/h2\u003e\u003c/p\u003e\n    \u003cdiv\u003e\n      \n      \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/thumbnail/public/jeep-avenger-4xe-2025-review-front-corner-14.jpg?itok=h1E33v59\" alt=\"Jeep Avenger 4xe 2025 Review front corner 14\"/\u003e\u003c/p\u003e            \u003cdiv\u003e\n              \u003cp\u003eModel tested:\u003c/p\u003e\n              \u003cp\u003eJeep Avenger e-Hybrid 4xe\u003c/p\u003e\n            \u003c/div\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n              \u003cp\u003eEngine:\u003c/p\u003e\n              \u003cp\u003e3 cyls, 1199cc, turbocharged, petrol, plus 48V hybrid system + 2x EV motors\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eTransmission:\u003c/p\u003e\n              \u003cp\u003e6-spd dual-clutch automatic\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eElectric motor/s:\u003c/p\u003e\n              \u003cp\u003e1x gearbox-mounted electric motor, 1x rear axle motor\u003c/p\u003e\n            \u003c/div\u003e\n                \n                \n\n      \u003c/div\u003e\n      \n      \n      \u003cdiv\u003e\n                          \u003cdiv\u003e\n              \u003cp\u003eModel tested\u003c/p\u003e\n                              \u003cp\u003eJeep Avenger e-Hybrid 4xe\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eEngine\u003c/p\u003e\n                              \u003cp\u003e3 cyls, 1199cc, turbocharged, petrol, plus 48V hybrid system + 2x EV motors\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                      \u003cp\u003eView all specs and rivals\u003c/p\u003e\n                                      \u003cdiv\u003e\n              \u003cp\u003eTransmission\u003c/p\u003e\n                              \u003cp\u003e6-spd dual-clutch automatic\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eElectric motor/s\u003c/p\u003e\n                              \u003cp\u003e1x gearbox-mounted electric motor, 1x rear axle motor\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eFuel economy\u003c/p\u003e\n                              \u003cp\u003e51.4mpg (claimed)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                  \u003c/div\u003e\n              \n          \u003c/div\u003e\n    \n      \u003c/div\u003e\n  \n    \u003cdiv\u003e\n            \u003cp\u003eFuel economy\u003c/p\u003e\n            \u003cp\u003e51.4mpg (claimed)\u003c/p\u003e\n          \u003c/div\u003e\n    \n\u003c/div\u003e\n\u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/felix-page\"\u003eFelix Page\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\u003cp\u003eFelix is Autocar\u0026#39;s deputy editor, responsible for leading the brand\u0026#39;s agenda-shaping coverage across all facets of the global automotive industry - both in print and online.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eHe has interviewed the most powerful and widely respected people in motoring, covered the reveals and launches of today\u0026#39;s most important cars, and broken some of the biggest automotive stories of the last few years. \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n        \u003ch2\u003eNew Jeep Avenger cars in stock\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogo.png\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n                            \u003c/div\u003e\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": null,
  "modifiedTime": null
}
