{
  "id": "19ae06d6-6b59-4679-9415-d84883f7de56",
  "title": "Filing A $100K Insurance Claim Works Better If You’re Actually In Your Porsche",
  "link": "https://www.carscoops.com/2025/07/porsche-crash-dashcam-lawsuit-collapse-exposed/",
  "description": "This case serves as an important reminder of just how important dashcams are",
  "author": "Brad Anderson",
  "published": "Mon, 14 Jul 2025 01:01:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Accidents",
    "Offbeat News",
    "Police",
    "Porsche",
    "Porsche 911",
    "Porsche Videos",
    "Trucks",
    "Video"
  ],
  "byline": "Brad Anderson",
  "length": 3466,
  "excerpt": "This case serves as an important reminder of just how important dashcams are",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "This case serves as an important reminder of just how important dashcams are July 13, 2025 at 21:01 by Brad Anderson A Porsche 911 driver sought nearly $100,000 in damages for a 2022 highway crash. Lawyers dropped the case after video footage revealed the claim was fabricated. The dashcam showed the driver hiding behind a sign, not seated inside the parked car. What started as a routine roadside stop turned into a legal mess for one Porsche driver in the UK. On August 19, 2022, 33-year-old Terrell Brooks claimed he was injured when his bright blue 911 Carrera GTS was struck by a truck while parked on the shoulder of the A13 motorway. But dashcam footage told a different story, and one that quickly unraveled his case at that. Watch: See A Shocking Video Of Porsche And BMW Collide In Fiery Nurburgring Crash Instead of being inside the Porsche at the time of the crash, Brooks was reportedly seen crouching behind a large road sign, far from the driver’s seat. The footage, recorded from a dashcam inside the truck, cast serious doubt on his version of events. A High-Value Claim Meets a Hard Stop Brooks had been seeking a hefty payout for the crash. Not only was he asking for £63,433 (about $86,000 at current exchange rates) for the alleged damage done to his 911, but also £5,000 ($6,800) for injuries, £2,400 ($3,200) for medical treatment, and €3,374 ($4,600) for loss of earnings. He probably thought he could get an easy payday from AXA UK, the insurer of the truck that hit his Porsche. What he may not have anticipated was that the truck was equipped with a dashcam. Once the footage surfaced, the outcome was swift. According to the Mirror, as soon as his legal representatives saw the footage, they withdrew the case. The lawyers acknowledged that Brooks and his passenger had knowingly provided false accounts to insurers. Brooks then promptly discontinued the claim and agreed to cover the legal costs of £4,000 ($5,400) for AXA UK “Mr Brooks claimed he was sitting in his Porsche, belted up and injured,” stated Clyde \u0026 Co, the law firm representing AXA UK. “The dashcam showed him in the bushes. We still don’t know what he was doing there – but we do know he wasn’t in the car. His story fell apart the moment the truth came to light. In every sense, the claim was caught short.” Dashcam footage from the truck has since been shared online. It shows the blue 911 parked to the side of the road with its hazard lights flashing. While it appears as though the truck driver had plenty of time to react to the stopped car, they only appear to have swerved at the very last moment to avoid a direct collision. The extent of the damage done to the Carrera GTS remains unclear.",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                        \u003cp\u003e\n                            This case serves as an important reminder of just how important dashcams are                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003eJuly 13, 2025 at 21:01\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/07/rewqgtrvfh65ty.webp 2500w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/rewqgtrvfh65ty-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/rewqgtrvfh65ty-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/rewqgtrvfh65ty-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/rewqgtrvfh65ty-1536x864.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/rewqgtrvfh65ty-2048x1152.webp 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty.jpg 2500w, https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty-768x432.jpg 768w, https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty-1536x864.jpg 1536w, https://www.carscoops.com/wp-content/uploads/2025/07/rewqgtrvfh65ty-2048x1152.jpg 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" Filing A $100K Insurance Claim Works Better If You’re Actually In Your Porsche\" width=\"2500\" height=\"1406\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/bradcarscoops-com/\"\u003e\u003cspan\u003eBrad Anderson\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/div\u003e\u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eA Porsche 911 driver sought nearly $100,000 in damages for a 2022 highway crash.\u003c/li\u003e\n\n\n\n\u003cli\u003eLawyers dropped the case after video footage revealed the claim was fabricated.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe dashcam showed the driver hiding behind a sign, not seated inside the parked car.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eWhat started as a routine roadside stop turned into a legal mess for one Porsche driver in the UK. On August 19, 2022, 33-year-old Terrell Brooks claimed he was injured when his bright blue \u003ca href=\"https://www.carscoops.com/2025/07/two-year-old-porsche-911-gts-sold-for-nearly-gt3-money/\"\u003e911 Carrera GTS\u003c/a\u003e was struck by a truck while parked on the shoulder of the A13 motorway. But dashcam footage told a different story, and one that quickly unraveled his case at that.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003e\u003cstrong\u003eWatch: \u003ca href=\"https://www.carscoops.com/2025/07/porsche-911-gt3-rs-explodes-in-scary-nurburgring-crash-with-bmw-m2/\"\u003eSee A Shocking Video Of Porsche And BMW Collide In Fiery Nurburgring Crash\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eInstead of being inside the \u003ca href=\"https://www.carscoops.com/tag/porsche/\"\u003ePorsche\u003c/a\u003e at the time of the crash, Brooks was reportedly seen crouching behind a large road sign, far from the driver’s seat. The footage, recorded from a dashcam inside the truck, cast serious doubt on his version of events.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eA High-Value Claim Meets a Hard Stop\u003c/strong\u003e\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003eBrooks had been seeking a hefty payout for the crash. Not only was he asking for £63,433 (about $86,000 at current exchange rates) for the alleged damage done to his 911, but also £5,000 ($6,800) for injuries, £2,400 ($3,200) for medical treatment, and €3,374 ($4,600) for loss of earnings. He probably thought he could get an easy payday from AXA UK, the \u003ca href=\"https://www.carscoops.com/tag/insurance/\"\u003einsurer\u003c/a\u003e of the truck that hit his Porsche.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat he may not have anticipated was that the truck was equipped with a dashcam. Once the footage surfaced, the outcome was swift. According to the \u003ca href=\"https://www.mirror.co.uk/news/uk-news/porsche-driver-denied-74k-crash-35524169\"\u003e\u003cem\u003eMirror\u003c/em\u003e\u003c/a\u003e, as soon as his legal representatives saw the footage, they withdrew the case.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe lawyers acknowledged that Brooks and his passenger had knowingly provided false accounts to insurers. Brooks then promptly discontinued the claim and agreed to cover the legal costs of £4,000 ($5,400) for AXA UK\u003c/p\u003e\n\n\n\n\u003cp\u003e“Mr Brooks claimed he was sitting in his Porsche, belted up and injured,” stated Clyde \u0026amp; Co, the law firm representing AXA UK. “The dashcam showed him in the bushes. We still don’t know what he was doing there – but we do know he wasn’t in the car. His story fell apart the moment the truth came to light. In every sense, the claim was caught short.”\u003c/p\u003e\n\n\n\n\u003cp\u003eDashcam footage from the truck has since been shared online. It shows \u003ca href=\"https://www.carscoops.com/tag/porsche-911/\"\u003ethe blue 911\u003c/a\u003e parked to the side of the road with its hazard lights flashing. While it appears as though \u003ca href=\"https://www.carscoops.com/2024/07/fatal-dodge-challenger-crash-highlights-need-for-attention-behind-the-wheel/\"\u003ethe truck driver\u003c/a\u003e had plenty of time to react to the stopped car, they only appear to have swerved at the very last moment to avoid a direct collision. The extent of the damage done to the Carrera GTS remains unclear.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-13T21:01:00-04:00",
  "modifiedTime": "2025-07-13T20:07:55Z"
}
