{
  "id": "23626da9-d1d2-49c2-a1f9-104d31563071",
  "title": "Volvo software boss to join free Autocar-Siemens webinar on 25 June",
  "link": "https://www.autocar.co.uk/car-news/consumer/volvo-software-boss-join-free-autocar-siemens-webinar-25-june",
  "description": "We're partnering with Siemens, 2025 Autocar Awards sponsor, to explore how software will change the car world Technology giant Siemens has been named as the sponsor of the 2025 Autocar Awards, which will celebrate the people and organisations shaping the future of automotive - as well as the best cars on sale. This year's awards ceremony takes place on 24 June, where Autocar and Siemens will name the industry's most innovative and impactful individuals, and provide a platform for them to tell their stories.  As part of Autocar's collaboration with Siemens, the two brands will also host a free, interactive webinar on 25 June in which we will delve into how software is defining the future of automotive. As its role in vehicle development and functionality becomes ever-more important, there are huge questions over what software means for how we use our cars - and what the future holds. Siemens is a technology leader with a significant influence on the mobility sphere so is well placed to help answer those questions and reveal the full potential of software in this space. How can manufacturers upgrade cars post-purchase? Does your car have untapped technological potential built in already? What is a software-defined vehicle? These are just some of the questions we’ll seek to answer in our free webinar on Wednesday 25 June from 14:00-15:00. Join Siemens head of automotive, battery and mobility Uday Senapati, Volvo Cars software engineering boss Alwin Bakkenes, Autocar deputy editor Felix Page and another special industry guest – to be announced in the coming weeks – for an insightful and interactive deep-dive into the world of automotive software. Mark Tisshaw, Autocar editor, said: “Throughout our collaboration with Siemens, it has become clear just how deeply connected the company is to the automotive industry and how influential its relationships are at every level. “We are thrilled to partner with Siemens to tell the stories of the industry's most impressive individuals and companies at this year's Autocar Awards ceremony and to hear how the company's insights and expertise are shaping the future of the car in our upcoming webinar.” The webinar will be broadcast live on Wednesday 25 June from 14:00-15:00, with the opportunity to put questions to our expert guests. Sign up here to watch for free Meet the panellists  Uday Senapati As head of automotive, battery and mobility for the EMEA region at Siemens Advanta, Uday is helping to expand the company's portfolio f consulting and implementation services for the e-mbobility industry.  Having worked at General Motors, JLR, Bentley and Group Lotus, he has a wealth of automotive experience that he will leverage in his efforts to establish Siemens as a leading consulting and integration partner for the increasing number of businesses making a strategy shift towards electric mobility.  Alwin Bakkenes Alwin is head of software engineering and R\u0026D at Volvo Cars. He leads the team responsible for development of the technology stack at the heart of Volvo's in-car systems and wider user experience. He has experience in product strategy and programme execution that helps guide Volvo's development of next-level safety technology - working towards autonomy and a software-defined platform.",
  "author": "",
  "published": "Thu, 5 Jun 2025 14:41:27 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Autocar",
  "length": 2260,
  "excerpt": "We're partnering with Siemens, 2025 Autocar Awards sponsor, to explore how software will change the car world",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Technology giant Siemens has been named as the sponsor of the 2025 Autocar Awards, which will celebrate the people and organisations shaping the future of automotive - as well as the best cars on sale. This year's awards ceremony takes place on 24 June, where Autocar and Siemens will name the industry's most innovative and impactful individuals, and provide a platform for them to tell their stories.  As part of Autocar's collaboration with Siemens, the two brands will also host a free, interactive webinar on 25 June in which we will delve into how software is defining the future of automotive. As its role in vehicle development and functionality becomes ever-more important, there are huge questions over what software means for how we use our cars - and what the future holds. Siemens is a technology leader with a significant influence on the mobility sphere so is well placed to help answer those questions and reveal the full potential of software in this space. How can manufacturers upgrade cars post-purchase? Does your car have untapped technological potential built in already? What is a software-defined vehicle? These are just some of the questions we’ll seek to answer in our free webinar on Wednesday 25 June from 14:00-15:00. Join Siemens head of automotive, battery and mobility Uday Senapati, Volvo Cars software engineering boss Alwin Bakkenes, Autocar deputy editor Felix Page and another special industry guest – to be announced in the coming weeks – for an insightful and interactive deep-dive into the world of automotive software. Mark Tisshaw, Autocar editor, said: “Throughout our collaboration with Siemens, it has become clear just how deeply connected the company is to the automotive industry and how influential its relationships are at every level. “We are thrilled to partner with Siemens to tell the stories of the industry's most impressive individuals and companies at this year's Autocar Awards ceremony and to hear how the company's insights and expertise are shaping the future of the car in our upcoming webinar.” The webinar will be broadcast live on Wednesday 25 June from 14:00-15:00, with the opportunity to put questions to our expert guests. Sign up here to watch for free Meet the panellists  Uday Senapati",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/acbus_siemens_738_x_492.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eTechnology giant Siemens has been named as the sponsor of the 2025 \u003ca href=\"https://www.autocar.co.uk/autocar-awards\"\u003eAutocar Awards\u003c/a\u003e, which will celebrate the people and organisations shaping the future of automotive - as well as the best cars on sale.\u003c/p\u003e\n\u003cp\u003eThis year\u0026#39;s awards ceremony takes place on 24 June, where Autocar and Siemens will name the industry\u0026#39;s most innovative and impactful individuals, and provide a platform for them to tell their stories. \u003c/p\u003e\n\u003cp\u003eAs part of Autocar\u0026#39;s collaboration with Siemens, the two brands will also host a free, interactive webinar on 25 June in which we will delve into how software is defining the future of automotive.\u003c/p\u003e\n\n\u003cp\u003eAs its role in vehicle development and functionality becomes ever-more important, there are huge questions over what software means for how we use our cars - and what the future holds.\u003c/p\u003e\n\u003cp\u003eSiemens is a technology leader with a significant influence on the mobility sphere so is well placed to help answer those questions and reveal the full potential of software in this space.\u003c/p\u003e\n\u003cp\u003eHow can manufacturers upgrade cars post-purchase? Does your car have untapped technological potential built in already? What is a software-defined vehicle? These are just some of the questions we’ll seek to answer in our \u003ca href=\"https://insight.autocarbusiness.com/why-automotive-software-is-the-engine-of-the-future\" target=\"_blank\"\u003e\u003cstrong\u003efree webinar on Wednesday 25 June from 14:00-15:00\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eJoin Siemens head of automotive, battery and mobility \u003cspan\u003eUday Senapati, Volvo Cars software engineering boss Alwin Bakkenes, \u003c/span\u003eAutocar deputy editor Felix Page and another special industry guest – to be announced in the coming weeks – for an insightful and interactive deep-dive into the world of automotive software.\u003c/p\u003e\n\u003cp\u003eMark Tisshaw, Autocar editor, said: “Throughout our collaboration with Siemens, it has become clear just how deeply connected the company is to the automotive industry and how influential its relationships are at every level.\u003c/p\u003e\n\u003cp\u003e“We are thrilled to partner with Siemens to tell the stories of the industry\u0026#39;s most impressive individuals and companies at this year\u0026#39;s Autocar Awards ceremony and to hear how the company\u0026#39;s insights and expertise are shaping the future of the car in our upcoming webinar.”\u003c/p\u003e\n\u003cp\u003eThe webinar will be broadcast live on Wednesday 25 June from 14:00-15:00, with the opportunity to put questions to our expert guests.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://insight.autocarbusiness.com/why-automotive-software-is-the-engine-of-the-future\" target=\"_blank\"\u003e\u003cstrong\u003eSign up here to watch for free\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eMeet the panellists \u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eUday Senapati\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"1350\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/uday_senapati.jpg?itok=D5g4dkwH\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/uday_senapati.jpg?itok=D5g4dkwH\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-29T12:08:27Z",
  "modifiedTime": null
}
