{
  "id": "3369140a-3832-4da8-bee8-01be3d53b785",
  "title": "Quack on: Bringing Jeep Ducking to the UK with a Wrangler",
  "link": "https://www.autocar.co.uk/car-news/features/quack-bringing-jeep-ducking-uk-wrangler",
  "description": "A North American trend called Duck Duck Jeep is said to be hitting the UK. What on Earth is it? Like many waterfowl, ducks are migrating birds - but some recent new arrivals on UK shores will have even seasoned twitchers very confused. Because reports suggest that you might just find a new species of duck in the UK If, that is, you know where to look: the dashboards of Jeeps. I should mention we're talking plastic ducks here. That's because a relatively new phenomenon has begun in which Jeep drivers - or Jeepers, as some like to style themselves - gift plastic ducks to the owners of other Jeeps. Don't worry: you're probably not alone in finding that odd. Ducking Jeeps - please be careful how you say that - has become hugely popular in North America. Find a Jeep of any type, age or condition over there, and you're likely to see at least a handful of ducks spread across its dashboard. I discovered the phenomenon on a holiday in Texas when Avis gave me a Wrangler PHEV hire car. One day I returned to it in a car park to find a small blue duck - which neatly matched the accent colour on the bodywork details - on the wing mirror. It took a bit of internet sleuthing to unearth why I'd been gifted a plastic duck and my quest to learn more led me down a rabbit hole. Or duck hole, I suppose. According to various Jeep ducking web forums, the trend is beginning to spread globally, including to the UK. Is that true? There was only one way to find out: to get a Wrangler and a bag full of plastic ducks (official Jeep ones, no less) and to set out on a duck hunt. Yes, serious investigative journalism, this. But before we get to the mechanics of Jeep ducking, you probably want to know where it came from and how it started. And, like so many nice, pleasant and polite things, it originally began in Canada. It started as an impulsive gesture by a Canadian called Allison Parliament. She lived in Alabama, in the US Deep South, but in July 2020 she needed to return to Ontario to care for her ill grandmother. Given the challenges of travelling at the height of the Covid pandemic, she made the 1000-mile-plus trek in her beloved Jeep Wrangler. But at a petrol stop shortly after entering Canada, then under strict social-distancing restrictions, the Alabama plates on her car attracted the ire of a man, who verbally abused and shoved her, telling her to leave Canada. The encounter troubled Parliament for the rest of her drive and subsequent enforced quarantine. When her isolation was over, she decided to cheer herself up by buying some rubber ducks. The original plan was to keep them to hide around her partner’s house as a prank. But then Parliament spotted another Jeep and she wanted to do something to make the owner smile. “A compliment on your Jeep is always a good feeling,” she told the website of insurer Hagerty. Except Parliament didn’t have any paper to hand. But she did have ducks. So she scribbled ‘Nice Jeep, have a great day’ on one and decided to leave it on the bonnet. However, the owner spotted her and ran over to find out what she was doing. When she explained, “he thought it was a great thing, said it made his day”, recounted Parliament. They decided Parliament should put a pic on social media with the hashtag #duckduckjeep. She then decided to do the same with the rest of the ducks, to spread more cheer. And it spread fast: within weeks, the official Duck Duck Jeep Facebook page had gained tens of thousands of followers and she was soon being asked to do newspaper interviews about the fast-growing trend.  During a hugely difficult time, it was a wonderfully escapist bit of fun. But, unlike other pandemic trends such as baking sourdough and doing PE in your living room, Jeep ducking didn't end when lockdowns eased. Instead it kept growing.  Four years later, it’s grown into a genuine phenomenon that is celebrated at Jeep events and sports its own mini-industry. Peek on the Duck Duck Jeep Facebook group and you'll find discussion about what sort of ducks to put on particular Jeeps, advice on how to best stick ducks to dashboards (duck tape appears to be a popular answer), and even links to special lights to illuminate your dashboard ducks. It all seems incredibly daft, in a pleasantly twee Canadian sort of way. I want in. But as I settle into the Wrangler's seat, dashboard dotted with ducks, I'm not really sure where to start. After all, the general spirit of the thing is that ducking is a random, opportunist activity. Instead, I need to go out and find Jeeps. But where to look? With some cars, it's easy. You'll find Kia Sportages dotted around almost any supermarket car park. For a Tesla, just head to a Supercharger. Defender 130? That's easy: London's Kensington High Street. But Jeep? You'd hope to find Wranglers blasting down off-road trails, but plenty are bought for 'lifestyle' reasons. And you're more likely to stumble across an Avenger on the school run than a green lane. There's another problem: scarcity. Much like the greater scaup, with its distinctive plumage and mating call, Jeeps are a relatively rare spot on these shores. Even with the huge success of the Avenger, the brand's UK market share last year was 0.43%. Taking inspiration from ducks, I head to the river, mostly because snapper John Bradshaw knows a good spot to get some duck-filled pics. The fowl that usually line this section of the Thames have headed somewhere warmer, though, so we have to settle for the plastic variety. But there's early success: on our way to the photoshoot location, we pass a parked Renegade. However, the light is good and John wants to do the photos now, so we don't stop. By the time I return, armed with a plastic duck, the Jeep has gone. So begins a frustrating hunt. I see several Jeeps driving in the other direction - including another Wrangler, whose driver gives me a friendly wave - but that's no good: I can't exactly throw ducks at them from the window of a moving car. I resort to a trawl of south-west London car parks, including several laps around one attached to a Tesco Extra. Still. I can at least enjoy driving the Wrangler. It's a Sahara-spec car, so the lower of the trim levels available in the UK, although still well-appointed for a machine whose roots stretch back to a military utility vehicle. And while the 2.0-litre engine is a bit on the gruff side and the ride can be a touch wobbly in places, it's surprisingly pleasant to drive around town in. People also seem to like it, which definitely isn't true of every beefed-up SUV you'll find barging through cities. Perhaps it helps that my car is sporting bright Firecracker Red paint, but it attracts plenty of second glances. Or perhaps people are just trying to work out why my dashboard is covered with plastic ducks. But this isn't about the Jeep I'm driving: it's about finding others. At last, after resorting to trawling up and down residential streets in Twickenham with increasing desperation I spot one. It's a Renegade rather than a Wrangler sure, but it's a Jeep. Finally, it's time to go ducking. The unofficial rules of Duck Duck Jeep give some guidance for duckers: never put a duck inside a vehicle, always leave it somewhere visible and, if you're going to write a message on it, keep it clean. I decide to balance the duck on the wing mirror. Doing so is the work of a moment, and after such a long hunt, it's all a bit anticlimactic. My journalistic instinct is to hang around until the owner returns to find the duck. I want to know if they've heard of the trend, what they think about it and so on. But that runs against the spirit of the thing: the key is the unexpected discovery for the recipient. It's their moment, not mine. I settle for attaching a note to the duck (on paper, rather than trying to write on the duck itself), inviting the owner to get in touch if they want to know more about ducks. Then it's back into the Wrangler and off. And then I turn the corner at the end of the street and there's another Jeep: an ageing Patriot this time. Another duck and note is deposited. Halfway down the street, there's another one. Over the next few days, I find several more Jeeps and each time deposit a duck. Every time I do, there's a little hit of endorphin that comes from doing something nice, even if that's slightly tempered by the occasional strange glance from passers-by. It's hard not to feel self-conscious when you're a grown man sticking plastic ducks on cars. What's notable is that I don't see a single duck on the dashboard of another Jeep: it seems the Duck Duck Jeep trend really is in its infancy over here. Nor does anyone get in touch in response to my notes. Perhaps it's early days, or perhaps we Brits are just a bit too reserved for this sort of thing. Or maybe the relative scarcity of Jeeps here will make it a more low-key, cult thing. To find out, you'll have to keep staring at the dashboards of Jeeps. Sadly, in June this year Parliament, the accidental invention of the trend, died suddenly from natural causes. Her mother encouraged Jeep owners to keep on ducking, and the continued growth of the trend seems a wonderful, if unusual, legacy for her to leave. In an increasingly polarised society, it's a truly rare thing: a spontaneous, joyous random act of kindness. Am I reading too much into the act of sticking a plastic novelty on a car? Perhaps. Maybe my hunt has made me mad. But I've still got a pile of ducks and there are car parks left to scan. It turns out being nice is quite addictive.",
  "author": "",
  "published": "Sun, 5 Jan 2025 06:01:39 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "James Attwood",
  "length": 11926,
  "excerpt": "A North American trend called Duck Duck Jeep is said to be hitting the UK. What on Earth is it?",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Quack on: Bringing Jeep Ducking to the UK with a Wrangler A North American trend called Duck Duck Jeep is said to be hitting the UK. What on Earth is it? Close 7 mins read5 January 2025 Like many waterfowl, ducks are migrating birds - but some recent new arrivals on UK shores will have even seasoned twitchers very confused. Because reports suggest that you might just find a new species of duck in the UK If, that is, you know where to look: the dashboards of Jeeps. I should mention we're talking plastic ducks here. That's because a relatively new phenomenon has begun in which Jeep drivers - or Jeepers, as some like to style themselves - gift plastic ducks to the owners of other Jeeps. Don't worry: you're probably not alone in finding that odd. Ducking Jeeps - please be careful how you say that - has become hugely popular in North America. Find a Jeep of any type, age or condition over there, and you're likely to see at least a handful of ducks spread across its dashboard. I discovered the phenomenon on a holiday in Texas when Avis gave me a Wrangler PHEV hire car. One day I returned to it in a car park to find a small blue duck - which neatly matched the accent colour on the bodywork details - on the wing mirror. It took a bit of internet sleuthing to unearth why I'd been gifted a plastic duck and my quest to learn more led me down a rabbit hole. Or duck hole, I suppose. According to various Jeep ducking web forums, the trend is beginning to spread globally, including to the UK. Is that true? There was only one way to find out: to get a Wrangler and a bag full of plastic ducks (official Jeep ones, no less) and to set out on a duck hunt. Yes, serious investigative journalism, this. But before we get to the mechanics of Jeep ducking, you probably want to know where it came from and how it started. And, like so many nice, pleasant and polite things, it originally began in Canada. It started as an impulsive gesture by a Canadian called Allison Parliament. She lived in Alabama, in the US Deep South, but in July 2020 she needed to return to Ontario to care for her ill grandmother. Given the challenges of travelling at the height of the Covid pandemic, she made the 1000-mile-plus trek in her beloved Jeep Wrangler. But at a petrol stop shortly after entering Canada, then under strict social-distancing restrictions, the Alabama plates on her car attracted the ire of a man, who verbally abused and shoved her, telling her to leave Canada. The encounter troubled Parliament for the rest of her drive and subsequent enforced quarantine. When her isolation was over, she decided to cheer herself up by buying some rubber ducks. The original plan was to keep them to hide around her partner’s house as a prank. But then Parliament spotted another Jeep and she wanted to do something to make the owner smile. “A compliment on your Jeep is always a good feeling,” she told the website of insurer Hagerty. Except Parliament didn’t have any paper to hand. But she did have ducks. So she scribbled ‘Nice Jeep, have a great day’ on one and decided to leave it on the bonnet. However, the owner spotted her and ran over to find out what she was doing. When she explained, “he thought it was a great thing, said it made his day”, recounted Parliament. They decided Parliament should put a pic on social media with the hashtag #duckduckjeep. She then decided to do the same with the rest of the ducks, to spread more cheer. And it spread fast: within weeks, the official Duck Duck Jeep Facebook page had gained tens of thousands of followers and she was soon being asked to do newspaper interviews about the fast-growing trend.  During a hugely difficult time, it was a wonderfully escapist bit of fun. But, unlike other pandemic trends such as baking sourdough and doing PE in your living room, Jeep ducking didn't end when lockdowns eased. Instead it kept growing.  Four years later, it’s grown into a genuine phenomenon that is celebrated at Jeep events and sports its own mini-industry. Peek on the Duck Duck Jeep Facebook group and you'll find discussion about what sort of ducks to put on particular Jeeps, advice on how to best stick ducks to dashboards (duck tape appears to be a popular answer), and even links to special lights to illuminate your dashboard ducks. It all seems incredibly daft, in a pleasantly twee Canadian sort of way. I want in. But as I settle into the Wrangler's seat, dashboard dotted with ducks, I'm not really sure where to start. After all, the general spirit of the thing is that ducking is a random, opportunist activity. Instead, I need to go out and find Jeeps. But where to look? With some cars, it's easy. You'll find Kia Sportages dotted around almost any supermarket car park. For a Tesla, just head to a Supercharger. Defender 130? That's easy: London's Kensington High Street. But Jeep? You'd hope to find Wranglers blasting down off-road trails, but plenty are bought for 'lifestyle' reasons. And you're more likely to stumble across an Avenger on the school run than a green lane. There's another problem: scarcity. Much like the greater scaup, with its distinctive plumage and mating call, Jeeps are a relatively rare spot on these shores. Even with the huge success of the Avenger, the brand's UK market share last year was 0.43%. Taking inspiration from ducks, I head to the river, mostly because snapper John Bradshaw knows a good spot to get some duck-filled pics. The fowl that usually line this section of the Thames have headed somewhere warmer, though, so we have to settle for the plastic variety. But there's early success: on our way to the photoshoot location, we pass a parked Renegade. However, the light is good and John wants to do the photos now, so we don't stop. By the time I return, armed with a plastic duck, the Jeep has gone. So begins a frustrating hunt. I see several Jeeps driving in the other direction - including another Wrangler, whose driver gives me a friendly wave - but that's no good: I can't exactly throw ducks at them from the window of a moving car. I resort to a trawl of south-west London car parks, including several laps around one attached to a Tesco Extra. Still. I can at least enjoy driving the Wrangler. It's a Sahara-spec car, so the lower of the trim levels available in the UK, although still well-appointed for a machine whose roots stretch back to a military utility vehicle. And while the 2.0-litre engine is a bit on the gruff side and the ride can be a touch wobbly in places, it's surprisingly pleasant to drive around town in. People also seem to like it, which definitely isn't true of every beefed-up SUV you'll find barging through cities. Perhaps it helps that my car is sporting bright Firecracker Red paint, but it attracts plenty of second glances. Or perhaps people are just trying to work out why my dashboard is covered with plastic ducks. But this isn't about the Jeep I'm driving: it's about finding others. At last, after resorting to trawling up and down residential streets in Twickenham with increasing desperation I spot one. It's a Renegade rather than a Wrangler sure, but it's a Jeep. Finally, it's time to go ducking. The unofficial rules of Duck Duck Jeep give some guidance for duckers: never put a duck inside a vehicle, always leave it somewhere visible and, if you're going to write a message on it, keep it clean. I decide to balance the duck on the wing mirror. Doing so is the work of a moment, and after such a long hunt, it's all a bit anticlimactic. My journalistic instinct is to hang around until the owner returns to find the duck. I want to know if they've heard of the trend, what they think about it and so on. But that runs against the spirit of the thing: the key is the unexpected discovery for the recipient. It's their moment, not mine. I settle for attaching a note to the duck (on paper, rather than trying to write on the duck itself), inviting the owner to get in touch if they want to know more about ducks. Then it's back into the Wrangler and off. And then I turn the corner at the end of the street and there's another Jeep: an ageing Patriot this time. Another duck and note is deposited. Halfway down the street, there's another one. Over the next few days, I find several more Jeeps and each time deposit a duck. Every time I do, there's a little hit of endorphin that comes from doing something nice, even if that's slightly tempered by the occasional strange glance from passers-by. It's hard not to feel self-conscious when you're a grown man sticking plastic ducks on cars. What's notable is that I don't see a single duck on the dashboard of another Jeep: it seems the Duck Duck Jeep trend really is in its infancy over here. Nor does anyone get in touch in response to my notes. Perhaps it's early days, or perhaps we Brits are just a bit too reserved for this sort of thing. Or maybe the relative scarcity of Jeeps here will make it a more low-key, cult thing. To find out, you'll have to keep staring at the dashboards of Jeeps. Sadly, in June this year Parliament, the accidental invention of the trend, died suddenly from natural causes. Her mother encouraged Jeep owners to keep on ducking, and the continued growth of the trend seems a wonderful, if unusual, legacy for her to leave. In an increasingly polarised society, it's a truly rare thing: a spontaneous, joyous random act of kindness. Am I reading too much into the act of sticking a plastic novelty on a car? Perhaps. Maybe my hunt has made me mad. But I've still got a pile of ducks and there are car parks left to scan. It turns out being nice is quite addictive. Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. James Attwood Title: Acting magazine editor James is Autocar's acting magazine editor. Having served in that role since June 2023, he is in charge of the day-to-day running of the world's oldest car magazine, and regularly interviews some of the biggest names in the industry to secure news and features, such as his world exclusive look into production of Volkswagen currywurst. Really. Before first joining Autocar in 2017, James spent more than a decade in motorsport journalist, working on Autosport, autosport.com, F1 Racing and Motorsport News, covering everything from club rallying to top-level international events. He also spent 18 months running Move Electric, Haymarket's e-mobility title, where he developed knowledge of the e-bike and e-scooter markets.  used Jeep Wrangler cars for sale In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/jeep_duck_hunting_-_parked_on_the_beach.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \n\n  \u003cp\u003e\n\n    \n    \n    \n          \u003ch2 itemprop=\"name\"\u003eQuack on: Bringing Jeep Ducking to the UK with a Wrangler\u003c/h2\u003e    \n    \n    \n  \u003c/p\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cp\u003e\u003ch2\u003eA North American trend called Duck Duck Jeep is said to be hitting the UK. What on Earth is it?\u003c/h2\u003e\n\u003c/p\u003e\n  \n  \u003c/div\u003e\n    \u003c/div\u003e\u003cdiv\u003e\n  \n    \u003cdiv\u003e\n              \u003cdiv id=\"carousel-wrapper\"\u003e\n    \u003cdiv id=\"sitewide-slider\"\u003e\u003cul\u003e\u003cli\u003e\n      \u003cp\u003e\u003cimg fetchpriority=\"high\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/gallery_slide/public/images/car-reviews/first-drives/legacy/jeep_duck_hunting_-_parked_on_the_beach.jpg?itok=uU2z_-28\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/gallery_slide/public/images/car-reviews/first-drives/legacy/jeep_duck_hunting_-_parked_on_the_beach.jpg?itok=uU2z_-28\" width=\"1200\" height=\"795\" alt=\"Jeep duck hunting   parked on the beach\" title=\"Jeep duck hunting   parked on the beach\"/\u003e    \u003c/p\u003e\n      \u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e    \u003cp\u003eClose\u003c/p\u003e\n  \u003c/div\u003e\n                \u003cdiv\u003e\n                      \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/square_43x43/public/attersmug.jpg?itok=RIXPYyaD\" title=\"James Attwood\" alt=\"James Attwood\"/\u003e\n  \n  \u003c/p\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \n  \n\n\u003cp\u003e\u003cspan\u003e7 mins read\u003c/span\u003e\u003c/p\u003e\u003cp\u003e5 January 2025\u003c/p\u003e    \n    \n    \n\n\n    \n    \n    \n              \n    \n    \n\n  \n  \u003c/div\u003e\n\u003c/div\u003e\n                                \u003cdiv\u003e\n\u003cp\u003eLike many waterfowl, ducks are migrating birds - but some recent new arrivals on UK shores will have even seasoned twitchers very confused.\u003c/p\u003e\n\u003cp\u003eBecause reports suggest that you might just find a new species of duck in the UK If, that is, you know where to look: the dashboards of \u003ca href=\"https://www.autocar.co.uk/car-review/jeep\"\u003eJeeps\u003c/a\u003e. I should mention we\u0026#39;re talking plastic ducks here.\u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s because a relatively new phenomenon has begun in which Jeep drivers - or Jeepers, as some like to style themselves - gift plastic ducks to the owners of other Jeeps. Don\u0026#39;t worry: you\u0026#39;re probably not alone in finding that odd. Ducking Jeeps - please be careful how you say that - has become hugely popular in North America.\u003c/p\u003e\n\n\u003cp\u003eFind a Jeep of any type, age or condition over there, and you\u0026#39;re likely to see at least a handful of ducks spread across its dashboard.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/jeep_wrangler_boot.jpg?itok=YUGV-Z4g\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/jeep_wrangler_boot.jpg?itok=YUGV-Z4g\"/\u003e\u003c/p\u003e\n\u003cp\u003eI discovered the phenomenon on a holiday in Texas when Avis gave me a \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/wrangler\"\u003eWrangler\u003c/a\u003e PHEV hire car. One day I returned to it in a car park to find a small blue duck - which neatly matched the accent colour on the bodywork details - on the wing mirror.\u003c/p\u003e\n\u003cp\u003eIt took a bit of internet sleuthing to unearth why I\u0026#39;d been gifted a plastic duck and my quest to learn more led me down a rabbit hole. Or duck hole, I suppose.\u003c/p\u003e\n\u003cp\u003eAccording to various Jeep ducking web forums, the trend is beginning to spread globally, including to the UK. Is that true? There was only one way to find out: to get a Wrangler and a bag full of plastic ducks (official Jeep ones, no less) and to set out on a duck hunt. Yes, serious investigative journalism, this.\u003c/p\u003e\n\u003cp\u003eBut before we get to the mechanics of Jeep ducking, you probably want to know where it came from and how it started. And, like so many nice, pleasant and polite things, it originally began in Canada.\u003c/p\u003e\n\u003cp\u003eIt started as an impulsive gesture by a Canadian called Allison Parliament. She lived in Alabama, in the US Deep South, but in July 2020 she needed to return to Ontario to care for her ill grandmother.\u003c/p\u003e\u003c/div\u003e                              \u003c/div\u003e\n      \n      \n            \n    \u003c/div\u003e\n\n                    \n              \u003cdiv\u003e\n              \n\u003cp\u003eGiven the challenges of travelling at the height of the Covid pandemic, she made the 1000-mile-plus trek in her beloved Jeep Wrangler. But at a petrol stop shortly after entering Canada, then under strict social-distancing restrictions, the Alabama plates on her car attracted the ire of a man, who verbally abused and shoved her, telling her to leave Canada.\u003c/p\u003e\n\u003cp\u003eThe encounter troubled Parliament for the rest of her drive and subsequent enforced quarantine. When her isolation was over, she decided to cheer herself up by buying some rubber ducks. The original plan was to keep them to hide around her partner’s house as a prank. But then Parliament spotted another Jeep and she wanted to do something to make the owner smile. “A compliment on your Jeep is always a good feeling,” she told the website of insurer Hagerty.\u003c/p\u003e\n\u003cp\u003eExcept Parliament didn’t have any paper to hand. But she did have ducks. So she scribbled ‘Nice Jeep, have a great day’ on one and decided to leave it on the bonnet. However, the owner spotted her and ran over to find out what she was doing.\u003c/p\u003e\n\u003cp\u003eWhen she explained, “he thought it was a great thing, said it made his day”, recounted Parliament. They decided Parliament should put a pic on social media with the hashtag #duckduckjeep. She then decided to do the same with the rest of the ducks, to spread more cheer.\u003c/p\u003e\n\u003cp\u003eAnd it spread fast: within weeks, the official Duck Duck Jeep Facebook page had gained tens of thousands of followers and she was soon being asked to do newspaper interviews about the fast-growing trend. \u003c/p\u003e\n\u003cp\u003eDuring a hugely difficult time, it was a wonderfully escapist bit of fun. But, unlike other pandemic trends such as baking sourdough and doing PE in your living room, Jeep ducking didn\u0026#39;t end when lockdowns eased. Instead it kept growing. \u003c/p\u003e\n\u003cp\u003eFour years later, it’s grown into a genuine phenomenon that is celebrated at Jeep events and sports its own mini-industry.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/ducks_on_the_dashboard_2.jpg?itok=0B39-Wto\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/ducks_on_the_dashboard_2.jpg?itok=0B39-Wto\"/\u003e\u003c/p\u003e            \u003c/div\u003e\n                  \n              \u003cdiv\u003e\n              \n\u003cp\u003ePeek on the Duck Duck Jeep Facebook group and you\u0026#39;ll find discussion about what sort of ducks to put on particular Jeeps, advice on how to best stick ducks to dashboards (duck tape appears to be a popular answer), and even links to special lights to illuminate your dashboard ducks.\u003c/p\u003e\n\u003cp\u003eIt all seems incredibly daft, in a pleasantly twee Canadian sort of way. I want in. But as I settle into the Wrangler\u0026#39;s seat, dashboard dotted with ducks, I\u0026#39;m not really sure where to start. After all, the general spirit of the thing is that ducking is a random, opportunist activity.\u003c/p\u003e\n\u003cp\u003eInstead, I need to go out and find Jeeps. But where to look? With some cars, it\u0026#39;s easy. You\u0026#39;ll find \u003ca href=\"https://www.autocar.co.uk/car-review/kia/sportage\"\u003eKia Sportages\u003c/a\u003e dotted around almost any supermarket car park. For a Tesla, just head to a Supercharger. \u003ca href=\"https://www.autocar.co.uk/car-review/land-rover/defender-130\"\u003eDefender 130\u003c/a\u003e? That\u0026#39;s easy: London\u0026#39;s Kensington High Street. But Jeep?\u003c/p\u003e\n\u003cp\u003eYou\u0026#39;d hope to find Wranglers blasting down off-road trails, but plenty are bought for \u0026#39;lifestyle\u0026#39; reasons. And you\u0026#39;re more likely to stumble across an Avenger on the school run than a green lane. There\u0026#39;s another problem: scarcity. Much like the greater scaup, with its distinctive plumage and mating call, Jeeps are a relatively rare spot on these shores. Even with the huge success of the \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/avenger\"\u003eAvenger\u003c/a\u003e, the brand\u0026#39;s UK market share last year was 0.43%.\u003c/p\u003e\n\u003cp\u003eTaking inspiration from ducks, I head to the river, mostly because snapper John Bradshaw knows a good spot to get some duck-filled pics. The fowl that usually line this section of the Thames have headed somewhere warmer, though, so we have to settle for the plastic variety. But there\u0026#39;s early success: on our way to the photoshoot location, we pass a parked \u003ca href=\"https://www.autocar.co.uk/car-review/jeep/renegade\"\u003eRenegade\u003c/a\u003e. However, the light is good and John wants to do the photos now, so we don\u0026#39;t stop.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/jeep_wrangler_surrounded_by_ducks.jpg?itok=da7PNWlu\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/jeep_wrangler_surrounded_by_ducks.jpg?itok=da7PNWlu\"/\u003e            \u003c/p\u003e\u003c/div\u003e\n                  \n              \u003cdiv\u003e\n              \n\u003cp\u003eBy the time I return, armed with a plastic duck, the Jeep has gone. So begins a frustrating hunt. I see several Jeeps driving in the other direction - including another Wrangler, whose driver gives me a friendly wave - but that\u0026#39;s no good: I can\u0026#39;t exactly throw ducks at them from the window of a moving car.\u003c/p\u003e\n\u003cp\u003eI resort to a trawl of south-west London car parks, including several laps around one attached to a Tesco Extra. Still. I can at least enjoy driving the Wrangler. It\u0026#39;s a Sahara-spec car, so the lower of the trim levels available in the UK, although still well-appointed for a machine whose roots stretch back to a military utility vehicle.\u003c/p\u003e\n\u003cp\u003eAnd while the 2.0-litre engine is a bit on the gruff side and the ride can be a touch wobbly in places, it\u0026#39;s surprisingly pleasant to drive around town in. People also seem to like it, which definitely isn\u0026#39;t true of every beefed-up SUV you\u0026#39;ll find barging through cities. Perhaps it helps that my car is sporting bright Firecracker Red paint, but it attracts plenty of second glances.\u003c/p\u003e\n\u003cp\u003eOr perhaps people are just trying to work out why my dashboard is covered with plastic ducks. But this isn\u0026#39;t about the Jeep I\u0026#39;m driving: it\u0026#39;s about finding others. At last, after resorting to trawling up and down residential streets in Twickenham with increasing desperation I spot one. It\u0026#39;s a Renegade rather than a Wrangler sure, but it\u0026#39;s a Jeep.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/a_wrangler_gets_ducked.jpg?itok=nBSHCggj\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/a_wrangler_gets_ducked.jpg?itok=nBSHCggj\"/\u003e            \u003c/p\u003e\u003c/div\u003e\n                  \n              \u003cdiv\u003e\n              \n\u003cp\u003eFinally, it\u0026#39;s time to go ducking. The unofficial rules of Duck Duck Jeep give some guidance for duckers: never put a duck inside a vehicle, always leave it somewhere visible and, if you\u0026#39;re going to write a message on it, keep it clean. I decide to balance the duck on the wing mirror. Doing so is the work of a moment, and after such a long hunt, it\u0026#39;s all a bit anticlimactic.\u003c/p\u003e\n\u003cp\u003eMy journalistic instinct is to hang around until the owner returns to find the duck. I want to know if they\u0026#39;ve heard of the trend, what they think about it and so on. But that runs against the spirit of the thing: the key is the unexpected discovery for the recipient. It\u0026#39;s their moment, not mine.\u003c/p\u003e\n\u003cp\u003eI settle for attaching a note to the duck (on paper, rather than trying to write on the duck itself), inviting the owner to get in touch if they want to know more about ducks. Then it\u0026#39;s back into the Wrangler and off. And then I turn the corner at the end of the street and there\u0026#39;s another Jeep: an ageing Patriot this time.\u003c/p\u003e\n\u003cp\u003eAnother duck and note is deposited. Halfway down the street, there\u0026#39;s another one. Over the next few days, I find several more Jeeps and each time deposit a duck. Every time I do, there\u0026#39;s a little hit of endorphin that comes from doing something nice, even if that\u0026#39;s slightly tempered by the occasional strange glance from passers-by. It\u0026#39;s hard not to feel self-conscious when you\u0026#39;re a grown man sticking plastic ducks on cars.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"675\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/blue_jeep_wrangler_gets_ducked.jpg?itok=cLqNZ1lT\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/blue_jeep_wrangler_gets_ducked.jpg?itok=cLqNZ1lT\"/\u003e            \u003c/p\u003e\u003c/div\u003e\n                  \n              \u003cdiv\u003e\n\u003cp\u003eWhat\u0026#39;s notable is that I don\u0026#39;t see a single duck on the dashboard of another Jeep: it seems the Duck Duck Jeep trend really is in its infancy over here. Nor does anyone get in touch in response to my notes. Perhaps it\u0026#39;s early days, or perhaps we Brits are just a bit too reserved for this sort of thing.\u003c/p\u003e\n\u003cp\u003eOr maybe the relative scarcity of Jeeps here will make it a more low-key, cult thing. To find out, you\u0026#39;ll have to keep staring at the dashboards of Jeeps. Sadly, in June this year Parliament, the accidental invention of the trend, died suddenly from natural causes. Her mother encouraged Jeep owners to keep on ducking, and the continued growth of the trend seems a wonderful, if unusual, legacy for her to leave.\u003c/p\u003e\n\u003cp\u003eIn an increasingly polarised society, it\u0026#39;s a truly rare thing: a spontaneous, joyous random act of kindness. Am I reading too much into the act of sticking a plastic novelty on a car? Perhaps. Maybe my hunt has made me mad. But I\u0026#39;ve still got a pile of ducks and there are car parks left to scan. It turns out being nice is quite addictive.\u003c/p\u003e\n\u003c/div\u003e\n      \n  \n  \n      \u003cdiv\u003e\n          \u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/james-attwood\"\u003eJames Attwood\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/james-attwood\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/attersmug.jpg\" width=\"205\" height=\"205\" alt=\"James Attwood, digital editor\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eActing magazine editor\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eJames is Autocar\u0026#39;s acting magazine editor. Having served in that role since June 2023, he is in charge of the day-to-day running of the world\u0026#39;s oldest car magazine, and regularly interviews some of the biggest names in the industry to secure news and features, such as his world exclusive look into production of Volkswagen currywurst. Really.\u003c/p\u003e\n\u003cp\u003eBefore first joining Autocar in 2017, James spent more than a decade in motorsport journalist, working on Autosport, autosport.com, F1 Racing and Motorsport News, covering everything from club rallying to top-level international events. He also spent 18 months running Move Electric, Haymarket\u0026#39;s e-mobility title, where he developed knowledge of the e-bike and e-scooter markets. \u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused Jeep Wrangler cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogo.png\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\n    \n\n\n    \n          \n    \n  \n\n  \n\n  \n\n  \n\n  \n\n  \n\n  \n\n    \n\n        \n\n \n\n \n\n \n\n  \n\n  \n\n\n\n \n\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-01-05T06:01:39Z",
  "modifiedTime": null
}
