{
  "id": "3dd214ed-3237-4f30-b30d-06f6b8804459",
  "title": "Govt targets 30 percent ethanol blending in petrol by 2030",
  "link": "https://www.autocarindia.com/industry/govt-targets-10-percent-increase-in-ethanol-petrol-blending-by-2030-435106#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The government has increased its target for ethanol blending in petrol to 30 percent in the next five years. Initially, the goal was 20 percent ethanol blending by 2030, but this milestone was achieved five years ahead of schedule. As of April 1, 2025, fuel stations nationwide must sell E20 (20 percent ethanol) petrol. Govt reviewing whether to deploy E30 fuel in a phased or a unified rollout The initial goal of 20 percent ethanol blending was achieved 5 years ahead of schedule Ethanol blending in petrol to increase to 30 percent by 2030 According to a report from InCred, Deepak Ballani, director general of the Indian Sugar \u0026 Bio-energy Manufacturers Association, confirmed the development, stating, “This year, we’ve already done around 19-20 percent. This is five years earlier than the target for 2030.” Govt deciding between phased and unified rollouts for E30 fuel The Ministry of Petroleum and Natural Gas has also given an inter-ministerial green light for the revised 30 percent ethanol blending target. To achieve this goal, the government is evaluating whether to go with a phased or a unified strategy. The former would likely entail E30 fuel being dispatched to cities tier-wise in stages, while the latter would see a blanket deployment across the country. How E30 fuel bodes for current and older petrol cars While higher ethanol-petrol blending helps increase jobs for farmers, lower tail-pipe emissions and decrease India’s reliance on crude oil imports, it may spell bad news for petrol car owners. At present, all petrol cars sold in India are compatible with E20 fuel. However, should the ethanol content in petrol rise, especially beyond 25 percent, the engine’s power output and fuel efficiency can take a hit. Older petrol cars that aren’t E20-compliant stand a greater risk of the same. Ethanol is also corrosive in nature as it absorbs moisture from the atmosphere and can damage rubber and plastic parts such as the fuel tank, seals, gaskets, and fuel lines in cases of prolonged exposure. Also see: Analysis: Why India is pursuing ethanol as an automotive fuel ‘Flex fuel availability key for commercial production of compatible cars': Maruti MD",
  "author": "Viraaj Bhatnagar",
  "published": "Tue, 15 Apr 2025 18:59:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Viraaj Bhatnagar",
  "length": 2234,
  "excerpt": "Ethanol blending in petrol currently stands at 20 percent in India.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Ethanol blending in petrol currently stands at 20 percent in India.The government has increased its target for ethanol blending in petrol to 30 percent in the next five years. Initially, the goal was 20 percent ethanol blending by 2030, but this milestone was achieved five years ahead of schedule. As of April 1, 2025, fuel stations nationwide must sell E20 (20 percent ethanol) petrol.Govt reviewing whether to deploy E30 fuel in a phased or a unified rolloutThe initial goal of 20 percent ethanol blending was achieved 5 years ahead of scheduleEthanol blending in petrol to increase to 30 percent by 2030According to a report from InCred, Deepak Ballani, director general of the Indian Sugar \u0026 Bio-energy Manufacturers Association, confirmed the development, stating, “This year, we’ve already done around 19-20 percent. This is five years earlier than the target for 2030.”Govt deciding between phased and unified rollouts for E30 fuelThe Ministry of Petroleum and Natural Gas has also given an inter-ministerial green light for the revised 30 percent ethanol blending target. To achieve this goal, the government is evaluating whether to go with a phased or a unified strategy. The former would likely entail E30 fuel being dispatched to cities tier-wise in stages, while the latter would see a blanket deployment across the country.How E30 fuel bodes for current and older petrol carsWhile higher ethanol-petrol blending helps increase jobs for farmers, lower tail-pipe emissions and decrease India’s reliance on crude oil imports, it may spell bad news for petrol car owners. At present, all petrol cars sold in India are compatible with E20 fuel. However, should the ethanol content in petrol rise, especially beyond 25 percent, the engine’s power output and fuel efficiency can take a hit. Older petrol cars that aren’t E20-compliant stand a greater risk of the same.Ethanol is also corrosive in nature as it absorbs moisture from the atmosphere and can damage rubber and plastic parts such as the fuel tank, seals, gaskets, and fuel lines in cases of prolonged exposure.Also see:Analysis: Why India is pursuing ethanol as an automotive fuel‘Flex fuel availability key for commercial production of compatible cars': Maruti MD",
  "image": "https://img.autocarindia.com/ExtraImages/20250415064641_e20 blend.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eEthanol blending in petrol currently stands at 20 percent in India.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe government has increased its target for ethanol blending in petrol to 30 percent in the next five years. Initially, the goal was \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/india-on-target-to-achieve-20-percent-ethanol-blending-by-october-2025-pm-modi-434544\"\u003e20 percent ethanol blending\u003c/a\u003e\u003c/strong\u003e by 2030, but this milestone was achieved five years ahead of schedule. As of April 1, 2025, fuel stations nationwide must sell E20 (20 percent ethanol) petrol.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eGovt reviewing whether to deploy E30 fuel in a phased or a unified rollout\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e\u003cspan data-preserver-spaces=\"true\"\u003eThe initial goal of 20 \u003c/span\u003e\u003cspan data-preserver-spaces=\"true\"\u003epercent\u003c/span\u003e\u003cspan data-preserver-spaces=\"true\"\u003e ethanol blending was achieved\u003c/span\u003e\u003cspan data-preserver-spaces=\"true\"\u003e 5 years ahead of schedule\u003c/span\u003e\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003eEthanol blending in petrol to increase to 30 percent by 2030\u003c/h2\u003e\u003cp\u003eAccording to a report from InCred, Deepak Ballani, director general of the Indian Sugar \u0026amp; Bio-energy Manufacturers Association, confirmed the development, stating, “This year, we’ve already done around 19-20 percent. This is five years earlier than the target for 2030.”\u003c/p\u003e\u003ch3\u003eGovt deciding between phased and unified rollouts for E30 fuel\u003c/h3\u003e\u003cp\u003eThe Ministry of Petroleum and Natural Gas has also given an inter-ministerial green light for the revised 30 percent ethanol blending target. To achieve this goal, the government is evaluating whether to go with a phased or a unified strategy. The former would likely entail E30 fuel being dispatched to cities tier-wise in stages, while the latter would see a blanket deployment across the country.\u003c/p\u003e\u003ch2\u003eHow E30 fuel bodes for current and older petrol cars\u003c/h2\u003e\u003cp\u003eWhile higher ethanol-petrol blending helps increase jobs for farmers, lower tail-pipe emissions and decrease India’s reliance on crude oil imports, it may spell bad news for petrol car owners. At present, all petrol cars sold in India are \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/honda-city-amaze-elevate-achieve-e20-fuel-compliance-434479\"\u003ecompatible with E20 fuel\u003c/a\u003e\u003c/strong\u003e. However, should the ethanol content in petrol rise, especially beyond 25 percent, the engine’s power output and fuel efficiency can take a hit. Older petrol cars that aren’t E20-compliant stand a greater risk of the same.\u003c/p\u003e\u003cp\u003eEthanol is also corrosive in nature as it absorbs moisture from the atmosphere and can damage rubber and plastic parts such as the fuel tank, seals, gaskets, and fuel lines in cases of prolonged exposure.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp class=\"new-heding-h6\"\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/auto-features/feature-why-is-india-pursuing-ethanol-as-a-automotive-fuel-426524\"\u003eAnalysis: Why India is pursuing ethanol as an automotive fuel\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/flex-fuel-availability-key-for-commercial-production-of-compatible-cars-maruti-md-426994\"\u003e‘Flex fuel availability key for commercial production of compatible cars\u0026#39;: Maruti MD\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-15T18:59:00+05:30",
  "modifiedTime": null
}
