{
  "id": "3ef9319c-a6fa-47f1-b119-04d821c9c6bb",
  "title": "AC Cobra GT Roadster",
  "link": "https://www.autocar.co.uk/car-review/ac-cars/cobra-gt-roadster",
  "description": "The sixties icon has been reborn with evolved look and new parts – but what's it like to drive? I want to say that AC Cars is back, even though it has never really been away.But thanks to a big cash injection, the storied British marque has a new plan for its classic-shaped cars (watch this space) and, more significantly, an all-new model: the Cobra GT Roadster.It’s new but still looks Cobra-ish, no? Like when BMW reinvented the Mini or Fiat revived the 500, it’s an entirely different thing from a familiar shape.It’s bigger, too, of course, because people and components are bigger than they were when the Ace, from which the original Cobra morphed, was launched in 1953.",
  "author": "",
  "published": "Sun, 24 Nov 2024 06:01:20 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Editor-at-large Follow:",
  "length": 1780,
  "excerpt": "The sixties icon has been reborn with evolved look and new parts – but what's it like to drive?",
  "siteName": "Autocar",
  "favicon": "",
  "text": "It’s 1.98m across the body but only 4.23m long, with a 2.57m wheelbase. For what it’s worth, I think it looks terrific, just short of caricature, almost as if AC had never stopped developing the Cobra – and crucially, given how many makers of replicas there are, it won’t be mistaken for one of those. Beneath is a mostly extruded aluminium chassis, but the body is carbonfibre, courtesy of a Sussex-based composites company that AC recently bought, and this is where I find my test car – the only prototype in the UK. Most of the development work is taking place in Germany. The layout is as traditional as you might expect (and perhaps hope): there’s an engine in the front – a 5.0-litre Ford V8 with or without a supercharger – driving the rear axle. The gearbox is either a Tremec six-speed manual or a 10-speed automatic. In naturally aspirated form, it makes 454bhp and 420lb ft of torque; when supercharged, as this prototype is, it makes 654bhp and 575lb ft. Suspension is by double wishbones all around, with pushrods at the front. There’s a limited-slip rear differential on the atmo car or a Torsen diff on the blown car. Again depending on the version, the tyres are 275/35 R21s at the front and 325/30 R21s at the back or narrower items on 19in wheels. The Cobra GT Roadster will be small-series type-approved, which means it can be sold just about everywhere. But this being a working prototype, as yet there’s no anti-lock braking or brake servo, the power steering is on full assist mode, there are no anti-roll bars and it wears trade plates. There’s work to do, in other words, before deliveries start late next year. But despite AC’s fears about how closely we point cameras at it, I’ve seen complete cars that aren’t so well finished as this working prototype.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/ac_cobra_gt_roadster_tracking_2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eIt’s 1.98m across the body but only 4.23m long, with a 2.57m wheelbase. For what it’s worth, I think it looks terrific, just short of caricature, almost as if AC had never stopped developing the Cobra – and crucially, given how many makers of replicas there are, it won’t be mistaken for one of those.\u003c/p\u003e\n\u003cp\u003eBeneath is a mostly extruded aluminium chassis, but the body is carbonfibre, courtesy of a Sussex-based composites company that AC recently bought, and this is where I find my test car – the only prototype in the UK.\u003c/p\u003e\n\u003cp\u003eMost of the development work is taking place in Germany. The layout is as traditional as you might expect (and perhaps hope): there’s an engine in the front – a 5.0-litre \u003ca href=\"https://www.autocar.co.uk/car-review/ford\"\u003eFord\u003c/a\u003e V8 with or without a supercharger – driving the rear axle.\u003c/p\u003e\n\u003cp\u003eThe gearbox is either a Tremec six-speed manual or a 10-speed automatic.\u003c/p\u003e\n\u003cp\u003eIn naturally aspirated form, it makes 454bhp and 420lb ft of torque; when supercharged, as this prototype is, it makes 654bhp and 575lb ft.\u003c/p\u003e\n\u003cp\u003eSuspension is by double wishbones all around, with pushrods at the front. There’s a limited-slip rear differential on the atmo car or a Torsen diff on the blown car.\u003c/p\u003e\n\u003cp\u003eAgain depending on the version, the tyres are 275/35 R21s at the front and 325/30 R21s at the back or narrower items on 19in wheels.\u003c/p\u003e\n\u003cp\u003eThe Cobra GT Roadster will be small-series type-approved, which means it can be sold just about everywhere.\u003c/p\u003e\n\u003cp\u003eBut this being a working prototype, as yet there’s no anti-lock braking or brake servo, the power steering is on full assist mode, there are no anti-roll bars and it wears trade plates.\u003c/p\u003e\n\u003cp\u003eThere’s work to do, in other words, before deliveries start late next year.\u003c/p\u003e\n\u003cp\u003eBut despite AC’s fears about how closely we point cameras at it, I’ve seen complete cars that aren’t so well finished as this working prototype.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
