{
  "id": "5262697a-f0f3-4385-98e0-a116ebc6975e",
  "title": "The invisible biometric tech making your next car safer",
  "link": "https://www.autocar.co.uk/car-news/technology/invisible-biometric-tech-making-your-next-car-safer",
  "description": "The biometric system uses 3D distance mapping to detect the driver’s exact position Continental displayed the latest version of its biometrics in-car tech at the Consumer Electronics Show. Called the Invisible Biometrics Sensing Display, it aims to improve passive safety for a car’s occupants.   Biometrics is the science of recognition using biological characteristics and this system goes further by detecting occupants using a camera and laser projector. The technology looks through a high-resolution OLED screen and is invisible to the naked eye. It was developed by Continental in conjunction with its partner, Trinamix. This latest version uses 3D distance mapping to ensure the airbags are deployed to the best effect in the event of a collision and it checks other restraint devices too – for example, that seatbelts are fastened correctly. The Invisible Biometric Sensing Display can also monitor vital parameters such as the driver’s heart rate to identify stressful situations or even an impending medical emergency. The imaging technology at the core of it consists of a 1.5-megapixel near-infrared camera and a laser dot projector that poses no danger to the occupants’ eyes. Also developed by Trinamix, the system works by capturing reflections from points of light emitted by the projector. Occupants are unaware of it happening because the wavelengths used are all within the invisible light spectrum. The technology also captures other information, such as the distance of the driver to the instrument panel. Unsurprisingly, the engine room behind the optical devices is powered by algorithms based on artificial intelligence. The biometric imaging technology was developed specifically for use in car interiors, uses a single hardware module and, as such, Continental claims it is unique in the market. The developers also believe that because the system is contactless and invisible to a car’s occupants, it should open up new creative opportunities for designers and be more readily accepted by users. Other driver monitoring systems have been around for some time, of course. Bosch markets a drowsiness detection system based on an algorithm that starts recording the driver’s steering behaviour from the moment they pull away. Based on the frequency and pattern of the driver inputs and other things such as the length of journey, use of indicators and the time of day, the algorithms can calculate the driver’s level of fatigue and issue a warning.  Mercedes-Benz was the first to offer a drowsiness detection system, with Attention Assist in 2009. If it concludes the driver needs a wake-up call, it will issue the audible and visual prompt: “Time for a break.”",
  "author": "",
  "published": "Mon, 20 Jan 2025 08:01:42 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Jesse Crosse",
  "length": 2604,
  "excerpt": "The biometric system uses 3D distance mapping to detect the driver’s exact position",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Continental displayed the latest version of its biometrics in-car tech at the Consumer Electronics Show. Called the Invisible Biometrics Sensing Display, it aims to improve passive safety for a car’s occupants.   Biometrics is the science of recognition using biological characteristics and this system goes further by detecting occupants using a camera and laser projector. The technology looks through a high-resolution OLED screen and is invisible to the naked eye. It was developed by Continental in conjunction with its partner, Trinamix. This latest version uses 3D distance mapping to ensure the airbags are deployed to the best effect in the event of a collision and it checks other restraint devices too – for example, that seatbelts are fastened correctly. The Invisible Biometric Sensing Display can also monitor vital parameters such as the driver’s heart rate to identify stressful situations or even an impending medical emergency. The imaging technology at the core of it consists of a 1.5-megapixel near-infrared camera and a laser dot projector that poses no danger to the occupants’ eyes. Also developed by Trinamix, the system works by capturing reflections from points of light emitted by the projector. Occupants are unaware of it happening because the wavelengths used are all within the invisible light spectrum. The technology also captures other information, such as the distance of the driver to the instrument panel. Unsurprisingly, the engine room behind the optical devices is powered by algorithms based on artificial intelligence. The biometric imaging technology was developed specifically for use in car interiors, uses a single hardware module and, as such, Continental claims it is unique in the market. The developers also believe that because the system is contactless and invisible to a car’s occupants, it should open up new creative opportunities for designers and be more readily accepted by users. Other driver monitoring systems have been around for some time, of course. Bosch markets a drowsiness detection system based on an algorithm that starts recording the driver’s steering behaviour from the moment they pull away. Based on the frequency and pattern of the driver inputs and other things such as the length of journey, use of indicators and the time of day, the algorithms can calculate the driver’s level of fatigue and issue a warning.  Mercedes-Benz was the first to offer a drowsiness detection system, with Attention Assist in 2009. If it concludes the driver needs a wake-up call, it will issue the audible and visual prompt: “Time for a break.”",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/continental-incar-invisible-technology.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eContinental displayed the latest version of its biometrics in-car tech at the Consumer Electronics Show. Called the Invisible Biometrics Sensing Display, it aims to improve passive safety for a car’s occupants.  \u003c/p\u003e\n\u003cp\u003eBiometrics is the science of recognition using biological characteristics and this system goes further by detecting occupants using a camera and laser projector.\u003c/p\u003e\n\u003cp\u003eThe technology looks through a high-resolution OLED screen and is invisible to the naked eye. It was developed by Continental in conjunction with its partner, Trinamix.\u003c/p\u003e\n\n\u003cp\u003eThis latest version uses 3D distance mapping to ensure the airbags are deployed to the best effect in the event of a collision and it checks other restraint devices too – for example, that seatbelts are fastened correctly.\u003c/p\u003e\n\u003cp\u003eThe Invisible Biometric Sensing Display can also monitor vital parameters such as the driver’s heart rate to identify stressful situations or even an impending medical emergency.\u003c/p\u003e\n\u003cp\u003eThe imaging technology at the core of it consists of a 1.5-megapixel near-infrared camera and a laser dot projector that poses no danger to the occupants’ eyes.\u003c/p\u003e\n\u003cp\u003eAlso developed by Trinamix, the system works by capturing reflections from points of light emitted by the projector.\u003c/p\u003e\n\u003cp\u003eOccupants are unaware of it happening because the wavelengths used are all within the invisible light spectrum.\u003c/p\u003e\n\u003cp\u003eThe technology also captures other information, such as the distance of the driver to the instrument panel. Unsurprisingly, the engine room behind the optical devices is powered by algorithms based on artificial intelligence.\u003c/p\u003e\n\u003cp\u003eThe biometric imaging technology was developed specifically for use in car interiors, uses a single hardware module and, as such, Continental claims it is unique in the market.\u003c/p\u003e\n\u003cp\u003eThe developers also believe that because the system is contactless and invisible to a car’s occupants, it should open up new creative opportunities for designers and be more readily accepted by users.\u003c/p\u003e\n\u003cp\u003eOther driver monitoring systems have been around for some time, of course. Bosch markets a drowsiness detection system based on an algorithm that starts recording the driver’s steering behaviour from the moment they pull away.\u003c/p\u003e\n\u003cp\u003eBased on the frequency and pattern of the driver inputs and other things such as the length of journey, use of indicators and the time of day, the algorithms can calculate the driver’s level of fatigue and issue a warning. \u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/car-review/mercedes-benz\"\u003eMercedes-Benz \u003c/a\u003ewas the first to offer a drowsiness detection system, with Attention Assist in 2009. If it concludes the driver needs a wake-up call, it will issue the audible and visual prompt: “Time for a break.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-20T08:01:42Z",
  "modifiedTime": null
}
