{
  "id": "59ef7b2a-9bbc-4dd8-a179-f3cbd0ab695d",
  "title": "SpaceX Whines To The Feds About Another Company Flooding Orbit With Satellites",
  "link": "https://www.jalopnik.com/1921408/spacex-whines-to-feds-about-ast-satellites/",
  "description": "In fairness, SpaceX may have a point. AST SpaceMobile's proposed satellites are the size of a tennis court and would be visible to the naked eye from the ground",
  "author": "Ryan Erik King",
  "published": "Thu, 24 Jul 2025 20:45:32 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Technology",
    "News",
    "Spacelopnik"
  ],
  "byline": "Ryan Erik King",
  "length": 3289,
  "excerpt": "In fairness, SpaceX may have a point. AST SpaceMobile's proposed satellites are the size of a tennis court and would be visible to the naked eye from the ground",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "AST SpaceMobile SpaceX's Starlink satellite megaconstellation offers a wireless internet connection to most of the planet, but it comes at a cost. Astronomers have criticized Elon Musk's private space company for blinding ground-based telescopes and interfering with radio observatories. With that in mind, SpaceX had the gall to send a letter complaining about the potential dangers of a competitor's satellites to the Federal Communications Commission earlier this week. AST SpaceMobile is aiming to launch its own satellite-based internet service that you can access directly from your phone. In fairness, SpaceX may have a point. The satellites for AST SpaceMobile's proposed BlueBird constellation are the size of a tennis court. According to Gizmodo, the massive, reflective antenna-lined array would be visible to the naked eye from the ground. The metallic sheets would be brighter than most objects in the night sky, except for the Moon, Venus, Jupiter, and seven stars. Now, imagine 248 of these things streaking across the night sky. SpaceX is primarily concerned that the Texas-based manufacturer failed to conduct a basic risk assessment for maintaining a BlueBird satellite in orbit. The letter reads: \"AST underestimates its collision risk by assuming its dead satellites will stay in their optimal orientation even when AST loses control of them. AST raises serious questions about its readiness to avoid collisions by massively undercounting the number of objects it will need to avoid in its orbits.\" AST could disrupt Starlink's effective monopoly on satellite internet AST SpaceMobile Of course, SpaceX has a vested interest in grounding a potential competitor. Starlink customers currently connect to the network with an unwieldy flat receiver disk. While the recent launch of the backpack-portable Starlink Mini will draw more subscribers, AST SpaceMobile's equipment-less product would deal a severe blow to SpaceX in the marketplace. There would be no barrier to entry, allowing users to immediately sign up for the global 5G service. AST estimates there are 3.7 billion cellphone users around the world without access to broadband coverage that it hopes to tap into. Competition concerns aside, SpaceX's personnel are among the most experienced in determining whether a satellite poses a risk. The Starlink operator accounts for 60% of the satellites currently in orbit and has never had a collision with another satellite. However, low Earth orbit is only becoming more crowded with each passing year. Roscomos plans to launch a Russian satellite constellation later this year and Chinese companies are already underway with their own endeavors in orbit. If the space isn't well regulated, then there could be a disaster that could endanger people on the ground or compromise humanity's access to the final frontier.",
  "image": "https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/l-intro-1753389821.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1921408/spacex-whines-to-feds-about-ast-satellites/\" data-post-title=\"SpaceX Whines To The Feds About Another Company Flooding Orbit With Satellites\" data-slide-num=\"0\" data-post-id=\"1921408\"\u003e\n                                             \u003cpicture id=\"p030d263272fa28f200a1fded2e2bf944\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/intro-1753389821.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/intro-1753389821.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/intro-1753389821.jpg\" data-slide-url=\"https://www.jalopnik.com/1921408/spacex-whines-to-feds-about-ast-satellites/\" data-post-id=\"1921408\" data-slide-num=\"0\" data-slide-title=\"SpaceX Whines To The Feds About Another Company Flooding Orbit With Satellites: \" width=\"780\" height=\"438\" alt=\"A artist\u0026#39;s impression of a AST BlueBird satellites in orbit\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAST SpaceMobile\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eSpaceX\u0026#39;s Starlink satellite megaconstellation offers a wireless internet connection to most of the planet, but it comes at a cost. Astronomers have criticized Elon Musk\u0026#39;s private space company for \u003ca href=\"https://www.jalopnik.com/elon-musk-s-6-350-starlink-satellites-blinding-our-vi-1851653384/\" target=\"_blank\"\u003eblinding ground-based telescopes\u003c/a\u003e and \u003ca href=\"https://www.jalopnik.com/elon-musk-starlink-making-life-harder-for-astronomers-1850636498/\" target=\"_blank\"\u003einterfering with radio observatories.\u003c/a\u003e With that in mind, SpaceX had the gall to send a letter complaining about the potential dangers of a competitor\u0026#39;s satellites to the Federal Communications Commission earlier this week. AST SpaceMobile is aiming to launch its own satellite-based internet service that you can access directly from your phone.\u003c/p\u003e\n\u003cp\u003eIn fairness, SpaceX may have a point. The satellites for AST SpaceMobile\u0026#39;s proposed BlueBird constellation are the size of a tennis court. \u003ca href=\"https://gizmodo.com/spacex-has-the-nerve-to-be-mad-about-a-competitors-massive-satellites-littering-earth-orbit-2000633113\" target=\"_blank\"\u003eAccording to Gizmodo,\u003c/a\u003e the massive, reflective antenna-lined array would be visible to the naked eye from the ground. The metallic sheets would be brighter than most objects in the night sky, except for the Moon, Venus, Jupiter, and seven stars. Now, imagine 248 of these things streaking across the night sky. SpaceX is primarily concerned that the Texas-based manufacturer failed to conduct a basic risk assessment for maintaining a BlueBird satellite in orbit. \u003ca href=\"https://www.scribd.com/document/891559005/SpaceX-Comments-on-AST-MOD-Application\" target=\"_blank\"\u003eThe letter reads:\u003c/a\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;AST underestimates its collision risk by assuming its dead satellites will stay in their optimal orientation even when AST loses control of them. AST raises serious questions about its readiness to avoid collisions by massively undercounting the number of objects it will need to avoid in its orbits.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eAST could disrupt Starlink\u0026#39;s effective monopoly on satellite internet\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1921408/spacex-whines-to-feds-about-ast-satellites/\" data-post-title=\"SpaceX Whines To The Feds About Another Company Flooding Orbit With Satellites\" data-slide-num=\"1\" data-post-id=\"1921408\"\u003e\n                                             \u003cpicture id=\"p6b85a84cd6c0f44bbe494d930f1759d1\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/ast-could-disrupt-starlinks-effective-monopoly-on-satellite-internet-1753389823.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/ast-could-disrupt-starlinks-effective-monopoly-on-satellite-internet-1753389823.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/spacex-whines-to-the-feds-about-another-company-flooding-orbit-with-satellites/ast-could-disrupt-starlinks-effective-monopoly-on-satellite-internet-1753389823.jpg\" data-slide-url=\"https://www.jalopnik.com/1921408/spacex-whines-to-feds-about-ast-satellites/\" data-post-id=\"1921408\" data-slide-num=\"1\" data-slide-title=\"SpaceX Whines To The Feds About Another Company Flooding Orbit With Satellites: AST could disrupt Starlink\u0026#39;s effective monopoly on satellite internet\" width=\"780\" height=\"438\" alt=\"AST staff posing for a photo standing behind on the massive array of a BlueBird satellite\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAST SpaceMobile\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eOf course, SpaceX has a vested interest in grounding a potential competitor. Starlink customers currently connect to the network with an unwieldy flat receiver disk. While the recent launch of the backpack-portable Starlink Mini will draw more subscribers, AST SpaceMobile\u0026#39;s equipment-less product would deal a severe blow to SpaceX in the marketplace. There would be no barrier to entry, allowing users to immediately sign up for the global 5G service. AST estimates there are \u003ca href=\"https://ast-science.com/spacemobile-network/addressable-market/\" target=\"_blank\"\u003e3.7 billion cellphone users around the world\u003c/a\u003e without access to broadband coverage that it hopes to tap into.\u003c/p\u003e\n\u003cp\u003eCompetition concerns aside, SpaceX\u0026#39;s personnel are among the most experienced in determining whether a satellite poses a risk. The Starlink operator accounts for 60% of the satellites currently in orbit and has never had a collision with another satellite. However, low Earth orbit is only becoming more crowded with each passing year. Roscomos plans to launch a Russian satellite constellation later this year and Chinese companies are already underway with their own endeavors in orbit. If the space isn\u0026#39;t well regulated, then there could be a disaster that \u003ca href=\"https://www.jalopnik.com/falling-space-junk-is-a-growing-problem-that-is-only-go-1851572144/\" target=\"_blank\"\u003ecould endanger people on the ground\u003c/a\u003e or compromise humanity\u0026#39;s access to the final frontier.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-24T20:45:32Z",
  "modifiedTime": "2025-07-24T20:45:32Z"
}
