{
  "id": "5cbcb6b7-ea3f-420d-b535-1cfc5910b169",
  "title": "2026 Kia EV9 SUV gets range improvements, new edition",
  "link": "https://www.autocarindia.com/car-news/2026-kia-ev9-suv-gets-range-improvements-new-edition-435543#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Kia has introduced the third model year update for its all-electric EV9 SUV flagship in the US. In addition to improved range for select 2026 EV9 variants, a new Nightfall Edition featuring both exterior and interior, and performance upgrades is also on offer.  Kia EV9 Nightfall Edition features a Boost mode for extra torque output The electric SUV is sold in four variants in the US; India gets only the fully-loaded GT-Line trim 2026 Kia EV9 range details Up to 16.1km range added While the Kia EV9 in India is available only in the top-spec GT-Line, it's also sold in Land, Wind, Light LR and Light SR trims in America. Of these, the updated EV9 GT-Line sees the biggest improvement in range, up 16.1km to 451km (brand estimated; the official US EPA test cycle figure may vary). For reference, Kia claims a 561km range with the EV9 on the Indian ARAI test cycle. The Land and Wind variants note a 4.82km jump at 455km, while the Light LR settles with a tiny 1.6km jump at 491km. The Light SR variant comes with a 76.1kWh battery pack, whereas, the rest get a 99.8kWh unit. 2026 Kia EV9 Nightfall Edition Blacked-out exterior bits, Boost mode adds 100Nm torque Exclusive to the second-from-top EV9 Land variant, the all-new Nightfall Edition applies a black treatment to the 20-inch wheels and exterior badges. Despite the dark-themed bits, this isn't a usual 'Black Edition' we are used to seeing in India as it adds a Roadrider Brown colour instead of black. As for the interior, the black theme extends to the dashboard, and both the six and seven-seater EV9 models get Nightfall Edition-specific stitching patterns. The Nightfall Edition also has a Boost mode which increases the EV9 Land trim's torque by 100Nm to 700Nm, matching the GT-Line top model's torque output. Also see: VinFast VF7 spied in India before festive season launch New Jeep Cherokee revealed with hybrid powertrain",
  "author": "Uday Singh",
  "published": "Fri, 30 May 2025 15:21:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Uday Singh",
  "length": 2004,
  "excerpt": "The MY2026 EV9, available in the US, packs over 16km of added range for some trims and a new Nightfall Edition.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The MY2026 EV9, available in the US, packs over 16km of added range for some trims and a new Nightfall Edition.Kia has introduced the third model year update for its all-electric EV9 SUV flagship in the US. In addition to improved range for select 2026 EV9 variants, a new Nightfall Edition featuring both exterior and interior, and performance upgrades is also on offer. Kia EV9 Nightfall Edition features a Boost mode for extra torque outputThe electric SUV is sold in four variants in the US; India gets only the fully-loaded GT-Line trim2026 Kia EV9 range detailsUp to 16.1km range addedWhile the Kia EV9 in India is available only in the top-spec GT-Line, it's also sold in Land, Wind, Light LR and Light SR trims in America. Of these, the updated EV9 GT-Line sees the biggest improvement in range, up 16.1km to 451km (brand estimated; the official US EPA test cycle figure may vary). For reference, Kia claims a 561km range with the EV9 on the Indian ARAI test cycle. The Land and Wind variants note a 4.82km jump at 455km, while the Light LR settles with a tiny 1.6km jump at 491km. The Light SR variant comes with a 76.1kWh battery pack, whereas, the rest get a 99.8kWh unit.2026 Kia EV9 Nightfall EditionBlacked-out exterior bits, Boost mode adds 100Nm torqueExclusive to the second-from-top EV9 Land variant, the all-new Nightfall Edition applies a black treatment to the 20-inch wheels and exterior badges. Despite the dark-themed bits, this isn't a usual 'Black Edition' we are used to seeing in India as it adds a Roadrider Brown colour instead of black. As for the interior, the black theme extends to the dashboard, and both the six and seven-seater EV9 models get Nightfall Edition-specific stitching patterns.The Nightfall Edition also has a Boost mode which increases the EV9 Land trim's torque by 100Nm to 700Nm, matching the GT-Line top model's torque output.Also see:VinFast VF7 spied in India before festive season launchNew Jeep Cherokee revealed with hybrid powertrainImagesVideos",
  "image": "https://img.autocarindia.com/ExtraImages/20250530032050_Your paragraph text _12_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThe MY2026 EV9, available in the US, packs over 16km of added range for some trims and a new Nightfall Edition.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia\"\u003e\u003cstrong\u003eKia\u003c/strong\u003e\u003c/a\u003e has introduced the third model year update for its all-electric \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/ev9\"\u003eEV9\u003c/a\u003e\u003c/strong\u003e SUV flagship in the US. In addition to improved range for select 2026 EV9 variants, a new Nightfall Edition featuring both exterior and interior, and performance upgrades is also on offer. \u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eKia EV9 Nightfall Edition features a Boost mode for extra torque output\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eThe electric SUV is sold in four variants in the US; India gets only the fully-loaded GT-Line trim\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e2026 Kia EV9 range details\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003eUp to 16.1km range added\u003c/h3\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/News/2026_Kia_EV9_Rear_Quarter_Tracking.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003eWhile the \u003ca href=\"https://www.autocarindia.com/car-reviews/kia-ev9-review-german-class-luxury-435093\"\u003e\u003cstrong\u003eKia EV9 in India is available only in the top-spec GT-Line\u003c/strong\u003e\u003c/a\u003e, it\u0026#39;s also sold in Land, Wind, Light LR and Light SR trims in America. Of these, the updated EV9 GT-Line sees the biggest improvement in range, up 16.1km to 451km (brand estimated; the official US EPA test cycle figure may vary). For reference, Kia claims a 561km range with the EV9 on the Indian ARAI test cycle. The Land and Wind variants note a 4.82km jump at 455km, while the Light LR settles with a tiny 1.6km jump at 491km. The Light SR variant comes with a 76.1kWh battery pack, whereas, the rest get a 99.8kWh unit.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e2026 Kia EV9 Nightfall Edition\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003eBlacked-out exterior bits, Boost mode adds 100Nm torque\u003c/h3\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/News/2026_Kia_EV9_Interior.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003eExclusive to the second-from-top EV9 Land variant, the all-new Nightfall Edition applies a black treatment to the 20-inch wheels and exterior badges. Despite the dark-themed bits, this isn\u0026#39;t a usual \u0026#39;\u003ca href=\"https://www.autocarindia.com/auto-features/every-dark-edition-suv-from-rs-15-lakh-to-rs-30-lakh-in-india-434684\"\u003e\u003cstrong\u003eBlack Edition\u003c/strong\u003e\u003c/a\u003e\u0026#39; we are used to seeing in India as it adds a Roadrider Brown colour instead of black. As for the interior, the black theme extends to the dashboard, and both the six and seven-seater EV9 models get Nightfall Edition-specific stitching patterns.\u003c/p\u003e\u003cp\u003eThe Nightfall Edition also has a Boost mode which increases the EV9 Land trim\u0026#39;s torque by 100Nm to 700Nm, matching the GT-Line top model\u0026#39;s torque output.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/vinfast-vf7-spied-in-india-before-festive-season-launch-435537\"\u003eVinFast VF7 spied in India before festive season launch\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-jeep-cherokee-revealed-with-hybrid-powertrain-435542\"\u003e\u003cstrong\u003eNew Jeep Cherokee revealed with hybrid powertrain\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-435543\"\u003e\u003cul id=\"tab-id-435543\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-435543\" href=\"#.\" rel=\"#tab-images-container-435543\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-435543\" href=\"#.\" rel=\"#tab-videos-container-435543\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-30T15:21:00+05:30",
  "modifiedTime": null
}
