{
  "id": "5e611c2c-59a4-4ef5-a914-79fb9b1cb094",
  "title": "Throwback: The Hello Special Kei Truck",
  "link": "https://www.speedhunters.com/2024/10/throwback-the-hello-special-kei-truck/",
  "description": "It’s always fun to look into the lighthearted side of global car culture. And when you can also show what can be achieved at the extreme end of the customizing spectrum, that often leads to unique feature cars. Or, in this case, a truck. While JDM kei pickups are designed for hauling small loads around […] The post Throwback: The Hello Special Kei Truck appeared first on Speedhunters.",
  "author": "TheSpeedhunters",
  "published": "Thu, 31 Oct 2024 16:00:17 +0000",
  "source": "http://feeds.feedburner.com/speedhunters",
  "categories": [
    "Car Features",
    "Car Spotlight",
    "Content",
    "Carry",
    "drift",
    "Hello Special",
    "japan",
    "JDM",
    "Kei",
    "kei drift",
    "Kei Truck",
    "Suzuki",
    "Throwback"
  ],
  "byline": "TheSpeedhunters",
  "length": 7404,
  "excerpt": "It’s always fun to look into the lighthearted side of global car culture. And when you can also show what can be achieved at the extreme end of the customizing spectrum, that often leads to unique feature cars. Or, in this case, a truck. While JDM kei pickups are designed for hauling small loads around …",
  "siteName": "Speedhunters",
  "favicon": "",
  "text": "2024 IntroIt’s always fun to look into the lighthearted side of global car culture. And when you can also show what can be achieved at the extreme end of the customizing spectrum, that often leads to unique feature cars. Or, in this case, a truck. While JDM kei pickups are designed for hauling small loads around Japan, with a little out-of-the-box thinking, they can be so much more. Back in 2014, Dino showed us a crazy build from Hello Special based on the pint-sized Suzuki Carry platform. Let’s revisit that story for this week’s throwback post… 2014 FeatureIn April 2014, I headed out into the Japanese countryside – or inaka – to hunt down a stunning example of a shakotan S30 Fairlady Z owned by Oda-san. As exciting as the hunt for the S30 was, an equally compelling reason to be there was to investigate some rather colourful kei trucks I had seen a few months prior at the Tokyo Auto Salon. If you know the more curious side of Japan’s custom car scene, ‘Hello Special’ might ring a bell. If it doesn’t, then what I’m about to show you will give you a pretty good insight into the extreme work of this custom kei builder. By now, you know how diverse Japanese car culture is. If there’s a type of car, there will be a scene for it, and if there isn’t, someone sooner or later will make one. I guess that’s how Hello Special came to be. Oda-san saw the opportunity and took it. And by this, I mean he went full-out and set up a tuning outfit that deals exclusively in kei trucks. Kei cars and kei vans (kei referring to a light class of vehicles limited in physical size with a maximum engine of 660cc) are very popular as they are cheap to run and don’t require parking permits to show that you have space to keep a car outside, or close to your house. Kei trucks, on the other hand, have forever been the choice of Japanese farmers – their small footprints making them particularly well suited to be driven down narrow access roads around rice paddies or similar fields. And like anything with four wheels in Japan, they fall into the tuning trap! And that’s when Hello Special comes in. With this wild kei, Oda-san set out to show what can be achieved at the end of the customizing spectrum, and in the process, have some fun – recognizing that most kei truck owner may only want to add a few dress-up goodies to personalize their pocket-sized pickup. To do so, he contacted a long-time friend whose shop is a 30-minute drive back towards the center of Kyoto. It seems like we might be mentioning Miura-san a lot lately, but the truth of the matter is Rocket Bunny has been at the core of the JDM aero world for quite some time. The way he works has cut design and production times to a fraction of what they once used to be, which in turn has made it more economically viable for small shops – like Hello Special – to produce their own lines of original aero, which is exactly what you see here. Oda-san calls this one the Birichino kit. Along with the one-piece front bumper, which sports a series of integrated side vents and a bucktooth lower lip, Miura’s touch for the little Suzuki pickup included a set of works-inspired fender flares. This was one thing Oda-san really wanted to go for, as it would allow for a far more aggressive fitment when it came to the wheels. To achieve the look he was shooting for, Oda-san fitted Hello Special’s very own ’86’ original wheels – a modern rim styled to mimic popular designs from the late 1970s and early ’80s. The 14×7-inch wheels have been color-matched to the rest of that retina-piercing pink of the exterior and had skinny 155/55R14 Nankang Sport NS-II tires stretched over them. The Miura-designed aero has a deliberate continuity along the side of the truck, side skirts setting the tone with outlined air intakes mimicking the other vents throughout the kit. You just have to love the side intakes – very Ferrari Testarossa-like! A tall rear bumper section gives the Carry a rear end you have never seen on the back of a kei truck – all integrated with a diffuser-like grilled outlet at the very bottom. Ever seen a kei truck with a bed spoiler? Well, now you have! Oda-san has kept things functional, so there’s no crazy amount of negative camber to be seen. The rear end runs a solid rear axle, of course, which is why the wheels sit nice and square – albeit sporting just the right amount of poke. Aside from a Hello Special exhaust tip, which honestly doesn’t count, the engine remains stock standard. The only real mechanical upgrade is the welded diff, which was made to transform the little farmer’s workhorse into a fully-fledged drift truck! Okay, so ‘fully-fledged’ might be a bit misleading, but when the on-track opportunity allows, drifting is precisely what Oda-san uses his pink pickup for. With literally no weight over the rear axle, narrow tires, and an aggressive enough clutch kick, the Suzuki Carry has no problem getting all crossed up. And with careful use of the throttle (read: pinning it to the floor), it can be kept there. The coolest touch of all has to be the bumper-mounted external oil cooler. How Hakosuka-like of the little Carry! If you thought Oda-san might have stopped at the exterior with the modifications, you are very wrong. The most popular parts that Hello Special sells are interior accessories, and everything inside the cabin of these little trucks can be swapped out and upgraded. For his drift truck, he settled on a few select details. That includes the soft, quilted pink-camo steering wheel cover and a silky-smooth carpet panel on the dashboard. What made it interesting to me is how some, if not all of these details are things you would normally see in the dekotora scene – another Japanese custom automotive sub-genre that Mike briefly investigated in 2013. Like the seats below them, the headrests too got the pink camo treatment. You are looking at one of the most popular Hello Special items available: a heart-shaped tsurikawa train handle strap – something we always see on kaido racers. Here Oda-san lifts up the passenger seat to reveal the little three-cylinder 660cc KA6 engine that supplies the 50 or so horsepower to the Carry’s rear wheels. Despite what the truck’s exterior dimensions may suggest, the engine’s position actually makes it quite a nice-handling and neutral-steering little machine. With the cab literally over the front wheels the front suspension turrets are actually in the footwells. That makes it very easy to quickly adjust the settings on the Hello Special adjustable coilovers! Judging by the condition of those rear Nankangs it’s sure looked like Oda-san had been enjoying the odd skid – but I was reassured that sort of stuff is always done within the safety of a track.  I begged Oda-san to give me a little drifting demonstration, but there was no way he was going to interrupt the tranquility of the Japanese inaka by throwing his truck sideways and bouncing the engine off the limiter. His neighbours would be far from impressed! And so my time with one of the most unique feature cars of 2014 came to an end in the middle of the Kyoto countryside – the little Carry’s natural habitat. I left happy to have met one guy that has turned a fun idea into a proper business, catering and building cars that make people happy. The SpeedhuntersInstagram: thespeedhunters Dino Dalle CarbonareInstagram: dino_dalle_carbonaredino@speedhunters.com",
  "image": "https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2024/10/30163656/1-HelloSpecial-Carry-079N.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003e\u003cspan id=\"chapter-2024-intro\"\u003e2024 Intro\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIt’s always fun to look into the lighthearted side of global car culture. And when you can also show what can be achieved at the extreme end of the customizing spectrum, that often leads to unique feature cars. Or, in this case, a truck.\u003c/p\u003e\n\u003cp\u003eWhile JDM \u003cem\u003ekei\u003c/em\u003e pickups are designed for hauling small loads around Japan, with a little out-of-the-box thinking, they can be so much more. Back in 2014, Dino showed us a crazy build from Hello Special based on the pint-sized Suzuki Carry platform. Let’s revisit that story for this week’s throwback post…\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-198.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-198-680x453.jpg\" alt=\"HelloSpecial-Carry-198\" data-attachment-id=\"213677\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-198.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-198/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-198-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003e\u003cspan id=\"chapter-2014-feature\"\u003e2014 Feature\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIn April 2014, I headed out into the Japanese countryside – or \u003ci\u003einaka\u003c/i\u003e – to hunt down \u003ca href=\"http://www.speedhunters.com/2014/04/datsun-s30-the-shakotan-plan/\" target=\"_blank\"\u003ea stunning example of a \u003ci\u003eshakotan\u003c/i\u003e S30 Fairlady Z\u003c/a\u003e owned by Oda-san. As exciting as the hunt for the S30 was, an equally compelling reason to be there was to investigate some rather colourful \u003ci\u003ekei\u003c/i\u003e trucks I had seen a few months prior at the Tokyo Auto Salon. If you know the more curious side of Japan’s custom car scene, ‘Hello Special’ might ring a bell. If it doesn’t, then what I’m about to show you will give you a pretty good insight into the extreme work of this custom \u003ci\u003ekei\u003c/i\u003e builder.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-233.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-233-680x453.jpg\" alt=\"HelloSpecial-Carry-233\" data-attachment-id=\"213682\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-233.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-233/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-233-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eBy now, you know how diverse Japanese car culture is. If there’s a type of car, there will be a scene for it, and if there isn’t, someone sooner or later will make one. I guess that’s how Hello Special came to be. Oda-san saw the opportunity and took it. And by this, I mean he went full-out and set up a tuning outfit that deals exclusively in \u003ci\u003ekei\u003c/i\u003e trucks.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-215.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-215-680x453.jpg\" alt=\"HelloSpecial-Carry-215\" data-attachment-id=\"213679\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-215.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-215/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-215-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003e\u003ci\u003eKei\u003c/i\u003e cars and \u003cem\u003ek\u003c/em\u003e\u003ci\u003eei\u003c/i\u003e vans (\u003ci\u003ekei \u003c/i\u003ereferring to a light class of vehicles limited in physical size with a maximum engine of 660cc) are very popular as they are cheap to run and don’t require parking permits to show that you have space to keep a car outside, or close to your house. \u003ci\u003eKei\u003c/i\u003e trucks, on the other hand, have forever been the choice of Japanese farmers – their small footprints making them particularly well suited to be driven down narrow access roads around rice paddies or similar fields. And like anything with four wheels in Japan, they fall into the tuning trap! And that’s when Hello Special comes in.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-151.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-151-680x453.jpg\" alt=\"HelloSpecial-Carry-151\" data-attachment-id=\"213669\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-151.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-151/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-151-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eWith this wild \u003ci\u003ekei\u003c/i\u003e, Oda-san set out to show what can be achieved at the end of the customizing spectrum, and in the process, have some fun – recognizing that most \u003ci\u003ekei \u003c/i\u003etruck owner may only want to add a few dress-up goodies to personalize their pocket-sized pickup. To do so, he contacted a long-time friend whose shop is a 30-minute drive back towards the center of Kyoto.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-039.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-039-680x453.jpg\" alt=\"HelloSpecial-Carry-039\" data-attachment-id=\"213660\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-039.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-039/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-039-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eIt seems like we might be mentioning Miura-san a lot lately, but the truth of the matter is Rocket Bunny has been at the core of the JDM aero world for quite some time. The way he works has cut design and production times to a fraction of what they once used to be, which in turn has made it more economically viable for small shops – like Hello Special – to produce their own lines of original aero, which is exactly what you see here. Oda-san calls this one the \u003cem\u003eBirichino\u003c/em\u003e kit.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-038.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-038-680x453.jpg\" alt=\"HelloSpecial-Carry-038\" data-attachment-id=\"213659\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-038.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-038/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-038-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eAlong with the one-piece front bumper, which sports a series of integrated side vents and a bucktooth lower lip, Miura’s touch for the little Suzuki pickup included a set of works-inspired fender flares. This was one thing Oda-san really wanted to go for, as it would allow for a far more aggressive fitment when it came to the wheels.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-022.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-022-680x453.jpg\" alt=\"HelloSpecial-Carry-022\" data-attachment-id=\"213658\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-022.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-022/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-022-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eTo achieve the look he was shooting for, Oda-san fitted Hello Special’s very own ’86’ original wheels – a modern rim styled to mimic popular designs from the late 1970s and early ’80s. The 14×7-inch wheels have been color-matched to the rest of that retina-piercing pink of the exterior and had skinny 155/55R14 Nankang Sport NS-II tires stretched over them.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-172.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-172-680x453.jpg\" alt=\"HelloSpecial-Carry-172\" data-attachment-id=\"213673\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-172.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-172/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-172-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eThe Miura-designed aero has a deliberate continuity along the side of the truck, side skirts setting the tone with outlined air intakes mimicking the other vents throughout the kit.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-149.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-149-680x453.jpg\" alt=\"HelloSpecial-Carry-149\" data-attachment-id=\"213668\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-149.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-149/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-149-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eYou just have to love the side intakes – very Ferrari Testarossa-like!\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-166.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-166-680x453.jpg\" alt=\"HelloSpecial-Carry-166\" data-attachment-id=\"213671\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-166.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-166/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-166-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eA tall rear bumper section gives the Carry a rear end you have never seen on the back of a \u003ci\u003ekei\u003c/i\u003e truck – all integrated with a diffuser-like grilled outlet at the very bottom.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-168.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-168-680x453.jpg\" alt=\"HelloSpecial-Carry-168\" data-attachment-id=\"213672\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-168.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-168/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-168-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eEver seen a \u003cem\u003ekei\u003c/em\u003e truck with a bed spoiler? Well, now you have!\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-165.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-165-680x453.jpg\" alt=\"HelloSpecial-Carry-165\" data-attachment-id=\"213670\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-165.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-165/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-165-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eOda-san has kept things functional, so there’s no crazy amount of negative camber to be seen. The rear end runs a solid rear axle, of course, which is why the wheels sit nice and square – albeit sporting just the \u003cem\u003eright\u003c/em\u003e amount of poke.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-183.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-183-680x453.jpg\" alt=\"HelloSpecial-Carry-183\" data-attachment-id=\"213675\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-183.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-183/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-183-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eAside from a Hello Special exhaust tip, which honestly doesn’t count, the engine remains stock standard. The only real mechanical upgrade is the welded diff, which was made to transform the little farmer’s workhorse into a fully-fledged drift truck! Okay, so ‘fully-fledged’ might be a bit misleading, but when the on-track opportunity allows, drifting is precisely what Oda-san uses his pink pickup for. With literally no weight over the rear axle, narrow tires, and an aggressive enough clutch kick, the Suzuki Carry has no problem getting all crossed up. And with careful use of the throttle (read: pinning it to the floor), it can be kept there.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-205.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-205-680x453.jpg\" alt=\"HelloSpecial-Carry-205\" data-attachment-id=\"213678\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-205.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-205/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-205-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eThe coolest touch of all has to be the bumper-mounted external oil cooler. How \u003cem\u003eHakosuka\u003c/em\u003e-like of the little Carry!\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-141.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-141-680x453.jpg\" alt=\"HelloSpecial-Carry-141\" data-attachment-id=\"213667\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-141.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-141/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-141-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eIf you thought Oda-san might have stopped at the exterior with the modifications, you are very wrong. The most popular parts that Hello Special sells are interior accessories, and everything inside the cabin of these little trucks can be swapped out and upgraded. For his drift truck, he settled on a few select details.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-093.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-093-680x453.jpg\" alt=\"HelloSpecial-Carry-093\" data-attachment-id=\"213663\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-093.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-093/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-093-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eThat includes the soft, quilted pink-camo steering wheel cover and a silky-smooth carpet panel on the dashboard. What made it interesting to me is how some, if not \u003cem\u003eall\u003c/em\u003e of these details are things you would normally see in the \u003cem\u003edekotora\u003c/em\u003e scene – another Japanese custom automotive sub-genre that Mike briefly \u003ca href=\"http://www.speedhunters.com/2013/04/a-peek-into-the-magical-world-of-dekotora/\" target=\"_blank\"\u003einvestigated in 2013\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-127.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-127-680x453.jpg\" alt=\"HelloSpecial-Carry-127\" data-attachment-id=\"213666\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-127.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-127/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-127-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eLike the seats below them, the headrests too got the pink camo treatment.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-116.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-116-680x453.jpg\" alt=\"HelloSpecial-Carry-116\" data-attachment-id=\"213665\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-116.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-116/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-116-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eYou are looking at one of the most popular Hello Special items available: a heart-shaped \u003cem\u003etsurikawa\u003c/em\u003e train handle strap – something we always see on \u003cem\u003ekaido\u003c/em\u003e racers.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-226.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-226-680x453.jpg\" alt=\"HelloSpecial-Carry-226\" data-attachment-id=\"213681\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-226.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-226/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-226-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eHere Oda-san lifts up the passenger seat to reveal the little three-cylinder 660cc KA6 engine that supplies the 50 or so horsepower to the Carry’s rear wheels. Despite what the truck’s exterior dimensions may suggest, the engine’s position actually makes it quite a nice-handling and neutral-steering little machine.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-101.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-101-680x453.jpg\" alt=\"HelloSpecial-Carry-101\" data-attachment-id=\"213664\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-101.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-101/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-101-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eWith the cab literally over the front wheels the front suspension turrets are actually in the footwells. That makes it very easy to quickly adjust the settings on the Hello Special adjustable coilovers!\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-178.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-178-680x453.jpg\" alt=\"HelloSpecial-Carry-178\" data-attachment-id=\"213674\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-178.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-178/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-178-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003e\u003cspan\u003eJudging by the condition of those rear Nankangs it’s sure looked like Oda-san had been enjoying the odd skid – but I was reassured that sort of stuff is always done within the safety of a track. \u003c/span\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-219.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-219-680x453.jpg\" alt=\"HelloSpecial-Carry-219\" data-attachment-id=\"213680\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-219.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-219/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-219-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eI begged Oda-san to give me a little drifting demonstration, but there was no way he was going to interrupt the tranquility of the Japanese\u003cem\u003e inaka\u003c/em\u003e by throwing his truck sideways and bouncing the engine off the limiter. His neighbours would be far from impressed!\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"http://www.speedhunters.com/wp-content/uploads/2014/09/HelloSpecial-Carry-187.jpg\"\u003e\u003cimg src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-187-680x453.jpg\" alt=\"HelloSpecial-Carry-187\" data-attachment-id=\"213676\" data-go-fullscreen=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-187.jpg\" data-can-print=\"true\" data-attachment-url=\"https://www.speedhunters.com/2014/09/the-kei-drift-truck/hellospecial-carry-187/\" data-src=\"https://s3.amazonaws.com/speedhunters-wp-production/wp-content/uploads/2014/09/23034505/HelloSpecial-Carry-187-1200x800.jpg\"/\u003e\u003c/a\u003e\u003c/figure\u003e\u003cp\u003eAnd so my time with one of the most unique feature cars of 2014 came to an end in the middle of the Kyoto countryside – the little Carry’s natural habitat. I left happy to have met one guy that has turned a fun idea into a proper business, catering and building cars that make people happy.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Speedhunters\u003cbr/\u003e\u003c/strong\u003eInstagram: \u003ca href=\"http://instagram.com/thespeedhunters\" target=\"_blank\"\u003ethespeedhunters\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDino Dalle Carbonare\u003cbr/\u003e\u003c/strong\u003eInstagram: \u003ca href=\"http://instagram.com/dino_dalle_carbonare\" target=\"_blank\"\u003edino_dalle_carbonare\u003c/a\u003e\u003ca href=\"http://instagram.com/speedhunters_dino\" target=\"_blank\"\u003e\u003cbr/\u003e\u003c/a\u003edino@speedhunters.com\u003c/p\u003e\n\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-31T09:00:17Z",
  "modifiedTime": "2024-10-31T03:39:14Z"
}
