{
  "id": "66559f52-915b-4f64-9675-32499546f789",
  "title": "Bentley Continental GT",
  "link": "https://www.autocar.co.uk/car-review/bentley/continental-gt",
  "description": "'Entry-level' version of big luxury coupé now has a 671bhp V8-engined plug-in hybrid powertrain For this, the latest Bentley Continental GT, Crewe broke with convention and got things going with a bang.In the past, we’ve had to wait a short while for the excesses of the Speed derivative, but for the Mk4 car it was the first one out of the factory and into showrooms. Here’s the new 208mph Conti GT, they said. It will out-drag a Ferrari Enzo yet cruise more quietly than the latest Mercedes-AMG S63. Satisfied?If the goal was to make a statement, job done. We can now move onto the model most owners will opt for: the ‘regular’ Continental GT, which is of course nothing of the sort, becuase the entry-level car is mechanically closer to the Speed than ever before.For one thing, both cars use the same V8 hybrid powertrain (detuned from 771bhp in the ‘Ultra Performance Hybrid’ Speed to merely 671bhp in ‘High Performance Hybrid’, as this lesser powertrain is known).Both also have the same Porsche-developed dual-clutch gearbox, the same two-chamber air suspension, active anti-roll bars, rear-steering and electronically controlled limited-slip differential, which plays a pivotal role in controlling the amount of torque each side of the car gets.This hardware overlap is confirmed by the homologated weights: exactly 2384kg for each car. Of course, in terms of their calibration, all these systems are also tuned for less ‘attack’ than in the Speed.You can read all about the Speed here, courtesy of a full, instrumented road test in the UK. The regular Continental GT will soon undergo the same treatment and we will record a formal verdict, but for now, these impressions are from a brief blast at an event in the US.",
  "author": "",
  "published": "Tue, 24 Jun 2025 00:01:04 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Deputy road test editor Follow:",
  "length": 2127,
  "excerpt": "'Entry-level' version of big luxury coupé now has a 671bhp V8-engined plug-in hybrid powertrain",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The standard Continental GT cabin, with its fine balance of digital and physical controls, is stunningly opulent – even more so if you opt for the panoramic roof. In fact, without the Dinamica trim of the Speed, it is arguably an even more compelling, elegant luxury space. As ever, you can split the hide colours, merging the entire rear portion of the cabin, including the rear seats, in with the front doorcards, with a contrasting colour for front chairs so indulgently sculpted they border on the soporific. Altering the focus in this way makes the Continental GT feel even more debonair.  For those who need the last word in deco-era chic, there’s also the Azure, which sits between the basic car and the more powerful Speed and is recognisable by its neo-classical wheels, its more prominent exterior brightwork and vertical grille slats (a look not all will love). There's also a striking, parquet-style transmission-tunnel lacquered trim.     The character of your Continental GT is going to be dictacted by the tone of the leather and your chosen veneers, of which there are many. There are technical finishes such as turned aluminium, carbonfibre and even, for the horlogically inclined, a Côtes de Genève finish, as well as the usual suspect: burr walnut, dark eucalyptus and plenty of painted gloss options. As for ergonomics, the Continental GT is never going set you as low to the road – or position with the same degree or intent – as something like an Aston Martin Vanquish or Ferrari 12Cilinidri, but it isn't intended to directly challenge those cars. The view forward is more commanding and relaxing and generally easier to get along with. A thousand miles in a day in a Continental GT is no hardship at all (and your scribe should know). Drawbacks? Taller drivers will pine a just a little more reach in the steering column, although strangely none of the current batch of super-GT get this quite right. Elsewhere, the boot has shrunk, on account of the new hybrid hardware. It's now notably shallower, although for two people the Continental GT can still hardly be accused of being tight on luggage space.",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/bentley-continentl-gt-review-2025-01-front-tracking.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe standard Continental GT cabin, with its fine balance of digital and physical controls, is stunningly opulent – even more so if you opt for the panoramic roof. In fact, without the Dinamica trim of the Speed, it is arguably an even more compelling, elegant luxury space.\u003c/p\u003e\n\u003cp\u003eAs ever, you can split the hide colours, merging the entire rear portion of the cabin, including the rear seats, in with the front doorcards, with a contrasting colour for front chairs so indulgently sculpted they border on the soporific. Altering the focus in this way makes the \u003cspan\u003eContinental\u003c/span\u003e GT feel even more debonair. \u003c/p\u003e\n\u003cp\u003eFor those who need the last word in deco-era chic, there’s also the Azure, which sits between the basic car and the more powerful Speed and is recognisable by its neo-classical wheels, its more prominent exterior brightwork and vertical grille slats (a look not all will love). There\u0026#39;s also a striking, parquet-style transmission-tunnel lacquered trim.    \u003c/p\u003e\n\u003cp\u003eThe character of your \u003cspan\u003eContinental\u003c/span\u003e GT is going to be dictacted by the tone of the leather and your chosen veneers, of which there are many. There are technical finishes such as turned aluminium, carbonfibre and even, for the horlogically inclined, a Côtes de Genève finish, as well as the usual suspect: burr walnut, dark eucalyptus and plenty of painted gloss options.\u003c/p\u003e\n\u003cp\u003eAs for ergonomics, the Continental GT is never going set you as low to the road – or position with the same degree or intent – as something like an \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/vanquish\"\u003eAston Martin Vanquish\u003c/a\u003e or \u003ca href=\"https://www.autocar.co.uk/car-review/ferrari/12cilindri\"\u003eFerrari 12Cilinidri\u003c/a\u003e, but it isn\u0026#39;t intended to directly challenge those cars. The view forward is more commanding and relaxing and generally easier to get along with. A thousand miles in a day in a Continental GT is no hardship at all (and your scribe\u003ca href=\"https://www.autocar.co.uk/car-news/features/ultimate-gt-820-miles-12-hours-bentley-continental\"\u003e should know\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eDrawbacks? Taller drivers will pine a just a little more reach in the steering column, although strangely none of the current batch of super-GT get this quite right. Elsewhere, the boot has shrunk, on account of the new hybrid hardware. It\u0026#39;s now notably shallower, although for two people the Continental GT can still hardly be accused of being tight on luggage space.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
