{
  "id": "6d7d1131-67cc-4a30-a8b1-ab56907e7ad4",
  "title": "Hyundai Inster EV-based one-off race car concept teased",
  "link": "https://www.autocarindia.com/car-news/hyundai-inster-ev-based-one-off-race-car-concept-teased-434967#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Hyundai has teased a one-off race car concept based on the Inster micro-EV. It’s called the Insteroid, and the name summarises the idea behind the concept: Inster on steroids. Hyundai calls it a “playful interpretation” of the Inster and says its design is inspired by video game aesthetics. The car will be fully revealed to the public in early April. The Insteroid is a one-off concept based on the Inster EV micro-EV It gets extensive aerodynamic bodywork and a stripped-down interior Its styling is inspired by video game aesthetics; it’ll be fully revealed in April Hyundai Insteroid exterior and interior design details WRC-spec rear wing, 21-inch aero wheels The most distinguishing feature of the Insteroid visible in the teaser is its massive WRC-style double-decker rear wing. The Insteroid also gets hugely flared front and rear bumpers and fenders with gaping air vents for aerodynamic efficiency. Almost none of the body panels seem to be shared with the regular Inster, and we can also spot a wide-arch body kit that stretches from the front to back. The only things that appear to be common with the Inster EV are the circular LED headlamps and pixel LED tail-lights. The Insteriod rides on 21-inch wheels with aero covers that have three holes in the centre. It also gets a roof scoop and a prominent rear diffuser. Meanwhile, the interior seems completely stripped out and comes fitted with a roll cage. Hyundai says there are ‘fun details’, with plenty to discover in every element, including the control buttons and instrument cluster. The company hasn’t revealed any technical specifications as yet, but we’ll have more details and a complete look at the car’s exterior and interior when it is officially revealed next month.   Also See: Nissan Micra EV, third-gen Leaf revealed Kia EV6 facelift launched at Rs 65.9 lakh; electric SUV has 663km range",
  "author": "Saptarshi Mondal",
  "published": "Sun, 30 Mar 2025 08:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Saptarshi  Mondal",
  "length": 1943,
  "excerpt": "Called the Insteroid, the car is a \u0026amp;#8216;playful interpretation\u0026amp;#8217; of the Inster EV.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Called the Insteroid, the car is a ‘playful interpretation’ of the Inster EV.Hyundai has teased a one-off race car concept based on the Inster micro-EV. It’s called the Insteroid, and the name summarises the idea behind the concept: Inster on steroids. Hyundai calls it a “playful interpretation” of the Inster and says its design is inspired by video game aesthetics. The car will be fully revealed to the public in early April.The Insteroid is a one-off concept based on the Inster EV micro-EVIt gets extensive aerodynamic bodywork and a stripped-down interiorIts styling is inspired by video game aesthetics; it’ll be fully revealed in AprilHyundai Insteroid exterior and interior design details WRC-spec rear wing, 21-inch aero wheels The most distinguishing feature of the Insteroid visible in the teaser is its massive WRC-style double-decker rear wing. The Insteroid also gets hugely flared front and rear bumpers and fenders with gaping air vents for aerodynamic efficiency.Almost none of the body panels seem to be shared with the regular Inster, and we can also spot a wide-arch body kit that stretches from the front to back. The only things that appear to be common with the Inster EV are the circular LED headlamps and pixel LED tail-lights.The Insteriod rides on 21-inch wheels with aero covers that have three holes in the centre. It also gets a roof scoop and a prominent rear diffuser. Meanwhile, the interior seems completely stripped out and comes fitted with a roll cage. Hyundai says there are ‘fun details’, with plenty to discover in every element, including the control buttons and instrument cluster.The company hasn’t revealed any technical specifications as yet, but we’ll have more details and a complete look at the car’s exterior and interior when it is officially revealed next month.  Also See:Nissan Micra EV, third-gen Leaf revealedKia EV6 facelift launched at Rs 65.9 lakh; electric SUV has 663km rangeVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250328022614_3 _60_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eCalled the Insteroid, the car is a ‘playful interpretation’ of the Inster EV.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/hyundai\"\u003eHyundai\u003c/a\u003e\u003c/strong\u003e has teased a one-off race car concept based on the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/hyundai-inster-ev-suv-breaks-cover-432043\"\u003eInster micro-EV\u003c/a\u003e\u003c/strong\u003e. It’s called the Insteroid, and the name summarises the idea behind the concept: Inster on steroids. Hyundai calls it a “playful interpretation” of the Inster and says its design is inspired by video game aesthetics. The car will be fully revealed to the public in early April.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eThe Insteroid is a one-off concept based on the Inster EV micro-EV\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIt gets extensive aerodynamic bodywork and a stripped-down interior\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIts styling is inspired by video game aesthetics; it’ll be fully revealed in April\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eHyundai Insteroid exterior and interior design details \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cspan\u003e\u003cstrong\u003eWRC-spec rear wing, 21-inch aero wheels \u003c/strong\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003eThe most distinguishing feature of the Insteroid visible in the teaser is its massive WRC-style double-decker rear wing. The Insteroid also gets hugely flared front and rear bumpers and fenders with gaping air vents for aerodynamic efficiency.\u003c/p\u003e\u003cp\u003eAlmost none of the body panels seem to be shared with the regular Inster, and we can also spot a wide-arch body kit that stretches from the front to back. The only things that appear to be common with the Inster EV are the circular LED headlamps and pixel LED tail-lights.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/1 (73).jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe Insteriod rides on 21-inch wheels with aero covers that have three holes in the centre. It also gets a roof scoop and a prominent rear diffuser. Meanwhile, the interior seems completely stripped out and comes fitted with a roll cage. Hyundai says there are ‘fun details’, with plenty to discover in every element, including the control buttons and instrument cluster.\u003c/p\u003e\u003cp\u003eThe company hasn’t revealed any technical specifications as yet, but we’ll have more details and a complete look at the car’s exterior and interior when it is officially revealed next month.  \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/nissan-micra-ev-third-gen-leaf-revealed-434949\"\u003e\u003cstrong\u003eNissan Micra EV, third-gen Leaf revealed\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-ev6-facelift-launched-at-rs-65-9-lakh-electric-suv-has-663km-range-434923\"\u003e\u003cstrong\u003eKia EV6 facelift launched at Rs 65.9 lakh; electric SUV has 663km range\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434967\"\u003e\u003cul id=\"tab-id-434967\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434967\" href=\"#.\" rel=\"#tab-videos-container-434967\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-30T08:00:00+05:30",
  "modifiedTime": null
}
