{
  "id": "7d95441c-c89d-46e8-b853-004d137a7973",
  "title": "The New Mail Truck Situation Keeps Getting Dumber",
  "link": "https://www.thetruthaboutcars.com/cars/news-blog/the-new-mail-truck-situation-keeps-getting-dumber-44514805?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
  "description": "Senate Republicans are attempting to scrap the U.S. Postal Service (USPS) ongoing transition to all-electric vehicles on the grounds that the program is financially irresponsible. They want to scrap a large portion of the money put aside for EV programs in the new tax and budget omnibus bill. However, Senate Parliamentarian Elizabeth MacDonough has said the plan doesn’t constitute proper legislative procedure.",
  "author": "Matt Posky",
  "published": "Mon, 23 Jun 2025 20:00:00 +0000",
  "source": "https://www.thetruthaboutcars.com/feed/",
  "categories": [
    "News Blog"
  ],
  "byline": "Matt Posky",
  "length": 9943,
  "excerpt": "Senate Republicans are attempting to scrap the U.S. Postal Service (USPS) ongoing transition to all-electric vehicles on the grounds that the program is fina…",
  "siteName": "Ttac",
  "favicon": "https://cdn-fastly.thetruthaboutcars.com/resources/themes/ttac/imgs-responsive/ttac-apple-touch-icon.png",
  "text": "Published:  June 23rd, 2025 Senate Republicans are attempting to scrap the U.S. Postal Service (USPS) ongoing transition to all-electric vehicles on the grounds that the program is financially irresponsible. They want to scrap a large portion of the money put aside for EV programs in the new tax and budget omnibus bill. However, Senate Parliamentarian Elizabeth MacDonough has said the plan doesn’t constitute proper legislative procedure.For whatever reason, electrification has broadly become yet another partisan issue. MacDonough is getting a fair amount of praise from her fellow Democrats while select Republicans are bemoaning the process. According to Reuters, the postal service is also expressing some dismay over the prospect of not getting more vehicles after it spent over a decade trying to get funding to replace aging delivery fleets.From Reuters:USPS warned on June 13 that scrapping the electric vehicles would cost it $1.5 billion, including $1 billion to replace its current fleet of EVs and $500 million in EV infrastructure rendered useless and \"seriously cripple our ability to replace an aging and obsolete delivery fleet.\"Senate parliamentarian Elizabeth MacDonough, whose role is to ensure lawmakers follow proper legislative procedure, said a provision to force the sale could not be approved via a simple majority vote in the Republican-controlled chamber and will instead need a 60-vote supermajority, according to Democrats on the Senate Budget Committee.She ruled last week that Republicans cannot use the bill to overturn landmark rules to drastically reduce vehicle emissions and boost EV sales.Senate Republicans have also sought to reclaim more than $1 billion out of $3 billion Congress gave USPS in 2023 as part of a $430 billion climate bill to buy EVs and charging infrastructure — including $1.2 billion for electric vehicles.USPS told Congress \"summarily removing all electric vehicles and charging infrastructure would hobble our ability to deliver to the American people, it would directly harm our ability to serve your constituents, and it would waste crucial funds for no reasonable purpose.\"The broader climate bill has fallen under an immense amount of pressure after investigations revealed that it had not realistically yielded much beyond putting money into corporate pockets. Very few government fleets have pivoted to all-electric vehicles and only a handful of new charging stations have actually been built.Regardless of which angle it’s viewed from, the mail truck situation feels almost like a parody of dysfunctional governance. It’s glaringly obvious that emissions regulations are totally out of whack and have nothing to do with any legitimate concerns about sustainability. Massive omnibus bills have simultaneously been used to push through unsavory spending programs and load up bills with pork. Meanwhile, the Postal Service has been struggling to make money (losing over $100 billion since 2008) and is saddled with old vehicles it can barely maintain while the opposing political parties bicker about how best to waste tax dollars.The Grumman Long Life Vehicles (LLVs) were produced between 1987 and 1994. Considering that they were originally anticipated to remain in service for 24 years, they’ve more than lived up to their name. LLVs (pictured below) typically go 200,000 miles before needing an overhaul and many remain in service today with many more miles than that on their odometer. While the LLV was supposed to see its replacement manifest around 2010, Oshkosh Defense wouldn’t get approval to build the Next Generation Delivery Vehicle (NGDV) until 2021. The assumption was that the company would focus on all-electric models to adhere to provisions outlined by the Biden administration to pivot federal fleets toward EVs. But the Postal Service pushed back by saying many routes weren’t suited to charging or operating battery powered vehicles. USPS leadership suggested that it might be able to take a larger share of all-electric trucks if it was provided with more money. However, prepping offices to facilitate EVs and just building the trucks has taken longer than anticipated. Despite Oshkosh NGDVs officially entering service in 2024, most regions are still reliant on a mix of ancient Grumman LLVs and vans (e.g. Ford Transit, Dodge Caravan) that have been converted for local deliveries. Another thing to remember is that these so-called climate spending initiatives are already in place and the recipients of those funds certainly do not want them to be dissolved. The USPS anticipated buying over 60,000 electric vehicles by 2028. Meanwhile, Oshkosh planned on building a 50/50 mix of combustion and electric mail trucks for the Postal Service. Then we have to consider all the new-energy businesses building the relevant infrastructure. The USPS has said that scrapping the existing programs would mean replacing 7,200 electric vehicles and costing the Postal Service over $450 million. Additionally, it said it would waste $540 million in electrical infrastructure \"which is literally buried under parking lots, and there is no market for used charging equipment.” Republicans have alleged that is just more evidence of bad financial planning, when the mail trucks could have simply been preexisting hybrids or ultra-reliable, modernized combustion vehicles akin to the original Grumman trucks and foregone the expensive EV infrastructure investments. Senator Rand Paul (R-KY) stated that the Republican plan “aims to cut unnecessary costs and focus USPS on delivering mail and not achieving the environmental initiatives pushed by the Biden Administration.” As for the truth about whether or not the Senate has followed proper parliamentary procedure, one could debate either side. Congress hasn’t bothered following those guidelines when it comes to war and is often ignored by federal agencies when they attempt to institute new regulations. The government also doesn’t seem to take umbrage with protocol when it’s adding spending programs as often as when someone wants to take them away — regardless of the political party. The normalization of sweeping omnibus bills likewise make any discussion of the issue borderline irrelevant since there’s always going to be conflicting items. When a bill is over 1,000 pages, there will absolutely be countless items you’re opposed to offsetting the handful of inclusions that you support. So your final feelings on the USPS spending may end up being secondary to other items. For example, the current tax bill eases some purchasing restrictions on firearms accessories and is trying to reduce spending on some of those other EV subsidies in an effort to court Republicans. However, it also increases the debt ceiling by over $4 trillion, which is something conservative voters have said they’re broadly against. Donald Trump repeatedly stated that his administration would eliminate debt during the 2024 presidential campaign, with the matter almost assuredly contributing to the election results.The point is that the USPS trucks may just end up being a bargaining chip for something else as the two parties bicker. But, even if the Postal Service's electrification funding does get scrapped, the matter will assuredly become a legal battle (something we’ve repeatedly seen happen with attempts to roll back vehicle emissions). Whether or not the USPS gets more trucks from Oshkosh next year, a sizable amount of money will already have been spent. [Images: Oshkosh; PJ McDonnell/Shutterstock; Karolis Kavolelis/Shutterstock]Become a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by  subscribing to our newsletter. Consumer advocate tracking industry trends and regulations. Before joining TTAC, Matt spent a decade working for marketing and research firms based in NYC. Clients included several of the world’s largest automakers, global tire brands, and aftermarket part suppliers. Dissatisfied, he pivoted to writing about cars. Since then, he has become an ardent supporter of the right-to-repair movement, been interviewed about the automotive sector by national broadcasts, participated in a few amateur rallying events, and driven more rental cars than anyone ever should. Handy with a wrench, Matt grew up surrounded by Detroit auto workers and learned to drive by twelve. A contrarian, Matt claims to prefer understeer and motorcycles. More by Matt Posky",
  "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/06/23/15291/social-44514805.jpg?size=1200x628",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                    \n                    \n                    \n\n        \u003cdiv\u003e\n                \u003cp\u003e\u003ca data-js-href=\"/member/1357641/mattposky\"\u003e\n                    \u003cimg src=\"https://cdn-fastly.thetruthaboutcars.com/media/profile/2022/08/25/1357641_2.jpg?size=91x91\" width=\"74\" height=\"74\" alt=\"Matt Posky\"/\u003e\n                \u003c/a\u003e\u003c/p\u003e\n        \u003c/div\u003e\n\n                        \u003cdiv\u003e\n                                    \u003cp\u003e\u003cspan\u003e \u003cstrong\u003ePublished: \u003c/strong\u003e June 23rd, 2025\u003c/span\u003e\u003c/p\u003e                        \u003c/div\u003e\n\n\n                        \n\n                    \n                    \n\n\n\n\n                    \u003cdiv data-tr_zone=\"Activity Body\"\u003e\n                        \n\n                        \n\n\n                            \n                            \n                                \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003eSenate Republicans are attempting to scrap the U.S. Postal Service (USPS) ongoing transition to all-electric vehicles on the grounds that the program is financially irresponsible. They want to scrap a large portion of the money put aside for EV programs in the new tax and budget omnibus bill. However, Senate Parliamentarian Elizabeth MacDonough has said the plan doesn’t constitute proper legislative procedure.\u003c/p\u003e\u003ccuttext\u003e\u003c/cuttext\u003e\u003cp\u003eFor whatever reason, electrification has broadly become yet another partisan issue. MacDonough is getting a fair amount of praise from her fellow Democrats while select Republicans are bemoaning the process. \u003ca href=\"https://www.reuters.com/business/autos-transportation/senate-republicans-cannot-force-us-postal-service-scrap-evs-parliamentarian-says-2025-06-23/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eAccording to \u003c/a\u003e\u003ci\u003e \u003ca href=\"https://www.reuters.com/business/autos-transportation/senate-republicans-cannot-force-us-postal-service-scrap-evs-parliamentarian-says-2025-06-23/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eReuters\u003c/a\u003e\u003c/i\u003e, the postal service is also expressing some dismay over the prospect of not getting more vehicles after it spent over a decade trying to get funding to replace aging delivery fleets.\u003c/p\u003e\u003cp\u003eFrom \u003ci\u003eReuters\u003c/i\u003e:\u003c/p\u003e\u003cblockquote\u003eUSPS warned on June 13 that scrapping the electric vehicles would cost it $1.5 billion, including $1 billion to replace its current fleet of EVs and $500 million in EV infrastructure rendered useless and \u0026#34;seriously cripple our ability to replace an aging and obsolete delivery fleet.\u0026#34;\u003c/blockquote\u003e\u003cblockquote\u003eSenate parliamentarian Elizabeth MacDonough, whose role is to ensure lawmakers follow proper legislative procedure, said a provision to force the sale could not be approved via a simple majority vote in the Republican-controlled chamber and will instead need a 60-vote supermajority, according to Democrats on the Senate Budget Committee.\u003c/blockquote\u003e\u003cblockquote\u003eShe ruled last week that Republicans cannot use the bill to overturn landmark rules to drastically reduce vehicle emissions and boost EV sales.\u003c/blockquote\u003e\u003cblockquote\u003eSenate Republicans have also sought to reclaim more than $1 billion out of $3 billion Congress gave USPS in 2023 as part of a $430 billion climate bill to buy EVs and charging infrastructure — including $1.2 billion for electric vehicles.\u003c/blockquote\u003e\u003cblockquote\u003eUSPS told Congress \u0026#34;summarily removing all electric vehicles and charging infrastructure would hobble our ability to deliver to the American people, it would directly harm our ability to serve your constituents, and it would waste crucial funds for no reasonable purpose.\u0026#34;\u003c/blockquote\u003e\u003cp\u003eThe broader climate bill has fallen under an immense amount of pressure after investigations revealed that it had not realistically yielded much beyond putting money into corporate pockets. Very few government fleets have pivoted to all-electric vehicles and only a handful of new charging stations have actually been built.\u003c/p\u003e\u003cp\u003eRegardless of which angle it’s viewed from, the mail truck situation feels almost like a parody of dysfunctional governance. It’s glaringly obvious that emissions regulations are totally out of whack and have nothing to do with any legitimate concerns about sustainability. Massive omnibus bills have simultaneously been used to push through unsavory spending programs and load up bills with pork. Meanwhile, the Postal Service has been struggling to make money (losing over $100 billion since 2008) and is saddled with old vehicles it can barely maintain while the opposing political parties bicker about how best to waste tax dollars.\u003c/p\u003e\u003cp\u003eThe Grumman Long Life Vehicles (LLVs) were produced between 1987 and 1994. Considering that they were originally anticipated to remain in service for 24 years, they’ve more than lived up to their name. LLVs (pictured below) typically go 200,000 miles before needing an overhaul and many remain in service today with many more miles than that on their odometer.\u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003eWhile the LLV was supposed to see its replacement manifest around 2010, Oshkosh Defense wouldn’t get approval to build the Next Generation Delivery Vehicle (NGDV) until 2021. The assumption was that the company would focus on all-electric models to adhere to provisions outlined by the Biden administration to pivot federal fleets toward EVs. But the Postal Service pushed back by saying many routes weren’t suited to charging or operating battery powered vehicles. \u003c/p\u003e\u003cp\u003eUSPS leadership suggested that it might be able to take a larger share of all-electric trucks if it was provided with more money. However, \u003ca href=\"https://www.thetruthaboutcars.com/cars/news-blog/new-postal-service-evs-way-behind-schedule-cancellation-rumored-44510815\"\u003eprepping offices to facilitate EVs and just building the trucks has taken longer than anticipated\u003c/a\u003e. Despite Oshkosh NGDVs officially entering service in 2024, most regions are still reliant on a mix of ancient Grumman LLVs and vans (e.g. Ford Transit, Dodge Caravan) that have been converted for local deliveries. \u003c/p\u003e\u003cp\u003eAnother thing to remember is that these so-called climate spending initiatives are already in place and the recipients of those funds certainly do not want them to be dissolved. The USPS anticipated buying over 60,000 electric vehicles by 2028. Meanwhile, Oshkosh planned on building a 50/50 mix of combustion and electric mail trucks for the Postal Service. Then we have to consider all the new-energy businesses building the relevant infrastructure. \u003c/p\u003e\u003cp\u003eThe USPS has said that scrapping the existing programs would mean replacing 7,200 electric vehicles and costing the Postal Service over $450 million. Additionally, it said it would waste $540 million in electrical infrastructure \u0026#34;which is literally buried under parking lots, and there is no market for used charging equipment.”  \u003c/p\u003e\u003cp\u003eRepublicans have alleged that is just more evidence of bad financial planning, when the mail trucks could have simply been preexisting hybrids or ultra-reliable, modernized combustion vehicles akin to the original Grumman trucks and foregone the expensive EV infrastructure investments. \u003c/p\u003e\u003cp\u003eSenator Rand Paul (R-KY) stated that the Republican plan “aims to cut unnecessary costs and focus USPS on delivering mail and not achieving the environmental initiatives pushed by the Biden Administration.”\u003c/p\u003e\u003c/div\u003e\n\n                    \n\n\n                    \n                            \n                            \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003eAs for the truth about whether or not the Senate has followed proper parliamentary procedure, one could debate either side. Congress hasn’t bothered following those guidelines when it comes to war and is often ignored by federal agencies when they attempt to institute new regulations. The government also doesn’t seem to take umbrage with protocol when it’s adding spending programs as often as when someone wants to take them away — regardless of the political party.  \u003c/p\u003e\u003cp\u003eThe normalization of sweeping omnibus bills likewise make any discussion of the issue borderline irrelevant since there’s always going to be conflicting items. When a bill is over 1,000 pages, there will absolutely be countless items you’re opposed to offsetting the handful of inclusions that you support. So your final feelings on the USPS spending may end up being secondary to other items. \u003c/p\u003e\u003cp\u003eFor example, the current tax bill eases some purchasing restrictions on firearms accessories and is trying to reduce spending on some of those other EV subsidies in an effort to court Republicans. However, it also increases the debt ceiling by over $4 trillion, which is something conservative voters have said they’re broadly against. Donald Trump repeatedly stated that his administration would eliminate debt during the 2024 presidential campaign, with the matter almost assuredly contributing to the election results.\u003c/p\u003e\u003cp\u003eThe point is that the USPS trucks may just end up being a bargaining chip for something else as the two parties bicker. But, even if the Postal Service\u0026#39;s electrification funding does get scrapped, the matter will assuredly become a legal battle (something we’ve repeatedly seen happen with attempts to roll back vehicle emissions). Whether or not the USPS gets more trucks from Oshkosh next year, a sizable amount of money will already have been spent. \u003c/p\u003e\u003c/div\u003e\n\n                    \n\n\n\n                                \n                                \n\n                            \n                            \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003e[Images: Oshkosh; PJ McDonnell/Shutterstock; Karolis Kavolelis/Shutterstock]\u003c/p\u003e\u003cp\u003e\u003ci\u003eBecome a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by \u003c/i\u003e\u003ci\u003e \u003ca href=\"https://email.thetruthaboutcars.com/newsletter-signup/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esubscribing to our newsletter\u003c/a\u003e\u003c/i\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n\n                        \n                    \u003c/div\u003e\n\n                    \n                    \n\n            \n\n\n                    \n\n                        \n                        \n\n                        \n                        \n    \n\n\n\n            \n                    \n\n            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdn-fastly.thetruthaboutcars.com/media/profile/2022/08/25/1357641_2.jpg?size=91x91\" alt=\"Matt Posky\" width=\"90\" height=\"90\"/\u003e\u003c/p\u003e\u003cdiv\u003e\n                    \n                    \u003cp\u003eConsumer advocate tracking industry trends and regulations. Before joining TTAC, Matt spent a decade working for marketing and research firms based in NYC. Clients included several of the world’s largest automakers, global tire brands, and aftermarket part suppliers. Dissatisfied, he pivoted to writing about cars. Since then, he has become an ardent supporter of the right-to-repair movement, been interviewed about the automotive sector by national broadcasts, participated in a few amateur rallying events, and driven more rental cars than anyone ever should. Handy with a wrench, Matt grew up surrounded by Detroit auto workers and learned to drive by twelve. A contrarian, Matt claims to prefer understeer and motorcycles.\u003c/p\u003e\n                    \u003cp\u003eMore by \u003ca href=\"https://www.thetruthaboutcars.com/member/1357641/mattposky\"\u003eMatt Posky\u003c/a\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n                    \n\n\n\n                    \n                    \n\n                            \n\n\n\n                    \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-06-23T16:00:00-04:00",
  "modifiedTime": "2025-06-23T16:00:00-04:00"
}
