{
  "id": "7e53d735-3588-4104-9cbe-107ca737b044",
  "title": "Safety fast: driving Aston's other F1 car",
  "link": "https://www.autocar.co.uk/car-news/features/safety-fast-driving-astons-other-f1-car",
  "description": "Vantage and DBX 707 are the world's fastest emergency response vehicles Since 2021, Aston Martin has been on safety and medical car duty in F1 - we take them for a spin Only a few months in and already the 2025 Formula 1 season is proving to be a nail-biter, with the established driver order and team hierarchy under threat. So it’s fortunate that two cars present at every race are standing ready to intervene when things get messy. They are the official FIA safety and medical cars, since 1996 provided by Mercedes, but also now by Aston Martin. Coincidentally, and in the wake of the Spanish GP and Max Verstappen’s three penalty points for a late collision, the British manufacturer showed off both its safety and medical cars at its test and development centre beside Stowe Circuit, the short and sinewy track located inside the main track complex at Silverstone. Finished in the manufacturer’s trademark Racing Green with neon yellow accents on the side skirts and on the extended front splitter and rear wing, both unique to the car, and bristling with antennae and additional lighting, the Vantage has the presence necessary to bring 20 F1 drivers to heel. Its 4.0-litre twin-turbocharged V8 produces 656bhp, and it does 0-62mph in 3.4sec. The cabin is fitted with a bespoke centre console incorporating multiple light and comms buttons, screens relaying live images of the track, a rear-view camera and a pair of six-point race harnesses. It means business, as does Bernd Mayländer, since 2000 the official FIA safety car driver and my chauffeur at the wheel of the vehicle today. “In this job you have to have been a race driver so that you can drive quickly but safely,” he explains. With a racing record that includes winning Le Mans in 2000 and driving for Mercedes in the DTM championship from 2001-04, Mayländer easily ticks that box. I’ve already taken the Vantage for a few cautious, solo laps of Stowe circuit but now it’s time for Mayländer to show me how it’s done. The track is only a little over one mile long and has eight corners plus a couple of straights. Mayländer’s three laps are a breathtaking display of on-limit control, interspersed with savage acceleration and ferocious braking. Commitment like this is essential when there are 20 F1 cars looming in his rear-view mirror, he says: “Especially when there’s debris on the track, the drivers don’t always know and maybe get frustrated because I’m holding them back. I try not to, but safety comes first.” Back at the garage, he describes how, on race day, he and long-serving co-driver, Richard Darker, will have been strapped into their Vantage at the pit exit with the engine running for at least 10 minutes before the start. “You feel the tension,” he says. Among recent races, the Australian Grand Prix stands out. “The rain was extreme and we had a few deployments and did 13 laps in total. In such conditions, you need a communicative car like the Vantage that lets you know where the track is drying out, which we report to the race director.” Meanwhile, poised at the back of the grid ready to deploy during the race’s critical opening lap, is the F1 medical car. It’s here at Stowe today – an Aston Martin DBX 707, one of two that have been in service since 2023. It replaced the original DBX safety car and, being a 707, has a 696bhp, 4.0-litre twin-turbo engine capable of catapulting the 2300kg SUV from zero to 62mph in 3.1sec. Fire extinguishers, medical bags and a defibrillator have their own dedicated storage compartments in the back, while the comms kit is packed in the spare-wheel well. Throughout the race, the on-board medic has access to communications from Race Control and can see not only the FIA marshalling system but also biometric data from the race drivers and live television images enabling early assessment of an incident. Official medical car driver Karl Reindler is a former professional racer who is covering 14 F1 races this season. “The job is more than just about driving a car fast,” he says. “You must also keep a cool head and have good situational awareness.” Especially so, he adds, when F1 cars can almost do two laps of a circuit in the time it takes the DBX – and the Vantage – to do one. Fortunately, the car is fast enough to complete the opening lap and park up ready to deploy before the race pack bears down. “On a deployment, we have to think fast and weigh up our priorities,” says Reindler. “For example, at the start of the F2 support race of the Azerbaijan Grand Prix last year, there was a three-car pile-up that required me and my medic co-driver to decide who to prioritise. \"One car was in the wall on fire, another was upside down and the driver was climbing out of the third. The fire team was on its way and could take care of the burning car so we went to the one that was upside down. Fortunately, the driver was okay.” For my final laps of Stowe circuit, the DBX 707 medical car looks a safe choice. Reindler gives the big SUV the full beans. It clings on securely, at one corner betraying only a hint of understeer that he has already anticipated. If I come a cropper on my way home, I know who to call.",
  "author": "",
  "published": "Sun, 6 Jul 2025 06:01:09 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "John Evans",
  "length": 3408,
  "excerpt": "Since 2021, Aston Martin has been on safety and medical car duty in F1 - we take them for a spin",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Mayländer’s three laps are a breathtaking display of on-limit control, interspersed with savage acceleration and ferocious braking. Commitment like this is essential when there are 20 F1 cars looming in his rear-view mirror, he says: “Especially when there’s debris on the track, the drivers don’t always know and maybe get frustrated because I’m holding them back. I try not to, but safety comes first.” Back at the garage, he describes how, on race day, he and long-serving co-driver, Richard Darker, will have been strapped into their Vantage at the pit exit with the engine running for at least 10 minutes before the start. “You feel the tension,” he says. Among recent races, the Australian Grand Prix stands out. “The rain was extreme and we had a few deployments and did 13 laps in total. In such conditions, you need a communicative car like the Vantage that lets you know where the track is drying out, which we report to the race director.” Meanwhile, poised at the back of the grid ready to deploy during the race’s critical opening lap, is the F1 medical car. It’s here at Stowe today – an Aston Martin DBX 707, one of two that have been in service since 2023. It replaced the original DBX safety car and, being a 707, has a 696bhp, 4.0-litre twin-turbo engine capable of catapulting the 2300kg SUV from zero to 62mph in 3.1sec. Fire extinguishers, medical bags and a defibrillator have their own dedicated storage compartments in the back, while the comms kit is packed in the spare-wheel well. Throughout the race, the on-board medic has access to communications from Race Control and can see not only the FIA marshalling system but also biometric data from the race drivers and live television images enabling early assessment of an incident. Official medical car driver Karl Reindler is a former professional racer who is covering 14 F1 races this season. “The job is more than just about driving a car fast,” he says. “You must also keep a cool head and have good situational awareness.” Especially so, he adds, when F1 cars can almost do two laps of a circuit in the time it takes the DBX – and the Vantage – to do one. Fortunately, the car is fast enough to complete the opening lap and park up ready to deploy before the race pack bears down. “On a deployment, we have to think fast and weigh up our priorities,” says Reindler. “For example, at the start of the F2 support race of the Azerbaijan Grand Prix last year, there was a three-car pile-up that required me and my medic co-driver to decide who to prioritise. Join our WhatsApp community and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full privacy policy here. used Peugeot 208 cars for sale In partnership with NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/aston-martin-vantage_dbx-f1-safety-cars.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eMayländer’s three laps are a breathtaking display of on-limit control, interspersed with savage acceleration and ferocious braking.\u003c/p\u003e\n\u003cp\u003eCommitment like this is essential when there are 20 F1 cars looming in his rear-view mirror, he says: “Especially when there’s debris on the track, the drivers don’t always know and maybe get frustrated because I’m holding them back. I try not to, but safety comes first.”\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"596\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/_bernd_maylander_003.jpg?itok=BHK7j7ZL\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/_bernd_maylander_003.jpg?itok=BHK7j7ZL\"/\u003e\u003c/p\u003e\n\u003cp\u003eBack at the garage, he describes how, on race day, he and long-serving co-driver, Richard Darker, will have been strapped into their Vantage at the pit exit with the engine running for at least 10 minutes before the start.\u003c/p\u003e\n\u003cp\u003e“You feel the tension,” he says. Among recent races, the Australian Grand Prix stands out. “The rain was extreme and we had a few deployments and did 13 laps in total.\u003c/p\u003e\n\u003cp\u003eIn such conditions, you need a communicative car like the Vantage that lets you know where the track is drying out, which we report to the race director.”\u003c/p\u003e\n\u003cp\u003eMeanwhile, poised at the back of the grid ready to deploy during the race’s critical opening lap, is the F1 medical car. It’s here at Stowe today – an \u003ca href=\"https://www.autocar.co.uk/car-review/aston-martin/dbx\"\u003eAston Martin DBX 707\u003c/a\u003e, one of two that have been in service since 2023.\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003eIt replaced the original DBX safety car and, being a 707, has a 696bhp, 4.0-litre twin-turbo engine capable of catapulting the 2300kg \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-suvs\"\u003eSUV\u003c/a\u003e from zero to 62mph in 3.1sec. Fire extinguishers, medical bags and a defibrillator have their own dedicated storage compartments in the back, while the comms kit is packed in the spare-wheel well.\u003c/p\u003e\n\u003cp\u003eThroughout the race, the on-board medic has access to communications from Race Control and can see not only the FIA marshalling system but also biometric data from the race drivers and live television images enabling early assessment of an incident.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"596\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/aston_dbx_medical_car_gettyimages-2209919839.jpg?itok=1IfkvVtw\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/aston_dbx_medical_car_gettyimages-2209919839.jpg?itok=1IfkvVtw\"/\u003e\u003c/p\u003e\n\u003cp\u003eOfficial medical car driver Karl Reindler is a former professional racer who is covering 14 F1 races this season. “The job is more than just about driving a car fast,” he says. “You must also keep a cool head and have good situational awareness.”\u003c/p\u003e\n\u003cp\u003eEspecially so, he adds, when F1 cars can almost do two laps of a circuit in the time it takes the DBX – and the Vantage – to do one. Fortunately, the car is fast enough to complete the opening lap and park up ready to deploy before the race pack bears down.\u003c/p\u003e\n\u003cp\u003e“On a deployment, we have to think fast and weigh up our priorities,” says Reindler. “For example, at the start of the F2 support race of the Azerbaijan Grand Prix last year, there was a three-car pile-up that required me and my medic co-driver to decide who to prioritise.\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n          \u003cblock\u003e\u003cp\u003e\u003cstrong\u003eJoin our \u003ca href=\"https://chat.whatsapp.com/IRAK6Rf3pMGHUwVXXnG4Eh\" target=\"_blank\"\u003eWhatsApp community\u003c/a\u003e and be the first to read about the latest news and reviews wowing the car world. Our community is the best, easiest and most direct place to tap into the minds of Autocar, and if you join you’ll also be treated to unique WhatsApp content. You can leave at any time after joining - check our full \u003ca href=\"https://haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy policy\u003c/a\u003e here.\u003c/strong\u003e\u003c/p\u003e\u003c/block\u003e          \n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused Peugeot 208 cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \n  \n  \u003cp\u003e\u003cspan\u003eIn partnership with\n      \u003cspan\u003e\n        \u003cimg src=\"https://images.cdn.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/autotraderlogocolour.svg\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-06T06:01:09Z",
  "modifiedTime": null
}
