{
  "id": "8013fa6e-951f-4116-b65c-2f75c3b8a14b",
  "title": "Honda Amaze vs Maruti Dzire comparison",
  "link": "https://www.autocarindia.com/car-comparison-reviews/honda-amaze-vs-maruti-dzire-comparison-434964#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
  "description": "Maruti Suzuki and Honda have given their compact sedans a significant update, bringing us the fourth-generation Dzire and the third-generation Amaze, respectively. Can these sedans carry on the fight in an increasingly SUV-dominated market? With these new-gen models, both brands have also placed a strong emphasis on safety this time around. Standard features on both cars now include ESP, six airbags and hill-start assist. Additionally, the Amaze stands out with its camera-based ADAS suite, while the Dzire has earned a 5-star Global NCAP crash-safety rating. And now, with similar features and specifications, the two sedans are closer than ever. So, we put their petrol-automatic iterations through our exhaustive tests to find out which one comes out on top. Honda Amaze vs Maruti Dzire exterior design Amaze boasts a higher ground clearance and a longer wheelbase. The Amaze follows Honda’s latest design philosophy, bearing a strong resemblance to its larger siblings. Its front shares styling cues with the Elevate SUV, while the rear resembles the City. Though the side profile remains unmistakably Amaze, elements such as door-mounted mirrors and 185/60 R15 diamond-cut alloys provide a modern touch. The new Dzire impresses with its large Audi-esque grille, and the LED headlamps look sleek. Like the Amaze, its side profile is familiar to its previous generation, but distinctive tail-lights featuring a tri-arrow LED signature and a subtle boot lip spoiler add character. Dzire is taller, but Amaze has a higher ground clearance Dimensionally, both cars are near-identical in length and width, but the Dzire is 25mm taller and rides on slightly higher-profile 185/65 R15 tyres. The Amaze boasts a 20mm longer wheelbase and higher ground clearance (172mm versus Dzire’s 163mm). The Dzire AMT weighs 960kg, making it 26kg lighter than the Amaze. Honda Amaze vs Maruti Dzire interior Honda’s hallmark ergonomics shine through, and its high-set seats result in excellent visibility. With a dashboard that resembles that of an Elevate, the Amaze’s interior adopts a minimalist approach. The beige-black colour scheme adds some brightness, and Honda’s hallmark ergonomics shine through with well-placed storage spaces and excellent visibility. Also carried forward from the Elevate are its superbly executed part-analogue, part-digital instrument cluster and the neat, buttoned climate control console. Where the Amaze must improve is the front-seat comfort; the absence of adequate seat base support becomes glaringly evident in this comparison. Its rear seat fares much better in this aspect – there’s good support, and the backrest angle is more comfortable than the Maruti. Three fixed headrests not only improve comfort but also provide whiplash protection to adults seated here. And while neither of these sedans is wide enough to seat three adults comfortably, the Amaze’s rear air-con console protrudes a fair bit into the middle passenger’s kneeroom. Also, taller passengers will find the headroom in limited supply in the Amaze. Dzire interior feels more spacious and comfortable Some textured bits enhance its appeal, as do features like a larger screen and sunroof. There’s a greater sense of space inside the Dzire due to its design and lighter colour scheme. Some smartly executed textured bits lift its appeal, while its larger 9-inch touchscreen and a sunroof add a touch of modernity. It also gets an edge over the Amaze due to its broader, more supportive seats. For short drives, its soft cushioning feels very comfortable, too. However, this could induce some body ache after spending extended hours in the car during long drives. Its rear seat is just as accommodating as the Honda’s, but with a bit more headroom due to a scooped-out roof, taller passengers will be comfier here. While both cars have ample storage areas spread across the cabin, the Dzire’s 382-litre boot is a bit smaller than the Amaze’s, which measures 416 litres. Honda Amaze vs Maruti Dzire price and features Amaze (clockwise): Camera-based ADAS works well under most conditions; The front seats’ base is small and needs better support; Rear AC console eats into the kneeroom of passengers; Smooth transmission complements its engine well. The Honda Amaze CVT comes in three variants priced between Rs 9.35 lakh and Rs 11.20 lakh, whereas the Dzire AMT’s range of Rs 8.34 lakh to Rs 10.19 lakh makes it significantly more affordable. The features common to their top trims include auto LED headlamps, 15-inch alloys, keyless entry, wireless charging, automatic climate control, rear air vents, cruise control, wireless Android Auto and Apple CarPlay, ESP and six airbags. Dzire (clockwise): Includes in-vogue features like a sunroof and a 360-deg cam; The AMT gearbox’s shifts are jerky; No headrest for the middle passenger; Faux wood, silver inserts and textures enhance its appeal. The Dzire AMT stands out with a 360-degree camera, a sunroof and a larger 9-inch touchscreen (compared to the Amaze’s 8-inch unit). However, during our tests, its screen froze on more than one occasion while connected to Android Auto. Amaze distinguishes itself with ADAS features For the Rs 1 lakh premium that the Amaze CVT commands over the Dzire AMT, it gets paddle shifters, a part-digital instrument cluster, and an ADAS package featuring lane-keeping assist, blind-spot monitoring, autonomous emergency braking and adaptive cruise control. These ADAS features are well-calibrated to suit Indian driving conditions and function in a non-intrusive manner, making highway drives more convenient and safer. Honda Amaze vs Maruti Dzire price and featuresAmaze ZX CVTDzire ZXI+ AMTPrice (ex-showroom, India)Rs 11.20 lakhRs 10.19 lakhAuto headlampsLEDLEDAlloy wheels15-inch15-inchDigital instrument clusterPartialNATouchscreen8-inch9-inchAndroid Auto/Apple CarPlayWirelessWirelessWireless chargerYesYesClimate controlYesYesSunroofNAYesRear AC ventsYesYesCameraYes360-degreePaddle shiftersYESNACruise controlAdaptiveYesLane-keep assistYesNAAuto emergency brakingYesNABlind-spot monitorYesNAESPYesYesHill-start assistYesYesAirbags66 Honda Amaze vs Maruti Dzire performance Amaze’s outright acceleration is stronger, but Dzire’s drivability is nicer. Amaze’s 1.2-litre 4-cylinder petrol engine is carried over from the previous-gen model and, hence, remains very similar in its characteristics. It is an enjoyable unit with a strong mid-range and a free-revving nature. But performance at the lower end of the rev range feels weak, especially below 2,000rpm. Its continuously variable transmission (CVT) keeps the engine spinning optimally, thus extracting the best out of this unit. And in the absence of fixed gears, this belt-pulley automatic works seamlessly. However, enthusiastic user input results in a noticeable rubber-band effect, where the revs increase without a corresponding effect on vehicle speed; this makes an already buzzy engine sound even harsher. Honda’s free-revving mill can get quite vocal when spun faster. The new Dzire switches to Maruti’s latest 1.2-litre Z12E petrol engine that has one less cylinder. And, at 82hp, makes 8hp less than the Amaze as well as its own previous-generation model. However, as we’ve seen with the Swift, where it debuted, this three-cylinder unit’s clear focus on low-end torque aids drivability, as does its crisp throttle response. 5-speed AMT is a sore point for the Dzire's driving experience These make the Dzire feel rather effortless within urban confines. But the 5-speed automated manual transmission (AMT) is the weakest link in this package. Yes, it provides the convenience of clutch-free driving, and even though it can be categorised as fine by AMT standards, you will feel a prominent lag between gear shifts; it is nowhere near as smooth or seamless as the Amaze’s CVT. Maruti’s three-cylinder unit is surprisingly refined and drivable. In our performance tests, the Amaze accelerates from 0-100kph in 13.12 seconds, 2.09 seconds quicker than the Dzire AMT. Interestingly, their rolling acceleration times from 20-80kph and 40-100kph are very similar. Pedal to the metal, the Honda CVT tops out at 148kph, whereas the Dzire AMT hits a higher top speed of 170kph. Honda Amaze vs Maruti Dzire acceleration, efficiency, brakingHonda Amaze ZX CVTMaruti Dzire ZXi+ AMT0-20kph (seconds)1.761.430-40kph (seconds)4.103.270-60kph (seconds)6.416.730-80kph (seconds)9.2110.490-100kph (seconds)13.1215.210-120kph (seconds)18.2320.6120-80kph (in 3rd gear)8.91sec8.95sec40-100kph (in 4th gear)10.43sec11.18secBraking distance (in m)29.5028.86Braking time (in sec)2.922.57Sound at idle (AC off)65.9db69.1dbSound at idle (AC mid)67.9db75.6dbSound at idle (AC full)72.3db76.8dbSound at 50kph83.4db82.3dbSound at 80kph84.3db84.1dbFuel efficiency: city (kpl)9.9411.61Fuel efficiency: highway (kpl)16.6219.22Fuel efficiency: overall average (kpl)13.2815.41 Honda Amaze vs Maruti Dzire fuel efficiency Dzire achieves better fuel efficiency across the board The Dzire averages 15.41kpl, while the Amaze returns an average of 13.28kpl. Honda claims an ARAI-rated efficiency of 19.46kpl for the Amaze CVT, whereas Maruti claims a staggering 25.71kpl for the Dzire AMT. Although nowhere as close, in our real-world tests, the Amaze CVT and Dzire AMT averaged 13.28kpl and 15.41kpl, respectively. The Amaze CVT achieved 16.62kpl on the highway and 9.94kpl in the city, whereas the Dzire returned a higher 19.22kpl and 11.61kpl, respectively. Notably, neither car gets an Eco mode; the Dzire has an automatic engine stop-start feature to check fuel consumption while idling. However, in extreme 45-degree heat, this feature struggled due to the air conditioning’s higher fan speed requirements to maintain the preset 22 degrees Celsius cabin temperature in full-auto mode. In contrast, the Amaze maintained cabin temperature effectively with a lower fan speed. Honda Amaze vs Maruti Dzire ride and handling The Amaze's steering is more responsive, but the Dzire wins on the low-speed ride front. A comfort-oriented setup makes the Amaze soak up the bumps and road imperfections rather competently, but the sharper potholes come through with a prominent ‘thwack’ from the suspension. At highway speeds, it tends to bounce on its soft springs, resulting in a fair bit of vertical movement over wavy surfaces – not ideal for those prone to road sickness. Dzire's ride is plusher at low speeds The Maruti is the comfier riding car since its low-speed ride is a touch more absorbent, and it does its duties in silence. Sharp movements do come through at highway speeds, so in that sense, its ride can feel busy when you up the pace. However, it recovers much better than the Amaze after a dip, and it doesn’t float as much either. Those who enjoy driving may prefer the Honda’s steering, which feels pointier and more fluid than the Maruti’s, but in terms of steering effort, the Dzire’s lighter unit, with its relatively shorter turning radius, will appeal to most buyers. Honda Amaze vs Maruti Dzire verdict Honda Amaze ZX CVT: 8/10 Maruti Dzire ZXi+ AMT: 8/10 The Honda Amaze petrol-automatic gets the basics right with a far smoother driving experience and better outright performance, which will certainly appeal to self-driven owners. In addition, it is also equipped with segment-first ADAS. However, its powertrain could have done with better refinement, its front seats should have been more supportive, and its highway ride comes across as a bit bouncy. The Maruti Dzire isn’t perfect, and the jerky AMT gearbox is a letdown, but if you can look past this, it feels larger and more expensive on the inside, and its seats are comfier, too. The ride is plusher, the engine more refined, and it has a more desirable kit, including a sunroof and a 360-degree camera. Building the case further is the better fuel efficiency and a substantial Rs 1 lakh lower sticker price. All in all, then, the Dzire is the better all-rounder, ensuring it emerges the winner in this battle. Also see: Maruti Dzire vs Honda Amaze: Which is the new compact sedan for you? New Maruti Dzire vs Amaze vs Aura vs Tigor: specs and prices compared",
  "author": "Saumil Shah",
  "published": "Mon, 31 Mar 2025 08:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
  "categories": null,
  "byline": "Saumil Shah",
  "length": 12225,
  "excerpt": "With both Japanese rivals getting major updates, it is time to bring the two together for a direct comparison.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "With both Japanese rivals getting major updates, it is time to bring the two together for a direct comparison.Maruti Suzuki and Honda have given their compact sedans a significant update, bringing us the fourth-generation Dzire and the third-generation Amaze, respectively. Can these sedans carry on the fight in an increasingly SUV-dominated market?With these new-gen models, both brands have also placed a strong emphasis on safety this time around. Standard features on both cars now include ESP, six airbags and hill-start assist. Additionally, the Amaze stands out with its camera-based ADAS suite, while the Dzire has earned a 5-star Global NCAP crash-safety rating. And now, with similar features and specifications, the two sedans are closer than ever. So, we put their petrol-automatic iterations through our exhaustive tests to find out which one comes out on top.Honda Amaze vs Maruti Dzire exterior designAmaze boasts a higher ground clearance and a longer wheelbase.The Amaze follows Honda’s latest design philosophy, bearing a strong resemblance to its larger siblings. Its front shares styling cues with the Elevate SUV, while the rear resembles the City. Though the side profile remains unmistakably Amaze, elements such as door-mounted mirrors and 185/60 R15 diamond-cut alloys provide a modern touch.The new Dzire impresses with its large Audi-esque grille, and the LED headlamps look sleek. Like the Amaze, its side profile is familiar to its previous generation, but distinctive tail-lights featuring a tri-arrow LED signature and a subtle boot lip spoiler add character.Dzire is taller, but Amaze has a higher ground clearanceDimensionally, both cars are near-identical in length and width, but the Dzire is 25mm taller and rides on slightly higher-profile 185/65 R15 tyres. The Amaze boasts a 20mm longer wheelbase and higher ground clearance (172mm versus Dzire’s 163mm). The Dzire AMT weighs 960kg, making it 26kg lighter than the Amaze.Honda Amaze vs Maruti Dzire interiorHonda’s hallmark ergonomics shine through, and its high-set seats result in excellent visibility.With a dashboard that resembles that of an Elevate, the Amaze’s interior adopts a minimalist approach. The beige-black colour scheme adds some brightness, and Honda’s hallmark ergonomics shine through with well-placed storage spaces and excellent visibility. Also carried forward from the Elevate are its superbly executed part-analogue, part-digital instrument cluster and the neat, buttoned climate control console.Where the Amaze must improve is the front-seat comfort; the absence of adequate seat base support becomes glaringly evident in this comparison. Its rear seat fares much better in this aspect – there’s good support, and the backrest angle is more comfortable than the Maruti. Three fixed headrests not only improve comfort but also provide whiplash protection to adults seated here. And while neither of these sedans is wide enough to seat three adults comfortably, the Amaze’s rear air-con console protrudes a fair bit into the middle passenger’s kneeroom. Also, taller passengers will find the headroom in limited supply in the Amaze.Dzire interior feels more spacious and comfortableSome textured bits enhance its appeal, as do features like a larger screen and sunroof.There’s a greater sense of space inside the Dzire due to its design and lighter colour scheme. Some smartly executed textured bits lift its appeal, while its larger 9-inch touchscreen and a sunroof add a touch of modernity. It also gets an edge over the Amaze due to its broader, more supportive seats. For short drives, its soft cushioning feels very comfortable, too. However, this could induce some body ache after spending extended hours in the car during long drives.Its rear seat is just as accommodating as the Honda’s, but with a bit more headroom due to a scooped-out roof, taller passengers will be comfier here. While both cars have ample storage areas spread across the cabin, the Dzire’s 382-litre boot is a bit smaller than the Amaze’s, which measures 416 litres.Honda Amaze vs Maruti Dzire price and featuresAmaze (clockwise): Camera-based ADAS works well under most conditions; The front seats’ base is small and needs better support; Rear AC console eats into the kneeroom of passengers; Smooth transmission complements its engine well.The Honda Amaze CVT comes in three variants priced between Rs 9.35 lakh and Rs 11.20 lakh, whereas the Dzire AMT’s range of Rs 8.34 lakh to Rs 10.19 lakh makes it significantly more affordable. The features common to their top trims include auto LED headlamps, 15-inch alloys, keyless entry, wireless charging, automatic climate control, rear air vents, cruise control, wireless Android Auto and Apple CarPlay, ESP and six airbags.Dzire (clockwise): Includes in-vogue features like a sunroof and a 360-deg cam; The AMT gearbox’s shifts are jerky; No headrest for the middle passenger; Faux wood, silver inserts and textures enhance its appeal.The Dzire AMT stands out with a 360-degree camera, a sunroof and a larger 9-inch touchscreen (compared to the Amaze’s 8-inch unit). However, during our tests, its screen froze on more than one occasion while connected to Android Auto.Amaze distinguishes itself with ADAS featuresFor the Rs 1 lakh premium that the Amaze CVT commands over the Dzire AMT, it gets paddle shifters, a part-digital instrument cluster, and an ADAS package featuring lane-keeping assist, blind-spot monitoring, autonomous emergency braking and adaptive cruise control. These ADAS features are well-calibrated to suit Indian driving conditions and function in a non-intrusive manner, making highway drives more convenient and safer.Honda Amaze vs Maruti Dzire price and featuresAmaze ZX CVTDzire ZXI+ AMTPrice (ex-showroom, India)Rs 11.20 lakhRs 10.19 lakhAuto headlampsLEDLEDAlloy wheels15-inch15-inchDigital instrument clusterPartialNATouchscreen8-inch9-inchAndroid Auto/Apple CarPlayWirelessWirelessWireless chargerYesYesClimate controlYesYesSunroofNAYesRear AC ventsYesYesCameraYes360-degreePaddle shiftersYESNACruise controlAdaptiveYesLane-keep assistYesNAAuto emergency brakingYesNABlind-spot monitorYesNAESPYesYesHill-start assistYesYesAirbags66Honda Amaze vs Maruti Dzire performanceAmaze’s outright acceleration is stronger, but Dzire’s drivability is nicer.Amaze’s 1.2-litre 4-cylinder petrol engine is carried over from the previous-gen model and, hence, remains very similar in its characteristics. It is an enjoyable unit with a strong mid-range and a free-revving nature. But performance at the lower end of the rev range feels weak, especially below 2,000rpm.Its continuously variable transmission (CVT) keeps the engine spinning optimally, thus extracting the best out of this unit. And in the absence of fixed gears, this belt-pulley automatic works seamlessly. However, enthusiastic user input results in a noticeable rubber-band effect, where the revs increase without a corresponding effect on vehicle speed; this makes an already buzzy engine sound even harsher.Honda’s free-revving mill can get quite vocal when spun faster.The new Dzire switches to Maruti’s latest 1.2-litre Z12E petrol engine that has one less cylinder. And, at 82hp, makes 8hp less than the Amaze as well as its own previous-generation model. However, as we’ve seen with the Swift, where it debuted, this three-cylinder unit’s clear focus on low-end torque aids drivability, as does its crisp throttle response.5-speed AMT is a sore point for the Dzire's driving experienceThese make the Dzire feel rather effortless within urban confines. But the 5-speed automated manual transmission (AMT) is the weakest link in this package. Yes, it provides the convenience of clutch-free driving, and even though it can be categorised as fine by AMT standards, you will feel a prominent lag between gear shifts; it is nowhere near as smooth or seamless as the Amaze’s CVT.Maruti’s three-cylinder unit is surprisingly refined and drivable.In our performance tests, the Amaze accelerates from 0-100kph in 13.12 seconds, 2.09 seconds quicker than the Dzire AMT. Interestingly, their rolling acceleration times from 20-80kph and 40-100kph are very similar. Pedal to the metal, the Honda CVT tops out at 148kph, whereas the Dzire AMT hits a higher top speed of 170kph.Honda Amaze vs Maruti Dzire acceleration, efficiency, brakingHonda Amaze ZX CVTMaruti Dzire ZXi+ AMT0-20kph (seconds)1.761.430-40kph (seconds)4.103.270-60kph (seconds)6.416.730-80kph (seconds)9.2110.490-100kph (seconds)13.1215.210-120kph (seconds)18.2320.6120-80kph (in 3rd gear)8.91sec8.95sec40-100kph (in 4th gear)10.43sec11.18secBraking distance (in m)29.5028.86Braking time (in sec)2.922.57Sound at idle (AC off)65.9db69.1dbSound at idle (AC mid)67.9db75.6dbSound at idle (AC full)72.3db76.8dbSound at 50kph83.4db82.3dbSound at 80kph84.3db84.1dbFuel efficiency: city (kpl)9.9411.61Fuel efficiency: highway (kpl)16.6219.22Fuel efficiency: overall average (kpl)13.2815.41Honda Amaze vs Maruti Dzire fuel efficiencyDzire achieves better fuel efficiency across the boardThe Dzire averages 15.41kpl, while the Amaze returns an average of 13.28kpl.Honda claims an ARAI-rated efficiency of 19.46kpl for the Amaze CVT, whereas Maruti claims a staggering 25.71kpl for the Dzire AMT. Although nowhere as close, in our real-world tests, the Amaze CVT and Dzire AMT averaged 13.28kpl and 15.41kpl, respectively. The Amaze CVT achieved 16.62kpl on the highway and 9.94kpl in the city, whereas the Dzire returned a higher 19.22kpl and 11.61kpl, respectively.Notably, neither car gets an Eco mode; the Dzire has an automatic engine stop-start feature to check fuel consumption while idling. However, in extreme 45-degree heat, this feature struggled due to the air conditioning’s higher fan speed requirements to maintain the preset 22 degrees Celsius cabin temperature in full-auto mode. In contrast, the Amaze maintained cabin temperature effectively with a lower fan speed.Honda Amaze vs Maruti Dzire ride and handlingThe Amaze's steering is more responsive, but the Dzire wins on the low-speed ride front.A comfort-oriented setup makes the Amaze soak up the bumps and road imperfections rather competently, but the sharper potholes come through with a prominent ‘thwack’ from the suspension. At highway speeds, it tends to bounce on its soft springs, resulting in a fair bit of vertical movement over wavy surfaces – not ideal for those prone to road sickness.Dzire's ride is plusher at low speedsThe Maruti is the comfier riding car since its low-speed ride is a touch more absorbent, and it does its duties in silence. Sharp movements do come through at highway speeds, so in that sense, its ride can feel busy when you up the pace. However, it recovers much better than the Amaze after a dip, and it doesn’t float as much either. Those who enjoy driving may prefer the Honda’s steering, which feels pointier and more fluid than the Maruti’s, but in terms of steering effort, the Dzire’s lighter unit, with its relatively shorter turning radius, will appeal to most buyers.Honda Amaze vs Maruti Dzire verdictHonda Amaze ZX CVT: 8/10Maruti Dzire ZXi+ AMT: 8/10The Honda Amaze petrol-automatic gets the basics right with a far smoother driving experience and better outright performance, which will certainly appeal to self-driven owners. In addition, it is also equipped with segment-first ADAS. However, its powertrain could have done with better refinement, its front seats should have been more supportive, and its highway ride comes across as a bit bouncy.The Maruti Dzire isn’t perfect, and the jerky AMT gearbox is a letdown, but if you can look past this, it feels larger and more expensive on the inside, and its seats are comfier, too. The ride is plusher, the engine more refined, and it has a more desirable kit, including a sunroof and a 360-degree camera. Building the case further is the better fuel efficiency and a substantial Rs 1 lakh lower sticker price. All in all, then, the Dzire is the better all-rounder, ensuring it emerges the winner in this battle.Also see:Maruti Dzire vs Honda Amaze: Which is the new compact sedan for you?New Maruti Dzire vs Amaze vs Aura vs Tigor: specs and prices comparedImagesVideos",
  "image": "https://img.autocarindia.com/ExtraImages/20250328062505_www.autocarindia.com _ 2025_03_28T182433.230.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWith both Japanese rivals getting major updates, it is time to bring the two together for a direct comparison.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/maruti-suzuki\"\u003eMaruti Suzuki\u003c/a\u003e\u003c/strong\u003e and \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/honda\"\u003eHonda\u003c/a\u003e\u003c/strong\u003e have given their compact sedans a significant update, bringing us the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/maruti-suzuki/dzire\"\u003efourth-generation Dzire\u003c/a\u003e\u003c/strong\u003e and the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/honda/amaze\"\u003ethird-generation Amaze\u003c/a\u003e\u003c/strong\u003e, respectively. Can these sedans carry on the fight in an increasingly SUV-dominated market?\u003c/p\u003e\u003cp\u003eWith these new-gen models, both brands have also placed a strong emphasis on safety this time around. Standard features on both cars now include ESP, six airbags and hill-start assist. Additionally, the Amaze stands out with its camera-based ADAS suite, while the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-maruti-dzire-scores-5-star-safety-rating-in-gncap-crash-test-433483\"\u003eDzire has earned a 5-star Global NCAP crash-safety rating\u003c/a\u003e\u003c/strong\u003e. And now, with similar features and specifications, the two sedans are closer than ever. So, we put their petrol-automatic iterations through our exhaustive tests to find out which one comes out on top.\u003c/p\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire exterior design\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Amaze_and_Dzire_Ground_Clearance.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAmaze boasts a higher ground clearance and a longer wheelbase.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Amaze follows Honda’s latest design philosophy, bearing a strong resemblance to its larger siblings. Its front shares styling cues with the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/honda/elevate\"\u003eElevate SUV\u003c/a\u003e\u003c/strong\u003e, while the rear resembles the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/honda/city\"\u003eCity\u003c/a\u003e\u003c/strong\u003e.\u003cbr/\u003e Though the side profile remains unmistakably Amaze, elements such as door-mounted mirrors and 185/60 R15 diamond-cut alloys provide a modern touch.\u003c/p\u003e\u003cp\u003eThe new Dzire impresses with its large Audi-esque grille, and the LED headlamps look sleek.\u003cbr/\u003e Like the Amaze, its side profile is familiar to its previous generation, but distinctive tail-lights featuring a tri-arrow LED signature and a subtle boot lip spoiler add character.\u003c/p\u003e\u003ch3\u003eDzire is taller, but Amaze has a higher ground clearance\u003c/h3\u003e\u003cp\u003eDimensionally, both cars are near-identical in length and width, but the Dzire is 25mm taller and rides on slightly higher-profile 185/65 R15 tyres. The Amaze boasts a 20mm longer wheelbase and higher ground clearance (172mm versus Dzire’s 163mm). The Dzire AMT weighs 960kg, making it 26kg lighter than the Amaze.\u003c/p\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire interior\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Honda_Amaze_Interior_Driving.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eHonda’s hallmark ergonomics shine through, and its high-set seats result in excellent visibility.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eWith a dashboard that resembles that of an Elevate, the Amaze’s interior adopts a minimalist approach. The beige-black colour scheme adds some brightness, and Honda’s hallmark ergonomics shine through with well-placed storage spaces and excellent visibility. Also carried forward from the Elevate are its superbly executed part-analogue, part-digital instrument cluster and the neat, buttoned climate control console.\u003c/p\u003e\u003cp\u003eWhere the Amaze must improve is the front-seat comfort; the absence of adequate seat base support becomes glaringly evident in this comparison. Its rear seat fares much better in this aspect – there’s good support, and the backrest angle is more comfortable than the Maruti. Three fixed headrests not only improve comfort but also provide whiplash protection to adults seated here. And while neither of these sedans is wide enough to seat three adults comfortably, the Amaze’s rear air-con console protrudes a fair bit into the middle passenger’s kneeroom. Also, taller passengers will find the headroom in limited supply in the Amaze.\u003c/p\u003e\u003ch3\u003eDzire interior feels more spacious and comfortable\u003c/h3\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Maruti_Dzire_Interior_Driving.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eSome textured bits enhance its appeal, as do features like a larger screen and sunroof.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThere’s a greater sense of space inside the Dzire due to its design and lighter colour scheme. Some smartly executed textured bits lift its appeal, while its larger 9-inch touchscreen and a sunroof add a touch of modernity. It also gets an edge over the Amaze due to its broader, more supportive seats. For short drives, its soft cushioning feels very comfortable, too. However, this could induce some body ache after spending extended hours in the car during long drives.\u003c/p\u003e\u003cp\u003eIts rear seat is just as accommodating as the Honda’s, but with a bit more headroom due to a scooped-out roof, taller passengers will be comfier here. While both cars have ample storage areas spread across the cabin, the Dzire’s 382-litre boot is a bit smaller than the Amaze’s, which measures 416 litres.\u003c/p\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire price and features\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/20250328055529_Honda_Amaze_Features.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAmaze (clockwise): Camera-based ADAS works well under most conditions; \u003c/em\u003e\u003cem\u003eThe front seats’ base is small and needs better support; Rear AC console eats into the kneeroom of passengers; \u003c/em\u003e\u003cem\u003eSmooth transmission complements its engine well.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Honda Amaze CVT comes in three variants priced between Rs 9.35 lakh and Rs 11.20 lakh, whereas the Dzire AMT’s range of Rs 8.34 lakh to Rs 10.19 lakh makes it significantly more affordable.\u003cbr/\u003e The features common to their top trims include auto LED headlamps, 15-inch alloys, keyless entry, wireless charging, automatic climate control, rear air vents, cruise control, wireless Android Auto and Apple CarPlay, ESP and six airbags.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Maruti_Dzire_Feature.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eDzire (clockwise): Includes in-vogue features like a sunroof and a 360-deg cam; \u003c/em\u003e\u003cem\u003eThe AMT gearbox’s shifts are jerky; No headrest for the middle passenger; \u003c/em\u003e\u003cem\u003eFaux wood, silver inserts and textures enhance its appeal.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Dzire AMT stands out with a 360-degree camera, a sunroof and a larger 9-inch touchscreen (compared to the Amaze’s 8-inch unit). However, during our tests, its screen froze on more than one occasion while connected to Android Auto.\u003c/p\u003e\u003ch3\u003eAmaze distinguishes itself with ADAS features\u003c/h3\u003e\u003cp\u003eFor the Rs 1 lakh premium that the Amaze CVT commands over the Dzire AMT, it gets paddle shifters, a part-digital instrument cluster, and an ADAS package featuring lane-keeping assist, blind-spot monitoring, autonomous emergency braking and adaptive cruise control. These ADAS features are well-calibrated to suit Indian driving conditions and function in a non-intrusive manner, making highway drives more convenient and safer.\u003c/p\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"3\" scope=\"col\"\u003eHonda Amaze vs Maruti Dzire price and features\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003c/td\u003e\u003ctd\u003eAmaze ZX CVT\u003c/td\u003e\u003ctd\u003eDzire ZXI+ AMT\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003ePrice (ex-showroom, India)\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eRs 11.20 lakh\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eRs 10.19 lakh\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAuto headlamps\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eLED\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eLED\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAlloy wheels\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003e15-inch\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003e15-inch\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eDigital instrument cluster\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003ePartial\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eNA\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eTouchscreen\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003e8-inch\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003e9-inch\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAndroid Auto/Apple CarPlay\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eWireless\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eWireless\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eWireless charger\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eClimate control\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSunroof\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eNA\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRear AC vents\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eCamera\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003e360-degree\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003ePaddle shifters\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYES\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eNA\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eCruise control\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eAdaptive\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eLane-keep assist\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eNA\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAuto emergency braking\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eNA\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBlind-spot monitor\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eNA\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eESP\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eHill-start assist\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003eYes\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003eYes\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eAirbags\u003c/td\u003e\u003ctd data-label=\"Amaze ZX CVT\"\u003e6\u003c/td\u003e\u003ctd data-label=\"Dzire ZXI+ AMT\"\u003e6\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire performance\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Amaze_and_Dzire_Rear_Tracking.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAmaze’s outright acceleration is stronger, but Dzire’s drivability is nicer.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAmaze’s 1.2-litre 4-cylinder petrol engine is carried over from the previous-gen model and, hence, remains very similar in its characteristics. It is an enjoyable unit with a strong mid-range and a free-revving nature. But performance at the lower end of the rev range feels weak, especially below 2,000rpm.\u003c/p\u003e\u003cp\u003eIts continuously variable transmission (CVT) keeps the engine spinning optimally, thus extracting the best out of this unit. And in the absence of fixed gears, this belt-pulley automatic works seamlessly. However, enthusiastic user input results in a noticeable rubber-band effect, where the revs increase without a corresponding effect on vehicle speed; this makes an already buzzy engine sound even harsher.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Honda_Amaze_Engine.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eHonda’s free-revving mill can get quite vocal when spun faster.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe new Dzire switches to Maruti’s latest 1.2-litre Z12E petrol engine that has one less cylinder. And, at 82hp, makes 8hp less than the Amaze as well as its own previous-generation model. However, as we’ve seen with the Swift, where it debuted, this three-cylinder unit’s clear focus on low-end torque aids drivability, as does its crisp throttle response.\u003c/p\u003e\u003ch3\u003e5-speed AMT is a sore point for the Dzire\u0026#39;s driving experience\u003c/h3\u003e\u003cp\u003eThese make the Dzire feel rather effortless within urban confines. But the 5-speed automated manual transmission (AMT) is the weakest link in this package. Yes, it provides the convenience of clutch-free driving, and even though it can be categorised as fine by AMT standards, you will feel a prominent lag between gear shifts; it is nowhere near as smooth or seamless as the Amaze’s CVT.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Maruti_Dzire_Engine.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eMaruti’s three-cylinder unit is surprisingly refined and drivable.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIn our performance tests, the Amaze accelerates from 0-100kph in 13.12 seconds, 2.09 seconds quicker than the Dzire AMT. Interestingly, their rolling acceleration times from 20-80kph and 40-100kph are very similar. Pedal to the metal, the Honda CVT tops out at 148kph, whereas the Dzire AMT hits a higher top speed of 170kph.\u003c/p\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"3\" scope=\"col\"\u003eHonda Amaze vs Maruti Dzire acceleration, efficiency, braking\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003c/td\u003e\u003ctd\u003eHonda Amaze ZX CVT\u003c/td\u003e\u003ctd\u003eMaruti Dzire ZXi+ AMT\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-20kph (seconds)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e1.76\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e1.43\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-40kph (seconds)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e4.10\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e3.27\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-60kph (seconds)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e6.41\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e6.73\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-80kph (seconds)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e9.21\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e10.49\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-100kph (seconds)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e13.12\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e15.21\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e0-120kph (seconds)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e18.23\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e20.61\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e20-80kph (in 3rd gear)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e8.91sec\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e8.95sec\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e40-100kph (in 4th gear)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e10.43sec\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e11.18sec\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBraking distance (in m)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e29.50\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e28.86\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBraking time (in sec)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e2.92\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e2.57\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSound at idle (AC off)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e65.9db\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e69.1db\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSound at idle (AC mid)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e67.9db\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e75.6db\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSound at idle (AC full)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e72.3db\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e76.8db\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSound at 50kph\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e83.4db\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e82.3db\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSound at 80kph\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e84.3db\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e84.1db\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eFuel efficiency: city (kpl)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e9.94\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e11.61\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eFuel efficiency: highway (kpl)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e16.62\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e19.22\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eFuel efficiency: overall average (kpl)\u003c/td\u003e\u003ctd data-label=\"Honda Amaze ZX CVT\"\u003e13.28\u003c/td\u003e\u003ctd data-label=\"Maruti Dzire ZXi+ AMT\"\u003e15.41\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire fuel efficiency\u003c/h2\u003e\u003ch3\u003eDzire achieves better fuel efficiency across the board\u003c/h3\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Amaze_and_Dzire_Front_Tracking.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Dzire averages 15.41kpl, while the Amaze returns an average of 13.28kpl.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHonda claims an ARAI-rated efficiency of 19.46kpl for the Amaze CVT, whereas Maruti claims a staggering 25.71kpl for the Dzire AMT. Although nowhere as close, in our real-world tests, the Amaze CVT and Dzire AMT averaged 13.28kpl and 15.41kpl, respectively. The Amaze CVT achieved 16.62kpl on the highway and 9.94kpl in the city, whereas the Dzire returned a higher 19.22kpl and 11.61kpl, respectively.\u003c/p\u003e\u003cp\u003eNotably, neither car gets an Eco mode; the Dzire has an automatic engine stop-start feature to check fuel consumption while idling. However, in extreme 45-degree heat, this feature struggled due to the air conditioning’s higher fan speed requirements to maintain the preset 22 degrees Celsius cabin temperature in full-auto mode. In contrast, the Amaze maintained cabin temperature effectively with a lower fan speed.\u003c/p\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire ride and handling\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Amaze_and_Dzire_Side_Tracking.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Amaze\u0026#39;s steering is more responsive, but the Dzire wins on the low-speed ride front.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eA comfort-oriented setup makes the Amaze soak up the bumps and road imperfections rather competently, but the sharper potholes come through with a prominent ‘thwack’ from the suspension. At highway speeds, it tends to bounce on its soft springs, resulting in a fair bit of vertical movement over wavy surfaces – not ideal for those prone to road sickness.\u003c/p\u003e\u003ch3\u003eDzire\u0026#39;s ride is plusher at low speeds\u003c/h3\u003e\u003cp\u003eThe Maruti is the comfier riding car since its low-speed ride is a touch more absorbent, and it does its duties in silence. Sharp movements do come through at highway speeds, so in that sense, its ride can feel busy when you up the pace. However, it recovers much better than the Amaze after a dip, and it doesn’t float as much either. Those who enjoy driving may prefer the Honda’s steering, which feels pointier and more fluid than the Maruti’s, but in terms of steering effort, the Dzire’s lighter unit, with its relatively shorter turning radius, will appeal to most buyers.\u003c/p\u003e\u003ch2\u003eHonda Amaze vs Maruti Dzire verdict\u003c/h2\u003e\u003ch3\u003eHonda Amaze ZX CVT: 8/10\u003c/h3\u003e\u003ch3\u003eMaruti Dzire ZXi+ AMT: 8/10\u003c/h3\u003e\u003cp\u003eThe Honda Amaze petrol-automatic gets the basics right with a far smoother driving experience and better outright performance, which will certainly appeal to self-driven owners. In addition, it is also equipped with segment-first ADAS. However, its powertrain could have done with better refinement, its front seats should have been more supportive, and its highway ride comes across as a bit bouncy.\u003c/p\u003e\u003cp\u003eThe Maruti Dzire isn’t perfect, and the jerky AMT gearbox is a letdown, but if you can look past this, it feels larger and more expensive on the inside, and its seats are comfier, too. The ride is plusher, the engine more refined, and it has a more desirable kit, including a sunroof and a 360-degree camera. Building the case further is the better fuel efficiency and a substantial Rs 1 lakh lower sticker price. All in all, then, the Dzire is the better all-rounder, ensuring it emerges the winner in this battle.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/Reviews/Amaze_and_Dzire_Data_Log (1).png?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp class=\"new-heding-h6\"\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-video-reviews/maruti-suzuki-dzire-vs-honda-amaze-which-is-the-new-compact-sedan-for-you-434787\"\u003eMaruti Dzire vs Honda Amaze: Which is the new compact sedan for you?\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp class=\"new-heding-h6\"\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/auto-features/new-maruti-dzire-vs-amaze-vs-aura-vs-tigor-specs-and-prices-compared-433817\"\u003eNew Maruti Dzire vs Amaze vs Aura vs Tigor: specs and prices compared\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434964\"\u003e\u003cul id=\"tab-id-434964\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-434964\" href=\"#.\" rel=\"#tab-images-container-434964\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434964\" href=\"#.\" rel=\"#tab-videos-container-434964\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-03-31T08:00:00+05:30",
  "modifiedTime": null
}
