{
  "id": "82072740-2120-4439-937e-31337f1d080b",
  "title": "GWM's flat-eight motorbike proves Chinese car makers can have fun",
  "link": "https://www.autocar.co.uk/opinion/new-cars/gwms-flat-eight-motorbike-proves-chinese-car-makers-can-have-fun",
  "description": "Flat eight reportedly makes around 150bhp and 140lb ft Firm behind the Funky Cat also builds a 2.0-litre flat-eight couch on wheels It has come to my attention that the people behind the Funky Cat (Great Wall Motor, who later renamed the Ora EV something much more prosaic) have made something actually funky. This column item is ultimately going to be about cars, so I beg the patience of any reader who will write in when they see mention of a motorcycle on these pages, but I should tell you about the Souo S2000. It’s the debut motorbike from a new arm of GWM, a grand tourer in the vein of the Honda Gold Wing – a motorcycle that even non-motorcyclists will surely know about. But the S2000 is bigger and bolder even than the Gold Wing. It’s a huge, 400kg-plus, comfortable-looking cruiser, and I bring it up here because it’s powered by nothing less than a 2.0-litre flat eight-cylinder engine, reportedly making around 150bhp and 140lb ft of torque. That got my attention, as it might yours. I thought it significant for two reasons. One is that we’re becoming very accustomed to the Chinese bringing us electrified products. The cars no longer come as any surprise; some are pretty dull inside and out, sure, but others, notably those with traditional European badges, can be (a little more) interesting. There’s a school of thought that Chinese companies invest in brands with European design and engineering facilities because they need them to impart the character and soul their own products would otherwise lack; that their cars are well built and good value but that they’re not creative. Even their most interesting sports cars or off-roaders have to rely on bouncing on the spot or spinning in tiny circles, because the design is so unspectacular. If you have a longer memory, does that sound at all familiar? I think mid-late last century, the same argument was put out about Japanese cars: coming over here, putting the boot into local products by being good value but otherwise being extremely dull. Little more than white goods on wheels. I’m just about old enough to remember the derogatory phrase ‘Jap crap’, which I’d have heard said about Japanese cars when I was a kid in the 1980s. It took us a long while to appreciate the fact that Japanese products weren’t so boring after all. With only four television channels, print media and no internet, it’s not like there was swift and easy exposure to the people behind the Datsuns and Hondas of the day and the cultures that produced their cars. And then they made the Datsun Z cars, the Toyota Supra, the Honda NSX and more: cars with as much soul as anything from here. And from then to now, we’ve gone from being scared of the Japanese and their imports to thinking that they’re a pretty fun bunch. Their cars are cult classics. I wonder how long it will take us this time. We know that the Chinese can make boring electroboxes, that Geely factories have signs on the wall above urinals that read “Even a small mistake is not allowed in 2024!” and that we don’t much like the politics. But hang about: here comes a Chinese motorbike with a 2.0-litre horizontally opposed eight-cylinder engine. So, perhaps it turns out they can make machines with soul and a sense of humour after all. What an impish thought More on the car front from that GWM engine. Swapping the inline four-cylinder engine from a BMW K1200 motorcycle into a Hillman Imp like mine is a relatively common conversion. I’ve been tempted but dithered for a number of reasons. I know of one Imp that has had a flat six-cylinder Gold Wing engine conversion – more interesting but a more complex task (I don’t think you can buy a kit). But imagine instead a 2.0-litre flat eight back there. Now, would one fit without modifying the chassis and necessitating a Q numberplate? I doubt it. Would it blow the Imp’s gearbox? Undoubtedly. Am I going to do this? Absolutely not. But still, what a thought.",
  "author": "",
  "published": "Sat, 7 Dec 2024 09:01:22 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Opinion"
  ],
  "byline": "Matt Prior",
  "length": 2386,
  "excerpt": "Firm behind the Funky Cat also builds a 2.0-litre flat-eight couch on wheels",
  "siteName": "Autocar",
  "favicon": "",
  "text": "It has come to my attention that the people behind the Funky Cat (Great Wall Motor, who later renamed the Ora EV something much more prosaic) have made something actually funky. This column item is ultimately going to be about cars, so I beg the patience of any reader who will write in when they see mention of a motorcycle on these pages, but I should tell you about the Souo S2000. It’s the debut motorbike from a new arm of GWM, a grand tourer in the vein of the Honda Gold Wing – a motorcycle that even non-motorcyclists will surely know about. But the S2000 is bigger and bolder even than the Gold Wing. It’s a huge, 400kg-plus, comfortable-looking cruiser, and I bring it up here because it’s powered by nothing less than a 2.0-litre flat eight-cylinder engine, reportedly making around 150bhp and 140lb ft of torque. That got my attention, as it might yours. I thought it significant for two reasons. One is that we’re becoming very accustomed to the Chinese bringing us electrified products. The cars no longer come as any surprise; some are pretty dull inside and out, sure, but others, notably those with traditional European badges, can be (a little more) interesting. There’s a school of thought that Chinese companies invest in brands with European design and engineering facilities because they need them to impart the character and soul their own products would otherwise lack; that their cars are well built and good value but that they’re not creative. Even their most interesting sports cars or off-roaders have to rely on bouncing on the spot or spinning in tiny circles, because the design is so unspectacular. If you have a longer memory, does that sound at all familiar? I think mid-late last century, the same argument was put out about Japanese cars: coming over here, putting the boot into local products by being good value but otherwise being extremely dull. Little more than white goods on wheels. I’m just about old enough to remember the derogatory phrase ‘Jap crap’, which I’d have heard said about Japanese cars when I was a kid in the 1980s. It took us a long while to appreciate the fact that Japanese products weren’t so boring after all. With only four television channels, print media and no internet, it’s not like there was swift and easy exposure to the people behind the Datsuns and Hondas of the day and the cultures that produced their cars.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/matt-prior-opinion-souo-s2000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eIt has come to my attention that the people behind the \u003ca href=\"https://www.autocar.co.uk/car-review/gwm/ora-03\"\u003eFunky Cat\u003c/a\u003e (Great Wall Motor, who later renamed the Ora EV something much more prosaic) have made something actually funky.\u003c/p\u003e\n\u003cp\u003eThis column item is ultimately going to be about cars, so I beg the patience of any reader who will write in when they see \u003ca href=\"https://www.autocar.co.uk/car-news/features/why-car-enthusiasts-love-motorbikes-too\"\u003emention of a motorcycle\u003c/a\u003e on these pages, but I should tell you about the Souo S2000.\u003c/p\u003e\n\u003cp\u003eIt’s the debut motorbike from a new arm of GWM, a grand tourer in the vein of the \u003ca href=\"https://www.autocar.co.uk/car-review/honda\"\u003eHonda\u003c/a\u003e Gold Wing – a motorcycle that even non-motorcyclists will surely know about.\u003c/p\u003e\n\n\u003cp\u003eBut the S2000 is bigger and bolder even than the Gold Wing. It’s a huge, 400kg-plus, comfortable-looking cruiser, and I bring it up here because it’s powered by nothing less than a 2.0-litre flat eight-cylinder engine, reportedly making around 150bhp and 140lb ft of torque. That got my attention, as it might yours.\u003c/p\u003e\n\u003cp\u003eI thought it significant for two reasons. One is that we’re becoming very accustomed to the Chinese bringing us electrified products. The cars no longer come as any surprise; some are pretty dull inside and out, sure, but others, notably those with traditional European badges, can be (a little more) interesting.\u003c/p\u003e\n\u003cp\u003eThere’s a school of thought that Chinese companies invest in brands with European design and engineering facilities because they need them to impart the character and soul their own products would otherwise lack; that their cars are well built and good value but that they’re not creative.\u003c/p\u003e\n\u003cp\u003eEven their most interesting\u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/top-10-best-sports-cars\"\u003e sports cars\u003c/a\u003e or \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/top-10-best-4x4s-and-road-cars\"\u003eoff-roaders\u003c/a\u003e have to rely on bouncing on the spot or spinning in tiny circles, because the design is so unspectacular.\u003c/p\u003e\n\u003cp\u003eIf you have a longer memory, does that sound at all familiar? I think mid-late last century, the same argument was put out about \u003ca href=\"https://www.autocar.co.uk/slideshow/20-fine-japanese-cars-and-how-grab-one-%C2%A34000-2\"\u003eJapanese cars\u003c/a\u003e: coming over here, putting the boot into local products by being good value but otherwise being extremely dull.\u003c/p\u003e\n\u003cp\u003eLittle more than white goods on wheels. I’m just about old enough to remember the derogatory phrase ‘Jap crap’, which I’d have heard said about Japanese cars when I was a kid in the 1980s.\u003c/p\u003e\n\u003cp\u003eIt took us a long while to appreciate the fact that Japanese products weren’t so boring after all. With only four television channels, print media and no internet, it’s not like there was swift and easy exposure to the people behind the Datsuns and Hondas of the day and the cultures that produced their cars.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-07T09:01:22Z",
  "modifiedTime": null
}
