{
  "id": "823c4cc5-f4c2-45cf-b53d-c85bc5fc0e53",
  "title": "2024 Porsche 911 Dakar",
  "link": "https://bringatrailer.com/listing/2024-porsche-911-dakar-21/",
  "description": "This 2024 Porsche 911 Dakar is one of a planned production run of 2,500 and is finished in Ice Grey Metallic over black leather and Race-Tex. Equipment includes \"Rallye 1971\" decals, the Sport Chrono Package, rear-axle steering, Porsche Dynamic Chassis Control, Rallye Launch Control, Vesuvius Grey 19\" and 20\" 911 Dakar wheels, and a Tequipment roof rack with LED lighting. Power is provided by a twin-turbocharged 3.0L flat-six that drives all four wheels through an eight-speed PDK dual-clutch automatic transaxle. The seller purchased the car as a Porsche Approved Certified Pre-Owned vehicle in late 2023, and they have since added approximately 800 of the 1,600 indicated miles. This 992.1 Dakar is now offered with a window sticker, a rooftop tent, a clean Carfax report, and a clean Florida title in the seller's name.",
  "author": "bringatrailer",
  "published": "Wed, 05 Feb 2025 00:55:04 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 4683,
  "excerpt": "Bid for the chance to own a 2024 Porsche 911 Dakar at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #180,102.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/google-chrome-icon-192x192.png?v=1d0bb55267",
  "text": "This 2024 Porsche 911 Dakar is one of a planned production run of 2,500 and is finished in Ice Grey Metallic over black leather and Race-Tex. Equipment includes “Rallye 1971″ decals, the Sport Chrono Package, rear-axle steering, Porsche Dynamic Chassis Control, Rallye Launch Control, Vesuvius Grey 19″ and 20” 911 Dakar wheels, and a Tequipment roof rack with LED lighting. Power is provided by a twin-turbocharged 3.0L flat-six that drives all four wheels through an eight-speed PDK dual-clutch automatic transaxle. The seller purchased the car as a Porsche Approved Certified Pre-Owned vehicle in late 2023, and they have since added approximately 800 of the 1,600 indicated miles. This 992.1 Dakar is now offered with a window sticker, a rooftop tent, a clean Carfax report, and a clean Florida title in the seller’s name. Introduced at the 2022 Los Angeles Auto Show, the 911 Dakar was designed as an homage to the Porsche 953’s overall victory in the 1984 Paris-Dakar Rally. The 911 Dakar model is based on the Carrera 4 GTS but with revisions focused on off-road capability including increased ground clearance, all-terrain tires, specialized drive modes, and various weight-saving measures. This example is finished in Ice Grey Metallic (M7N) and features “Rallye 1971” decals as well as model-specific stainless-steel front and rear skid plates, a carbon-fiber front hood with stainless-steel vents, a carbon-fiber fixed rear spoiler, black rocker-panel cladding with inset stainless-steel guard plates, black wheel-arch extensions, lightweight glass, red front and rear tow hooks, and Exclusive Design tailpipes finished in silver. Additional exterior details comprise LED Matrix Design headlights with the Porsche Dynamic Light System (PDLS) as well as a Tequipment roof rack with Porsche-branded accessories and integrated LED lighting. Vesuvius Grey-finished 19″ and 20″ 911 Dakar alloy wheels are mounted with Pirelli Scorpion All Terrain Plus tires. The Dakar model features a ride height 50mm higher than standard sport-suspension-equipped 911 variants along with a hydraulic lift system that provides up to an additional 30mm of clearance, with a maximum ride height of 7.5” sustainable at up to 105 mph. Additional standard features for the Dakar include Porsche Dynamic Chassis Control (PDCC) with active anti-roll bars as well as rear-axle steering, traction management, torque vectoring, and Rallye Launch Control. Stopping power is provided by power-assisted six-piston front- and four-piston rear black-painted calipers over cross-drilled and ventilated rotors at all four corners. The bucket seats are upholstered in black leather and Race-Tex with lighter stitching, and matching upholstery extends to the dashboard, center console, and door panels. Matte carbon-fiber trim and body-color vent slats were optional, and amenities include a Bose sound system, dual-zone automatic climate control, and Porsche Communication Management (PCM) with navigation. A fire extinguisher is mounted in the passenger footwell and the car was also optioned with “911 Dakar” under door puddle light projectors. The heated Race-Tex-wrapped and carbon-fiber-trimmed GT Sport steering wheel features paddle shifters and fronts a central white 8k-rpm tachometer with an inset speed readout as well as LCD screens with configurable displays. A Sport Chrono stopwatch with a white dial is mounted atop the center of the dash. The digital odometer indicates 1,600 miles, approximately 800 of which were added under current ownership. The twin-turbocharged 3.0L flat-six is shared with the Carrera GTS and was factory rated at 473 horsepower and 420 lb-ft of torque. The Dakar model utilizes the cooling system from the 911 Turbo and Turbo S while sharing the GT3’s dynamic engine mounts. The oil was changed in December 2024. Power is routed to all four wheels through an eight-speed PDK dual-clutch automatic transaxle. The laminated window sticker notes initial delivery to Porsche West Broward in Davie, Florida, and lists factory equipment, colors, options, and a total price of $237,370. A rooftop tent is also included in the sale. The Carfax report is free of accidents or other reported damage and notes at least one recall. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC08714-83952-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 2024 Porsche 911 Dakar is one of a planned production run of 2,500 and is finished in Ice Grey Metallic over black leather and Race-Tex. Equipment includes “Rallye 1971″ decals, the Sport Chrono Package, rear-axle steering, Porsche Dynamic Chassis Control, Rallye Launch Control, Vesuvius Grey 19″ and 20” 911 Dakar wheels, and a Tequipment roof rack with LED lighting. Power is provided by a twin-turbocharged 3.0L flat-six that drives all four wheels through an eight-speed PDK dual-clutch automatic transaxle. The seller purchased the car as a Porsche Approved Certified Pre-Owned vehicle in late 2023, and they have since added approximately 800 of the 1,600 indicated miles. This 992.1 Dakar is now offered with a window sticker, a rooftop tent, a clean Carfax report, and a clean Florida title in the seller’s name.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC08847-84183-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eIntroduced at the 2022 Los Angeles Auto Show, the 911 Dakar was designed as an homage to the Porsche 953’s overall victory in the 1984 Paris-Dakar Rally. The 911 Dakar model is based on the Carrera 4 GTS but with revisions focused on off-road capability including increased ground clearance, all-terrain tires, specialized drive modes, and various weight-saving measures.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC08727-83971-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThis example is finished in Ice Grey Metallic (M7N) and features “Rallye 1971” decals as well as model-specific stainless-steel front and rear skid plates, a carbon-fiber front hood with stainless-steel vents, a carbon-fiber fixed rear spoiler, black rocker-panel cladding with inset stainless-steel guard plates, black wheel-arch extensions, lightweight glass, red front and rear tow hooks, and Exclusive Design tailpipes finished in silver. Additional exterior details comprise LED Matrix Design headlights with the Porsche Dynamic Light System (PDLS) as well as a Tequipment roof rack with Porsche-branded accessories and integrated LED lighting.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC00948-51402-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eVesuvius Grey-finished 19″ and 20″ 911 Dakar alloy wheels are mounted with Pirelli Scorpion All Terrain Plus tires. The Dakar model features a ride height 50mm higher than standard sport-suspension-equipped 911 variants along with a hydraulic lift system that provides up to an additional 30mm of clearance, with a maximum ride height of 7.5” sustainable at up to 105 mph. Additional standard features for the Dakar include Porsche Dynamic Chassis Control (PDCC) with active anti-roll bars as well as rear-axle steering, traction management, torque vectoring, and Rallye Launch Control. Stopping power is provided by power-assisted six-piston front- and four-piston rear black-painted calipers over cross-drilled and ventilated rotors at all four corners.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC08742-84012-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe bucket seats are upholstered in black leather and Race-Tex with lighter stitching, and matching upholstery extends to the dashboard, center console, and door panels. Matte carbon-fiber trim and body-color vent slats were optional, and amenities include a Bose sound system, dual-zone automatic climate control, and Porsche Communication Management (PCM) with navigation. A fire extinguisher is mounted in the passenger footwell and the car was also optioned with “911 Dakar” under door puddle light projectors.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC08736-84000-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe heated Race-Tex-wrapped and carbon-fiber-trimmed GT Sport steering wheel features paddle shifters and fronts a central white 8k-rpm tachometer with an inset speed readout as well as LCD screens with configurable displays. A Sport Chrono stopwatch with a white dial is mounted atop the center of the dash. The digital odometer indicates 1,600 miles, approximately 800 of which were added under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_DSC08821-84115-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe twin-turbocharged 3.0L flat-six is shared with the Carrera GTS and was factory rated at 473 horsepower and 420 lb-ft of torque. The Dakar model utilizes the cooling system from the 911 Turbo and Turbo S while sharing the GT3’s dynamic engine mounts. The oil was changed in December 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_img_1706-58075.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is routed to all four wheels through an eight-speed PDK dual-clutch automatic transaxle.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/2024_porsche_911-dakar_img_1716-37544.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2024 Porsche 911 Dakar\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe laminated window sticker notes initial delivery to Porsche West Broward in Davie, Florida, and lists factory equipment, colors, options, and a total price of $237,370. A rooftop tent is also included in the sale.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or other reported damage and notes at least one recall.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
