{
  "id": "83358d9c-e48a-426a-a0f1-e6041d99f6bf",
  "title": "Euro 1995 Ferrari F512 M",
  "link": "https://bringatrailer.com/listing/1995-ferrari-f512-m-15/",
  "description": "This 1995 Ferrari F512 M is one of 501 examples produced worldwide between 1994 and 1996. Originally delivered in Europe, it was relocated to Japan in 2008 and imported to the US by the selling dealer in 2024. The car is finished in Nero Carbonio Metallizzato and is powered by a 4.9-liter flat-12 mated to a five-speed manual transaxle and a limited-slip differential. A timing belt service was performed in 2022. Inside, the optional carbon-fiber bucket seats are trimmed in Nero upholstery, and additional features include air conditioning, power windows, an Alpine CD stereo, and a gated shifter. The car rides on 18\" multi-piece Speedline wheels and fully adjustable Quantum Racing suspension components and also has an aftermarket exhaust system. Now showing 35k kilometers (~22k miles), this F512 M is offered in California with the owner's manual, service records, a tool kit, and a clean Arizona title.",
  "author": "bringatrailer",
  "published": "Thu, 13 Feb 2025 01:00:13 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 3738,
  "excerpt": "Bid for the chance to own a Euro 1995 Ferrari F512 M at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #181,033.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/google-chrome-icon-192x192.png?v=40eb42a8d1",
  "text": "This 1995 Ferrari F512 M is one of 501 examples produced worldwide between 1994 and 1996. Originally delivered in Europe, it was relocated to Japan in 2008 and imported to the US by the selling dealer in 2024. The car is finished in Nero Carbonio Metallizzato and is powered by a 4.9-liter flat-12 mated to a five-speed manual transaxle and a limited-slip differential. A timing belt service was performed in 2022. Inside, the optional carbon-fiber bucket seats are trimmed in Nero upholstery, and additional features include air conditioning, power windows, an Alpine CD stereo, and a gated shifter. The car rides on 18″ multi-piece Speedline wheels and fully adjustable Quantum Racing suspension components and also has an aftermarket exhaust system. Now showing 35k kilometers (~22k miles), this F512 M is offered in California with the owner’s manual, service records, a tool kit, and a clean Arizona title. The Pininfarina-designed F512 M was the final installment of the Testarossa and was fitted with revised fixed headlights, quad taillights, and bumper covers when compared to the outgoing 512 TR. This example is finished in Nero Carbonio Metallizzato and features NACA ducts, fog lights, side intake strakes, Scuderia Ferrari fender shields, and quad exhaust outlets. The seller notes that the lower rocker panels as well as the front bonnet and splitter were refinished under prior ownership. The bonnet latch was adjusted in preparation for the sale, and the front bumper was adjusted in 2022. Multi-piece Speedline 18″ alloy wheels are mounted with 235/40 Michelin Pilot Sport 4S tires up front and 295/35 Michelin Pilot Super Sport tires out back. Stopping power is provided by yellow Ferrari-branded calipers over cross-drilled and ventilated discs at each corner, and the calipers were painted in 2022. Fully adjustable Quantum Racing springs and shocks are equipped. Optional carbon-fiber bucket seats are trimmed in Nero Connolly leather with fabric inserts, and appointments further include an Alpine CD stereo, drilled pedals, and power windows. A gated shifter with a dogleg shift pattern is located in the center console alongside controls for the air conditioning. The three-spoke leather-wrapped steering wheel frames Veglia instrumentation including a 320-km/h speedometer and a tachometer with a 7,200-rpm redline as well as gauges for oil pressure and coolant temperature. A clock and auxiliary gauges for fuel level and oil temperature are housed in the center stack. The six-digit odometer shows 35k kilometers (~22k miles), a handful of which were added under current ownership. The 4.9-liter DOHC flat-12 received updates over the version used in the 512 TR including a revised crankshaft and titanium connecting rods. A timing belt service was most recently performed in 2022, and an oil change was completed in preparation for the sale. Compression readings were also taken in 2025 and are shown in the gallery below. Power is sent to the rear wheels through a five-speed manual transaxle and a limited-slip differential. The clutch was overhauled in 2008. An aftermarket exhaust system is fitted. A Ferrari-branded tool kit is included in the sale along with service records and manufacturer’s literature. The Carfax report is free of accidents or damage. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_pics4cars.com-72-84679.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 1995 Ferrari F512 M is one of 501 examples produced worldwide between 1994 and 1996. Originally delivered in Europe, it was relocated to Japan in 2008 and imported to the US by the selling dealer in 2024. The car is finished in Nero Carbonio Metallizzato and is powered by a 4.9-liter flat-12 mated to a five-speed manual transaxle and a limited-slip differential. A timing belt service was performed in 2022. Inside, the optional carbon-fiber bucket seats are trimmed in Nero upholstery, and additional features include air conditioning, power windows, an Alpine CD stereo, and a gated shifter. The car rides on 18″ multi-piece Speedline wheels and fully adjustable Quantum Racing suspension components and also has an aftermarket exhaust system. Now showing 35k kilometers (~22k miles), this F512 M is offered in California with the owner’s manual, service records, a tool kit, and a clean Arizona title.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_pics4cars.com-126-84704.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe Pininfarina-designed F512 M was the final installment of the Testarossa and was fitted with revised fixed headlights, quad taillights, and bumper covers when compared to the outgoing 512 TR. This example is finished in Nero Carbonio Metallizzato and features NACA ducts, fog lights, side intake strakes, Scuderia Ferrari fender shields, and quad exhaust outlets. The seller notes that the lower rocker panels as well as the front bonnet and splitter were refinished under prior ownership. The bonnet latch was adjusted in preparation for the sale, and the front bumper was adjusted in 2022.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_pics4cars.com-84-84736.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eMulti-piece Speedline 18″ alloy wheels are mounted with 235/40 Michelin Pilot Sport 4S tires up front and 295/35 Michelin Pilot Super Sport tires out back. Stopping power is provided by yellow Ferrari-branded calipers over cross-drilled and ventilated discs at each corner, and the calipers were painted in 2022. Fully adjustable Quantum Racing springs and shocks are equipped.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_pics4cars.com-199-84775.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eOptional carbon-fiber bucket seats are trimmed in Nero Connolly leather with fabric inserts, and appointments further include an Alpine CD stereo, drilled pedals, and power windows. A gated shifter with a dogleg shift pattern is located in the center console alongside controls for the air conditioning.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_pics4cars.com-274-84835.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe three-spoke leather-wrapped steering wheel frames Veglia instrumentation including a 320-km/h speedometer and a tachometer with a 7,200-rpm redline as well as gauges for oil pressure and coolant temperature. A clock and auxiliary gauges for fuel level and oil temperature are housed in the center stack. The six-digit odometer shows 35k kilometers (~22k miles), a handful of which were added under current ownership.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_pics4cars.com-179-84923.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 4.9-liter DOHC flat-12 received updates over the version used in the 512 TR including a revised crankshaft and titanium connecting rods. A timing belt service was most recently performed in 2022, and an oil change was completed in preparation for the sale. Compression readings were also taken in 2025 and are shown in the gallery below.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_img_0364-84988.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is sent to the rear wheels through a five-speed manual transaxle and a limited-slip differential. The clutch was overhauled in 2008. An aftermarket exhaust system is fitted.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/02/1995_ferrari_f512-m_img_5815-62831.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Euro 1995 Ferrari F512 M\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eA Ferrari-branded tool kit is included in the sale along with service records and manufacturer’s literature.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or damage.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
