{
  "id": "8dc81a6c-cc5a-4100-b8a7-2168f9935a9b",
  "title": "Morgan Supersport",
  "link": "https://www.autocar.co.uk/car-review/morgan/supersport",
  "description": "Morgan Supersport arrives with the company hoping owners will think of it as the second, not third, car in a garage The Supersport is the Morgan they think could go from being the third car in your garage to the second one.Instead of owners having a daily driver, something more special for semi-regular amusement and a Morgan for high days and holidays, the new Supersport, the company reckons, could fill the second slot – in place (this sounds ambitious) of something like a Porsche 911.Initially Morgan’s engineers only meant to update the Plus Six, the BMW 3.0-litre straight-six Morgan. But this facelift/update/call it what you will took on a life so large that it has a new name, a new appearance, even a new chassis derivation: CXV (115 – Morgan’s age last year) replacing CX (110). That has even necessitated homologating and crashing it again.Perhaps helpfully it positions the Supersport further from the Plus Four, the traditional shape and style and still the meat of the Morgan’s output.",
  "author": "",
  "published": "Tue, 15 Apr 2025 00:05:17 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Editor-at-large Follow:",
  "length": 12263,
  "excerpt": "Morgan Supersport arrives with the company hoping owners will think of it as the second, not third, car in a garage",
  "siteName": "Autocar",
  "favicon": "",
  "text": "The Supersport is the Morgan they think could go from being the third car in your garage to the second one. Instead of owners having a daily driver, something more special for semi-regular amusement and a Morgan for high days and holidays, the new Supersport, the company reckons, could fill the second slot – in place (this sounds ambitious) of something like a Porsche 911. Initially Morgan’s engineers only meant to update the Plus Six, the BMW 3.0-litre straight-six Morgan. But this facelift/update/call it what you will took on a life so large that it has a new name, a new appearance, even a new chassis derivation: CXV (115 – Morgan’s age last year) replacing CX (110). That has even necessitated homologating and crashing it again. Perhaps helpfully it positions the Supersport further from the Plus Four, the traditional shape and style and still the meat of the Morgan’s output. Verdict Plus Six replacement has excellent chassis control, predictable handling and a dose of practicality – but still feels just like a Morgan GoodFeels beautifully put togetherInvolving and engaging handlingBadTicky engine at low speedsRefinement lower than normal 'second car' standards DESIGN \u0026 STYLING Pros Beautifully put together bodyThat rear window gives amazing visibility Cons Chassis still won't be as rigid as something mass-produced The Supersport’s chassis is still bonded aluminium, weighing just 83kg, with reshaped sills and a strengthened transmission tunnel, increasing torsional rigidity by 10% over the Plus Six. If you fit the composite (20kg) hard top, it increases by 10% again. Stronger braces attach the front and rear subframes, to which double wishbones and anti-roll bars are mounted both ends. Optionally (and as fitted to our test car), Nitron adjustable dampers are available. The steering rack is the same as the Plus Six’s, but repositioning it has increased its speed by 13%, it’s claimed to be more linearly responsive and removing two universal joints has reduced friction. The body is handcrafted aluminium but the look is new: a blend of the classic and technical/functional, a language first introduced on the Super 3. As per traditional Mogs, there’s still an ash frame to support the body, visible when you open the bonnet or boot – for there is now a boot, which can hold newly designed door uppers, that clip in and out supremely easily, should you want to run with half doors. INTERIOR Pros Really atmospheric and well finishedSimple switchgearA great view out Cons Some draughts and wind noiseQuite narrow seats – make sure you fit The kerb weight is 1170kg, distributed 50:50 front to rear. That shifts a per cent or two rearwards when somebody drops themselves aboard the snug interior, because you sit closer to the back than the front and this is not a large car, at 4.1m long by 1.8m across the whole body – the inboard cabin design means that is narrower again. The seats are smallish, then, and the view through the letterbox windscreen across the long bonnet and headlight cowls, via three diddy wipers, is extremely atmospheric. Perceived material quality is higher than perhaps ever in a Morgan. For perfect fit and finish the truth is there is no beating a mass-produced car these days, but the BMW-sourced wheel has a pleasing aluminium insert and the minimal switchgear is intuitive. The compact interior dimensions and quirkiness are the first indications that this is still a Morgan and that, as a result, you’d want to be forewarned before swapping your Mercedes or Porsche for one. The seats give occasional material squeaks – not unpleasant – and there’s a fair degree of wind noise, as is inevitable with exterior lumps and sliding acrylic side windows. ENGINES \u0026 PERFORMANCE Pros It's really, really fastBecause it weighs so little, it’s very efficient tooMakes a pleasing noise at higher revs Cons You’ll hear the injectors tick at low speed The engine remains, as it was in the Plus Six, BMW’s single twin-scroll turbocharged ‘B58’ petrol engine making 335bhp at 6500rpm and 369lb ft at 1250rpm, driving the back wheels through an eight-speed automatic transmission and an optional limited-slip differential (not fitted to our ‘VP’, validation prototype, car). At low revs, notable injector ticking noises, like a dozen sewing machines, are another indication that this is not the world’s most refined roadster. But as revs and speed rise, the sound takes on a more fulsome vroom and it goes very, very fast (the claimed 0-62mph in under 4sec feels about right). The eight-speed automatic shifts really cleanly, as expected of this ’box. Brake feel is positive, too. It all augurs well for driving fun and, as we’ll see, the Supersport’s chassis is capable like no Morgan’s before it too. RIDE \u0026 HANDLING Pros Linear steeringExcellent chassis deftness For all the talk of this car moving up a class in terms of capability and refinement, it’s still a Morgan, do understand. So it turns quickly and you feel like you’re sitting closer to the back of it than the middle, with the bonnet and the front wheels stretched out ahead. It's a bit GT-like in that respect. But importantly there’s more predictability and linearity of response than ever, particularly to the steering. Early Morgans on an aluminium architecture had not a lot of steering response at first, and then loads all at once. Things have improved over the years but this is now a truly linearly responsive, communicative, trustworthy steering set-up. Additional bump-stop travel and anti-squat geometry mean there’s a genuine dexterity to the Supersport’s ride and handling like there hasn’t been in any previous Morgan too. On one stretch of especially cambered, twisting and lumpy back road it reminded me a little of an Ariel Nomad, albeit less extreme, with gentle body movements and good ride isolation disguising what must be very deft wheel control. MPG \u0026 RUNNING COSTS Pros Expensive to buy, but there are paybacks later Cons Should hold its value extremely wellGood fuel economy The Supersport is a relatively expensive sports car to buy new at a little over £100,000, at least until you remember that basically everything costs shedloads these days. It's also worth noting that Morgans, because they're desirable and built in such small numbers – maybe 150-200 a year – hold their value extremely well. The 'B58' engine here has a combined fuel consumption of 36.8mpg and in our experience it’s easy to do rather better than that on a cruise. VERDICT Verdict Plus Six replacement has excellent chassis control, predictable handling and a dose of practicality – but still feels just like a Morgan GoodFeels beautifully put togetherInvolving and engaging handlingBadTicky engine at low speedsRefinement lower than normal 'second car' standards Morgan has taken all of the things that the Plus Six was and moved them on considerably. Whatever you think of it, its appearance has moved itself up and away from the existing Plus Four, extending the Morgan range usefully. In terms of performance and ride and handling, too, particularly in terms of its linearity of responses, it’s in a different league to other Mogs.  Ultimately, though, it still feels like a Morgan in the way it drives: you get the sensational view out, sit near the back, and it’s a compact, lightweight, engaging sports car – with some unrefinements.  One suspects, on a wet motorway, in the dark, in November, that the 'second-position' sports car like a Porsche 911 or a Mercedes SL would still feel safer, warmer, more secure. But on the right road, on the right day, the Supersport is utterly compelling. TECHNICAL SPECS Model tested: Morgan Supersport Engine: 6 cyls in line, 2998cc, turbocharged, petrol Transmission: 8-spd automatic Model tested Morgan Supersport Engine 6 cyls in line, 2998cc, turbocharged, petrol View all specs and rivals Transmission 8-spd automatic Torque 369lb ft at 1250rpm 0-62mph - claimed 3.9sec (tbc) Top speed (claimed) 166mph (tbc) Torque 369lb ft at 1250rpm 0-62mph - claimed 3.9sec (tbc) Top speed (claimed) 166mph (tbc) Matt Prior Matt is Autocar’s lead features writer and presenter, is the main face of Autocar’s YouTube channel, presents the My Week In Cars podcast and has written his weekly column, Tester’s Notes, since 2013. Matt is an automotive engineer who has been writing and talking about cars since 1997. He joined Autocar in 2005 as deputy road test editor, prior to which he was road test editor and world rally editor for Channel 4’s automotive website, 4Car.  Into all things engineering and automotive from any era, Matt is as comfortable regularly contributing to sibling titles Move Electric and Classic \u0026 Sports Car as he is writing for Autocar. He has a racing licence, and some malfunctioning classic cars and motorbikes.  NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/morgan_supersport_2025-review-front-tracking-018_0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \n    \u003cdiv\u003e\n                                \u003cdiv\u003e\n\u003cp\u003eThe Supersport is the \u003cstrong\u003eMorgan\u003c/strong\u003e they think could go from being the third car in your garage to the second one.\u003c/p\u003e\n\u003cp\u003eInstead of owners having a daily driver, something more special for semi-regular amusement and a Morgan for high days and holidays, the new Supersport, the company reckons, could fill the second slot – in place (this sounds ambitious) of something like a \u003ca href=\"https://www.autocar.co.uk/car-review/porsche/911\"\u003ePorsche 911\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eInitially Morgan’s engineers only meant to update the \u003ca href=\"https://www.autocar.co.uk/car-review/morgan/plus-six\"\u003ePlus Six\u003c/a\u003e, the BMW 3.0-litre straight-six Morgan. But this facelift/update/call it what you will took on a life so large that it has a new name, a new appearance, even a new chassis derivation: CXV (115 – Morgan’s age last year) replacing CX (110). That has even necessitated homologating and crashing it again.\u003c/p\u003e\n\u003cp\u003ePerhaps helpfully it positions the Supersport further from the \u003ca href=\"https://www.autocar.co.uk/car-review/morgan/plus-four\"\u003ePlus Four\u003c/a\u003e, the traditional shape and style and still the meat of the Morgan’s output.\u003c/p\u003e\n\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003ePlus Six replacement has excellent chassis control, predictable handling and a dose of practicality – but still feels just like a Morgan\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eFeels beautifully put together\u003c/p\u003e\u003cp\u003eInvolving and engaging handling\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTicky engine at low speeds\u003c/p\u003e\u003cp\u003eRefinement lower than normal \u0026#39;second car\u0026#39; standards\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n                              \u003c/div\u003e\n\n        \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n                                            \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eBeautifully put together body\u003c/p\u003e\u003cp\u003eThat rear window gives amazing visibility\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eChassis still won\u0026#39;t be as rigid as something mass-produced \u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe Supersport’s chassis is still bonded aluminium, weighing just 83kg, with reshaped sills and a strengthened transmission tunnel, increasing torsional rigidity by 10% over the Plus Six. If you fit the composite (20kg) hard top, it increases by 10% again.\u003c/p\u003e\n\u003cp\u003eStronger braces attach the front and rear subframes, to which double wishbones and anti-roll bars are mounted both ends. Optionally (and as fitted to our test car), Nitron adjustable dampers are available. The steering rack is the same as the Plus Six’s, but repositioning it has increased its speed by 13%, it’s claimed to be more linearly responsive and removing two universal joints has reduced friction.\u003c/p\u003e\n\u003cp\u003eThe body is handcrafted aluminium but the look is new: a blend of the classic and technical/functional, a language first introduced on the Super 3. As per traditional Mogs, there’s still an ash frame to support the body, visible when you open the bonnet or boot – for there is now a boot, which can hold newly designed door uppers, that clip in and out supremely easily, should you want to run with half doors.\u003c/p\u003e\n\u003c/div\u003e\n                                          \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eINTERIOR\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eReally atmospheric and well finished\u003c/p\u003e\u003cp\u003eSimple switchgear\u003c/p\u003e\u003cp\u003eA great view out\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eSome draughts and wind noise\u003c/p\u003e\u003cp\u003eQuite narrow seats – make sure you fit\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe kerb weight is 1170kg, distributed 50:50 front to rear. That shifts a per cent or two rearwards when somebody drops themselves aboard the snug interior, because you sit closer to the back than the front and this is not a large car, at 4.1m long by 1.8m across the whole body – the inboard cabin design means that is narrower again.\u003c/p\u003e\n\u003cp\u003eThe seats are smallish, then, and the view through the letterbox windscreen across the long bonnet and headlight cowls, via three diddy wipers, is extremely atmospheric.\u003c/p\u003e\n\u003cp\u003ePerceived material quality is higher than perhaps ever in a Morgan. For perfect fit and finish the truth is there is no beating a mass-produced car these days, but the BMW-sourced wheel has a pleasing aluminium insert and the minimal switchgear is intuitive.\u003c/p\u003e\n\u003cp\u003eThe compact interior dimensions and quirkiness are the first indications that this is still a Morgan and that, as a result, you’d want to be forewarned before swapping your Mercedes or Porsche for one. The seats give occasional material squeaks – not unpleasant – and there’s a fair degree of wind noise, as is inevitable with exterior lumps and sliding acrylic side windows.\u003c/p\u003e\n\n\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eIt\u0026#39;s really, really fast\u003c/p\u003e\u003cp\u003eBecause it weighs so little, it’s very efficient too\u003c/p\u003e\u003cp\u003eMakes a pleasing noise at higher revs\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eYou’ll hear the injectors tick at low speed\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe engine remains, as it was in the Plus Six, BMW’s single twin-scroll turbocharged ‘B58’ petrol engine making 335bhp at 6500rpm and 369lb ft at 1250rpm, driving the back wheels through an eight-speed automatic transmission and an optional limited-slip differential (not fitted to our ‘VP’, validation prototype, car).\u003c/p\u003e\n\u003cp\u003eAt low revs, notable injector ticking noises, like a dozen sewing machines, are another indication that this is not the world’s most refined roadster.\u003c/p\u003e\n\u003cp\u003eBut as revs and speed rise, the sound takes on a more fulsome vroom and it goes very, very fast (the claimed 0-62mph in under 4sec feels about right).\u003c/p\u003e\n\u003cp\u003eThe eight-speed automatic shifts really cleanly, as expected of this \u003cspan\u003e’\u003c/span\u003ebox. Brake feel is positive, too. It all augurs well for driving fun and, as we\u003cspan\u003e’\u003c/span\u003ell see, the Supersport’s chassis is capable like no Morgan’s before it too.\u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\u003cdiv data-id=\"ride\" id=\"chapter-ride\"\u003e\n                                      \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eRIDE \u0026amp; HANDLING\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eLinear steering\u003c/p\u003e\u003cp\u003eExcellent chassis deftness\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eFor all the talk of this car moving up a class in terms of capability and refinement, it\u003cspan\u003e’\u003c/span\u003es still a Morgan, do understand.\u003c/p\u003e\n\u003cp\u003eSo it turns quickly and you feel like you’re sitting closer to the back of it than the middle, with the bonnet and the front wheels stretched out ahead. It\u0026#39;s a bit GT-like in that respect.\u003c/p\u003e\n\u003cp\u003eBut importantly there’s more predictability and linearity of response than ever, particularly to the steering. Early Morgans on an aluminium architecture had not a lot of steering response at first, and then loads all at once. Things have improved over the years but this is now a truly linearly responsive, communicative, trustworthy steering set-up.\u003c/p\u003e\n\u003cp\u003eAdditional bump-stop travel and anti-squat geometry mean there’s a genuine dexterity to the Supersport’s ride and handling like there hasn\u003cspan\u003e’\u003c/span\u003et been in any previous Morgan too.\u003c/p\u003e\n\u003cp\u003eOn one stretch of especially cambered, twisting and lumpy back road it reminded me a little of an \u003ca href=\"https://www.autocar.co.uk/car-review/ariel/nomad\"\u003eAriel Nomad\u003c/a\u003e, albeit less extreme, with gentle body movements and good ride isolation disguising what must be very deft wheel control.\u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n \n\n \n\u003cdiv data-id=\"mpg\" id=\"chapter-mpg\"\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eMPG \u0026amp; RUNNING COSTS\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eExpensive to buy, but there are paybacks later\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eShould hold its value extremely well\u003c/p\u003e\u003cp\u003eGood fuel economy\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe Supersport is a relatively expensive sports car to buy new at a little over £100,000, at least until you remember that basically everything costs shedloads these days.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s also worth noting that Morgans, because they\u0026#39;re desirable and built in such small numbers – maybe 150-200 a year – hold their value extremely well.\u003c/p\u003e\n\u003cp\u003eThe \u0026#39;B58\u0026#39; engine here has a combined fuel consumption of 36.8mpg and in our experience it\u003cspan\u003e’\u003c/span\u003es easy to do rather better than that on a cruise.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n         \u003cdiv\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eVERDICT\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003ePlus Six replacement has excellent chassis control, predictable handling and a dose of practicality – but still feels just like a Morgan\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eFeels beautifully put together\u003c/p\u003e\u003cp\u003eInvolving and engaging handling\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTicky engine at low speeds\u003c/p\u003e\u003cp\u003eRefinement lower than normal \u0026#39;second car\u0026#39; standards\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eMorgan has taken all of the things that the Plus Six was and moved them on considerably.\u003c/p\u003e\n\u003cp\u003eWhatever you think of it, its appearance has moved itself up and away from the existing Plus Four, extending the Morgan range usefully.\u003c/p\u003e\n\u003cp\u003eIn terms of performance and ride and handling, too, particularly in terms of its linearity of responses, it\u003cspan\u003e’\u003c/span\u003es in a different league to other Mogs. \u003c/p\u003e\n\u003cp\u003eUltimately, though, it still feels like a Morgan in the way it drives: you get the sensational view out, sit near the back, and it\u003cspan\u003e’\u003c/span\u003es a compact, lightweight, engaging sports car – with some unrefinements. \u003c/p\u003e\n\u003cp\u003eOne suspects, on a wet motorway, in the dark, in November, that the \u0026#39;second-position\u0026#39; sports car like a Porsche 911 or a \u003ca href=\"https://www.autocar.co.uk/car-review/mercedes-amg/sl\"\u003eMercedes SL\u003c/a\u003e would still feel safer, warmer, more secure.\u003c/p\u003e\n\u003cp\u003eBut on the right road, on the right day, the Supersport is utterly compelling.\u003c/p\u003e\n\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n                      \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003e\u003ch2\u003eTECHNICAL SPECS\u003c/h2\u003e\u003c/p\u003e\n    \u003cdiv\u003e\n      \n      \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/thumbnail/public/morgan_supersport_2025-review-front-tracking-018_0.jpg?itok=ZQj_List\" alt=\"Morgan Supersport 2025 Review front tracking 018\"/\u003e\u003c/p\u003e            \u003cdiv\u003e\n              \u003cp\u003eModel tested:\u003c/p\u003e\n              \u003cp\u003eMorgan Supersport\u003c/p\u003e\n            \u003c/div\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n              \u003cp\u003eEngine:\u003c/p\u003e\n              \u003cp\u003e6 cyls in line, 2998cc, turbocharged, petrol\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eTransmission:\u003c/p\u003e\n              \u003cp\u003e8-spd automatic\u003c/p\u003e\n            \u003c/div\u003e\n                \n                \n\n      \u003c/div\u003e\n      \n      \n      \u003cdiv\u003e\n                          \u003cdiv\u003e\n              \u003cp\u003eModel tested\u003c/p\u003e\n                              \u003cp\u003eMorgan Supersport\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eEngine\u003c/p\u003e\n                              \u003cp\u003e6 cyls in line, 2998cc, turbocharged, petrol\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                      \u003cp\u003eView all specs and rivals\u003c/p\u003e\n                                      \u003cdiv\u003e\n              \u003cp\u003eTransmission\u003c/p\u003e\n                              \u003cp\u003e8-spd automatic\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eTorque\u003c/p\u003e\n                              \u003cp\u003e369lb ft at 1250rpm\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003e0-62mph - claimed\u003c/p\u003e\n                              \u003cp\u003e3.9sec (tbc)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eTop speed (claimed)\u003c/p\u003e\n                              \u003cp\u003e166mph (tbc)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                  \u003c/div\u003e\n              \n          \u003c/div\u003e\n    \n      \u003c/div\u003e\n  \n    \u003cdiv\u003e\n                  \n                  \u003cdiv\u003e\n            \u003cp\u003eTorque\u003c/p\u003e\n            \u003cp\u003e369lb ft at 1250rpm\u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n            \u003cp\u003e0-62mph - claimed\u003c/p\u003e\n            \u003cp\u003e3.9sec (tbc)\u003c/p\u003e\n          \u003c/div\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003eTop speed (claimed)\u003c/p\u003e\n            \u003cp\u003e166mph (tbc)\u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \n            \u003c/div\u003e\n    \n\u003c/div\u003e\n\u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/matt-prior\"\u003eMatt Prior\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\u003cp\u003eMatt is Autocar’s lead features writer and presenter, is the main face of Autocar’s YouTube channel, presents the My Week In Cars podcast and has written his weekly column, Tester’s Notes, since 2013.\u003c/p\u003e\n\u003cp\u003eMatt is an automotive engineer who has been writing and talking about cars since 1997. He joined Autocar in 2005 as deputy road test editor, prior to which he was road test editor and world rally editor for Channel 4’s automotive website, 4Car. \u003c/p\u003e\n\u003cp\u003eInto all things engineering and automotive from any era, Matt is as comfortable regularly contributing to sibling titles \u003ca href=\"https://www.moveelectric.com/e-motorbikes/maeving-rm1-electric-motorbike-review\" target=\"_blank\"\u003eMove Electric\u003c/a\u003e and \u003ca href=\"https://www.classicandsportscar.com/features/future-classic-ford-bronco\" target=\"_blank\"\u003eClassic \u0026amp; Sports Car\u003c/a\u003e as he is writing for Autocar. He has a racing licence, and some malfunctioning classic cars and motorbikes. \u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n                            \u003c/div\u003e\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": null,
  "modifiedTime": null
}
