{
  "id": "8f385ced-10cb-4779-a622-93f8b1d334a7",
  "title": "This Custom Vintage Vette Could Talk Us Out Of A ZR1X",
  "link": "https://www.carscoops.com/2025/07/this-custom-vintage-vette-could-talk-us-out-of-a-zr1x/",
  "description": "Restmodded ’67 Sting Ray coupe has a huge motor, big Willwood brakes and a five-speed manual transmission",
  "author": "Chris Chilton",
  "published": "Sat, 26 Jul 2025 23:12:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Auction",
    "Classics",
    "Corvette",
    "Mecum"
  ],
  "byline": "Chris Chilton",
  "length": 4117,
  "excerpt": "Restmodded ’67 Sting Ray coupe has a huge motor, big Willwood brakes and a five-speed manual transmission",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "Restmodded ’67 Sting Ray coupe has a huge motor, big Willwood brakes and a five-speed manual transmission 2 hours ago by Chris Chilton A mean and moody Corvette Sting Ray restomod is heading to Mecum’s Monterey auction. The ’67 coupe has a 432 cu-in V8 with forged guts, alloy heads and electronic fuel injection. A Vintage Air climate control system and five-speed manual bring modern-style usability. The want-one factor is higher for new Corvettes right now than it has been for years. Even the – recently updated – base C8 is a serious sports car bargain and the Z06, ZR1 and ZR1X can stand toe to toe with genuine European exotics yet cost thousands less. But ask me whether I’d rather see a C8 or a classic Vette in front of me when I roll up the garage door on a Sunday and the old timer would win every week. Related: ZR1X Might Not Be The Flagship After All And That Should Scare Everyone Trouble is, old Vettes drive like old cars, because they are. The 1963-67 C2, which is the classic Corvette most people lust after, brought huge advances over the C1, including independent rear suspension and (from 1965) the option of four-wheel disc brakes, but even the newest of those is about to turn 60. Classic Looks, Modern Moves For some people that vintage driving experience, the sloppy steering and buzzy freeway behavior that comes from having only four gears, is part of the charm. But others want the best of both worlds, like whoever commissioned the restomod build on this bruiser of a C2. Starting life as a 1967 coupe, this Corvette is still recognizably a classic Sting Ray. But every aspect of it, from the engine to the chassis, the interior and the body, has been enhanced with tech and design mods available to us almost six decades after it was built. It’s as if the 1960s race-only Grand Sport required a run of road-going homologation cars that deliver track-ready performance with smidge of daily driver usability. Body changes appear to include wider front and rear fenders, shaved bodywork to delete the bumpers and a Stinger hood, which was a special scoop-equipped hood originally fitted only to 427 cu-in (7.0-liter) big block C2s in 1967. Mecum Serious Hardware Upgrades We don’t know which GM engine this car had when it left the factory but it’s now running a 432 cu-in (7.1-liter) V8 with forged internals, aluminum heads and modern electronic fuel injection. That’s backed up by a five-speed manual transmission, Wilwood four-wheel discs, a fast-ratio power-steering setup and a Global West suspension kit with adjustable shocks. Inside, much like outside, it’s a pleasing mix of old and new, the quilted leather sports seats offering far more support and adjustability than the original chairs ever could, and a Vintage Air climate system keeping the driver feeling cool while he’s looking it. Even with all of its mods this C2 wouldn’t see which way a Z06, ZR1 or ZR1X went, but we can see how some Corvette enthusiasts – ones not obsessed about originality – might still prefer it. If you’re one of those people and you fancy placing a bid, head over to Mecum’s listing here. Mecum",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/07/ertygadfv.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                        \u003cp\u003e\n                            Restmodded ’67 Sting Ray coupe has a huge motor, big Willwood brakes and a five-speed manual transmission                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003e2 hours ago\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/07/ertygadfv.webp 1474w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/ertygadfv-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/ertygadfv-1024x577.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/07/ertygadfv-768x432.webp 768w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/07/ertygadfv-1024x577.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/07/ertygadfv.jpg 1474w, https://www.carscoops.com/wp-content/uploads/2025/07/ertygadfv-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/07/ertygadfv-1024x577.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/07/ertygadfv-768x432.jpg 768w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" This Custom Vintage Vette Could Talk Us Out Of A ZR1X\" width=\"1474\" height=\"830\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/chris-chilton-cc/\"\u003e\u003cspan\u003eChris Chilton\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/div\u003e\u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eA mean and moody Corvette Sting Ray restomod is heading to Mecum’s Monterey auction.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe ’67 coupe has a 432 cu-in V8 with forged guts, alloy heads and electronic fuel injection.\u003c/li\u003e\n\n\n\n\u003cli\u003eA Vintage Air climate control system and five-speed manual bring modern-style usability.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eThe want-one factor is higher for new Corvettes right now than it has been for years. Even the – recently updated – base C8 is a serious sports car bargain and the Z06, ZR1 and \u003ca href=\"https://www.carscoops.com/2025/06/chevrolet-corvette-zr1x-against-the-world/\"\u003eZR1X\u003c/a\u003e can stand toe to toe with genuine European exotics yet cost thousands less.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eBut ask me whether I’d rather see a C8 or a classic Vette in front of me when I roll up the garage door on a Sunday and the old timer would win every week.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.carscoops.com/2025/07/zr1x-might-not-be-the-flagship-after-all-and-that-should-scare-everyone/\"\u003eZR1X Might Not Be The Flagship After All And That Should Scare Everyone\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTrouble is, old Vettes drive like old cars, because they are. The 1963-67 C2, which is the classic \u003ca href=\"https://www.carscoops.com/tag/corvette/\"\u003eCorvette\u003c/a\u003e most people lust after, brought huge advances over the C1, including independent rear suspension and (from 1965) the option of four-wheel disc brakes, but even the newest of those is about to turn 60.\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003e\u003cstrong\u003eClassic Looks, Modern Moves\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eFor some people that vintage driving experience, the sloppy steering and buzzy freeway behavior that comes from having only four gears, is part of the charm. But others want the best of both worlds, like whoever commissioned the restomod build on this bruiser of a C2.\u003c/p\u003e\n\n\n\n\u003cp\u003eStarting life as a 1967 coupe, this Corvette is still recognizably a classic Sting Ray. But every aspect of it, from the engine to the chassis, the interior and the body, has been enhanced with tech and design mods available to us almost six decades after it was built. It’s as if the 1960s race-only \u003ca href=\"https://www.carscoops.com/2021/12/209995-will-get-you-this-special-chevy-corvette-grand-sport-continuation/\"\u003eGrand Sport\u003c/a\u003e required a run of road-going homologation cars that deliver track-ready performance with smidge of daily driver usability.\u003c/p\u003e\n\n\n\n\u003cp\u003eBody changes appear to include wider front and rear fenders, shaved bodywork to delete the bumpers and a Stinger hood, which was a special scoop-equipped hood originally fitted only to 427 cu-in (7.0-liter) big block C2s in 1967.\u003c/p\u003e\n\n\n\n                            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                     \n\n\n\n\u003ch4\u003eMecum\u003c/h4\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSerious Hardware Upgrades\u003c/strong\u003e\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eWe don’t know which \u003ca href=\"https://www.carscoops.com/tag/gm/\"\u003eGM\u003c/a\u003e engine this car had when it left the factory but it’s now running a 432 cu-in (7.1-liter) V8 with forged internals, aluminum heads and modern electronic fuel injection. That’s backed up by a five-speed manual transmission, Wilwood four-wheel discs, a fast-ratio power-steering setup and a Global West suspension kit with adjustable shocks.\u003c/p\u003e\n\n\n\n\u003cp\u003eInside, much like outside, it’s a pleasing mix of old and new, the quilted leather sports seats offering far more support and adjustability than the original chairs ever could, and a Vintage Air climate system keeping the driver feeling cool while he’s looking it.\u003c/p\u003e\n\n\n\n\u003cp\u003eEven with all of its mods this C2 wouldn’t see which way a \u003ca href=\"https://www.carscoops.com/2025/05/flippers-be-warned-new-corvette-z06-loses-17000-after-just-628-miles/\"\u003eZ06\u003c/a\u003e, ZR1 or ZR1X went, but we can see how some Corvette enthusiasts – ones not obsessed about originality – might still prefer it. If you’re one of those people and you fancy placing a bid, head over to Mecum’s listing \u003ca href=\"https://www.mecum.com/auctions/monterey-2025/\"\u003e\u003cem\u003ehere\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n                            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                     \n\n\n\n\u003ch4\u003eMecum\u003c/h4\u003e\n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-26T23:12:00Z",
  "modifiedTime": "2025-07-26T19:59:49Z"
}
