{
  "id": "9031c682-4369-43e6-a3e1-cad11c9629c5",
  "title": "Oops, We Did Redlining Again",
  "link": "https://www.jalopnik.com/1828987/city-walk-able-score-real-estate-tool/",
  "description": "Variables rewarded by Walk Score disproportionally led to the Chicago census tracts with the highest share of white residents being ranked the highest.",
  "author": "Ryan Erik King",
  "published": "Mon, 07 Apr 2025 20:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "News",
    "Beyond Cars"
  ],
  "byline": "Ryan Erik King",
  "length": 3315,
  "excerpt": "Variables rewarded by Walk Score disproportionally led to the Chicago census tracts with the highest share of white residents being ranked the highest.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Spotmatik/Getty Images The allure of profiting off the desirability of walkable neighborhoods might be encouraging real estate developers to perpetuate racial inequity. A recent academic paper published last month found that the variables rewarded by Walk Score disproportionally led to the Chicago census tracts with the highest share of white residents being ranked the highest. However, the real estate metric doesn't account for vehicle-pedestrian crash rates or how many residents walk rather than drive. For those of you who have never gone real estate hunting in a city or suburb, Walk Score is intended to quantify a neighborhood's walkability with a simple score between zero and 100. The score carries a lot of weight because it directly implies that it's better to live in one place is better than another. Walk Score's website even states that one point on its metric is worth $3,000 in home value, a worrying statistic with high scores correlates with how white an area is. The pair of researchers who wrote the paper argues that walkable neighborhoods should be considered more valuable, but Walk Score outvalues nearby amenities while ignoring the affordability of those amenities. Kate Lowe, an associate professor at the University of Illinois Chicago, told Streetsblog: \"To me, what Walk Score really is a measure of is destination concentration, and destinations are tied to investment flows. And anything that measures investment flows in a landscape of structural racial inequity is going to reflect those inequities.\" Walk Score tracks investment better than walkability Andersen Ross Photography Inc/Getty Images Walk Score essentially measures how much investment was previously made into a community. This reasoning omits why low-income and Black-majority areas lack amenities. For many neighborhoods, it traces back to redlining in the 1930s when minority-majority neighborhoods were denied federally-backed mortgages. Decades later, the systemic discrimination was compounded when urban freeways were driven through many of the same neighborhoods during the construction of the Interstate Highway System. These trends aren't relegated to history books but still impact cities today. Communities of color are still fighting highway expansions because adding a lane would mean the destruction of homes and the amenities that Walk Score gives out points for. In 2022, a proposed expansion to a 3.5-mile stretch of Interstate 94 in Milwaukee slated a gas station and a Black-owned bar for demolition. With no supermarkets, grocery stores or fast-food restaurants, the gas station is the only local source of food. Unsurprisingly, the Milwaukee neighborhood has a Walk Score of 45, classed as car-dependent. The low score would likely discourage investment rather than encourage a developer to open a grocery store, which is precisely the problem with Walk Score.",
  "image": "https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/l-intro-1744053923.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1828987/city-walk-able-score-real-estate-tool/\" data-post-title=\"Oops, We Did Redlining Again\" data-slide-num=\"0\" data-post-id=\"1828987\"\u003e\n                                             \u003cpicture id=\"pe6c65a1f25927655999f8497ad157cbf\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/intro-1744053923.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/intro-1744053923.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/intro-1744053923.jpg\" data-slide-url=\"https://www.jalopnik.com/1828987/city-walk-able-score-real-estate-tool/\" data-post-id=\"1828987\" data-slide-num=\"0\" data-slide-title=\"Oops, We Did Redlining Again: \" width=\"780\" height=\"438\" alt=\"An aerial view of the Chicago skyline\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSpotmatik/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThe allure of profiting off the desirability of walkable neighborhoods might be encouraging real estate developers to perpetuate racial inequity. A recent academic paper published last month found that the variables rewarded by Walk Score disproportionally led to the Chicago census tracts with the highest share of white residents being ranked the highest. However, the real estate metric doesn\u0026#39;t account for v\u003ca href=\"https://www.jalopnik.com/drivers-in-the-us-killed-more-pedestrians-in-2022-than-1850570777/\" target=\"_blank\"\u003eehicle-pedestrian crash rates\u003c/a\u003e or how many residents walk rather than drive.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eFor those of you who have never gone real estate hunting in a city or suburb, Walk Score is intended to quantify a neighborhood\u0026#39;s walkability with a simple score between zero and 100. The score carries a lot of weight because it directly implies that it\u0026#39;s better to live in one place is better than another. Walk Score\u0026#39;s website even states that one point on its metric is worth $3,000 in home value, a worrying statistic with high scores correlates with how white an area is.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe pair of researchers who wrote the paper argues that walkable neighborhoods should be considered more valuable, but Walk Score outvalues nearby amenities while ignoring the affordability of those amenities. Kate Lowe, an associate professor at the University of Illinois Chicago, \u003ca href=\"https://usa.streetsblog.org/2025/04/07/is-walk-score-really-just-a-white-score\" target=\"_blank\"\u003etold Streetsblog:\u003c/a\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;To me, what Walk Score really is a measure of is destination concentration, and destinations are tied to investment flows. And anything that measures investment flows in a landscape of structural racial inequity is going to reflect those inequities.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWalk Score tracks investment better than walkability\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1828987/city-walk-able-score-real-estate-tool/\" data-post-title=\"Oops, We Did Redlining Again\" data-slide-num=\"1\" data-post-id=\"1828987\"\u003e\n                                             \u003cpicture id=\"pe894c827740ca887eb11b135954d33af\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/walk-score-tracks-investment-better-than-walkability-1744053926.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/walk-score-tracks-investment-better-than-walkability-1744053926.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/oops-we-did-redlining-again/walk-score-tracks-investment-better-than-walkability-1744053926.jpg\" data-slide-url=\"https://www.jalopnik.com/1828987/city-walk-able-score-real-estate-tool/\" data-post-id=\"1828987\" data-slide-num=\"1\" data-slide-title=\"Oops, We Did Redlining Again: Walk Score tracks investment better than walkability\" width=\"780\" height=\"438\" alt=\"A crossing guard helping children cross a residential street\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAndersen Ross Photography Inc/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eWalk Score essentially measures how much investment was previously made into a community. This reasoning omits why low-income and Black-majority areas lack amenities. For many neighborhoods, it traces back to redlining in the 1930s when minority-majority neighborhoods were denied federally-backed mortgages. Decades later, the systemic discrimination was compounded when urban freeways were driven through many of the same neighborhoods during the construction of the Interstate Highway System.\u003c/p\u003e\n\u003cp\u003eThese trends aren\u0026#39;t relegated to history books but still impact cities today. Communities of color are still fighting highway expansions because adding a lane would mean the destruction of homes and the amenities that Walk Score gives out points for. In 2022, \u003ca href=\"https://www.jalopnik.com/milwaukees-highway-expansion-will-make-a-food-desert-ev-1849904899/\" target=\"_blank\"\u003ea proposed expansion to a 3.5-mile stretch of Interstate 94 in Milwaukee\u003c/a\u003e slated a gas station and a Black-owned bar for demolition. With no supermarkets, grocery stores or fast-food restaurants, the gas station is the only local source of food. Unsurprisingly, the Milwaukee neighborhood has \u003ca href=\"https://www.walkscore.com/score/4000-w-clybourn-st-milwaukee-wi-53208\" target=\"_blank\"\u003ea Walk Score of 45\u003c/a\u003e, classed as car-dependent. The low score would likely discourage investment rather than encourage a developer to open a grocery store, which is precisely the problem with Walk Score.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-07T20:25:00Z",
  "modifiedTime": "2025-04-07T20:25:00Z"
}
