{
  "id": "9397f87a-d298-40cf-b1bc-1bbb58fd141a",
  "title": "1986 Lamborghini Countach LP5000 Quattrovalvole | The 1st ever complete restoration undertaken by Lamborghini",
  "link": "",
  "description": "Photography by: Zach Brehl (@zachbrehl) 1986 Lamborghini Countach LP5000 Quattrovalvole (QV) Location: Toronto, Ontario Country of original delivery: Canada Chassis/VIN: GLA12978 Mileage: 25,334 kms (15,742 miles) Certification : Polo Storico Certification Price: Call for Price     The Car | The 1st nut-and-bolt restoration undertaken by Lamborghini As part of its Private Sales initiative, Petrolicious is proud to offer this highly storied, two-owner, factory-restored, US-specification 1986 Lamborghini Countach LP5000 Quattrovalvole. Believed to be the first nut-and-bolt restoration project ever undertaken by Lamborghini, years before the creation of their official heritage department, Polo Storico, in 2015, this Countach LP5000 QV represents a unique chapter in Lamborghini history. This 1986 Countach Quattrovalvole, finished in Rosso over Champagne with a Brown dashboard, was originally delivered on April 17, 1986, to a dealership called Autolynn in Oakville, Ontario, Canada. It was equipped with fuel injection to comply with North American emissions regulations and featured USA-specific bumpers. In the summer of 1988, the car was owned by a real estate agent who, after an afternoon drive, parked it in his driveway. Later that day, smoke began to emanate from the engine bay, ultimately igniting a fire that damaged the engine, body panels, and interior, scorching the seats and causing significant smoke damage. Deemed a write-off by the insurance company due to the scarcity and cost of replacement parts, the car seemed destined for obscurity—until the current custodian, a Canadian collector with a deep passion for the Countach, entered the picture. The search for parts was arduous. “I called every Lamborghini dealer in North America, faxed lists, and made countless calls, only to be told that parts were unavailable or would take months to arrive,” the owner recounted. “The factory had shifted focus to the new Diablo, making Countach components nearly impossible to find.” Then, an unexpected call came from a Toronto lawyer representing Lamborghini. The company, aware of his search through multiple inquiries across North America, wanted to inspect the salvaged parts. By 1989, he shipped the car to Milan. Lamborghini’s sales manager, Ubaldo Sgarzi, responded within a week of the car's arrival, confirming receipt and outlining plans to prepare an estimate for the restoration. With the production line for the Countach already dismantled, many parts had to be handmade or specially ordered from original suppliers. The extensive project took two and a half years and cost over USD $240,000— $30,000 more than the price of a new Diablo at the time. “The documentation is immense,” says the owner. Invoices, receipts, and correspondence attest to what was essentially a full rebuild. This restoration stands as a landmark: the first comprehensive restoration carried out by Lamborghini itself, years before the establishment of their official heritage department, Polo Storico, in 2015.   Continue...",
  "author": "",
  "published": "Thu, 07 Nov 2024 22:52:05 +0000",
  "source": "https://petrolicious.com/feed",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
