{
  "id": "948ed620-2cef-4095-8811-c837a43c414b",
  "title": "2010 Lotus Evora 2+2 6-Speed at No Reserve",
  "link": "https://bringatrailer.com/listing/2010-lotus-evora-23/",
  "description": "This 2010 Lotus Evora 2+2 was finished in green under prior ownership, and it is powered by a 3.5-liter V6 linked with a six-speed manual transaxle. The car has black leather upholstery, bi-xenon headlights, LED taillights, rear parking sensors, 18\" and 19\" forged 10-spoke wheels, Recaro front sport seats, a Pioneer head unit, carbon-fiber interior trim, a rear-view camera, cruise control, two rear seats, and air conditioning. This Evora was purchased by the seller in 2023 and is now offered at no reserve with the owner's manual, two keys, partial service records, a clean Carfax report, and a clean Kentucky title in the seller's name.",
  "author": "bringatrailer",
  "published": "Fri, 11 Oct 2024 23:55:19 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 3275,
  "excerpt": "Bid for the chance to own a No Reserve: 2010 Lotus Evora 2+2 6-Speed at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #167,296.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/apple-touch-icon-ipad-retina-152x152.png?v=http://7d7c29de59",
  "text": "This 2010 Lotus Evora 2+2 was finished in green under prior ownership, and it is powered by a 3.5-liter V6 linked with a six-speed manual transaxle. The car has black leather upholstery, bi-xenon headlights, LED taillights, rear parking sensors, 18″ and 19″ forged 10-spoke wheels, Recaro front sport seats, a Pioneer head unit, carbon-fiber interior trim, a rear-view camera, cruise control, two rear seats, and air conditioning. This Evora was purchased by the seller in 2023 and is now offered at no reserve with the owner’s manual, two keys, partial service records, a clean Carfax report, and a clean Kentucky title in the seller’s name. Finished from the factory in red, the composite body was repainted in the current shade of green under prior ownership. Exterior details include bi-xenon headlights with washers, LED taillights, an integrated rear spoiler, rear parking sensors, and dual exhaust outlets that exit through the center of the rear diffuser. Close-up photos of paint chips are provided in the gallery below. The passenger window regulator was replaced in May 2024. The 18″ and 19″ forged 10-spoke wheels are mounted with Pirelli P Zero tires. The suspension features forged aluminum unequal-length double wishbones, Eibach springs, Bilstein dampers, and front and rear anti-roll bars. Stopping power is provided by yellow-finished brake calipers over ventilated and cross-drilled discs at all four corners. A brake fluid flush was performed in August 2024. Two wheels have curb damage. The cabin features Recaro sport front seats and two rear seats upholstered in black leather, which extends to the center console, dashboard, and door panels. Amenities include a Pioneer head unit, a rear-view camera, carbon-fiber trim, cruise control, and air conditioning. Seam separation is visible on the dashboard upholster, the left-rear seat has discoloration, two buttons for the headlights and parking lights are missing. The ambient temperature sensor was replaced in December 2023. The three-spoke leather-wrapped steering wheel fronts a 180-mph speedometer and a 9k-rpm tachometer as well as dual auxiliary displays for fuel level and coolant temperature. The digital odometer shows 3,700 miles, approximately 500 of which were added under current ownership. A replacement clockspring was installed in December 2023, at which time the instrument cluster was repaired. The seller states an airbag warning light remains illuminated. The 3.5-liter 2GR-FE V6 was factory rated at 276 horsepower and 258 lb-ft of torque. An oil change was performed and the air filter and drive belt were replaced in August 2024. Power is routed to the rear wheels through a six-speed manual transaxle. Additional photos of the underside are provided in the gallery. The Carfax report is free of accidents or other reported damage. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/10/2010_lotus_evora_dsc0303-11324.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 2010 Lotus Evora 2+2 was finished in green under prior ownership, and it is powered by a 3.5-liter V6 linked with a six-speed manual transaxle. The car has black leather upholstery, bi-xenon headlights, LED taillights, rear parking sensors, 18″ and 19″ forged 10-spoke wheels, Recaro front sport seats, a Pioneer head unit, carbon-fiber interior trim, a rear-view camera, cruise control, two rear seats, and air conditioning. This Evora was purchased by the seller in 2023 and is now offered at no reserve with the owner’s manual, two keys, partial service records, a clean Carfax report, and a clean Kentucky title in the seller’s name.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/10/2010_lotus_evora_dsc0273-11351.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"No Reserve: 2010 Lotus Evora 2+2 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eFinished from the factory in red, the composite body was repainted in the current shade of green under prior ownership. Exterior details include bi-xenon headlights with washers, LED taillights, an integrated rear spoiler, rear parking sensors, and dual exhaust outlets that exit through the center of the rear diffuser. Close-up photos of paint chips are provided in the gallery below. The passenger window regulator was replaced in May 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/10/2010_lotus_evora_dsc0283-11371.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"No Reserve: 2010 Lotus Evora 2+2 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 18″ and 19″ forged 10-spoke wheels are mounted with Pirelli P Zero tires. The suspension features forged aluminum unequal-length double wishbones, Eibach springs, Bilstein dampers, and front and rear anti-roll bars. Stopping power is provided by yellow-finished brake calipers over ventilated and cross-drilled discs at all four corners. A brake fluid flush was performed in August 2024. Two wheels have curb damage.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/10/DSC0619-77642.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"No Reserve: 2010 Lotus Evora 2+2 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe cabin features Recaro sport front seats and two rear seats upholstered in black leather, which extends to the center console, dashboard, and door panels. Amenities include a Pioneer head unit, a rear-view camera, carbon-fiber trim, cruise control, and air conditioning. Seam separation is visible on the dashboard upholster, the left-rear seat has discoloration, two buttons for the headlights and parking lights are missing. The ambient temperature sensor was replaced in December 2023.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/10/DSC0582-77595.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"No Reserve: 2010 Lotus Evora 2+2 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe three-spoke leather-wrapped steering wheel fronts a 180-mph speedometer and a 9k-rpm tachometer as well as dual auxiliary displays for fuel level and coolant temperature. The digital odometer shows 3,700 miles, approximately 500 of which were added under current ownership. A replacement clockspring was installed in December 2023, at which time the instrument cluster was repaired. The seller states an airbag warning light remains illuminated.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/10/DSC0381-77805.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"No Reserve: 2010 Lotus Evora 2+2 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 3.5-liter 2GR-FE V6 was factory rated at 276 horsepower and 258 lb-ft of torque. An oil change was performed and the air filter and drive belt were replaced in August 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/10/2010_lotus_evora_pxl_20241009_165501888-78855.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"No Reserve: 2010 Lotus Evora 2+2 6-Speed\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is routed to the rear wheels through a six-speed manual transaxle. Additional photos of the underside are provided in the gallery.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or other reported damage.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
