{
  "id": "9b99e121-0843-42ff-9269-7b9edb002d3f",
  "title": "Ram Recalls 129,000 Pickups Over Turn-Signal Defect",
  "link": "https://www.thetruthaboutcars.com/cars/news-blog/ram-recalls-129-000-pickups-over-turn-signal-defect-44509684?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
  "description": "Ram is recalling nearly 130,000 examples of the 1500 pickup due to issues with the self-canceling turn signals. As recalls go, this one is a minor safety issue with any legitimate risks being mitigated by an attentive driver. However, it does put the affected vehicles out of compliance with Federal Motor Vehicle Safety Standards (FMVSS). It likewise doesn’t help the brand improve its reputation for reliability after Ram was forced to recall over nearly 1.3 million pickups over electrical gremlins just last month.",
  "author": "Matt Posky",
  "published": "Tue, 08 Oct 2024 19:00:00 +0000",
  "source": "https://www.thetruthaboutcars.com/feed/",
  "categories": [
    "News Blog"
  ],
  "byline": "Matt Posky",
  "length": 4753,
  "excerpt": "Ram is recalling nearly 130,000 examples of the 1500 pickup due to issues with the self-canceling turn signals. As recalls go, this one is a minor safety iss…",
  "siteName": "Ttac",
  "favicon": "https://cdn-fastly.thetruthaboutcars.com/resources/themes/ttac/imgs-responsive/ttac-apple-touch-icon.png",
  "text": "Published:  October 8th, 2024 Ram is recalling nearly 130,000 examples of the 1500 pickup due to issues with the self-canceling turn signals. As recalls go, this one is a minor safety issue with any legitimate risks being mitigated by an attentive driver. However, it does put the affected vehicles out of compliance with Federal Motor Vehicle Safety Standards (FMVSS). It likewise doesn’t help the brand improve its reputation for reliability after Ram was forced to recall over nearly 1.3 million pickups over electrical gremlins just last month. To be fair, many automakers have seen a lapse in quality in recent years with electrical issues being the primary issue. But Stellantis brands (which includes Ram) are among those developing a bad reputation for them.The previous recall impacted the ABS module. Failed units not only disabled anti-lock braking, they also nullified the vehicles’ electronic stability control (ESC). Ram stated that the problem could be remedied via a software update and would not require any hardware to be replaced. Meanwhile, the turn-signal issue is alleged to stem from the steering column control module. The mechanism that cancels the turn signal as the steering straightens out the wheels may not function properly. The recall report stipulates that this could lead to situations where drivers are erroneously signaling a turn to other vehicles, potentially increasing the odds of a collision. Obviously, responsible drivers can simply slap the stalk to end the signaling manually — something motorcyclists have been doing for ages. But the trucks are still out of compliance with federal guidelines and legally have to be recalled. Impacted pickups were manufactured between March 24th and December 27th of 2023. This means that some 2024 MY vehicles are included. However, the report stipulates that only about 5 percent of the total number should be affected. The automaker (which is listed as FCA US in NHTSA report, rather than Stellantis North America) will conduct a voluntary safety recall on all affected vehicles to inspect and if necessary, replace the steering column control module with a turn-signal lever that “does not have an interference condition.” As with all formal recalls, work will be conducted free of charge. All dealers should be notified of the defect by October 8th. But customers likely won’t start seeing letters in the mail until the end of the month. Those disinclined to wait can contact their local dealership or use the NHTSA recall database to lookup their vehicle. Just make sure to have your VIN handy. [Images: Stellantis]Become a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by  subscribing to our newsletter. Consumer advocate tracking industry trends and regulations. Before joining TTAC, Matt spent a decade working for marketing and research firms based in NYC. Clients included several of the world’s largest automakers, global tire brands, and aftermarket part suppliers. Dissatisfied, he pivoted to writing about cars. Since then, he has become an ardent supporter of the right-to-repair movement, been interviewed about the automotive sector by national broadcasts, participated in a few amateur rallying events, and driven more rental cars than anyone ever should. Handy with a wrench, Matt grew up surrounded by Detroit auto workers and learned to drive by twelve. A contrarian, Matt claims to prefer understeer and motorcycles. More by Matt Posky",
  "image": "https://cdn-fastly.thetruthaboutcars.com/media/marketing_photos/2024/10/08/86728/social-44509684.jpg?size=1200x628",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                    \n                    \n\n        \u003cdiv\u003e\n                \u003cp\u003e\u003ca data-js-href=\"/member/1357641/mattposky\"\u003e\n                    \u003cimg src=\"https://cdn-fastly.thetruthaboutcars.com/media/profile/2022/08/25/1357641_2.jpg?size=91x91\" width=\"74\" height=\"74\" alt=\"Matt Posky\"/\u003e\n                \u003c/a\u003e\u003c/p\u003e\n        \u003c/div\u003e\n\n                        \u003cdiv\u003e\n                                    \u003cp\u003e\u003cspan\u003e \u003cstrong\u003ePublished: \u003c/strong\u003e October 8th, 2024\u003c/span\u003e\u003c/p\u003e                        \u003c/div\u003e\n\n\n                        \n\n                    \n                    \n\n\n\n\n                    \u003cdiv data-tr_zone=\"Activity Body\"\u003e\n                        \n\n                        \n\n\n                        \n\n                                \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003eRam is recalling nearly 130,000 examples of the 1500 pickup due to issues with the self-canceling turn signals. As recalls go, this one is a minor safety issue with any legitimate risks being mitigated by an attentive driver. However, it does put the affected vehicles out of compliance with Federal Motor Vehicle Safety Standards (FMVSS). It likewise doesn’t help the brand improve its reputation for reliability after Ram was forced to recall over nearly 1.3 million pickups over electrical gremlins just last month. \u003c/p\u003e\u003ccuttext\u003e\u003c/cuttext\u003e\u003cp\u003eTo be fair, many automakers have seen a lapse in quality in recent years with electrical issues being the primary issue. But Stellantis brands (which includes Ram) are among those developing a bad reputation for them.\u003c/p\u003e\u003cp\u003eThe previous recall impacted the ABS module. Failed units not only disabled anti-lock braking, they also nullified the vehicles’ electronic stability control (ESC). Ram stated that the problem could be remedied via a software update and would not require any hardware to be replaced. \u003c/p\u003e\u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003eMeanwhile, the turn-signal issue is alleged to stem from the steering column control module. The mechanism that cancels the turn signal as the steering straightens out the wheels may not function properly. \u003ca href=\"https://static.nhtsa.gov/odi/rcl/2024/RCLRPT-24V729-8495.PDF\" rel=\"nofollow noopener\" target=\"_blank\"\u003eThe recall report\u003c/a\u003e stipulates that this could lead to situations where drivers are erroneously signaling a turn to other vehicles, potentially increasing the odds of a collision. \u003c/p\u003e\u003cp\u003eObviously, responsible drivers can simply slap the stalk to end the signaling manually — something motorcyclists have been doing for ages. But the trucks are still out of compliance with federal guidelines and legally have to be recalled. \u003c/p\u003e\u003cp\u003eImpacted pickups were manufactured between March 24th and December 27th of 2023. This means that some 2024 MY vehicles are included. However, the report stipulates that only about 5 percent of the total number should be affected. \u003c/p\u003e\u003c/div\u003e\n\n                    \n\n\n                    \n                            \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003eThe automaker (which is listed as FCA US in NHTSA report, rather than Stellantis North America) will conduct a voluntary safety recall on all affected vehicles to inspect and if necessary, replace the steering column control module with a turn-signal lever that “does not have an interference condition.” \u003c/p\u003e\u003cp\u003eAs with all formal recalls, work will be conducted free of charge. \u003c/p\u003e\u003cp\u003eAll dealers should be notified of the defect by October 8th. But customers likely won’t start seeing letters in the mail until the end of the month. Those disinclined to wait can contact their local dealership or use \u003ca href=\"https://www.nhtsa.gov/\" rel=\"nofollow noopener\" target=\"_blank\"\u003ethe NHTSA recall database\u003c/a\u003e to lookup their vehicle. Just make sure to have your VIN handy. \u003c/p\u003e\u003c/div\u003e\n\n                    \n\n\n\n                                \n                                \n\n                            \n                            \n                            \u003cdiv\u003e\n                                \u003cp\u003e[Images: Stellantis]\u003c/p\u003e\u003cp\u003e\u003ci\u003eBecome a TTAC insider. Get the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by \u003c/i\u003e\u003ci\u003e \u003ca href=\"https://email.thetruthaboutcars.com/newsletter-signup/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esubscribing to our newsletter\u003c/a\u003e\u003c/i\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n\n                        \n                    \u003c/div\u003e\n\n                    \n\n            \n\n\n                    \n\n                        \n\n                        \n                        \n    \n\n\n\n            \n                    \n\n            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdn-fastly.thetruthaboutcars.com/media/profile/2022/08/25/1357641_2.jpg?size=91x91\" alt=\"Matt Posky\" width=\"90\" height=\"90\"/\u003e\u003c/p\u003e\u003cdiv\u003e\n                    \n                    \u003cp\u003eConsumer advocate tracking industry trends and regulations. Before joining TTAC, Matt spent a decade working for marketing and research firms based in NYC. Clients included several of the world’s largest automakers, global tire brands, and aftermarket part suppliers. Dissatisfied, he pivoted to writing about cars. Since then, he has become an ardent supporter of the right-to-repair movement, been interviewed about the automotive sector by national broadcasts, participated in a few amateur rallying events, and driven more rental cars than anyone ever should. Handy with a wrench, Matt grew up surrounded by Detroit auto workers and learned to drive by twelve. A contrarian, Matt claims to prefer understeer and motorcycles.\u003c/p\u003e\n                    \u003cp\u003eMore by \u003ca href=\"https://www.thetruthaboutcars.com/member/1357641/mattposky\"\u003eMatt Posky\u003c/a\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n                    \n\n\n\n                    \n                    \n\n                            \n\n\n\n                    \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-08T15:00:00-04:00",
  "modifiedTime": "2024-10-08T15:00:00-04:00"
}
