{
  "id": "9f2ef58c-a9cb-4efc-a78c-3918011c9964",
  "title": "Maruti Swift long term review, 1,200km report",
  "link": "https://www.autocarindia.com/car-long-termer/maruti-swift-long-term-review-1200km-report-432986#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
  "description": "The Mini Cooper was one of the first cars to introduce the concept of an affordable, fun-to-drive small car. As time passed, affordability reduced as the new Mini models climbed up into the premium end. But, of course, the fun element remained. In a similar vein, albeit at the other end of the spectrum, is the Maruti Swift. The first generation Swift was fun, and in keeping with Maruti’s ethos, affordable too. However, since the launch of the fourth-generation Swift, there has been a lot of talk about the smaller three-cylinder engine – lacking in power and grunt – and the price climbing higher, reaching levels of its elder sibling, the Baleno. Yes, the price has climbed higher for sure, but as for performance, it hasn’t been an issue for me at all. I say this after using the new Swift as my daily driver for around a month now.  A full-fledged dead-pedal adds to comfort, especially in stop-go traffic. The shape and size are just right for the city, the seats are soft and comfy, and the engine – well, it’s efficient. And that’s always a higher priority when I’m paying fuel bills. Since I got the Swift, I’ve clocked over 1,000km and the average efficiency has always been above 14kpl. And no, I do not drive it with a light foot. To be fair, on many occasions, I can’t. In peak-hour traffic, the engine is more than adequate, but as soon as a few overtakes are on the cards, it needs to be wrung hard. The linear power delivery just doesn’t cut it, and the only quick fix is downshifting. Speaking of which, I had hoped for an automatic after driving the manual Exter for over three months, but the Swift is yet another manual. I would have sulked if it were any other car, but on the Swift, having a manual gearbox is fun. The clutch is superlight and absolutely effortless, the gears slot in well, and you almost forget about the lack of pep from the engine. The seating position is also bang on, and there is a dedicated dead pedal for added comfort. Rear camera quality is average and worsens in the dark. Guidelines not dynamic. What’s a bit of an annoyance is the auto start/stop, which helps save fuel, but in stop-go traffic, the constant shutting off and on will add to the suffering. Thankfully, it just takes a press of a button to turn it off. The other negative is the camera quality. Given the price at which the new Swift has been launched, you would expect a decent parking camera. However, the resolution is poor on the new Swift, and even basics like dynamic guidelines are missing. In the dark, and while it is raining, you cannot rely too much on it. Speaking of darkness, there is no rear cabin light, which I’m guessing helps save some costs, but it is essential. I end up storing shopping bags or small items in the back seat and in case they roll off or I can’t find them, I have to use the phone flashlight. A lamp at the rear would have helped. With an average efficiency of over 14kpl, there’s no range or financial anxiety. The rest of the car, though, has been perfect in the city. The steering is light enough to allow zipping through narrow streets and parking in tight spaces, especially in and around the crowded suburb of Bandra. The boot is more than adequate for a weekend out of the city, the rear seats get dedicated USB-A and type-C charging ports as well as AC vents. LED lights work well in the dark, the ground clearance is plenty, and there is nothing to complain about the ride comfort from the 15-inch wheels. Honestly, the more I drive it, the more I like it. No cabin light in the rear makes it difficult to look for items in the back at night. As an introduction, it has been very positive, and most apprehensions about the dull engine performance fade away. However, once this anniversary issue closes, I’ve planned a getaway out of town, which will involve a whole lot more overtaking and triple-digit speeds. How the engine fares there is what the next report will be on. Also see: 2024 Maruti Swift road test, review Maruti Swift vs Baleno comparison video Maruti Swift CNG launched at Rs 8.20 lakh",
  "author": "Jay Patil",
  "published": "Sun, 29 Sep 2024 07:30:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
  "categories": null,
  "byline": "Jay Patil",
  "length": 4226,
  "excerpt": "First report: The fourth-generation of India\u0026amp;#8217;s most loved hatchback joins our fleet and comes with a good ol\u0026amp;#8217; manual gearbox. Time to row through the ratios.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "First report: The fourth-generation of India’s most loved hatchback joins our fleet and comes with a good ol’ manual gearbox. Time to row through the ratios.The Mini Cooper was one of the first cars to introduce the concept of an affordable, fun-to-drive small car. As time passed, affordability reduced as the new Mini models climbed up into the premium end. But, of course, the fun element remained. In a similar vein, albeit at the other end of the spectrum, is the Maruti Swift. The first generation Swift was fun, and in keeping with Maruti’s ethos, affordable too. However, since the launch of the fourth-generation Swift, there has been a lot of talk about the smaller three-cylinder engine – lacking in power and grunt – and the price climbing higher, reaching levels of its elder sibling, the Baleno. Yes, the price has climbed higher for sure, but as for performance, it hasn’t been an issue for me at all. I say this after using the new Swift as my daily driver for around a month now. A full-fledged dead-pedal adds to comfort, especially in stop-go traffic.The shape and size are just right for the city, the seats are soft and comfy, and the engine – well, it’s efficient. And that’s always a higher priority when I’m paying fuel bills. Since I got the Swift, I’ve clocked over 1,000km and the average efficiency has always been above 14kpl. And no, I do not drive it with a light foot. To be fair, on many occasions, I can’t. In peak-hour traffic, the engine is more than adequate, but as soon as a few overtakes are on the cards, it needs to be wrung hard. The linear power delivery just doesn’t cut it, and the only quick fix is downshifting. Speaking of which, I had hoped for an automatic after driving the manual Exter for over three months, but the Swift is yet another manual. I would have sulked if it were any other car, but on the Swift, having a manual gearbox is fun. The clutch is superlight and absolutely effortless, the gears slot in well, and you almost forget about the lack of pep from the engine. The seating position is also bang on, and there is a dedicated dead pedal for added comfort. Rear camera quality is average and worsens in the dark. Guidelines not dynamic.What’s a bit of an annoyance is the auto start/stop, which helps save fuel, but in stop-go traffic, the constant shutting off and on will add to the suffering. Thankfully, it just takes a press of a button to turn it off. The other negative is the camera quality. Given the price at which the new Swift has been launched, you would expect a decent parking camera. However, the resolution is poor on the new Swift, and even basics like dynamic guidelines are missing. In the dark, and while it is raining, you cannot rely too much on it. Speaking of darkness, there is no rear cabin light, which I’m guessing helps save some costs, but it is essential. I end up storing shopping bags or small items in the back seat and in case they roll off or I can’t find them, I have to use the phone flashlight. A lamp at the rear would have helped. With an average efficiency of over 14kpl, there’s no range or financial anxiety.The rest of the car, though, has been perfect in the city. The steering is light enough to allow zipping through narrow streets and parking in tight spaces, especially in and around the crowded suburb of Bandra. The boot is more than adequate for a weekend out of the city, the rear seats get dedicated USB-A and type-C charging ports as well as AC vents. LED lights work well in the dark, the ground clearance is plenty, and there is nothing to complain about the ride comfort from the 15-inch wheels. Honestly, the more I drive it, the more I like it. No cabin light in the rear makes it difficult to look for items in the back at night.As an introduction, it has been very positive, and most apprehensions about the dull engine performance fade away. However, once this anniversary issue closes, I’ve planned a getaway out of town, which will involve a whole lot more overtaking and triple-digit speeds. How the engine fares there is what the next report will be on.Also see:2024 Maruti Swift road test, reviewMaruti Swift vs Baleno comparison videoMaruti Swift CNG launched at Rs 8.20 lakhImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20240926124401_Maruti_Swift_long_term_review_front_static.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eFirst report: The fourth-generation of India’s most loved hatchback joins our fleet and comes with a good ol’ manual gearbox. Time to row through the ratios.\u003c/p\u003e\u003cdiv\u003e\u003cp dir=\"ltr\"\u003e\u003cspan id=\"docs-internal-guid-c0b4e7cd-7fff-7ff9-fa98-2d484a485605\"\u003eThe Mini Cooper was one of the first cars to introduce the concept of an affordable, fun-to-drive small car. As time passed, affordability reduced as the new Mini models climbed up into the premium end. But, of course, the fun element remained. In a similar vein, albeit at the other end of the spectrum, is the \u003ca href=\"https://www.autocarindia.com/cars/maruti/swift\" title=\"Maruti Swift\"\u003e\u003cstrong\u003eMaruti Swift\u003c/strong\u003e\u003c/a\u003e. The first generation Swift was fun, and in keeping with Maruti’s ethos, affordable too. However, since the launch of the fourth-generation Swift, there has been a lot of talk about the smaller three-cylinder engine – lacking in power and grunt – and the price climbing higher, reaching levels of its elder sibling, the Baleno. Yes, the price has climbed higher for sure, but as for performance, it hasn’t been an issue for me at all. I say this after using the new Swift as my daily driver for around a month now. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Maruti Swift long term review dead pedal\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Maruti-Swift-long-term-review-dead-pedal.png\u0026amp;c=0\u0026amp;w=700\" title=\"Maruti Swift long term review dead pedal\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eA full-fledged dead-pedal adds to comfort, especially in stop-go traffic.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp dir=\"ltr\"\u003e\u003cspan id=\"docs-internal-guid-c0b4e7cd-7fff-7ff9-fa98-2d484a485605\"\u003eThe shape and size are just right for the city, the seats are soft and comfy, and the engine – well, it’s efficient. And that’s always a higher priority when I’m paying fuel bills. Since I got the Swift, I’ve clocked over 1,000km and the average efficiency has always been above 14kpl. And no, I do not drive it with a light foot. To be fair, on many occasions, I can’t. In peak-hour traffic, the engine is more than adequate, but as soon as a few overtakes are on the cards, it needs to be wrung hard. The linear power delivery just doesn’t cut it, and the only quick fix is downshifting. Speaking of which, I had hoped for an automatic after driving the manual Exter for over three months, but the Swift is yet another manual. I would have sulked if it were any other car, but on the Swift, having a manual gearbox is fun. The clutch is superlight and absolutely effortless, the gears slot in well, and you almost forget about the lack of pep from the engine. The seating position is also bang on, and there is a dedicated dead pedal for added comfort. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Maruti Swift long term review rear camera\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Maruti-Swift-long-term-review-rear-camera.png\u0026amp;c=0\u0026amp;w=700\" title=\"Maruti Swift long term review rear camera\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eRear camera quality is average and worsens in the dark. Guidelines not dynamic.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp dir=\"ltr\"\u003e\u003cspan\u003eWhat’s a bit of an annoyance is the auto start/stop, which helps save fuel, but in stop-go traffic, the constant shutting off and on will add to the suffering. Thankfully, it just takes a press of a button to turn it off. The other negative is the camera quality. Given the price at which the new Swift has been launched, you would expect a decent parking camera. However, the resolution is poor on the new Swift, and even basics like dynamic guidelines are missing. In the dark, and while it is raining, you cannot rely too much on it. Speaking of darkness, there is no rear cabin light, which I’m guessing helps save some costs, but it is essential. I end up storing shopping bags or small items in the back seat and in case they roll off or I can’t find them, I have to use the phone flashlight. A lamp at the rear would have helped. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Maruti Swift long term review mileage\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Maruti-Swift-long-term-review-mileage.png\u0026amp;c=0\u0026amp;w=700\" title=\"Maruti Swift long term review mileage\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eWith an average efficiency of over 14kpl, there’s no range or financial anxiety.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp dir=\"ltr\"\u003e\u003cspan\u003eThe rest of the car, though, has been perfect in the city. The steering is light enough to allow zipping through narrow streets and parking in tight spaces, especially in and around the crowded suburb of Bandra. The boot is more than adequate for a weekend out of the city, the rear seats get dedicated USB-A and type-C charging ports as well as AC vents. LED lights work well in the dark, the ground clearance is plenty, and there is nothing to complain about the ride comfort from the 15-inch wheels. Honestly, the more I drive it, the more I like it. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Maruti Swift long term review roof\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Maruti-Swift-long-term-review-roof.png\u0026amp;c=0\u0026amp;w=700\" title=\"Maruti Swift long term review roof\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eNo cabin light in the rear makes it difficult to look for items in the back at night.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp dir=\"ltr\"\u003e\u003cspan\u003eAs an introduction, it has been very positive, and most apprehensions about the dull engine performance fade away. However, once this anniversary issue closes, I’ve planned a getaway out of town, which will involve a whole lot more overtaking and triple-digit speeds. How the engine fares there is what the next report will be on.\u003c/span\u003e\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u003cstrong\u003e\u003cspan\u003eAlso see:\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-reviews/maruti-swift-road-test-review-432976\"\u003e2024 Maruti Swift road test, review\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-video-reviews/maruti-swift-vs-baleno-comparison-video-432210\"\u003eMaruti Swift vs Baleno comparison video\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/maruti-swift-cng-launched-at-rs-820-lakh-432826\"\u003eMaruti Swift CNG launched at Rs 8.20 lakh\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-432986\"\u003e\u003cul id=\"tab-id-432986\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-432986\" href=\"#.\" rel=\"#tab-images-container-432986\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-432986\" href=\"#.\" rel=\"#tab-videos-container-432986\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-09-29T07:30:00+05:30",
  "modifiedTime": null
}
