{
  "id": "a368aac7-9de1-4a5b-9d01-837e26e62cef",
  "title": "A Shocking Shift, Why Are Drivers Turning Safety Tech Back On?",
  "link": "https://www.autoblog.com/news/a-shocking-shift-why-are-drivers-turning-safety-tech-back-on",
  "description": "New data reveals an unexpected change in driver behavior—what’s making people rethink their stance on safety tech, and what could it mean for the future of driving?",
  "author": "Elijah Nicholson-Messmer",
  "published": "Fri, 04 Oct 2024 19:00:00 GMT",
  "source": "https://www.autoblog.com/rss.xml",
  "categories": [
    "News"
  ],
  "byline": "Elijah Nicholson-Messmer",
  "length": 6155,
  "excerpt": "New data reveals an unexpected change in driver behavior—what’s making people rethink their stance on safety tech, and what could it mean for the future of driving?",
  "siteName": "Autoblog: Car News, Reviews and Buying Guides",
  "favicon": "https://www.autoblog.com/site/images/apple-touch-icon-114x114-precomposed.png?v=2024-10-10-184209-e723606-000144",
  "text": "Automotive crashes are one of the leading causes of death in the United States today, with 100 people killed every day in collisions, according to the U.S. Centers for Disease Control. Yet, a suite of new safety systems designed to make driving safer received a cold reception from many drivers as manufacturers began introducing the tech over the last decade. Now, a new study by the Insurance Institute for Highway Safety (IIHS) found that U.S. drivers are finally warming up to the potentially life-saving features.More drivers are leaving their lane departure systems enabledNearly nine out of 10 drivers of vehicles equipped with lane departure warning and prevention systems now keep them switched on, according to the new study from the IIHS — a 71% increase compared to a similar study conducted by the organization in 2016.While this uptick suggests that manufacturers have made strides in improving the functionality and user-friendliness of these systems, the fact remains that a notable portion of drivers still turn them off.So, what’s driving this ambivalence? The IIHS study indicates that many drivers find the audible alerts associated with lane departure warnings to be more irritating than helpful. Instead, systems that offer haptic feedback, such as vibrations in the steering wheel or seat, are proving to be more effective at encouraging use.“The results reflect a combination of better designs and a growing acceptance of crash avoidance systems, more generally,” said IIHS Research Scientist Aimee Cox, the lead author of the study. “The new designs make the feature a little harder to turn off and a lot less annoying for the driver.”Design matters: How user interface affects safetyAnother key finding of the IIHS study is how the ease of turning these systems on and off impacts their usage. Features that require navigating through an in-vehicle settings menu to deactivate have a higher usage rate, while those that can be switched off with a simple button press tend to be disabled more frequently.Researchers found that systems designed to be turned off through settings menus were 15% more likely to be on than systems that could be deactivated with a button. The researchers suggest that making the process for turning the system off “a bit more complex” appears to increase the share of drivers who leave it enabled.Speed alerts: A new frontier in safety techThe study doesn’t just highlight lane maintenance systems; it also reveals promising trends in intelligent speed assistance (ISA) technology. More than 70% of drivers kept visual speed alerts activated, while audible alerts for speeding were only turned on in 14% of the vehicles, suggesting that while drivers are open to visual warnings, they may still resist more intrusive auditory signals.This raises questions about how to effectively design ISA systems that can engage drivers without being overwhelming.The researchers suggest a couple of different potential approaches that appear to increase activation, including having the systems turned on when delivering vehicles to customers and setting the alert threshold five to 10 MPH above the posted speed limit by default. Over three-quarters of drivers said they would accept an audible alert when driving 10 mph over the speed limit compared to just 30% of drivers at one to two MPH over the limit.Hyundai and Kia drivers disable their lane departure systems more oftenAs automakers continue to improve the lane departure warning and prevention systems, one of the biggest roadblocks is simply getting drivers to keep the systems enabled.Across the car brands included in the study, significantly more Kia and Hyundai drivers disabled their lane departure safety features than drivers of other brands, 56% and 63% respectively. By contrast, between 75% and 99% of Ford, Honda, Mazda and Volvo drivers kept their same systems activated.The activation gap likely comes down to the way that the cars alert drivers. While most manufacturers provide alerts through haptic steering-wheel vibrations, Kia and Hyundai primarily alert drivers through audible warnings — a method researchers found to be generally annoying and distracting to drivers.Limitations of the current researchAs promising as the newest IIHS study is, researchers warn that their findings are only generalizable to a small portion of the U.S. population.To conduct the study, researchers observed nearly 2,400 vehicles brought to dealership service centers in the greater Washington, D.C., area. The brands included in the study were limited to those who agreed to let the researchers into a service center for observation.“Dealership service centers were largely located in densely populated urban areas,” the researchers wrote. “Although some participating dealerships have more of a rural reach than others, this study may not be well representative of drivers in more rural areas.”Drivers in more densely packed urban areas likely feel a greater need for safety features like lane departure and speed warning systems, suggesting that researchers would potentially see lower activation rates in more rural parts of the country.Along with the geographic concentration of the study, researchers also point out that residents of the greater D.C. area have higher income levels and educational attainment than the national average — another factor that may skew the share of drivers who enable safety systems.Final thoughtsUltimately, the objective remains clear: making our roads safer for everyone. By addressing driver concerns and enhancing the usability of these systems, manufacturers are working toward a future where advanced safety features are not annoying distractions but integral parts of the driving experience.While we may not be racing toward a future where driving safety systems are universally adored, the increasing usage rates are a positive sign. They suggest that as drivers become more familiar with the benefits these technologies offer and as manufacturers refine their designs to prioritize user comfort, the acceptance of lane departure systems and other crash avoidance technologies will only continue to grow.",
  "image": "https://www.autoblog.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjA5NzQ4NTUxNzYzMjQwNDAx/labor-day-holiday-weekend-to-cap-off-record-summer-of-air-travel.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAutomotive crashes are one of the leading causes of death in the United States today, with 100 people killed every day in collisions, according to the \u003ca href=\"https://www.cdc.gov/transportation-safety/about/index.html\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003eU.S. Centers for Disease Control\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eYet, a suite of new safety systems designed to make driving safer received a cold reception from many drivers as manufacturers began introducing the tech over the last decade. Now, a new study by the Insurance Institute for Highway Safety (IIHS) found that U.S. drivers are finally warming up to the potentially life-saving features.\u003c/p\u003e\u003ch2 id=\"more-drivers-are-leaving-their-lane-departure-systems-enabled\"\u003eMore drivers are leaving their lane departure systems enabled\u003c/h2\u003e\u003cp\u003eNearly nine out of 10 drivers of vehicles equipped with lane departure warning and prevention systems now keep them switched on, according to the new study from the IIHS — a 71% increase compared to a similar study conducted by the organization in 2016.\u003c/p\u003e\u003cp\u003eWhile this uptick suggests that manufacturers have made strides in improving the functionality and user-friendliness of these systems, the fact remains that a notable portion of drivers still turn them off.\u003c/p\u003e\u003cp\u003eSo, what’s driving this ambivalence? The IIHS study indicates that many drivers find the audible alerts associated with lane departure warnings to be more irritating than helpful. Instead, systems that offer haptic feedback, such as vibrations in the steering wheel or seat, are proving to be more effective at encouraging use.\u003c/p\u003e\u003cp\u003e“The results reflect a combination of better designs and a growing acceptance of crash avoidance systems, more generally,” said IIHS Research Scientist Aimee Cox, the lead author of the study. “The new designs make the feature a little harder to turn off and a lot less annoying for the driver.”\u003c/p\u003e\u003cphoenix-super-link href=\"https://www.autoblog.com/news/when-can-consumers-expect-car-loan-interest-rates-to-drop\" onclick=\"return window.phoenixTrackClickEvent(this, event);\" phx-track-id=\"Embed Card Click\"\u003e\u003c/phoenix-super-link\u003e\u003ch2 id=\"design-matters-how-user-interface-affects-safety\"\u003eDesign matters: How user interface affects safety\u003c/h2\u003e\u003cp\u003eAnother key finding of the IIHS study is how the ease of turning these systems on and off impacts their usage. Features that require navigating through an in-vehicle settings menu to deactivate have a higher usage rate, while those that can be switched off with a simple button press tend to be disabled more frequently.\u003c/p\u003e\u003cp\u003eResearchers found that systems designed to be turned off through settings menus were 15% more likely to be on than systems that could be deactivated with a button. The researchers suggest that making the process for turning the system off “a bit more complex” appears to increase the share of drivers who leave it enabled.\u003c/p\u003e\u003ch2 id=\"speed-alerts-a-new-frontier-in-safety-tech\"\u003eSpeed alerts: A new frontier in safety tech\u003c/h2\u003e\u003cp\u003eThe study doesn’t just highlight lane maintenance systems; it also reveals promising trends in intelligent speed assistance (ISA) technology. \u003c/p\u003e\u003cp\u003eMore than 70% of drivers kept visual speed alerts activated, while audible alerts for speeding were only turned on in 14% of the vehicles, suggesting that while drivers are open to visual warnings, they may still resist more intrusive auditory signals.\u003c/p\u003e\u003cp\u003eThis raises questions about how to effectively design ISA systems that can engage drivers without being overwhelming.\u003c/p\u003e\u003cp\u003eThe researchers suggest a couple of different potential approaches that appear to increase activation, including having the systems turned on when delivering vehicles to customers and setting the alert threshold five to 10 MPH above the posted speed limit by default. Over three-quarters of drivers said they would accept an audible alert when driving 10 mph over the speed limit compared to just 30% of drivers at one to two MPH over the limit.\u003c/p\u003e\u003cphoenix-super-link href=\"https://www.autoblog.com/news/over-190000-hybrid-jeeps-recalled-due-to-dangerous-battery-fire-risk-are-you-at-risk\" onclick=\"return window.phoenixTrackClickEvent(this, event);\" phx-track-id=\"Embed Card Click\"\u003e\u003c/phoenix-super-link\u003e\u003ch2 id=\"hyundai-and-kia-drivers-disable-their-lane-departure-systems-more-often\"\u003eHyundai and Kia drivers disable their lane departure systems more often\u003c/h2\u003e\u003cp\u003eAs automakers continue to improve the lane departure warning and prevention systems, one of the biggest roadblocks is simply getting drivers to keep the systems enabled.\u003c/p\u003e\u003cp\u003eAcross the car brands included in the study, significantly more \u003ca href=\"https://www.autoblog.com/kia/\"\u003eKia\u003c/a\u003e and \u003ca href=\"https://www.autoblog.com/hyundai/\"\u003eHyundai\u003c/a\u003e drivers disabled their lane departure safety features than drivers of other brands, 56% and 63% respectively. By contrast, between 75% and 99% of \u003ca href=\"https://www.autoblog.com/ford/\"\u003eFord\u003c/a\u003e, \u003ca href=\"https://www.autoblog.com/honda/\"\u003eHonda\u003c/a\u003e, \u003ca href=\"https://www.autoblog.com/mazda/\"\u003eMazda\u003c/a\u003e and \u003ca href=\"https://www.autoblog.com/volvo/\"\u003eVolvo\u003c/a\u003e drivers kept their same systems activated.\u003c/p\u003e\u003cp\u003eThe activation gap likely comes down to the way that the cars alert drivers. While most manufacturers provide alerts through haptic steering-wheel vibrations, Kia and Hyundai primarily alert drivers through audible warnings — a method researchers found to be generally annoying and distracting to drivers.\u003c/p\u003e\u003ch2 id=\"limitations-of-the-current-research\"\u003eLimitations of the current research\u003c/h2\u003e\u003cp\u003eAs promising as the newest IIHS study is, researchers warn that their findings are only generalizable to a small portion of the U.S. population.\u003c/p\u003e\u003cp\u003eTo conduct the study, researchers observed nearly 2,400 vehicles brought to dealership service centers in the greater Washington, D.C., area. The brands included in the study were limited to those who agreed to let the researchers into a service center for observation.\u003c/p\u003e\u003cp\u003e“Dealership service centers were largely located in densely populated urban areas,” the researchers wrote. “Although some participating dealerships have more of a rural reach than others, this study may not be well representative of drivers in more rural areas.”\u003c/p\u003e\u003cp\u003eDrivers in more densely packed urban areas likely feel a greater need for safety features like lane departure and speed warning systems, suggesting that researchers would potentially see lower activation rates in more rural parts of the country.\u003c/p\u003e\u003cp\u003eAlong with the geographic concentration of the study, researchers also point out that residents of the greater D.C. area have higher income levels and educational attainment than the national average — another factor that may skew the share of drivers who enable safety systems.\u003c/p\u003e\u003ch2 id=\"final-thoughts\"\u003eFinal thoughts\u003c/h2\u003e\u003cp\u003eUltimately, the objective remains clear: making our roads safer for everyone. By addressing driver concerns and enhancing the usability of these systems, manufacturers are working toward a future where advanced safety features are not annoying distractions but integral parts of the driving experience.\u003c/p\u003e\u003cp\u003eWhile we may not be racing toward a future where driving safety systems are universally adored, the increasing usage rates are a positive sign. They suggest that as drivers become more familiar with the benefits these technologies offer and as manufacturers refine their designs to prioritize user comfort, the acceptance of lane departure systems and other crash avoidance technologies will only continue to grow.\u003c/p\u003e\u003cphoenix-super-link href=\"https://www.autoblog.com/news/rolls-royces-spectre-lunaflair-has-a-paint-job-youll-never-see-again-heres-why\" onclick=\"return window.phoenixTrackClickEvent(this, event);\" phx-track-id=\"Embed Card Click\"\u003e\u003c/phoenix-super-link\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-04T19:00:00Z",
  "modifiedTime": null
}
