{
  "id": "a52032cd-a06c-490f-825b-0e5afb1193c4",
  "title": "Balu, Chheda win at MRF Indian National Car Racing Championship Round 1",
  "link": "https://www.autocarindia.com/motor-sports-news/balu-chheda-win-at-mrf-indian-national-car-racing-championship-round-1-436300#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The 2025 MRF MMSC Indian National Car Racing Championship kicked off at Coimbatore’s Kari Motor Speedway on July 18-20. Multiple-time national champion Arjun Balu returns to the championship after a year away and is already back to his winning ways. Arjun Chheda, Bhuvan Bonu and Aman Nagdev were some of the other star racers who picked up wins at the opening round. MRF F2000 Sixteen-year-old Arjun Chheda made the best of a poor start by polesitter Ishaan Madesh to win the opening race with a sizeable lead. Madesh stalled his car at the start but recovered to finish second.  Both drivers led the way on Sunday as well, with Madesh winning Race 2 and Chheda winning Race 3. Having won two out of three races, Chheda moves to the top of the standings.   MRF F2000 Race 1 results 1. Arjun Chheda - 13mins 28.502sec 2. Ishaan Madesh – 13mins 37.603sec 3. Shivesh Selvarathnam – 13mins 41.796sec MRF F2000 Race 2 results 1. Ishaan Madesh - 15mins 41.539sec 2. Arjun Chheda – 15mins 43.950sec 3. Akhil Agarwal – 15mins 52.431sec MRF F2000 Race 3 results 1. Arjun Chheda – 13mins 24.051sec 2. Ishaan Madesh – 13mins 26.776sec 3. Akhil Agarwal – 13mins 39.242sec MRF F1600 The MRF Formula 1600 class saw plenty of wheel-to-wheel racing and three different race winners. Sai Shiva Sankaran recovered from a poor start to win Race 1, his first-ever victory in this class. Two Bengalureans, Nigel Abraham Thomas and Arjun Nair, won a race each on Sunday.  Both Sankaran and Thomas also finished on the podium in all three races.  MRF F1600 Race 1 results 1. Sai Shiva Makesh Sankaran – 14mins 24.471sec 2. Arjun S Nair – 14mins 24.902sec 3. Nigel Abraham Thomas – 14mins 40.437sec MRF F1600 Race 2 results 1. Nigel Abraham Thomas – 16mins 52.562sec 2. Sai Shiva Makesh Sankaran – 16mins 55.351sec 3. Zahan Commissariat – 17mins 07.254sec MRF F1600 Race 3 results 1. Arjun Nair – 14mins 21.433sec 2. Sai Shiva Makesh Sankaran – 14mins 21.938sec 3. Nigel Abraham Thomas – 14mins 22.159sec Indian Touring Cars Veteran racer and multiple-time national champion Ajun Balu returned to the Indian Touring Cars (ITC) class after a year’s break. Driving a Race Concepts-prepared Honda City i-VTEC, Balu kicked off his 2025 campaign on a strong note and won two out of three races.  Misfortune struck Balu when his City started misfiring while he was leading Race 3, forcing him to slow down. Despite nursing a turbo issue on his Volkswagen Polo, Biren Pithawalla made the most of the situation and zipped past Balu to win Race 3.  Multiple-time national champion Arjun Balu won two out of three ITC races. Indian Touring Cars Race 1 results 1. Arjun Balu (Race Concepts) – 15mins 24.662sec 2. Dhruv Chavan (Privateer) – 16mins 04.961sec 3. Rajkumar GD (Privateer) – 16mins 09.765sec Indian Touring Cars Race 2 results 1. Arjun Balu (Race Concepts) – 17mins 36.755sec 2. Biren Pithawalla (Team N1) – 17mins 54.495sec 3. Dhruv Chavan (Buzzing Hornet) – 18mins 00.579sec Indian Touring Cars Race 3 results 1. Biren Pithawalla (N1 Racing) – 15mins 03.891sec 2. Arjun Balu (Race Concepts) – 15mins 15.873sec 3. Dhruv Chavan (Buzzing Hornet) – 15mins 32.586sec Indian Touring Cars 1625 This year’s championship sees the addition of a new ITC category for cars up to 1,625cc. Only two racers competed in this new category - the championship’s oldest driver, Vidyaprakash Damodaran (who turns 80 this August), and local ace Suprej Venkat. Remarkably, after retiring from Race 1, Damodaran bounced back the next day and defeated Venkat in Race 3. “The highlight was the race I didn’t win,” Venkat shared on his social media.  “[I] came second to none other than D. Vidyaprakash uncle – my tuner, mentor and racing guru. He’s 80, still races like a beast, and gave me one of the cleanest, hardest fights I’ve had on track. It was an honour to chase him to the finish line, and honestly, that second place meant more to me than both wins.” 79-year-old Vidyaprakash Damodaran (right) won Race 3. Indian Touring Cars 1625 Race 1 results 1. Suprej Venkat – 15mins 38.730sec Indian Touring Cars 1625 Race 2 results 1. Suprej Venkat – 18mins 44.318sec 2. Vidyaprakash Damodaran – 18mins 45.078sec Indian Touring Cars 1625 Race 3 results 1. Vidyaprakash Damodaran – 16mins 03.234sec 2. Suprej Venkat – 16mins 06.154sec Indian Junior Touring Cars Rithvik Thomas dominated in the Indian Junior Touring Cars category, winning all three races over the weekend. Race 2 stood out in particular, with Thomas starting from the very back of the field under reverse grid conditions.   Indian Junior Touring Cars Race 1 results 1. Rithvik Thomas (Race Concepts) – 16mins 29.216sec 2. Nikunj Vagh (Team N1) – 16mins 32.728sec 3. Yug Italiya (Team N1) – 16mins 38.848sec Indian Junior Touring Cars Race 2 results 1. Rithvik Thomas (Race Concepts) – 18mins 48.451sec 2. Nikunj Vagh (Team N1) – 17mins 41.724sec +1 lap 3. Yug Italiya (Team N1) – 17mins 41.755sec + 1 lap Indian Junior Touring Cars Race 3 results 1. Rithvik Thomas (Race Concepts) – 16mins 10.084sec 2. Yug Italiya (Team N1) – 16mins 20.009sec 3. Nikhunj Wagh (Team N1) – 16mins 20.678sec Super Stock Sri Lankan driver Kesara Godage won two out of three races in the Super Stock class. Krishanu Dutta Bhuyan denied him a clean sweep, taking victory in Race 2. Super Stock Race 1 results 1. Kesara Godage (Redline Racing India) – 16mins 03.927sec 2. Aman (Strada Motorsports) – 16mins 12.272sec 3. Manan Patel (Privateer) – 16mins 15.632sec Super Stock Race 2 results 1. Krishanu Dutta Bhuyan (Zion Racing) – 18mins 36.365sec 2. Kesara Godage (Redline Racing) – 18mins 38.743sec 3. Manan Patel (Gameover Motorsports) – 18mins 39.184sec Super Stock Race 3 results 1. Kesara Godage (Redline Racing India) – 15mins 41.190sec 2. Krishanu Dutta Bhuyan (Zion Racing) – 15mins 44.604sec 3. Anirudha Arvind (Strada Motorsports) – 15mins 46.728sec Formula LGB 1300 DTS Racing scored a 1-2-3 finish in Race 1, with Joel Joseph taking victory ahead of his teammates Lokithlingeash Ravi and Pathik Ashok. The three of them classified in the same positions in the Junior class as well. Fifteen-year-old Bhuvan Bonu emerged as the star driver on Sunday, winning Race 2 in both the Open and Junior classes. He was leading Race 3 as well before the rains forced its cancellation. Formula LGB 1300 Race 1 results 1. Joel Joseph (DTS Racing) – 15mins 16.951sec 2. Lokithlingeash Ravi (DTS Racing) – 15mins 17.112sec 3. Pathik Ashok (DTS Racing) – 15mins 17.155sec Formula LGB 1300 Race 2 results 1. Bhuvan Bonu (MSPORT) – 21mins 02.762sec 2. Bala Prasath (DTS Racing) – 21mins 08.968sec 3. Neythan McPherson (Momentum Motorsports) – 21mins 10.171sec Volkswagen Polo Cup Over in the Volkswagen Polo Cup, Aman Nagdev leads the standings after winning two out of three races. His Buzzing Hornet teammate Aditya Patnaik took victory in Race 2.  Volkswagen Polo Cup Race 1 results 1. Aman Nagdev (Buzzing Hornet) – 15mins 34.403sec 2. Pratik Sonawane (Buzzing Hornet) – 15mins 36.772sec 3. Aditya Patnaik (Buzzing Hornet) – 15mins 37.439sec Volkswagen Polo Cup Race 2 results 1. Aditya Patnaik (Buzzing Hornet) – 18mins 15.689sec 2. Pratik Sonawane (Buzzing Hornet) – 18mins 18.037sec 3. Ojas Surve (Buzzing Hornet) – 18mins 18.904sec Volkswagen Polo Cup Race 3 results 1. Aman Nagdev (Buzzing Hornet) – 15mins 31.208sec 2. Aditya Patnaik (Buzzing Hornet) – 15mins 39.615sec 3. Pratik Sonawane (Buzzing Hornet) – 15mins 43.667sec Also see: Jaden Pariat wins MRF Formula 2000 title 2025 INMRC: Chavan, Pillarisetty win at Round 1",
  "author": "Unnatee Gidithuri",
  "published": "Tue, 22 Jul 2025 17:41:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Unnatee  Gidithuri",
  "length": 7505,
  "excerpt": "79-year-old Vidyaprakash Damodaran scored a surprise win in the new ITC 1625 category as well.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "79-year-old Vidyaprakash Damodaran scored a surprise win in the new ITC 1625 category as well.The 2025 MRF MMSC Indian National Car Racing Championship kicked off at Coimbatore’s Kari Motor Speedway on July 18-20. Multiple-time national champion Arjun Balu returns to the championship after a year away and is already back to his winning ways. Arjun Chheda, Bhuvan Bonu and Aman Nagdev were some of the other star racers who picked up wins at the opening round.MRF F2000Sixteen-year-old Arjun Chheda made the best of a poor start by polesitter Ishaan Madesh to win the opening race with a sizeable lead. Madesh stalled his car at the start but recovered to finish second. Both drivers led the way on Sunday as well, with Madesh winning Race 2 and Chheda winning Race 3. Having won two out of three races, Chheda moves to the top of the standings.  MRF F2000 Race 1 results1. Arjun Chheda - 13mins 28.502sec2. Ishaan Madesh – 13mins 37.603sec3. Shivesh Selvarathnam – 13mins 41.796secMRF F2000 Race 2 results1. Ishaan Madesh - 15mins 41.539sec2. Arjun Chheda – 15mins 43.950sec3. Akhil Agarwal – 15mins 52.431secMRF F2000 Race 3 results1. Arjun Chheda – 13mins 24.051sec2. Ishaan Madesh – 13mins 26.776sec3. Akhil Agarwal – 13mins 39.242secMRF F1600The MRF Formula 1600 class saw plenty of wheel-to-wheel racing and three different race winners. Sai Shiva Sankaran recovered from a poor start to win Race 1, his first-ever victory in this class. Two Bengalureans, Nigel Abraham Thomas and Arjun Nair, won a race each on Sunday. Both Sankaran and Thomas also finished on the podium in all three races. MRF F1600 Race 1 results1. Sai Shiva Makesh Sankaran – 14mins 24.471sec2. Arjun S Nair – 14mins 24.902sec3. Nigel Abraham Thomas – 14mins 40.437secMRF F1600 Race 2 results1. Nigel Abraham Thomas – 16mins 52.562sec2. Sai Shiva Makesh Sankaran – 16mins 55.351sec3. Zahan Commissariat – 17mins 07.254secMRF F1600 Race 3 results1. Arjun Nair – 14mins 21.433sec2. Sai Shiva Makesh Sankaran – 14mins 21.938sec3. Nigel Abraham Thomas – 14mins 22.159secIndian Touring CarsVeteran racer and multiple-time national champion Ajun Balu returned to the Indian Touring Cars (ITC) class after a year’s break. Driving a Race Concepts-prepared Honda City i-VTEC, Balu kicked off his 2025 campaign on a strong note and won two out of three races. Misfortune struck Balu when his City started misfiring while he was leading Race 3, forcing him to slow down. Despite nursing a turbo issue on his Volkswagen Polo, Biren Pithawalla made the most of the situation and zipped past Balu to win Race 3. Multiple-time national champion Arjun Balu won two out of three ITC races.Indian Touring Cars Race 1 results1. Arjun Balu (Race Concepts) – 15mins 24.662sec2. Dhruv Chavan (Privateer) – 16mins 04.961sec3. Rajkumar GD (Privateer) – 16mins 09.765secIndian Touring Cars Race 2 results1. Arjun Balu (Race Concepts) – 17mins 36.755sec2. Biren Pithawalla (Team N1) – 17mins 54.495sec3. Dhruv Chavan (Buzzing Hornet) – 18mins 00.579secIndian Touring Cars Race 3 results1. Biren Pithawalla (N1 Racing) – 15mins 03.891sec2. Arjun Balu (Race Concepts) – 15mins 15.873sec3. Dhruv Chavan (Buzzing Hornet) – 15mins 32.586secIndian Touring Cars 1625This year’s championship sees the addition of a new ITC category for cars up to 1,625cc. Only two racers competed in this new category - the championship’s oldest driver, Vidyaprakash Damodaran (who turns 80 this August), and local ace Suprej Venkat.Remarkably, after retiring from Race 1, Damodaran bounced back the next day and defeated Venkat in Race 3. “The highlight was the race I didn’t win,” Venkat shared on his social media. “[I] came second to none other than D. Vidyaprakash uncle – my tuner, mentor and racing guru. He’s 80, still races like a beast, and gave me one of the cleanest, hardest fights I’ve had on track. It was an honour to chase him to the finish line, and honestly, that second place meant more to me than both wins.”79-year-old Vidyaprakash Damodaran (right) won Race 3.Indian Touring Cars 1625 Race 1 results1. Suprej Venkat – 15mins 38.730secIndian Touring Cars 1625 Race 2 results1. Suprej Venkat – 18mins 44.318sec 2. Vidyaprakash Damodaran – 18mins 45.078secIndian Touring Cars 1625 Race 3 results1. Vidyaprakash Damodaran – 16mins 03.234sec 2. Suprej Venkat – 16mins 06.154secIndian Junior Touring CarsRithvik Thomas dominated in the Indian Junior Touring Cars category, winning all three races over the weekend. Race 2 stood out in particular, with Thomas starting from the very back of the field under reverse grid conditions.  Indian Junior Touring Cars Race 1 results1. Rithvik Thomas (Race Concepts) – 16mins 29.216sec2. Nikunj Vagh (Team N1) – 16mins 32.728sec3. Yug Italiya (Team N1) – 16mins 38.848secIndian Junior Touring Cars Race 2 results1. Rithvik Thomas (Race Concepts) – 18mins 48.451sec2. Nikunj Vagh (Team N1) – 17mins 41.724sec +1 lap3. Yug Italiya (Team N1) – 17mins 41.755sec + 1 lapIndian Junior Touring Cars Race 3 results1. Rithvik Thomas (Race Concepts) – 16mins 10.084sec2. Yug Italiya (Team N1) – 16mins 20.009sec3. Nikhunj Wagh (Team N1) – 16mins 20.678secSuper StockSri Lankan driver Kesara Godage won two out of three races in the Super Stock class. Krishanu Dutta Bhuyan denied him a clean sweep, taking victory in Race 2.Super Stock Race 1 results1. Kesara Godage (Redline Racing India) – 16mins 03.927sec2. Aman (Strada Motorsports) – 16mins 12.272sec3. Manan Patel (Privateer) – 16mins 15.632secSuper Stock Race 2 results1. Krishanu Dutta Bhuyan (Zion Racing) – 18mins 36.365sec2. Kesara Godage (Redline Racing) – 18mins 38.743sec3. Manan Patel (Gameover Motorsports) – 18mins 39.184secSuper Stock Race 3 results1. Kesara Godage (Redline Racing India) – 15mins 41.190sec2. Krishanu Dutta Bhuyan (Zion Racing) – 15mins 44.604sec3. Anirudha Arvind (Strada Motorsports) – 15mins 46.728secFormula LGB 1300DTS Racing scored a 1-2-3 finish in Race 1, with Joel Joseph taking victory ahead of his teammates Lokithlingeash Ravi and Pathik Ashok. The three of them classified in the same positions in the Junior class as well.Fifteen-year-old Bhuvan Bonu emerged as the star driver on Sunday, winning Race 2 in both the Open and Junior classes. He was leading Race 3 as well before the rains forced its cancellation.Formula LGB 1300 Race 1 results1. Joel Joseph (DTS Racing) – 15mins 16.951sec2. Lokithlingeash Ravi (DTS Racing) – 15mins 17.112sec3. Pathik Ashok (DTS Racing) – 15mins 17.155secFormula LGB 1300 Race 2 results1. Bhuvan Bonu (MSPORT) – 21mins 02.762sec2. Bala Prasath (DTS Racing) – 21mins 08.968sec3. Neythan McPherson (Momentum Motorsports) – 21mins 10.171secVolkswagen Polo CupOver in the Volkswagen Polo Cup, Aman Nagdev leads the standings after winning two out of three races. His Buzzing Hornet teammate Aditya Patnaik took victory in Race 2. Volkswagen Polo Cup Race 1 results1. Aman Nagdev (Buzzing Hornet) – 15mins 34.403sec2. Pratik Sonawane (Buzzing Hornet) – 15mins 36.772sec3. Aditya Patnaik (Buzzing Hornet) – 15mins 37.439secVolkswagen Polo Cup Race 2 results1. Aditya Patnaik (Buzzing Hornet) – 18mins 15.689sec2. Pratik Sonawane (Buzzing Hornet) – 18mins 18.037sec3. Ojas Surve (Buzzing Hornet) – 18mins 18.904secVolkswagen Polo Cup Race 3 results1. Aman Nagdev (Buzzing Hornet) – 15mins 31.208sec2. Aditya Patnaik (Buzzing Hornet) – 15mins 39.615sec3. Pratik Sonawane (Buzzing Hornet) – 15mins 43.667secAlso see:Jaden Pariat wins MRF Formula 2000 title2025 INMRC: Chavan, Pillarisetty win at Round 1",
  "image": "https://img.autocarindia.com/ExtraImages/20250722054110_Arjun_Balu_MRF_National_Championship.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003e79-year-old Vidyaprakash Damodaran scored a surprise win in the new ITC 1625 category as well.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe 2025 MRF MMSC Indian National Car Racing Championship kicked off at Coimbatore’s Kari Motor Speedway on July 18-20. Multiple-time national champion Arjun Balu returns to the championship after a year away and is already back to his winning ways. Arjun Chheda, Bhuvan Bonu and Aman Nagdev were some of the other star racers who picked up wins at the opening round.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMRF F2000\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eSixteen-year-old Arjun Chheda made the best of a poor start by polesitter Ishaan Madesh to win the opening race with a sizeable lead. Madesh stalled his car at the start but recovered to finish second. \u003c/p\u003e\u003cp\u003eBoth drivers led the way on Sunday as well, with Madesh winning Race 2 and Chheda winning Race 3. Having won two out of three races, Chheda moves to the top of the standings.  \u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"MRF Formula 2000\" src=\"https://img.autocarindia.com/News/mrf-formula-2000.jpg?w=700\u0026amp;c=0\" title=\"MRF Formula 2000\"/\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMRF F2000 Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Arjun Chheda - 13mins 28.502sec\u003c/p\u003e\u003cp\u003e2. Ishaan Madesh – 13mins 37.603sec\u003c/p\u003e\u003cp\u003e3. Shivesh Selvarathnam – 13mins 41.796sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMRF F2000 Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Ishaan Madesh - 15mins 41.539sec\u003c/p\u003e\u003cp\u003e2. Arjun Chheda – 15mins 43.950sec\u003c/p\u003e\u003cp\u003e3. Akhil Agarwal – 15mins 52.431sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMRF F2000 Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Arjun Chheda – 13mins 24.051sec\u003c/p\u003e\u003cp\u003e2. Ishaan Madesh – 13mins 26.776sec\u003c/p\u003e\u003cp\u003e3. Akhil Agarwal – 13mins 39.242sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMRF F1600\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe MRF Formula 1600 class saw plenty of wheel-to-wheel racing and three different race winners. Sai Shiva Sankaran recovered from a poor start to win Race 1, his first-ever victory in this class. Two Bengalureans, Nigel Abraham Thomas and Arjun Nair, won a race each on Sunday. \u003c/p\u003e\u003cp\u003eBoth Sankaran and Thomas also finished on the podium in all three races. \u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"MRF Formula 1600\" src=\"https://img.autocarindia.com/News/mrf-f1600.jpg?w=700\u0026amp;c=0\" title=\"MRF Formula 1600\"/\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMRF F1600 Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Sai Shiva Makesh Sankaran – 14mins 24.471sec\u003c/p\u003e\u003cp\u003e2. Arjun S Nair – 14mins 24.902sec\u003c/p\u003e\u003cp\u003e3. Nigel Abraham Thomas – 14mins 40.437sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMRF F1600 Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Nigel Abraham Thomas – 16mins 52.562sec\u003c/p\u003e\u003cp\u003e2. Sai Shiva Makesh Sankaran – 16mins 55.351sec\u003c/p\u003e\u003cp\u003e3. Zahan Commissariat – 17mins 07.254sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eMRF F1600 Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Arjun Nair – 14mins 21.433sec\u003c/p\u003e\u003cp\u003e2. Sai Shiva Makesh Sankaran – 14mins 21.938sec\u003c/p\u003e\u003cp\u003e3. Nigel Abraham Thomas – 14mins 22.159sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eIndian Touring Cars\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eVeteran racer and multiple-time national champion Ajun Balu returned to the Indian Touring Cars (ITC) class after a year’s break. Driving a Race Concepts-prepared \u003ca href=\"https://www.autocarindia.com/cars/honda\"\u003e\u003cstrong\u003eHonda\u003c/strong\u003e\u003c/a\u003e City i-VTEC, Balu kicked off his 2025 campaign on a strong note and won two out of three races. \u003c/p\u003e\u003cp\u003eMisfortune struck Balu when his City started misfiring while he was leading Race 3, forcing him to slow down. Despite nursing a turbo issue on his \u003ca href=\"https://www.autocarindia.com/cars/volkswagen\"\u003e\u003cstrong\u003eVolkswagen\u003c/strong\u003e\u003c/a\u003e Polo, Biren Pithawalla made the most of the situation and zipped past Balu to win Race 3. \u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Arjun Balu ITC\" src=\"https://img.autocarindia.com/News/arjun-balu-itc.jpg?w=700\u0026amp;c=0\" title=\"Arjun Balu ITC\"/\u003e\u003cem\u003eMultiple-time national champion Arjun Balu won two out of three ITC races.\u003c/em\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Touring Cars Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Arjun Balu (Race Concepts) – 15mins 24.662sec\u003c/p\u003e\u003cp\u003e2. Dhruv Chavan (Privateer) – 16mins 04.961sec\u003c/p\u003e\u003cp\u003e3. Rajkumar GD (Privateer) – 16mins 09.765sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Touring Cars Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Arjun Balu (Race Concepts) – 17mins 36.755sec\u003c/p\u003e\u003cp\u003e2. Biren Pithawalla (Team N1) – 17mins 54.495sec\u003c/p\u003e\u003cp\u003e3. Dhruv Chavan (Buzzing Hornet) – 18mins 00.579sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Touring Cars Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Biren Pithawalla (N1 Racing) – 15mins 03.891sec\u003c/p\u003e\u003cp\u003e2. Arjun Balu (Race Concepts) – 15mins 15.873sec\u003c/p\u003e\u003cp\u003e3. Dhruv Chavan (Buzzing Hornet) – 15mins 32.586sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eIndian Touring Cars 1625\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThis year’s championship sees the addition of a new ITC category for cars up to 1,625cc. Only two racers competed in this new category - the championship’s oldest driver, Vidyaprakash Damodaran (who turns 80 this August), and local ace Suprej Venkat.\u003c/p\u003e\u003cp\u003eRemarkably, after retiring from Race 1, Damodaran bounced back the next day and defeated Venkat in Race 3. “The highlight was the race I didn’t win,” Venkat shared on his social media. \u003c/p\u003e\u003cp\u003e“[I] came second to none other than D. Vidyaprakash uncle – my tuner, mentor and racing guru. He’s 80, still races like a beast, and gave me one of the cleanest, hardest fights I’ve had on track. It was an honour to chase him to the finish line, and honestly, that second place meant more to me than both wins.”\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Vidyaprakash Damodaran\" src=\"https://img.autocarindia.com/News/Vidyaprakash Damodaran.jpg?w=700\u0026amp;c=0\" title=\"Vidyaprakash Damodaran\"/\u003e\u003cem\u003e79-year-old Vidyaprakash Damodaran (right) won Race 3.\u003c/em\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Touring Cars 1625 Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Suprej Venkat – 15mins 38.730sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Touring Cars 1625 Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Suprej Venkat – 18mins 44.318sec\u003cbr/\u003e 2. Vidyaprakash Damodaran – 18mins 45.078sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Touring Cars 1625 Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Vidyaprakash Damodaran – 16mins 03.234sec\u003cbr/\u003e 2. Suprej Venkat – 16mins 06.154sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eIndian Junior Touring Cars\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eRithvik Thomas dominated in the Indian Junior Touring Cars category, winning all three races over the weekend. Race 2 stood out in particular, with Thomas starting from the very back of the field under reverse grid conditions.  \u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Junior Touring Cars Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Rithvik Thomas (Race Concepts) – 16mins 29.216sec\u003c/p\u003e\u003cp\u003e2. Nikunj Vagh (Team N1) – 16mins 32.728sec\u003c/p\u003e\u003cp\u003e3. Yug Italiya (Team N1) – 16mins 38.848sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Junior Touring Cars Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Rithvik Thomas (Race Concepts) – 18mins 48.451sec\u003c/p\u003e\u003cp\u003e2. Nikunj Vagh (Team N1) – 17mins 41.724sec +1 lap\u003c/p\u003e\u003cp\u003e3. Yug Italiya (Team N1) – 17mins 41.755sec + 1 lap\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIndian Junior Touring Cars Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Rithvik Thomas (Race Concepts) – 16mins 10.084sec\u003c/p\u003e\u003cp\u003e2. Yug Italiya (Team N1) – 16mins 20.009sec\u003c/p\u003e\u003cp\u003e3. Nikhunj Wagh (Team N1) – 16mins 20.678sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eSuper Stock\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eSri Lankan driver Kesara Godage won two out of three races in the Super Stock class. Krishanu Dutta Bhuyan denied him a clean sweep, taking victory in Race 2.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eSuper Stock Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Kesara Godage (Redline Racing India) – 16mins 03.927sec\u003c/p\u003e\u003cp\u003e2. Aman (Strada Motorsports) – 16mins 12.272sec\u003c/p\u003e\u003cp\u003e3. Manan Patel (Privateer) – 16mins 15.632sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eSuper Stock Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Krishanu Dutta Bhuyan (Zion Racing) – 18mins 36.365sec\u003c/p\u003e\u003cp\u003e2. Kesara Godage (Redline Racing) – 18mins 38.743sec\u003c/p\u003e\u003cp\u003e3. Manan Patel (Gameover Motorsports) – 18mins 39.184sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eSuper Stock Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Kesara Godage (Redline Racing India) – 15mins 41.190sec\u003c/p\u003e\u003cp\u003e2. Krishanu Dutta Bhuyan (Zion Racing) – 15mins 44.604sec\u003c/p\u003e\u003cp\u003e3. Anirudha Arvind (Strada Motorsports) – 15mins 46.728sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eFormula LGB 1300\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eDTS Racing scored a 1-2-3 finish in Race 1, with Joel Joseph taking victory ahead of his teammates Lokithlingeash Ravi and Pathik Ashok. The three of them classified in the same positions in the Junior class as well.\u003c/p\u003e\u003cp\u003eFifteen-year-old Bhuvan Bonu emerged as the star driver on Sunday, winning Race 2 in both the Open and Junior classes. He was leading Race 3 as well before the rains forced its cancellation.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"MRF Formula LGB 1300\" src=\"https://img.autocarindia.com/News/mrf-formula-lgb-1300.jpg?w=700\u0026amp;c=0\" title=\"MRF Formula LGB 1300\"/\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eFormula LGB 1300 Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Joel Joseph (DTS Racing) – 15mins 16.951sec\u003c/p\u003e\u003cp\u003e2. Lokithlingeash Ravi (DTS Racing) – 15mins 17.112sec\u003c/p\u003e\u003cp\u003e3. Pathik Ashok (DTS Racing) – 15mins 17.155sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eFormula LGB 1300 Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Bhuvan Bonu (MSPORT) – 21mins 02.762sec\u003c/p\u003e\u003cp\u003e2. Bala Prasath (DTS Racing) – 21mins 08.968sec\u003c/p\u003e\u003cp\u003e3. Neythan McPherson (Momentum Motorsports) – 21mins 10.171sec\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eVolkswagen Polo Cup\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eOver in the Volkswagen Polo Cup, Aman Nagdev leads the standings after winning two out of three races. His Buzzing Hornet teammate Aditya Patnaik took victory in Race 2. \u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eVolkswagen Polo Cup Race 1 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Aman Nagdev (Buzzing Hornet) – 15mins 34.403sec\u003c/p\u003e\u003cp\u003e2. Pratik Sonawane (Buzzing Hornet) – 15mins 36.772sec\u003c/p\u003e\u003cp\u003e3. Aditya Patnaik (Buzzing Hornet) – 15mins 37.439sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eVolkswagen Polo Cup Race 2 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Aditya Patnaik (Buzzing Hornet) – 18mins 15.689sec\u003c/p\u003e\u003cp\u003e2. Pratik Sonawane (Buzzing Hornet) – 18mins 18.037sec\u003c/p\u003e\u003cp\u003e3. Ojas Surve (Buzzing Hornet) – 18mins 18.904sec\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eVolkswagen Polo Cup Race 3 results\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e1. Aman Nagdev (Buzzing Hornet) – 15mins 31.208sec\u003c/p\u003e\u003cp\u003e2. Aditya Patnaik (Buzzing Hornet) – 15mins 39.615sec\u003c/p\u003e\u003cp\u003e3. Pratik Sonawane (Buzzing Hornet) – 15mins 43.667sec\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/motor-sports-news/jaden-pariat-wins-mrf-formula-2000-title-432594\"\u003eJaden Pariat wins MRF Formula 2000 title\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/motor-sports-news/inmrc-chavan-pillarisetty-win-at-round-1-435650\"\u003e2025 INMRC: Chavan, Pillarisetty win at Round 1\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-22T17:41:00+05:30",
  "modifiedTime": null
}
