{
  "id": "a65263f9-8044-4044-9272-67656c87349a",
  "title": "Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod",
  "link": "https://bringatrailer.com/listing/1947-ford-super-deluxe-convertible-street-rod/",
  "description": "This 1947 Ford Super Deluxe Convertible street rod was acquired by the seller's father in 2019, and a 350ci General Motors V8, supercharger, and four-speed automatic transmission were subsequently installed. A Hilborn-style air scoop is mounted over the dual Edelbrock carburetors, and the car also has an aluminum radiator, a custom dual exhaust system, 15\" alloy wheels, four-wheel disc brakes, a Lokar shifter, a tilt column, air conditioning, and coil-sprung front end with power steering. This Ford street rod is now offered by the seller on behalf of the owner's estate with a top boot and a New Jersey title.",
  "author": "bringatrailer",
  "published": "Thu, 10 Oct 2024 23:30:11 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 2888,
  "excerpt": "Bid for the chance to own a Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #167,151.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/apple-touch-icon-ipad-retina-152x152.png?v=http://7d7c29de59",
  "text": "This 1947 Ford Super Deluxe Convertible street rod was acquired by the seller’s father in 2019, and a 350ci General Motors V8, supercharger, and four-speed automatic transmission were subsequently installed. A Hilborn-style air scoop is mounted over the dual Edelbrock carburetors, and the car also has an aluminum radiator, a custom dual exhaust system, 15″ alloy wheels, four-wheel disc brakes, a Lokar shifter, a tilt column, air conditioning, and coil-sprung front end with power steering. This Ford street rod is now offered by the seller on behalf of the owner’s estate with a top boot and a New Jersey title. The has been repainted metallic red, and it has a tan soft top with burgundy piping. Lucas-style covers accent the headlights, and a mirror has been mounted on the left door. The hood has been removed and is not included in the sale, and various paint and body blemishes are shown in the gallery. The car rides on chrome five-spoke 15″ wheels with 205/70s up front and 225/75s out back. A coil-sprung front end with power steering has been installed along with four-wheel disc brakes, and the rear has been modified with parallel leaf springs and lowering blocks. The seller notes the steering has play. The front and rear benches are upholstered in tan vinyl with burgundy piping and buttons, and coordinating trim covers the side panels. Burgundy carpeting lines the floors, and a Lokar shifter has been installed along with air conditioning and a Sony CD stereo. The three-spoke steering wheel sits on a tilting column ahead of a Dolphin 140-mph speedometer with a boost-pressure gauge mounted below, while a Dolphin cluster with supplemental gauges is mounted to the right. The five-digit mechanical odometer shows 2,100 miles, with total chassis mileage unknown. The 350ci GM V8 is equipped with a supercharger topped by dual Edelbrock carburetors and a Hilborn-style air scoop. A belt guard and an aluminum radiator have also been installed along with AN fuel lines, and the finned valve covers are secured with extended wing nuts. The seller reports that the distributor and ignition coil have been replaced. Power is sent to the rear wheels through a four-speed automatic transmission. The car has a custom dual exhaust system, and corrosion is visible on underside components. The car is titled in New Jersey using SK6914PA, which matches the Pennsylvania plate number shown above. The title carries a Salvage brand. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_ff8de5cc-c21c-47b0-bb4e-e6a72866737d-lfOO6d-87739-87740-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 1947 Ford Super Deluxe Convertible street rod was acquired by the seller’s father in 2019, and a 350ci General Motors V8, supercharger, and four-speed automatic transmission were subsequently installed. A Hilborn-style air scoop is mounted over the dual Edelbrock carburetors, and the car also has an aluminum radiator, a custom dual exhaust system, 15″ alloy wheels, four-wheel disc brakes, a Lokar shifter, a tilt column, air conditioning, and coil-sprung front end with power steering. This Ford street rod is now offered by the seller on behalf of the owner’s estate with a top boot and a New Jersey title.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_b2bf34d9-a535-42bc-8ccd-6678434403b2-p11Xou-87771-87772-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe has been repainted metallic red, and it has a tan soft top with burgundy piping. Lucas-style covers accent the headlights, and a mirror has been mounted on the left door. The hood has been removed and is not included in the sale, and various paint and body blemishes are shown in the gallery.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_91e4424c-5d7b-4484-a151-0b37b994c86f-1zrfhl-87700-87701-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe car rides on chrome five-spoke 15″ wheels with 205/70s up front and 225/75s out back. A coil-sprung front end with power steering has been installed along with four-wheel disc brakes, and the rear has been modified with parallel leaf springs and lowering blocks. The seller notes the steering has play.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_4f3cdb40-0947-407b-ba1d-bfdf4d5d19e0-imy42k-88087-88088-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe front and rear benches are upholstered in tan vinyl with burgundy piping and buttons, and coordinating trim covers the side panels. Burgundy carpeting lines the floors, and a Lokar shifter has been installed along with air conditioning and a Sony CD stereo.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_02d0d043-82bd-47ad-8175-fac63d0ef1c7-nRgSv5-88064-88065-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe three-spoke steering wheel sits on a tilting column ahead of a Dolphin 140-mph speedometer with a boost-pressure gauge mounted below, while a Dolphin cluster with supplemental gauges is mounted to the right. The five-digit mechanical odometer shows 2,100 miles, with total chassis mileage unknown.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_a9c18860-eb17-4157-9bbb-9f390cd3fb12-URwzb5-88287-88288-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 350ci GM V8 is equipped with a supercharger topped by dual Edelbrock carburetors and a Hilborn-style air scoop. A belt guard and an aluminum radiator have also been installed along with AN fuel lines, and the finned valve covers are secured with extended wing nuts. The seller reports that the distributor and ignition coil have been replaced.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_f29ea801-f5d0-4feb-aa08-a97feaaab304-Owagdj-88340-88341-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is sent to the rear wheels through a four-speed automatic transmission. The car has a custom dual exhaust system, and corrosion is visible on underside components.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/1942_ford_sedan-convertible_1942_ford_sedan-convertible_7e4c84cd-8d59-4bb0-ba7f-b5e6b2b01cbf-iht23l-88389-97408.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Supercharged 350-Powered 1947 Ford Super Deluxe Convertible Street Rod\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe car is titled in New Jersey using SK6914PA, which matches the Pennsylvania plate number shown above. The title carries a Salvage brand.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
