{
  "id": "b3fd2d36-b01b-461a-be28-6347d62fb726",
  "title": "23k-Mile 1990 BMW M3",
  "link": "https://bringatrailer.com/listing/1990-bmw-m3-102/",
  "description": "This 1990 BMW M3 was purchased new through BMW’s European Delivery Program, an order that was facilitated by the Canadian Forces Europe Automobile and Miscellaneous Sales Transactions Office, with which the original owner was stationed in Lahr, Germany. It was later imported to the US in 1992 and remained under their care in Texas and Florida until the selling dealer’s purchase in February 2021. Showing 23k miles, the car is finished in Diamond Black Metallic over black Bison leather upholstery and is powered by a 2.3-liter S14B23 inline-four mated to a five-speed manual transmission and a limited-slip differential. Equipment includes 16\" Style 5 wheels, a sunroof, a rear spoiler, fog lights, front sport seats, cruise control, air conditioning, and an onboard computer. This E30 M3 is offered by the selling dealer with service records, sales documentation, manufacturer's literature, a clean Carfax report, and a clean Florida title.",
  "author": "bringatrailer",
  "published": "Wed, 01 Jan 2025 00:40:09 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 2917,
  "excerpt": "Bid for the chance to own a 23k-Mile 1990 BMW M3 at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #176,488.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/google-chrome-icon-192x192.png?v=e22cf04233",
  "text": "This 1990 BMW M3 was purchased new through BMW’s European Delivery Program, an order that was facilitated by the Canadian Forces Europe Automobile and Miscellaneous Sales Transactions Office, with which the original owner was stationed in Lahr, Germany. It was later imported to the US in 1992 and remained under their care in Texas and Florida until the selling dealer’s purchase in February 2021. Showing 23k miles, the car is finished in Diamond Black Metallic over black Bison leather upholstery and is powered by a 2.3-liter S14B23 inline-four mated to a five-speed manual transmission and a limited-slip differential. Equipment includes 16″ Style 5 wheels, a sunroof, a rear spoiler, fog lights, front sport seats, cruise control, air conditioning, and an onboard computer. This E30 M3 is offered by the selling dealer with service records, sales documentation, manufacturer’s literature, a clean Carfax report, and a clean Florida title. The car is finished in Diamond Black Metallic (181) and features an electric sunroof, a rear spoiler, fog lights, painted mirror caps, twin exhaust outlets, and wider fenders compared to the standard E30. Photographs of paint-meter readings are presented in the gallery. Silver 16″ Style 5 wheels are mounted with 225/45 Toyo Proxes R888R tires that have 2020 date codes. The MacPherson strut/semi-trailing arm suspension was revised for the M3 with a thicker rear anti-roll bar as well as shorter and stiffer springs. The brake fluid was changed in 2024. The cabin features manually adjustable front sport seats as well as a rear bench upholstered in black Bison leather. Amenities include an onboard computer, air conditioning, cruise control, and power windows, mirrors, and locks. A radio delete plate has been fitted and the removed head unit will accompany the sale. The four-spoke leather-wrapped airbag steering wheel fronts VDO instrumentation including a 160-mph speedometer and an 8k-rpm tachometer as well as gauges for oil temperature, coolant temperature, and fuel level. The six-digit odometer shows 23k miles. The 2.3-liter S14 inline-four was factory-rated at 192 horsepower and 170 lb-ft of torque. The battery was replaced and the oil was changed in 2024. Power is sent to the rear wheels through a Getrag five-speed manual transmission and a limited-slip differential. Manufacturer’s literature and service records will accompany the sale. The Carfax report is free of accidents or other reported damage. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-9541-21354.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 1990 BMW M3 was purchased new through BMW’s European Delivery Program, an order that was facilitated by the Canadian Forces Europe Automobile and Miscellaneous Sales Transactions Office, with which the original owner was stationed in Lahr, Germany. It was later imported to the US in 1992 and remained under their care in Texas and Florida until the selling dealer’s purchase in February 2021. Showing 23k miles, the car is finished in Diamond Black Metallic over black Bison leather upholstery and is powered by a 2.3-liter S14B23 inline-four mated to a five-speed manual transmission and a limited-slip differential. Equipment includes 16″ Style 5 wheels, a sunroof, a rear spoiler, fog lights, front sport seats, cruise control, air conditioning, and an onboard computer. This E30 M3 is offered by the selling dealer with service records, sales documentation, manufacturer’s literature, a clean Carfax report, and a clean Florida title.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-8814-21377.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe car is finished in Diamond Black Metallic (181) and features an electric sunroof, a rear spoiler, fog lights, painted mirror caps, twin exhaust outlets, and wider fenders compared to the standard E30. Photographs of paint-meter readings are presented in the gallery.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-8810-21394.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eSilver 16″ Style 5 wheels are mounted with 225/45 Toyo Proxes R888R tires that have 2020 date codes. The MacPherson strut/semi-trailing arm suspension was revised for the M3 with a thicker rear anti-roll bar as well as shorter and stiffer springs. The brake fluid was changed in 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-8954-21417.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe cabin features manually adjustable front sport seats as well as a rear bench upholstered in black Bison leather. Amenities include an onboard computer, air conditioning, cruise control, and power windows, mirrors, and locks. A radio delete plate has been fitted and the removed head unit will accompany the sale.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-8972-21441.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe four-spoke leather-wrapped airbag steering wheel fronts VDO instrumentation including a 160-mph speedometer and an 8k-rpm tachometer as well as gauges for oil temperature, coolant temperature, and fuel level. The six-digit odometer shows 23k miles.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_img-8903-21468.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 2.3-liter S14 inline-four was factory-rated at 192 horsepower and 170 lb-ft of torque. The battery was replaced and the oil was changed in 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/1990_bmw_m3_741cb86f-04c9-4dbc-a60a-8df9aa48d7e3_1_201_a-14962.jpeg?w=620\u0026amp;resize=620%2C413\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is sent to the rear wheels through a Getrag five-speed manual transmission and a limited-slip differential.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/12/IMG-8899-46055-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"23k-Mile 1990 BMW M3\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eManufacturer’s literature and service records will accompany the sale.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or other reported damage.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
