{
  "id": "c0ef3324-c861-4e1f-985d-79740ee2efd8",
  "title": "Rifles to roadsters: The fascinating story of I-Pace maker Magna",
  "link": "https://www.autocar.co.uk/car-news/from-the-archive/rifles-roadsters-fascinating-story-i-pace-maker-magna",
  "description": "Magna Steyr is an unknown outside the industry but has been trusted by some of the world’s most respected car makers Last week, we eulogised the I-Pace, production of which will soon end – in Austria, not the UK. That’s because it’s built for Jaguar by Magna Steyr, a company that is unknown outside the industry yet is a multibillion-dollar giant that has been trusted by some of the world’s most respected car makers. How did this come to be? Well, we must follow three distinct threads. Thread one takes us right back to 1830, when Leopold Werndl began manufacturing rifle parts in Steyr, Austria. Having expanded greatly during World War I, his firm decided to diversify, poached the famously convention-breaking engineer Hans Ledwinka from Tatra and in 1920 launched an affordable car of its own design. Autocar got its first taste of a Steyr car in 1925, remarking of the Type VII straight-six saloon: “It is apparent that the chassis is of very modern design, and the nature of the factory is sufficient indication of the class of workmanship to be expected. Performance is distinctly good, especially considering its capacity and weight of [1880kg]. For the suspension system, nothing but praise is due.” Thread two begins in 1890, when Johann Puch opened a bicycle workshop in Graz. Success came quickly, and by 1904 his business had expanded into cars, ranging from little ‘voiturettes’ to limousines for Austria’s Habsburg royal family. We pick up thread three in 1899, as Germany’s flourishing Daimler company established a subsidiary in Vienna. Austro Daimler made a variety of vehicles – including early 4x4s, military vehicles and even trains but primarily cars – under a certain Ferdinand Porsche. So fine were its luxury cars that they were permitted to bear the royal eagle, while its racers were world-beating. Autocar first tested an ‘AD’ in 1925, saying of the 19/70hp sports tourer: “The performance will not disappoint any motorist who will reflect that in this chassis of [3.4m] wheelbase there is a power unit of but a little over 2.5 litres capacity [and weight is 1500kg]. As a clutch stop is fitted, rapid upward changes on a hill can be effected with ease. Moreover, the controls are well placed, and the car handles in that delightful manner which engenders confidence in a driver strange to it.”  Our threads become tied together as Europe plunged into the Great Depression. First, in 1928, Puch, listless after the unexpected death of its founder, merged with Austro Daimler, which had recently lost Dr Porsche to Steyr – which then had to be bailed out just a year later, as its car sales collapsed from 5000 to a mere 13 (yes, 13) in 1930, then be bought out by its compatriots in 1935. Thus we now have one conglomerate, named Steyr-Daimler-Puch. World War II forced a sudden switch in tack, the Austrian factories making guns and Porsche-designed V8 trucks for the Nazi military. Trucks continued to be the focus after the war, along with buses and tractors, but the firm didn’t want to abandon cars, so it signed a deal to produce modified Fiat designs from 1948. Most significant among them was the tiny, super-affordable 500 that got Italy moving post-war, and the Austrians did some cool sporting versions too, as Autocar found out in 1967 in the Steyr-Puch 650 TRII, which had just claimed a shock European Rally Championship title. “Its remarkable 650cc air-cooled flat twin, which develops an amazing 36bhp, sounds sweet, very healthy and eager to go on being thrashed.” As for the military machinery, we found of the lightweight Haflinger 4x4 “the worse the conditions, the more the car impresses” and of the later, larger, 6x6 Pinzgauer: “There is little to beat it. To see it forging uphill through saplings and other obstacles is truly awe-inspiring.” No wonder Daimler hired Steyr-Puch to develop the 4x4 system for the first-ever Mercedes G-Wagen and Fiat the same for its Panda. The conglomerate gradually split up the 1980s, and in a neat piece of symmetry the car-making arm was bought by Daimler in 1998. A buyout came from Canadian parts maker Magna in 2001, and that brings us back to today, with Jaguars being built alongside BMWs and Toyotas.",
  "author": "",
  "published": "Sun, 13 Oct 2024 07:01:20 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Kris Culmer",
  "length": 1333,
  "excerpt": "Magna Steyr is an unknown outside the industry but has been trusted by some of the world’s most respected car makers",
  "siteName": "Autocar",
  "favicon": "",
  "text": "We pick up thread three in 1899, as Germany’s flourishing Daimler company established a subsidiary in Vienna. Austro Daimler made a variety of vehicles – including early 4x4s, military vehicles and even trains but primarily cars – under a certain Ferdinand Porsche. So fine were its luxury cars that they were permitted to bear the royal eagle, while its racers were world-beating. Autocar first tested an ‘AD’ in 1925, saying of the 19/70hp sports tourer: “The performance will not disappoint any motorist who will reflect that in this chassis of [3.4m] wheelbase there is a power unit of but a little over 2.5 litres capacity [and weight is 1500kg]. As a clutch stop is fitted, rapid upward changes on a hill can be effected with ease. Moreover, the controls are well placed, and the car handles in that delightful manner which engenders confidence in a driver strange to it.”  Our threads become tied together as Europe plunged into the Great Depression. First, in 1928, Puch, listless after the unexpected death of its founder, merged with Austro Daimler, which had recently lost Dr Porsche to Steyr – which then had to be bailed out just a year later, as its car sales collapsed from 5000 to a mere 13 (yes, 13) in 1930, then be bought out by its compatriots in 1935. Thus we now have one conglomerate, named Steyr-Daimler-Puch.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/arcive-col-02-2509.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003e\u003cimg alt=\"\" height=\"596\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/arcive-col-02-2509.jpg?itok=ZSRqlVoj\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/arcive-col-02-2509.jpg?itok=ZSRqlVoj\"/\u003e\u003c/p\u003e\n\u003cp\u003eWe pick up thread three in 1899, as Germany’s flourishing \u003ca href=\"https://www.autocar.co.uk/car-news/business-finance-and-corporate/daimler-rebranded-mercedes-benz-ag\"\u003eDaimler\u003c/a\u003e company established a subsidiary in Vienna. Austro Daimler made a variety of vehicles – including early \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/top-10-best-4x4s-and-road-cars\"\u003e4x4s\u003c/a\u003e, military vehicles and even trains but primarily cars – under a certain Ferdinand \u003ca href=\"https://www.autocar.co.uk/car-review/porsche\"\u003ePorsche\u003c/a\u003e. So fine were its \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-luxury-cars\"\u003eluxury cars\u003c/a\u003e that they were permitted to bear the royal eagle, while its racers were world-beating.\u003c/p\u003e\n\u003cp\u003eAutocar first tested an ‘AD’ in 1925, saying of the 19/70hp sports tourer: “The performance will not disappoint any motorist who will reflect that in this chassis of [3.4m] wheelbase there is a power unit of but a little over 2.5 litres capacity [and weight is 1500kg]. As a clutch stop is fitted, rapid upward changes on a hill can be effected with ease. Moreover, the controls are well placed, and the car handles in that delightful manner which engenders confidence in a driver strange to it.” \u003c/p\u003e\n\u003cp\u003eOur threads become tied together as Europe plunged into the Great Depression.\u003c/p\u003e\n\u003cp\u003eFirst, in 1928, Puch, listless after the unexpected death of its founder, merged with Austro Daimler, which had recently lost Dr Porsche to Steyr – which then had to be bailed out just a year later, as its car sales collapsed from 5000 to a mere 13 (yes, 13) in 1930, then be bought out by its compatriots in 1935. Thus we now have one conglomerate, named Steyr-Daimler-Puch.            \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-13T07:01:20Z",
  "modifiedTime": null
}
