{
  "id": "dc5b1936-35f4-43a8-958c-5d2ab9d27c61",
  "title": "Kia Syros review: Ace of Space",
  "link": "https://www.autocarindia.com/car-reviews/kia-syros-review-ace-of-space-434379#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
  "description": "The compact SUV segment is a crowded space for sure, with contenders that include Kia’s own Sonet. The Korean automaker has now introduced another player in the mix; enter the Syros, positioned above the Sonet and below the Seltos in Kia’s portfolio. Kia Syros platform and engineering Interestingly, while the Sonet is based on Kia’s K2 platform, the Syros is underpinned by the smaller K1 platform that underpins cars like the Hyundai Grand i10 Nios, Exter and international models like the Casper and Inster. The company says that using the newer K1 platform has enabled it to bring in the latest electrical and electronics architecture with abilities like customer-requested remote diagnosis and over-the-air (OTA) updates beyond the infotainment system; for body controllers, for instance. While the Sonet, Seltos, Carens and EV6 do not have controllers that can be updated OTA, the Syros has 16, the Carnival has 26 and the EV9 has 45. The unconventional and funky styling will surely divide opinion.  The company refers to the Syros’ platform as the reinforced K1, given that it has been strengthened with a lot of hot-stamped parts in the body shell. Although Kia is tight-lipped on what crash rating it is targeting, it expects the Syros to perform well. Kia Syros exterior design Kia has bestowed the Syros with a host of tech and safety updates to make it stand out in a sea of sub-4-metre SUVs, and it has smartly chosen a rather unconventional route – the styling; it is very quirky and will displease some, but there’s a lot to like, too. For one, while the looks may be quirky, they also come across as funky and cool – at least to these eyes – as the overall proportions are well-defined. There are many neat styling details around the car like the stacked ‘ice-cube’ headlights, which look cool. They are bracketed by vertical Daytime Running Lamps (DRLs) and the entire unit is pushed to the corners; it could easily sustain damage during parking skirmishes due to its positioning. Stacked ‘ice-cube’ headlights bordered by vertical DRLs look unique. The nose is very upright and has a closed off ‘grille area’ – a nod, perhaps, to the EV version coming next year. The air intake area is set below and split by the number plate housing. Below that is the silver skid plate-like garnish, a treatment which is repeated at the sides and on the rear bumper, too. Wheel sizes vary between 15-inch steel to 16- and 17-inch alloy rims. There’s a chunky black cladding around the wheel arches and the front and rear fenders are chunky, too. The bottom edges of the window line of the B-pillar are curved upwards, giving the lower glass line a rounded-edge profile. The cladding, which starts at the front bumper, runs across the doors and into the rear fenders and rear bumper.And, like the headlights, the tail-lamp units also merge with the cladding and carry LED stop lamps and turn signal bulbs. The rear windscreen and pillars are flanked by cool-looking L-shaped DRLs.Adding to the funky elements are fun body colours like a metallic red and two blue shades, including this ‘Frost Blue’ our test car came in. Kia Syros interior design Three screen display looks cool; centre screen obscured by steering rim.  While the exteriors might be polarising, the interiors will likely find many happy buyers. This is the main focus area and differentiator for the Syros, and it starts with the design. There are some unconventional elements, like the new squircle steering wheel with an off-centre Kia logo, but the overall design like the AC vents, instrument display and centre console, look conventional. There are four different interior colour schemes depending on the variant,and they all have a youthful pallet with lively off-set colour accents all around the cabin.The colour scheme can be further tweaked with 64-colour ambient lighting.There’s a lot of sustainable and recycled materials used, and the look and feel is really very good, which is typical Kia. The mix of colours and textures give off a high-quality feel and you really have to poke at surfaces to look for hard plastics areas, which are few. The cube-like gear knob is nicely styled, and it has a dual-tone design with an accent colour and an illuminated P-R-N-D indicator. Ahead of the gear lever is a wireless charging pad, which is light grey in colour with tiny specks of colour. A wireless charging pad, two USB-C ports and a 12V charging outlet on offer in the front.   Kia Syros space and comfort One look at the tall-boy design and you know the Syros will have good headroom, which it does. Legroom at the rear is excellent as well, with Kia making good use of the 2,550mm wheelbase, which, for reference, is more than the Sonet’s and those of competitors like the Maruti Suzuki Brezza, Hyundai Venue and the Tata Nexon, which are around the 2,500mm mark. First-in-segment rear seat slide and recline; ventilation for seat base only.  Occupants at the rear can further tweak space as the seats slide and recline, and the backrest can be locked into multiple recline angles. The rear seats also boast of a segment-first cooled seats; however, while the front seats get cooling for the base and backrest, only the seat base is cooled at the rear. This isn’t due to a cost issue, but an engineering one; Kia was finding it difficult to package a blower unit into the rear seatbacks and still manage recline and slide to the desired degree. For the update, though, Kia would do well to include seatback cooling, even if it means a lower recline angle. The seats are very comfy, but lumbar support of the front seats are a touch better. Boot space is also large and varies between 390 litres and 465 litres (with the second row seats slidforward completely). With the seatbacks upright and the rear seats in the forward-most position, there's 465 litres of boot space.   Kia Syros equipment and safety As we’ve come to expect of the brand, the Kia Syros’ equipment list is exhaustive. Dominating the dash is a large single glass panel that houses three screens: a 12.3-inch central touchscreen, a 12.3-inch instrument panel with customisable displays and a 5-inch HVAC touchscreen. The IP dials are, thankfully, clear to read. The temperature read out and control surface, however, is obscured by the steering wheel rim. Physical controls for main functions like temperate and blower control sit below, and these are nice,large and easy-to-use toggle switches. Interestingly, lower trims that miss out on the 5-inch screen have a more elaborate button bank.  360-degree camera also has a blind view monitor function. Other feature highlights include an air purifier, an 8-speaker Harman Kardon system, an on-board ‘hey Kia’ voice assistant,a 360-degree camera with a blind view monitor and a large dual-pane panoramic sunroof, which really brightens up an already airy cabin. There are a few clever little details, too, like the ability to lower and raise the windows using the key and the connectivity app. The app also has remote engine start. There are resizable cup holders that click open with the touch of a button and sun shades that flip to the side and slide backward. Large dual-pane sunroof adds to the vast openess of the cabin.  The Syros also comes equipped with camera and radar-based ADAS with all the expected functionality, including smart cruise control with a stop-go function. We tested this and the lane keeping assist for a brief period, and it performed well with smooth interventions; however, we’ll know more when we put the Syros through our exhaustive road test. Other safety kit includes hill start assist, ABS with ESC and brake force assist, and 6 airbags. Kia Syros engine, gearbox options 1.0-litre TGDi and 1.5-litre diesel (shown above) shared with the Sonet and Hyundai Venue. The Kia Syros is powered by the familiar 1.0 litre turbocharged gasoline direct injection (GDi) mated to a 7-speed dual-clutch auto or a 6-speed manual. While Hyundai has offered the 1.0 GDi with a manual, this combination is a first for Kia. Unlike many others in this segment, Kia also offers a diesel engine:a 1.5-litre unit that’s paired to either a 6-speed manual or a 6-speed sun and planetary (torque convertor) auto. The petrol and diesel autos also have three drive modes – Eco, Normal and Sport – as well as three traction modes – Snow, Sand and Mud – that alters the traction control sensitivity to enable better grip on loose surfaces. Kia Syros petrol performance and efficiency The 1.0 GDi engine puts out a maximum of 120hp at 6,000rpm and 172Nm between 1,500 and 4,000rpm. It has enough pep when paired with the DCT auto, and in our initial tests, we clocked a 0-100kph time of 11.63 seconds in Sport mode. There is some turbo lag under 1,500rpm and power drops off at about 5,200rpm. You can use the steering wheel paddles but the gearbox will upshift regardless, even in manual mode. Left to its own devices, the DCT tends to upshift early,and you’ll often find it downshifting when you prod the throttle a little more than normal. You get the impression that the early upshifts are a means to avoid a hefty fuel bill, but its claimed fuel efficiency figures of 18.20kpl for the manual and 17.68kpl for the auto aren’t as high as some competitors, or even the Sonet. Both engines are reasonably quick, but in-cabin NVH levels are high.  At low speeds, gearshifts can be clunky at times, but the powertrain on the whole is refinedso long as it’s driven in a relaxed manner. Go slightly beyond, however, and things get quite vocal; even past 2,200rpm, the engine is quite audible inside which is a downer for a petrol unit. It could be due to low insulation along with the engine’s natural, gruff character as revs climb. We also drove the petrol manual for a short while and initial impressions are of a firm and springy clutch. Gear lever travel is smooth, though, with well-defined gates. For the enthusiastic driver, this powertrain combo will be fun; it’s easy to keep the engine in its power band with no software second guessing you. It’s also very tractable and you can bring speeds down to 25kph in fourth gear and pull away smoothly albeit slowly. Kia Syros diesel performance and efficiency Diesel's low end torque means off the line response is good.  The 1.5-litre diesel engine makes a maximum of 116hp at 4,000rpm and 250Nm of torque from 1,500-2,750rpm. It’s an engine we’ve come to like in the Sonet, Seltos and the Hyundai cars, and it proves to be likeable here, too. Thanks to the low-end power, off-the-line response is very good and the auto gearbox’s shifts are smooth, if a bit lazy. Driving at a relaxed pace is where it’s very happy with ample torque on tap making overtaking easy. You don’t have to reach for the paddles or contend with multiple downshifts. It’s quick enough, too, and our initial tests showed a 0-100kph time of 13.88 seconds. However, like the petrol engine,refinement is an issue here as well. You can hear the engine inside quite clearly post 2,500rpm, and once again, better insulation is the need of the hour.While both engines do not have that outright peppy character, it’s just fine given the clear comfort bias this car has, but that’s the very reason why NVH levels should have been better. Kia Syros ride and handling Tall-boy design means there is body roll while cornering. The Syros is a tall car with a heavy panoramic sunroof on top, so body roll, as expected, is present. If you do drive it enthusiastically around a corner, the body leans, but the damper’s initial compression is firm to limit this. However, this comes at the expense of a firm ride over ruts and potholes. The sharp edge is felt more on the diesel, but in both cars, the ruts never come crashing through. Steering feel is good and it weighs up for a secure enough feel at triple digit speeds, but it could have been lighter at city speeds. Kia Syros price and buying Prices for the Kia Syros are yet to be announced, and it will be interesting to see how Kia positions it between the Sonet and Seltos. Given that narrow brand, Kia has beensmart in looking beyond a price differentiation and chosen instead to substantially differentiate the Syros’ character with a clear singular focus. It’s not your typical upright SUV, not an enthusiastic sporty driver and not really a highway car either, what with the high NVH levels at high speeds. What it is centred on is squarely comfort and conveniences, and it does those brilliantly. The NVH issue is a shame, as, given the comfort orientation, a silent cabin would be appreciated. It checks every other box apart from that, though. The seats are comfy, the cooled function is a welcome addition and the rear has ample leg and headroom, with the handy recline and sliding function. Equipment levels are very good with all the expected bits like climate control, large digital displays, a premium sound system, a full connectivity and ADAS suite, and the dual-pane panoramic sunroof. Air purifier neatly tucked under the front centre armrest. The interior design, too, is modern and fresh and looks nice and premium. The choice of petrol and diesel engines along with manual and automatic ’boxes is another plus point. So, while the radical styling will not go down well with everyone, for those who like it or are willing to look past it, there’s clearly plenty to like. Our cities are getting more congested and people are spending more time in traffic, so if you must contend with this in your own car, the compact, comfy and well-equipped Syros fits the bill perfectly. Also see: Kia Syros bookings open at Rs 25,000 Kia Syros top two AT variants in high demand Kia Seltos accounts for 46.5 percent of brand’s total India sales",
  "author": "Sergius Barretto",
  "published": "Tue, 28 Jan 2025 15:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
  "categories": null,
  "byline": "",
  "length": 13812,
  "excerpt": "Kia Syros price in India to be revealed on February 1. Tap to know what the Kia Syros performance, features, interior, space and more are like with our in depth review.",
  "siteName": "Autocar India",
  "favicon": "",
  "text": "Built on a reinforced small car platform, Kia’s new compact SUV goes big on interior space. Can that deliver Kia the winning hand?The compact SUV segment is a crowded space for sure, with contenders that include Kia’s own Sonet. The Korean automaker has now introduced another player in the mix; enter the Syros, positioned above the Sonet and below the Seltos in Kia’s portfolio.Kia Syros platform and engineeringInterestingly, while the Sonet is based on Kia’s K2 platform, the Syros is underpinned by the smaller K1 platform that underpins cars like the Hyundai Grand i10 Nios, Exter and international models like the Casper and Inster. The company says that using the newer K1 platform has enabled it to bring in the latest electrical and electronics architecture with abilities like customer-requested remote diagnosis and over-the-air (OTA) updates beyond the infotainment system; for body controllers, for instance. While the Sonet, Seltos, Carens and EV6 do not have controllers that can be updated OTA, the Syros has 16, the Carnival has 26 and the EV9 has 45.The unconventional and funky styling will surely divide opinion. The company refers to the Syros’ platform as the reinforced K1, given that it has been strengthened with a lot of hot-stamped parts in the body shell. Although Kia is tight-lipped on what crash rating it is targeting, it expects the Syros to perform well.Kia Syros exterior design Kia has bestowed the Syros with a host of tech and safety updates to make it stand out in a sea of sub-4-metre SUVs, and it has smartly chosen a rather unconventional route – the styling; it is very quirky and will displease some, but there’s a lot to like, too.For one, while the looks may be quirky, they also come across as funky and cool – at least to these eyes – as the overall proportions are well-defined. There are many neat styling details around the car like the stacked ‘ice-cube’ headlights, which look cool. They are bracketed by vertical Daytime Running Lamps (DRLs) and the entire unit is pushed to the corners; it could easily sustain damage during parking skirmishes due to its positioning.Stacked ‘ice-cube’ headlights bordered by vertical DRLs look unique.The nose is very upright and has a closed off ‘grille area’ – a nod, perhaps, to the EV version coming next year. The air intake area is set below and split by the number plate housing. Below that is the silver skid plate-like garnish, a treatment which is repeated at the sides and on the rear bumper, too.Wheel sizes vary between 15-inch steel to 16- and 17-inch alloy rims. There’s a chunky black cladding around the wheel arches and the front and rear fenders are chunky, too. The bottom edges of the window line of the B-pillar are curved upwards, giving the lower glass line a rounded-edge profile.The cladding, which starts at the front bumper, runs across the doors and into the rear fenders and rear bumper.And, like the headlights, the tail-lamp units also merge with the cladding and carry LED stop lamps and turn signal bulbs. The rear windscreen and pillars are flanked by cool-looking L-shaped DRLs.Adding to the funky elements are fun body colours like a metallic red and two blue shades, including this ‘Frost Blue’ our test car came in.Kia Syros interior design Three screen display looks cool; centre screen obscured by steering rim. While the exteriors might be polarising, the interiors will likely find many happy buyers. This is the main focus area and differentiator for the Syros, and it starts with the design. There are some unconventional elements, like the new squircle steering wheel with an off-centre Kia logo, but the overall design like the AC vents, instrument display and centre console, look conventional.There are four different interior colour schemes depending on the variant,and they all have a youthful pallet with lively off-set colour accents all around the cabin.The colour scheme can be further tweaked with 64-colour ambient lighting.There’s a lot of sustainable and recycled materials used, and the look and feel is really very good, which is typical Kia. The mix of colours and textures give off a high-quality feel and you really have to poke at surfaces to look for hard plastics areas, which are few. The cube-like gear knob is nicely styled, and it has a dual-tone design with an accent colour and an illuminated P-R-N-D indicator. Ahead of the gear lever is a wireless charging pad, which is light grey in colour with tiny specks of colour.A wireless charging pad, two USB-C ports and a 12V charging outlet on offer in the front.  Kia Syros space and comfort One look at the tall-boy design and you know the Syros will have good headroom, which it does. Legroom at the rear is excellent as well, with Kia making good use of the 2,550mm wheelbase, which, for reference, is more than the Sonet’s and those of competitors like the Maruti Suzuki Brezza, Hyundai Venue and the Tata Nexon, which are around the 2,500mm mark.First-in-segment rear seat slide and recline; ventilation for seat base only. Occupants at the rear can further tweak space as the seats slide and recline, and the backrest can be locked into multiple recline angles. The rear seats also boast of a segment-first cooled seats; however, while the front seats get cooling for the base and backrest, only the seat base is cooled at the rear. This isn’t due to a cost issue, but an engineering one; Kia was finding it difficult to package a blower unit into the rear seatbacks and still manage recline and slide to the desired degree. For the update, though, Kia would do well to include seatback cooling, even if it means a lower recline angle. The seats are very comfy, but lumbar support of the front seats are a touch better.Boot space is also large and varies between 390 litres and 465 litres (with the second row seats slidforward completely).With the seatbacks upright and the rear seats in the forward-most position, there's 465 litres of boot space.  Kia Syros equipment and safety As we’ve come to expect of the brand, the Kia Syros’ equipment list is exhaustive. Dominating the dash is a large single glass panel that houses three screens: a 12.3-inch central touchscreen, a 12.3-inch instrument panel with customisable displays and a 5-inch HVAC touchscreen. The IP dials are, thankfully, clear to read. The temperature read out and control surface, however, is obscured by the steering wheel rim. Physical controls for main functions like temperate and blower control sit below, and these are nice,large and easy-to-use toggle switches. Interestingly, lower trims that miss out on the 5-inch screen have a more elaborate button bank. 360-degree camera also has a blind view monitor function.Other feature highlights include an air purifier, an 8-speaker Harman Kardon system, an on-board ‘hey Kia’ voice assistant,a 360-degree camera with a blind view monitor and a large dual-pane panoramic sunroof, which really brightens up an already airy cabin.There are a few clever little details, too, like the ability to lower and raise the windows using the key and the connectivity app. The app also has remote engine start. There are resizable cup holders that click open with the touch of a button and sun shades that flip to the side and slide backward.Large dual-pane sunroof adds to the vast openess of the cabin. The Syros also comes equipped with camera and radar-based ADAS with all the expected functionality, including smart cruise control with a stop-go function. We tested this and the lane keeping assist for a brief period, and it performed well with smooth interventions; however, we’ll know more when we put the Syros through our exhaustive road test. Other safety kit includes hill start assist, ABS with ESC and brake force assist, and 6 airbags.Kia Syros engine, gearbox options1.0-litre TGDi and 1.5-litre diesel (shown above) shared with the Sonet and Hyundai Venue.The Kia Syros is powered by the familiar 1.0 litre turbocharged gasoline direct injection (GDi) mated to a 7-speed dual-clutch auto or a 6-speed manual. While Hyundai has offered the 1.0 GDi with a manual, this combination is a first for Kia. Unlike many others in this segment, Kia also offers a diesel engine:a 1.5-litre unit that’s paired to either a 6-speed manual or a 6-speed sun and planetary (torque convertor) auto. The petrol and diesel autos also have three drive modes – Eco, Normal and Sport – as well as three traction modes – Snow, Sand and Mud – that alters the traction control sensitivity to enable better grip on loose surfaces.Kia Syros petrol performance and efficiencyThe 1.0 GDi engine puts out a maximum of 120hp at 6,000rpm and 172Nm between 1,500 and 4,000rpm. It has enough pep when paired with the DCT auto, and in our initial tests, we clocked a 0-100kph time of 11.63 seconds in Sport mode.There is some turbo lag under 1,500rpm and power drops off at about 5,200rpm. You can use the steering wheel paddles but the gearbox will upshift regardless, even in manual mode.Left to its own devices, the DCT tends to upshift early,and you’ll often find it downshifting when you prod the throttle a little more than normal. You get the impression that the early upshifts are a means to avoid a hefty fuel bill, but its claimed fuel efficiency figures of 18.20kpl for the manual and 17.68kpl for the auto aren’t as high as some competitors, or even the Sonet.Both engines are reasonably quick, but in-cabin NVH levels are high. At low speeds, gearshifts can be clunky at times, but the powertrain on the whole is refinedso long as it’s driven in a relaxed manner. Go slightly beyond, however, and things get quite vocal; even past 2,200rpm, the engine is quite audible inside which is a downer for a petrol unit. It could be due to low insulation along with the engine’s natural, gruff character as revs climb.We also drove the petrol manual for a short while and initial impressions are of a firm and springy clutch. Gear lever travel is smooth, though, with well-defined gates. For the enthusiastic driver, this powertrain combo will be fun; it’s easy to keep the engine in its power band with no software second guessing you. It’s also very tractable and you can bring speeds down to 25kph in fourth gear and pull away smoothly albeit slowly.Kia Syros diesel performance and efficiencyDiesel's low end torque means off the line response is good. The 1.5-litre diesel engine makes a maximum of 116hp at 4,000rpm and 250Nm of torque from 1,500-2,750rpm. It’s an engine we’ve come to like in the Sonet, Seltos and the Hyundai cars, and it proves to be likeable here, too. Thanks to the low-end power, off-the-line response is very good and the auto gearbox’s shifts are smooth, if a bit lazy. Driving at a relaxed pace is where it’s very happy with ample torque on tap making overtaking easy. You don’t have to reach for the paddles or contend with multiple downshifts. It’s quick enough, too, and our initial tests showed a 0-100kph time of 13.88 seconds.However, like the petrol engine,refinement is an issue here as well. You can hear the engine inside quite clearly post 2,500rpm, and once again, better insulation is the need of the hour.While both engines do not have that outright peppy character, it’s just fine given the clear comfort bias this car has, but that’s the very reason why NVH levels should have been better.Kia Syros ride and handlingTall-boy design means there is body roll while cornering.The Syros is a tall car with a heavy panoramic sunroof on top, so body roll, as expected, is present. If you do drive it enthusiastically around a corner, the body leans, but the damper’s initial compression is firm to limit this. However, this comes at the expense of a firm ride over ruts and potholes. The sharp edge is felt more on the diesel, but in both cars, the ruts never come crashing through.Steering feel is good and it weighs up for a secure enough feel at triple digit speeds, but it could have been lighter at city speeds.Kia Syros price and buyingPrices for the Kia Syros are yet to be announced, and it will be interesting to see how Kia positions it between the Sonet and Seltos. Given that narrow brand, Kia has beensmart in looking beyond a price differentiation and chosen instead to substantially differentiate the Syros’ character with a clear singular focus.It’s not your typical upright SUV, not an enthusiastic sporty driver and not really a highway car either, what with the high NVH levels at high speeds. What it is centred on is squarely comfort and conveniences, and it does those brilliantly.The NVH issue is a shame, as, given the comfort orientation, a silent cabin would be appreciated. It checks every other box apart from that, though. The seats are comfy, the cooled function is a welcome addition and the rear has ample leg and headroom, with the handy recline and sliding function. Equipment levels are very good with all the expected bits like climate control, large digital displays, a premium sound system, a full connectivity and ADAS suite, and the dual-pane panoramic sunroof.Air purifier neatly tucked under the front centre armrest.The interior design, too, is modern and fresh and looks nice and premium. The choice of petrol and diesel engines along with manual and automatic ’boxes is another plus point. So, while the radical styling will not go down well with everyone, for those who like it or are willing to look past it, there’s clearly plenty to like. Our cities are getting more congested and people are spending more time in traffic, so if you must contend with this in your own car, the compact, comfy and well-equipped Syros fits the bill perfectly.Also see:Kia Syros bookings open at Rs 25,000Kia Syros top two AT variants in high demandKia Seltos accounts for 46.5 percent of brand’s total India salesImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250128125845_Kia_Syros_Side_Tracking_main.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eBuilt on a reinforced small car platform, Kia’s new compact SUV goes big on interior space. Can that deliver Kia the winning hand?\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe compact SUV segment is a crowded space for sure, with contenders that include Kia’s own Sonet. The Korean automaker has now introduced another player in the mix; enter the Syros, positioned above the Sonet and below the Seltos in Kia’s portfolio.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros platform and engineering\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eInterestingly, while the Sonet is based on Kia’s K2 platform, the Syros is underpinned by the smaller K1 platform that underpins cars like the Hyundai Grand i10 Nios, Exter and international models like the Casper and \u003ca href=\"https://www.autocarindia.com/car-news/hyundai-inster-ev-launch-by-late-2026-to-rival-punch-ev-ec3-432102\" title=\"Hyundai Inster EV launch by late 2026 to rival Punch EV, eC3\"\u003e\u003cstrong\u003eInster\u003c/strong\u003e\u003c/a\u003e. The company says that using the newer K1 platform has enabled it to bring in the latest electrical and electronics architecture with abilities like customer-requested remote diagnosis and over-the-air (OTA) updates beyond the infotainment system; for body controllers, for instance. While the Sonet, \u003ca href=\"https://www.autocarindia.com/cars/kia/seltos\"\u003e\u003cstrong\u003eSeltos\u003c/strong\u003e\u003c/a\u003e, Carens and EV6 do not have controllers that can be updated OTA, the Syros has 16, the Carnival has 26 and the EV9 has 45.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros front static\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Front_Quarter_Static.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros front static\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ci\u003eThe unconventional and funky styling will surely divide opinion. \u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe company refers to the Syros’ platform as the reinforced K1, given that it has been strengthened with a lot of hot-stamped parts in the body shell. Although Kia is tight-lipped on what crash rating it is targeting, it expects the Syros to perform well.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros exterior design \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eKia has bestowed the Syros with a host of tech and safety updates to make it stand out in a sea of sub-4-metre SUVs, and it has smartly chosen a rather unconventional route – the styling; it is very quirky and will displease some, but there’s a lot to like, too.\u003c/p\u003e\u003cp\u003eFor one, while the looks may be quirky, they also come across as funky and cool – at least to these eyes – as the overall proportions are well-defined. There are many neat styling details around the car like the stacked ‘ice-cube’ headlights, which look cool. They are bracketed by vertical Daytime Running Lamps (DRLs) and the entire unit is pushed to the corners; it could easily sustain damage during parking skirmishes due to its positioning.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros headlight and DRL\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Headlight_Foglamp.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros headlight and DRL\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eStacked ‘ice-cube’ headlights bordered by vertical DRLs look unique.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe nose is very upright and has a closed off ‘grille area’ – a nod, perhaps, to the \u003ca href=\"https://www.autocarindia.com/car-news/kia-syros-ev-launch-in-early-2026-433944\" title=\"Kia Syros EV launch in early 2026\"\u003e\u003cstrong\u003eEV version coming next year\u003c/strong\u003e\u003c/a\u003e. The air intake area is set below and split by the number plate housing. Below that is the silver skid plate-like garnish, a treatment which is repeated at the sides and on the rear bumper, too.\u003c/p\u003e\u003cp\u003eWheel sizes vary between 15-inch steel to 16- and 17-inch alloy rims. There’s a chunky black cladding around the wheel arches and the front and rear fenders are chunky, too. The bottom edges of the window line of the B-pillar are curved upwards, giving the lower glass line a rounded-edge profile.\u003c/p\u003e\u003cp\u003eThe cladding, which starts at the front bumper, runs across the doors and into the rear fenders and rear bumper.And, like the headlights, the tail-lamp units also merge with the cladding and carry LED stop lamps and turn signal bulbs. The rear windscreen and pillars are flanked by cool-looking L-shaped DRLs.Adding to the funky elements are fun body colours like a metallic red and two blue shades, including this ‘Frost Blue’ our test car came in.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros interior design \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros driver sear POV\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Steering.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros driver sear POV\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThree screen display looks cool; centre screen obscured by steering rim. \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eWhile the exteriors might be polarising, the interiors will likely find many happy buyers. This is the main focus area and differentiator for the Syros, and it starts with the design. There are some unconventional elements, like the new squircle steering wheel with an off-centre Kia logo, but the overall design like the AC vents, instrument display and centre console, look conventional.\u003c/p\u003e\u003cp\u003eThere are four different interior colour schemes depending on the variant,and they all have a youthful pallet with lively off-set colour accents all around the cabin.The colour scheme can be further tweaked with 64-colour ambient lighting.There’s a lot of sustainable and recycled materials used, and the look and feel is really very good, which is typical Kia. The mix of colours and textures give off a high-quality feel and you really have to poke at surfaces to look for hard plastics areas, which are few. The cube-like gear knob is nicely styled, and it has a dual-tone design with an accent colour and an illuminated P-R-N-D indicator. Ahead of the gear lever is a wireless charging pad, which is light grey in colour with tiny specks of colour.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros centre console\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Centre_Console.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros centre console\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eA wireless charging pad, two USB-C ports and a 12V charging outlet on offer in the front.\u003c/em\u003e\u003cbr/\u003e  \u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros space and comfort \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eOne look at the tall-boy design and you know the Syros will have good headroom, which it does. Legroom at the rear is excellent as well, with Kia making good use of the 2,550mm wheelbase, which, for reference, is more than the Sonet’s and those of competitors like the Maruti Suzuki Brezza, Hyundai Venue and the Tata Nexon, which are around the 2,500mm mark.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros rear seat\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Rear_Seat_Reclined.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros rear seat\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eFirst-in-segment rear seat slide and recline; ventilation for seat base only. \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eOccupants at the rear can further tweak space as the seats slide and recline, and the backrest can be locked into multiple recline angles. The rear seats also boast of a segment-first cooled seats; however, while the front seats get cooling for the base and backrest, only the seat base is cooled at the rear. This isn’t due to a cost issue, but an engineering one; Kia was finding it difficult to package a blower unit into the rear seatbacks and still manage recline and slide to the desired degree. For the update, though, Kia would do well to include seatback cooling, even if it means a lower recline angle. The seats are very comfy, but lumbar support of the front seats are a touch better.\u003c/p\u003e\u003cp\u003eBoot space is also large and varies between 390 litres and 465 litres (with the second row seats slidforward completely).\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros boot\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Boot.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros boot\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eWith the seatbacks upright and the rear seats in the forward-most position, there\u0026#39;s 465 litres of boot space.\u003c/em\u003e\u003cbr/\u003e  \u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros equipment and safety \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eAs we’ve come to expect of the brand, the Kia Syros’ equipment list is exhaustive. Dominating the dash is a large single glass panel that houses three screens: a 12.3-inch central touchscreen, a 12.3-inch instrument panel with customisable displays and a 5-inch HVAC touchscreen. The IP dials are, thankfully, clear to read. The temperature read out and control surface, however, is obscured by the steering wheel rim. Physical controls for main functions like temperate and blower control sit below, and these are nice,large and easy-to-use toggle switches. Interestingly, lower trims that miss out on the 5-inch screen have a more elaborate button bank.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros infotainment touchscreen 360 degree camrea\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Infotainment.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros infotainment touchscreen 360 degree camrea\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e 360-degree camera also has a blind view monitor function.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eOther feature highlights include an air purifier, an 8-speaker Harman Kardon system, an on-board ‘hey Kia’ voice assistant,a 360-degree camera with a blind view monitor and a large dual-pane panoramic sunroof, which really brightens up an already airy cabin.\u003c/p\u003e\u003cp\u003eThere are a few clever little details, too, like the ability to lower and raise the windows using the key and the connectivity app. The app also has remote engine start. There are resizable cup holders that click open with the touch of a button and sun shades that flip to the side and slide backward.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros panoramic runroof\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Panoramic Sunroof.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros panoramic runroof\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eLarge dual-pane sunroof adds to the vast openess of the cabin. \u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe Syros also comes equipped with camera and radar-based ADAS with all the expected functionality, including smart cruise control with a stop-go function. We tested this and the lane keeping assist for a brief period, and it performed well with smooth interventions; however, we’ll know more when we put the Syros through our exhaustive road test. Other safety kit includes hill start assist, ABS with ESC and brake force assist, and 6 airbags.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros engine, gearbox options\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros engine\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Engine.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros engine\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e1.0-litre TGDi and 1.5-litre diesel (shown above) shared with the Sonet and Hyundai Venue.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Kia Syros is powered by the familiar 1.0 litre turbocharged gasoline direct injection (GDi) mated to a 7-speed dual-clutch auto or a 6-speed manual. While Hyundai has offered the 1.0 GDi with a manual, this combination is a first for Kia. Unlike many others in this segment, Kia also offers a diesel engine:a 1.5-litre unit that’s paired to either a 6-speed manual or a 6-speed sun and planetary (torque convertor) auto. The petrol and diesel autos also have three drive modes – Eco, Normal and Sport – as well as three traction modes – Snow, Sand and Mud – that alters the traction control sensitivity to enable better grip on loose surfaces.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros petrol performance and efficiency\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe 1.0 GDi engine puts out a maximum of 120hp at 6,000rpm and 172Nm between 1,500 and 4,000rpm. It has enough pep when paired with the DCT auto, and in our initial tests, we clocked a 0-100kph time of 11.63 seconds in Sport mode.\u003c/p\u003e\u003cp\u003eThere is some turbo lag under 1,500rpm and power drops off at about 5,200rpm. You can use the steering wheel paddles but the gearbox will upshift regardless, even in manual mode.\u003c/p\u003e\u003cp\u003eLeft to its own devices, the DCT tends to upshift early,and you’ll often find it downshifting when you prod the throttle a little more than normal. You get the impression that the early upshifts are a means to avoid a hefty fuel bill, but its claimed fuel efficiency figures of 18.20kpl for the manual and 17.68kpl for the auto aren’t as high as some competitors, or even the Sonet.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros front tracking\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Front_Quarter_Tracking.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros front tracking\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eBoth engines are reasonably quick, but in-cabin NVH levels are high. \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAt low speeds, gearshifts can be clunky at times, but the powertrain on the whole is refinedso long as it’s driven in a relaxed manner. Go slightly beyond, however, and things get quite vocal; even past 2,200rpm, the engine is quite audible inside which is a downer for a petrol unit. It could be due to low insulation along with the engine’s natural, gruff character as revs climb.\u003c/p\u003e\u003cp\u003eWe also drove the petrol manual for a short while and initial impressions are of a firm and springy clutch. Gear lever travel is smooth, though, with well-defined gates. For the enthusiastic driver, this powertrain combo will be fun; it’s easy to keep the engine in its power band with no software second guessing you. It’s also very tractable and you can bring speeds down to 25kph in fourth gear and pull away smoothly albeit slowly.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros diesel performance and efficiency\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros rear tracking\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Rear_Quarter_Tracking.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros rear tracking\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eDiesel\u0026#39;s low end torque means off the line response is good. \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe 1.5-litre diesel engine makes a maximum of 116hp at 4,000rpm and 250Nm of torque from 1,500-2,750rpm. It’s an engine we’ve come to like in the \u003ca href=\"https://www.autocarindia.com/cars/kia/sonet\"\u003e\u003cstrong\u003eSonet\u003c/strong\u003e\u003c/a\u003e, Seltos and the Hyundai cars, and it proves to be likeable here, too. Thanks to the low-end power, off-the-line response is very good and the auto gearbox’s shifts are smooth, if a bit lazy. Driving at a relaxed pace is where it’s very happy with ample torque on tap making overtaking easy. You don’t have to reach for the paddles or contend with multiple downshifts. It’s quick enough, too, and our initial tests showed a 0-100kph time of 13.88 seconds.\u003c/p\u003e\u003cp\u003eHowever, like the petrol engine,refinement is an issue here as well. You can hear the engine inside quite clearly post 2,500rpm, and once again, better insulation is the need of the hour.While both engines do not have that outright peppy character, it’s just fine given the clear comfort bias this car has, but that’s the very reason why NVH levels should have been better.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros ride and handling\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros corner\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Cornering.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros corner\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eTall-boy design means there is body roll while cornering.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Syros is a tall car with a heavy panoramic sunroof on top, so body roll, as expected, is present. If you do drive it enthusiastically around a corner, the body leans, but the damper’s initial compression is firm to limit this. However, this comes at the expense of a firm ride over ruts and potholes. The sharp edge is felt more on the diesel, but in both cars, the ruts never come crashing through.\u003c/p\u003e\u003cp\u003eSteering feel is good and it weighs up for a secure enough feel at triple digit speeds, but it could have been lighter at city speeds.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros price and buying\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-syros-prices-to-be-announced-on-february-1-434011\" title=\"Kia Syros prices to be announced on February 1\"\u003e\u003cstrong\u003ePrices for the Kia Syros\u003c/strong\u003e\u003c/a\u003e are yet to be announced, and it will be interesting to see how Kia positions it between the Sonet and Seltos. Given that narrow brand, Kia has beensmart in looking beyond a price differentiation and chosen instead to substantially differentiate the Syros’ character with a clear singular focus.\u003c/p\u003e\u003cp\u003eIt’s not your typical upright SUV, not an enthusiastic sporty driver and not really a highway car either, what with the high NVH levels at high speeds. What it is centred on is squarely comfort and conveniences, and it does those brilliantly.\u003c/p\u003e\u003cp\u003eThe NVH issue is a shame, as, given the comfort orientation, a silent cabin would be appreciated. It checks every other box apart from that, though. The seats are comfy, the cooled function is a welcome addition and the rear has ample leg and headroom, with the handy recline and sliding function. Equipment levels are very good with all the expected bits like climate control, large digital displays, a premium sound system, a full connectivity and ADAS suite, and the dual-pane panoramic sunroof.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Kia Syros air purifier\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/Kia_Syros_Air_Purifier.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Kia Syros air purifier\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAir purifier neatly tucked under the front centre armrest.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe interior design, too, is modern and fresh and looks nice and premium. The choice of petrol and diesel engines along with manual and automatic ’boxes is another plus point. So, while the radical styling will not go down well with everyone, for those who like it or are willing to look past it, there’s clearly plenty to like. Our cities are getting more congested and people are spending more time in traffic, so if you must contend with this in your own car, the compact, comfy and well-equipped Syros fits the bill perfectly.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-syros-bookings-open-at-rs-25000-434014\"\u003eKia Syros bookings open at Rs 25,000\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-syros-top-two-at-variants-in-high-demand-434341\"\u003eKia Syros top two AT variants in high demand\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/kia-seltos-accounts-for-465-percent-of-brand-total-india-sales-434364\"\u003eKia Seltos accounts for 46.5 percent of brand’s total India sales\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434379\"\u003e\u003cul id=\"tab-id-434379\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-434379\" href=\"#.\" rel=\"#tab-images-container-434379\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434379\" href=\"#.\" rel=\"#tab-videos-container-434379\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": null,
  "modifiedTime": null
}
