{
  "id": "e271a247-a0cf-4686-8d7d-cb6c96481ddc",
  "title": "Nissan ditches the V8 on 2025 Armada—what’s next? We asked their lead powertrain engineer",
  "link": "https://www.autoblog.com/news/nissan-ditches-the-v8-on-2025-armada-whats-next-we-asked-their-lead-powertrain-engineer",
  "description": "We spoke to Nissan’s lead powertrain engineer to find out what’s behind the big change and what it means for the Armada’s future.",
  "author": "Gabriel Ionica",
  "published": "Sat, 05 Oct 2024 22:18:19 GMT",
  "source": "https://www.autoblog.com/rss.xml",
  "categories": [
    "Nissan",
    "News"
  ],
  "byline": "Gabriel Ionica",
  "length": 3613,
  "excerpt": "We spoke to Nissan’s lead powertrain engineer to find out what’s behind the big change and what it means for the Armada’s future.",
  "siteName": "Autoblog: Car News, Reviews and Buying Guides",
  "favicon": "https://www.autoblog.com/site/images/apple-touch-icon-114x114-precomposed.png?v=2024-10-10-184209-e723606-000144",
  "text": "We spoke to Nissan’s lead powertrain engineer to find out what’s behind the big change and what it means for the Armada’s future. Nissan has recently unveiled a new engine for the upcoming 2025 Nissan Armada, designed with an emphasis on high torque. The twin-turbo VR35DDTT V6, producing 425 hp and 516 lb-ft of torque, is now the brand's torquiest engine, delivering 103 lb-ft more than the outgoing 5.6 L VK56VD V8's 413 lb-ft. We spoke to Nissan's powertrain engineer, Shuji Kojima, to get the inside scoop on how and why this new engine came to fruition.Nissan achieved more power and torque with a smaller V6 engine - how does that work?\"Customers wanted more torque in our biggest flagship, so we did it to satisfy their needs,\" Kojima-san said. With a 121.1-inch wheelbase, or just over 10 feet, the current generation Armada is a little more than a foot shorter than the beastly Ford Excursion. The upcoming Armada will reportedly have the same wheelbase, so why did Nissan forgo two cylinders for such a massive SUV? The secret lies in the turbos.\"A smaller engine with a turbo is better than a big naturally-aspirated V8 from acceleration, torque, and environmental standpoints,\" Kojima-san clarified.The GT-R played a significant role in the development of the Armada's new engineThe turbos are designed to be quieter than usual, thanks to a small groove Nissan added before the compressor, a nod to the Japanese-market Skyline model. The turbine wheels are made from Mar-M, a nickel-based superalloy commonly used in jet turbines for its exceptional resistance to extreme heat, corrosion, and oxidation. That reduction in turbo noise may be a step in the wrong direction for enthusiasts, who will take any opportunity to bask in the glory of that sweet turbo whistle under the hood.The Armada's new engine took further inspiration from the Skyline by using a scavenger oil pump. This special type of pump was first used in the GT-R to keep the engine properly lubricated under high g-forces. While the Armada may not be a canyon carver, Nissan wants its sibling, the Patrol, to be a steep dune carver in the Middle East.Nissan twin-turbo V6NissanThe twin-turbo VR35DDTT V6 was tested in extreme conditions for proven reliability and efficiency\"The vehicle is good on-road but we wanted customers to be confident off-road too,\" Kojima-san said.To achieve that, Nissan reportedly tested the new Armada in 13 US states with varying environments, from a Minnesota winter to a Death Valley summer. The benefits from that scavenger oil pump should then also translate to some of our steeper off-road climbs if the sheer size of the thing doesn't tip it over the edge.Thanks to a redesigned intake port shape and better-optimized air and fuel flow, emissions should also be lower. That means you can have more power and better fuel economy and keep the environment happy, too!There could be exciting future uses for the new VR35DDTT V6 engineOverall, it seems Nissan is looking to leave a mark with its new twin-turbo VR35DDTT V6 engine and the Armada as a whole. According to Kojima-san, it's a balance of luxury and reliability, and we're all for that combination.There is always the possibility that this engine will make its way to passenger vehicles in the future, as the outgoing VK56VD V8 also powered the Infiniti M56 and Q70. Kojima-san was unable to give a concrete answer as that isn't his decision to make but if it were up to him, he would gladly see it used in the Z or the Titan if Nissan chose to reboot the latter. Another 25 hp and 166 lb-ft of torque is what the Z needs to start selling.",
  "image": "https://www.autoblog.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjA5Nzc3MzU1MTU2MTA0ODcz/2025-nissan-armada-exterior.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWe spoke to Nissan’s lead powertrain engineer to find out what’s behind the big change and what it means for the Armada’s future. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.autoblog.com/nissan/\"\u003eNissan\u003c/a\u003e has recently unveiled a new engine for the upcoming 2025 \u003ca href=\"https://www.autoblog.com/reviews/2025-nissan-armada-vs-2024-nissan-armada\"\u003eNissan Armada\u003c/a\u003e, designed with an emphasis on high torque. The twin-turbo VR35DDTT V6, producing 425 hp and 516 lb-ft of torque, is now the brand\u0026#39;s torquiest engine, delivering 103 lb-ft more than the outgoing 5.6 L VK56VD V8\u0026#39;s 413 lb-ft. We spoke to Nissan\u0026#39;s powertrain engineer, Shuji Kojima, to get the inside scoop on how and why this new engine came to fruition.\u003c/p\u003e\u003ch2 id=\"nissan-achieved-more-power-and-torque-with-a-smaller-v6-engine-how-does-that-work\"\u003eNissan achieved more power and torque with a smaller V6 engine - how does that work?\u003c/h2\u003e\u003cp\u003e\u0026#34;Customers wanted more torque in our biggest flagship, so we did it to satisfy their needs,\u0026#34; Kojima-san said. \u003c/p\u003e\u003cp\u003eWith a 121.1-inch wheelbase, or just over 10 feet, the current generation Armada is a little more than a foot shorter than the beastly \u003ca href=\"https://www.autoblog.com/ford/\"\u003eFord\u003c/a\u003e Excursion. The upcoming Armada will reportedly have the same wheelbase, so why did Nissan forgo two cylinders for such a massive SUV? The secret lies in the turbos.\u003c/p\u003e\u003cp\u003e\u0026#34;A smaller engine with a turbo is better than a big naturally-aspirated V8 from acceleration, torque, and environmental standpoints,\u0026#34; Kojima-san clarified.\u003c/p\u003e\u003cphoenix-super-link href=\"https://www.autoblog.com/news/2025-ford-expedition-tremor-conquering-trails-or-just-for-show\" onclick=\"return window.phoenixTrackClickEvent(this, event);\" phx-track-id=\"Embed Card Click\"\u003e\u003c/phoenix-super-link\u003e\u003ch2 id=\"the-gt-r-played-a-significant-role-in-the-development-of-the-armada-s-new-engine\"\u003eThe GT-R played a significant role in the development of the Armada\u0026#39;s new engine\u003c/h2\u003e\u003cp\u003eThe turbos are designed to be quieter than usual, thanks to a small groove Nissan added before the compressor, a nod to the Japanese-market Skyline model. The turbine wheels are made from Mar-M, a nickel-based superalloy commonly used in jet turbines for its exceptional resistance to extreme heat, corrosion, and oxidation. That reduction in turbo noise may be a step in the wrong direction for enthusiasts, who will take any opportunity to bask in the glory of that sweet turbo whistle under the hood.\u003c/p\u003e\u003cp\u003eThe Armada\u0026#39;s new engine took further inspiration from the Skyline by using a scavenger oil pump. This special type of pump was first used in the GT-R to keep the engine properly lubricated under high g-forces. While the Armada may not be a canyon carver, Nissan wants its sibling, the Patrol, to be a steep dune carver in the Middle East.\u003c/p\u003e\u003cdiv\u003e\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\u003cphoenix-picture\u003e\u003ca\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.webp 380w, https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.webp 620w, https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.webp 700w\"/\u003e\u003csource sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_380/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.jpg 380w, https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_620/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.jpg 620w, https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_700/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.jpg 700w\"/\u003e\u003cimg alt=\"Nissan twin-turbo V6\" decoding=\"async\" src=\"https://www.autoblog.com/.image/t_share/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.jpg\" data-src=\"https://www.autoblog.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_700/MjA5Nzc3NDIwNjU0MzU2MTM3/nissan-twin-turbo-v6.jpg\" height=\"4433\" width=\"6039\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" itemprop=\"contentUrl url\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/phoenix-picture\u003e\u003cfigcaption\u003e\u003cp itemprop=\"caption\"\u003eNissan twin-turbo V6\u003c/p\u003e\u003cp itemprop=\"author\"\u003e\u003cspan\u003eNissan\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003ch2 id=\"the-twin-turbo-vr35ddtt-v6-was-tested-in-extreme-conditions-for-proven-reliability-and-efficiency\"\u003eThe twin-turbo VR35DDTT V6 was tested in extreme conditions for proven reliability and efficiency\u003c/h2\u003e\u003cp\u003e\u0026#34;The vehicle is good on-road but we wanted customers to be confident off-road too,\u0026#34; Kojima-san said.\u003c/p\u003e\u003cp\u003eTo achieve that, Nissan reportedly tested the new Armada in 13 US states with varying environments, from a Minnesota winter to a Death Valley summer. The benefits from that scavenger oil pump should then also translate to some of our steeper off-road climbs if the sheer size of the thing doesn\u0026#39;t tip it over the edge.\u003c/p\u003e\u003cp\u003eThanks to a redesigned intake port shape and better-optimized air and fuel flow, emissions should also be lower. That means you can have more power and better fuel economy and keep the environment happy, too!\u003c/p\u003e\u003cphoenix-super-link href=\"https://www.autoblog.com/news/could-lexus-be-building-a-true-drivers-car-for-enthusiasts\" onclick=\"return window.phoenixTrackClickEvent(this, event);\" phx-track-id=\"Embed Card Click\"\u003e\u003c/phoenix-super-link\u003e\u003ch2 id=\"there-could-be-exciting-future-uses-for-the-new-vr35ddtt-v6-engine\"\u003eThere could be exciting future uses for the new VR35DDTT V6 engine\u003c/h2\u003e\u003cp\u003eOverall, it seems Nissan is looking to leave a mark with its new twin-turbo VR35DDTT V6 engine and the Armada as a whole. According to Kojima-san, it\u0026#39;s a balance of luxury and reliability, and we\u0026#39;re all for that combination.\u003c/p\u003e\u003cp\u003eThere is always the possibility that this engine will make its way to passenger vehicles in the future, as the outgoing VK56VD V8 also powered the \u003ca href=\"https://www.autoblog.com/infiniti/\"\u003eInfiniti\u003c/a\u003e M56 and Q70. Kojima-san was unable to give a concrete answer as that isn\u0026#39;t his decision to make but if it were up to him, he would gladly see it used in the Z or the Titan if Nissan chose to reboot the latter. Another 25 hp and 166 lb-ft of torque is what the Z needs to start selling.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-05T22:18:19Z",
  "modifiedTime": null
}
