{
  "id": "e8261a9f-ce5f-409a-834b-7555d0bb7fc6",
  "title": "Build the Perfect BMW 02 With This Collection of BMW and Alpina Parts",
  "link": "https://www.bmwblog.com/2025/01/06/bmw-02-series-alpina-parts-auction/",
  "description": "Online car auction sites like Bring a Trailer aren’t just limited to selling the finished product. Today, you can find everything from illuminated dealership signs to racing flags and collectible artwork. Of course, you can... First published by https://www.bmwblog.com",
  "author": "Steven Paul",
  "published": "Mon, 06 Jan 2025 13:00:54 +0000",
  "source": "https://feeds.feedburner.com/BmwBlog",
  "categories": [
    "News",
    "alpina",
    "ALPINA 2002",
    "BMW Alpina"
  ],
  "byline": "Steven Paul",
  "length": 2518,
  "excerpt": "Here's a rare collection of vintage BMW 02 Series and Alpina parts on Bring a Trailer. Explore over 200 photos of these unique components",
  "siteName": "BMW BLOG",
  "favicon": "https://www.bmwblog.com/android-icon-192x192.png",
  "text": "Online car auction sites like Bring a Trailer aren’t just limited to selling the finished product. Today, you can find everything from illuminated dealership signs to racing flags and collectible artwork. Of course, you can also find a ton of different parts. From Porsche bucket seats to built engines, scouring an auction site can be a project car DIYer’s dream. If you fall into that category yourself – and particularly if you have a penchant for vintage Alpina and BMW parts, or a project 1966-1971 02 Series of your own – you’ll love a collection of old BMW and Alpina parts that just popped up on Bring a Trailer.It’s Practically the BMW 02 Series Starter KitEven those outside the immediate 02 community – myself included – will see a handful of parts that every good BMW 02 seems to require. I’m talking about stuff like Hella fog lights, a wooden shift knob (in this case, Alpina-sourced), and Recaro bucket seats. A full set (five) of Alpina wheels are included, recently reconditioned and sporting new Pirelli tires.The collection of BMW and Alpina parts has a lot of rare and interesting components – like an allegedly new old-stock (NOS) close-ratio steering rack. For those unaware, the 02 came with a standard steering ratio and a quicker, close-ratio steering box (sometimes referred to as q/r, for quick-ratio). These are pricy but offer great at-speed turn-in. An additional expense – as one owner puts it – is “no-fun grunting and wrenching” at parking lot speeds.In short: bring your own 02, fix yourself up with these on-auction parts, and you’ve got what some would consider the true Ultimate Driving Machine. Original Alpina booklets, a nice pair of Coco floormats, twin Weber carbs, and a Momo-for-Alpina steering wheel are just some of the other highlights. We could endlessly list the goodies, especially when it includes awesome extras like a framed Alpina jacket with in-period motorsport pictures.Get Them While You canWith a healthy mix of NOS parts and quality aftermarket components, and over 200 photos in the listing’s gallery, this pile of parts is certain to garner attention from just the right person – and hopefully, make the seller and buyer happy. A word of caution for anyone who plans to bid – the parts are currently in the Netherlands, and probably won’t be cheap to ship. Oh – and the cool green 02 shell pictured is, sadly, not included, but a crate to ship the stuff is. The auction ends on Saturday, January 11 and is viewable here: collection of BMW and Alpina parts.",
  "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/06/2025-ALPINA-B3-GT-23.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv itemprop=\"description\"\u003e\u003cp\u003eOnline car auction sites like Bring a Trailer aren’t just limited to selling the finished product. Today, you can find everything from illuminated dealership signs to racing flags and collectible artwork. Of course, you can also find a ton of different parts. From Porsche bucket seats to built engines, scouring an auction site can be a project car DIYer’s dream. If you fall into that category yourself – and particularly if you have a penchant for vintage Alpina and BMW parts, or a project 1966-1971 02 Series of your own – you’ll love a collection of old BMW and Alpina parts that just popped up on Bring a Trailer.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eIt’s Practically the BMW 02 Series Starter Kit\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e\u003ca href=\"https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti.jpg\"\u003e\u003cimg decoding=\"async\" src=\"https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-750x500.jpg\" data-src=\"https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-750x500.jpg\" alt=\"\" width=\"750\" height=\"500\" data-srcset=\"https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-750x500.jpg 750w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-768x512.jpg 768w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-1024x683.jpg 1024w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-300x200.jpg 300w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti.jpg 1900w\" data-sizes=\"(max-width: 750px) 100vw, 750px\" srcset=\"https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-750x500.jpg 750w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-768x512.jpg 768w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-1024x683.jpg 1024w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti-300x200.jpg 300w, https://cdn.bmwblog.com/wp-content/uploads/2016/08/1970-BMW-ALPINA-2002ti.jpg 1900w\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEven those outside the immediate 02 community – myself included – will see a handful of parts that every good BMW 02 seems to require. I’m talking about stuff like Hella fog lights, a wooden shift knob (in this case, Alpina-sourced), and Recaro bucket seats. A full set (five) of Alpina wheels are included, recently reconditioned and sporting new Pirelli tires.\u003c/p\u003e\u003cp\u003eThe collection of BMW and Alpina parts has a lot of rare and interesting components – like an allegedly new old-stock (NOS) close-ratio steering rack. For those unaware, the 02 came with a standard steering ratio and a quicker, close-ratio steering box (sometimes referred to as q/r, for quick-ratio). These are pricy but offer great at-speed turn-in. An additional expense – as one owner puts it – is “no-fun grunting and wrenching” at parking lot speeds.\u003c/p\u003e\u003cp\u003eIn short: bring your own 02, fix yourself up with these on-auction parts, and you’ve got what some would consider the true Ultimate Driving Machine. Original Alpina booklets, a nice pair of Coco floormats, twin Weber carbs, and a Momo-for-Alpina steering wheel are just some of the other highlights. We could endlessly list the goodies, especially when it includes awesome extras like a framed Alpina jacket with in-period motorsport pictures.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eGet Them While You can\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eWith a healthy mix of NOS parts and quality aftermarket components, and over 200 photos in the listing’s gallery, this pile of parts is certain to garner attention from just the right person – and hopefully, make the seller and buyer happy. A word of caution for anyone who plans to bid – the parts are currently in the Netherlands, and probably won’t be cheap to ship. Oh – and the cool green 02 shell pictured is, sadly, not included, but a crate to ship the stuff is. The auction ends on Saturday, January 11 and is viewable here: \u003ca href=\"https://bringatrailer.com/listing/parts-4/\" target=\"_blank\" rel=\"noopener nofollow\"\u003ecollection of BMW and Alpina parts\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-06T13:00:54Z",
  "modifiedTime": "2025-01-06T00:37:53Z"
}
