{
  "id": "efdb51be-478b-4fb6-b457-558390a5bf44",
  "title": "Honda Activa e: price won’t be dependent on govt subsidy",
  "link": "https://www.autocarindia.com/bike-news/honda-activa-e-price-wont-be-dependent-on-govt-subsidy-433713#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "At a time when several OEMs are pushing for continued government support in the form of demand incentives for faster electric vehicle adoption, Honda Motorcycle \u0026 Scooter India (HMSI) is developing its EV portfolio in such a way that the product remains sustainable and its prices are competitive even without government subsidies.  Activa e: and QC1 are the first set of electric two-wheelers by HMSI While Activa e: has removable batteries, QC1 has a fixed battery Bookings for both these e-scooters will start in January Honda Activa e:, QC1 pricing to be revealed next year “We developed our products, keeping aside any kind of subsidy. We develop everything without any government intervention in terms of our products. Our pricing strategy will not be dependent on any government subsidies,” said Yogesh Mathur, director for sales and marketing at HMSI, while launching the company’s first set of electric two-wheelers. Government subsidies in the form of demand incentives and waiver of registration fees have been very instrumental in driving the early-stage adoption of electric two-wheelers and three-wheelers. The Centre has been providing incentives since 2015 through FAME, EMPS and PM E-Drive schemes, and several OEMs have been saying that subsidies need to be continued for the industry’s sustained growth.  Earlier this year, Hero MotoCorp CEO Niranjan Gupta said the EV market is still in its early stages, and he believed that subsidies will be necessary for a while to help the industry grow. Once it reaches a point where it can sustain itself financially, subsidies can be gradually reduced, he had said. Also See: Honda QC1 electric scooter revealed alongside Activa e: Honda has introduced the Activa e: and QC1 as the first set of its electric two-wheelers for the Indian market. Activa e: comes with a swappable battery solution, and the QC1 has a fixed battery. The company has yet to announce the pricing for both models.  Currently, the government’s 2-year PM E-Drive scheme provides a subsidy of Rs 5,000 per kWh to electric two-wheelers with fixed batteries, subject to a cap of Rs 10,000 per vehicle. The subsidy will be tapered down to Rs 2,500 per kWh with a cap of Rs 5,000 per vehicle from April 2025. Senior government officials said the incentives are unlikely to be extended beyond FY2026.  “We will start the booking for both the models in January. At that time, we will be announcing the price because we need to gauge in terms of the response from the market and price it accordingly. But the pricing will be affordable,” he said. Also See: Honda Activa e: revealed with 102km range",
  "author": "Kiran Murali",
  "published": "Sat, 30 Nov 2024 07:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Kiran Murali",
  "length": 2690,
  "excerpt": "Honda says pricing for both the Activa e: and QC1 will be \u0026amp;#8216;affordable\u0026amp;#8217;.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Honda says pricing for both the Activa e: and QC1 will be ‘affordable’. At a time when several OEMs are pushing for continued government support in the form of demand incentives for faster electric vehicle adoption, Honda Motorcycle \u0026 Scooter India (HMSI) is developing its EV portfolio in such a way that the product remains sustainable and its prices are competitive even without government subsidies. Activa e: and QC1 are the first set of electric two-wheelers by HMSIWhile Activa e: has removable batteries, QC1 has a fixed batteryBookings for both these e-scooters will start in JanuaryHonda Activa e:, QC1 pricing to be revealed next year“We developed our products, keeping aside any kind of subsidy. We develop everything without any government intervention in terms of our products. Our pricing strategy will not be dependent on any government subsidies,” said Yogesh Mathur, director for sales and marketing at HMSI, while launching the company’s first set of electric two-wheelers.Government subsidies in the form of demand incentives and waiver of registration fees have been very instrumental in driving the early-stage adoption of electric two-wheelers and three-wheelers. The Centre has been providing incentives since 2015 through FAME, EMPS and PM E-Drive schemes, and several OEMs have been saying that subsidies need to be continued for the industry’s sustained growth. Earlier this year, Hero MotoCorp CEO Niranjan Gupta said the EV market is still in its early stages, and he believed that subsidies will be necessary for a while to help the industry grow. Once it reaches a point where it can sustain itself financially, subsidies can be gradually reduced, he had said.Also See: Honda QC1 electric scooter revealed alongside Activa e:Honda has introduced the Activa e: and QC1 as the first set of its electric two-wheelers for the Indian market. Activa e: comes with a swappable battery solution, and the QC1 has a fixed battery. The company has yet to announce the pricing for both models. Currently, the government’s 2-year PM E-Drive scheme provides a subsidy of Rs 5,000 per kWh to electric two-wheelers with fixed batteries, subject to a cap of Rs 10,000 per vehicle. The subsidy will be tapered down to Rs 2,500 per kWh with a cap of Rs 5,000 per vehicle from April 2025. Senior government officials said the incentives are unlikely to be extended beyond FY2026. “We will start the booking for both the models in January. At that time, we will be announcing the price because we need to gauge in terms of the response from the market and price it accordingly. But the pricing will be affordable,” he said.Also See: Honda Activa e: revealed with 102km rangeVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241129022528_HM.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eHonda says pricing for both the Activa e: and QC1 will be ‘affordable’. \u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp dir=\"ltr\"\u003e\u003cspan id=\"docs-internal-guid-a749d0c8-7fff-1464-498d-fed526b605c8\"\u003eAt a time when several OEMs are pushing for continued government support in the form of demand incentives for faster electric vehicle adoption, Honda Motorcycle \u0026amp; Scooter India (HMSI) is developing its EV portfolio in such a way that the product remains sustainable and its prices are competitive even without government subsidies. \u003c/span\u003e\u003c/p\u003e\u003col dir=\"ltr\"\u003e\u003cli role=\"presentation\"\u003e\u003cstrong\u003eActiva e: and QC1 are the first set of electric two-wheelers by HMSI\u003c/strong\u003e\u003c/li\u003e\u003cli role=\"presentation\"\u003e\u003cstrong\u003eWhile Activa e: has removable batteries, QC1 has a fixed battery\u003c/strong\u003e\u003c/li\u003e\u003cli role=\"presentation\"\u003e\u003cstrong\u003eBookings for both these e-scooters will start in January\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003eHonda Activa e:, QC1 pricing to be revealed next year\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e“We developed our products, keeping aside any kind of subsidy. We develop everything without any government intervention in terms of our products. Our pricing strategy will not be dependent on any government subsidies,” said Yogesh Mathur, director for sales and marketing at HMSI, while launching the company’s first set of electric two-wheelers.\u003c/p\u003e\u003cp\u003eGovernment subsidies in the form of demand incentives and waiver of registration fees have been very instrumental in driving the early-stage adoption of electric two-wheelers and three-wheelers. The Centre has been providing incentives since 2015 through FAME, EMPS and PM E-Drive schemes, and several OEMs have been saying that subsidies need to be continued for the industry’s sustained growth. \u003c/p\u003e\u003cp\u003eEarlier this year, Hero MotoCorp CEO Niranjan Gupta said the EV market is still in its early stages, and he believed that subsidies will be necessary for a while to help the industry grow. Once it reaches a point where it can sustain itself financially, subsidies can be gradually reduced, he had said.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan id=\"docs-internal-guid-a749d0c8-7fff-1464-498d-fed526b605c8\"\u003eAlso See: \u003c/span\u003e\u003ca href=\"https://www.autocarindia.com/bike-news/honda-qc1-electric-scooter-revealed-alongside-activa-e-433687\"\u003eHonda QC1 electric scooter revealed alongside Activa e:\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eHonda has introduced the Activa e: and QC1 as the first set of its electric two-wheelers for the Indian market. Activa e: comes with a swappable battery solution, and the QC1 has a fixed battery. The company has yet to announce the pricing for both models. \u003c/p\u003e\u003cp\u003eCurrently, the government’s 2-year PM E-Drive scheme provides a subsidy of Rs 5,000 per kWh to electric two-wheelers with fixed batteries, subject to a cap of Rs 10,000 per vehicle. The subsidy will be tapered down to Rs 2,500 per kWh with a cap of Rs 5,000 per vehicle from April 2025. Senior government officials said the incentives are unlikely to be extended beyond FY2026. \u003c/p\u003e\u003cp\u003e“We will start the booking for both the models in January. At that time, we will be announcing the price because we need to gauge in terms of the response from the market and price it accordingly. But the pricing will be affordable,” he said.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan id=\"docs-internal-guid-a749d0c8-7fff-1464-498d-fed526b605c8\"\u003eAlso See: \u003c/span\u003e\u003ca href=\"https://www.autocarindia.com/bike-news/honda-activa-e-revealed-with-102km-range-433685\"\u003eHonda Activa e: revealed with 102km range\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-433713\"\u003e\u003cul id=\"tab-id-433713\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-433713\" href=\"#.\" rel=\"#tab-videos-container-433713\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-30T07:00:00+05:30",
  "modifiedTime": null
}
