{
  "id": "f3f69125-251b-4597-beff-8df8f308ead3",
  "title": "Rare Rides Icons: The Cadillac Eldorado, Distinctly Luxurious (Part LI)",
  "link": "https://www.thetruthaboutcars.com/cars/features/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-li-44512534?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
  "description": "The 1967 Cadillac Eldorado was a styling revelation when it arrived, with front-wheel drive, covered headlamps, and sleek styling devoid of flim-flam. But the original look didn’t last long, as annual styling updates and regulatory changes made their marks immediately. While the 1968 was relatively the same as the ‘67 (with a larger engine), the 1969 version lost its covered headlamps, special ventilated wheel covers, received an ugly reversing lamp, and adopted the corporate dashboard used by the rest of the Cadillac lineup. And there were even more changes on the way for 1970 as the eighth generation prepared to fade away.",
  "author": "Corey Lewis",
  "published": "Fri, 07 Mar 2025 23:30:00 +0000",
  "source": "https://www.thetruthaboutcars.com/feed/",
  "categories": [
    "Features"
  ],
  "byline": "Corey Lewis",
  "length": 9328,
  "excerpt": "The 1967 Cadillac Eldorado was a styling revelation when it arrived, with front-wheel drive, covered headlamps, and sleek styling devoid of flim-flam. But th…",
  "siteName": "Ttac",
  "favicon": "https://cdn-fastly.thetruthaboutcars.com/resources/themes/ttac/imgs-responsive/ttac-apple-touch-icon.png",
  "text": "Published:  March 7th, 2025 The 1967 Cadillac Eldorado was a styling revelation when it arrived, with front-wheel drive, covered headlamps, and sleek styling devoid of flim-flam. But the original look didn’t last long, as annual styling updates and regulatory changes made their marks immediately. While the 1968 was relatively the same as the ‘67 (with a larger engine), the 1969 version lost its covered headlamps, special ventilated wheel covers, received an ugly reversing lamp, and adopted the corporate dashboard used by the rest of the Cadillac lineup. And there were even more changes on the way for 1970 as the eighth generation prepared to fade away. (Note: The silver Eldorado pictured is the 1970, while the white example is a 1969.)The big news for the 1970 Fleetwood Eldorado was the arrival of another V8 that was larger than ever! The 472 (7.7L) V8 that arrived in 1968 was the brand-wide replacement for the 429 V8, which maxed out available displacement given its 1940s engine architecture. The new V8 was designed with fewer moving parts, fewer seals and gaskets, and was meant to provide low-end torque while consuming tons of fuel. It also managed to have a greater displacement than any of its competition, which topped out at a measly 460 cubic inches (Ford/Lincoln). From the beginning of its design, the 472 had an allowance for an increase in displacement. Cadillac put this to use almost immediately with the 500 (8.2L) V8 for the 1970 Eldorado. While the 472 engine used a 103.1mm stroke, the 500 increased that to 109.3mm. Power figures increased from 375 horses to an even 400 with the larger engine. Torque also increased, from 525 lb-ft to 550 lb-ft. A sign of the times, the compression ratio fell from 10:5:1 to 10:0:1.  Unfortunately, compression would continue to fall through the Seventies as emissions regulations strangled engines. Domestic manufacturers were unwilling to give up displacement bragging rights, or spend lots of cash on the development of efficient engines. The Eldorado received special bragging rights of its own in 1970 as the exclusive purveyor of the 500 V8. The engine would remain unique to the Eldorado until 1975 when it would spread across most of the lineup (save for Seville). The 500 was the largest V8 engine ever to power a production car, a fact Cadillac was keen to point out in its marketing. That size record stands today. Looking past the huge engine, customers found two new major options in 1970; both of them firsts for Eldorado! The first was a new glass sunroof installed by ASC (1965-2017), the supplier of holes in roofs and convertible conversions for many manufacturers for decades. The second was a new innovation called Trackmaster, a primitive ABS system. Trackmaster operated only on the rear wheels, and was an Eldorado exclusive in 1970. Detail is a bit scarce, but the system spread to the rest of the rear-wheel drive Cadillac line in 1971. Braking systems were under heavy development at the time, and just a year after Eldorado the Imperial of 1971 debuted with the first-ever four-wheel electronically controlled ABS.  There were a few more visual changes in the Eldorado’s final year, led by another new grille texture at the front. The egg crate shape remained, but each section was vertically oriented instead of horizontal. The new vertical segments were highlighted via thicker horizontal chrome bars to make the front end look more chromed. Underneath the Cadillac script logo in the grille was a new badge that read 8.2 LITRE. It was the first time a displacement in liters appeared on a Cadillac. At either corner, the indicator lamps that appeared for 1968 were revised. They became more rounded than prior iterations, and wore new shield decor to match other Cadillac models. From the front, onlookers could tell it was a Fleetwood product because the wreath was present with the Cadillac crest. Edits along the side flanks included new (required) reflective amber lenses within the lower indicator repeater ahead of the front wheel. The side character line along the middle of the door was newly highlighted by a spear-shaped rub strip finished in chrome. This strip took the real estate previously used by ELDORADO block lettering on the fender, so that was relocated to the fender’s lower edge. At the rear corners the lighted Cadillac crest and wreath ornamentation that functioned as a running lamp gained an additional red reflector within the lens, as required by law. This deepened the color of the lens, and made it much more visible. Perhaps to simplify the visuals and compete less with the reflector, the tail lamp arrangement was revised for 1970. The rear side portions of the brake lamps were removed, and filled in with a body colored panel on either side. In the middle, the space formerly occupied by a chrome trim strip became the new lens of the brake lamp. From a surface area perspective the 1970 Eldorado’s rear lighting was absolutely minimalist. Between the tail lamps were revised rear bumper reflectors, placed into housings that stuck out from the bumper’s surface. Interior reworks were more limited in 1970 since it was the Eldorado’s final year, and the rest of the Cadillac line was also due for replacement. There was more wood tone, which took on a new burled pattern. Most interior surfaces that were chrome trim or black plastic received wood tone in 1970. There was a new steering wheel with a simplified horn pad that looked more modern but also cheaper. At the passenger side, the Cadillac script badge moved to the center of the trim panel. Door panels remained the same as in 1969 apart from the new wood trim. Seats were the same too, with optional bench or center console at the front, and a couple of new fabric patterns. The buyer of the 1970 shown opted for the bench seat, and a tweedy black and white houndstooth “Duplex” cloth, one of seven available colors. With revised lighting and a big new engine, GM set the eighth-gen Eldorado out for sale one final time in 1970. As an aged model, it no longer received pride of place at the front of the model brochure. The following year would see the Eldorado folded back into the same-same corporate styling of the rest of the line. 1971 could easily be considered the start of a model slide for Eldorado that would last about 30 odd years. In our next entry, we’ll review pricing and sales figures for this very successful personal luxury coupe. [Images: GM, seller, seller]Become a TTAC insider. the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by subscribing to our newsletter.",
  "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/03/07/17271/social-44512534.jpg?size=1200x628",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                    \u003cp\u003e\u003cspan\u003e \u003cstrong\u003ePublished: \u003c/strong\u003e March 7th, 2025\u003c/span\u003e\u003c/p\u003e                        \u003c/div\u003e\u003cdiv data-tr_zone=\"Activity Body\"\u003e\n                        \n\n                        \n\n\n                            \n                            \n                            \n                                        \n\n                            \u003cdiv\u003e\n                                \u003cp\u003eThe 1967 Cadillac Eldorado was a styling revelation when it arrived, with front-wheel drive, covered headlamps, and sleek styling devoid of flim-flam. But the original look didn’t last long, as annual styling updates and regulatory changes made their marks immediately. While the 1968 was relatively the same as the ‘67 (with a larger engine), the \u003cu\u003e \u003ca href=\"https://www.thetruthaboutcars.com/cars/features/rare-rides-icons-the-cadillac-eldorado-distinctly-luxurious-part-l-44512366\"\u003e1969 version\u003c/a\u003e\u003c/u\u003e lost its covered headlamps, special ventilated wheel covers, received an ugly reversing lamp, and adopted the corporate dashboard used by the rest of the Cadillac lineup. And there were even more changes on the way for 1970 as the eighth generation prepared to fade away.\u003c/p\u003e\u003ccuttext\u003e\u003c/cuttext\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cdiv\u003e\n                                \u003cp\u003e\u003ci\u003e(Note: The silver Eldorado pictured is the 1970, while the white example is a 1969.)\u003c/i\u003e\u003c/p\u003e\u003cp\u003eThe big news for the 1970 Fleetwood Eldorado was the arrival of another V8 that was larger than ever! The 472 (7.7L) V8 that arrived in 1968 was the brand-wide replacement for the 429 V8, which maxed out available displacement given its 1940s engine architecture. The new V8 was designed with fewer moving parts, fewer seals and gaskets, and was meant to provide low-end torque while consuming tons of fuel. It also managed to have a greater displacement than any of its competition, which topped out at a measly 460 cubic inches (Ford/Lincoln).\u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n                    \n                            \n                            \n                            \n\n                            \u003cdiv\u003e\n                                \u003cp\u003eFrom the beginning of its design, the 472 had an allowance for an increase in displacement. Cadillac put this to use almost immediately with the 500 (8.2L) V8 for the 1970 Eldorado. While the 472 engine used a 103.1mm stroke, the 500 increased that to 109.3mm. \u003c/p\u003e\u003cp\u003ePower figures increased from 375 horses to an even 400 with the larger engine. Torque also increased, from 525 lb-ft to 550 lb-ft. A sign of the times, the compression ratio fell from 10:5:1 to 10:0:1. \u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                                \n                                \n\n                            \n                            \n                            \n\n                            \u003cp\u003eUnfortunately, compression would continue to fall through the Seventies as emissions regulations strangled engines. Domestic manufacturers were unwilling to give up displacement bragging rights, \u003ci\u003eor \u003c/i\u003espend lots of cash on the development of efficient engines. The Eldorado received special bragging rights of its own in 1970 as the exclusive purveyor of the 500 V8.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eThe engine would remain unique to the Eldorado until 1975 when it would spread across most of the lineup (save for Seville). The 500 was the largest V8 engine ever to power a production car, a fact Cadillac was keen to point out in its marketing. That size record stands today.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eLooking past the huge engine, customers found two new major options in 1970; both of them firsts for Eldorado! The first was a new glass sunroof installed by ASC (1965-2017), the supplier of holes in roofs and convertible conversions for many manufacturers for decades. The second was a new innovation called Trackmaster, a primitive ABS system.\u003c/p\u003e\n\n                    \n\n\n                    \n                            \n                            \n                            \n\n                            \u003cp\u003eTrackmaster operated only on the rear wheels, and was an Eldorado exclusive in 1970. Detail is a bit scarce, but the system spread to the rest of the rear-wheel drive Cadillac line in 1971. Braking systems were under heavy development at the time, and just a year after Eldorado the Imperial of 1971 debuted with the first-ever four-wheel electronically controlled ABS. \u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eThere were a few more visual changes in the Eldorado’s final year, led by another new grille texture at the front. The egg crate shape remained, but each section was vertically oriented instead of horizontal. The new vertical segments were highlighted via thicker horizontal chrome bars to make the front end look more chromed. Underneath the Cadillac script logo in the grille was a new badge that read 8.2 LITRE. It was the first time a displacement in liters appeared on a Cadillac.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eAt either corner, the indicator lamps that appeared for 1968 were revised. They became more rounded than prior iterations, and wore new shield decor to match other Cadillac models. From the front, onlookers could tell it was a Fleetwood product because the wreath was present with the Cadillac crest.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eEdits along the side flanks included new (required) reflective amber lenses within the lower indicator repeater ahead of the front wheel. The side character line along the middle of the door was newly highlighted by a spear-shaped rub strip finished in chrome. This strip took the real estate previously used by ELDORADO block lettering on the fender, so that was relocated to the fender’s lower edge.\u003c/p\u003e\n\n                    \n\n\n                    \n                            \n                            \n                            \n\n                            \u003cp\u003eAt the rear corners the lighted Cadillac crest and wreath ornamentation that functioned as a running lamp gained an additional red reflector within the lens, as required by law. This deepened the color of the lens, and made it much more visible. Perhaps to simplify the visuals and compete less with the reflector, the tail lamp arrangement was revised for 1970.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eThe rear side portions of the brake lamps were removed, and filled in with a body colored panel on either side. In the middle, the space formerly occupied by a chrome trim strip became the new lens of the brake lamp. From a surface area perspective the 1970 Eldorado’s rear lighting was absolutely minimalist. Between the tail lamps were revised rear bumper reflectors, placed into housings that stuck out from the bumper’s surface.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eInterior reworks were more limited in 1970 since it was the Eldorado’s final year, and the rest of the Cadillac line was also due for replacement. There was more wood tone, which took on a new burled pattern. Most interior surfaces that were chrome trim or black plastic received wood tone in 1970.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eThere was a new steering wheel with a simplified horn pad that looked more modern but also cheaper. At the passenger side, the Cadillac script badge moved to the center of the trim panel. Door panels remained the same as in 1969 apart from the new wood trim. Seats were the same too, with optional bench or center console at the front, and a couple of new fabric patterns. The buyer of the 1970 shown opted for the bench seat, and a tweedy black and white houndstooth “Duplex” cloth, one of seven available colors.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cp\u003eWith revised lighting and a big new engine, GM set the eighth-gen Eldorado out for sale one final time in 1970. As an aged model, it no longer received pride of place at the front of the model brochure. The following year would see the Eldorado folded back into the same-same corporate styling of the rest of the line. 1971 could easily be considered the start of a model slide for Eldorado that would last about 30 odd years. In our next entry, we’ll review pricing and sales figures for this very successful personal luxury coupe.\u003c/p\u003e\n\n                    \n\n\n\n                            \n                            \n                            \n\n                            \u003cdiv\u003e\n                                \u003cp\u003e[Images: GM, \u003cu\u003e \u003ca href=\"https://www.hemmings.com/classifieds/listing/1970-cadillac-eldorado-concord-nc-2784536\" rel=\"nofollow noopener\" target=\"_blank\"\u003eseller\u003c/a\u003e\u003c/u\u003e, \u003cu\u003e \u003ca href=\"https://www.classic.com/veh/1969-cadillac-eldorado-fleetwood-h9104385-nlNgd6p/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eseller\u003c/a\u003e\u003c/u\u003e]\u003c/p\u003e\u003cp\u003e\u003ci\u003eBecome a TTAC insider. the latest news, features, TTAC takes, and everything else that gets to the truth about cars first by \u003cu\u003e \u003ca href=\"https://email.thetruthaboutcars.com/newsletter-signup/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esubscribing to our newsletter\u003c/a\u003e\u003c/u\u003e.\u003c/i\u003e\u003c/p\u003e\n                            \u003c/div\u003e\n\n                    \n\n\n\n                            \n                            \n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-03-07T18:30:00-05:00",
  "modifiedTime": "2025-03-07T18:30:00-05:00"
}
