{
  "id": "f73f74a5-2801-42af-9f4c-d9bbc23f2a4f",
  "title": "Brave Mother Hunts Down Reckless Trucker",
  "link": "https://www.carscoops.com/2025/05/brave-mother-hunts-down-reckless-trucker/",
  "description": "A quick-thinking mother stopped a drug-positive truck driver, preventing a potential disaster on a South Australian road",
  "author": "Thanos Pappas",
  "published": "Sun, 04 May 2025 01:11:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Australia",
    "Dashcam",
    "Trucks",
    "Video"
  ],
  "byline": "Thanos Pappas",
  "length": 3908,
  "excerpt": "A quick-thinking mother stopped a drug-positive truck driver, preventing a potential disaster on a South Australian road",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "A quick-thinking mother stopped a drug-positive truck driver, preventing a potential disaster on a South Australian road May 3, 2025 at 21:11 by Thanos Pappas A young mother followed and stopped a swerving truck in South Australia. Police say the reckless truck driver tested positive for meth and cannabis. He now faces license suspension and court action for traffic violations. When you’re driving with your child in the back seat, the last thing you want is to find yourself in the path of a swerving, out-of-control truck. However, that’s exactly what happened to Carly Atkinson, who, instead of panicking or just staying safely out of the way, decided to take matters into her own hands. On March 25, in South Australia, Atkinson was traveling with her daughter when she noticed a truck swerving dangerously into oncoming traffic. Other vehicles scrambled to the narrow shoulder to avoid a collision. Most would have pulled over, called the authorities, and hoped for the best, but Atkinson wasn’t about to sit idly by. More: Hundreds Of Cars Shredded After Truck Spills Scrap Metal Load Across 19 Miles Dashcam footage captured the nerve-racking moments as the truck veered all over the road. As reported by 7News, Atkinson quickly contacted the police but, sensing the imminent danger, decided that waiting for help wasn’t an option. Instead, she chose to act. After following the truck for several miles, Atkinson watched as it finally came to a stop at Chain of Ponds. The driver tried to make a right turn at an intersection, but this is where she decided to make her move. Without hesitation, Atkinson leapt from her car, walked straight up to the truck, and took control of the situation. She initially asked the driver if he was alright. He responded that he was “a bit lost,” prompting her to request that he turn off the engine so they could speak more clearly. Once the truck was off, she explained the danger he posed and, without missing a beat, requested his keys. She didn’t just grab the keys and walk away, though. Atkinson also made sure to hold onto the driver’s logbook until the police arrived, making sure all necessary evidence was secured. It didn’t take long for the police to arrive on the scene. The 34-year-old driver was tested and found to be under the influence of methamphetamine and cannabis, which, needless to say, should disqualify anyone from operating a large vehicle, especially one as dangerous as a heavy truck. More: Pet Kangaroo Sheila Wrecks Havoc On U.S. Highway After Escaping Bikini Bottom Zoo A South Australian Police spokesperson confirmed that the driver was issued an immediate 24-hour driving ban and a three-month license suspension. He is expected to face court, where further penalties could be imposed. According to the traffic laws of South Australian, double trucks are not permitted in the North East Road where the incident occurred. Thankfully, due to Atkinson’s quick thinking and bravery, a potential disaster was averted. Let’s hope this trucker’s days of driving under the influence are officially over. Screenshot 7News Australia / YouTube",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                        \u003cp\u003e\n                            A quick-thinking mother stopped a drug-positive truck driver, preventing a potential disaster on a South Australian road                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003eMay 3, 2025 at 21:11\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1.webp 2450w, https://www.carscoops.com/wp-content/uploads/webp/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-1536x863.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-2048x1151.webp 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1.jpg 2450w, https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-768x432.jpg 768w, https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-1536x863.jpg 1536w, https://www.carscoops.com/wp-content/uploads/2025/05/Adelaide-Hills-mother-stops-drugged-driver-caught-on-camera-driving-dangerously-7NEWS-main-1-2048x1151.jpg 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" Brave Mother Hunts Down Reckless Trucker\" width=\"2450\" height=\"1377\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/thanos-pappas/\"\u003e\u003cspan\u003eThanos Pappas\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/div\u003e\u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eA young mother followed and stopped a swerving truck in South Australia.\u003c/li\u003e\n\n\n\n\u003cli\u003ePolice say the reckless truck driver tested positive for meth and cannabis.\u003c/li\u003e\n\n\n\n\u003cli\u003eHe now faces license suspension and court action for traffic violations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eWhen you’re driving with your child in the back seat, the last thing you want is to find yourself in the path of a swerving, out-of-control \u003ca href=\"https://www.carscoops.com/tag/trucks\"\u003etruck\u003c/a\u003e. However, that’s exactly what happened to Carly Atkinson, who, instead of panicking or just staying safely out of the way, decided to take matters into her own hands.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eOn March 25, in South \u003ca href=\"https://www.carscoops.com/tag/australia/\"\u003eAustralia\u003c/a\u003e, Atkinson was traveling with her daughter when she noticed a truck swerving dangerously into oncoming traffic. Other vehicles scrambled to the narrow shoulder to avoid a collision. Most would have pulled over, called the authorities, and hoped for the best, but Atkinson wasn’t about to sit idly by.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2025/05/trail-of-destruction-truck-spills-metal-shards-on-a-busy-highway-causing-hundreds-of-tire-punctures/\"\u003eHundreds Of Cars Shredded After Truck Spills Scrap Metal Load Across 19 Miles\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eDashcam footage captured the nerve-racking moments as the truck veered all over the road. As reported by \u003ca href=\"https://7news.com.au/news/sa/adelaide-hills-mother-stops-dangerous-truckie-in-his-tracks-after-alleged-dangerous-driving-c-18559751\"\u003e7News\u003c/a\u003e, Atkinson quickly contacted the police but, sensing the imminent danger, decided that waiting for help wasn’t an option. Instead, she chose to act.\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003eAfter following the truck for several miles, Atkinson watched as it finally came to a stop at Chain of Ponds. The driver tried to make a right turn at an intersection, but this is where she decided to make her move. Without hesitation, Atkinson leapt from her car, walked straight up to the truck, and took control of the situation.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Adelaide Hills mother stops drugged driver caught on camera driving dangerously | 7NEWS\" width=\"500\" height=\"281\" src=\"\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/FDUD7V0g-Q8?feature=oembed\" onload=\"resizeIframe(this,this.parentElement);\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eShe initially asked the driver if he was alright. He responded that he was “a bit lost,” prompting her to request that he turn off the engine so they could speak more clearly. Once the truck was off, she explained the danger he posed and, without missing a beat, requested his keys.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe didn’t just grab the keys and walk away, though. Atkinson also made sure to hold onto the driver’s logbook until the \u003ca href=\"https://www.carscoops.com/tag/police\"\u003epolice\u003c/a\u003e arrived, making sure all necessary evidence was secured.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt didn’t take long for the police to arrive on the scene. The 34-year-old driver was tested and found to be under the influence of methamphetamine and cannabis, which, needless to say, should disqualify anyone from operating a large vehicle, especially one as dangerous as a heavy truck.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2025/05/pet-kangaroo-escapes-forcing-interstate-closure-and-causing-a-collision/\"\u003ePet Kangaroo Sheila Wrecks Havoc On U.S. Highway After Escaping Bikini Bottom Zoo\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eA South Australian Police spokesperson confirmed that the driver was issued an immediate 24-hour driving ban and a three-month license suspension. He is expected to face court, \u003ca href=\"https://www.carscoops.com/2025/03/australian-man-banned-from-driving-for-92-years-caught-driving-his-subaru/\"\u003ewhere further penalties could be imposed\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to the traffic laws of South Australian, double trucks are not permitted in the North East Road where the incident occurred. Thankfully, due to Atkinson’s quick thinking and bravery, a potential disaster was averted. Let’s hope this trucker’s days of driving under the influence are officially over.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003ch4\u003eScreenshot 7News Australia / YouTube\u003c/h4\u003e\n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-04T01:11:00Z",
  "modifiedTime": "2025-05-03T21:11:38Z"
}
