{
  "id": "f8518b42-5f90-4dd6-b2b3-e115edeeebda",
  "title": "Government funding squeeze puts roads on back burner",
  "link": "https://www.autocar.co.uk/car-news/consumer/government-funding-squeeze-puts-roads-back-burner",
  "description": "A303 Stonehenge bypass was announced in 2014, was cancelled in 2024 Road upgrades slow to a snail's pace as government budgets are squeezed Twelve years after it was given the go-ahead and five years since construction started, the new 0.9-mile Silvertown Tunnel beneath the Thames that links Silvertown in east London to the Greenwich Peninsula will open on 7 April. The announcement by Transport for London (TfL) is a rare piece of good news at a time when, elsewhere in the country, many proposed road schemes are being axed in the face of cutbacks or opposition. Shortly after taking office in July last year, the Labour government scrapped the A27 upgrade and the controversial A303 Stonehenge tunnel scheme that had cost taxpayers £166 million in development. Then, in the Autumn Budget in October, it axed a further five National Highways projects – a decision taken because, according to then transport secretary Louise Haigh, they were “unaffordable”. The previous government had said the A1 Morpeth to Ellingham scheme – one of the five axed – would be funded from money saved by scrapping the northern leg of HS2. However, with the new government facing what it claimed was a £22 billion “black hole” in the public finances, it had other plans. Against this backdrop, the completion of the Silvertown Tunnel seems like a miracle – except that the crossing’s £2.2bn cost has been funded by the private sector. TfL says this will be repaid over the next 25 years by tolls of up to £4. While this toll-based model has secured the future of the tunnel, major road projects funded instead by taxpayers remain vulnerable to cancellation when government finances are squeezed. Economists, such as Bradshaw Advisory’s Matthew Brighty, warn that putting UK roads to the back of the funding queue risks harming the government’s plans to grow the economy. Brighty said: “If Labour wants to grow the economy and attract investment, it is essential to commit to long-term road infrastructure projects. “Investing in improving our outdated roads and tackling rising congestion before it gets worse will boost business, productivity, connectivity and unlock economic potential. The strategic road network needs real investment.” However, the level of investment Brighty believes is required has, in recent years, not materialised or has been spent ineffectively. Every five years, the government’s road investment strategy (RIS) sets out where cash will be spent. The most recent, RIS2, which covers the period to March 2025, pledged to spend £27.4bn on the strategic road network, including committing £14.1bn to 69 road enhancement projects. However, around £3.5bn of the budget was clawed back and the number of projects reduced. The National Audit Office subsequently reported that the spending programme would deliver fewer projects and at far higher cost than expected. As a result of delays caused by the parliamentary inquiry that followed and the change of government, implementation of the strategy’s successor, RIS3, which covers the period April 2025 to March 2030, has been delayed until the government’s spending review in June. Explaining this delay, future of roads minister Lilian Greenwood said the strategic road network is “an economic engine [that] needs our attention and demands a long-term plan”.  She added: “In order to shape that future, we need to take time to ensure we have the right programme, taking the opportunity provided by the Treasury Spending Review in spring to allow us to build a road investment strategy that will be better placed to invest and deliver for the long term.” Until then, and to ensure at least some projects remain on track, an ‘interim roads settlement’ for 2025-26 has been established. This includes up to £5m for work on the A75, as well as unspecified amounts for projects on the A47. Meanwhile, National Highways has set aside £347m to fund a “pipeline of future projects” that includes more than 30 major road schemes that were originally intended for consideration in RIS3 but have now been pushed back, possibly to RIS4 (April 2030 to March 2035). They include improvements to the M1, M6, A1 and A5 in the north of England, the M11, A11 and A12 to the east, and the A303, A3, A27 and A38 to the south-west. Despite cash being set aside, all of these projects are still up in the air. A spokesperson said: “These schemes remain uncommitted, with no guarantee they’ll be taken forward for further development work.” Today, however, the government has announced a more substantial £90m investment in four road upgrade projects: the A350 Chippenham Bypass in Wiltshire, Dawsons Corner and Stanningley Bypass on the A647 in Leeds, the South East Aylesbury Link Road in Buckinghamshire and the A127/A130 Fairglen Interchange in Essex. \"The UK’s roads are the backbone of a growing economy, which is why we’re giving these vital schemes the go ahead, helping deliver our Plan for Change,\" said Greenwood.",
  "author": "",
  "published": "Fri, 7 Feb 2025 00:01:36 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "John Evans",
  "length": 2999,
  "excerpt": "Road upgrades slow to a snail's pace as government budgets are squeezed",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Twelve years after it was given the go-ahead and five years since construction started, the new 0.9-mile Silvertown Tunnel beneath the Thames that links Silvertown in east London to the Greenwich Peninsula will open on 7 April. The announcement by Transport for London (TfL) is a rare piece of good news at a time when, elsewhere in the country, many proposed road schemes are being axed in the face of cutbacks or opposition. Shortly after taking office in July last year, the Labour government scrapped the A27 upgrade and the controversial A303 Stonehenge tunnel scheme that had cost taxpayers £166 million in development. Then, in the Autumn Budget in October, it axed a further five National Highways projects – a decision taken because, according to then transport secretary Louise Haigh, they were “unaffordable”. The previous government had said the A1 Morpeth to Ellingham scheme – one of the five axed – would be funded from money saved by scrapping the northern leg of HS2. However, with the new government facing what it claimed was a £22 billion “black hole” in the public finances, it had other plans. Against this backdrop, the completion of the Silvertown Tunnel seems like a miracle – except that the crossing’s £2.2bn cost has been funded by the private sector. TfL says this will be repaid over the next 25 years by tolls of up to £4. While this toll-based model has secured the future of the tunnel, major road projects funded instead by taxpayers remain vulnerable to cancellation when government finances are squeezed. Economists, such as Bradshaw Advisory’s Matthew Brighty, warn that putting UK roads to the back of the funding queue risks harming the government’s plans to grow the economy. Brighty said: “If Labour wants to grow the economy and attract investment, it is essential to commit to long-term road infrastructure projects. “Investing in improving our outdated roads and tackling rising congestion before it gets worse will boost business, productivity, connectivity and unlock economic potential. The strategic road network needs real investment.” However, the level of investment Brighty believes is required has, in recent years, not materialised or has been spent ineffectively. Every five years, the government’s road investment strategy (RIS) sets out where cash will be spent. The most recent, RIS2, which covers the period to March 2025, pledged to spend £27.4bn on the strategic road network, including committing £14.1bn to 69 road enhancement projects. However, around £3.5bn of the budget was clawed back and the number of projects reduced. The National Audit Office subsequently reported that the spending programme would deliver fewer projects and at far higher cost than expected. As a result of delays caused by the parliamentary inquiry that followed and the change of government, implementation of the strategy’s successor, RIS3, which covers the period April 2025 to March 2030, has been delayed until the government’s spending review in June.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/a303-stonehenge-bypass.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eTwelve years after it was given the go-ahead and five years since construction started, the new 0.9-mile Silvertown Tunnel beneath the Thames that links Silvertown in east London to the Greenwich Peninsula will open on 7 April.\u003c/p\u003e\n\u003cp\u003eThe announcement by Transport for London (TfL) is a rare piece of good news at a time when, elsewhere in the country, many proposed road schemes are being axed in the face of cutbacks or opposition.\u003c/p\u003e\n\u003cp\u003eShortly after taking office in July last year, the Labour government scrapped the A27 upgrade and the controversial \u003ca href=\"https://www.autocar.co.uk/car-news/consumer/stonehenge-tunnel-and-arundel-bypass-scrapped-roads-cuts\"\u003eA303 Stonehenge tunnel scheme\u003c/a\u003e that had cost taxpayers £166 million in development.\u003c/p\u003e\n\n\u003cp\u003eThen, in the Autumn Budget in October, it axed a further five National Highways projects – a decision taken because, according to then transport secretary Louise Haigh, they were “unaffordable”.\u003c/p\u003e\n\u003cp\u003eThe previous government had said the A1 Morpeth to Ellingham scheme – one of the five axed – would be funded from money saved by scrapping the northern leg of HS2. However, with the new government facing what it claimed was a £22 billion “black hole” in the public finances, it had other plans.\u003c/p\u003e\n\u003cp\u003eAgainst this backdrop, the completion of the Silvertown Tunnel seems like a miracle – except that the crossing’s £2.2bn cost has been funded by the private sector. TfL says this will be repaid over the next 25 years by tolls of up to £4.\u003c/p\u003e\n\u003cp\u003eWhile this toll-based model has secured the future of the tunnel, major road projects funded instead by taxpayers remain vulnerable to cancellation when government finances are squeezed.\u003c/p\u003e\n\u003cp\u003eEconomists, such as Bradshaw Advisory’s Matthew Brighty, warn that putting UK roads to the back of the funding queue risks harming the government’s plans to grow the economy.\u003c/p\u003e\n\u003cp\u003eBrighty said: “If Labour wants to grow the economy and attract investment, it is essential to commit to long-term road infrastructure projects.\u003c/p\u003e\n\u003cp\u003e“Investing in improving our outdated roads and tackling rising congestion before it gets worse will boost business, productivity, connectivity and unlock economic potential. The strategic road network needs real investment.”\u003c/p\u003e\n\u003cp\u003eHowever, the level of investment Brighty believes is required has, in recent years, not materialised or has been spent ineffectively. Every five years, the government’s road investment strategy (RIS) sets out where cash will be spent. The most recent, RIS2, which covers the period to March 2025, pledged to spend £27.4bn on the strategic road network, including committing £14.1bn to 69 road enhancement projects. However, around £3.5bn of the budget was clawed back and the number of projects reduced.\u003c/p\u003e\n\u003cp\u003eThe National Audit Office subsequently reported that the spending programme would deliver fewer projects and at far higher cost than expected. As a result of delays caused by the parliamentary inquiry that followed and the change of government, implementation of the strategy’s successor, RIS3, which covers the period April 2025 to March 2030, has been delayed until the government’s spending review in June.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-07T00:01:36Z",
  "modifiedTime": null
}
