{
  "id": "f8566344-bc3b-4aec-adbb-dcf24a3adb7f",
  "title": "New Mercedes-Benz CLA global debut on March 13",
  "link": "https://www.autocarindia.com/car-news/new-mercedes-benz-cla-global-debut-on-march-13-434796#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The Mercedes-Benz CLA is set for its world premiere in production-spec on March 13, the brand has confirmed. The new CLA was first showcased in concept guise in September 2023 at the Munich Motor Show. Earlier this year, the CLA concept even made an appearance at the Auto Expo 2025 in India. Based on the Mercedes-Benz Modular Architecture (MMA), the new CLA will be the first of an all-new model line-up of entry-level luxury cars from Mercedes-Benz. New CLA will debut as an EV, petrol variants to follow It will be the first car with the brand’s new MB.OS operating system Is the first of a new line-up of entry-level Mercedes EVs Mercedes Benz CLA exterior design Production model to closely resemble the concept Mercedes had previously said the production version of the CLA will only be ‘lightly altered’ over the concept, and as such, it previews a completely new exterior and interior design philosophy. Camouflaged test mules of the CLA have hinted at new wraparound LED headlamps with a three-pointed star-like LED daytime running lamp signature, a full-width light bar atop the grille, and a new interpretation of the Mercedes-Benz grille. A camouflaged test mule of the new CLA spied abroad. Meanwhile, the rear end of the compact sedan mimics the front end with an LED light bar connecting the tail-lamps with the star-like LED signature. Overall, the new CLA will have a low-slung stance with flared haunches and a coupe-like roofline, much like the original CLA. Mercedes Benz CLA interior and features Will get an all-new MB.OS operating system We haven’t got a glimpse of the production-spec CLA interior, but the concept had previewed a Supercreen setup with three connected screens. The brand had said the same would be retained for the production version as well. What’s interesting is that the CLA will debut the new MB.OS operating system. The new chip-to-cloud architecture also comes with an AI-enabled virtual assistant. The CLA concept was previewed with a Superscreen setup. The new CLA will come equipped with Level-2 semi-autonomous driving using LiDAR sensors, over-the-air updates compatibility, as well as an expansive glass roof. Mercedes Benz CLA powertrain, range and specs Is claimed to deliver around 750km range from a single charge The new CLA has been engineered as an EV-first vehicle, and entry-level variants of the compact sedan will come with a rear electric motor with a two-speed transmission. Higher-spec 4Matic models will have an additional single-speed electric motor on the front axle. Mercedes calls the new CLA “the one-litre car of the electric age”, with the powertrain having been derived from the Vision EQXX concept. Following the EV, the new CLA will also get an all-new 1.5-litre petrol engine. The battery and electrical architecture will run at 800V, and it can be charged at up to 320kW. This was claimed to enable the CLA to gain 300km of range in just 10 minutes. Mercedes claims an efficiency of 12kWh/100km for the CLA and an overall range of around 750km on a single charger. Later on, the CLA will also benefit from a new 1.5-litre four-cylinder mild-hybrid petrol engine that will be offered in both front-wheel drive and all-wheel drive configurations. Stay tuned for more details when Mercedes officially takes the wraps off the all-new CLA sedan. Also See: New Audi A6 with petrol and diesel engines revealed Volvo EX30 local assembly under evaluation; launch confirmed for end 2025",
  "author": "Saptarshi Mondal",
  "published": "Mon, 10 Mar 2025 17:34:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Saptarshi  Mondal",
  "length": 3538,
  "excerpt": "Production-spec Mercedes CLA will debut as an EV first; petrol variants to follow later.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Production-spec Mercedes CLA will debut as an EV first; petrol variants to follow later. The Mercedes-Benz CLA is set for its world premiere in production-spec on March 13, the brand has confirmed. The new CLA was first showcased in concept guise in September 2023 at the Munich Motor Show. Earlier this year, the CLA concept even made an appearance at the Auto Expo 2025 in India. Based on the Mercedes-Benz Modular Architecture (MMA), the new CLA will be the first of an all-new model line-up of entry-level luxury cars from Mercedes-Benz.New CLA will debut as an EV, petrol variants to follow It will be the first car with the brand’s new MB.OS operating system Is the first of a new line-up of entry-level Mercedes EVs Mercedes Benz CLA exterior design Production model to closely resemble the concept Mercedes had previously said the production version of the CLA will only be ‘lightly altered’ over the concept, and as such, it previews a completely new exterior and interior design philosophy. Camouflaged test mules of the CLA have hinted at new wraparound LED headlamps with a three-pointed star-like LED daytime running lamp signature, a full-width light bar atop the grille, and a new interpretation of the Mercedes-Benz grille.A camouflaged test mule of the new CLA spied abroad.Meanwhile, the rear end of the compact sedan mimics the front end with an LED light bar connecting the tail-lamps with the star-like LED signature. Overall, the new CLA will have a low-slung stance with flared haunches and a coupe-like roofline, much like the original CLA.Mercedes Benz CLA interior and features Will get an all-new MB.OS operating system We haven’t got a glimpse of the production-spec CLA interior, but the concept had previewed a Supercreen setup with three connected screens. The brand had said the same would be retained for the production version as well. What’s interesting is that the CLA will debut the new MB.OS operating system. The new chip-to-cloud architecture also comes with an AI-enabled virtual assistant.The CLA concept was previewed with a Superscreen setup.The new CLA will come equipped with Level-2 semi-autonomous driving using LiDAR sensors, over-the-air updates compatibility, as well as an expansive glass roof.Mercedes Benz CLA powertrain, range and specs Is claimed to deliver around 750km range from a single chargeThe new CLA has been engineered as an EV-first vehicle, and entry-level variants of the compact sedan will come with a rear electric motor with a two-speed transmission. Higher-spec 4Matic models will have an additional single-speed electric motor on the front axle. Mercedes calls the new CLA “the one-litre car of the electric age”, with the powertrain having been derived from the Vision EQXX concept.Following the EV, the new CLA will also get an all-new 1.5-litre petrol engine.The battery and electrical architecture will run at 800V, and it can be charged at up to 320kW. This was claimed to enable the CLA to gain 300km of range in just 10 minutes. Mercedes claims an efficiency of 12kWh/100km for the CLA and an overall range of around 750km on a single charger. Later on, the CLA will also benefit from a new 1.5-litre four-cylinder mild-hybrid petrol engine that will be offered in both front-wheel drive and all-wheel drive configurations.Stay tuned for more details when Mercedes officially takes the wraps off the all-new CLA sedan.Also See:New Audi A6 with petrol and diesel engines revealedVolvo EX30 local assembly under evaluation; launch confirmed for end 2025Videos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250310053412_20230904011126_Mercedes.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eProduction-spec Mercedes CLA will debut as an EV first; petrol variants to follow later. \u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mercedes-benz-unveils-new-concept-cla-class-at-munich-motor-show-429222\"\u003eMercedes-Benz CLA\u003c/a\u003e\u003c/strong\u003e is set for its world premiere in production-spec on March 13, the brand has confirmed. The new CLA was first showcased in concept guise in September 2023 at the Munich Motor Show. Earlier this year, the CLA concept even made an appearance at the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mercedes-cla-concept-showcased-at-auto-expo-2025-434200\"\u003eAuto Expo 2025 in India\u003c/a\u003e\u003c/strong\u003e. Based on the Mercedes-Benz Modular Architecture (MMA), the new CLA will be the first of an all-new model line-up of entry-level luxury cars from Mercedes-Benz.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eNew CLA will debut as an EV, petrol variants to follow \u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIt will be the first car with the brand’s new MB.OS operating system \u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIs the first of a new line-up of entry-level Mercedes EVs \u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMercedes Benz CLA exterior design \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eProduction model to closely resemble the concept \u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eMercedes had previously said the production version of the CLA will only be ‘lightly altered’ over the concept, and as such, it previews a completely new exterior and interior design philosophy. \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-gen-mercedes-cla-spy-shots-reveal-exterior-details-432614\"\u003eCamouflaged test mules\u003c/a\u003e\u003c/strong\u003e of the CLA have hinted at new wraparound LED headlamps with a three-pointed star-like LED daytime running lamp signature, a full-width light bar atop the grille, and a new interpretation of the Mercedes-Benz grille.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20240822014318_6.png\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eA camouflaged test mule of the new CLA spied abroad.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eMeanwhile, the rear end of the compact sedan mimics the front end with an LED light bar connecting the tail-lamps with the star-like LED signature. Overall, the new CLA will have a low-slung stance with flared haunches and a coupe-like roofline, much like the original CLA.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMercedes Benz CLA interior and features \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eWill get an all-new MB.OS operating system \u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eWe haven’t got a glimpse of the production-spec CLA interior, but the concept had previewed a Supercreen setup with three connected screens. The brand had said the same would be retained for the production version as well. What’s interesting is that the CLA will debut the new MB.OS operating system. The new chip-to-cloud architecture also comes with an AI-enabled virtual assistant.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20250310052806_Mercedes 6.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe CLA concept was previewed with a Superscreen setup.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe new CLA will come equipped with Level-2 semi-autonomous driving using LiDAR sensors, over-the-air updates compatibility, as well as an expansive glass roof.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMercedes Benz CLA powertrain, range and specs \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eIs claimed to deliver around 750km range from a single charge\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe new CLA has been engineered as an EV-first vehicle, and entry-level variants of the compact sedan will come with a rear electric motor with a two-speed transmission. Higher-spec 4Matic models will have an additional single-speed electric motor on the front axle. Mercedes calls the new CLA “the one-litre car of the electric age”, with the powertrain having been derived from the Vision EQXX concept.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20250310052951_20230904010837_Mercedes 2.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eFollowing the EV, the new CLA will also get an all-new 1.5-litre petrol engine.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe battery and electrical architecture will run at 800V, and it can be charged at up to 320kW. This was claimed to enable the CLA to gain 300km of range in just 10 minutes. Mercedes claims an efficiency of 12kWh/100km for the CLA and an overall range of around 750km on a single charger. Later on, the CLA will also benefit from a new \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-mercedes-cla-to-get-hybrid-and-all-electric-powertrains-433587#:~:text=Mercedes%2DBenz%20will%20reveal%20the,engineered%20as%20an%20EV%20first.\"\u003e1.5-litre four-cylinder mild-hybrid petrol engine\u003c/a\u003e\u003c/strong\u003e that will be offered in both front-wheel drive and all-wheel drive configurations.\u003c/p\u003e\u003cp\u003eStay tuned for more details when Mercedes officially takes the wraps off the all-new CLA sedan.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/audi-a6-avant-with-petrol-and-diesel-engines-revealed-in-europe-434743\"\u003e\u003cstrong\u003eNew Audi A6 with petrol and diesel engines revealed\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/volvo-ex30-local-assembly-under-evaluation-launch-confirmed-for-end-2025-434749\"\u003e\u003cstrong\u003eVolvo EX30 local assembly under evaluation; launch confirmed for end 2025\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434796\"\u003e\u003cul id=\"tab-id-434796\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434796\" href=\"#.\" rel=\"#tab-videos-container-434796\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-10T17:34:00+05:30",
  "modifiedTime": null
}
