{
  "id": "26110366-e65c-477a-8287-864c49917e6f",
  "title": "Temple of Augustus in Ankara, Turkey",
  "link": "https://www.atlasobscura.com/places/augustus-temple-turkey",
  "description": "Ankara does not typically top the itinerary of those visiting Turkey either for its sandy beaches or for the historical sites of its bustling megacity, Istanbul. The relatively unknown capital often serves as a mere transit point for those traveling to or from the nearby Fairy Chimneys of Cappadocia. It could therefore come as surprise to many that the city had once been a bustling Roman metropolis in Asia Minor. Verifiable settlement history of Ankara dates back to the time of the Phrygian Kingdom, which had ruled over much of Western Anatolia before the Persian conquests in the 7th Century BC. The Hellenistic Period ensuing upon Alexander’s excursions against the Persians had seen the arrival and settlement of an ancient Celtic-speaking people by the name of Galatians who would soon establish their own political rule in the area. It was after the integration of the territories of the Galatian Kingdom into the expanding Roman Empire that Ankara (then known as Ancyra) would steadily evolve into a bustling provincial center of Roman rule in Asia Minor. A temple would be inaugurated at the heart of the city to honor Emperor Augustus, and it would be through an inscription on this temple that a 16th Century Flemish ambassador of the Holy Roman Emperor to the Ottomans had been able to transcribe the full autobiographical text of Res Gestae Divi Augusti (The Deeds of the Divine Augustus) and take it back to Europe. The temple’s ruins now stand in the middle of one of the country’s holiest Muslim sites dedicated to an influential 15th Century Anatolian Sufi mystic and saint by the name of Hacı Bayram-ı Veli, whose tomb and mosque just adjacent to the temple attract thousands of devout Muslims.",
  "author": "",
  "published": "Thu, 22 May 2025 16:00:00 -0400",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": [
    "temples"
  ],
  "byline": "Added By Ege Hazer",
  "length": 1716,
  "excerpt": "The ruins of a Roman temple from 1st Century BC with the only preserved inscription of “The Deeds of the Divine Augustus.”",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/2qkRVagVffc_mgSh6SEWeb318Fx0xvtyxjgUes0K6j8/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Fw/cGxlLXRvdWNoLWlj/b24tMTQ0eDE0NC1w/cmVjb21wb3NlZC5w/bmc",
  "text": "Ankara does not typically top the itinerary of those visiting Turkey either for its sandy beaches or for the historical sites of its bustling megacity, Istanbul. The relatively unknown capital often serves as a mere transit point for those traveling to or from the nearby Fairy Chimneys of Cappadocia. It could therefore come as surprise to many that the city had once been a bustling Roman metropolis in Asia Minor. Verifiable settlement history of Ankara dates back to the time of the Phrygian Kingdom, which had ruled over much of Western Anatolia before the Persian conquests in the 7th Century BC. The Hellenistic Period ensuing upon Alexander’s excursions against the Persians had seen the arrival and settlement of an ancient Celtic-speaking people by the name of Galatians who would soon establish their own political rule in the area. It was after the integration of the territories of the Galatian Kingdom into the expanding Roman Empire that Ankara (then known as Ancyra) would steadily evolve into a bustling provincial center of Roman rule in Asia Minor. A temple would be inaugurated at the heart of the city to honor Emperor Augustus, and it would be through an inscription on this temple that a 16th Century Flemish ambassador of the Holy Roman Emperor to the Ottomans had been able to transcribe the full autobiographical text of Res Gestae Divi Augusti (The Deeds of the Divine Augustus) and take it back to Europe. The temple’s ruins now stand in the middle of one of the country’s holiest Muslim sites dedicated to an influential 15th Century Anatolian Sufi mystic and saint by the name of Hacı Bayram-ı Veli, whose tomb and mosque just adjacent to the temple attract thousands of devout Muslims.",
  "image": "https://img.atlasobscura.com/AtFyC_lc960Q29ncm188hPiyrA_JYEm4xlWUkMtJ9jo/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy80NTIz/ODZlNy03MGQ5LTQ1/ODQtYWUxMi1jMjA1/ZDRjYTMzOWM0MThi/NjA4NzRmZDZjMTQ4/ZGJfSU1HXzExNTEu/SlBH.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003eAnkara does not typically top the itinerary of those visiting Turkey either for its sandy beaches or for the historical sites of its bustling megacity, Istanbul. The relatively unknown capital often serves as a mere transit point for those traveling to or from the nearby Fairy Chimneys of Cappadocia. It could therefore come as surprise to many that the city had once been a bustling Roman metropolis in Asia Minor.\u003c/p\u003e\n\u003cp\u003eVerifiable settlement history of Ankara dates back to the time of the Phrygian Kingdom, which had ruled over much of Western Anatolia before the Persian conquests in the 7th Century BC. The Hellenistic Period ensuing upon Alexander’s excursions against the Persians had seen the arrival and settlement of an ancient Celtic-speaking people by the name of Galatians who would soon establish their own political rule in the area. It was after the integration of the territories of the Galatian Kingdom into the expanding Roman Empire that Ankara (then known as Ancyra) would steadily evolve into a bustling provincial center of Roman rule in Asia Minor.\u003c/p\u003e\n\u003cp\u003eA temple would be inaugurated at the heart of the city to honor Emperor Augustus, and it would be through an inscription on this temple that a 16th Century Flemish ambassador of the Holy Roman Emperor to the Ottomans had been able to transcribe the full autobiographical text of \u003cem\u003eRes Gestae Divi Augusti\u003c/em\u003e (\u003cem\u003eThe Deeds of the Divine Augustus\u003c/em\u003e) and take it back to Europe.\u003c/p\u003e\n\u003cp\u003eThe temple’s ruins now stand in the middle of one of the country’s holiest Muslim sites dedicated to an influential 15th Century Anatolian Sufi mystic and saint by the name of Hacı Bayram-ı Veli, whose tomb and mosque just adjacent to the temple attract thousands of devout Muslims.\u003c/p\u003e\n\n\n                \n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-22T16:00:00-04:00",
  "modifiedTime": null
}
