{
  "id": "39a51dc6-ae19-44c8-a27c-23702bf10e09",
  "title": "‘A muddy ride into Romania’s dreamy countryside’: cycling the Via Transilvanica",
  "link": "https://www.theguardian.com/travel/2025/apr/15/a-muddy-ride-into-romanias-dreamy-countryside-cycling-the-via-transilvanica",
  "description": "The challenging 870-mile trail cuts diagonally across Romania and takes in mountain meadows, fairytale forests and medieval monasteriesIt was about seven minutes into my cycle ride that the first signs of addiction became apparent. My ebike’s “power assist” button felt more like a morphine clicker as we climbed the misty hills of Bucovina in northern Romania. Sergiu, my group’s guide, knew what I was up to. “Be honest with yourself – only use ‘turbo’ if you have to!” he shouted. My thumb cowered under the handlebar.On previous adventures I’ve resisted assistance, maintaining that battery power is the preserve of the unserious. Nowadays, though, my pins aren’t as powerful, and on these vertiginous hills the extra oomph was near essential. But as with all drugs, moderation is key. After all, one wouldn’t want to run out of juice on hills that are home to wolves, bears and lynx. Continue reading...",
  "author": "Damien Gabet",
  "published": "Tue, 15 Apr 2025 06:00:38 GMT",
  "source": "https://www.theguardian.com/uk/travel/rss",
  "categories": [
    "Romania holidays",
    "Cycling holidays",
    "Cycling",
    "Travel",
    "Life and style",
    "Europe holidays"
  ],
  "byline": "",
  "length": 7978,
  "excerpt": "The challenging 870-mile trail cuts diagonally across Romania and takes in mountain meadows, fairytale forests and medieval monasteries",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "It was about seven minutes into my cycle ride that the first signs of addiction became apparent. My ebike’s “power assist” button felt more like a morphine clicker as we climbed the misty hills of Bucovina in northern Romania. Sergiu, my group’s guide, knew what I was up to. “Be honest with yourself – only use ‘turbo’ if you have to!” he shouted. My thumb cowered under the handlebar.On previous adventures I’ve resisted assistance, maintaining that battery power is the preserve of the unserious. Nowadays, though, my pins aren’t as powerful, and on these vertiginous hills the extra oomph was near essential. But as with all drugs, moderation is key. After all, one wouldn’t want to run out of juice on hills that are home to wolves, bears and lynx.Romania cycle I’d been invited to take part in tour operator Slow Cyclist’s inaugural ebike ride (and hike) along a section of Romania’s Via Transilvanica. Dubbed the “Camino of the east”, the trail ties together ancient trade and livestock droving trails, threading its way south-west from Putna, near the Ukrainian border, to the village of Drobeta-Turnu Severin, 870 miles (1,400km) away and within spitting distance of Serbia.Equal parts eco-tourism attraction, art project and economic lifeline, the Via Transilvanica is a trail with a tale. It was conceived by environmentalist Alin Ușeriu and his brother Tiberiu (once imprisoned for armed robbery and now a celebrity ultrarunner) who successfully navigated corruption, mafia interests and the natural obstacles of the Carpathian mountain range. It’s as much a triumph of resilience as of route planning. Over four and a half years, defying the odds, they carved a path uniting seven regions, powered by hundreds of volunteers. The result? A compelling invitation to lose yourself in Romania’s time-travelling countryside.Having been strong-armed into attending a family wedding back home, I arrived two days into the adventure. By chance, that meant narrowly missing a huge storm, which had given the others in my group a good dousing the day before. I caught up with them, a little windswept but in good spirits, outside a 16th-century monastery in Vatra Moldoviței, about 20 miles south of Putna. It has one of eight Unesco-listed churches in the region that are unique for their exterior frescoes, which were designed, Sergiu told us, as “bibles for the illiterate”. They’ve been remarkably well preserved thanks to some clever architecture and posh paint. The Voroneț blue, made from rare lapis lazuli, still pops.The painted Church at Moldovita Monastery. Photograph: Robert Wyatt/AlamySome parts of the trail are too steep and slippery for all but the most advanced bikers, so we tackled the morning’s section on foot. The rain had abated and the air was full of the scent of wet conifer, exotic soil and wood smoke. The views were already living up to the snaps in Slow Cyclist’s brochure: Swiss-style mountain meadows, pine-spiked peaks and farmsteads which wouldn’t look out of place in a Robert Eggers folk horror movie.Cow bells pealed, though I soon realised they weren’t being worn by heifers, but by the hulking Bucovina shepherd dogs that guard the herd from wolves, bears and passing hikers. “Stay in the pack or they’ll think they’ve separated you,” warned Sergiu. The beasts slowly approached with bellowing barks, but Sergiu’s ready bag of treats kept the peace.If you’re hiking or biking in these hills, Sergiu is a good man to have at the helm. Besides being to the mountain born, he was chosen by Tășuleasa Social – the NGO run by the Ușeriu brothers – to map the Via Transilvanica from a cyclist’s perspective. He duly did a recce of all 870 miles on two wheels. “If you don’t know the trail, you can die,” he warned. “Some climbs are almost vertical.” Indeed, this is the debut route in the Slow Cyclist’s new Expedition Series – built for more adventurous cyclists, rather than the lunch-with-cycling crowd.That said, our midday stops were things of simple beauty: cold cuts, the reddest of tomatoes and homemade cheeses. With moreish plum brandy on the table, I felt fortified for the afternoon ride. Support vehicles and a friendly team were on hand with pumps and Allen keys before we put our push irons to the task.Lunches of cold cuts and homemade cheeses. Photograph: Ryan Le Garrec“We’re about to go uphill. Would anybody like a sugar hit?” asked Sergiu. As we burned through calories up to a rudimentary ski station with another almighty view, we were grateful for the nutty bars he’d handed out. So much open space and not a soul in sight. I checked with my group and they had met only three other hikers since the trip began.The next morning began with a gentle weave through meadows dotted with pudding-shaped haystacks. Then, without much warning, we dropped into an ancient forest – the kind that feels like the setting for a Brothers Grimm tale. “What’s living in here?” I asked. “Bears, deer, even lynx sometimes,” said Sergiu casually. “But you’ll be lucky to see them.”The forest marked my first attempt at single-track riding. I hung back on purpose, letting the others slip ahead, then tore downhill – tongue out, heart hammering – chasing the blur of bikes through the trees. No bears, alas, but brilliant riding.It was here that I noticed the 250kg slabs of anthracite, way markers by different sculptors which stand sentry every kilometre of the trail. Each one is carved and marked with a bold orange T (for Transilvanica). “It’s the world’s longest art gallery,” said Iancu, our second guide. “The trail was built by volunteers – people who gave up their free time for something bigger than themselves, so I think that says a lot.”One of the Via Transilvanica’s missions is to stem the flow of people leaving the countryside, giving them a reason to stay or even come back. Over lunch on my second day’s ride, with Iancu translating, I spoke to our host, who told me the number of visitors she receives has increased sixfold since the trail opened in 2022.That night’s lodgings at La Moara guesthouse – all carved wood and Alpine dreams – offered another wink to Switzerland. At dinner, I couldn’t resist a second helping of the găluște broth: meaty semolina dumplings floating in a dill-filled cuddle of a soup. The mains were chicken paprikash and a towering heap of baked polenta mixed with unpasteurised cheese from our hosts’ own flock.Damien Gabet with the owner of Maria Bidian – Punct Gastronomic Local restaurant in Transylvania. Photograph: Damien GabetOn the final day, the afternoon run was up a ski slope and the varying fitness levels of the group became more obvious. Thumbs hovered over the power assist button, but even at max power it was a challenge. By now, I’d found my stride and was loving the sweat session. Others were struggling, though, which made things a little stop-start. I’d advise checking, before you book, whether others in the group are more or less at your level.That notwithstanding, the Slow Cyclist team has struck a lovely balance between cardio and culture, offering a rosy glimpse of Romania’s past and present – via a muddy dive into its dreamy countryside. Over three days, I’d ridden through fairytale landscapes and eaten like a happy Saxon farmer. I’ve already vowed to return to ride more of the trail.We crested the final hill in a loose, panting line and stopped while Sergiu made friends with a farmer who was following cows around with a milk pail. She offered us a sip. “Not for me, thank you,” I said. “But have you got any plum brandy?”The Slow Cyclist offers a five-night Bucovina Expedition from £1,750 per person, based on a group of 12, including airport transfers, a support vehicle and luggage transfers, English-speaking local guides, five nights’ accommodation, all meals and activities, and ebike and helmet hire. There are regular scheduled departures between June and November, and private group tours can be arranged upon request, theslowcyclist.com",
  "image": "https://i.guim.co.uk/img/media/fa8cb58f12f247493c3f5bedfb71f39fc43f4b3b/0_0_6000_3600/master/6000.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=30026c9c3b57fba539233bb92ec81ef3",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003eI\u003c/span\u003et was about seven minutes into my cycle ride that the first signs of addiction became apparent. My ebike’s “power assist” button felt more like a morphine clicker as we climbed the misty hills of Bucovina in northern Romania. Sergiu, my group’s guide, knew what I was up to. “Be honest with yourself – only use ‘turbo’ if you have to!” he shouted. My thumb cowered under the handlebar.\u003c/p\u003e\u003cfigure id=\"disclaimer\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.DisclaimerBlockElement\"\u003e\u003cspan\u003e\u003c/span\u003e\u003c/figure\u003e\u003cp\u003eOn previous adventures I’ve resisted assistance, maintaining that battery power is the preserve of the unserious. Nowadays, though, my pins aren’t as powerful, and on these vertiginous hills the extra oomph was near essential. But as with all drugs, moderation is key. After all, one wouldn’t want to run out of juice on hills that are home to wolves, bears and lynx.\u003c/p\u003e\u003cgu-island name=\"InteractiveBlockComponent\" priority=\"critical\" deferuntil=\"idle\" props=\"{\u0026#34;url\u0026#34;:\u0026#34;https://interactive.guim.co.uk/uploader/embed/2025/04/embed-7-zip/giv-32554IXymTmZXaAMA/\u0026#34;,\u0026#34;scriptUrl\u0026#34;:\u0026#34;https://interactive.guim.co.uk/embed/iframe-wrapper/0.1/boot.js\u0026#34;,\u0026#34;alt\u0026#34;:\u0026#34;Romania cycle \u0026#34;,\u0026#34;format\u0026#34;:{\u0026#34;design\u0026#34;:10,\u0026#34;display\u0026#34;:2,\u0026#34;theme\u0026#34;:4},\u0026#34;elementId\u0026#34;:\u0026#34;0490a84d-8694-4d88-97e0-6cdadf5610ae\u0026#34;,\u0026#34;isMainMedia\u0026#34;:false}\"\u003e\u003cfigure id=\"0490a84d-8694-4d88-97e0-6cdadf5610ae\" data-alt=\"Romania cycle \" data-testid=\"interactive-element-Romania%20cycle%20\" data-spacefinder-role=\"inline\"\u003e\u003ca data-name=\"placeholder\" href=\"https://interactive.guim.co.uk/uploader/embed/2025/04/embed-7-zip/giv-32554IXymTmZXaAMA/\"\u003eRomania cycle \u003c/a\u003e\u003c/figure\u003e\u003c/gu-island\u003e\u003cp\u003eI’d been invited to take part in tour operator Slow Cyclist’s inaugural ebike ride (and hike) along a section of Romania’s \u003ca href=\"https://www.viatransilvanica.com/en/\" data-link-name=\"in body link\"\u003eVia Transilvanica\u003c/a\u003e. Dubbed the “Camino of the east”, the trail ties together ancient trade and livestock droving trails, threading its way south-west from Putna, near the Ukrainian border, to the village of Drobeta-Turnu Severin, 870 miles (1,400km) away and within spitting distance of Serbia.\u003c/p\u003e\u003cp\u003eEqual parts eco-tourism attraction, art project and economic lifeline, the Via Transilvanica is a trail with a tale. It was conceived by environmentalist Alin Ușeriu and his brother Tiberiu (\u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=https%3A%2F%2Fwww.runnersworld.com%2Frunners-stories%2Fa26962810%2Fmafia-robber-ultra-runner-wins-arctic-marathon%2F\u0026amp;sref=https://www.theguardian.com/travel/2025/apr/15/a-muddy-ride-into-romanias-dreamy-countryside-cycling-the-via-transilvanica\" data-link-name=\"in body link\" rel=\"sponsored\"\u003eonce imprisoned for armed robbery\u003c/a\u003e and now a celebrity ultrarunner) who successfully navigated corruption, mafia interests and the natural obstacles of the Carpathian mountain range. It’s as much a triumph of resilience as of route planning. Over four and a half years, defying the odds, they carved a path uniting seven regions, powered by hundreds of volunteers. The result? A compelling invitation to lose yourself in Romania’s time-travelling countryside.\u003c/p\u003e\u003cp\u003eHaving been strong-armed into attending a family wedding back home, I arrived two days into the adventure. By chance, that meant narrowly missing a huge storm, which had given the others in my group a good dousing the day before. I caught up with them, a little windswept but in good spirits, outside a 16th-century monastery in Vatra Moldoviței, about 20 miles south of Putna. It has one of eight Unesco-listed churches in the region that are unique for their exterior frescoes, which were designed, Sergiu told us, as “bibles for the illiterate”. They’ve been remarkably well preserved thanks to some clever architecture and posh paint. The Voroneț blue, made from rare lapis lazuli, still pops.\u003c/p\u003e\u003cfigure id=\"56aca256-6f04-4e04-be21-fc6a051f5a1b\" data-spacefinder-role=\"showcase\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=880\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=880\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=800\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1140px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=800\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=640\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=640\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"A church with a pointed tower and frescoes all over the outside\" src=\"https://i.guim.co.uk/img/media/c7739b7651ba099c1ab12a95729ab1ab20a4319c/0_0_5568_3712/master/5568.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"296.66666666666663\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eThe painted Church at Moldovita Monastery.\u003c/span\u003e Photograph: Robert Wyatt/Alamy\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSome parts of the trail are too steep and slippery for all but the most advanced bikers, so we tackled the morning’s section on foot. The rain had abated and the air was full of the scent of wet conifer, exotic soil and wood smoke. The views were already living up to the snaps in \u003ca href=\"https://www.theslowcyclist.com/\" data-link-name=\"in body link\"\u003eSlow Cyclist\u003c/a\u003e’s brochure: Swiss-style mountain meadows, pine-spiked peaks and farmsteads which wouldn’t look out of place in a Robert Eggers folk horror movie.\u003c/p\u003e\u003cp\u003eCow bells pealed, though I soon realised they weren’t being worn by heifers, but by the hulking Bucovina shepherd dogs that guard the herd from wolves, bears and passing hikers. “Stay in the pack or they’ll think they’ve separated you,” warned Sergiu. The beasts slowly approached with bellowing barks, but Sergiu’s ready bag of treats kept the peace.\u003c/p\u003e\u003cp\u003eIf you’re hiking or biking in these hills, Sergiu is a good man to have at the helm. Besides being to the mountain born, he was chosen by \u003ca href=\"https://www.tasuleasasocial.ro/en/\" data-link-name=\"in body link\"\u003eTășuleasa Social\u003c/a\u003e – the NGO run by the Ușeriu brothers – to map the Via Transilvanica from a cyclist’s perspective. He duly did a recce of all 870 miles on two wheels. “If you don’t know the trail, you can die,” he warned. “Some climbs are almost vertical.” Indeed, this is the debut route in the Slow Cyclist’s new Expedition Series – built for more adventurous cyclists, rather than the lunch-with-cycling crowd.\u003c/p\u003e\u003cp\u003eThat said, our midday stops were things of simple beauty: cold cuts, the reddest of tomatoes and homemade cheeses. With moreish plum brandy on the table, I felt fortified for the afternoon ride. Support vehicles and a friendly team were on hand with pumps and Allen keys before we put our push irons to the task.\u003c/p\u003e\u003cfigure id=\"f49252e1-23d3-4972-94f2-d1171ef4b3b4\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-3\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"A table with meats, cheeses, bread and vegetables, with the hands of dinners just seen\" src=\"https://i.guim.co.uk/img/media/a5b40315fb676dd95520a6237bfae394e2f43fbc/0_0_4240_2832/master/4240.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"297.2264150943396\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eLunches of cold cuts and homemade cheeses.\u003c/span\u003e Photograph: Ryan Le Garrec\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e“We’re about to go uphill. Would anybody like a sugar hit?” asked Sergiu. As we burned through calories up to a rudimentary ski station with another almighty view, we were grateful for the nutty bars he’d handed out. So much open space and not a soul in sight. I checked with my group and they had met only three other hikers since the trip began.\u003cbr/\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003eThe next morning began with a gentle weave through meadows dotted with pudding-shaped haystacks. Then, without much warning, we dropped into an ancient forest – the kind that feels like the setting for a Brothers Grimm tale. “What’s living in here?” I asked. “Bears, deer, even lynx sometimes,” said Sergiu casually. “But you’ll be lucky to see them.”\u003c/p\u003e\u003cp\u003eThe forest marked my first attempt at single-track riding. I hung back on purpose, letting the others slip ahead, then tore downhill – tongue out, heart hammering – chasing the blur of bikes through the trees. No bears, alas, but brilliant riding.\u003c/p\u003e\u003cp\u003eIt was here that I noticed the 250kg slabs of anthracite, way markers by different sculptors which stand sentry every kilometre of the trail. Each one is carved and marked with a bold orange T (for Transilvanica). “It’s the world’s longest art gallery,” said Iancu, our second guide. “The trail was built by volunteers – people who gave up their free time for something bigger than themselves, so I think that says a lot.”\u003c/p\u003e\u003cp\u003eOne of the Via Transilvanica’s missions is to stem the flow of people leaving the countryside, giving them a reason to stay or even come back. Over lunch on my second day’s ride, with Iancu translating, I spoke to our host, who told me the number of visitors she receives has increased sixfold since the trail opened in 2022.\u003c/p\u003e\u003cp\u003eThat night’s lodgings at La Moara guesthouse – all carved wood and Alpine dreams – offered another wink to Switzerland. At dinner, I couldn’t resist a second helping of the găluște broth: meaty semolina dumplings floating in a dill-filled cuddle of a soup. The mains were chicken paprikash and a towering heap of baked polenta mixed with unpasteurised cheese from our hosts’ own flock.\u003c/p\u003e\u003cfigure id=\"05d9513e-3a15-41f5-8044-72c1c2906bc4\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-4\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Damien Gabet with the owner of the Maria Bidian - Punct Gastronomic Local restaurant in Transylvania\" src=\"https://i.guim.co.uk/img/media/4e9b371ad129b20992218e9e2e8b34ad5bea8f8b/0_681_3072_3054/master/3072.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"442.392578125\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eDamien Gabet with the owner of Maria Bidian – Punct Gastronomic Local restaurant in Transylvania.\u003c/span\u003e Photograph: Damien Gabet\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOn the final day, the afternoon run was up a ski slope and the varying fitness levels of the group became more obvious. Thumbs hovered over the power assist button, but even at max power it was a challenge. By now, I’d found my stride and was loving the sweat session. Others were struggling, though, which made things a little stop-start. I’d advise checking, before you book, whether others in the group are more or less at your level.\u003c/p\u003e\u003cp\u003eThat notwithstanding, the Slow Cyclist team has struck a lovely balance between cardio and culture, offering a rosy glimpse of Romania’s past and present – via a muddy dive into its dreamy countryside. Over three days, I’d ridden through fairytale landscapes and eaten like a happy Saxon farmer. I’ve already vowed to return to ride more of the trail.\u003c/p\u003e\u003cp\u003eWe crested the final hill in a loose, panting line and stopped while Sergiu made friends with a farmer who was following cows around with a milk pail. She offered us a sip. “Not for me, thank you,” I said. “But have you got any plum brandy?”\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Slow Cyclist\u003c/em\u003e\u003cem\u003e offers a \u003c/em\u003e\u003cem\u003efive-night\u003c/em\u003e\u003cem\u003e \u003c/em\u003e\u003cem\u003e\u003ca href=\"https://www.theslowcyclist.com/destinations/romania-cycling-holidays/bucovina-via-transilvanica/\" data-link-name=\"in body link\"\u003eBucovina Expedition\u003c/a\u003e\u003c/em\u003e\u003cem\u003e from \u003c/em\u003e\u003cem\u003e£1,750 per person\u003c/em\u003e\u003cem\u003e, based on \u003c/em\u003e\u003cem\u003ea group of 12\u003c/em\u003e\u003cem\u003e,\u003c/em\u003e\u003cem\u003e includ\u003c/em\u003e\u003cem\u003eing \u003c/em\u003e\u003cem\u003eairport transfers, a support vehicle and luggage transfers, \u003c/em\u003e\u003cem\u003eEnglish-speaking local guides, \u003c/em\u003e\u003cem\u003e five nights’ accommodation, all meals\u003c/em\u003e\u003cem\u003e and\u003c/em\u003e\u003cem\u003e activities, and ebike\u003c/em\u003e\u003cem\u003e and helmet hire. \u003c/em\u003e\u003cem\u003eThere are regular scheduled departures between \u003c/em\u003e\u003cem\u003eJune and November\u003c/em\u003e\u003cem\u003e, and private group tours can be arranged upon request, \u003c/em\u003e\u003cem\u003e\u003ca href=\"http://www.theslowcyclist.com/\" data-link-name=\"in body link\"\u003etheslowcyclist.com\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-15T06:00:38Z",
  "modifiedTime": "2025-04-15T11:47:43Z"
}
