{
  "id": "40f12330-2df4-46e1-901d-3d46b62d8ae5",
  "title": "Ta' Kola Windmill in Xagħra, Malta",
  "link": "https://www.atlasobscura.com/places/ta-kola-windmill",
  "description": "When the Knights of St. John controlled the islands of Malta, they oversaw the construction of many public works buildings that would benefit the general populace. One of their projects was the construction of windmills for providing flour, and these buildings became central parts of the villages in which they were located. These Maltese windmills all had a very similar yet distinct design. The base of the building was typically slightly broader than the windmill sails and was square, although some windmills had bases with other shapes. This base structure often had two stories. A cylindrical tower with windmill sails stood in the center of the top of this square base.  The entire structure was typically built using beige limestone. A total of about 54 of these windmills were constructed by the Knights of St. John, mainly between the years of 1663 and 1773. When the Industrial Revolution came, however, the use of windmills to produce flour became less efficient, and many windmills fell out of use. Over the years, most of the windmills were either demolished or converted into buildings for other uses, with the sails and the milling mechanisms removed. These decommissioned windmills are quite common across the islands of Malta, while intact windmills are rare. The Ta’ Kola Windmill in Xagħra is one of the few windmills in Malta that has retained its sails and internal milling mechanisms. The mill was originally constructed in 1725 in a different location but was rebuilt in its current location in 1787, and it was in use until 1960. Through the efforts of the family of Ġużeppi Grech, who was the windmill’s last miller, and later the museum authorities who took over the maintenance of the mill, the structure has been preserved remarkably well, and it now functions as a museum sharing the story of Malta’s windmills with all of its visitors.",
  "author": "",
  "published": "Tue, 29 Oct 2024 17:30:00 -0400",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": [
    "architecture",
    "history \u0026 culture",
    "windmills"
  ],
  "byline": "",
  "length": 2832,
  "excerpt": "This is one of the very few intact windmills built by the Knights of St. John in the island nation of Malta.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "When the Knights of St. John controlled the islands of Malta, they oversaw the construction of many public works buildings that would be of benefit to the general populace.  One of their projects was the construction of windmills for providing flour, and these buildings became central parts of the villages in which they were located. These windmills all had a very similar yet distinct design.  The base of the building was typically slightly broader than the windmill sails and was square, although some windmills had bases with other shapes.  This base structure often had two stories.  A cylindrical tower with the windmill sails stood in the center of the top of this square base.  The entire structure was typically built using beige limestone.  The combination of these design characteristics gives Maltese windmills a very distinct appearance in comparison to windmills in other countries. A total of about 54 of these windmills were constructed by the Knights of St. John, mainly between the years of 1663 and 1773.  When the industrial revolution came, however, the use of windmills to produce flour became less efficient, and many windmills fell out of use. Over the years, most of the windmills were either demolished or converted into buildings for other uses, with the sails and the milling mechanisms removed.  These decommissioned windmills are actually quite common across the islands of Malta, while intact windmills are very rare. The Ta’ Kola Windmill in Xagħra is one of the very few windmills in Malta that has retained its sails and its internal milling mechanisms.  The mill was originally constructed in 1725 in a different location but was rebuilt in its current location in 1787, and it was in use until 1960.  Through the efforts of the family of Ġużeppi Grech, who was the windmill’s last miller, and later the museum authorities who took over the maintenance of the mill, the structure has been preserved remarkably well, and it now functions as a museum sharing the story of Malta’s windmills with all of its visitors. Know Before You Go The Ta’ Kola Windmill is open seven days a week.  An admission fee is charged, but it is also possible to buy several different combination tickets that provide admission to this and other attractions including the nearby Ġgantija Archaeological Park.  Note that the ground floor is wheelchair accessible, but the upper floors are not. The windmill is located just northwest of the Ġgantija visitor center within the village of Xagħra on the island of Gozo.  People driving by car can find ample parking on the surrounding streets, while people relying on public transport can take the buses that travel either from Victoria or from Mgarr to reach the windmill.",
  "image": "https://img.atlasobscura.com/ZyJFybe3DkT1-QZsj2tTJHyOKGHUmlVPqyEZhJ8eoo0/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy84MThk/NDgxNi01YTgzLTQ5/MDQtODRmNC1iNmFl/NTkwNmUyOTQyZGQ1/MTc0Y2ZkNWE1NTZl/YWRfd2luZG1pbGw0/LmpwZw.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"place-body\"\u003e\n                  \u003cp\u003e\u003cspan\u003eWhen the Knights of St. \u003c/span\u003eJohn controlled the islands of Malta, they oversaw the construction of many public works buildings that would be of benefit to the general populace.  One of their projects was the construction of windmills for providing flour, and these buildings became central parts of the villages in which they were located.\u003c/p\u003e\n                  \u003cp\u003eThese windmills all had a very similar yet distinct design.  The base of the building was typically slightly broader than the windmill sails and was square, although some windmills had bases with other shapes.  This base structure often had two stories.  A cylindrical tower with the windmill sails stood in the center of the top of this square base.  The entire structure was typically built using beige limestone.  The combination of these design characteristics gives Maltese windmills a very distinct appearance in comparison to windmills in other countries.\u003c/p\u003e\n                  \u003cp\u003eA total of about 54 of these windmills were constructed by the Knights of St. John, mainly between the years of 1663 and 1773.  When the industrial revolution came, however, the use of windmills to produce flour became less efficient, and many windmills fell out of use. Over the years, most of the windmills were either demolished or converted into buildings for other uses, with the sails and the milling mechanisms removed.  These decommissioned windmills are actually quite common across the islands of Malta, while intact windmills are very rare.\u003c/p\u003e\n                  \u003cp\u003eThe Ta’ Kola Windmill in Xagħra is one of the very few windmills in Malta that has retained its sails and its internal milling mechanisms.  The mill was originally constructed in 1725 in a different location but was rebuilt in its current location in 1787, and it was in use until 1960.  Through the efforts of the family of Ġużeppi Grech, who was the windmill’s last miller, and later the museum authorities who took over the maintenance of the mill, the structure has been preserved remarkably well, and it now functions as a museum sharing the story of Malta’s windmills with all of its visitors.\u003c/p\u003e\n              \u003c/div\u003e\u003cdiv\u003e\n                \u003ch6\u003eKnow Before You Go\u003c/h6\u003e\n                \u003cp\u003eThe Ta’ Kola Windmill is open seven days a week.  An admission fee is charged, but it is also possible to buy several different combination tickets that provide admission to this and other attractions including the nearby \u003ca href=\"https://www.atlasobscura.com/places/ggantija-temples\"\u003eĠgantija Archaeological Park\u003c/a\u003e.  Note that the ground floor is wheelchair accessible, but the upper floors are not.\u003c/p\u003e\n\u003cp\u003eThe windmill is located just northwest of the Ġgantija visitor center within the village of Xagħra on the island of Gozo.  People driving by car can find ample parking on the surrounding streets, while people relying on public transport can take the buses that travel either from Victoria or from Mgarr to reach the windmill.\u003c/p\u003e\n              \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-09-30T13:47:00-04:00",
  "modifiedTime": null
}
