{
  "id": "418c7f11-5ae6-46a5-b880-66e3fbcf291c",
  "title": "I visited every country in the world without flying. Here are eight things I learned",
  "link": "https://www.theguardian.com/lifeandstyle/2025/apr/21/i-visited-every-country-in-the-world-without-flying-here-are-eight-things-i-learned",
  "description": "Spending nearly a decade on the move gave me a deeper understanding of the importance of conversation, people’s boundless generosity – and my limitationsI have often felt as if I was born 100 years too late. There was a time when satellites weren’t whizzing above us and everything had yet to be discovered or filmed. Growing up, it seemed as if all the great adventures had happened before I was born. But in 2013 I discovered that – although it had been attempted – no one had made an unbroken journey through every country without flying. I had a shot at becoming the first to do it.I was fascinated that such an adventure was still out there, untouched. However, I was in my 30s, I had just met a wonderful woman, my peers were having their first children (and in some cases their second) and I had a 12-year career in shipping and logistics. But I couldn’t let the idea go. So, at 34, I set off – and didn’t return home until almost a decade later. These are the lessons I learned along the way. Continue reading...",
  "author": "Thor Pedersen",
  "published": "Mon, 21 Apr 2025 09:00:32 GMT",
  "source": "https://www.theguardian.com/uk/travel/rss",
  "categories": [
    "Life and style",
    "Travel",
    "Adventure travel"
  ],
  "byline": "",
  "length": 7724,
  "excerpt": "Spending nearly a decade on the move gave me a deeper understanding of the importance of conversation, people’s boundless generosity – and my limitations",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "I have often felt as if I was born 100 years too late. There was a time when satellites weren’t whizzing above us and everything had yet to be discovered or filmed. Growing up, it seemed as if all the great adventures had happened before I was born. But in 2013 I discovered that – although it had been attempted – no one had made an unbroken journey through every country without flying. I had a shot at becoming the first to do it.I was fascinated that such an adventure was still out there, untouched. However, I was in my 30s, I had just met a wonderful woman, my peers were having their first children (and in some cases their second) and I had a 12-year career in shipping and logistics. But I couldn’t let the idea go. So, at 34, I set off – and didn’t return home until almost a decade later. These are the lessons I learned along the way.Suwałki’s 19th-century railway station. Photograph: Iwona Fijol/AlamyHuman generosity can be astoundingIt was a cold, dark night in December. A train had brought me to Suwałki, which people say is the coldest city in Poland. It was quiet. Snow was falling, but otherwise everything was still. I was carrying a piece of paper with a name, a phone number and an address for where I was supposed to be staying. But I had no sim card, so I began walking, looking for someone who could help me.Just as I was beginning to wonder if I would ever meet anyone, a woman opened her front door. I dashed over. Luckily, she spoke English and invited me in. She was happy to host me and convinced me there was no point in heading back out into the cold.I was quickly given a full plate of food and a spare bed. All this from a stranger. The next day, I was served breakfast and taken to the bus that would carry me to Lithuania.Maletsunyane Falls in Lesotho. Photograph: Maurice Brand/AlamyLesotho was country No 106 on my very long journey. Its natural beauty was immediately apparent. The whole state sits above 1,400 metres. It was suggested I go higher up into the mountains, to Semonkong. I wasn’t prepared for what I saw. Was I in Iceland, Austria, Bhutan or Bolivia? I went for a long walk across a spectacular green landscape. Birds chirped in the high grass; the air was extraordinarily fresh; the sun shone on my face from the dark-blue sky.The mountains of Lesotho are horse country. Every now and again, riders draped in thick blankets would pass. Then I reached Maletsunyane Falls. The nearly 200-metre waterfall was glistening in the sun at the end of a canyon. And I had it all to myself.People’s resilience is powerfulIn 2015, I travelled through western Africa. At the time, Guinea, Sierra Leone and Liberia were dealing with the world’s largest Ebola outbreak. A taxi driver in Guinea said to me: “Here we have everything, but we have nothing.” These countries are rich in many ways – from natural resources to beautiful landscapes – yet most of the people are not.But after only an hour in Sierra Leone, I had been invited to a wedding: loads of music, lots of people in fancy clothes, an abundance of food and drink, small talk and dancing. No matter how hard life gets – and my journey left me in no doubt that it can get impossibly hard – people always find a way to laugh, play and fall in love.Pedersen gets a ride with a truck driver in Central African Republic. Photograph: Courtesy of Thor PedersenIsolating yourself is a mistakeWhen you take public transport in Denmark, where I’m from, you always pick the seat farthest from everyone else. We value our privacy and respect the privacy of others. But in much of the world, the best seats are the ones next to other passengers. Where else will you find conversation?In west and central Africa, I found that everyone in a bus or a bush taxi would immediately form a unit, sharing food and stories and holding babies for one another. I was infuriated when a driver seemed ready to leave me at a corrupt checkpoint – until a woman behind me on the bus explained he had been playing a game to put pressure on the armed guards. This was a simple, lonely checkpoint on a dirt road. There was nothing else nearby, all my paperwork was in order and the soldiers knew this. If the driver had left me at the checkpoint, I would have become their problem. Where would I have slept? What would I have eaten? The soldiers didn’t need that kind of headache. On that journey, I learned a lesson: we were a team after all.What you want and what you need are not the same thingJust about anything can become routine and begin to feel like work – even travelling to every country in the world. It is rare for people to travel constantly for much more than a year because it wears the soul; most long-term travellers return home exhausted to reflect and recharge.skip past newsletter promotionafter newsletter promotionI pushed myself for nearly a decade. Buses, trains, boats, people, food, unpacking, packing, embassies, borders, bureaucracy – a long tunnel of countries. I hit a wall after about two years, but had to push through it to reach my goal. I learned the difference between what I want and what I need. I learned to live on a rock and how to engage in conversation with absolutely anyone. Once I returned home, I realised the only things that had kept their value were the relationships and conversations I had had. Everything else seemed perishable.Pedersen on the coast near his home in Denmark. Photograph: Anders Rye Skjoldjensen/The GuardianYou can form connections without sharing a languageI once had a 12-hour train journey from Belarus to Moscow during which no one else spoke anything but Russian. It didn’t seem to bother them that I didn’t know the language beyond nyet or da; they sat and spoke to me in Russian for several hours, while we shared food and vodka.It really isn’t hard to forge connections with people. More often than not, I have found myself laughing with a complete stranger in spite of our lack of a common language. I have been invited into people’s homes based on gestures alone. I have negotiated prices by showing banknotes and adding or removing some until we agreed on the value. And more than once, finding myself broken and in despair, the glimpse of a child’s smile helped me to mend.Slow travel teaches you how big the world isIt is hard to grasp the distance between London and New York when you fly. But when you travel via seven ships and several buses, it helps you to understand. I have seen deserts turn lush, bushes turn to trees, trees turn to forests, flat landscapes rise into mountains, villages turn into cities and rivers become oceans. I have seen where countries meet and there is rarely a clear difference between one side and the other: people tend to wear the same clothes, eat the same food and speak a common language. In my experience, you often need to travel quite far before you notice changes. But all it takes to see the size of our world is to slow down.Pedersen about to embark on a container ship from Praia, Cape Verde to Guinea Bissau. Photograph: Courtesy of Thor PedersenThe constant challenges of travelling provide an educationWe gain life experience at a much faster rate when we are challenged and under pressure, as we are when we travel abroad: what is dangerous? How do you greet people? Where do you get what you need?My years abroad led me to a deeper understanding of my limitations. I learned languages, explored new cultures, and expanded my knowledge of geography, geopolitics, humanitarian work and much more. It has been an education; nearly two years after returning home, I still have a lot on which to reflect. I was 34 when I left home and 44 when I returned. But, considering my life experience, I wonder how old I really am.",
  "image": "https://i.guim.co.uk/img/media/ee36518c24529634d08c9f59caea39e35319dc60/0_146_3262_1957/master/3262.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=61064453b20e7204f7ff18763c04941d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003eI\u003c/span\u003e have often felt as if I was born 100 years too late. There was a time when satellites weren’t whizzing above us and everything had yet to be discovered or filmed. Growing up, it seemed as if all the great adventures had happened before I was born. But in 2013 I discovered that – although it had been attempted – no one had made an unbroken journey through every country without flying. I had a shot at becoming the first to do it.\u003c/p\u003e\u003cp\u003eI was fascinated that such an adventure was still out there, untouched. However, I was in my 30s, I had just met a wonderful woman, my peers were having their first children (and in some cases their second) and I had a 12-year career in shipping and logistics. But I couldn’t let the idea go. So, at 34, I set off – and didn’t return home until almost a decade later. These are the lessons I learned along the way.\u003c/p\u003e\u003cfigure id=\"d46b621f-9bbe-4bf1-82de-88689eb1ff2a\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"An imposing red-brick building. The ground is covered in ice, with piles of snow gathered around the station\" src=\"https://i.guim.co.uk/img/media/c366037f54e628d2d221850f003c556103656744/0_0_5883_3922/master/5883.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"296.66666666666663\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eSuwałki’s 19th-century railway station.\u003c/span\u003e Photograph: Iwona Fijol/Alamy\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"human-generosity-can-be-astounding\"\u003eHuman generosity can be astounding\u003c/h2\u003e\u003cp\u003eIt was a cold, dark night in December. A train had brought me to Suwałki, which people say is \u003ca href=\"https://www.theguardian.com/world/2022/jun/25/russians-could-come-any-time-fear-suwalki-gap-eu-border\" data-link-name=\"in body link\"\u003ethe coldest city in Poland\u003c/a\u003e. It was quiet. Snow was falling, but otherwise everything was still. I was carrying a piece of paper with a name, a phone number and an address for where I was supposed to be staying. But I had no sim card, so I began walking, looking for someone who could help me.\u003c/p\u003e\u003cp\u003eJust as I was beginning to wonder if I would ever meet anyone, a woman opened her front door. I dashed over. Luckily, she spoke English and invited me in. She was happy to host me and convinced me there was no point in heading back out into the cold.\u003c/p\u003e\u003cp\u003eI was quickly given a full plate of food and a spare bed. All this from a stranger. The next day, I was served breakfast and taken to the bus that would carry me to Lithuania.\u003c/p\u003e\u003cfigure id=\"1aec932f-7741-403b-89ab-962e69f5e2c7\" data-spacefinder-role=\"showcase\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-3\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=880\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=880\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=800\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1140px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=800\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=640\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=640\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Amid a lush, verdant environment, water pours down a sheer cliff\" src=\"https://i.guim.co.uk/img/media/8418ef22a6df27ed7d3acc6fbc6b8bde123b0779/0_0_6981_4659/master/6981.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"296.9853889127632\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eMaletsunyane Falls in Lesotho.\u003c/span\u003e Photograph: Maurice Brand/Alamy\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eLesotho was country No 106 on my very long journey. Its natural beauty was immediately apparent. The whole state sits above 1,400 metres. It was suggested I go higher up into the mountains, to Semonkong. I wasn’t prepared for what I saw. Was I in Iceland, Austria, Bhutan or Bolivia? I went for a long walk across a spectacular green landscape. Birds chirped in the high grass; the air was extraordinarily fresh; the sun shone on my face from the dark-blue sky.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.theguardian.com/world/gallery/2016/oct/17/riding-southern-wilds-horsemen-semonkong-lesotho-in-pictures?page=with:img-4\" data-link-name=\"in body link\"\u003eThe mountains of Lesotho are horse country\u003c/a\u003e. Every now and again, riders draped in thick blankets would pass. Then I reached Maletsunyane Falls. The nearly 200-metre waterfall was glistening in the sun at the end of a canyon. And I had it all to myself.\u003c/p\u003e\u003ch2 id=\"peoples-resilience-is-powerful\"\u003ePeople’s resilience is powerful\u003c/h2\u003e\u003cp\u003eIn 2015, I travelled through western Africa. At the time, Guinea, Sierra Leone and Liberia were dealing with the world’s largest Ebola outbreak. A taxi driver in Guinea said to me: “Here we have everything, but we have nothing.” These countries are rich in many ways – from natural resources to beautiful landscapes – yet most of the people are not.\u003c/p\u003e\u003cp\u003eBut after only an hour in Sierra Leone, I had been invited to a wedding: loads of music, lots of people in fancy clothes, an abundance of food and drink, small talk and dancing. No matter how hard life gets – and my journey left me in no doubt that it can get impossibly hard – people always find a way to laugh, play and fall in love.\u003c/p\u003e\u003cfigure id=\"138866c7-09e9-480e-ab52-1d3bae9a5846\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-4\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Pedersen gets a ride with a truck driver in Central African Republic.\" src=\"https://i.guim.co.uk/img/media/0eaa52cb6f168b69bef703aa0578437267af3161/0_0_1280_960/master/1280.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"333.75\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003ePedersen gets a ride with a truck driver in Central African Republic.\u003c/span\u003e Photograph: Courtesy of Thor Pedersen\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"isolating-yourself-is-a-mistake\"\u003eIsolating yourself is a mistake\u003c/h2\u003e\u003cp\u003eWhen you take public transport in Denmark, where I’m from, you always pick the seat farthest from everyone else. We value our privacy and respect the privacy of others. But in much of the world, the best seats are the ones next to other passengers. Where else will you find conversation?\u003c/p\u003e\u003cp\u003eIn west and central Africa, I found that everyone in a bus or a bush taxi would immediately form a unit, sharing food and stories and holding babies for one another. I was infuriated when a driver seemed ready to leave me at a corrupt checkpoint – until a woman behind me on the bus explained he had been playing a game to put pressure on the armed guards. This was a simple, lonely checkpoint on a dirt road. There was nothing else nearby, all my paperwork was in order and the soldiers knew this. If the driver had left me at the checkpoint, I would have become their problem. Where would I have slept? What would I have eaten? The soldiers didn’t need that kind of headache. On that journey, I learned a lesson: we were a team after all.\u003c/p\u003e\u003ch2 id=\"what-you-want-and-what-you-need-are-not-the-same-thing\"\u003eWhat you want and what you need are not the same thing\u003c/h2\u003e\u003cp\u003eJust about anything can become routine and begin to feel like work – even travelling to every country in the world. It is rare for people to travel constantly for much more than a year because it wears the soul; most long-term travellers return home exhausted to reflect and recharge.\u003c/p\u003e\u003cfigure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"\u003e\u003ca data-ignore=\"global-link-styling\" href=\"#EmailSignup-skip-link-20\"\u003eskip past newsletter promotion\u003c/a\u003e\u003cp id=\"EmailSignup-skip-link-20\" tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\"\u003eafter newsletter promotion\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eI pushed myself for nearly a decade. Buses, trains, boats, people, food, unpacking, packing, embassies, borders, bureaucracy – a long tunnel of countries. I hit a wall after about two years, but had to push through it to reach my goal. I learned the difference between what I want and what I need. I learned to live on a rock and how to engage in conversation with absolutely anyone. Once I returned home, I realised the only things that had kept their value were the relationships and conversations I had had. Everything else seemed perishable.\u003c/p\u003e\u003cfigure id=\"49d96965-6e2b-4a7a-9494-5ad22764cd94\" data-spacefinder-role=\"showcase\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-5\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=880\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=880\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=800\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1140px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=800\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=640\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=640\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Pedersen on the coast near his home in Denmark.\" src=\"https://i.guim.co.uk/img/media/84c56d3f2fcc87a73b008dd7fe2a05858b5d873f/897_1351_6398_3839/master/6398.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"267.01391059706157\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003ePedersen on the coast near his home in Denmark.\u003c/span\u003e Photograph: Anders Rye Skjoldjensen/The Guardian\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"you-can-form-connections-without-sharing-a-language\"\u003eYou can form connections without sharing a language\u003c/h2\u003e\u003cp\u003eI once had a 12-hour train journey from Belarus to Moscow during which no one else spoke anything but Russian. It didn’t seem to bother them that I didn’t know the language beyond \u003cem\u003enyet\u003c/em\u003e or \u003cem\u003eda\u003c/em\u003e; they sat and spoke to me in Russian for several hours, while we shared food and vodka.\u003c/p\u003e\u003cp\u003eIt really isn’t hard to forge connections with people. More often than not, I have found myself laughing with a complete stranger in spite of our lack of a common language. I have been invited into people’s homes based on gestures alone. I have negotiated prices by showing banknotes and adding or removing some until we agreed on the value. And more than once, finding myself broken and in despair, the glimpse of a child’s smile helped me to mend.\u003c/p\u003e\u003ch2 id=\"slow-travel-teaches-you-how-big-the-world-is\"\u003eSlow travel teaches you how big the world is\u003c/h2\u003e\u003cp\u003eIt is hard to grasp the distance between London and New York when you fly. But when you travel via seven ships and several buses, it helps you to understand. I have seen deserts turn lush, bushes turn to trees, trees turn to forests, flat landscapes rise into mountains, villages turn into cities and rivers become oceans. I have seen where countries meet and there is rarely a clear difference between one side and the other: people tend to wear the same clothes, eat the same food and speak a common language. In my experience, you often need to travel quite far before you notice changes. But all it takes to see the size of our world is to slow down.\u003c/p\u003e\u003cfigure id=\"60aba382-a9d9-429b-9de3-69160bd2ff21\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-6\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Pedersen about to embark on a container ship from Praia, Cape Verde to Guinea Bissau.\" src=\"https://i.guim.co.uk/img/media/d39e083f29195b7977a94c97370f88e8a763ac33/0_0_1280_960/master/1280.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"333.75\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003ePedersen about to embark on a container ship from Praia, Cape Verde to Guinea Bissau.\u003c/span\u003e Photograph: Courtesy of Thor Pedersen\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"the-constant-challenges-of-travelling-provide-an-education\"\u003eThe constant challenges of travelling provide an education\u003c/h2\u003e\u003cp\u003eWe gain life experience at a much faster rate when we are challenged and under pressure, as we are when we travel abroad: what is dangerous? How do you greet people? Where do you get what you need?\u003c/p\u003e\u003cp\u003eMy years abroad led me to a deeper understanding of my limitations. I learned languages, explored new cultures, and expanded my knowledge of geography, geopolitics, humanitarian work and much more. It has been an education; nearly two years after returning home, I still have a lot on which to reflect. I was 34 when I left home and 44 when I returned. But, considering my life experience, I wonder how old I really am.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-21T09:00:32Z",
  "modifiedTime": "2025-04-21T09:00:32Z"
}
