{
  "id": "d45e82d1-d824-4c3d-9f9a-4fff8a2962f4",
  "title": "'Zeitpyramide' ('Time Pyramid') in Wemding, Germany",
  "link": "https://www.atlasobscura.com/places/zeitpyramide-wemding",
  "description": "Like most other German towns, Wemding is proud of its long history and heritage. Its old town is dominated by typical Bavarian architecture. But on its outskirts, you will find a rather austere modern sculpture, consisting of just four concrete blocks on an otherwise empty platform. While many may dismiss it, it holds a connection to the deep history of its town. In 1993, Wemding celebrated 1,200 years since its first written mention in a medieval land grant. To illustrate what such a long period of time means, local artist Manfred Laber devised the Zeitpyramide (\"time pyramid\"). It is to consist of 120 blocks in a step pyramid shape, with one placed every 10 years. And nobody alive today can hope to see it anywhere near complete, as even the first layer will not be finished until 2623. One may only view a model of the completed sculpture at the Kunstmuseum Donau-Ries in Wemding. So far four blocks have been placed, with the most recent laying in 2023 live-streamed and available on the Wemdinger Zeitpyramide Foundation's website. The next block is scheduled to be placed in 2033. However, due to a simple mathematical flaw called the picket fence error, it turns out the pyramid will not take 1,200 years to complete. Since the first block was laid in 1993 rather than 2003, the 120th block will be placed 10 years early in 3183. A YouTube channel called Stand-up Maths identified the error and proposed an alternative 121-block design that is not in a pyramidal shape. However, the Wemdinger Zeitpyramide Foundation seems content with Laber's original plan.",
  "author": "",
  "published": "Tue, 26 Nov 2024 16:00:00 -0500",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": [
    "history",
    "mistakes",
    "sculptures",
    "art outside",
    "art",
    "installations",
    "pyramids",
    "time"
  ],
  "byline": "",
  "length": 1610,
  "excerpt": "An abstract sculpture that will be a work in progress for the next 1,000 years.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "Like most other German towns, Wemding is proud of its long history and heritage. Its old town is dominated by typical Bavarian architecture. But on its outskirts, you will find a rather austere modern sculpture, consisting of just four concrete blocks on an otherwise empty platform. While many may dismiss it, it holds a connection to the deep history of its town. In 1993, Wemding celebrated 1,200 years since its first written mention in a medieval land grant. To illustrate what such a long period of time means, local artist Manfred Laber devised the Zeitpyramide (“time pyramid”). It is to consist of 120 blocks in a step pyramid shape, with one placed every 10 years. And nobody alive today can hope to see it anywhere near complete, as even the first layer will not be finished until 2623. One may only view a model of the completed sculpture at the Kunstmuseum Donau-Ries in Wemding. So far four blocks have been placed, with the most recent laying in 2023 live-streamed and available on the Wemdinger Zeitpyramide Foundation’s website. The next block is scheduled to be placed in 2033. However, due to a simple mathematical flaw called the picket fence error, it turns out the pyramid will not take 1,200 years to complete. Since the first block was laid in 1993 rather than 2003, the 120th block will be placed 10 years early in 3183. A YouTube channel called Stand-up Maths identified the error and proposed an alternative 121-block design that is not in a pyramidal shape. However, the Wemdinger Zeitpyramide Foundation seems content with Laber’s original plan.",
  "image": "https://img.atlasobscura.com/QZPF06ZpmXk17qy5XyA6h8a4hOGd-YKWoJxxj_MAfu8/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9jYTZm/MjJlMC0xNWVlLTQ3/MmQtYWJjNS0wOTQ5/N2VhY2JkOGNlNjI0/YWY0OTNlZGY3MGFl/MzlfaW1hZ2UuanBl/Zw.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"place-body\"\u003e\n                  \u003cp\u003e\u003cspan\u003eLike most other German towns, \u003c/span\u003eWemding is proud of its long history and heritage. Its old town is dominated by typical Bavarian architecture. But on its outskirts, you will find a rather austere modern sculpture, consisting of just four concrete blocks on an otherwise empty platform. While many may dismiss it, it holds a connection to the deep history of its town.\u003c/p\u003e\n                  \u003cp\u003eIn 1993, Wemding celebrated 1,200 years since its first written mention in a medieval land grant. To illustrate what such a long period of time means, local artist Manfred Laber devised the \u003cem\u003eZeitpyramide\u003c/em\u003e (“time pyramid”). It is to consist of 120 blocks in a step pyramid shape, with one placed every 10 years. And nobody alive today can hope to see it anywhere near complete, as even the first layer will not be finished until 2623. One may only view a model of the completed sculpture at the \u003ca href=\"http://www.kunstmuseum-donauries.de/aktuell.htm\"\u003eKunstmuseum Donau-Ries\u003c/a\u003e in Wemding. So far four blocks have been placed, with the most recent laying in 2023 live-streamed and available on the Wemdinger Zeitpyramide Foundation’s website. The next block is scheduled to be placed in 2033.\u003c/p\u003e\n                  \u003cp\u003eHowever, due to a simple mathematical flaw called the picket fence error, it turns out the pyramid will not take 1,200 years to complete. Since the first block was laid in 1993 rather than 2003, the 120th block will be placed 10 years early in 3183. A YouTube channel called \u003ca href=\"https://www.youtube.com/watch?v=FAdmpAZTH_M\"\u003eStand-up Maths identified the error\u003c/a\u003e and proposed an alternative 121-block design that is not in a pyramidal shape. However, the Wemdinger Zeitpyramide Foundation seems content with Laber’s original plan.\u003c/p\u003e\n              \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-26T16:00:00-05:00",
  "modifiedTime": null
}
