[
  {
    "id": "ed834bd2-fb17-42f3-8ed6-5cd2c100cfd1",
    "title": "Charlie Cox Says Daredevil Born Again Is “Darker” Than Netflix Series",
    "link": "https://www.escapistmagazine.com/charlie-cox-says-daredevil-born-again-is-darker-than-netflix-series/",
    "description": "",
    "author": "Jorge A. Aguilar",
    "published": "Tue, 17 Dec 2024 20:45:09 +0000",
    "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/06/Daredevil_Season_2_Netflix_key_art.jpg?w=1024\u0026resize=1200%2C675",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "Movies \u0026 TV",
      "Movies and TV",
      "News",
      "Daredevil",
      "Daredevil: Born Again",
      "Marvel",
      "mcu"
    ]
  },
  {
    "id": "ce853cae-2737-42cc-a5a1-b1a9cc8fcb76",
    "title": "‘That’s It?’: News On Beyond the Spider-Verse Finally Come Out, But It Actually Made Fans More Pessimistic Than Ever",
    "link": "https://www.escapistmagazine.com/thats-it-news-on-beyond-the-spider-verse-finally-come-out-but-it-actually-made-fans-more-pessimistic-than-ever/",
    "description": "",
    "author": "Matthew Razak",
    "published": "Tue, 17 Dec 2024 18:56:59 +0000",
    "image": "https://s.w.org/images/core/emoji/15.0.3/72x72/1f62d.png",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "Movies \u0026 TV",
      "News",
      "Featured",
      "Spider-Man: Beyond the Spider-Verse"
    ]
  },
  {
    "id": "b23ebb6f-c5f3-4d90-b92d-d4bd1486875a",
    "title": "Microsoft's Xbox Wireless Controllers Are On Sale For As Low As $35 At Amazon",
    "link": "https://www.gamespot.com/gallery/microsofts-xbox-wireless-controllers-are-on-sale-for-as-low-as-35-at-amazon/2900-5946/",
    "description": "Official Xbox Wireless Controllers by Microsoft are discounted to low prices ahead of Christmas. Some of these deals mirror what we saw during Black Friday, but a few controllers are actually on sale for less right now. For instance, you can get the Robot White Xbox Wireless Controller for only $35 at Amazon and Best Buy. That's the lowest price of the year for Microsoft's wireless controller for Xbox Series X|S, Xbox One, and PC. The most recent Special Edition Xbox Controller, the transparent Ghost Cipher, is on sale for only $45 at Amazon and Target. And Walmart has several Special Edition camouflage controllers for $45, too. Meanwhile, you can also get the Xbox Elite Series 2 Wireless Controller for an all-time low price of $124 at Amazon and Walmart. For more details, check out our dedicated story on all of your Elite Series 2 deal options.Best Xbox Controller Holiday Deals Available NowRobot White (Amazon) -- $35 ($60) | Also at Best BuyCarbon Black (Amazon) -- $39 ($60) | Also at WalmartGhost Cipher Special Edition (Amazon) -- $45 ($70) | Also at TargetSky Cipher Special Edition (Amazon) -- $50 ($70) | Also at WalmartArctic Camo Special Edition (Walmart) -- $45 ($70)Mineral Camo Special Edition (Walmart) -- $45 ($70)Daystrike Camo Special Edition (Walmart) -- $45 ($70)Nocturnal Vapor Special Edition (Walmart) -- $45 ($70)Sky Cipher Controller + Fire 4K Stick + Game Pass Ultimate -- $75 ($137)Sky Cipher Controller + Fire 4K Stick Max + Game Pass Ultimate -- $80 ($147)We've rounded up the best Xbox controller deals below. Walmart, Amazon, Best Buy, and Target are all offering discounts on select models this week. For more details on the Xbox Elite Series 2 Wireless Controller, check out our dedicated story on all of your Elite Series 2 deal options.And if you're in the market for an Xbox console, Best Buy has the recently released 1TB All-Digital Xbox Series X for $400 (was $450).Xbox Wireless Controller Deals at:AmazonWalmartBest BuyTarget Xbox Wireless Controller - Robot White$35 ($60) at Amazon \u0026 Best Buy | $39 at Walmart See at Amazon See at Best Buy Xbox Wireless Controller - Carbon Black$39 ($60) See at Amazon See at Best BuySee at Walmart Xbox Wireless Controller - Ghost Cipher Special Edition$45.49 ($70)The Ghost Cipher is the newest Xbox Wireless Controller. It just released in October, but you can grab one for $25 off at Amazon or Target. See at Amazon See at Target Xbox Elite Series 2 Wireless Controller for Best-Ever Price at Amazon$124 ($180) See at Amazon See at WalmartSee at TargetThe Xbox Elite Series 2 is the best controller for Xbox and one of the best controllers for PC, too--and it's never been available for this low of a price at Amazon, Walmart, or Target.This pro-style controller is built with better components and offers the best feel of any Xbox controller you can buy today. You can use the Xbox Accessories app on Xbox Series X|S, Xbox One, or PC to create three custom control profiles and modify settings such as stick and trigger sensitivity.The Elite Series 2 comes with a bunch of additional components that can be swapped on the fly thanks to the controller's magnetic input design. Here's what comes inside the box:Xbox Elite Series 2 Accessories:6 swappable analog sticks - standard pair, \"classic\" (smaller) pair, one wide dome, one tall.4 removable back paddles2 D-pads - the one shown above and a standard cross designCharging dockBraided USB-C cableThumbstick tension adjustment toolHardshell carrying case with dedicated slots for all components Xbox Wireless Controller - Arctic Camo Special Edition$45 ($70) See at Walmart Xbox Wireless Controller - Mineral Camo Special Edition$45 ($70) See at Walmart Xbox Wireless Controller - Daystrike Camo Special Edition$45 ($70) See at Walmart Xbox Wireless Controller - Sky Cipher Special Edition$50 ($70) See at Amazon See at Best Buy Xbox Wireless Controller + 4K Fire Stick + Game Pass Ultimate$75 ($131-$136) See at Amazon This $75 bundle includes an Xbox Wireless Controller, Amazon Fire TV Stick 4K, and one month of Xbox Game Pass Ultimate. This is essentially an Xbox Cloud Gaming Starter Kit, as you don't even need a console or PC to stream hundreds of games in the Game Pass library, including the recently released Call of Duty: Black Ops 6.Amazon's 4K Fire Sticks now support the Game Pass app. Keep in mind you need to be a Game Pass Ultimate subscriber to stream Game Pass games, but you get 30 days of access with this bundle.Choose your controller:Sky Cipher Special Edition ControllerAstral Purple ControllerRobot White ControllerShock Blue ControllerDeep Pink Controller Xbox Wireless Controller + 4K Fire Stick Max + Game Pass Ultimate$80 ($141-$147)For five extra bucks, you can upgrade to the 4K Fire Stick Max, a slightly more premium option with better overall performance. See at Amazon Choose your controller:Sky Cipher Special Edition ControllerAstral Purple ControllerRobot White ControllerShock Blue ControllerDeep Pink Controller Xbox Wireless Controller - Shock Blue$45 ($65) See at Amazon See at WalmartSee at Best Buy Xbox Wireless Controller - Velocity Green$45 ($65) See at Amazon See at WalmartSee at Best Buy Xbox Wireless Controller - Pulse Red$44 ($65) See at Walmart See at Best Buy Xbox Wireless Controller - Electric Volt$45 ($65) See at Amazon See at WalmartSee at Best Buy Xbox Wireless Controller - Astral Purple$45 ($65) See at Best Buy See at Amazon See at Walmart Xbox Wireless Controller - Deep Pink$45 ($65) See at Amazon See at WalmartSee at Best Buy Xbox Elite Series 2 Core Wireless Controller (White)$98 ($130) See at Amazon See at WalmartSee at TargetThe Elite Series 2 Core Wireless Controller is the same premium controller, just without the swappable components. $98 is an awesome price for the Elite Series 2 Core, and you can buy accessories separately, such as these great back paddles by Scuf for $15 (was $20) at Amazon. That said, due to the extremely good deal on the standard Elite Series 2 Controller, you'll get more bang for your buck if you opt for that one.With the Elite Series 2 Core, you'll get one D-pad and two thumbsticks. For only $26 more, you're getting all of these accessories:Elite Series 2 Controller -- $124 ($180) | Here's what you're getting:6 swappable analog sticks - standard pair, \"classic\" (smaller) pair, one wide dome, one tall.4 removable back paddles2 D-pads - the one shown above and a standard cross designCharging dockBraided USB-C cableThumbstick tension adjustment toolHardshell carrying case with dedicated slots for all components Xbox Elite Series 2 Core Wireless Controller (Red)$96 ($140) at Target | $98 at Walmart See at Target See at Walmart Xbox Elite Series 2 Core Wireless Controller (Blue)$98 ($140) See at Amazon See at WalmartSee at Target Xbox Wireless Controller - Nocturnal Vapor Special Edition$60 ($70) See at GameStop Xbox Wireless Controller - Stellar Shift Special Edition$50 ($70) See at Best Buy Xbox Wireless Controller - Gold Shadow Special Edition$60 ($70) See at Target",
    "author": "",
    "published": "Tue, 17 Dec 2024 14:48:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1595/15950357/4417448-xboxwirelesscontrollersholidaydeals.png",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "57ac7341-000d-4dc6-a3df-46506196f0d3",
    "title": "Gift Idea: The Only Official Lord Of The Rings Coloring Books Are On Sale At Amazon",
    "link": "https://www.gamespot.com/articles/gift-idea-the-only-official-lord-of-the-rings-coloring-books-are-on-sale-at-amazon/1100-6528273/?ftag=CAD-01-10abi2f",
    "description": "If you're scrambling for a last-minute gift idea for a J.R.R. Tolkien fan, the recently reissued Lord of the Rings and Hobbit coloring books could be a great choice. There's also an official coloring book for The Lord of the Rings: The War of the Rohirrim, which just debuted in theaters last week. These are the only official coloring books based on Peter Jackson's two film trilogies and the brand-new anime.The Lord of the Rings Official Coloring BooksThe Lord of the Rings: The War of the Rohirrim Official Coloring Book -- $14.39 ($18)The Lord of the Rings Movie Trilogy Coloring Book -- $14.39 ($18)The Hobbit Movie Trilogy Coloring Book: Heroes and Villains -- $14.39 ($18) | B1G1 50% offAll three are on sale for $14.39 (normally $18 each), and The Hobbit Coloring Book is eligible for Amazon's Buy One, Get One 50% Off Book Sale.Each of the Lord of the Rings coloring books includes at least 80 pages of unique images of characters like Gandalf and Frodo and iconic locations like Hobbiton and Rivendell to color in. While these are perfect gifts for younger fans, the drawings are detailed enough to be a relaxing, creative activity for adults.Continue Reading at GameSpot",
    "author": "",
    "published": "Tue, 17 Dec 2024 12:56:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1701/17013431/4410803-coloringbooks.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "a913cf83-ebd2-4735-8c69-8d2319ea90e9",
    "title": "Need for Speed Turns 30: The Lasting Legacy of EA’s Fastest Franchise",
    "link": "https://www.ign.com/articles/need-for-speed-turns-30-the-lasting-legacy-of-eas-fastest-franchise",
    "description": "NFS development veterans discuss what makes this rampaging racing series so special.",
    "author": "Luke Reilly",
    "published": "Tue, 17 Dec 2024 23:20:27 +0000",
    "image": "https://assets-prd.ignimgs.com/2024/12/12/need-for-speed-column-1733991393784.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "b25ffc24-6859-479c-8955-a96bfe9d8c26",
    "title": "Indiana Jones and the Great Circle Update Dramatically Improves Lighting Effects on Xbox",
    "link": "https://www.ign.com/articles/indiana-jones-and-the-great-circle-update-dramatically-improves-lighting-effects-on-xbox",
    "description": "A new update for Indiana Jones and the Great Circle appears to have greatly improved the lighting effects achieved on the Xbox Series X and S.",
    "author": "Matt Kim",
    "published": "Tue, 17 Dec 2024 23:02:56 +0000",
    "image": "https://assets-prd.ignimgs.com/2024/08/23/indiana-jones-great-circle-gamescom-2024-1724419390929.png",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "389ee151-d5a4-46cc-8da9-0fbb581af62b",
    "title": "Here's One Thing Marvel Rivals Won't Copy From Overwatch 2",
    "link": "https://kotaku.com/marvel-rivals-role-queue-matchmaking-update-netease-ps5-1851723290",
    "description": "Guangyun “Guangguang” Chen, creative director behind Marvel Rivals, says that while many players have requested a role queue system, a matchmaking option to help create balanced teams, there are currently no plans to implement one in the free-to-play character shooter.Read more...",
    "author": "Zack Zwiezen",
    "published": "Tue, 17 Dec 2024 20:50:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/4537f4257f6eee296b48458daff369e8.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "overwatch 2",
      "overwatch",
      "marvel rivals",
      "cooperative video games",
      "windows games",
      "multiplayer video games",
      "hero shooter",
      "multiplayer online games",
      "sports",
      "netease",
      "chen"
    ]
  },
  {
    "id": "fb3bd7e8-b00a-4720-9e00-dfa9acbbcfe6",
    "title": "19 Awesome-Looking Games From The Game Awards Day Of The Devs Showcase You Probably Missed",
    "link": "https://kotaku.com/day-devs-game-awards-2024-indie-trailers-tankhead-1851718871",
    "description": "We used to only get a Day of the Devs showcase once a year during the summer. Now we get an encore during the holidays as well. This year’s Day of the Devs: Game Awards 2024 Edition didn’t disappoint either. Every time I think the heavily curated, very personal, extremely intimate showcase can’t possibly top the last…Read more...",
    "author": "Ethan Gach",
    "published": "Tue, 17 Dec 2024 20:40:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/90c7b0afe35b3fc22bfb23ca6e90138e.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "epic games store",
      "wall e",
      "wishlist",
      "steam",
      "lorraine bowen",
      "kirby",
      "freeware",
      "yoshi",
      "metal gear solid",
      "braid",
      "joshua boggs",
      "indie games",
      "richard atlas",
      "windows games",
      "monty python",
      "single player video games"
    ]
  },
  {
    "id": "4993b351-4d73-4ef9-900c-3ff889dd7554",
    "title": "PS Blog Game of the Year 2024: The Winners",
    "link": "https://blog.playstation.com/2024/12/17/ps-blog-game-of-the-year-2024-the-winners/",
    "description": "The polls for the PlayStation Game of the Year 2024 awards closed last week and with the numbers crunched – totalling over 1.6 million votes globally – we can reveal this year’s top contenders across the 19 categories, as shaped solely by your choices. While four titles earned trophies per category, there were numerous games […]",
    "author": "",
    "published": "Tue, 17 Dec 2024 13:01:20 +0000",
    "image": "https://live.staticflickr.com/65535/54208388706_53f0c31a42_o.jpg",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "69f4a10d-5220-48c6-80f0-844b7d05dd95",
    "title": "Stellar Blade’s holiday-themed event brings new costumes, mini-game, and more Dec 17",
    "link": "https://blog.playstation.com/2024/12/16/stellar-blades-holiday-themed-event-brings-new-costumes-mini-game-and-more-dec-17/",
    "description": "Experience the magic of the holidays in Stellar Blade. Xion, adorned with warm, festive lights, is ready to welcome you with the spirit of hope and humanity. Join us for a special event designed to bring joy and comfort to your everyday life. A Xion filled with seasonal romance awaits you on December 17! Holiday […]",
    "author": "DongKi Lee",
    "published": "Mon, 16 Dec 2024 15:00:09 +0000",
    "image": "https://blog.playstation.com/tachyon/2024/12/372ca7782e619ee1837a864f11813c9cdfbb74a6-scaled.jpeg",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "PS5",
      "shift up",
      "stellar blade"
    ]
  },
  {
    "id": "d5bd3a2a-fc64-47bb-a159-99c81adb2223",
    "title": "I can't bear to play much of free horror game Toy Box, but I love the concept of pulling talking toys apart",
    "link": "https://www.rockpapershotgun.com/i-cant-bear-to-play-much-of-free-horror-game-toy-box-but-i-love-the-concept-of-pulling-talking-toys-apart",
    "description": "Toy Box sounds like a very Xmassy game, but then you watch a trailer, and realise that it is not very Xmassy at all. It's a free visual novel with a macabre puzzling element. The setup is that you're a toy inspector working for a jovial Grand Toy Maker, his face hidden above the top of the screen. Your job is to disassemble toys - five in all - according to his eldritch written instructions, and either \"salvage\" them or \"sentence\" them to the incinerator. Read more",
    "author": "Edwin Evans-Thirlwell",
    "published": "Tue, 17 Dec 2024 16:56:32 +0000",
    "image": "https://assetsio.gnwcdn.com/1_z0EnbXD.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "Horror",
      "Indie",
      "Visual Novel \u0026 Dating",
      "Toy Box",
      "Puzzle",
      "PC"
    ]
  },
  {
    "id": "22743d76-caa3-44ce-b8c0-fe55ddd4945a",
    "title": "Elden Ring: Nightreign will support singleplayer, but it might not reward it",
    "link": "https://www.rockpapershotgun.com/elden-ring-nightreign-will-support-singleplayer-but-it-might-not-reward-it",
    "description": "Great was the adulation last week when FromSoftware announced a new Elden Ring game, Elden Ring: Nightreign - and great the lamentation from certain quarters when it was revealed to be a co-op-focussed experience. If you missed the reveal, perhaps because you value sleep over the spectacle of Geoff Keighley's fashion friends, let me catch you up: in Nightreign, you pick one of eight preset characters and explore a parallel-universe version of Elden Ring's Limgrave map, fighting lesser foes and levelling up quickly so that you can battle a boss at the end of each 15-minute in-game day. Read more",
    "author": "Edwin Evans-Thirlwell",
    "published": "Tue, 17 Dec 2024 12:56:12 +0000",
    "image": "https://assetsio.gnwcdn.com/elden-ring-nightreign-mage.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "Xbox One",
      "PS5",
      "PS4",
      "Elden Ring",
      "Bandai Namco Entertainment",
      "Single Player",
      "RPG: Action",
      "Third person",
      "Fantasy",
      "Action Adventure",
      "Multiplayer Cooperative",
      "Open World",
      "RPG",
      "Xbox Series X/S",
      "FromSoftware",
      "Multiplayer Competitive",
      "Elden Ring: Nightreign",
      "PC"
    ]
  },
  {
    "id": "0cc15006-c19e-4d73-aafa-e2aa56473657",
    "title": "Stars Reach and Looking in on Homestead Progress",
    "link": "https://tagn.wordpress.com/2024/12/17/stars-reach-and-looking-in-on-homestead-progress/",
    "description": "The homesteading update that landed two Saturdays ago introduced the concept of the homestead, the ability to take a temporary camp you can lay down and turn it into a permanent property claim… for specific definitions of the word “permanent” here.  Basically it won’t go away until you release it or they wipe the server […]",
    "author": "Wilhelm Arcturus",
    "published": "Tue, 17 Dec 2024 16:15:18 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "Stars Reach",
      "Playable Worlds",
      "Pre-Alpha"
    ]
  },
  {
    "id": "ae2a97b2-7529-404e-a816-3a4bbe981d01",
    "title": "A Look into November 2024 Destruction in EVE Online – The Revenant Expansion Edition",
    "link": "https://tagn.wordpress.com/2024/12/16/a-look-into-november-2024-destruction-in-eve-online-the-revenant-expansion-edition/",
    "description": "We’re back once again to look at the destruction details for EVE Online.  The November Monthly Economic Report, the MER, ran a little late this time around.  We had been getting used to it showing up in the first few days of the month, but this time around it didn’t land until the 12th… and […]",
    "author": "Wilhelm Arcturus",
    "published": "Mon, 16 Dec 2024 16:15:23 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "EVE Online",
      "Null Sec",
      "1N-FJ8",
      "EVE Monthly Economic Report"
    ]
  },
  {
    "id": "0ffa9690-e929-4f92-a2dd-e14d54b5d0e4",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/235490/",
    "description": "",
    "author": "Valve",
    "published": "Tue, 17 Dec 2024 13:44:00 -0800",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "c1d66ec3-cad6-49fb-96b9-4d06f4cbb4d3",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/235279/",
    "description": "",
    "author": "Valve",
    "published": "Mon, 16 Dec 2024 16:47:00 -0800",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "f1832245-bed8-4313-a069-141bf736cd67",
    "title": "Cambridge Audio Melomania P100 review: A genuine disruptor",
    "link": "https://www.eurogamer.net/digitalfoundry-2024-cambridge-audio-melomania-p100-review-a-genuine-disruptor",
    "description": "I don't think there's much of a finer example of a 'heritage brand' than Cambridge Audio. Founded in 1968, they've been making fantastic audio kit including amps, record decks and headphones for such a long time, and as such, are a brand I've admired from afar. Their P100s are their first run at wireless, over-ear headphones with noise cancelling, which is as competitive of a market as it gets for audio. Read more",
    "author": "Reece Bithrey",
    "published": "Tue, 17 Dec 2024 19:00:00 +0000",
    "image": "https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-1.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "Cambridge Audio",
      "Android",
      "Mac",
      "Digital Foundry",
      "PC",
      "Headphones",
      "iOS"
    ]
  },
  {
    "id": "cee0b4bc-839a-415b-a51d-3ae438e009c3",
    "title": "Catly developer denies using generative AI or blockchain technology in its open-world cat game",
    "link": "https://www.eurogamer.net/catly-developer-denies-using-generative-ai-or-blockchain-technology-in-its-open-world-cat-game",
    "description": "The developer of Catly, an open-world cat game revealed at last week's The Game Awards, has denied using generative AI for the game's trailer, or the game itself. Read more",
    "author": "Ed Nightingale",
    "published": "Tue, 17 Dec 2024 16:10:54 +0000",
    "image": "https://assetsio.gnwcdn.com/Catly_Screenshot-2-(1).png?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "PC",
      "Catly",
      "Nintendo Switch",
      "iOS"
    ]
  },
  {
    "id": "a13cb73a-31bb-4eb3-8279-ed1f65a5b45b",
    "title": "Snufkin: Melody of Moominvalley – the Moomins Arrive on Xbox",
    "link": "https://news.xbox.com/en-us/2024/12/17/snufkin-melody-of-moominvalley-the-moomins-arrive-on-xbox/",
    "description": "The post Snufkin: Melody of Moominvalley – the Moomins Arrive on Xbox appeared first on Xbox Wire.",
    "author": "johns",
    "published": "Tue, 17 Dec 2024 21:00:00 +0000",
    "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Snufkin_Release_Xbox_WirePost_image001-21849e394e8295a295f5.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "ID@Xbox",
      "moomins",
      "Raw Fury",
      "snufkin"
    ]
  },
  {
    "id": "3d0bc8af-9187-447f-8e71-ee57b032bddd",
    "title": "Managing Your Pirate Crew in Flint: Treasure of Oblivion",
    "link": "https://news.xbox.com/en-us/2024/12/17/flint-treasure-of-oblivion-pirate-crew/",
    "description": "The post Managing Your Pirate Crew in Flint: Treasure of Oblivion appeared first on Xbox Wire.",
    "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
    "published": "Tue, 17 Dec 2024 19:00:00 +0000",
    "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/07/flint-treasure-of-oblivion-art-302920f471e5660faad9-1024x576.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "Flint: Treasure of Oblivion",
      "Microids",
      "Savage Level",
      "Xbox Series X|S"
    ]
  },
  {
    "id": "9a25b5cf-dacc-422f-b55c-895e8e28dd65",
    "title": "Trailer Tuesday – Bloodless Castaway Fella",
    "link": "https://indiegamesplus.com/trailer-tuesday-bloodless-castaway-fella/",
    "description": "Trailer Tuesday takes grandma for a walk, does an uncomfortable amount of clicking, and wanders around on stilts this week. Menace from the Deep “Menace from the Deep is an enthralling Roguelike... The post Trailer Tuesday – Bloodless Castaway Fella appeared first on Indie Games Plus.",
    "author": "Joel Couture",
    "published": "Tue, 17 Dec 2024 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "Features",
      "A Walk With Yiayia",
      "Beyond The Darkness",
      "Bloodless",
      "Castaway",
      "CLICKOLDING",
      "Kvark",
      "Menace from the Deep",
      "Project Planet - Earth vs Humanity",
      "Stilt Fella",
      "Tlatoani: Aztec Cities",
      "trailer tuesday"
    ]
  },
  {
    "id": "60855536-f683-4551-95c8-c02944d8fe91",
    "title": "‘Bloomsome’ Reshapes Flowers to Fit Beauty Standards",
    "link": "https://indiegamesplus.com/bloomsome-review/",
    "description": "In Bloomsome, you’ll find yourself changing the appearance of flowers so that they look more like magazine cover models. Social media plays a big role in beauty standards all over the world.... The post ‘Bloomsome’ Reshapes Flowers to Fit Beauty Standards appeared first on Indie Games Plus.",
    "author": "Jupiter Hadley",
    "published": "Mon, 16 Dec 2024 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "Reviews",
      "Alice (Aly)",
      "Bloomsome",
      "Browser",
      "freeware",
      "interactive fiction",
      "Just Play Jam - A Game Jame for Justice",
      "simulation",
      "windows"
    ]
  },
  {
    "id": "4fb9764e-986f-403c-9bc4-840e6ec9ae7c",
    "title": "Makeup and Beauty Blog Monday Poll, Vol. 861",
    "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-861/",
    "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Who would you rather go dancing with: your significant other, your best friend or your kid (if you have one)? Honestly, I’d love to go with Connor, LOL! 2. Spa weekend or a music festival weekend? Spa weekend, 100%. 3. Have you had any eggnog this holiday season? Nope, none! I don’t really crave it, but if it’s there, I’ll have a small cup. 4. Who would you rather have lunch with: your favorite musician, your favorite actor, your favorite author or your favorite teacher? Honestly, if she was still alive, lunch with my favorite teacher from elementary would be lovely. The last time I saw her, I was 18. 5. Do you pop the zit or leave it alone? I dunno, how ripe is it? If[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 861 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 16 Dec 2024 14:00:24 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2023/07/hawaii-2023-sunset-5-610x814.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun"
    ]
  },
  {
    "id": "85a8a390-677d-41e2-8186-dafe5fb1ad57",
    "title": "Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 842",
    "link": "https://makeupandbeautyblog.com/just-for-fun/sundays-with-tabs-the-cat-makeup-and-beauty-blog-mascot-vol-842/",
    "description": "This was an exciting time of year for Tabs. Company coming over, trees INSIDE the house, blinking lights, the biggest turkeys of the year — for a cat like Tabs, the holidays were a cat cornucopia of comfy couches, fragrant foliage, tinsel, tasty treats and plump plumage. As the head of the decorating committee for Tabs the Cat Industries, LLC, Tabs was responsible for the Christmas tree decorations, and I just sort of did what he said. Normally, it would go down something like this: first week of December, and he hadn’t decided on the overall theme yet, but he’d have it narrowed down to something like baked red, green and silver catnip crispy ornament treats or strings of classic white lights and red Christmas balls. Probably. But he wouldn’t be sure yet. Whichever way it went, he always got a lot of help. The decorating committee was always on standby and awaiting orders. And Tabs? Well, he was always late because of this or that. A lot of the time it was just because[Continue reading...] The post Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 842 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 16 Dec 2024 03:55:04 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2017/12/tabs-fall-couch-5-610x458.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun",
      "Marnie",
      "Rosie",
      "Tabs"
    ]
  },
  {
    "id": "4d965a7e-bf37-451b-b457-a0b77e994852",
    "title": "This fan favorite class is getting D\u0026D 2024’s first playtest",
    "link": "https://www.polygon.com/dnd-dungeons-dragons/498829/artificer-unearthed-arcana-2024",
    "description": "“It’s been a minute since we’ve done this,” says Todd Kenreck in Dungeons \u0026 Dragon’s latest YouTube video, “but we have a new Unearthed Arcana.” Sitting across from him is a smiling Jeremy Crawford, D\u0026D’s lead rules designer, who says he is “so glad that the first Unearthed Arcana after the new Player’s Handbook and […]",
    "author": "Rowan Zeoli",
    "published": "2024-12-17T17:54:49-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Dungeons \u0026 Dragons",
      "Gaming",
      "Tabletop Games"
    ]
  },
  {
    "id": "73e259fb-3718-4e31-8f79-73275e6a0544",
    "title": "How to get Mew in Pokémon TCG Pocket",
    "link": "https://www.polygon.com/pokemon-tcg-pocket-guides/481509/mew-how-to-get-unlock",
    "description": "There are a number of ways to get Mew in Pokémon TCG Pocket — you can get one type of Mew card from the Genetic Apex expansion, and five types in December 2024’s Mythical Island expansion. For the Genetic Apex version of Mew, you can’t simply pull the card from the expansion’s booster packs. Instead, […]",
    "author": "Johnny Yu",
    "published": "2024-12-17T16:51:15-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Guides",
      "Mobile",
      "Pokémon Trading Card Game Pocket guides"
    ]
  },
  {
    "id": "41ec8efa-3d5d-4ef7-9407-453e72ab3959",
    "title": "TA shutting down - so where to go now?",
    "link": "https://toucharcade.com/community/threads/ta-shutting-down-so-where-to-go-now.432807/",
    "description": "",
    "author": "RoaringKitty",
    "published": "Tue, 17 Dec 2024 23:50:40 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "09683d63-0214-4349-a560-06bccc041cb9",
    "title": "Ataxx! Strategy Board Game (by: I Made a Bug)",
    "link": "https://toucharcade.com/community/threads/ataxx-strategy-board-game-by-i-made-a-bug.432977/",
    "description": "",
    "author": "ancard",
    "published": "Tue, 17 Dec 2024 14:37:57 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  }
]
