[
  {
    "id": "19e5b044-f772-4a17-b0e6-fc07624d2986",
    "title": "Mythical Island Is a Promising First Expansion for Pokemon TCG Pocket",
    "link": "https://www.escapistmagazine.com/mythical-island-is-a-promising-first-expansion-for-pokemon-tcg-pocket/",
    "description": "",
    "author": "Zhiqing Wan",
    "published": "Sat, 21 Dec 2024 14:00:00 +0000",
    "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/12/Screenshot_521.jpg?resize=1200%2C678",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "Features",
      "Opinion",
      "Video Games",
      "Featured",
      "Pokemon TCG Pocket"
    ]
  },
  {
    "id": "f7847f5d-4462-41c0-8303-c2741d909b58",
    "title": "Hawk Tuah Girl Breaks Silence on Crypto Scam Accusations, Issues Apology That Isn’t Worth Spit",
    "link": "https://www.escapistmagazine.com/hawk-tuah-girl-breaks-silence-on-crypto-scam-accusations-issues-apology-that-isnt-worth-spit/",
    "description": "",
    "author": "Chris McMullen",
    "published": "Fri, 20 Dec 2024 19:44:42 +0000",
    "image": "",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "News",
      "Hawk Tuah Girl"
    ]
  },
  {
    "id": "f4bdae10-c1c0-4c3e-a81b-daefd1c41f7f",
    "title": "The Best Xbox Games Of 2024 According To Metacritic",
    "link": "https://www.gamespot.com/gallery/the-best-xbox-games-of-2024-according-to-metacritic/2900-6067/",
    "description": "We're four years into the current Xbox Series X|S generation, and in 2024, it was business mostly as usual for Microsoft's console brand. While the biggest news this year related to Xbox was a new focus on bringing several of its first-party games to PS5 and Nintendo Switch, Xbox also saw an evolution of its Game Pass subscription service and an option for users of the Ultimate tier to stream select games they own. On top of a marketing push designed to remind people that they technically don't need the console to play Xbox games, 2024 shaped up to be a year of diversification for Microsoft's gaming ecosystem.What of the games then? This was a pretty strong year overall, as the Xbox library was bolstered with first-party games like Indiana Jones and the Great Circle, Microsoft Flight Simulator 2024, and Stalker 2: Heart of Chornobyl. Third-party games like Neon White and Final Fantasy 14 only added to the appeal of sitting down for a night of gaming on an Xbox console, and with Game Pass having numerous day-one releases, you'd find yourself spoiled for choice on what you could download and play, especially when one of those options was Call of Duty: Black Ops 6.GameSpot sister Metacritic has crunched the numbers on the best-reviewed Xbox games of the year--as of December 5--and if you're interested, you can check them all out in the list below. There were a few obvious winners here, as well as several surprises that you can read about. Be sure to also check out our running lists of the best Xbox Series X|S games and best Xbox Game Pass games to play right now.More Best Of 2024:Our Favorite Games That Didn't Make The Top 10Best PS5-Exclusive Games Of 2024Best Switch-Exclusive Games Of 2024Best PC-Exclusive Games Of 2024Best Xbox Games Of 2024Best-Reviewed Games Of 2024Best Of 2024 hub Elden Ring: Shadow of the ErdtreeMore Elden Ring is never a bad thing, and Shadow of the Erdtree delivers on that idea with an extra dose of everything that made the original game one of From Software's greatest hits. Elegantly grim and endlessly challenging, it's an essential expansion for any Elden Lord looking to return to the Lands Between.Metascore: 95 | Read our Elden Ring: Shadow of the Erdtree review See at Amazon Like a Dragon: Infinite WealthRGG Studio has been on a roll over the last couple of years, and Like a Dragon: Infinite Wealth is a prime example of the studio playing to its strengths. Doubling down on the turn-based gameplay mechanics introduced in Yakuza: Like a Dragon, Infinite Wealth is a confident sequel that further refines its weird and wonderful formula of brawls, drama, and mystery.Metascore: 92 | Read our Like a Dragon: Infinite Wealth review See at Amazon Metaphor ReFantazioA fantasy adventure that embodies the best qualities of Atlus-developed games, Metaphor: ReFantazio was GameSpot's Game of the Year. At its core, it's an idealistic and hopeful look at the power of fiction backed up by stunning art direction and challenging combat. Throw in political intrigue and a colorful cast of characters, and you've got a game that'll keep you entertained throughout its lengthy tale.Metascore: 92 | Read our Metaphor: ReFantazio review See at Amazon Shin Megami Tensei V: VengeanceFor its arrival on Xbox consoles, Atlus pulled out all the stops to make the already-superb Shin Megami Tensei V a must-play JRPG. Technical refinements and quality-of-life changes to remove tedious grinding sessions made for some welcome improvements, but this edition of the game is also a massive expansion that adds in dozens of hours of new story content. It took a long time for this entry in the cult-classic Shin Megami Tensei series to make its way to Xbox, but the wait was definitely worth it.Metascore: 92 | Read our Shin Megami Tensei V: Vengeance review See at Amazon Tekken 82024 was a year of rebirth for Tekken 8, as the fighting game series reinvented itself. On the surface, it's still a good-looking brawler with a varied roster of warriors that'll appeal to series veterans, but under the hood, Tekken 8 hit the sweet spot for drawing in some fresh blood with its aggressive gameplay mechanics and easy-to-learn fundamentals. A hard-hitting arcade fighting game fused with modern sensibilities, Tekken doesn't get much better than this.Metascore: 89 | Read our Tekken 8 review See at Amazon Destiny 2: The Final ShapeThe Final Shape brought a satisfying conclusion to the 10-year story of Destiny, culminating in a fight against The Witness, the foe who has loomed in the shadows since the beginning. The new Prismatic subclass further expands on the RPG-style character building, letting you mix and match abilities in exciting new ways. With a great raid, improvements to numerous areas of the game, a terrific--and comprehensible!--story, a fun new area to explore, and so much more to digest, The Final Shape is arguably the best Destiny expansion ever.Metascore: 89 | Read our Destiny 2: The Final Shape review Neon WhiteAlthough late to arrive on Xbox--it was originally released in 2022--Neon White is still every bit as good and original now as it was at the time. One of 2022's best games, Neon White turns you into a speedrunner, as you race through levels defeating enemies and making for the finish line. But what sets it apart is the way in which guns function as both weapons and platforming abilities, as you'll need to discard them in order to perform actions like a one-off double-jump. This leads to a thrill ride where you're constantly pushing forward, making quick decisions about how and when to make use of your limited weapons to finish levels as quickly as possible.Metascore: 88 | Read our Neon White review Indiana Jones and the Great CircleWolfenstein developer MachineGames has nailed the brief for crafting an Indiana Jones game. Capturing the scrappy underdog spirit of the beloved film franchise, Indiana Jones and The Great Circle combines masterfully crafted puzzles with rip-roaring action and a cinematic presentation that does justice to the whip-wielding adventurer.Metascore: 87 | Read our Indiana Jones and the Great Circle review See at Amazon Prince of Persia: The Lost CrownThe Prince of Persia series had been ice for years, with the wait extended due to many delays for the Sands of Time remake, but Ubisoft had something else up its sleeve in 2024. Prince of Persia: The Lost Crown reimagines the series as a metroidvania, complete with an innovative breadcrumb system to stop you from wasting time looking for that one door you found five hours ago. With a snappy, intuitive combat system and great platforming, it's a worthy entry in a series that had been all but forgotten.Metascore: 87 | Read our Prince of Persia: The Lost Crown review See at Amazon NevaFrom the team that made Gris, an artful meditation on grief, comes Neva, which tells a somber story of its own. Though the 2D style and similar color palette might inform dedicated indie fans that this is the Gris team, Neva's story is vastly different, focusing on a dying fantasy world where an unnamed character struggles to save the land using the help of her animal companions. Wordlessly, and with the aid of beautiful music, Neva reminds us that this would of ours is both our only home, as well as the home to so many others, and that saving it is a fight worth enlisting in.Metascore: 87 Unicorn OverlordUnicorn Overlord is the kind of game that requires dedication. A beautifully crafted fantasy epic with an incredibly deep and complex battle system, the game is a rewarding experience for anyone willing to dedicate time and effort into mastering every facet of its design. While the story might have more tropes than an Isekai anime, the colorful cast of characters, rich lore, and vibrant lands makes this game a top-tier strategy-RPG.Metascore: 87 | Read our Unicorn Overlord review See at Amazon Botany ManorIf you want a change of pace from all the shooting and slashing offered by most games, maybe you'd like to manage a picturesque English garden? Botany Manor is a chill vibes puzzle game that has you carefully cultivating a variety of magical plants, giving you a wholesome and cozy way to unwind.Metascore: 82 Persona 3 Reload2024 was an incredible year for Atlus, as it got off to a start with a remake of one of its darkest Persona games. Persona 3 Reload isn't just a massive overhaul of a PS2 classic, it's a game full of small changes that lead to big changes across the board for this emotionally charged tale of death and rebirth. The core of Persona 3 remains intact in this remake, with its best qualities enhanced by slick graphics, a talented cast of voice actors, and a killer soundtrack.Metascore: 86 | Read our Persona 3 Reload review See at Amazon Dragon's Dogma 2Fans of The Elder Scrolls, The Witcher, and other major fantasy RPGs may hope to dive into Dragon's Dogma 2 (DD2), and perhaps they should, but ultimately it's the game's strange quirks that make it both somewhat off-putting to some, and yet incredibly mesmerizing to others. In DD2, players will investigate a conspiracy, enlist unique NPC allies called Pawns, and, naturally, fight dragons amid a campaign that feels like a D\u0026D campaign come to life. But it's the game's elusive true ending that makes the game so special in the end.Metascore: 86 | Read our Dragon's Dogma 2 review See at Amazon Dragon Age: The VeilguardFollowing a few high-profile misses, including the dead-in-the-water Anthem, BioWare needed a hit to turn things around. The studio got it with Dragon Age: The Veilguard, an excellent RPG that feels like a natural evolution for the long-running series. An emphasis on combining attacks with your allies turns every battle into a glorious mix of arrows, blades, and explosions, and BioWare's certainly created some of the most memorable characters in the series to date. Ally yourself with a necromancer who dreams of becoming a spooky skeleton man or take on a titular dragon with a fire-breathing hunter by your side. Or just focus on finding the stupidest-looking hats imaginable. The choice is yours.Metascore: 85 | Read our Dragon Age: The Veilguard review See at Amazon Kunitsu-Gami: Path of the GoddessKunitsu-Gami: Path of the Goddess is a bold experiment, one that successfully merges multiple genres together into a cohesive and gorgeous package. While the objective of guiding a fair maiden to a shrine is simple, the journey is anything but easy as you're forced to contend with monsters pulled from the darkest chapters of Japanese folklore. It's an experimental approach to storytelling and strategic action that ultimately pays off, creating an experience that's refreshing to dive into.Metascore: 84 | Read our Kunitsu-Gami: Path of the Goddess review See at Amazon Cat Quest 3Do you like cats? Do you like quests? Then Cat Quest 3 will definitely scratch that highly specific itch to see feline adventurers set on a high-seas adventure and explore dangerous dungeons. A breezy and cozy game, Cat Quest 3 keeps things simple while adding to its appeal with well-crafted sailing and co-op gameplay mechanics. It's not a revolution in its genre, but with its old-school charm, colorful graphics, and witty writing, it's a comfortably familiar game that's easy to pick up.Metascore: 84 See at Amazon Still Wakes the DeepWhat if John Carpenter's The Thing was set not in a science facility in Antarctica but instead an oil rig in Scotland? The results would be something quite like Still Wakes the Deep. This first-person horror-adventure game comes from The Chinese Room, the team behind Amnesia: A Machine for Pigs, and will appeal most of all to fans of isolated horror like Alien and Carpenter's aforementioned masterpiece. With a monster you really should see for yourself, Still Wakes the Deep may flood your thoughts like the beast does to the doomed rig.Metascore: 83 | Read our Still Wakes the Deep review Dragon Ball: Sparking ZeroAbsence makes the heart grow fonder, and when it comes to big beefy anime dudes throwing hands that can level entire continents, Dragon Ball's return to its Budokai Tenkaichi era makes you realize just how much you missed classic arena-fighting action. While it could do a better job explaining its more nuanced gameplay mechanics, Dragon Ball: Sparking Zero still excels at being a stylish brawler with plenty of substance.Metascore: 83 | Read our Dragon Ball: Sparking Zero review See at Amazon WWE 2K24Several years after WWE 2K20 temporarily put the annual series on ice, the sports entertainment franchise has bounced back into the main event spotlight. WWE 2K24 doesn't offer any surprises, but if you've laced up your boots for a good-looking round of high-flying action, refined gameplay, and a trip down memory lane with a Showcase mode focused on WrestleMania’s greatest moments, you won't be disappointed.Metascore: 83 | Read our WWE 2K24 review See at Amazon Warhammer 40,000: Space Marine 2It seemed like a sequel to the cult-favorite Warhammer 40,000: Space Marine was never going to happen, but Saber Interactive answered our prayers--even though they were meant for the Emperor of Mankind. Space Marine 2 is a brilliant sequel that, much like the original, mixes third-person shooting with enormous hack-and-slash brawls. Though the campaign missions are fairly linear, they're complemented by gigantic, explosive set pieces that turn out to be much more than decoration--these moments you see in the distance are actually full co-op missions, fleshing out the story as disgraced Lieutenant Titus races to stop the forces of chaos from destroying mankind.Metascore: 83 | Read our Warhammer 40,000: Space Marine 2 review See at Amazon Call of Duty: Black Ops 6One of the best Call of Duty games in recent memory--and included with Game Pass for the first time--Call of Duty: Black Ops 6 shows why Treyarch has earned players' confidence. The mystery-filled campaign occasionally morphs into all-out horror and succeeds in its open-ended missions in a way Modern Warfare 3 failed. Multiplayer is extremely fast and fluid thanks to the new movement system, and it's impossible to hate Nuketown, even after all these years.Metascore: 83 | Read our Call of Duty: Black Ops 6 campaign and multiplayer reviews See at Amazon Paper Trail2024 might just go down as one of the best years ever for the puzzle genre of games, thanks to titles like Paper Trail. An origami-'em-up about leaving home, Paper Trail has layers upon layers of clever design waiting to be discovered, and its core gameplay loop of merging two sides to solve puzzles gives it a unique appeal. It's a devilishly challenging but rewarding game, one where every answer can be found by folding, spinning, and twisting the world around you.Metascore: 82 Planet Coaster 2The original Planet Coaster is one of a handful of games that felt like it didn't need a sequel thanks to its rock-solid design. Fortunately, Planet Coaster 2 justifies its existence by taking everything that made the first game so popular, polishing them up, and exploring new theme-park attractions, creating a deeper experience overall. While several nagging issues from its predecessor remain, it's still an impressively flexible and highly customizable dive into a world full of ups, downs, and loop-de-loops.Metascore: 82 IndikaOne of the most distinct games of the year, Indika is weird and consistently surprising. It might look like an arthouse film at first glance, but Indika quickly throws players into bizarre situations as they embark on a journey of self-discovery with the devil by their side. A surreal clash of religion and reason, Indika is bleak, strange, and captivating.Metascore: 82 | Read our Indika review Hidden Through Time 2: Myths \u0026 MagicBelieve it or not, but one of the highest-rated games of the year on Xbox is a hidden-object adventure. Imagine Where's Wally as you travel through various historical eras, only you're searching for seemingly random items in a beautifully animated and cozy world. It's a simple recipe for success, but with the brand-new Reality Shift feature, Hidden Through Time 2 becomes a multi-layered experience as you explore maps through multiple dimensions.Metascore: 82 Beyond Good and Evil: 20th Anniversary EditionThe definitive modern version of the venerated masterpiece, Beyond Good and Evil: 20th Anniversary Edition lets you reexperience the classic. The pioneering adventure game gets updated to 4K and 60fps with enhanced graphics and audio, an anniversary gallery, and a new speedrun mode. It's the best way to experience the original while we hold out for its long-awaited, often delayed sequel.Metascore: 79 Brothers: A Tale of Two Sons RemakeGame designer Josef Fares has become known in the game industry for his outspoken public appearances and his studio's Game Awards win for It Takes Two. One of his first projects, Brothers: A Tale of Two Sons, got a remake this year, sporting single-player or co-op as you guide a pair of brothers to save their ailing father.Metascore: 79",
    "author": "",
    "published": "Sun, 22 Dec 2024 16:00:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4417076-bestxboxmc.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "9ba5ca5d-c47c-42b1-aecc-c1d51a836e3b",
    "title": "10 Things I Loved And Hated About Fortnite In 2024",
    "link": "https://www.gamespot.com/gallery/10-things-i-loved-and-hated-about-fortnite-in-2024/2900-6099/",
    "description": "The past year has been a momentous one for Fortnite, marking its biggest expansions ever with a pile of diverse new game modes, and a partnership with Disney that we still don't know all the details of. Chapter 5 kicked off in December 2023 with the launch of Lego Fortnite, Fortnite Festival, and Rocket Racing, and Epic has added several major new modes since then, like Reload in the summer, and OG and Ballistic earlier this month. There's more Fortnite now than there's ever been.Naturally, it hasn't been all good or all bad--there have been mistakes, and there have been triumphs, and there's been everything you can imagine in between. But one thing is for sure: Fortnite is a very different game at the end of 2024 that it was at the beginning. Let's take a look back at the good and the bad from this year in Fortnite. Love: Epic-created metaverseSince the start of Chapter 5, Fortnite has introduced Lego Fortnite Odyssey and Brick Life, Rocket Racing, Fortnite Festival, Fortnite Reload, Fortnite OG, and Fortnite Ballistic. While they haven't all been smash hits, all these modes have been a net positive for Fortnite, both individually and as a whole. Even Rocket Racing, which flopped, is actually pretty fun--it just has no framework to speak of that might keep casual players hooked.As somebody who's squarely in the \"it's time to settle down\" phase of his life, the diversification of Fortnite is working for me in a big way. The more varied fun I can have with Fortnite, and the more ways Epic comes up with for me to use the cosmetics I've bought over the years, the less I'm going to be inclined to waste my SSD space on the competition. It's a win for me and Epic both. Hate: User-created metaverseIt's been nearly two years since Epic unleashed the Unreal Editor for Fortnite (UEFN), which granted content creators much more powerful tools for creating worlds and games in Fortnite Creative than they had previously. And so far, very little has come of it--the charts remain dominated by the same sort of boxfight deathmatch maps as always, and there has been very little in the way of innovation because the most prominent creators are usually either chasing trends or working for hire to build maps for third-party corporations. While Epic's own portion of the metaverse is doing well, the rest of it isn't up to par just yet. Love: Battle royale getting weirdChapter 5 in battle royale was unusually divisive, thanks to the overpowered boss medallions that were first introduced in Season 1, the laser-like Waterbending mythic in Season 2, the disproportional focus on vehicular combat in Season 3, and finally War Machine's abominable jetpack in Season 4. The gimmicks in Chapter 5 were unusually intense and over the top, even by Fortnite standards, and I had a blast with all of them--though I agree wholeheartedly with the consensus that it's for the best if we never see that jetpack again.Thanks to the introduction of the permanent OG mode and other new shooter modes to attract the attention of folks who aren't into those sorts of gimmicks, it frees Epic to continue to go hog-wild in the core battle royale mode. The detractors can simply avoid that stuff by playing OG instead and not having to deal with it, and the people who do like the gimmicks can keep on keeping on. It works out for everybody. Hate: InflationInflation hit Fortnite very hard in the past year, thanks to a multi-pronged approach from Epic to increase the price of everything. It began in late 2023 with the increased price of V-Bucks, and continued into the new year with two major changes in Epic's item shop philosophy: Aside from some Icon skins (skins of real celebrities like Shaq) and ultra-customizable skins like the Skratch Company set, Fortnite stopped released new collaboration skins that have multiple style options.In Chapter 5 Season 4, for example, Epic released 21 new non-Icon collaboration skins. Only three of them had any style options at all, and those three only had toggleable features--Iron Spider's helmet, Black Cat's mask, and Spider-Woman's webbing. These days, Epic defaults to selling additional styles separately, as we've just seen with the Platinum Festival skins, which are minor recolors of existing skins being sold for 1,800 V-Bucks each. In the past, styles like that would have been added to the existing skins as a value-add to motivate new purchases, but those days are over.And on top of that, Epic developed a troubling habit of bundling collaboration skins with accessories for a higher price and not allowing you to buy them on their own. Once a rare practice, Epic pulled this move at least 30 times in 2024, mostly on collab skins. There were only five total examples of Epic trying this tactic in 2023, and four of them were the TMNT skins the company released at the very end of the year.And, finally, on top of all that, bundle prices have gone through the rough. These used to max out at 2800 V-Bucks, presumably because you can buy that exact amount. But all the big collaboration bundles in 2024 went past that, with 3400-3800 apparently becoming Epic's preferred price range for big bundles. Fortunately for everyone, Epic seems to be retreating from this new standard a little bit with most of the new bundles in December. Love: The return of ambient live eventsEach season during Chapter 5 ended with some sort of community live event that took place during battle royale matches, starting with the combined effort to break the chains on Pandora's Box at the end of Season 1. This was similar to how Fortnite approached these events back in the day, before Epic switched to mostly just doing instanced events like Collision in Chapter 3 and the Big Bang at the end of Chapter 4.But these ambient events are great, because they last a while--it took a whole weekend to open Pandora's Box, so it was easy for everyone to get involved because there wasn't one set time for it. And it's also nice to have that feeling that the island is evolving while we're on it: something that was harder to pull off with those instanced events. Hate: The apparent demise of Rocket RacingIt's hard to figure what exactly went wrong with Rocket Racing, which has been hovering around 3,000 concurrent players for a while now--a very low number for an Epic-supported mode. But it's been months since the Rocket Racing Twitter had any activity, and while Festival and Lego modes were getting anniversary updates, Rocket Racing has just been quietly hanging out with no real movement, beyond the addition of new car cosmetics in the shop. It's hard to imagine Epic ever actually abandoning the mode completely, but it's certainly in limbo at the moment, and we have no indication of what Epic may or may not be planning for it. It's a bummer, because it's a fun mode--it just has no hook. Love: New cosmetic typesConfession time: I've spent too much money on Fortnite, going back to when I was unemployed a few years ago and binge-played Fortnite for several weeks straight to help me quit my longtime cigarette habit. So I'm definitely one of those people who have too many Fortnite skins. Because of that, I'm a harder sell than I used to be. But Epic has managed to introduce new types of things to the item shop that I actually want--I've become a purveyor of jam tracks, instruments, and car skins (my Fast \u0026 Furious cars crossing over from Rocket League has been delightful), and I've even bought several pairs of kicks. Anything that makes my digital action figures look goofier pleases me, and all these new cosmetic types accomplish that, while also adding some new flavor to Fortnite as a whole. Hate: Epic's draconian attempts to control player progressFortnite's battle pass has always been pretty easy for anyone to complete, whether you play regularly or just show up at the end of the season and grind out all the weekly quests. Epic, naturally, would prefer that you stick around for the duration, and the company has made repeated attempts over the years to make it harder to get through the battle pass quickly. With so many different modes for earning XP now, though, it's tough for them to do that without being really annoying and obvious about it, such as with the weekly XP throttling we saw Epic try when Chapter 6 launched earlier this month. They walked most of those changes back, but this same story keeps playing out over and over--I'm sure we'll be at it again when Season 2 starts in February. Love: The death of exclusivity Fortnite's exclusive battle-pass cosmetics made sense before we all realized that Fortnite would become a World of Warcraft-esque forever game, but now it's kind of awkward to have skins like Darth Vader and Indiana Jones permanently locked to new players. Starting with the Marvel-themed Chapter 5 Season 4, new battle-pass cosmetics will no longer be permanently exclusive, and that's an overdue change. Hate: The neverending argument about exclusivityUnlike some folks, I don't believe Epic will be bringing back old battle pass content any time soon--but, frankly, I don't think I really care either way. Epic just brought back the old Renegade Raider and Aerial Assault Trooper skins to the item shop, and despite being a collector I felt absolutely no desire to get them. I already have the gingerbread-themed re-do of Renegade Raider, which is way more fun. And in a holiday season that's bringing us Santa-themed skins for Mariah Carey, Shaq and Snoop Dogg, not to mention Cyberpunk 2077 items, basic old Fortnite skins like these aren't worth even considering.So if anything ever happens with old battle passes, I'll probably be generally apathetic about it--I'm content with my piles of stuff from the shop. But in the meantime, I'm extremely tired of this being a non-stop topic of debate. Epic has to comply with so many rules set by so many governmental regulatory bodies in so many different countries, and navigating that minefield is beyond my pay grade, and certainly it's beyond that of those who are fighting about this on Reddit every day. That debate is all noise, and we're far past the point where it's fun anymore.",
    "author": "",
    "published": "Sun, 22 Dec 2024 14:00:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/123/1239113/4418955-fortnitebestof.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "0f082a2d-09c6-47e4-82dc-67aad641ad3d",
    "title": "Marvels Rivals Is The Hero Shooter We Didn’t Know We Needed",
    "link": "https://kotaku.com/marvel-rivals-overwatch-2-concord-best-hero-shooters-1851726774",
    "description": "One of 2024’s biggest success stories has been Marvel Rivals, a third-person PVP shooter starring Marvel heroes and baddies. The game has already picked up over 20 million players and shows no signs of stopping. Which is cool but also very surprising!Read more...",
    "author": "Zack Zwiezen",
    "published": "Sun, 22 Dec 2024 17:05:40 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/1b81cf167f30c76abce1709b7cdd1492.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "hero shooter",
      "jeff mode later",
      "windows games",
      "marvel universe",
      "multiplayer video games",
      "hawkeye",
      "overwatch 2",
      "doctor strange",
      "jeff the",
      "marvel rivals",
      "wanda maximoff",
      "ms marvel",
      "netease",
      "chen",
      "samuel moreno",
      "kenneth shepard",
      "overwatch",
      "iron fist",
      "jeff the land shark",
      "multiplayer online games"
    ]
  },
  {
    "id": "ca935a0d-29d1-43da-9e24-de583cfdeafb",
    "title": "The Best Marvel Rivals Tips, Steam Winter Sale Deals, And More Of The Week's Most Helpful Gaming Info",
    "link": "https://kotaku.com/marvel-rivals-tips-steam-winter-sale-deals-1851726474",
    "description": "This week, Marvel Rivals continued to pull players in with its enjoyably chaotic take on the hero-shooter genre, and we’ve got heaps of tips to help you come to grips with the game and see what cool strats other players are using. We’ll also fill you in on everything we know about Intergalactic, Naughty Dog’s upcoming…Read more...",
    "author": "Kotaku Staff",
    "published": "Sun, 22 Dec 2024 14:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/a1d76914c87c3b1f03925231ef514136.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "third person shooters",
      "netease",
      "windows games",
      "multiplayer video games",
      "naughty dog",
      "jak daxter",
      "rpg",
      "ethan gach",
      "overwatch",
      "marvel rivals",
      "storm",
      "multiplayer online games",
      "brandon morgan",
      "hero shooter",
      "samuel moreno",
      "kenneth shepard"
    ]
  },
  {
    "id": "65f47b77-6517-43ea-8577-db099b9fd142",
    "title": "AU Deals: Super Early Boxing Day Game Savings, Winter Sale Deep Discounts, and More!",
    "link": "https://www.ign.com/articles/au-deals-super-early-boxing-day-game-savings-winter-sale-deep-discounts-and-more-au-deals",
    "description": "Santa arrives early with a bunch of gaming sales events that cannot be missed!",
    "author": "Adam Mathew",
    "published": "Sun, 22 Dec 2024 21:31:46 +0000",
    "image": "https://assets-prd.ignimgs.com/2024/12/22/dsfsdfd-1734902888486.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "6297ca2d-cb4d-4748-a6f9-a9778456a03a",
    "title": "Daily Deals: Gran Turismo 7, Persona 3 Reload, LEGO Horizon Adventures, and More",
    "link": "https://www.ign.com/articles/daily-deals-gran-turismo-7-persona-3-reload-lego-horizon-adventures-and-more",
    "description": "",
    "author": "Noah Hunter",
    "published": "Sun, 22 Dec 2024 19:41:13 +0000",
    "image": "https://assets-prd.ignimgs.com/2023/11/08/granturismo7patch-blogroll-1699406920907.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "40bf60e1-8269-4b63-8884-4640bd8fe6d5",
    "title": "Official PlayStation Podcast Episode 505: Cheers to 2024",
    "link": "https://blog.playstation.com/2024/12/20/official-playstation-podcast-episode-505-cheers-to-2024/",
    "description": "Email us at PSPodcast@sony.com! Subscribe via Apple Podcasts, Spotify, or download here Hello folks! This week, the crew shares their favorite games of the year in the final show of 2024. Plus, Kristen returns to share her top games from past PlayStation console generations to celebrate the 30th anniversary.  Thank you to all the developers […]",
    "author": "Justin Corrie",
    "published": "Fri, 20 Dec 2024 19:04:07 +0000",
    "image": "https://traffic.libsyn.com/playstation/Episode_505.mp3",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "Uncategorized",
      "official playstation podcast",
      "playstation blogcast"
    ]
  },
  {
    "id": "75c706a4-8e20-4008-ae73-918fb7b42a73",
    "title": "Share of the Week: Astro Bot – Winter Wonder",
    "link": "https://blog.playstation.com/2024/12/20/share-of-the-week-astro-bot-winter-wonder/",
    "description": "Last week, we asked you get in the holiday spirit with the newly released Winter Wonter level of Astro Bot, and share moments exploring using #PSshare #PSBlog. Here are this week’s highlights: VrPhotoGamess shares Astro surrounded by jingle bells in the Festive Fellow outfit. MdeavorVP shares Astro in the Festive Fellow outfit gliding down a […]",
    "author": "",
    "published": "Fri, 20 Dec 2024 17:00:03 +0000",
    "image": "https://live.staticflickr.com/65535/54213353271_4d04d7300e_k.jpg",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "PS5",
      "Astro Bot",
      "share of the week"
    ]
  },
  {
    "id": "1180f455-4264-44fa-ba80-41080f395b06",
    "title": "Sonic star Ben Schwartz answers our shadow questions",
    "link": "https://www.polygon.com/movies/500054/ben-schwartz-sonic-3-shadow-interview",
    "description": "In the weeks before the release of Sonic the Hedgehog 3, comedian and actor Ben Schwartz sat down with Polygon to confront the shadows that lurk in every hedgehog. In this, the third installment of the Polygon x Ben Schwartz Sonic Interview Series, each question has its own, more existentially challenging “shadow question.” Ben tackles […]",
    "author": "Patrick Gill",
    "published": "2024-12-22T12:01:00-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Animation",
      "Comedy",
      "Entertainment",
      "Gaming",
      "Movies"
    ]
  },
  {
    "id": "0e8cb5d1-c230-453d-a22e-327f2e27d721",
    "title": "5 famous movie scenes recreated for video games",
    "link": "https://www.polygon.com/gaming/494805/movie-scenes-recreated-games-matrix-indiana-jones-alien",
    "description": "Movies and video games have always had a somewhat tumultuous relationship. From the famous failings of video game movie adaptations to the even more famous struggle to make good movie versions of games, it’s rare that the two mediums see eye to eye. Which is why it’s so funny that there are a few rare […]",
    "author": "Austen Goslin",
    "published": "2024-12-22T11:00:00-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Entertainment",
      "Gaming",
      "Movies"
    ]
  },
  {
    "id": "99a0cc24-0bcc-40a9-889d-c50af238530d",
    "title": "Hello? Is Anybody There?",
    "link": "https://tagn.wordpress.com/2024/12/22/hello-is-anybody-there/",
    "description": "It was the end of the line. The land line, that is.  At the start of the month we were finally without a hardwired phone connection to the public switched telephone network.  We were no longer connected to a worldwide network of cables by a pair of copper wires hooked up to a box stuck […]",
    "author": "Wilhelm Arcturus",
    "published": "Sun, 22 Dec 2024 16:15:35 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "Telephone",
      "Telephone Tales"
    ]
  },
  {
    "id": "09f343a1-a954-47f9-af95-1bfb9779d40c",
    "title": "My Books of 2024",
    "link": "https://tagn.wordpress.com/2024/12/21/my-books-of-2024/",
    "description": "Time for another annual round up, this time around the books I read in 2024. I record my reading over at Goodreads.  I understand that the site is now under something of a cloud as people have realized Amazon owns it, because some tech oligarch needs to own everything these days.  But I am a […]",
    "author": "Wilhelm Arcturus",
    "published": "Sat, 21 Dec 2024 17:15:53 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "Books",
      "entertainment",
      "2024",
      "Anne Applebaum",
      "Arkady Renko",
      "Burn Book",
      "Good Reads",
      "Kara Swisher",
      "Mark Twain",
      "Martin Cruz Smith",
      "The Innocents Abroad",
      "Winston Churchill"
    ]
  },
  {
    "id": "9e977b11-fd9a-46c5-b39e-b5eec3d04658",
    "title": "What's on your bookshelf?: I am 90% yule log but I need to keep up the streak edition",
    "link": "https://www.rockpapershotgun.com/whats-on-your-bookshelf-i-am-90-yule-log-but-i-need-to-keep-up-the-streak-edition",
    "description": "",
    "author": "Nic Reuben",
    "published": "Sun, 22 Dec 2024 16:00:00 +0000",
    "image": "https://assetsio.gnwcdn.com/librairie-romantique-1600.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "Booked For The Week"
    ]
  },
  {
    "id": "ad8ef82f-d3a1-4f63-b05a-722553cccd28",
    "title": "The RPS Advent Calendar 2024, December 22nd",
    "link": "https://www.rockpapershotgun.com/the-rps-advent-calendar-2024-december-22nd",
    "description": "It was a rainy day when she walked into my office, hard rain, like stray stones from a truck on the highway hitting your car bonnet. I lit my cyber-cigarette and put my feet on my desk, I don't know why, I thought it would make me look nonchalant to this strange woman. She wasn't impressed. \"Detective,\" she said, glaring at me with eyes like gorgeous tennis balls, \"I want to open today's advent calendar door.\" I was confused. \"Whaddya wanna do that for, missy?\" She sat back, relaxed, and pulled a gun from her purse. \"I need to stuff a body into it.\" Read more",
    "author": "RPS",
    "published": "Sun, 22 Dec 2024 12:00:00 +0000",
    "image": "https://assetsio.gnwcdn.com/RPS24_Christmas_Calendar_Header_AW.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "Fireshine Games",
      "Puzzle",
      "Single Player",
      "Action Adventure",
      "RPG",
      "Shadows of Doubt",
      "The RPS Advent Calendar 2024",
      "First person",
      "Multiplayer Competitive",
      "Indie",
      "PC"
    ]
  },
  {
    "id": "163a2fef-3a13-4d28-9b41-94640f555026",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/235674/",
    "description": "",
    "author": "Valve",
    "published": "Fri, 20 Dec 2024 09:16:00 +0900",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "087e5742-2357-4e6a-ae18-7bd84bfa7f3d",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/235490/",
    "description": "",
    "author": "Valve",
    "published": "Wed, 18 Dec 2024 06:44:00 +0900",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "7b66593d-1e11-4549-adc6-cbe08bda03dd",
    "title": "‘Dungeons of Blood and Dream’ Rewards \u0026 Punishes Curiosity",
    "link": "https://indiegamesplus.com/dungeons-of-blood-and-dream-review/",
    "description": "Dungeons of Blood and Dream gives you access to unsettling, powerful spells and potions that can help you as easily as they can kill you. You have found yourself imprisoned for daring... The post ‘Dungeons of Blood and Dream’ Rewards \u0026 Punishes Curiosity appeared first on Indie Games Plus.",
    "author": "Joel Couture",
    "published": "Fri, 20 Dec 2024 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "News",
      "action",
      "dungeon crawler",
      "Dungeons of Blood and Dream",
      "horror",
      "Lori Vornoy",
      "roguelike",
      "windows"
    ]
  },
  {
    "id": "196f155e-fbc3-4e15-85d6-0e67bf6c79df",
    "title": "‘Camper Van: Make it Home’ Puzzles Through Where to Put Things",
    "link": "https://indiegamesplus.com/camper-van-make-it-home-preview/",
    "description": "Camper Van: Make it Home sees you making this tiny place your own by figuring out where you can put all of your stuff inside a van. In this game, there seems... The post ‘Camper Van: Make it Home’ Puzzles Through Where to Put Things appeared first on Indie Games Plus.",
    "author": "Jupiter Hadley",
    "published": "Thu, 19 Dec 2024 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "Previews",
      "Bilbao Independent Games Conference",
      "Camper Van: Make it Home",
      "Mac",
      "Malapata Studio",
      "puzzle",
      "windows"
    ]
  },
  {
    "id": "e50358d4-809c-42fc-abac-4912665d9c15",
    "title": "How to Ensure a Fun, Safe and Welcoming Gaming Experience for Your Kids on Xbox This Holiday Season",
    "link": "https://news.xbox.com/en-us/2024/11/15/xbox-family-settings-holiday/#new_tab",
    "description": "The post How to Ensure a Fun, Safe and Welcoming Gaming Experience for Your Kids on Xbox This Holiday Season appeared first on Xbox Wire.",
    "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
    "published": "Fri, 20 Dec 2024 17:00:00 +0000",
    "image": "",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Holiday 2024",
      "Holiday"
    ]
  },
  {
    "id": "94a0a864-f983-4ec9-8d25-6f7822a80bd2",
    "title": "Post Trauma Reimagines Old School Horror on Xbox in 2025",
    "link": "https://news.xbox.com/en-us/2024/12/19/post-trauma-reimagines-old-school-horror-on-xbox-in-2025/",
    "description": "The post Post Trauma Reimagines Old School Horror on Xbox in 2025 appeared first on Xbox Wire.",
    "author": "johns",
    "published": "Thu, 19 Dec 2024 23:00:00 +0000",
    "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/In-line-Asset-1-f3c16d7f5ebf80b6a109-scaled.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "ID@Xbox",
      "Post Trauma",
      "Raw Fury"
    ]
  },
  {
    "id": "9deb26ac-78fc-4d63-bdb5-7197438b8528",
    "title": "Makeup and Beauty Blog Monday Poll, Vol. 861",
    "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-861/",
    "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Who would you rather go dancing with: your significant other, your best friend or your kid (if you have one)? Honestly, I’d love to go with Connor, LOL! 2. Spa weekend or a music festival weekend? Spa weekend, 100%. 3. Have you had any eggnog this holiday season? Nope, none! I don’t really crave it, but if it’s there, I’ll have a small cup. 4. Who would you rather have lunch with: your favorite musician, your favorite actor, your favorite author or your favorite teacher? Honestly, if she was still alive, lunch with my favorite teacher from elementary would be lovely. The last time I saw her, I was 18. 5. Do you pop the zit or leave it alone? I dunno, how ripe is it? If[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 861 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 16 Dec 2024 14:00:24 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2023/07/hawaii-2023-sunset-5-610x814.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun"
    ]
  },
  {
    "id": "665a7c19-c1ba-4b7b-8d87-387bb9659350",
    "title": "Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 842",
    "link": "https://makeupandbeautyblog.com/just-for-fun/sundays-with-tabs-the-cat-makeup-and-beauty-blog-mascot-vol-842/",
    "description": "This was an exciting time of year for Tabs. Company coming over, trees INSIDE the house, blinking lights, the biggest turkeys of the year — for a cat like Tabs, the holidays were a cat cornucopia of comfy couches, fragrant foliage, tinsel, tasty treats and plump plumage. As the head of the decorating committee for Tabs the Cat Industries, LLC, Tabs was responsible for the Christmas tree decorations, and I just sort of did what he said. Normally, it would go down something like this: first week of December, and he hadn’t decided on the overall theme yet, but he’d have it narrowed down to something like baked red, green and silver catnip crispy ornament treats or strings of classic white lights and red Christmas balls. Probably. But he wouldn’t be sure yet. Whichever way it went, he always got a lot of help. The decorating committee was always on standby and awaiting orders. And Tabs? Well, he was always late because of this or that. A lot of the time it was just because[Continue reading...] The post Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 842 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 16 Dec 2024 03:55:04 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2017/12/tabs-fall-couch-5-610x458.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun",
      "Marnie",
      "Rosie",
      "Tabs"
    ]
  },
  {
    "id": "435c7ddc-3488-45bb-b59c-272af19f6d66",
    "title": "ATTENTION PLEASE READ! - Come Join the TouchArcade Discord! (The Forums Will Be Shut Down)",
    "link": "https://toucharcade.com/community/threads/attention-please-read-come-join-the-toucharcade-discord-the-forums-will-be-shut-down.432893/",
    "description": "",
    "author": "Boardumb",
    "published": "Fri, 20 Dec 2024 20:08:05 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "13796219-3ab5-42d2-9e8e-1255a6cf1311",
    "title": "TA shutting down - so where to go now?",
    "link": "https://toucharcade.com/community/threads/ta-shutting-down-so-where-to-go-now.432807/",
    "description": "",
    "author": "RoaringKitty",
    "published": "Tue, 17 Dec 2024 23:50:40 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "f04088d6-4757-4b23-986d-bc37f4c55140",
    "title": "The year's Steam Replay reveals 85% of Steam users in 2024 spent time playing games released in 2023 or earlier",
    "link": "https://www.eurogamer.net/the-years-steam-replay-reveals-85-of-steam-users-in-2024-spent-time-playing-games-released-in-2023-or-earlier",
    "description": "Just 15 percent of Steam players spent time with new releases - defined as games released in 2024 - this year. Read more",
    "author": "Vikki Blake",
    "published": "Sun, 22 Dec 2024 16:37:41 +0000",
    "image": "https://assetsio.gnwcdn.com/steam_ROoZJs3_d5erV0U.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "PC",
      "Valve"
    ]
  },
  {
    "id": "b53b52cc-f663-4c9e-bea4-d167136b3422",
    "title": "Stalker 2: Heart of Chornobyl dev is working on a \"next-gen patch\" for Stalker: Legends of the Zone Trilogy",
    "link": "https://www.eurogamer.net/stalker-2-heart-of-chornobyl-dev-is-working-on-a-next-gen-patch-for-stalker-legends-of-the-zone-trilogy",
    "description": "As Stalker 2 developer GSC Game World marks the close of 2024 with patch 1.1, the studio confirmed it is also working on a next-gen patch for the console version of Stalker: Legends of the Zone Trilogy. Read more",
    "author": "Vikki Blake",
    "published": "Sun, 22 Dec 2024 14:39:46 +0000",
    "image": "https://assetsio.gnwcdn.com/stalker-2-heart-of-chornobyl-review-5-noontide-patrol.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "S.T.A.L.K.E.R. 2: Heart of Chornobyl",
      "Shooter",
      "First person",
      "Multiplayer Competitive",
      "Horror",
      "patches",
      "RPG",
      "Single Player",
      "GSC Game World",
      "FPS",
      "Action Adventure",
      "Updates",
      "PC",
      "Xbox Series X/S",
      "Survival \u0026 Crafting"
    ]
  }
]
