[
  {
    "id": "2cb761c6-14c7-4915-bb65-12c1dbd99980",
    "title": "Ghost of Yōtei's gorgeous gameplay deep dive reveals refined combat, lo-fi beats mode, and more",
    "link": "https://www.eurogamer.net/ghost-of-yoteis-gorgeous-gameplay-deep-dive-reveals-refined-combat-lo-fi-beats-mode-and-more",
    "description": "Ghost of Tsushima's gorgeous PlayStation 5 sequel Ghost of Yōtei is inching ever-closer to release, and ahead of its October arrival, developer Sucker Punch has shared its best look yet at what the revenge-soaked open-world action-adventure will bring - including, it turns out, a lo-fi beats mode for a more soothing saunter through Ezo. Read more",
    "author": "Matt Wales",
    "published": "Thu, 10 Jul 2025 22:39:29 +0000",
    "image": "https://assetsio.gnwcdn.com/ghost-of-yotei-trailer-crop.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=70\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "Ghost of Yōtei",
      "PS5",
      "Sucker Punch Productions",
      "Action Adventure",
      "Third person"
    ]
  },
  {
    "id": "41dcc968-fc13-4601-9b3a-b309d69ea547",
    "title": "Two limited edition Ghost of Yōtei PS5 bundles with designs \"rooted in traditional Japanese art\" announced",
    "link": "https://www.eurogamer.net/two-limited-edition-ghost-of-yotei-ps5-bundles-with-designs-rooted-in-traditional-japanese-art-announced",
    "description": "This evening, Sony and developer Sucker Punch gave us all a closer look at Ghost of Yōtei, as part of a dedicated State of Play. Read more",
    "author": "Victoria Phillips Kennedy",
    "published": "Thu, 10 Jul 2025 22:08:42 +0000",
    "image": "https://assetsio.gnwcdn.com/Ghost-of-Yotei-PS5-bundle-boxes-showing-the-console-and-controller-designs.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=70\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "Ghost of Yōtei",
      "PS5",
      "Sucker Punch Productions",
      "Action Adventure",
      "Third person"
    ]
  },
  {
    "id": "d9948da7-6c23-44ca-9639-9920e804578f",
    "title": "Unlocked iPhones Are Hundreds Of Dollars Off At Amazon For Prime Day",
    "link": "https://www.gamespot.com/articles/unlocked-iphones-are-hundreds-of-dollars-off-at-amazon-for-prime-day/1100-6532971/?ftag=CAD-01-10abi2f",
    "description": "iPhone 16 Pro $816 - $935 See at Amazon iPhone 15 Pro Max $714 - $849 See at Amazon iPhone 14 / 13 / 12 $194 - $458 See at Amazon iPhone SE 3rd Gen $194 (was $260) See at Amazon If you're looking to upgrade your iPhone, several professionally refurbished models are on sale during Amazon's Prime Day 2025 sale, which ends July 11. Each of the discounted iPhones is certified through the Amazon Renewed Premium program. While these are pre-owned, they're all in full working order, usually just a step away from brand-new in quality. According to Amazon, each item has been professionally inspected, tested, and cleaned by professionals, and there are \"no visible cosmetic imperfections\" when the item is held at arm's length. The only real loss here is the box, as Amazon will instead ship these iPhones out in generic packaging. Products are also eligible for a replacement or refund within 90 days. Note that these deals are only available to Amazon Prime members, so you'll need an active subscription to get the lowest price. Join Amazon Prime The upshot of choosing one of the refurbished models listed below is that they're all unlocked, meaning you can use them with your current service provider or take them with you if you decide to switch to a different company in the future. As for the discounted iPhones, there are a variety of models on sale here, though the iPhone Pro 16 is the best of the bunch, and you can grab one for as low was $816 (was $979). To be fair, smartphone design is very iterative these days, so even the iPhone 15 Pro Max or iPhone 14 are still worth picking up while they're discounted, especially if you haven't upgraded in a while. iPhone Pro and Pro Max models offer more power, better batteries, larger screens, and enhanced cameras compared to the standard models. There's also the larger Pro Max comes down to size mainly, with the Pro Max offering Apple's best hardware of the year on a larger scale.Continue Reading at GameSpot",
    "author": "",
    "published": "Thu, 10 Jul 2025 17:50:00 -0700",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4526860-iphone-main.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "a2197cf9-6740-4711-b56b-72a2cde3815a",
    "title": "The Last Of Us Cooperative Strategy Game Gets First Big Discount For Prime Day",
    "link": "https://www.gamespot.com/articles/the-last-of-us-cooperative-strategy-game-gets-first-big-discount-for-prime-day/1100-6529757/?ftag=CAD-01-10abi2f",
    "description": "The Last of Us: Escape the Dark, an officially licensed board game based on Naughty Dog's hit PlayStation series, has received its first major discount. Fans can save 25% on the cooperative strategy game at Amazon, dropping the price from $75 to $56. This Prime Day deal is available to all shoppers and is expected to disappear July 12 at 12 AM PT, unless it sells out before then. The Last of Us: Escape the Dark Board Game $56 (was $75) Based on the hit series, The Last of Us: Escape the Dark was first announced back in 2022 but didn't hit store shelves until November 2024. It has earned pretty solid reviews so far and is the latest addition to Themeborne's well-received Escape the Dark tabletop strategy series.Each player picks a major character from Quarantine Zone--Joel, Ellie, Tommy, Bill, Tess, or Marlene--and embark on a perilous trek to Jackson. Along the way, you’ll encounter various scenarios via chapter cards, which put you up against FEDRA agents, the Infected, and other obstacles. Your only way to survive is quick thinking and constantly upgrading your weapons, ensuring you always have the best gear available for your next battle.Though designed as a cooperative survival-strategy game for up to five players, Escape the Dark is fully playable as a solo experience, too. More and more tabletop games seem to be offering solo modes these days, which is nice for fans who may not be able to get together with friends as often as they'd like.The game board and all its pieces look pretty sharp, too, thanks to Escape the Dark's black-and-white color scheme that captures foreboding atmosphere of the video games and TV series.Escape the Dark is recommended for players ages 14 and up. Each run takes anywhere from 60-90 minutes.Here's what you'll find inside the box:Game Board6 Survivor Boards6 Survivor Dice6 Survivor Tokens35 Chapter Cards3 Boss Chapter Cards5 Location Clear Cards2 Rules Reference CardsOver 100 Weapon, Item, Crafting, Special Ability, and QZ CardsOver 100 Tokens and MarkersIf you want to take a closer look at the ruleset and box contents, you can download a PDF of the official rule book from Themeborne's site. See at Amazon Continue Reading at GameSpot",
    "author": "",
    "published": "Thu, 10 Jul 2025 17:45:00 -0700",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1595/15950357/4529826-4451325-tlou.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "86d6429a-a3b8-408c-b733-9cefbab0f5d9",
    "title": "Poker Face Season 2 Ending Explained: Does It Set Up Season 3?",
    "link": "https://www.ign.com/articles/poker-face-season-2-ending-explained-does-it-set-up-season-3",
    "description": "Poker Face Season 2 has officially come to an end. Here's what's up with that ending, and how the finale sets up a potential Season 3.",
    "author": "Amelia Emberwing",
    "published": "Fri, 11 Jul 2025 01:07:37 +0000",
    "image": "https://assets-prd.ignimgs.com/2022/10/26/pokerfaceofficialteaser-ign-blogroll-1666801148508.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "f3af9db0-b0dc-4e42-b575-3c5a1a2ea80e",
    "title": "Some of the Best Sci-Fi Movies of All Time Are In Amazon's Epic Buy 2, Get 1 Free 4K Blu-ray Sale",
    "link": "https://www.ign.com/articles/sci-fi-movies",
    "description": "Time to build your collection.",
    "author": "Noah Hunter",
    "published": "Fri, 11 Jul 2025 00:00:49 +0000",
    "image": "https://assets-prd.ignimgs.com/2025/07/10/blu-ray-sci-fi-1752191488371.png",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "6e17ceda-141a-4314-ab46-53d16b31e5a6",
    "title": "Former Superman Actor Doesn’t Like James Gunn Calling The Hero An Immigrant",
    "link": "https://kotaku.com/superman-movie-james-gunn-dean-cain-immigrant-1851786076",
    "description": "Once Superman, always Superman.Read more...",
    "author": "Keith Nelson Jr",
    "published": "Thu, 10 Jul 2025 20:20:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/ad22ea41b92e7c24cb57d06f4d45156c.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "superman",
      "james gunn",
      "superman films",
      "lois clark",
      "entertainment culture",
      "white",
      "lois clark the new adventures of superman",
      "disney",
      "lois clark the new adventures of superman season 3",
      "kryptonians",
      "lois clark the new adventures of superman season 1",
      "superman in other media",
      "alternative versions of superman",
      "sunday times",
      "clark kent",
      "tom welling",
      "kevin feige",
      "christopher reeve",
      "dean cain",
      "snow white",
      "lois clark the new adventures of superman season 2",
      "jay z"
    ]
  },
  {
    "id": "b43e6e34-a1b7-403a-b957-d8d3cf1af126",
    "title": "New Horror Game Is All About Doing Dentist Work On A Shark That Wants To Kill You",
    "link": "https://kotaku.com/shark-dentist-horror-game-deadly-great-white-steam-pc-1851786072",
    "description": "Sometimes, all you need to hear is a game’s title to know you want to play it the moment it launches. That was the case for me with Shark Dentist, a new horror game that was just announced for PC. Read more...",
    "author": "Zack Zwiezen",
    "published": "Thu, 10 Jul 2025 20:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/4349ad8c72c7654fe8f89a302f17abb8.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "films",
      "health medical pharma",
      "human interest",
      "jaws"
    ]
  },
  {
    "id": "0db99d23-4233-46f0-9d33-543187fcae3c",
    "title": "Makeup and Beauty Blog Monday Poll, Vol. 885",
    "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-885/",
    "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Do you keep backups of your favorite products? These days, the only backups I buy are things I know I’ll finish on a regular basis (like shampoo and conditioner, or body lotion). I don’t even bother with makeup backups anymore, though. If I finish something like a blush or an eyebrow pencil, great, and if it’s still around when it’s time to restock, that’s even better. If it’s discontinued, I might mourn it a little bit, but there’s always something new coming out, and I don’t mind trying new things, so I don’t stress about it too much. 2. Something that you read/watched/listened to recently that was surprisingly great? I watched “KPop Demon Hunters” on Netflix with Connor over the weekend, and I was surprised to enjoy[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 885 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 07 Jul 2025 23:22:18 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun-610x610.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun"
    ]
  },
  {
    "id": "65c4ee77-f13e-40e5-a7e7-760904f935e7",
    "title": "Makeup and Beauty Blog Monday Poll, Vol. 884",
    "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-884/",
    "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Do you have a favorite vegetable? Yes! Carrots, for sure. The fact that you can turn them into a cake is a big deal! I mean, come on, have you ever heard of a broccoli cake? Or an okra cake? Yeah, I didn’t think so, LOL! I also love that you can put them in salads, roast them or just eat them plain with a variety of different dips. 2. A song that’s been stuck in your head lately? “Top of the World” by The Carpenters has been on repeat in my car. 3. Something you’ve been avoiding lately? Social media and the news cycle in general. 4. Lip masks: yes or no? Yes, but only if we’re talking Laneige. 5. Whatcha reading right now? “The Mysterious[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 884 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 30 Jun 2025 23:10:13 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2025/06/monday-poll-seek-joy-blue-hydrangeas-610x610.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun"
    ]
  },
  {
    "id": "e116e29f-992c-40b5-99ba-22bb43c17b5b",
    "title": "First look: PS5 Ghost of Yōtei Limited Edition console designs",
    "link": "https://blog.playstation.com/2025/07/10/first-look-ps5-ghost-of-yotei-limited-edition-console-designs/",
    "description": "We just had an exciting State of Play gameplay deep dive air for Sucker Punch’s Ghost of Yōtei, and this included a first look at the PS5 Console – Ghost of Yōtei Limited Edition Bundles, featuring new intricate console designs with a matching DualSense Wireless controller. These stunning designs capture Sucker Punch’s fictional depiction of […]",
    "author": "Erika Peterson",
    "published": "Thu, 10 Jul 2025 21:27:49 +0000",
    "image": "https://blog.playstation.com/uploads/2025/07/39f8b4c4c6cb142e0324919b664f9ccee1415bfc.mp4",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "Events",
      "PS5",
      "Uncategorized",
      "ghost of yotei",
      "state of play",
      "sucker punch"
    ]
  },
  {
    "id": "029dff4c-66f5-45d1-b23c-12e74aeaaab1",
    "title": "Helldivers 2 Control Group Warbond launches July 17",
    "link": "https://blog.playstation.com/2025/07/10/helldivers-2-control-group-warbond-launches-july-17/",
    "description": "Attention, Helldivers! The Ministry of Defense Research \u0026 Development team has just declassified the following information for immediate release.  You have been cleared to field test a new range of experimental weapons built from acquired alien technology. R\u0026D scientists have completed the Control Group Premium Warbond* for deployment to your Super Destroyer! Weapons \u0026 Stratagems […]",
    "author": "Katherine Baskin",
    "published": "Thu, 10 Jul 2025 13:00:36 +0000",
    "image": "https://blog.playstation.com/content/themes/playstation-2018/images/placeholder.svg",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "PS5",
      "arrowhead game studios",
      "helldivers 2"
    ]
  },
  {
    "id": "c59fc209-88b7-42b1-ac14-ea0e07c24527",
    "title": "Ghost of Yōtei brings back Kurosawa Mode, adds new presentations inspired by more great Japanese directors",
    "link": "https://www.polygon.com/gaming/603401/ghost-of-yotei-ps5-gameplay-trailer-state-of-play",
    "description": "Sucker Punch Productions shared an extended look at PlayStation 5 game Ghost of Yōtei on Thursday during Sony’s Yōtei-specific State of Play. It offered future ghosts more details about Atsu’s weapons, her journey across Ezo, and new and returning presentation modes. Ghost of Tsushima’s Kurosawa Mode was a wonderful homage to the great Akira Kurosawa, […]",
    "author": "Austin Manchester",
    "published": "2025-07-10T18:03:54-04:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Gaming",
      "News",
      "PlayStation",
      "Trailers"
    ]
  },
  {
    "id": "6d181bf7-4734-4182-9fbd-a98eea61d065",
    "title": "Superman’s post-credits scenes are so dumb, they feel like a gag aimed at Marvel",
    "link": "https://www.polygon.com/movies/611906/supermans-post-credits-scenes-are-so-dumb-they-feel-like-a-gag-aimed-at-marvel",
    "description": "James Gunn’s Superman isn’t the first project released in the new DC cinematic universe he and DC co-chair/CEO Peter Safran are building — that honor went to Creature Commandos in late 2024. But Superman is certainly a decisive moment for the new DCU, both a statement of intent for DC’s new tone, and a big, splashy […]",
    "author": "Tasha Robinson",
    "published": "2025-07-10T17:30:00-04:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Action",
      "Entertainment",
      "Movies"
    ]
  },
  {
    "id": "254a235d-7ed8-4db2-bc73-0e3ce7cb8073",
    "title": "I've found some awesome prebuilt gaming PC Prime Day Deals that are cheaper than building one",
    "link": "https://www.rockpapershotgun.com/best-gaming-pc-prime-day-deals-2025",
    "description": "There’s a strong mix of Prime Day deals and direct offers from HP, Dell, MSI, and others, covering everything from compact gaming laptops to top-tier RTX 5090 desktops. Some builds are priced well below what it would cost to build yourself, and a few include extra savings with codes like LEVELUP20. If you're gaming on the go or setting up a full desktop battlestation, there’s a deal in this guide for just about everyone. Read more",
    "author": "Christian Wait",
    "published": "Thu, 10 Jul 2025 16:00:00 +0000",
    "image": "https://assetsio.gnwcdn.com/PIXEL-9-(47).jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=70\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": null
  },
  {
    "id": "0994b86e-88b3-449f-b2f4-f908292abc56",
    "title": "I've found the best Steam Deck dock deals during Amazon Prime Day 2025",
    "link": "https://www.rockpapershotgun.com/ive-found-the-best-steam-deck-dock-deals-during-amazon-prime-day-2025",
    "description": "Was: $44.99, Now: $24.50, 46% off Read more",
    "author": "Christian Wait",
    "published": "Thu, 10 Jul 2025 16:00:00 +0000",
    "image": "https://assetsio.gnwcdn.com/PIXEL-9-(49).jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=70\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": null
  },
  {
    "id": "ea87f689-5361-4a4b-a022-57677f4bfcad",
    "title": "Now Available on Steam - SCUM",
    "link": "https://store.steampowered.com/news/246601/",
    "description": "",
    "author": "Valve",
    "published": "Tue, 17 Jun 2025 15:55:24 +0100",
    "image": "https://cdn.fastly.steamstatic.com/steam/apps/513710/header.jpg",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "4101f3f1-79d5-4e33-aad2-1d3c29047b54",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/244390/",
    "description": "",
    "author": "Valve",
    "published": "Tue, 13 May 2025 23:22:00 +0100",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "85dbeb03-7bcc-4ec0-9c45-2a0e98846613",
    "title": "Wrapping Up Steam Summer Sale 2025",
    "link": "https://tagn.wordpress.com/2025/07/10/wrapping-up-steam-summer-sale-2025/",
    "description": "When this post goes live the Steam Summer Sale will have passed, another such sale now in the rear view mirror.  The sales, like the seasons, come and go in a continuous flow. This year, as with most recent sales, I ended up not buying anything. Insert the usual boilerplate about too many unplayed games […]",
    "author": "Wilhelm Arcturus",
    "published": "Thu, 10 Jul 2025 17:15:08 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "Steam",
      "Steam Summer Sale"
    ]
  },
  {
    "id": "07ef3691-3d70-4f2c-97bd-166a72c6e7d5",
    "title": "Warming up for Pandaria",
    "link": "https://tagn.wordpress.com/2025/07/09/warming-up-for-pandaria/",
    "description": "As we have been told, Mists of Pandaria Classic is headed our way in under two weeks.  It will soon be time for another test of “was this as good/bad as I remember it?” on the WoW Classic front. This coincided pretty well with my arrival in Mordor, so what time I have been putting […]",
    "author": "Wilhelm Arcturus",
    "published": "Wed, 09 Jul 2025 15:15:54 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "World of Warcraft",
      "WoW Classic",
      "Pet Battles"
    ]
  },
  {
    "id": "d45ff2fb-e078-4cd9-a9da-b86e85f65aee",
    "title": "Geometry Dash (by RobTop Games)",
    "link": "https://toucharcade.com/community/threads/geometry-dash-by-robtop-games.200268/",
    "description": "",
    "author": "metalcasket",
    "published": "Wed, 09 Jul 2025 23:55:57 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "4348511f-6774-4ad9-892f-5f912d3d4a50",
    "title": "Free Music Resource - soundimage.org",
    "link": "https://toucharcade.com/community/threads/free-music-resource-soundimage-org.235303/",
    "description": "",
    "author": "Eric Matyas",
    "published": "Tue, 08 Jul 2025 13:09:28 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "bb650d81-6b52-4b04-a94a-11da1c19b0fc",
    "title": "Free Play Days – MLB The Show 25, Polterguys: Possession Party, RollerCoaster Tycoon 3: Complete Edition and Blasphemous",
    "link": "https://news.xbox.com/en-us/2025/07/10/free-play-days-07-10-2025/",
    "description": "The post Free Play Days – MLB The Show 25, Polterguys: Possession Party, RollerCoaster Tycoon 3: Complete Edition and Blasphemous appeared first on Xbox Wire.",
    "author": "Danielle Partis",
    "published": "Thu, 10 Jul 2025 15:00:00 +0000",
    "image": "https://xboxwire.thesourcemediaassets.com/sites/2/2025/07/FreePlayDays_07-10-2025_1920x1080_4shot-011aa17df5cde0803233-1024x576.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "Xbox Game Pass",
      "Blasphemous",
      "Free Play Days",
      "Game Pass Core",
      "Game Pass Standard",
      "Game Pass Ultimate",
      "MLB The Show",
      "Polterguys: Possession Party",
      "Rollercoaster Tycoon 3"
    ]
  },
  {
    "id": "64fe329d-8acc-4363-88be-2a1acfa4e0e0",
    "title": "Accessible Games Initiative Tags Now Available Across All Digital Xbox Experiences",
    "link": "https://news.xbox.com/en-us/2025/07/09/accessible-games-initiative-tags-xbox-interview/",
    "description": "The post Accessible Games Initiative Tags Now Available Across All Digital Xbox Experiences appeared first on Xbox Wire.",
    "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
    "published": "Wed, 09 Jul 2025 16:00:00 +0000",
    "image": "https://xboxwire.thesourcemediaassets.com/sites/2/2025/07/DISABILITY-PRIDE-HERO-2022--9a2c0bd5861054ae4a4a-1024x576.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Announcements",
      "Accessibility",
      "Accessibility Tags",
      "Accessible Games Initiative",
      "Accessible Games Initiative Tags",
      "Disability Pride",
      "Disability Pride Month",
      "Steve Saylor",
      "Xbox"
    ]
  }
]
