[
  {
    "id": "f52f7f08-bbf9-43cc-89fc-0e2bc7491e91",
    "title": "Justin Bieber Causes Chaos By Unfollowing His Wife – And His Excuse Doesn’t Add Up",
    "link": "https://www.escapistmagazine.com/justin-bieber-causes-chaos-by-unfollowing-his-wife-and-his-excuse-doesnt-add-up/",
    "description": "",
    "author": "Sarah Barrett",
    "published": "Tue, 21 Jan 2025 18:07:38 +0000",
    "image": "",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "News",
      "Featured",
      "Justin Bieber"
    ]
  },
  {
    "id": "117c0704-250d-4608-9936-9378e36f0cc9",
    "title": "Brutalist Director Faces Backlash Over AI-Erased Accents in Latest Controversy Chapter",
    "link": "https://www.escapistmagazine.com/brutalist-director-faces-backlash-over-ai-erased-accents-in-latest-controversy-chapter/",
    "description": "",
    "author": "Sarah Barrett",
    "published": "Tue, 21 Jan 2025 16:02:07 +0000",
    "image": "https://s.w.org/images/core/emoji/15.0.3/72x72/2728.png",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "Movies \u0026 TV",
      "News",
      "Featured",
      "The Brutalist"
    ]
  },
  {
    "id": "a6cfc702-fdc0-45b9-974b-d81f62ab29b6",
    "title": "Netflix is hiking prices again, but most of Europe has escaped for now",
    "link": "https://www.eurogamer.net/netflix-is-hiking-prices-again-but-most-of-europe-has-escaped-for-now",
    "description": "Netflix has announced another wave of price hikes across its various membership tiers - including a Premium subscription bump to $25 a month, among other things - but, for the time being at least, most European countries won't be affected by the charges. Read more",
    "author": "Matt Wales",
    "published": "Wed, 22 Jan 2025 00:24:03 +0000",
    "image": "https://assetsio.gnwcdn.com/netflix-games.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": null
  },
  {
    "id": "4faf9687-0d84-431a-a4a4-e8993f2916a5",
    "title": "Sonic the Hedgehog 4 movie gets a release date, but it's still a few years out",
    "link": "https://www.eurogamer.net/sonic-the-hedgehog-4-movie-gets-a-release-date-but-its-still-a-few-years-away",
    "description": "We already knew roughly when it was coming, thanks to Paramount's announcement at the end of last year, but the Sonic the Hedgehog 4 movie now has a proper release date. It is, however, still a fair way out - with Sonic's next big screen undertaking not due until March 2027. Read more",
    "author": "Matt Wales",
    "published": "Tue, 21 Jan 2025 22:17:40 +0000",
    "image": "https://assetsio.gnwcdn.com/sonic-the-hedgehog-3-movie.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "Platformer",
      "Nintendo Switch 2",
      "Side view",
      "Action Adventure",
      "Single Player",
      "Third person",
      "Sonic Team",
      "Sonic X Shadow Generations",
      "PS5",
      "Nintendo Switch",
      "SEGA",
      "Xbox One",
      "Xbox Series X/S",
      "PC",
      "PS4"
    ]
  },
  {
    "id": "afca96e9-6df0-4123-9c27-2abdec8bfb41",
    "title": "Microsoft Edge Now Features This Popular Steam-Like Feature",
    "link": "https://www.gamespot.com/articles/microsoft-edge-now-features-this-popular-steam-like-feature/1100-6528925/?ftag=CAD-01-10abi2f",
    "description": "Late last year, Microsoft signaled its plans to make Edge the preferred browser for PC gamers with the first look at the Microsoft Edge Game Assist. It's a version of Edge that was specifically made for gaming, with browsers and windows that appear on top of games so players can access strategy guides and tips as needed. Now, Microsoft Edge Game Assist is out of the initial testing phase and available for all to use.Game Assist appears to have been modeled on Steam's overlay browser. It can also detect when a handful of supported games are being played and offer relevant info on a side panel. The games that are currently supported include Marvel Rivals, Indiana Jones and the Great Circle, and Dragon Age: The Veilguard. However, those aren't the only titles that can be played. Any game can be used in this mode, but only the supported games will have automatic guides readily available. The video below demonstrates how the Game Assist is supposed to work. Players can access this feature by going to Microsoft Edge and opening up the Settings and more to find the Game Assist widget. Once installed, the Game Assist feature will be available in the Game Bar. Because the Game Assist shares date with Edge's browser data, players' favorites, browsing history, and cookies will all remain the same. Continue Reading at GameSpot",
    "author": "",
    "published": "Tue, 21 Jan 2025 15:45:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1837/18375603/4431088-microsoftedgegameassist.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "80888bad-aca9-4c0e-b46a-9cbdb089a81c",
    "title": "Sonic The Hedgehog 3 Now Available On Digital, Two 4K Steelbooks Revealed",
    "link": "https://www.gamespot.com/articles/sonic-the-hedgehog-3-now-available-on-digital-two-4k-steelbooks-revealed/1100-6528597/?ftag=CAD-01-10abi2f",
    "description": "Sonic the Hedgehog 3 Limited Edition Steelbook (4K Blu-ray) $45 | Releases April 15 Preorder at Walmart Preorder at Amazon Sonic the Hedgehog 3 Limited Edition Shadow Steelbook (4K Blu-ray) $45 | Releases April 15 Preorder at Target Sonic the Hedgehog 3 Standard Edition (4K Blu-ray) $36 | Releases April 15 Preorder at Walmart Preorder at Amazon Sonic the Hedgehog 3 is now available to rent or buy on streaming platforms, including Prime Video, for $20 or $25, respectively. The streaming launch coincided with the reveal of the 4K Blu-ray release date and the existence of not one, but two steelbooks. Sonic the Hedgehog 3's Limited Edition Steelbook will be available with Sonic or Shadow character art when the movie arrives on Blu-ray April 15. This is the same approach we saw with Deadpool \u0026 Wolverine last year, so it will be interesting to see if this format becomes a trend.Buy or rent Sonic the Hedgehog 3 on Prime Video Sonic the Hedgehog 3 Limited Edition Steelbook (4K Blu-ray) $45 | Releases April 15 Sonic the Hedgehog 3's first Limited Edition Steelbook features the Blue Blur doing what he does best. This edition comes with 4K Blu-ray, standard 1080p Blu-ray, and digital versions of Sonic 3. You also get a bunch of bonus featurettes.Preorders for the Sonic variant of the Limited Edition Steelbook releases are available at Walmart for $45.Amazon was taking preorders for a few weeks, but as of January 21, Sonic 3 is no longer available to order at Amazon. That said, we don't believe it sold out, because the standard 4K and DVD editions aren't available to purchase either. We suspect Amazon will reopen preorders once it lists the Shadow variant of the Limited Edition Steelbook.Amazon and Walmart both offer preorder price guarantees. You won't be charged until your order ships, and you will only pay the lowest price offered between the time you preorder and release. Preorder at Walmart Preorder at Amazon Sonic the Hedgehog 3 Limited Edition Shadow Steelbook (4K Blu-ray) $45 | Releases April 15 Sonic 3's Limited Edition Steelbook featuring Shadow is only available to preorder at Target at this time, but we'd expect other retailers to list it soon. The Shadow variant complements the Sonic edition by offering the same art design, just with red streaks instead of blue. Like the Sonic variant, the Shadow version costs $45 and comes with 4K Blu-ray, standard 1080p Blu-ray, and digital versions of Sonic 3. You'll also get the same bonus features. The only difference between the two releases is the steelbook. Preorder at Target Sonic the Hedgehog 3 Standard Edition (4K Blu-ray) $36 | Releases April 15 If you don't have any interest in steelbook cases, the 4K release of Sonic the Hedgehog 3 is up for preorder for $36 at Walmart.Preorders for the DVD release are available for $26 at Walmart. At this time, it doesn't appear that Sonic 3 will get a standalone 1080p Blu-ray release. As such, even if you don't have a 4K media player, you'll still need to get the 4K edition to watch Sonic 3 on standard Blu-ray. Preorder at Walmart Preorder at Amazon Sonic the Hedgehog 3 Special FeaturesAudio Commentary - Watch the movie with director Jeff Fowler and actor Ben Schwartz (Sonic).Sonic Family Fun - Cast and crew talk about becoming a family while making the three films.Enter Shadow - Keanu Reeves and other stars discuss his portrayal of Shadow.Robotnik Family Reunion: Ivo and Gerald - Jim Carry and cast/crew discuss bringing Ivo and Gerald Robotnik to the screen.For the Love of Sonic: Directing a Trilogy - Director Jeff Fowler reflects on his experience directing the Sonic films.The Fox, the Echidna, and the Hedgehog - Visit the recording booth with voice actors for Sonic (Ben Schwartz), Tails (Colleen O'Shaughnessey), and Idris Elba (Knuckles).Live-Action Lunacy: Acting Opposite Puppets - Actors talk about filming alongside giant puppets.From the Cryo-Tank to London: The World of Sonic - Production crews show off the filming locations and set designs of Sonic 3. Team Sonic vs. Shadow - Choreographers talk about creating the showdown between Sonic and Shadow. A Very Sonic Christmas - Team Sonic saves Christmas with Santa Claus.Gag ReelDeleted Scenes Catch up on the Sonic Live-Action Movie \u0026 TV SeriesSonic the Hedgehog 2-Movie Steelbook CollectionSonic the Hedgehog 3's theatrical release led to multiple editions of the first two movies to sell out, including the 4K Blu-ray 2-Movie Steelbook Collection shown above. As of January 21, here's the stock situation for Sonic, Sonic 2, and the Knuckles miniseries at Amazon. The 2-Movie Collection on standard Blu-ray offers the best value at the moment.Continue Reading at GameSpot",
    "author": "",
    "published": "Tue, 21 Jan 2025 15:01:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1595/15950357/4431082-sonic3blurays.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "ef604956-d563-4c04-b851-0aceefce75a9",
    "title": "AU Deals: Pay the Least Gil for FF7 Rebirth on PC, FC 25, Star Wars Outlaws, Spidey, and More!",
    "link": "https://www.ign.com/articles/au-deals-pay-the-least-gil-for-ff7-rebirth-on-pc-fc-25-star-wars-outlaws-spidey-and-more-au-deals",
    "description": "Get into the middle of a landslide of discounts during the absolute middle of your week!",
    "author": "Adam Mathew",
    "published": "Wed, 22 Jan 2025 00:14:26 +0000",
    "image": "https://assets-prd.ignimgs.com/2025/01/22/jan-22-skate-2-thumb-1737504842418.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "341e4b09-6c1d-4047-9419-5e041da8e065",
    "title": "The Incredibly Priced 27\" AOC 240Hz OLED Gaming Monitor Is Back in Stock at Amazon",
    "link": "https://www.ign.com/articles/aoc-27-inch-240hz-oled-gaming-monitor-deal-2025",
    "description": "The lowest price we've ever seen for an OLED gaming monitor.",
    "author": "Eric Song",
    "published": "Tue, 21 Jan 2025 23:40:00 +0000",
    "image": "https://assets-prd.ignimgs.com/2025/01/21/aocoledmonitor-1737501997676.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "b5face0b-5130-4213-9b7c-0a2995b6176c",
    "title": "Netflix Is Raising Its Prices Again, Even For People Watching With Ads",
    "link": "https://kotaku.com/netflix-price-hike-ad-tier-stranger-things-season-5-1851744457",
    "description": "The most popular streaming service behind Stranger Things and other hits is raising its prices for the second time in as many years. Netflix announced it will charge users anywhere from $12 to $24 more a year depending on their subscription tier. Even viewers who are already watching ads will have to pay more to see…Read more...",
    "author": "Ethan Gach",
    "published": "Tue, 21 Jan 2025 23:12:14 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/e65247dde6ba1417508c4dcf5b3c9405.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "netflix",
      "advertising",
      "business finance",
      "entertainment culture",
      "jake paul",
      "mike tyson",
      "streaming media",
      "universal windows platform apps",
      "technology internet",
      "squid game",
      "music streaming service",
      "xbox one software",
      "stranger things season 1"
    ]
  },
  {
    "id": "716edec7-3b26-4189-86bc-dd961dab3c41",
    "title": "Sonic The Hedgehog 4 Arrives In Spring 2027, Paramount Confirms",
    "link": "https://kotaku.com/sonic-4-film-sequel-confirmed-march-spring-2027-sega-1851744323",
    "description": "After previous reporting in December confirmed another Sonic sequel was in the works, Paramount has officially announced that Sonic the Hedgehog 4 will arrive in theaters in March 2027. Read more...",
    "author": "Zack Zwiezen",
    "published": "Tue, 21 Jan 2025 22:05:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/423d999a690115e8f7f441c199970602.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "sonic the hedgehog",
      "sonic",
      "cooperative video games",
      "tails",
      "windows games",
      "entertainment culture",
      "draftsonic the hedgehog",
      "knuckles the echidna",
      "keanu reeves",
      "jim carrey",
      "shadow the hedgehog",
      "video games developed in japan",
      "doctor eggman",
      "idris elba",
      "platformers",
      "ivo robotnik",
      "paramount pictures",
      "ben schwartz",
      "knuckles"
    ]
  },
  {
    "id": "8a07edbb-a238-471b-a491-3de33867adde",
    "title": "World of Warships: Legends introduces new quick guide, The Codex",
    "link": "https://blog.playstation.com/2025/01/21/world-of-warships-legends-introduces-new-quick-guide-the-codex/",
    "description": "Mastering a game is always a challenge, and when you have to deal with over 500 different ships with unique commanders, guns, and armor schemes, things can get out of hand real quickly. That’s where our new feature comes in: The Codex. Available on both PlayStation 4 and PlayStation 5, this all-encompassing in-game encyclopedia brings […]",
    "author": "Panagiotis Milopoulos",
    "published": "Tue, 21 Jan 2025 13:00:10 +0000",
    "image": "https://live.staticflickr.com/65535/54263720766_5e7e197cb4_o.jpg",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "PS4",
      "PS5",
      "wargaming",
      "world of warships: legends"
    ]
  },
  {
    "id": "0a7e1b8b-3011-411d-8c82-c4f64896c588",
    "title": "(For Southeast Asia) Lunar New Year promotion comes to PlayStation Store",
    "link": "https://blog.playstation.com/2025/01/20/20240121-lny/",
    "description": "PlayStation Store Lunar New Year promotion comes to PlayStation Store on 22 January*! Enjoy up to 75% off on a huge range of incredible games until 12 February. Highlighted titles include Call of Duty®: Black Ops 6, TEKKEN 8, Persona 3 Reload and Resident Evil 4. Head to PlayStation Store to enjoy savings now! PlayStation […]",
    "author": "Taro Asahi",
    "published": "Tue, 21 Jan 2025 02:06:52 +0000",
    "image": "https://blog.playstation.com/tachyon/2025/01/75e0883af09b0ebe3bd20f4ba5651b5e22a40691.png",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "Events",
      "playstation store"
    ]
  },
  {
    "id": "e8fcda56-b2f5-4505-b7ed-896369977139",
    "title": "Peter Dinklage’s ultra-gory Toxic Avenger movie is finally headed to theaters",
    "link": "https://www.polygon.com/movies/511904/toxic-avenger-2025-release-peter-dinklage-new-movie",
    "description": "2025 is going to be a big year for movies. This is true not just by nature of the sheer tonnage of stuff coming to theaters (Avatar 3, even!), but also because the long-awaited, long-delayed Toxic Avenger reboot is finally coming to theaters. Cineverse announced on Tuesday that it will release The Toxic Avenger later […]",
    "author": "Zosha Millman",
    "published": "2025-01-21T18:44:58-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Entertainment",
      "Horror",
      "Movies",
      "News"
    ]
  },
  {
    "id": "c65e2e6c-43df-4659-943f-09e6730e5f2a",
    "title": "Netflix raises prices again, making the standard plan $17.99",
    "link": "https://www.polygon.com/news/511875/netflix-raising-prices-increase-cost-ad-tier-standard-january-2025",
    "description": "Netflix is getting more expensive — again. The streaming service raised prices for all of its plans as of Jan. 21, with the hike going into effect for current subscribers starting with their next billing cycle. Netflix is raising the price of its ad-supported tier from $6.99 to $7.99. Its ad-free tier is going from $15.49 […]",
    "author": "Austen Goslin",
    "published": "2025-01-21T18:13:43-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Entertainment",
      "News"
    ]
  },
  {
    "id": "b461f8bf-c77d-45b8-a727-1fffbba42ded",
    "title": "Here's a demo for Eternal Strands, the Zelda-meets-Colossus wizarding sim from a former Dragon Age director",
    "link": "https://www.rockpapershotgun.com/heres-a-demo-for-eternal-strands-the-zelda-meets-colossus-wizarding-sim-from-a-former-dragon-age-director",
    "description": "Many moons ago in the Before Times, a mysterious cataclysm scattered a number of seasoned BioWare developers across the face of heaven. The developers fell upon the mortal planes like comets. Where each landed, a game development studio took root. Inflexion Games. Summerfall Studios. Humanoid Origin. Worlds Untold. Archetype Entertainment. Summerfall appear to be prospering, but many of the studios founded by former BioWare devs have experienced hard times. In particular, Humanoid Origin and Worlds Untold have respectively closed and \"paused operations\" without releasing a single game. I'm raising a tentatively congratulatory glass, then, to Yellow Brick Games, a studio founded by former Dragon Age director Mike Laidlaw. The company's debut game Eternal Strands will release on 28th January, and there's now a PC demo. Read more",
    "author": "Edwin Evans-Thirlwell",
    "published": "Tue, 21 Jan 2025 17:07:01 +0000",
    "image": "https://assetsio.gnwcdn.com/eternal-strands_Kr60lsX.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "RPG: Action",
      "Exploration",
      "Action Adventure",
      "PC",
      "Xbox Series X/S",
      "PS5",
      "Fantasy",
      "Eternal Strands"
    ]
  },
  {
    "id": "ba4b54fa-e6ff-4610-8ed6-cc02d4eef0ed",
    "title": "My most anticipated indie of 2025 quietly updated its demo build while I was off eating lunch",
    "link": "https://www.rockpapershotgun.com/my-most-anticipated-indie-of-2025-quietly-updated-its-demo-build-while-i-was-off-eating-lunch",
    "description": "Or months ago, maybe. I don't know and I have no time to check, because I'm playing the Steam demo for The King Is Watching. I wrote about it last year, but that was an older demo build. Things were different then, but the core of this minimalist city builder strategy remains: you'll need to actively train your kingly eyes on your feckless underlings if you want them to do any work. Don't watch the wheat fields, no food. Don't watch the barracks, no knights. You'll need those knights to defend from attacks too. Do you see how it all connects?! Do you?! Please, do your research. Here's a trailer to help: Read more",
    "author": "Nic Reuben",
    "published": "Tue, 21 Jan 2025 14:05:57 +0000",
    "image": "https://assetsio.gnwcdn.com/the-king-is-watching-new.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "The King Is Watching",
      "Strategy: Builder"
    ]
  },
  {
    "id": "5b18e04c-5788-493b-a955-322c2ef120ef",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/235895/",
    "description": "",
    "author": "Valve",
    "published": "Tue, 24 Dec 2024 11:23:00 -0800",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "44a73746-2d96-4325-a7d0-112daccb99c0",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/235674/",
    "description": "",
    "author": "Valve",
    "published": "Thu, 19 Dec 2024 16:16:00 -0800",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "2456faa2-b5c1-48fc-abe3-66a40ad2ff45",
    "title": "Trailer Tuesday – The Christmas Mullet Empire",
    "link": "https://indiegamesplus.com/trailer-tuesday-the-christmas-mullet-empire/",
    "description": "Trailer Tuesday needs you to blast folks to keep breathing, listen to dead people chat on a creepy planet, and save the world with fishing. MULLET MADJACK “Your HEALTH is TIME. You... The post Trailer Tuesday – The Christmas Mullet Empire appeared first on Indie Games Plus.",
    "author": "Joel Couture",
    "published": "Tue, 21 Jan 2025 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "Features",
      "Airborne Empire",
      "Bloodshed",
      "BROK the InvestiGator - Natal Tail A New Christmas",
      "cybeRRRevolution",
      "Discolored 2",
      "MULLET MADJACK",
      "Sea Fantasy",
      "Shui's Odyssey",
      "Stars In The Trash",
      "Sylvio: Black Waters",
      "trailer tuesday"
    ]
  },
  {
    "id": "e0c50c8c-3bda-4244-8503-9c35e785ed35",
    "title": "‘Awaria’ Completes Intense Repairs to Get Ghost Smooches",
    "link": "https://indiegamesplus.com/awaria-review/",
    "description": "Awaria puts you in charge of maintaining generators that not only keep you safe from ghosts, but also let you find romance with them. Your new repair job is a hectic, dangerous... The post ‘Awaria’ Completes Intense Repairs to Get Ghost Smooches appeared first on Indie Games Plus.",
    "author": "Joel Couture",
    "published": "Mon, 20 Jan 2025 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "Reviews",
      "action",
      "Awaria",
      "Linux",
      "Łukasz Piskorz",
      "Mac",
      "Mittsies",
      "Patryk Karwat",
      "puzzle",
      "windows"
    ]
  },
  {
    "id": "21a24761-ff35-4092-864e-93bc2ae41262",
    "title": "Playable Worlds’ Stars Reach: A Kickstarter Pledge Dilemma",
    "link": "https://tagn.wordpress.com/2025/01/21/playable-worlds-stars-reach-a-kickstarter-pledge-dilemma/",
    "description": "We heard a bit back from Playable Worlds that they want to run a Kickstarter campaign for Stars Reach. Any mentioned of Kickstarter and the MMORPG space in the same breath is almost guaranteed to generate some level of backlash, that patch of land having been burned to the ground and salted for good measure […]",
    "author": "Wilhelm Arcturus",
    "published": "Tue, 21 Jan 2025 14:00:00 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "Kickstarter",
      "Stars Reach",
      "Playable Worlds",
      "Raph Koster"
    ]
  },
  {
    "id": "baadc180-09b0-490e-a95a-918f1710a451",
    "title": "A New Age of Charlatanism Arrives",
    "link": "https://tagn.wordpress.com/2025/01/20/return-of-the-chaos-era/",
    "description": "I feel like I might have wasted that headline on this post, as it applies so well to AI and crypto as ventures.  But all the AI and crypto execs are in full support of the new administration, so I guess it still fits.  One grift to rule them all. I suppose there is some […]",
    "author": "Wilhelm Arcturus",
    "published": "Mon, 20 Jan 2025 17:15:38 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "Random",
      "Kakistocracy",
      "Kleptocracy",
      "Politics",
      "Rambling Detected",
      "Yeah well that's just like your opinion man"
    ]
  },
  {
    "id": "0552774d-2e73-48b4-b7e1-53169e80aba8",
    "title": "Free Music Resource - soundimage.org",
    "link": "https://toucharcade.com/community/threads/free-music-resource-soundimage-org.235303/",
    "description": "",
    "author": "Eric Matyas",
    "published": "Tue, 21 Jan 2025 13:05:40 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "0fff36bf-6cde-4bff-99bf-ffc186fd22ed",
    "title": "[Pre-Order] The Valley of the Architects",
    "link": "https://toucharcade.com/community/threads/pre-order-the-valley-of-the-architects.420937/",
    "description": "",
    "author": "Whaleo",
    "published": "Sun, 19 Jan 2025 23:33:14 +0000",
    "image": "http://www.whaleo.com/thevalley/thumbnail_IMG_5334.png",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "4cbc62f5-f384-4a96-9a5a-c195b4e3f6cb",
    "title": "Bringing Conan the Barbarian’s Sword Mastery to Mortal Kombat 1",
    "link": "https://news.xbox.com/en-us/2025/01/21/bringing-conan-the-barbarian-to-mortal-kombat-1/",
    "description": "The post Bringing Conan the Barbarian’s Sword Mastery to Mortal Kombat 1 appeared first on Xbox Wire.",
    "author": "Danielle Partis",
    "published": "Tue, 21 Jan 2025 19:00:00 +0000",
    "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2025/01/conan-MK1-hero-d45cded3ae0ab7d29189-1024x576.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "Conan the Barbarian",
      "Mortal Kombat 1",
      "Mortal Kombat 1: Khaos Reigns",
      "Xbox Series X|S"
    ]
  },
  {
    "id": "15da0ce9-69eb-40cd-a3fa-6c11d15e9990",
    "title": "Lore of Eora – Species | A Pillars of Eternity and Avowed Visual Guide",
    "link": "https://www.youtube.com/watch?v=jedO6SJURK0#new_tab",
    "description": "The post Lore of Eora – Species | A Pillars of Eternity and Avowed Visual Guide appeared first on Xbox Wire.",
    "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
    "published": "Tue, 21 Jan 2025 17:00:00 +0000",
    "image": "",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "PC Gaming",
      "Xbox Game Pass",
      "Avowed",
      "Game Pass",
      "Lore",
      "Obsidian Entertainment",
      "PC",
      "Xbox Series X|S"
    ]
  },
  {
    "id": "50a6c59d-77ca-4f74-8d92-71c67da83eb7",
    "title": "Makeup and Beauty Blog Monday Poll, Vol. 865",
    "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-865/",
    "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Mountains or desert? Mountains, ideally somewhere with a million shades of green and a river or a lake. Sure, my allergies will probably be crazy, but at least my heart will be happy. 2. Something you’re doing in 2025? Making decisions from a place of optimism and not fear. So often I needlessly worry about all the things that are involved and every little detail that could go wrong. I don’t want to be held back by fear anymore. Life is too short. 3. How easily do you cry? I’m 100% a crybaby. You know what, though? It’s not always because I’m sad. If I’m angry or frustrated or feeling anxious, my body releases whatever it needs to release through tears. It’s kind of a pain in[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 865 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 20 Jan 2025 18:00:00 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2025/01/i-hope-a-rainbow-finds-you-610x813.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun"
    ]
  },
  {
    "id": "1391e121-b22a-46b6-b602-19d5cf572547",
    "title": "Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 847",
    "link": "https://makeupandbeautyblog.com/just-for-fun/sundays-with-tabs-the-cat-makeup-and-beauty-blog-mascot-vol-847/",
    "description": "Thank you for being a friend. Guess who just discovered The Golden Girls? When she’s not doing science, Rosie’s been watching reruns of one of my favorite shows ever. Now she’s trying to get Marnie into her little Golden Girls gang because Rosie’s obsessed with them. Marnie’s kinda into it, but to be honest, I don’t really think she knows what’s going on. 😹 Rosie is Sophia, and Marnie is Rose from St. Olaf (obviously). To complete the group, Rosie has been trying to find a good Dorothy and Blanche. She put something up on Nextdoor this morning, but she doesn’t have a lot of faith in the cats in the neighborhood. Do you happen to know any cats or dogs who’d fit the bill? Your friendly neighborhood beauty addict, Karen The post Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 847 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 20 Jan 2025 03:40:10 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2025/01/rosie-golden-girls-gang-610x407.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun",
      "Marnie",
      "Rosie",
      "Tabs"
    ]
  }
]
