[
  {
    "id": "85e152e9-0493-4452-955f-54b0c635f8cc",
    "title": "‘Disappearance of a Sister’ – A Compelling Story in a Mind Map",
    "link": "https://indiegamesplus.com/notes-on-the-disappearance-of-a-sister-review/",
    "description": "Notes on the Disappearance of a Sister captures a captivating, affecting story within the limitations of a mind map program. I wasn’t sure exactly what I was expecting when I first clicked... The post ‘Disappearance of a Sister’ – A Compelling Story in a Mind Map appeared first on Indie Games Plus.",
    "author": "Dann Sullivan",
    "published": "Fri, 08 Nov 2024 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "News",
      "anti-productivity jam",
      "Browser",
      "Lithobreakers",
      "narrative",
      "Notes on the Disappearance of a Sister"
    ]
  },
  {
    "id": "871ccf2d-4bd9-4cf8-91e2-e352a3d30171",
    "title": "‘Fruitbus’ Lets You Find Your Flavor in an Open Cooking World",
    "link": "https://indiegamesplus.com/fruitbus-review/",
    "description": "Fruitbus sets you free in an open world of varied fruits and veggies to figure out the sorts of foods you will serve to the locals. You’re setting up shop in the... The post ‘Fruitbus’ Lets You Find Your Flavor in an Open Cooking World appeared first on Indie Games Plus.",
    "author": "Joel Couture",
    "published": "Thu, 07 Nov 2024 11:00:00 +0000",
    "image": "",
    "source": "https://indiegamesplus.com/feed",
    "categories": [
      "News",
      "Fruitbus",
      "krillbite studio",
      "simulation",
      "windows"
    ]
  },
  {
    "id": "0fbedac7-49c0-4b56-a566-09c7918dc92e",
    "title": "A New Donkey Kong Country 2 Cheat Has Been Discovered After Decades",
    "link": "https://www.escapistmagazine.com/donkey-kong-country-2-cheat-has-been-discovered/",
    "description": "",
    "author": "Arthur Damian",
    "published": "Fri, 08 Nov 2024 17:03:53 +0000",
    "image": "",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "News",
      "Video Games",
      "Donkey Kong",
      "Featured"
    ]
  },
  {
    "id": "ccfbe8d3-278b-47f2-b854-67cd1d88ebea",
    "title": "Ryan Reynolds Explains Ghost Rider Absence in Deadpool \u0026 Wolverine",
    "link": "https://www.escapistmagazine.com/ryan-reynolds-explains-ghost-rider-absence-in-deadpool-wolverine/",
    "description": "",
    "author": "Jorge A. Aguilar",
    "published": "Fri, 08 Nov 2024 16:43:37 +0000",
    "image": "",
    "source": "https://www.escapistmagazine.com/v2/feed/",
    "categories": [
      "News",
      "Deadpool",
      "Deadpool \u0026 Wolverine",
      "Deadpool 3",
      "Ghost Rider"
    ]
  },
  {
    "id": "98c683db-c89f-417e-816a-7c0bd1137633",
    "title": "King Boo's Haunted Mansion Lego Mario Set Gets First Price Cut At Amazon",
    "link": "https://www.gamespot.com/articles/king-boos-haunted-mansion-lego-mario-set-gets-first-price-cut-at-amazon/1100-6525381/?ftag=CAD-01-10abi2f",
    "description": "One of the coolest Lego Super Mario expansion sets is on sale for the first time at Amazon and Target: King Boo's Haunted Mansion. Released in August for $75 alongside the revamped starter kits for Mario, Luigi, and Peach, the 932-piece expansion kit is discounted to $60. It's one of numerous Lego Super Mario sets in Target's Early Black Friday Sale, which runs through November 9. Amazon is matching this deal and several others as well as offering deals of its own. Get Mario Haunted Mansion Deal at Amazon Continue Reading at GameSpot",
    "author": "",
    "published": "Fri, 08 Nov 2024 16:11:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1595/15950357/4397456-boomansion.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "7953d8b6-b578-425c-bfcd-7a0b189953c1",
    "title": "New Cuphead Limited-Edition Art Book Gets First Discount At Amazon",
    "link": "https://www.gamespot.com/gallery/new-cuphead-limited-edition-art-book-gets-first-discount-at-amazon/2900-5881/",
    "description": "One of the best video game art books just received a sequel. The Art of Cuphead: The Delicious Last Course was published by Dark Horse Books on November 5. Cuphead fans have three editions to choose from: a standard hardcover, Deluxe Edition hardcover, and Kindle ebook.And for the first time since going up for preorder a few months back, the Deluxe Edition has received a discount at Amazon, dropping the price to $89 (was $100). You can also get a big discount on The Art of the Cuphead Show, which chronicles the making of wonderful Netflix animated adaptation.The Art of Cuphead: The Delicious Last CourseStandard edition (Hardcover) -- $36 ($40)Deluxe Edition (Hardcover) -- $88 ($100)Kindle ebook (Digital) -- $24The Art of The Cuphead Show (Hardcover) -- $35 ($50)The Art of Cuphead (Hardcover) -- $30.49 ($50)Just like the original Cuphead art book, this is a stunning companion that beautifully captures the intricate process of animating a game designed to look like a 1930s-era cartoon.This article was originally published last month as an exclusive preview of the first few pages from The Art of Cuphead: The Delicious Last Course. Since then, I've looked flipped through the full book in digital format. My takeaway? Cuphead fans are in for a treat. You can check out a handful of pages from the book below to get an idea of what to expect. See all Cuphead books at Amazon The Art of Cuphead: The Delicious Last Course Standard EditionThe Art of Cuphead: The Delicious Last Course is a 272-page oversized hardcover focused exclusively on Cuphead's brilliant 2022 DLC (Delicious Last Course). The book takes fans on a frame-by-frame journey through the expansion's seven bosses and The King's Leap challenge arena. Delicious Last Course also introduced Ms. Chalice as a playable character and numerous new NPCs who will likely be featured in this art book.If you've played Cuphead, you know the level of detail on display in each of the game's inventive boss battles. The DLC actually has as many frames of animation as the base game, despite it only comprising about 25% of the full Cuphead experience. The Art of Cuphead, which focuses on the base game, is a fascinating, must-have book for fans, so we'd expect The Art of Cuphead: The Delicious Last Course to provide a similarly insightful look inside Studio MDHR's creative process.Along with frame-by-frame animation of the bosses from The Delicious Last Course, the book contains early concept art as well as unused ideas. See at Amazon If you haven't checked out the art book for the base game, you can save about $20 off its list price at Amazon. The Art of Cuphead: The Delicious Last Course Deluxe EditionBig Cuphead fans will want to check out The Art of Cuphead: The Delicious Last Course Deluxe Edition, a limited release featuring a mint-green foil-stamped slipcase, a fold-out portfolio case with a trio of acetate cells, and a ribbon bookmark.It matches the Deluxe Edition for the base game's art book. Fair warning: The Art of Cuphead Deluxe Edition has only been available to purchase from third-party sellers for years at this point--unlike some video game art books, it truly was \"limited edition.\" If you're interested in the fancy version, you probably don't want to wait too long to place your order.Normally $100, the Deluxe Edition is on sale for $89 at Amazon. See at Amazon Both physical editions have 272 pages, so the preview pages shown below will match your copy of the book when it arrives. Page 12\"We knew from the beginning that Ms. Chalice had to stand alongside Cuphead and Mugman as an iconic part of a trio. This meant meticulous iteration on her character expressions, including the existence of an 'evil form--Ms. Malice!\" Page 13\"Unlike Cuphead and Mugman, Ms. Chalice only takes corporeal form within a level. These character intro concepts from Animation Supervisor Hanna Abi-Hanna illustrate the challenge of capturing Chalice's emergence from the Astral Plane.\" Page 16\"Through Ms. Chalice's animations, we wanted to capture the wide-eyed ingenue that was prototypical of the 1930s cartoon female lead. At the same time, we wanted her movements to imbue her with the sense of grit determination, and impishness common in other characters from the era.\" Page 17This page shows frame-by-frame animation cells of Ms. Chalice crouching. Page 18\"As with Cuphead and Mugman, Ms. Chalice needed her very own 'death ghost'--the sprite which players see after your character has lost their last hit point...\" Page 19\"Pictured above, the unique frames of Ms. Chalice's death ghost as it floats tearfully off screen, illustrated by Animation Supervisor Hanna Abi-Hanna.\" The Art of the Cuphead ShowThe Art of Cuphead: The Delicious Last Course is the second new art book on the franchise this year. In September, Dark Horse published The Art of the Cuphead Show, a 256-page hardcover book examining the creation of Netflix's great animated series that ran for three seasons in 2022. We previewed The Art of the Cuphead Show before its publication, so you can check out a few pages from that book.Amazon is selling the hardcover edition of The Art of the Cuphead Show for $35 (was $50). See at Amazon",
    "author": "",
    "published": "Fri, 08 Nov 2024 14:58:00 -0800",
    "image": "https://www.gamespot.com/a/uploads/screen_medium/1595/15950357/4388694-artofcupheaddlc.jpg",
    "source": "https://www.gamespot.com/feeds/mashup/",
    "categories": [
      ""
    ]
  },
  {
    "id": "a5a7c848-45e9-44aa-8912-5a2c970699be",
    "title": "Best Buy's Early Black Friday 3-Day Sale: The Deals You Shouldn't Miss",
    "link": "https://www.ign.com/articles/best-buy-early-black-friday-sale-2024-deals-available-for-three-days-only",
    "description": "Limited-run deals on LEGOs, gaming peripherals, PCs and laptops, and headphones worth shopping now at Best Buy.",
    "author": "Eric Song",
    "published": "Fri, 8 Nov 2024 23:50:00 +0000",
    "image": "https://assets-prd.ignimgs.com/2024/11/08/bestbuybf-1731107546248.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "941b125b-ad73-4326-b11b-346347d7b95a",
    "title": "Don't Miss Out on the Best Audible Deal for Black Friday",
    "link": "https://www.ign.com/articles/audible-early-amazon-black-friday-deal-2024",
    "description": "Listen to your favorite audiobooks for pennies.",
    "author": "Eric Song",
    "published": "Fri, 8 Nov 2024 23:20:00 +0000",
    "image": "https://assets-prd.ignimgs.com/2024/10/15/audible2-1729007894910.jpg",
    "source": "http://feeds.ign.com/ign/all",
    "categories": null
  },
  {
    "id": "d5318f4b-a7f6-40d7-8b35-177120d8e3d9",
    "title": "The 10th Anniversary Return Of Interstellar Is Another IMAX Debacle",
    "link": "https://kotaku.com/interstellar-10th-anniversary-imax-return-tickets-1851694027",
    "description": "Interstellar is returning to IMAX for the sci-fi film’s 10th anniversary on December 6. Normally, this would be a time for fans of the impressive space epic and its director, Christopher Nolan, to celebrate. Finally, a chance to once again see all 64 minutes of those glorious 70mm shots of blackholes and planetary…Read more...",
    "author": "Ethan Gach",
    "published": "Fri, 08 Nov 2024 22:15:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/022f1682061f9224503841d5a1b7ac33.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "imax",
      "cinemark",
      "3d imaging",
      "the amc",
      "christopher nolan",
      "cinemark theatres",
      "theatres",
      "entertainment culture",
      "autonation",
      "movie theater",
      "sonic",
      "amc theatres"
    ]
  },
  {
    "id": "644d5d62-6388-428f-94be-cbc0d0687519",
    "title": "Kotaku’s Weekend Guide: Six Games For Election Week Escapism",
    "link": "https://kotaku.com/kotaku-games-play-pokemon-metal-slug-call-of-duty-halo-1851693780",
    "description": "What a week, huh? Yeah. Well, here we are, at the end of it, at the very least, and now looking toward the future. So how about some video games to take our minds off things for the weekend? This week we’ve got some fun shooters, some beat ‘em up action, and a digital spin on a classic trading card game.Read more...",
    "author": "Claire Jackson, Ethan Gach, Zack Zwiezen, and John Walker",
    "published": "Fri, 08 Nov 2024 22:00:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/b377ff533e0c9eab0097e1220affa9f5.jpg",
    "source": "https://kotaku.com/rss",
    "categories": [
      "benjamin",
      "cooperative video games",
      "windows games",
      "walker",
      "microsoft games",
      "halo",
      "ethan gach",
      "multiplayer online games",
      "ps5",
      "first person shooters",
      "in video games",
      "rpg",
      "claire jackson"
    ]
  },
  {
    "id": "7e40760e-b6e4-4bb4-b191-50712991b220",
    "title": "Share of the Week: Horizon Zero Dawn Remastered",
    "link": "https://blog.playstation.com/2024/11/08/share-of-the-week-horizon-zero-dawn-remastered/",
    "description": "Last week, we asked you grab your bows and set off on Aloy’s original journey in Horizon Zero Dawn Remastered, sharing epic moments using #PSshare #PSBlog. Here are this week’s highlights: sorathluna shares Aloy sitting in a field of blue flowers. sirevanztheduke shares Aloy and Varl gazing out at the land before them. ForgottenJasmin shares […]",
    "author": "",
    "published": "Fri, 08 Nov 2024 18:00:00 +0000",
    "image": "https://live.staticflickr.com/65535/54123617503_b6e79061a8_o.png",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "PS5",
      "horizon zero dawn remastered",
      "share of the week"
    ]
  },
  {
    "id": "98f62e9c-dd08-4811-b891-d42f1780961e",
    "title": "PlayStation Store: October 2024’s top downloads",
    "link": "https://blog.playstation.com/2024/11/08/playstation-store-october-2024s-top-downloads/",
    "description": "It’s time to see which PS5, PS4, PS VR2, PS VR, and free-to-play games topped the download charts last month. October saw fists and bullets flying with Dragon Ball: Sparking Zero, Undisputed, and Call of Duty: Black Ops 6 entering the top five of PS5 list in the US. Arizona Sunshine Remake claimed the top […]",
    "author": "Justin Corrie",
    "published": "Fri, 08 Nov 2024 16:00:20 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/psblog",
    "categories": [
      "PS4",
      "PS5",
      "playstation store",
      "top downloads"
    ]
  },
  {
    "id": "1120d5e5-e222-4267-9349-f5005526bee4",
    "title": "Look Back, My Old Ass, Netflix’s Meet Me Next Christmas, and every movie new to streaming this week",
    "link": "https://www.polygon.com/entertainment/472236/new-movies-watch-streaming-look-back-meet-me-next-christmas-netflix",
    "description": "Each week on Polygon, we round up the most notable new releases to streaming and VOD, highlighting the biggest and best new movies for you to watch at home. This week, Look Back, the critically acclaimed anime film based on Tatsuki Fujimoto’s manga of the same name, is finally available to stream on Prime Video. […]",
    "author": "Toussaint Egan",
    "published": "2024-11-08T18:15:00-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Entertainment",
      "Movies",
      "Polygon Lists",
      "Polygon Picks",
      "What to Watch"
    ]
  },
  {
    "id": "ce302f6e-b615-451b-81e5-4de94e8e1fd7",
    "title": "Vampire Survivors’ Ode to Castlevania is more than just a tribute",
    "link": "https://www.polygon.com/impressions/476337/vampire-survivors-castlevania-dlc",
    "description": "Action-survival roguelike Vampire Survivors is already one of the best deals in gaming. For five bucks, you get an endlessly replayable time sink that’s stuffed with unlockable characters, dozens of weapons to experiment with, and clever secrets to discover. The game’s most recent add-on, Ode to Castlevania, somehow manages to make the original offering feel […]",
    "author": "Michael McWhertor",
    "published": "2024-11-08T17:51:51-05:00",
    "image": "",
    "source": "https://www.polygon.com/rss/index.xml",
    "categories": [
      "Gaming",
      "Impressions",
      "Mobile",
      "Nintendo",
      "PC",
      "PlayStation",
      "Xbox"
    ]
  },
  {
    "id": "be69aaec-8cd3-407b-a75f-cdd05dbe2391",
    "title": "Choose between cyberpunk and magic in Zephon, the new 4X from the Warhammer 40,000 – Gladius devs",
    "link": "https://www.rockpapershotgun.com/choose-between-cyberpunk-and-magic-in-zephon-the-new-4x-from-the-warhammer-40000-gladius-devs",
    "description": "Warhammer 40,000: Gladius - Relics Of War developers Proxy Studios have just released Zephon, a new 4X strategy game set in a manky, post-apocalyptic world. It's got hexagonal maps, flesh trees, gangly Evangelion-grade giants, \"otherworldly hymns of decay\", nuclear bombs, and a player-led \"blend of magic and cyberpunk\" that extends from the city architecture to the research component. All of which is my cup of giblets. Here's the launch trailer. Read more",
    "author": "Edwin Evans-Thirlwell",
    "published": "Fri, 08 Nov 2024 19:32:38 +0000",
    "image": "https://assetsio.gnwcdn.com/1_158iYaf.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "Horror",
      "PC",
      "Fantasy",
      "Zephon",
      "Strategy: Grand Strategy/4X",
      "Science Fiction"
    ]
  },
  {
    "id": "6d79253a-1031-4911-9989-2e477a6ebd1a",
    "title": "The Warframe devs want you to come try their luxurious fantasy action-RPG Soulframe",
    "link": "https://www.rockpapershotgun.com/the-warframe-devs-want-you-to-come-try-their-luxurious-fantasy-action-rpg-soulframe",
    "description": "Warframe developers Digital Extremes have announced a new round of early access for their 2025-bound fantasy action-RPG Soulframe, which I saw a bit of last year and think is pretty promising. They're now adding 2000 players to a Preludes build of the game every week, with each invite email including an additional four invite codes, so you can get your friends involved. Read more",
    "author": "Edwin Evans-Thirlwell",
    "published": "Fri, 08 Nov 2024 18:09:24 +0000",
    "image": "https://assetsio.gnwcdn.com/1_YkVXN5T.png?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "http://feeds.feedburner.com/RockPaperShotgun",
    "categories": [
      "MMORPG",
      "Third person",
      "PC",
      "RPG",
      "Soulframe",
      "Digital Extremes"
    ]
  },
  {
    "id": "af76cdb7-33b0-44c2-b3b6-a143c1af7264",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/232412/",
    "description": "",
    "author": "Valve",
    "published": "Mon, 04 Nov 2024 17:10:00 -0800",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "f4a158a5-6ec6-464d-a214-a1a7d7a526ac",
    "title": "Team Fortress 2 Update Released",
    "link": "https://store.steampowered.com/news/231671/",
    "description": "",
    "author": "Valve",
    "published": "Fri, 25 Oct 2024 13:22:00 -0700",
    "image": "",
    "source": "https://store.steampowered.com/feeds/news.xml",
    "categories": [
      "Valve news update",
      "Valve news update"
    ]
  },
  {
    "id": "0a70647a-5957-4d07-ae86-63fa70cd9cf8",
    "title": "Stymied at Admiral Ripsnarl",
    "link": "https://tagn.wordpress.com/2024/11/08/stymied-at-admiral-ripsnarl/",
    "description": "We got ourselves together and ready to go on Sunday afternoon, but the question was what should we do.  I will say, straight up, that Cataclysm is wearing on me a bit.  I mean, maybe I have broadcast that some already, but let me confirm it here. The expansion doesn’t have a hold on me […]",
    "author": "Wilhelm Arcturus",
    "published": "Fri, 08 Nov 2024 15:15:24 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "Instance Group",
      "World of Warcraft",
      "WoW Classic",
      "Deadmines",
      "Heroic Instance"
    ]
  },
  {
    "id": "8b305b4a-c38c-40d7-8db4-72da3dd08f1a",
    "title": "Four Weeks into the Great Tenerifis Migration – We Live in Tenerifis Now",
    "link": "https://tagn.wordpress.com/2024/11/07/four-weeks-into-the-great-tenerifis-migration-we-live-in-tenerifis/",
    "description": "At least some of us live in Tenerifis now.  Getting an alliance of 48K characters run by more than 8K individuals, many of whom apply very different levels of effort to the game, means that there will be people moving for quite a while. But the center of gravity of the Imperium, which is always […]",
    "author": "Wilhelm Arcturus",
    "published": "Thu, 07 Nov 2024 08:15:30 +0000",
    "image": "https://2.gravatar.com/avatar/26266f9ffc00f111bd9254692a590193ebfab64d766b15a666dfae33fef5d871?s=96\u0026d=wavatar\u0026r=PG",
    "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
    "categories": [
      "entertainment",
      "EVE Online",
      "Null Sec",
      "B-R5RB",
      "Delve",
      "Goonstantinople",
      "Imperium",
      "Irmalin",
      "Tenerifis",
      "UALX-3"
    ]
  },
  {
    "id": "e9c85bc8-a044-43a7-81f4-3d5c602baa5d",
    "title": "Makeup and Beauty Blog Monday Poll, Vol. 855",
    "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-855/",
    "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Last show you binged watched? “The Diplomat” season 2 on Netflix with Keri Russell. It’s a little silly but I like how they weave real things that happen in the world into it. 2. Have you started planning for Thanksgiving yet? Girl, no. LOL! I barely made it through the Halloween season, which honestly felt like it was three years long. I know in a few years, when Connor’s older, I’ll miss all the activities. Anyway, for Thanksgiving, we’re invited to a dinner that a friend is hosting, so we’ll probably do that. Or, we’ll just stay at home in our jammies, watch movies and have a crab fest again. So fun! 3. Pick your fall nail color – red, burgundy or dark blue? Ooh, burgundy please![Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 855 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 04 Nov 2024 16:59:01 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2022/10/fall-leaves-have-a-joyful-day-610x827.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun"
    ]
  },
  {
    "id": "fc65c585-9731-40fa-b515-e37fb93d96fd",
    "title": "Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 836",
    "link": "https://makeupandbeautyblog.com/just-for-fun/sundays-with-tabs-the-cat-makeup-and-beauty-blog-mascot-vol-836/",
    "description": "Last year Harris, that dastardly lothario, won the annual Novato pumpkin growing contest, which came as a huge shock to Rosie because she thinks he’s mentally inferior. While that may be true, Harris has figured out how to grow big pumpkins. This year, Rosie isn’t holding back. She’s put a lot of time and scientific work into maximizing her pumpkin yields. She also read a bunch of books on botany and interviewed all the top minds in the field. Hopefully she can reclaim the crown that Tabs once had. 😸 Your friendly neighborhood beauty addict, Karen The post Sundays With Tabs the Cat, Makeup and Beauty Blog Mascot, Vol. 836 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
    "author": "Karen",
    "published": "Mon, 04 Nov 2024 02:27:36 +0000",
    "image": "https://makeupandbeautyblog.com/wp-content/uploads/2024/11/rosie-giant-pumpkin-patch-610x610.jpg",
    "source": "https://www.makeupandbeautyblog.com/feed/",
    "categories": [
      "Just For Fun",
      "Marnie",
      "Rosie",
      "Tabs"
    ]
  },
  {
    "id": "ad2f19aa-4874-4e78-9f97-b42bfe090b2d",
    "title": "Awesome Games Done Quick reveals full charity speedrun schedule ahead of January's return",
    "link": "https://www.eurogamer.net/awesome-games-done-quick-reveals-full-charity-speedrun-schedule-ahead-of-januarys-return",
    "description": "If it's charity speed runs you want, then it's charity speed runs you'll get; Awesome Games Done Quick organisers have announced the annual seven-day event will return in January 2025, and its full speedrun schedule is available to peruse now. Read more",
    "author": "Matt Wales",
    "published": "Fri, 08 Nov 2024 23:15:20 +0000",
    "image": "https://assetsio.gnwcdn.com/aqgq-2020-crop.jpg?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": null
  },
  {
    "id": "c1e75c17-1d8d-4c7f-9cc8-d68e85b97bf0",
    "title": "Nintendo keen to continue Switch's hybrid handheld and home console focus to keep down development costs",
    "link": "https://www.eurogamer.net/nintendo-keen-to-continue-switchs-hybrid-handheld-and-home-console-focus-to-keep-down-development-costs",
    "description": "Nintendo is keen to keep the Switch's dual focus of being both a gaming handheld and home console \"to carry over the experience we have already built\" and reduce development costs in future, it's said. Read more",
    "author": "Tom Phillips",
    "published": "Fri, 08 Nov 2024 17:47:53 +0000",
    "image": "https://assetsio.gnwcdn.com/Screenshot-2024-11-08-174620.png?width=1920\u0026height=1920\u0026fit=bounds\u0026quality=80\u0026format=jpg\u0026auto=webp",
    "source": "https://www.eurogamer.net/?format=rss",
    "categories": [
      "Switch 2",
      "Nintendo Switch"
    ]
  },
  {
    "id": "f64f0f6e-6f1d-4dff-860f-13d2b301c5a5",
    "title": "Destiny 2: How Vesper’s Host Became the Most Challenging Dungeon Yet",
    "link": "https://news.xbox.com/en-us/2024/11/08/destiny-2-vespers-host-dungeon-xbox/",
    "description": "The post Destiny 2: How Vesper’s Host Became the Most Challenging Dungeon Yet appeared first on Xbox Wire.",
    "author": "Danielle Partis",
    "published": "Fri, 08 Nov 2024 18:00:00 +0000",
    "image": "https://secure.gravatar.com/avatar/9a300445b44f55cefdeaa3f43365cdb1?s=144\u0026d=mm\u0026r=g",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games"
    ]
  },
  {
    "id": "2e021758-04a9-4a5e-a595-230db2e18ee2",
    "title": "No Man’s Sky Now Supports Cross-Save Across Multiple Platforms",
    "link": "https://news.xbox.com/en-us/2024/11/08/no-mans-sky-now-supports-cross-save-across-multiple-platforms/",
    "description": "The post No Man’s Sky Now Supports Cross-Save Across Multiple Platforms appeared first on Xbox Wire.",
    "author": "Mike Nelson, Xbox Wire Editor",
    "published": "Fri, 08 Nov 2024 18:00:00 +0000",
    "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/No-Mans-Sky-Normandy-Screen-1-3874dcfd4fd7726a8e37.jpg",
    "source": "https://majornelson.com/feed/",
    "categories": [
      "Games",
      "PC Gaming",
      "Xbox Game Pass",
      "Game Pass",
      "Hello Games",
      "Mass Effect",
      "No Man’s Sky",
      "Normandy"
    ]
  },
  {
    "id": "3a5eabdb-e0b5-4c5a-b17f-6d2941efedf9",
    "title": "Rainbow Six Siege",
    "link": "https://toucharcade.com/community/threads/rainbow-six-siege.432867/",
    "description": "",
    "author": "tinkie277",
    "published": "Fri, 08 Nov 2024 14:03:47 +0000",
    "image": "",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  },
  {
    "id": "4d1f6e4c-6769-4b5d-b025-7a00c13282b3",
    "title": "Forgotten Memories: Remastered (by Psychose Interactive)",
    "link": "https://toucharcade.com/community/threads/forgotten-memories-remastered-by-psychose-interactive.432926/",
    "description": "",
    "author": "Anotherkellydown",
    "published": "Fri, 08 Nov 2024 08:16:11 +0000",
    "image": "//cdn.toucharcade.com/wp-content/themes/touch-arcade/assets/images/exc_icon.png",
    "source": "https://toucharcade.com/community/forums/-/index.rss",
    "categories": null
  }
]
