[
  {
    "id": "31c22c69-32fd-4029-9f99-6e370bb14ded",
    "title": "The perfect break for mother and son? Stone-carving and wood-turning in Sussex",
    "link": "https://www.theguardian.com/travel/2025/jun/24/perfect-activity-break-mother-and-son-stone-carving-wood-turning-workshops-east-sussex",
    "description": "Finding a holiday to suit a teenage boy and his mum is tricky – but getting crafty and learning new skills provide the perfect solution How best to bond with a teenage boy? When my son, Hugo, finished his A-levels, I knew I wanted to “take a journey” with him, to have some sort of final trip before he left home. Ideally a journey that would leave both of us with a few happy memories.Easier said than done: a midlife woman and a teenage boy are completely different beasts. I wanted to walk. He wanted to be driven. I wanted to get up early. He wanted to sleep in. I wanted unusual food. He wanted pub grub. I wanted to be safely active. He wanted to lie on a sofa or scramble along a vertiginous precipice. I wanted conversation. He didn’t (at least not with me, hour after hour). The problem of where to go seemed insurmountable. Continue reading...",
    "author": "Annabel Abbs",
    "published": "Tue, 24 Jun 2025 06:00:36 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Sussex holidays",
      "England holidays",
      "Learning holidays",
      "Craft",
      "Travel",
      "United Kingdom holidays",
      "Family holidays",
      "Life and style"
    ]
  },
  {
    "id": "57eefacb-8c50-41c0-8bc2-4769239cdf3e",
    "title": "Travels in Moominland: summer in Tove Jansson’s Finland",
    "link": "https://www.theguardian.com/travel/2025/jun/23/summer-in-tove-jansson-finland-moomins",
    "description": "The children’s book author spent the precious long Nordic days in simple, off-grid cabins on small dreamy islands – a tradition many Finns still followIt’s after 10pm and the sky has only just lost the high blue of the day. Sitting by the Baltic Sea, toes in the water, I gaze at distant, tree-covered islands as gentle waves lap over the long, flat rocks. I follow a rough, winding path back to my cabin, through woods so quiet you can hear the pine needles fall.I’m in Santalahti woods, near Kotka on the south-east coast of Finland, on the trail of Finnish author, novelist, painter and illustrator Tove Jansson (1914-2001). Best known as creator of the Moomins, and for her love of island living, Jansson also wrote for adults. Last year, her first novel, The Summer Book, was made into a film starring Glenn Close and directed by Charlie McDowell. One film critic has described it as “an ode to Finnish archipelago nature”. Continue reading...",
    "author": "Ailsa Sheldon",
    "published": "Mon, 23 Jun 2025 06:00:02 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Finland holidays",
      "Europe holidays",
      "Scandinavia holidays",
      "Cultural trips",
      "The Moomins",
      "Travel",
      "Tove Jansson"
    ]
  },
  {
    "id": "1ab6bee3-48e1-41b5-a431-c39a6dc85b97",
    "title": "Sea Water Distilling Plant in Tas-Sliema, Malta",
    "link": "https://www.atlasobscura.com/places/sea-water-distilling-plant",
    "description": "The shoreline of Sliema, Malta is characterized by its modern multi-story apartment buildings and hotels with balconies offering views of either the Mediterranean Sea or the harbor between Sliema and historic Valletta. Interspersed among the contemporary buildings are a few older buildings that predate Malta’s present-day tourism industry, and while Fort Tigné at the eastern tip of Sliema or Knisja Parrokkjali ta’ Ġesù Nazaret (the Church of Jesus of Nazareth) seem too large and too historically significant to demolish, the much smaller Sea Water Distilling Plant– once a source of fresh drinking water for the island – is a more unlikely survivor of urban redevelopment. The old distilling plant is a humble Victorian-era single story limestone building that stands on the seafront road eastwards from the Sliema Ferry terminal on the side of the peninsula facing Valletta.  In the latter half of the nineteenth century, the British administration struggled to provide fresh water to Malta, which prompted the construction of new infrastructure throughout the islands.  The Sea Water Distilling Plant was originally built in 1881 to supply water to Fort Tigné and the surrounding area, and while this boiling-type distillery was the first such building constructed in Malta, it was abandoned just a year later when newer and more efficient water facilities were implemented. The building, however, has survived right up to the present.  Today, the architectural anomaly is cherished by local residents as providing a link to Sliema’s nineteenth century past, and it also occasionally attracts the attention of curious tourists who happen to pass by this part of Sliema's shoreline.",
    "author": "",
    "published": "Tue, 24 Jun 2025 13:47:00 -0400",
    "image": "https://img.atlasobscura.com/Ww9GmaX1mzToKWDTEvJUgc7ouaW828egAafQSIgAVaw/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9hZDg2/ZTFlZS1iYjUwLTRh/MWEtYTgwMS04ZTk1/NGRmZDRlZmQzZGVm/MDJmZWU0YTcwNjU3/OGRfU2VhX1dhdGVy/X0Rpc3RpbGxlcnlf/U2xpZW1hX0lNR18x/NDk4LmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "waterworks",
      "infrastructure"
    ]
  },
  {
    "id": "2468481a-ae5f-43a8-8aca-58c07c7b3f68",
    "title": "AO Mailbag: Which Places Just Aren’t Worth Visiting?",
    "link": "https://www.atlasobscura.com/articles/podcast-mailbag-nightmare-trips-bathroom-stories",
    "description": "Listen and subscribe on Apple Podcasts, Spotify, and all major podcast apps. Amanda McGowan: Okay, okay, I’m recording now. Dylan Thuras: Sweet. Um, it’s hot here. It feels like summer. And what happens when it gets turned to be summer, it gets very hot in this little booth. Amanda: I know. Yeah. Dylan: We hold off on putting in air conditioning until it’s like blazing and we can’t sleep, basically. Amanda: Yeah. Dylan: But it means that when I record this podcast, sometimes by the end of it, I am dripping in sweat. Amanda: Sweating. Dylan: It’s gross. Johanna Mayer: Hi, I’m here now. Are we talking about how hot it is in our makeshift recording studios? Dylan: Yes. Amanda: Yeah. Johanna: I love it though. I love trying to keep cool. Dylan: What? Johanna: I love finding creative ways to keep cool. Dylan: Wait … Johanna: Drinking smoothies. I’m like getting cold packs. Amanda: Putting an ice cube on top of my head, just letting it melt. Dylan: Oh, God. This is, you and I are just not the same here. Ugh. Johanna: Okay. It’s a mailbag day. I have a few questions for us today, but we might have to cut one of them out because it might be … Dylan: Too controversial? Amanda: Too salacious. Dylan: Too salacious? Johanna: It’s not salacious. It’s not controversial. It might be gross. Amanda: Oh. Dylan: I can’t even imagine. Is it a gross related travel question? Johanna: Yeah, it is. It is. Dylan: Fine. We’ll save that for the end. Exciting. There’s a disgusting question coming, everyone. You can wait in anticipation. Johanna: Okay. Do you want to do the show intro, Dylan? Dylan: Okay. All right. Here we go. I’m Dylan Thuras. Johanna: I’m Johanna Mayer. Amanda: And I’m Amanda McGowan. Dylan: And this is Atlas Obscura. Today is a mailbag episode where we answer all of your questions, whether they’re travel questions or life questions or weird gross questions. We are going to try and answer them all. This is an edited transcript of the Atlas Obscura Podcast: a celebration of the world’s strange, incredible, and wondrous places. Find the show on Apple Podcasts, Spotify, and all major podcast apps. Johanna: Okay. First question. Dylan: Yes. Johanna: This one came through the inbox. It is from a listener named Cora. Cora says, “There are a million places in this world that I want to see, but there are also some that fill me with a sense of dread. Climbing Mount Everest? Hell on Earth, no thank you. My question is, what is a trip that you would never go on?” Dylan: So I knew this question was coming. Johanna: Uh-huh. Amanda: Don’t pull back the curtain. Dylan: I’m very excited to answer it. My whole vibe is honestly like, everything’s pretty great. You can find wonder everywhere. But I am excited in this episode to just be a hater. I’m going to channel my most hatery haterade because I have a number of answers to this. Johanna: You have several. Amanda: Ooh, okay. Dylan: I have a number. Yeah. But maybe I think Amanda and Johanna, you should go first. Amanda: Okay. So Cora went for like, I’m not doing something to put my life in danger, which I think is like a really wise tact here. And I’m going to go with something that’s sort of related. Johanna: Okay. Amanda: So I, Egypt is on my bucket list. Cannot wait to go to Egypt someday. I wanted to see all—I love ancient Egyptian history. Can’t wait to see all the stuff. What I don’t want to do is go inside any of the pyramids. Dylan: Why not? This is surprising. Amanda: First of all, high potential for ghost transference. But I hear that you have to like—I don’t know if this is true for the Giza pyramid or other pyramids or whatever—but the passageways are so narrow and they’re so crowded. And you’re in this hot, humid space. There’s so many people around you. I think sometimes you have to kind of get on your hands and knees and crawl through these very narrow spaces. I mean, they were built specifically to deter grave robbers, right? There’s lots of twists and turns. Johanna: I did not know that. Amanda: Kind of scary little passageways. I found this video actually on Reddit. I don’t know if this is reputable, but there’s a video of a guy going inside of a pyramid. And it’s just, it looks like a nightmare. Like he’s kind of like climbing down this shaft and ducking. And if you just imagine two-way traffic going up and down these little passageways? Nightmare fuel. Dylan: What’s so funny is like, this gets me kind of hype. Johanna: Oh my God. This is like—my feet are sweating right now. You know when you get nervous, like your feet start to sweat? The claustrophobia with this. Amanda: And my sweaty feet would be sliding up and down the ladder. Johanna: We are doing a gross episode today. Amanda: As I'm crying and hyperventilating. Get me out of here! Johanna: Okay, I have two. And neither of them will I ever be in a position to actually go on either of these trips. The first one is deep sea exploration, visiting the Titanic. No interest in doing that ever. Dylan: I mean, after the implosion, really, doesn’t … It lost a certain je ne sais quoi. Johanna: It lost a certain gleam. Amanda: For some reason, it just lost a certain gleam. Can’t put my finger on what it is. Johanna: And then the other one is, I read this article in The New Yorker about this a while back. Have you guys heard of these like ultra luxury trips where they dump you out in the middle of nowhere and you have to just find your way back? And they give you like an SOS tracker, but they take your phone and everything else. And they’re expensive. They cost like $15K each. But the thing about it that I think that I would not like is not necessarily the adventure aspect. The thing that I think I would not like about that is that I feel like half the fun of any trip that you’re going on is getting excited for it and anticipating where you’re going. And just being dropped somewhere without any of that is really unappealing to me. To have no sense of where you are and not be able to look forward to it at all. So yeah, count me out of the luxury $15K survival trips. Dylan: Both of those things, the deep sea submersible and the survival, they feel like midlife crisis trips. Johanna: Absolutely. Or like bored rich people for sure. Dylan, what are your many, many trips that you would not like— Dylan: I actually think Everest is like a perfect example because it’s not just about the danger. It’s like you see these pictures and people are just, you’re stuck in a line, but you could die. Like you’ll die waiting in a line to take a selfie. That is a bummer of an unprecedented scale. Johanna: And we know from previous mailbags that you will not wait in any line. Dylan: I don’t like waiting in lines, and this one is a deadly line. Here are some things I’ve experienced that I wouldn’t encourage. Johanna: Dylan has like a prepared— Amanda: A binder. Johanna: Reading off a notecard. Dylan: I’m so excited to do some hate. Okay, one, this is, it’s not that bad, but it’s just kind of lame. Like going to see the Mona Lisa, like it’s fine, but it’s dumb. You go, and you’re like … Johanna: We’ve talked about the Mona Lisa on this show before. Amanda: We’ve got beef with the Mona Lisa. Dylan: It’s just fine. You’re just like, whatever. And then sort of same with Venice in high season, right? These things that people have in their mind as these epic travel experiences, but in practice are awful. So here’s some things that I don’t want to do. The running of the bulls. No. Bad. Horrible. Just like a drunken, stupid, loud, dangerous—you’re going to break your leg. You’re going to get trampled by people, if not the bull. It’s expensive. You’re going to get pickpocketed. The same is true, of course, about like urban street Mardi Gras, right? Like, yuck. No. Times Square on New Year’s Eve just doesn’t hold much interest for me. Like I just don’t, I think there’s a whole category of stuff that is fun in the abstract and in practice really sucks. Anyway, I could keep going, but I think you get the point. Johanna: Okay, I was going to say, are you done? Dylan: No, I’m going to stop. Johanna: Okay. Next question. We have a voice memo. John: Hello, Dylan and company. This is John in Boulder, Colorado. My question for the Atlas Obscura gang is what was the first ever Atlas Obscura destination? When was that? And how has that destination changed over the years since you first highlighted it? Thanks. Dylan: Whoa. Amanda: This seems like a question for Dylan. Dylan: Can I even answer that? The way we originally built the database—it started when I was living in Hungary. And I was writing this other blog, but then I was also writing like the first couple hundred entries for the site. And Josh was working on it, too. And so in a way we were— Johanna: Josh is your co-founder. Dylan: Yes, Josh is my co-founder. I don’t know what either of us started writing truly first. And sometimes we were adapting other material that we had already worked on. Like, I had written a thing about Galileo’s middle finger. Johanna: We did an episode on that. Dylan: Yes, his mummified middle finger. It’s more that there was like a category of stuff. Like the Gates of Hell in Turkmenistan, which I’ve now been talking about for 20 years of my life. Johanna: Yeah, that’s a classic. Dylan: That’s an example. And that first set of stuff had that kind of quality. And I think Josh and I were also always looking for stuff that had this kind of poetry to it. Like the Gates of Hell, both how it looks and like the story behind it and sort of its strange beauty, but also it’s this industrial ruin. And Galileo’s middle finger was like this, you know, sort of this spurned scientist and this is the last laugh. Like, they had this kind of beauty to them, this poetry to them. But the Cherrapunji root bridges, the living root bridges, that was the first one we got in from a user where someone just wrote in—we’d been running the site for like two months. And that was like the first one where I was like, I had never heard of these living root bridges. There was like almost nothing about them online. And it was just like, what do you mean? Like, how can this be a thing in the world that I have never heard about that nobody travels to see? This is insanity. And that was maybe for me like one of the first moments where I was just like, oh, there is something maybe truly crazy, magical here. And maybe we’re going to discover things about this earth that are going to just completely shock and surprise us. Johanna: That’s a good one. Okay. Dylan: Okay. Johanna: Are you guys ready to do the gross one now? Amanda: Oh, yeah. Always. Dylan: Yeah? Johanna: Hard pivot from Dylan waxing poetic. Dylan: Let’s get into it. This is a show that contains multitudes. We work at all levels, you know? Johanna: Truly the entire breadth of the human experience in these mailbag episodes. Okay. We don’t need to go into details. Amanda: But we could, right? Dylan: Really setting this up, Johanna. I’m getting nervous. The longer you’re setting this up, the more nervous I’m getting. Johanna: Okay. Okay. This is from a listener named Ben: “While traveling, what was the worst bathroom experience you have ever had?” Dylan: Oh. Johanna: Did I build that up too much? Is it not that bad? Dylan: Yeah, it’s not that bad. Amanda: I think I have one. Johanna: Okay. Amanda: So this was not a bad experience in terms of hygiene or anything like that. But probably very close to the beginning of my relationship with Julian and we went on a trip together. And we were staying in this cute little resort or something, like a hotel. And again, early on in our relationship. And we go into the room and the bathroom did not have a full wall. It was like sort of a half wall. And you had to walk through like a little labyrinth to get to the bathroom. So visual privacy but no audible privacy if you catch my drift. Johanna: This is like a rite of passage in new relationships, I feel, like when you’re like the first time sharing a bathroom in close quarters. Amanda: Yeah. And honestly, I think we both just kind of avoided the bathroom the whole time. Like at breakfast, we would just be like, oh, I have to go do something. Like let me just run to the lobby. I have to go check to see if I have any mail. Dylan: It’s funny. When I was much younger, I went on a long trip with an ex-girlfriend. And we—it was like a kind of contentious trip. We kind of fought more than I thought we would. And it turns out that in part, she was just constipated 100 percent of the time and refused to tell me or make a point of solving the problem. But instead was just very grouchy the whole time. Amanda: You’re like, that would have changed everything! Dylan: It just would have. We could have solved it. Johanna: That’s like the forking paths in your life. Dylan: Maybe. Amanda: Sliding doors. Dylan: Maybe. Maybe. Johanna: That’s good. Okay. So mine was—I was like 10 years old visiting my aunt who I think I mentioned before. She’s a nun and she lives in Ecuador. So it was like, family trip to go visit my aunt. And we took a bus from Quito to Cuenca, which is like a mountain town. So it was this 10-hour bus journey through the winding Andes Mountains. Everyone has terrible altitude sickness, is just feeling generally crummy. And then, of course, the stomach issues started happening. This actually happened to my other aunt who was on this family trip visiting. But she went to use the bathroom in the back of the bus, which is like a whole experience in and of itself. But then the door, the lock broke on the door. So it swung open. She’s like hanging on to the side of the—to like the door frame to try to stay steady in this winding bus. And then a man trying to do her a favor, because he accidentally walked in on her, starts slamming the door closed. But it’s slamming on her hand, which is hanging in the door frame. That was a memorable one. Dylan: When you’re traveling through Turkey, a similar thing, like a lot of long bus rides, stomach not feeling well. And then in Turkey, like a lot of the bathrooms, like the roadside bathrooms will be—they’ll be basically a hole in the ground. It’s like a squatty potty. So you squat over and you hold a rope. It’s actually kind of ingenious. Like you hold onto a rope so you can kind of lean back and the rope pulls the door closed. So there’s no lock on the door, but you’re— Amanda: That’s so smart. Dylan: Ingenious. And those bathrooms could be kind of gross, but I appreciated the brilliance of them. And so later, a little bit later in my life, I go camping and there’s no bathroom around. We’re like out. There’s not like a—whatever. And there’s a thing you can do that’s similar when you’re camping. So you go, you dig a hole, and then you take a piece of clothing and you wrap it around a tree and you like hold on to it. You sort of crouch. So I’m doing this. Got my hole. I’m hanging on. And as I’m pooping, the piece of clothing breaks and I go tumbling backwards down a hill mid-poop. And I roll for like 40 feet. I roll for like a very long time. And then I have to just get up and deal with the consequences of my actions. And so it’s not the bathroom’s fault. The tree and the dirt didn’t do anything. But that might be my most memorable bad bathroom experience. Johanna: That was so much worse than I thought it would be. I thought you were going to say like, and then it was a poison ivy patch or something. Dylan: No, no, no, no. It’s way worse. I had built a kind of pooping booby trap for myself. Amanda: Yeah, I’m picturing this like a Looney Tunes style cartoon of Dylan like tumbling down. Dylan: Yes, head over heels backwards, pants around my ankles. Fully. So just that’s—I’d like to leave everyone with that image for the rest of the day. Johanna: That’s all I got. That’s it. Dylan: That was fun. Those were good questions. That was fun. That was fun. I liked channeling my hater energy. Nice. For this next mailbag, I want to get your questions about something more specific. I want to ask about solo travel. I know a bunch of you out there are solo travelers. Maybe it’s a short two-day solo trip. Maybe it’s like months and months. I want to hear your questions about solo travel. And we will try to answer them. Give us a call at 315-992-7902 and leave us a message. You can also record a voice memo and email it to us at hello@atlasobscura.com. Or just email us your question. We want to hear from you all about your questions on solo travel. All right. See you next time. Listen and subscribe on Apple Podcasts, Spotify, and all major podcast apps. This episode was produced by Johanna Mayer. Our podcast is a co-production of Atlas Obscura and Stitcher Studios. The people who make our show include Doug Baldinger, Chris Naka, Kameel Stanley, Johanna Mayer, Manolo Morales, Amanda McGowan, Alexa Lim, Casey Holford, and Luz Fleming. Our theme music is by Sam Tindall. I’m Dylan Thuras, wishing you all the wonder in the world. I’ll see you next time. I’m Dylan Thuras, wishing you all the wonder in the world.",
    "author": "The Podcast Team",
    "published": "Tue, 24 Jun 2025 08:37:00 -0400",
    "image": "https://assets.atlasobscura.com/article_images/105709/image.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": null
  },
  {
    "id": "06a4e07d-feca-48a1-a544-ad8b335905ac",
    "title": "Island-Hopping on a D.I.Y. Caribbean Cruise",
    "link": "https://www.nytimes.com/2025/06/23/travel/caribbean-ferries.html",
    "description": "Ferries departing the dual-nation island of St. Maarten and St. Martin offer easy sailing to surrounding destinations at bargain prices.",
    "author": "Elaine Glusac and Hiroko Masuike",
    "published": "Mon, 23 Jun 2025 09:00:22 +0000",
    "image": "https://static01.nyt.com/images/2025/06/23/multimedia/00Trav-Frugal-DIY-cruise-01-phbz/00Trav-Frugal-DIY-cruise-01-phbz-mediumSquareAt3X-v2.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Cruises",
      "Ferries",
      "Islands",
      "Travel and Vacations",
      "Caribbean Area",
      "St Maarten (Caribbean)",
      "St Martin (Caribbean)",
      "Saba (Netherlands Antilles)",
      "St Barthelemy (French West Indies)",
      "Anguilla"
    ]
  },
  {
    "id": "289acf61-8416-4463-9922-c1ef6d73e9cc",
    "title": "What to Know About U.S. Warning to Citizens Abroad Amid Israel-Iran Conflict",
    "link": "https://www.nytimes.com/2025/06/23/travel/travel-advisory-us-citizens-iran-israel.html",
    "description": "The State Department warned of the potential for demonstrations against Americans overseas because of U.S. intervention in the Israel-Iran conflict. What you need to know.",
    "author": "Ceylan Yeğinsu",
    "published": "Mon, 23 Jun 2025 16:46:53 +0000",
    "image": "https://static01.nyt.com/images/2025/06/23/multimedia/23trav-advisory-explainer3-jhlp/23trav-advisory-explainer3-jhlp-mediumSquareAt3X-v2.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel Warnings",
      "Americans Abroad",
      "Iran-Israel War (2025- )",
      "Demonstrations, Protests and Riots",
      "Terrorism",
      "Airlines and Airplanes",
      "Content Type: Service",
      "Travel and Vacations"
    ]
  },
  {
    "id": "6616e128-1682-409c-bd84-ac6fe364be64",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "c56bbc7e-3af6-4221-99e1-c90f469d2039",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "c66de6cd-fc6b-4964-8486-acbc55aad245",
    "title": "Home and Travel: Why You Can’t Appreciate One Without the Other",
    "link": "https://www.nomadicmatt.com/travel-blogs/home-and-travel/",
    "description": "I used to think “home” was a dirty word. Out there — on the road — was where life happened, full of exciting adventures, fascinating people, and endless possibilities. No dreary commutes, 30-minute lunch breaks, mind-numbing meetings, or endless lists of to-dos squeezed into a rushed weekend. Why would anyone want to be home, the... The post Home and Travel: Why You Can’t Appreciate One Without the Other appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 17 Jun 2025 12:07:58 +0000",
    "image": "https://media.nomadicmatt.com/madagascar9a.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings",
      "backpacking",
      "home",
      "Life on the Road",
      "long term travel",
      "travel"
    ]
  },
  {
    "id": "33a6a954-8e17-41bd-a72a-5044f55f88b3",
    "title": "American Express® Business Gold Card Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/american-express-business-gold-card-review/",
    "description": "Terms apply to American Express benefits and offers. Enrollment may be required for select American Express benefits and offers. Visit americanexpress.com to learn more. Eligibility and Benefit level varies by Card. Terms, Conditions, and Limitations Apply. Please visit americanexpress.com/benefitsguide for more details. Underwritten by Amex Assurance Company. When you run a business, every dollar counts.... The post American Express® Business Gold Card Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 11 Jun 2025 15:04:44 +0000",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2025/06/amexgoldbiz.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Points \u0026 Miles",
      "amex",
      "credit cards",
      "points and miles"
    ]
  }
]
