[
  {
    "id": "4d90931e-4c61-4ed4-b3bf-6b10f5164926",
    "title": "An e-biking tour of England’s newest forest",
    "link": "https://www.theguardian.com/travel/2024/oct/16/ebike-national-forest-derbyshire-midlands-cycling",
    "description": "Over nine million trees have been planted in the east Midlands’ National Forest, where mines once churned up the land, offering great cycling routes that explore villages and industrial heritageYou couldn’t make it up. As early autumn darkness deepened around Whistlewood Common – tealights a-flicker, guitars twanging around the campfire – I found myself sitting between Peter Wood and Gill Forrester. It was a pincer movement of nominative determinism: Wood, a woodworker and teacher of heritage crafts; Forrester, community and wellbeing manager at the National Forest. Both – along with members of the Whistlewood community – were singing the praises of planting trees.The National Forest is the Midlands’ great rewilding. In 1991 this ambitious environmental project launched to green-up an area of 200 square miles and connect the remnants of two ancient forests: Needwood in Staffordshire and Charnwood in Leicestershire. Back then, scarred by years of coal mining and clay extraction, this was one of the least-wooded parts of Britain – only 6% forest-covered. But in summer 2024, having planted 9.5m trees, the National Forest hit 25%. Continue reading...",
    "author": "Sarah Baxter",
    "published": "Wed, 16 Oct 2024 06:00:13 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "England holidays",
      "Cycling holidays",
      "Day trips",
      "Derbyshire holidays",
      "Staffordshire holidays",
      "Leicester holidays",
      "Travel",
      "United Kingdom holidays",
      "Wildlife holidays",
      "Family holidays",
      "Short breaks"
    ]
  },
  {
    "id": "cde24752-b31b-4a4a-a12f-490ab5c547f6",
    "title": "A foodie tour of Somerset and Wiltshire by train and on foot",
    "link": "https://www.theguardian.com/travel/2024/oct/15/somerset-wiltshire-food-tour-car-free",
    "description": "By travelling car-free we became fully immersed in the area’s quieter attractions, with cosy stays and great food throughoutPulling a wheelie case along the stone streets of Bath, I feel I may as well be wearing a sign reading “tourist on a mini-break”. But when we check in to the Roseate Villa – a 15-minute trundle from the station – and the man who greets us asks for our car registration, I get a virtuous glow from saying we’ve come by train (causing less than a third of the carbon emissions as well as less congestion in the Georgian city, though I don’t point that out).This is our first stop on a wholly car-free foodie tour arranged through Sawday’s and sustainable travel platform Byway. After Bath, we’ll head further south in Somerset to Frome, then take in Bradford-on-Avon and Lacock in Wiltshire, with train times and tickets all sorted for us. Continue reading...",
    "author": "Liz Boulter",
    "published": "Tue, 15 Oct 2024 06:00:07 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Somerset holidays",
      "Short breaks",
      "United Kingdom holidays",
      "Wiltshire holidays",
      "Food and drink",
      "Hotels",
      "Public transport trips",
      "Bath holidays",
      "England holidays",
      "Weekend breaks",
      "Travel"
    ]
  },
  {
    "id": "f671a7d1-5ea3-40aa-b389-6e82c03f9284",
    "title": "Chase Freedom Unlimited® Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/chase-freedom-unlimited-review/",
    "description": "Advertiser Disclosure If you want to travel cheaper, better, and longer, one of the best tools in your arsenal is a solid rewards credit card. Still, despite how often I talk about the topic, many travelers (or would-be travelers) are reluctant to get one. They think it’s a scam, don’t want to pay an annual... The post Chase Freedom Unlimited® Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 16 Oct 2024 13:32:16 +0000",
    "image": "https://media.nomadicmatt.com/2024/freedomunlimitedreview.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Points \u0026 Miles",
      "credit cards",
      "points and miles"
    ]
  },
  {
    "id": "16d57957-62b1-4758-8785-9bbd8c262d1b",
    "title": "Capital One Venture X Rewards Credit Card Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/capital-one-venture-x-review/",
    "description": "Advertiser Disclosure If you’re like me, you’re always on the lookout for ways to make your adventures more affordable and enjoyable. That’s why I collect points and miles. They help me travel longer, better, and cheaper. Today I want to talk about a card that’s been growing in popularity over the past few years: the... The post Capital One Venture X Rewards Credit Card Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 16 Oct 2024 13:31:33 +0000",
    "image": "https://media.nomadicmatt.com/2024/capitalonebank.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Points \u0026 Miles",
      "credit cards",
      "points and miles",
      "Tech"
    ]
  },
  {
    "id": "3ef869d7-362e-4481-9b2b-ce4283eddc79",
    "title": "Chef Boyardee Statue in Omaha, Nebraska",
    "link": "https://www.atlasobscura.com/places/chef-boyardee-statue",
    "description": "Outside an otherwise nondescript office building for ConAgra Brands stands a life-size bronze statue of Ettore Boiardi, who Anglicized his name as Chef Hector Boyardee when he began selling his packaged spaghetti sauce and dinners.  He sold Chef Boyardee Foods to American Home Products in 1946, and AHP's successor International Home Foods was bought in 2000 by food giant ConAgra, which started in Nebraska and whose headquarters were in Omaha at the time.   This statue, by Omaha sculptor John Lajba, was erected in 2011 and was originally sited elsewhere in downtown Omaha. In 2017 it was moved to its current location outside the entrance to ConAgra's Charles M. \"Mike\" Harper Product Development Center. The statue has a seemingly identical twin, unveiled in 2013 outside the ConAgra plant in Milton, Pennsylvania, which has been producing Chef Boyardee products since 1938.",
    "author": "",
    "published": "Wed, 16 Oct 2024 17:00:00 -0400",
    "image": "https://img.atlasobscura.com/Mw1zLvkzwUk7s3zUwIX3_w9RcXBQv5NlD5QfXD1z9_g/rs:fill:300:200:1/g:ce/c:3281:2187:nowe:0:188/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9lNTdh/NDUwNy01NmRiLTQx/YzgtOWU0Mi02M2Zj/MmFlMzIxNzJjMDQz/NDBjYWQ5ZmJmYzlk/YThfYm95YXJkZWUy/LmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "processed food",
      "statues",
      "chefs"
    ]
  },
  {
    "id": "475f5ac6-59b2-4cd7-a530-199f84cd6973",
    "title": "Grave of Princess Centipede in Morioka, Japan",
    "link": "https://www.atlasobscura.com/places/grave-of-princess-centipede",
    "description": "Legend has it that, in the ninth century, samurai warrior Fujiwara no Hidesato slayed a giant centipede with his bow and arrow on the Seta no Karahashi Bridge. Many centuries later, his descendant O-take brought Hidesato's monster-slaying arrowhead to her husband, daimyo lord Nanbu Toshinao, as a dowry, unaware of what it might bring about. The curse manifested as soon as O-take died. First, a centipede-shaped bruise suddenly emerged on her body. Toshinao ordered her grave to be enclosed within a moat, as it was believed that centipedes are afraid of water, but every time he built a bridge over it a huge centipede appeared out of nowhere and destroyed it. Soon, a swarm of centipedes of all sizes started crawling out of the grave and O-take's hair turned into one-eyed snakes. Due to these supernatural incidents, Lady O-take eventually came to be known as Princess Centipede. Today, the Grave of Princess Centipede retains its eerie presence between the cemetery of Kōdai-ji Temple and modern parking lots. Since the legend does not state how the situation was solved, you may want to beware the reemergence of the monstrous centipedes when visiting.",
    "author": "",
    "published": "Wed, 16 Oct 2024 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/G-wcFweVzavvcLiqQ-Bo72QUOIJ0hInVr25DkbyVb-s/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8yMjcy/YWJiZS02NzY3LTRm/M2QtODZkOC1jMzQx/MTQyYWY3OWU3NGY3/ZWVjYWE3YTgwZDYz/YWNfRFNDXzAwMTgu/anBlZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "samurai",
      "legends",
      "cursed places",
      "spiders",
      "insects",
      "royalty",
      "graves"
    ]
  },
  {
    "id": "40f5ce0f-0298-4930-83b1-4aa7334a3027",
    "title": "Juneau, Alaska, Votes Against Limiting Cruise Ship Numbers",
    "link": "https://www.nytimes.com/2024/10/16/travel/juneau-cruise-ships-limits-vote.html",
    "description": "Some residents in the Alaskan capital, frustrated with cruise crowds, sought to limit ship traffic on Saturdays, despite the likely negative impact on local businesses.",
    "author": "Ceylan Yeğinsu",
    "published": "Wed, 16 Oct 2024 13:18:38 +0000",
    "image": "https://static01.nyt.com/images/2024/10/02/travel/JuneauVote/JuneauVote-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Cruises",
      "Decisions and Verdicts"
    ]
  },
  {
    "id": "e44ff11f-faf3-4bb2-9e82-99e7aefbc4d7",
    "title": "Fear of Flying? Here’s How to Make Plane Rides Less Scary.",
    "link": "https://www.nytimes.com/2024/10/16/travel/fear-of-flying-planes-tips.html",
    "description": "Fear of flying affects more than 25 million Americans. If you are among them, these tools and expert tips could help make your next plane ride easier.",
    "author": "Lisa McCarty",
    "published": "Wed, 16 Oct 2024 09:00:37 +0000",
    "image": "https://static01.nyt.com/images/2024/09/20/travel/00travel101-flight-anxiety-illo/00travel101-flight-anxiety-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Content Type: Service",
      "Airlines and Airplanes",
      "Anxiety and Stress",
      "Mobile Applications",
      "Psychology and Psychologists",
      "Travel and Vacations"
    ]
  },
  {
    "id": "69a98213-6f4e-4852-a297-478697c0f25c",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "69b59f0e-9b3e-4209-bfe2-858c245c57a6",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  }
]
