[
  {
    "id": "68f6c412-b99c-4714-8b08-94c3d1a78d4e",
    "title": "Stargazing on the Isle of Rum, Scotland’s first dark sky sanctuary",
    "link": "https://www.theguardian.com/travel/2024/oct/24/stargazing-isle-of-rum-scotland-hebrides-dark-sky-sanctuary",
    "description": "Thanks to the near nonexistent light pollution, the Hebridean island has been officially recognised as one of the best night skies in the worldI step out the door of Guirdil bothy at 2am to the guttural roar of a stag and the sound of the ocean lapping on the beach before me. It’s the height of the rut here on Rum, a Hebridean island where red deer outnumber people, and stags have been bolving all night.The skull of an old, beached minke whale lies on the pebbles, just discernible in the darkness, while the imposing slopes of Bloodstone Hill tower over Guirdil, sheltering the bay from the wind and isolating it from the world. I can make out the silhouette of a stag as it strolls slowly off the beach and trots up the ridge. Wild goats follow. Continue reading...",
    "author": "Stuart Kenny",
    "published": "Thu, 24 Oct 2024 06:00:03 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Scotland holidays",
      "Travel",
      "United Kingdom holidays",
      "Wildlife holidays",
      "Short breaks",
      "Astronomy"
    ]
  },
  {
    "id": "4af45da7-3826-47ae-a1af-633d339220d7",
    "title": "Really going Dutch: why I chose The Hague and Delft over Amsterdam",
    "link": "https://www.theguardian.com/travel/2024/oct/23/why-i-chose-the-hague-and-delft-over-amsterdam-netherlands",
    "description": "Canals, architecture, art, an enviable cycling culture … There are lots of reasons to take a city break in the Netherlands, without needing to set foot in the overtouristed ‘other’ capitalWe leave the Amsterdam-bound Eurostar at Rotterdam, just 3½ hours from London, and swap platforms for a 23-minute ride to The Hague. The “city of peace and justice” (who wouldn’t love that?) is home to the Dutch parliament – in the 13th-century gothic Binnenhof – two of the royal family’s three residences, and the international court of justice, housed in the neo-Renaissance Peace Palace. What’s more, several of the Netherlands’ most famous paintings are in the Mauritshuis, the best-known of The Hague’s many art galleries.It feels as if there can be barely anything left over for Amsterdam, but The Hague has a further asset that for many would trump the rest: miles of wide sandy beach 15 minutes away by (of course) bike, at Scheveningen. Continue reading...",
    "author": "Liz Boulter",
    "published": "Wed, 23 Oct 2024 06:00:03 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "The Hague holidays",
      "Netherlands holidays",
      "Europe holidays",
      "Travel",
      "Johannes Vermeer",
      "Art",
      "Art and design"
    ]
  },
  {
    "id": "6d3cd016-6d03-484d-b7dc-d8d988059b8f",
    "title": "By Ferry or Floatplane, 4 Enchanting Coastal Getaways From Vancouver",
    "link": "https://www.nytimes.com/2024/10/24/travel/island-coast-day-trips-vancouver.html",
    "description": "The largest city in British Columbia makes a perfect gateway to explore the rich marine wildlife and beauty of the region.",
    "author": "Nikkita Nair",
    "published": "Thu, 24 Oct 2024 09:01:27 +0000",
    "image": "https://static01.nyt.com/images/2024/10/24/multimedia/24Vancouver-Islands-01-gkzm/24Vancouver-Islands-01-gkzm-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Ferries",
      "Travel and Vacations",
      "Parks and Other Recreation Areas",
      "Vancouver (British Columbia)",
      "Gulf Islands (British Columbia)",
      "United Nations Educational, Scientific and Cultural Organization",
      "Wines",
      "Hikes and Hiking",
      "Fish and Other Marine Life"
    ]
  },
  {
    "id": "40fdc00f-623d-4f8f-aa3c-4add32e6ac3a",
    "title": "American Airlines Fined $50 Million for Treatment of Disabled Passengers Using Wheelchairs",
    "link": "https://www.nytimes.com/2024/10/23/travel/american-airlines-fined-wheelchairs.html",
    "description": "The Transportation Department issued the fine after an investigation revealed “cases of unsafe physical assistance that at times resulted in injuries and undignified treatment of wheelchair users.”",
    "author": "Christine Chung and Mark Walker",
    "published": "Wed, 23 Oct 2024 17:41:01 +0000",
    "image": "https://static01.nyt.com/images/2024/10/23/multimedia/23American-hlbj/23American-hlbj-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Abuse of the Disabled",
      "Disabilities",
      "Airlines and Airplanes",
      "Discrimination",
      "Wheelchairs",
      "Fines (Penalties)",
      "American Airlines",
      "Transportation Department (US)",
      "Buttigieg, Pete (1982- )"
    ]
  },
  {
    "id": "2d020549-0840-4c4f-bae2-18285c2e45fa",
    "title": "St Helens Chapel in England",
    "link": "https://www.atlasobscura.com/places/st-helens-chapel",
    "description": "Originally constructed in the 11th century, the chapel is dedicated to St Helen, who is traditionally believed to be the mother of Constantine the Great and credited with finding the True Cross. This ancient building has served various purposes over the centuries, including a chapel, a schoolroom, and even a meeting place for the Dutch community in Colchester. The architecture of St Helen's Chapel is a mix of styles, reflecting the many phases of its long history. The chapel's most striking feature is its early Norman construction, characterized by thick stone walls and small, rounded windows. Despite the many alterations and restorations it has undergone, the building still retains much of its medieval charm and atmosphere. Inside, visitors can find remnants of ancient wall paintings and other historical artifacts that offer a glimpse into the chapel's past. Throughout its history, St Helen's Chapel has witnessed the ebb and flow of Colchester's fortunes. From its early days as a center of worship to its use by the Huguenot refugees in the 16th century, the chapel has always been at the heart of the community. Its survival through periods of upheaval, including the English Reformation and the Civil War, is a testament to its resilience and the enduring importance of its spiritual and cultural legacy.",
    "author": "",
    "published": "Thu, 24 Oct 2024 17:00:00 -0400",
    "image": "https://img.atlasobscura.com/QqLLnzPRaSAYQp66iY8AaaliBMReSf6ATl0FA2aKbQU/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8wNmJh/YjY1OC01MzEzLTQ3/NmUtYTkxZC0xZWRj/M2RjNGJkYWRkMDNl/ZjU0YzllODY0Yzky/ZDJfSU1HXzM0MjMu/anBlZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "architecture",
      "history",
      "chapel"
    ]
  },
  {
    "id": "b61eebe0-af15-45e5-a18c-6c19d0932698",
    "title": "A Cemetery's Immortal Residents and the Scientist Who Studies Them",
    "link": "https://www.atlasobscura.com/articles/immortal-lichen-growing-in-cemeteries",
    "description": "“Cemeteries are full of life,” says biologist Anne Pringle as she walks through the Forest Hill Cemetery in Madison, Wisconsin. It’s a bright, early October day and sunlight filters through the still-green leaves, catching strands of spider silk spun over tombstone crosses. Speckled mushrooms stand sentry over the manicured grass as squirrels chatter overhead. But the form of life that brought Pringle here is subtler: Her work focuses on the green and rust-colored splotches growing on the headstones. These growths, called lichens, may help reveal biological rules governing life, death, aging, and even immortality. And because lichens tend to grow undisturbed on tombstones, graveyards make the perfect living laboratory. Despite an often moss-like appearance, lichens are complex living things, arguably more closely related to animals than to plants. They’re made up of fungi living in partnership with algae or bacteria that can perform photosynthesis. “A lichen is a symbiosis, or it's an ecosystem, or it's a world,” says Pringle, a professor of botany and bacteriology at the University of Wisconsin-Madison. “It's an interwoven, complex web of interactions.” Fungi, like their animal cousins, can’t produce their own food the way that plants can. Many of them get nourishment by breaking down organic matter. But the fungi that make up lichens have found a different solution: living with algae and bacteria that use air and sunlight to make sugar. The fungus is nourished by these sugars and, in return, it provides the smaller organisms with a home. There are untold thousands of species of lichens, and they can be found nearly everywhere on Earth, including Antarctica. The lichens that Pringle studies are widespread, but she focuses on individuals growing undisturbed in cemeteries, where the flat surfaces of the headstones provide an ideal surface for measurements. Measuring lichens over time is part of Pringle’s quest to understand their life cycles, specifically a process of deterioration called senescence. As humans and many other living things get older, individuals are less likely to reproduce. Cells struggle to replenish and repair themselves and, eventually, the organism’s metabolism shuts down and it dies. Pringle has been investigating whether this process holds true for lichens as well: Do they also wither with age or is time perhaps immaterial to their life cycle? As a graduate student, Pringle studied senescence in plants, monitoring them for signs of aging and decay. “I spent months of my life tending those plants and doing demographic work,” she says, recalling a monthly census of whether each organism was alive or dead. At the time, she was also studying fungi, and began to wonder how they fit into the equation of life and death. But fungi present research challenges, because so much of their bodies are hidden underground in a complex, root-like network, making it hard to tell where one individual stops and another starts. Lichens, says Pringle, are “fungus made visible”—they tend to grow aboveground on the surfaces of objects, in discrete fungal structures called thalli. This makes counting and tracking individual lichens far easier than their mushroom counterparts. In 2005, Pringle began surveying the lichens at the North Cemetery within the Harvard Forest in Petersham, Massachusetts. She got permission from the families of the people whose graves she observed; some of them belonged to previous directors of the Harvard Forest. “People seemed quite happy to have that research done on their tombstones,” says Pringle. To conduct the lichen censuses, Pringle laid a sheet of transparent plastic over the headstones and traced over the outlines of the individual lichens with permanent marker. She repeated the process year after year, mapping the growth of each individual. While some of the lichen bodies split apart or succumbed to injuries over time, she did not document any signs of senescence. The lichens in her study didn’t appear to undergo the ravages of aging; some died, but seemingly not of old age. In the decade since Pringle’s work at North Cemetery, she’s been mulling over the data and writing up her conclusions. While much of the research is not yet published, Pringle says, “Maybe it’s time to shift from saying, ‘Do they age?’ to ‘How is it that some fungi and some systems don’t age?’” On her early October walk through the sunny cemetery, Pringle is accompanied by botany graduate student Zach Smith, who is learning how to study these potentially immortal lichens. They pause at various headstones so Pringle can show him how to pick ideal specimens for observation and how to distinguish individual lichen bodies. Smith was inspired to study lichens in part because so few researchers do, and much about them remains unknown. “I like these things that are maybe a little bit difficult, maybe a little bit finicky,” he says. “That's what's so interesting about them… What are they doing?” For his research project, Smith isn’t looking directly at lichen immortality, but rather the health of lichens over time, via a process called chlorophyll fluorescence. When an organism that performs photosynthesis—plant or lichen—encounters light, some of that light will get absorbed, and some of the light will be expelled. The photon-emitting instruments he uses measure how much light a leaf or lichen soaks up: If most of the photons are not absorbed, it’s a sign the organism is not healthy, Smith says. He’ll revisit the same lichens once or twice a week over the course of a year to see how they respond to changes in their environment such as heat, rain, and seasonal shifts in light. While it’s early days, the results of Smith’s work could dovetail with Pringle’s research on what makes lichens so resilient year after year. He has already witnessed his tiny subjects’ surprising tenacity. Smith recalls attempting to measure chlorophyll fluorescence on a dried-out lichen crusted onto a stick. When he flashed light at the lichen and measured its response, “I wasn’t getting any readings—so functionally, it seems like it’s not alive,” he says. But then he put a drop of water on the lichen. “It instantly started giving me readings,” indicating that its metabolism had re-activated, says Smith. The lichen’s resurrection hints at the complex life cycles of these organisms—and how the human-centric dichotomy of “alive or dead” may not apply to organisms so different from us. In fact, a vital aspect of the work Pringle and her students do to unravel lichen life cycles, aging, and immortality is that “it brings up really important challenges to how we think about life,” says Daniel Stanton, a lichen and plant ecologist at the University of Minnesota, Twin Cities. Lichens, Stanton says, “don’t necessarily follow the clean, simple rules that we get taught in introductory biology classes.” Instead, they call into question our underlying ideas of what it means to be an individual living thing, what it means to age, and what it means to die. While lichens’ abilities might seem tantalizing for us humans, Pringle cautions that they don’t hold the secrets to keeping us forever young—our bodies and life cycles are too fundamentally different. But moreover, that’s not the goal of her work. “It's not going to cure cancer, it's not going to bring world peace, two things that we desperately need right now,” she says. “But I would argue that there is great value in understanding the world [and] how biodiversity works so that we can preserve it, which is an integral component of human health,” says Pringle. She adds: “It's not clear to me that the best way to repair the world isn't sitting and watching lichens grow in a cemetery and telling the world about it.”",
    "author": "Kate Golembiewski",
    "published": "Thu, 24 Oct 2024 16:05:00 -0400",
    "image": "https://assets.atlasobscura.com/article_images/lg/103647/image.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": null
  },
  {
    "id": "23a82b8f-e58c-43a9-8db9-c120d9ef9c57",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "0b060401-d3f0-426d-971d-f5d814f97bb2",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "15907f71-7e35-4f11-ac59-4c18b8bbc818",
    "title": "World Nomads Annual Travel Insurance Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/world-nomads-annual-travel-insurance-review/",
    "description": "If you’re a frequent traveler, you know that planning multiple trips throughout the year can be a logistical challenge. There are lots of moving parts to organize, from flights to accommodation to activities. And it gets even more challenging if you’re traveling with friends or family. In fact, there’s so much to keep track of... The post World Nomads Annual Travel Insurance Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Thu, 24 Oct 2024 15:20:48 +0000",
    "image": "https://media.nomadicmatt.com/2024/worldnomadsannualtravelinsurance.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "Insurance",
      "travel insurance"
    ]
  },
  {
    "id": "9679e87c-0f11-48b3-817c-5e61cf214a09",
    "title": "The Best eSIM for Traveling Japan",
    "link": "https://www.nomadicmatt.com/travel-blogs/best-esim-japan/",
    "description": "I love visiting Japan. Even after multiple visits, I never get tired of wandering the country’s historic temples, feasting on its incredible sushi, and soaking up the breakneck pace of life in Tokyo. After over half a dozen visits, I’ve learned through trial and error how to best explore the country. English isn’t widely spoken,... The post The Best eSIM for Traveling Japan appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Thu, 24 Oct 2024 14:09:14 +0000",
    "image": "https://media.nomadicmatt.com/2024/bestesimjapan.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Japan",
      "esim",
      "gear",
      "smartphones",
      "Tech"
    ]
  }
]
