[
  {
    "id": "81300a40-5e72-4dff-9145-f18119ce1b96",
    "title": "Voulez-vous parler avec moi? My midlife French exchange in Paris",
    "link": "https://www.theguardian.com/travel/2024/oct/10/my-midlife-french-exchange-in-paris-france",
    "description": "Language exchange holidays are wasted on the young. I had a great time with my host – sans youthful embarrassment about my accent – and more adults are doing the sameOn the terrace of a brasserie on Rue Cler, a chic Parisian market street, I’m chatting over a tongue-lubricating glass of Sancerre with Sébastien de Lavalette, 33, a French travel company head and my language exchange partner.Sébastien compliments my French accent, or at least I think he does: “You don’t have that mouth-full-of-bread accent that many British people have”, as I order in my middle-of-the-road restaurant French. Sébastien, who was raised in Paris but whose family hails from Périgord, reminisces about his teenage foreign language exchanges in Spain. Continue reading...",
    "author": "Sally Howard",
    "published": "Thu, 10 Oct 2024 06:00:35 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Language courses",
      "Paris holidays",
      "France holidays",
      "Europe holidays",
      "Travel",
      "Learning holidays"
    ]
  },
  {
    "id": "a5e1f69e-5787-4c16-ac8f-54a55769a4a7",
    "title": "I’m visually impaired but thanks to my guides I loved exploring Austria’s Tirol",
    "link": "https://www.theguardian.com/travel/2024/oct/09/austria-tirol-visually-impaired",
    "description": "A trip that pairs partially sighted people with fully sighted guides offers reassurance while expanding the possibilities of travel, as our writer discovered in Austria and GermanySwimming through the cool clear lake, I’m aware of the densely forested mountains behind us, with pale rocky peaks to our right. A cable car snakes up the side of one, and the sky is turning grey, hinting at an Alpine storm. A standup paddleboarder with blond hair who is wearing bright Hawaiian shorts glides past, and the distant shore that we’re heading towards is clustered with cheery red parasols.I can’t really see much of this. I can see the silhouette of the mountains cradling us, the figure of the paddleboarder but not his twist of blond hair, and the cable car would otherwise be a mystery to me. But as I swim alongside a fellow traveller, Sophia, she describes the scene around us in such detail that it fills in the blanks and paints a rich picture for me as a visually impaired person. Continue reading...",
    "author": "Caroline Butterwick",
    "published": "Wed, 09 Oct 2024 06:00:06 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Austria holidays",
      "Germany holidays",
      "Europe holidays",
      "Blindness and visual impairment",
      "Disability",
      "Travel"
    ]
  },
  {
    "id": "25edefef-5bf2-404d-b312-42179fc2a150",
    "title": "Help! My Flight to Tokyo Was Canceled, and All I Got Was a Lousy Mileage Refund",
    "link": "https://www.nytimes.com/2024/10/10/travel/japanese-airlines-mileage-refund.html",
    "description": "What were Japan Airlines’ obligations when a first-class passenger asked to be rebooked onto a competitor’s flight?",
    "author": "Seth Kugel",
    "published": "Thu, 10 Oct 2024 09:03:29 +0000",
    "image": "https://static01.nyt.com/images/2024/10/10/travel/10trippedup-illo/10trippedup-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Airlines and Airplanes",
      "Customer Relations",
      "Travel and Vacations",
      "Alaska Airlines",
      "Japan Airlines",
      "Content Type: Service"
    ]
  },
  {
    "id": "db5531b4-f1d9-4339-a397-f3bd71a5220b",
    "title": "In Toronto, Exploring a Wilderness in the Heart of the City",
    "link": "https://www.nytimes.com/2024/10/09/travel/toronto-ravines-parks-trails.html",
    "description": "A sprawling network of ravines threaded through Canada’s largest city offers urban explorers an oasis of birdsong, burbling creeks and whispering trees.",
    "author": "Meghan Davidson Ladly",
    "published": "Wed, 09 Oct 2024 09:02:31 +0000",
    "image": "https://static01.nyt.com/images/2024/10/09/multimedia/09toronto-ravines-mjfq/09toronto-ravines-mjfq-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Toronto (Ontario)",
      "Jacobs, Jane",
      "Urban Areas",
      "Travel and Vacations",
      "Parks and Other Recreation Areas",
      "Trees and Shrubs",
      "Autumn (Season)"
    ]
  },
  {
    "id": "53d99312-9cf3-40c4-946f-94a10628adba",
    "title": "St. Edward State Park in Kenmore, Washington",
    "link": "https://www.atlasobscura.com/places/st-edward-state-park",
    "description": "Lake Washington occupies a north-south trending glacial basin just east of Seattle, and so tends to isolate the city. For this reason much of the shoreline along the east side remained undeveloped until well into the 20th century. \"Eastside\" development didn't really take off until the floating bridges, the I-90 bridge to the south and the Evergreen Point bridge to the north, were built across the lake in the mid-20th century. In 1926, long before the bridges, Bishop Edward John O'Dea purchased 366 acres on the northeast side of Lake Washington as a site for a seminary. Bishop O'Dea delivered the blessing of the cornerstone of St. Edward's Seminary on October 13, 1930, and the seminary was dedicated exactly a year later. St. Edward's enrollment grew through the early 1950s, but the changing priorities of the Catholic Church in the 1960s led to decreases in enrollment. St. Edward became a minor (i.e., high-school) seminary in 1968. Finally, in 1977 St. Edward and 316 acres of the site were sold to the state of Washington to be the basis of a state park, which was created in 1978. St. Edward State Park now preserves an almost unique snapshot of the undeveloped shoreline of Lake Washington. The park grounds are seamed with trails, some of which provide lakeshore access. The area is also, as might be expected, a haven for wildlife.  There are also still interpretive signs on the seminary and students' life there. In an incongruous development, the old seminary has been remodeled into a high-end hotel in the last few years.  Efforts were made to preserve as much of the structure as possible and have been largely successful. The common areas of the hotel, which include restaurants and a bar, are accessible to the public, and views can be had out some of the upper windows that open onto the public hallways. The first-floor hallways also hold art galleries, with some pieces for sale.",
    "author": "",
    "published": "Thu, 10 Oct 2024 18:00:00 -0400",
    "image": "https://img.atlasobscura.com/pFbfQNYflKVpkjcNra8scvxIg-McWeYuxfXeJdlkRjA/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9mNzAy/NzJhMS05NmFiLTRi/ZTktYjJiZi00ZjQ4/N2U2NWNiNjlmYTRl/MGVkZWE0NTlkOWU2/MDRfSU1HXzAyNjFf/YWRqLmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "lakes",
      "catholic",
      "parks",
      "state parks"
    ]
  },
  {
    "id": "2a34f0d3-4db2-49cb-91a1-c261761387da",
    "title": "Magick Candle in Indianapolis, Indiana",
    "link": "https://www.atlasobscura.com/places/magick-candle-indianapolis",
    "description": "As the oldest metaphysical shop in the Indianapolis area, Magick Candle is a must stop for those on any spiritual path. They carry everything from chime candles to coyote taxidermy and anything you can imagine in between. Owners Michelle and Jan are incredibly knowledgeable practitioners themselves and are willing to answer questions and help others along their path. The store also houses the Cauldron School of Metaphysics, where they teach countless classes on the path.",
    "author": "",
    "published": "Thu, 10 Oct 2024 17:45:00 -0400",
    "image": "https://img.atlasobscura.com/cZc_4aObGYavCeeI9Xt6pBxBaN4vE85qBf6NCGKzP7k/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9hMGM2/MWNkMC1iM2JjLTQ0/ZGYtOGQyMy05MWUy/ZTczN2QyYWU4OTBm/NDYwODhkNGIxNmMz/MDRfaW1hZ2UuanBn.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "taxidermy",
      "magic",
      "shops"
    ]
  },
  {
    "id": "513520f4-0659-47e9-a447-2f98de8aecca",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "3945710e-0157-4831-bfdf-822a28043fa8",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "6429e86c-f814-4869-9451-23c6e827bcf7",
    "title": "My Suggested Black Forest Itinerary",
    "link": "https://www.nomadicmatt.com/travel-blogs/black-forest-itinerary/",
    "description": "In the land of the Brothers Grimm, I was expecting creepy overgrown forests, quaint medieval towns, and maybe a gingerbread house or two. But, it turns out, the Brothers Grimm tales weren’t from the Black Forest region of Germany (most are from the central part). Why did I think they were from there? I don’t... The post My Suggested Black Forest Itinerary appeared first on Nomadic Matt's Travel Site.",
    "author": "Chris Oldfield",
    "published": "Mon, 07 Oct 2024 12:56:44 +0000",
    "image": "https://media.nomadicmatt.com/2024/blackforest1.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Europe",
      "Black Forest",
      "europe",
      "germany"
    ]
  },
  {
    "id": "07fcb860-c0b2-4817-87d2-fa2000627922",
    "title": "The 6 Best Hotels in Melbourne",
    "link": "https://www.nomadicmatt.com/travel-blogs/best-hotels-melbourne/",
    "description": "Melbourne is my favorite city in Australia. It’s a vibrant, multicultural city known for its rich arts scene, world-class dining, and lively atmosphere. It’s a hub for backpackers and travelers too. The mix of old-world architecture and modern skyscrapers gives the city a unique charm. I especially love strolling through Melbourne’s iconic laneways, enjoying the... The post The 6 Best Hotels in Melbourne appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Fri, 04 Oct 2024 13:00:40 +0000",
    "image": "https://media.nomadicmatt.com/2024/melbournehotels.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Australia",
      "hotels",
      "melbourne"
    ]
  }
]
