{
  "id": "04a7fb72-f653-4d76-b48d-a2b34dc7a724",
  "title": "These portable Samsung SSDs are the perfect companion for my ASUS Rog Ally X, and on sale today",
  "link": "https://www.rockpapershotgun.com/samsung-ssds-perfect-asus-rog-ally-x-steam-deck-gaming-pc",
  "description": "If you're rocking the ASUS ROG Ally X, you already know internal storage won't take you far. Big games, emulators, mods, and media add up fast. Instead of juggling what to uninstall next, a solid external SSD gives you room to breathe, no matter where you are. Read more",
  "author": "Christian Wait",
  "published": "Wed, 16 Apr 2025 17:30:00 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "PC"
  ],
  "byline": "Christian Wait",
  "length": 3315,
  "excerpt": "Expand your ASUS ROG Ally X storage with Samsung's 4TB portable SSDs. Get the T5 EVO for $199.99 or the high-speed T9 for $299.99.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/6e9d79be854a74cd6ff03f796f27f9aa/icon/apple-touch-icon.png",
  "text": "Free MicroSDXC 256GB or 2000mb/s read/write speeds? Image credit: RPS Photo Composite / Samsung If you're rocking the ASUS ROG Ally X, you already know internal storage won't take you far. Big games, emulators, mods, and media add up fast. Instead of juggling what to uninstall next, a solid external SSD gives you room to breathe, no matter where you are. Whether it's for transporting your massive libary, or for a plug in a play experience, right now, Samsung has two 4TB options on sale that plug directly into the Ally X's USB-C ports without a fuss. Samsung T5 EVO 4TB, now $199.99, is down from $358.98. That's a $158.99 discount and it includes a bonus 256GB Sonic the Hedgehog microSD card with adapter, worth $33.99. The T5 EVO runs on USB 3.2 Gen 1, which pairs smoothly with the Ally X's USB 3.2 Gen 2 Type-C port. You’ll get up to 460 MB/s transfer speeds, more than enough for launching games quickly or storing loads of media. Capacity: 4TB Interface: USB 3.2 Gen 1 (5 Gbps) Sequential Read/Write Speeds: Up to 460 MB/s Improved Intelligent TurboWrite for large file transfers Shock-resistant and drop protection up to 6 feet (2 meters) 256-bit AES Hardware Encryption for secure data Lightweight and portable (102g) Dimensions: 3.7 x 1.6 x 0.7 inches UASP Mode Supported Samsung Magician Software included 3-year limited warranty It’s compact and light, so it won’t weigh down your setup. Samsung says it can survive a 6-foot drop, which is handy if your idea of portable gaming involves backpacks and gravity. It also includes 256-bit AES hardware encryption, so your files are protected without needing to install extra software. If you want to take full advantage of the Ally X's USB 4 port, look at the Samsung T9 4TB. It's one of RPS' top picks for gaming SSDs, and currently priced at $299.99, down from $439.99. It uses USB 3.2 Gen 2x2 and delivers transfer speeds up to 2,000 MB/s, which means you can run large games straight from the drive with minimal delay. Perfect for anyone treating the Ally X as a serious gaming platform, not just a handheld. Capacity: 4TB Interface: USB 3.2 Gen 2x2 (20 Gbps) Sequential Read/Write Speeds: Up to 2,000 MB/s NVMe support for faster access and load times Thermal control to prevent overheating during long sessions 256-bit AES Hardware Encryption for file protection Drop resistance up to 9.8 feet (3 meters) Dimensions: 3.5 x 2.4 x 0.6 inches Weight: 122g UASP Mode Supported Samsung Magician Software + Portable SSD Software 1.0 included 5-year limited warranty T9 also manages heat well, keeping performance consistent even during longer sessions. It’s rated to survive drops from nearly 10 feet and has the same hardware encryption as the T5 EVO. You also get Samsung’s Magician software, which helps manage firmware updates and keeps tabs on drive health without extra effort. Both SSDs are fully compatible with the Ally X, along with your PC, Android devices, consoles, and pretty much anything else with a USB-C port. If you're looking to expand your storage without slowing things down, either drive is a solid fit. The T5 EVO gives you a ton of space at a lower price. The T9 gives you raw speed to match the hardware you're working with.",
  "image": "https://assetsio.gnwcdn.com/PIXEL-9---2025-04-16T142549.954.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003eFree MicroSDXC 256GB or 2000mb/s read/write speeds?\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/PIXEL-9---2025-04-16T142549.954.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/PIXEL-9---2025-04-16T142549.954.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/PIXEL-9---2025-04-16T142549.954.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/PIXEL-9---2025-04-16T142549.954.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Portable SSD T5 EVO 4 TB USB 3.2 Gen 1 (Black), RO Plus Sonic the Hedgehog™ + Adapter microSDXC 256GB and Portable SSD T9 USB 3.2 Gen2x2 4TB (Black) on an RGB background\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRPS Photo Composite  / Samsung\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eIf you\u0026#39;re rocking the \u003ca href=\"https://www.rockpapershotgun.com/asus-rog-ally-x-review\"\u003eASUS ROG Ally X\u003c/a\u003e, you already know internal storage won\u0026#39;t take you far. Big games, emulators, mods, and media add up fast. Instead of juggling what to uninstall next, a solid external SSD gives you room to breathe, no matter where you are. \u003c/p\u003e\n\u003cp\u003eWhether it\u0026#39;s for transporting your massive libary, or for a plug in a play experience, right now, Samsung has two 4TB options on sale that plug directly into the Ally X\u0026#39;s USB-C ports without a fuss.\u003c/p\u003e\n\n\u003cp\u003eSamsung T5 EVO 4TB, now $199.99, is down from $358.98. That\u0026#39;s a $158.99 discount and it includes a bonus 256GB \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/sonic-the-hedgehog\"\u003eSonic the Hedgehog\u003c/a\u003e microSD card with adapter, worth $33.99. The T5 EVO runs on USB 3.2 Gen 1, which pairs smoothly with the Ally X\u0026#39;s USB 3.2 Gen 2 Type-C port. You’ll get up to 460 MB/s transfer speeds, more than enough for launching games quickly or storing loads of media.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCapacity: 4TB\u003c/li\u003e\n\u003cli\u003eInterface: USB 3.2 Gen 1 (5 Gbps)\u003c/li\u003e\n\u003cli\u003eSequential Read/Write Speeds: Up to 460 MB/s\u003c/li\u003e\n\u003cli\u003eImproved Intelligent TurboWrite for large file transfers\u003c/li\u003e\n\u003cli\u003eShock-resistant and drop protection up to 6 feet (2 meters)\u003c/li\u003e\n\u003cli\u003e256-bit AES Hardware Encryption for secure data\u003c/li\u003e\n\u003cli\u003eLightweight and portable (102g)\u003c/li\u003e\n\u003cli\u003eDimensions: 3.7 x 1.6 x 0.7 inches\u003c/li\u003e\n\u003cli\u003eUASP Mode Supported\u003c/li\u003e\n\u003cli\u003eSamsung Magician Software included\u003c/li\u003e\n\u003cli\u003e3-year limited warranty\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt’s compact and light, so it won’t weigh down your setup. Samsung says it can survive a 6-foot drop, which is handy if your idea of portable gaming involves backpacks and gravity. It also includes 256-bit AES hardware encryption, so your files are protected without needing to install extra software.\u003c/p\u003e\n\n\u003cp\u003eIf you want to take full advantage of the Ally X\u0026#39;s USB 4 port, look at the Samsung T9 4TB. It\u0026#39;s one of RPS\u0026#39; top picks for \u003ca href=\"https://www.rockpapershotgun.com/best-ssd-for-gaming#samsungt9\"\u003egaming SSDs\u003c/a\u003e, and currently priced at $299.99, down from $439.99. It uses USB 3.2 Gen 2x2 and delivers transfer speeds up to 2,000 MB/s, which means you can run large games straight from the drive with minimal delay. Perfect for anyone treating the Ally X as a serious gaming platform, not just a handheld.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCapacity: 4TB\u003c/li\u003e\n\u003cli\u003eInterface: USB 3.2 Gen 2x2 (20 Gbps)\u003c/li\u003e\n\u003cli\u003eSequential Read/Write Speeds: Up to 2,000 MB/s\u003c/li\u003e\n\u003cli\u003eNVMe support for faster access and load times\u003c/li\u003e\n\u003cli\u003eThermal control to prevent overheating during long sessions\u003c/li\u003e\n\u003cli\u003e256-bit AES Hardware Encryption for file protection\u003c/li\u003e\n\u003cli\u003eDrop resistance up to 9.8 feet (3 meters)\u003c/li\u003e\n\u003cli\u003eDimensions: 3.5 x 2.4 x 0.6 inches\u003c/li\u003e\n\u003cli\u003eWeight: 122g\u003c/li\u003e\n\u003cli\u003eUASP Mode Supported\u003c/li\u003e\n\u003cli\u003eSamsung Magician Software + Portable SSD Software 1.0 included\u003c/li\u003e\n\u003cli\u003e5-year limited warranty\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eT9 also manages heat well, keeping performance consistent even during longer sessions. It’s rated to survive drops from nearly 10 feet and has the same hardware encryption as the T5 EVO. You also get Samsung’s Magician software, which helps manage firmware updates and keeps tabs on drive health without extra effort.\u003c/p\u003e\n\u003cp\u003eBoth SSDs are fully compatible with the Ally X, along with your PC, Android devices, consoles, and pretty much anything else with a USB-C port. If you\u0026#39;re looking to expand your storage without slowing things down, either drive is a solid fit. The T5 EVO gives you a ton of space at a lower price. The T9 gives you raw speed to match the hardware you\u0026#39;re working with.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-16T17:30:00Z",
  "modifiedTime": null
}
