{
  "id": "0701fa16-d012-4901-a2f4-c2fac8c98fc8",
  "title": "Stellar Ghosts Settlers a Third Person Shooter that Sticks to the Basics",
  "link": "https://news.xbox.com/en-us/2025/02/05/stellar-ghosts-settlers-sticks-to-the-basics/",
  "description": "The wait is over: single player Sci Fi fantasy Third person shooter Stellar Ghosts Settlers ((SGS)), is out today on Xbox. Let’s jump in to some details on how to get the best out of your gameplay and stay alive! Upon succeeding a mission, the player will receive credits that can be spent towards upgrading […] The post Stellar Ghosts Settlers a Third Person Shooter that Sticks to the Basics appeared first on Xbox Wire.",
  "author": "johns",
  "published": "Wed, 05 Feb 2025 22:30:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "ID@Xbox",
    "protofactor",
    "Stellar ghosts settlers"
  ],
  "byline": "johns",
  "length": 3737,
  "excerpt": "Tips and pointers to get the best and master all the achievements in Stellar Ghosts: Settlers on Xbox.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryComplete the missions to get credits towards character stats upgrades.Seven playable characters to upgrade.Complete the missions to unlock Arena mode. The wait is over: single player Sci Fi fantasy Third person shooter Stellar Ghosts Settlers ((SGS)), is out today on Xbox. Let’s jump in to some details on how to get the best out of your gameplay and stay alive! Upon succeeding a mission, the player will receive credits that can be spent towards upgrading the player characters’ stats of his choice. Seven playable characters are available and each of them starts with their specific stats (Health, Stamina and Armor) and their own unique special ability (force shield, incineration invincibility, orb sidekick, regeneration, megablast and homing electro shots). Making the best use of those hard-earned credits is crucial to enhance your favourite playable characters so that it gets easier to complete the missions. Make sure to get rid of as many enemies getting in your way as possible. It’s the best way to earn additional credits! So have no mercy! Blast everything that moves! The SGS will reward you for it! But watch your ammo! Completing missions will also unlock the Arena Mode. This mode will provide countless hours of gameplay where the player will have to go through all the waves of enemies and try to beat the top ranked players on the leaderboards. If you want to reach the highest ranks in the leaderboard, the best practice would be to use the weakest weapons first to beat a maximum of the weaker enemies in the early waves. As the player gets to the higher waves it will be useful to use stronger weapons since more enemies will attack or stronger enemies will rise. There is a set number of collectibles items (weapons, mechs, energy kits and health kits) in each arena, so you will have to collect them wisely if you want to make it to the highest ranks. You have an hour to complete an arena, the faster you complete it, the more points you receive. So, you’ll have to be as accurate as possible to save ammunition and try to be as quick as possible to gain extra points thanks to those sharp shooting skills! We have also hidden a secret object in each mission and arena. If you want to finish the game, you’ll have to find them all to complete that achievement. You can only earn credits during Campaign mode. So, if you plan on upgrading all the playable characters, you’ll have to redo the missions. The way to go if you want to find all the secret items as well. Playing the arenas will be a requirement if you plan on completing all the achievements in the game. And you’ll relax while blasting away all the alien creatures and the enemies of the settlers using all the arsenal of weapons available. Making it to the top ranked players on the leaderboard will feel like a great achievement in itself as you’ll have to beat the score of some relentless pest control players! SGS is available today on Xbox! Stellar Ghosts Settlers is a Sci Fi Fantasy 3rd person action shooter game that sticks to the basics and immerses you in a world full of original and powerful wildlife. You are part of a group of settlers who decided to go away from the corrupt galactic Government's yoke. The settlers decided to set their first colony on the recently discovered and uninhabited planet Prosopopia B-21, planet full of resources so that the colonists could thrive. Despite the hostile wildlife the settlers managed to set multiple bases across the planet. Unfortunately, it wasn't that long until the galactic Government found out about that treason and decided to invade the planet in order to get their hands on all those new resources.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/StellarGhostsSettlers_Trailer_Thumbnail-2d7eb51690f322eac0d4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                    \n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003eComplete the missions to get credits towards character stats upgrades.\u003c/li\u003e\u003cli\u003eSeven playable characters to upgrade.\u003c/li\u003e\u003cli\u003eComplete the missions to unlock Arena mode.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eThe wait is over: single player Sci Fi fantasy Third person shooter \u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/stellar-ghosts-settlers/9ph2tw712ttm#:~:text=Stellar%20Ghosts%20Settlers%20is%20a%20Sci%20Fi%20Fantasy,go%20away%20from%20the%20corrupt%20galactic%20Government%27s%20yoke.?msockid=03b34b078247628d221f5e3083fd6318\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eStellar Ghosts Settlers\u003c/a\u003e\u003c/em\u003e ((\u003cem\u003eSGS\u003c/em\u003e)\u003cem\u003e)\u003c/em\u003e, is out today on Xbox. Let’s jump in to some details on how to get the best out of your gameplay and stay alive!\u003c/p\u003e\n\n\n\n\u003cp\u003eUpon succeeding a mission, the player will receive credits that can be spent towards upgrading the player characters’ stats of his choice. Seven playable characters are available and each of them starts with their specific stats (Health, Stamina and Armor) and their own unique special ability (force shield, incineration invincibility, orb sidekick, regeneration, megablast and homing electro shots). Making the best use of those hard-earned credits is crucial to enhance your favourite playable characters so that it gets easier to complete the missions.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"2560\" height=\"1440\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/SGS_Screnshot_022-cbfb454a727b8d876eea-scaled.jpg\" alt=\"SGS screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/SGS_Screnshot_022-cbfb454a727b8d876eea-scaled.jpg 2560w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/SGS_Screnshot_022-cbfb454a727b8d876eea-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/SGS_Screnshot_022-cbfb454a727b8d876eea-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/SGS_Screnshot_022-cbfb454a727b8d876eea-1536x864.jpg 1536w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/SGS_Screnshot_022-cbfb454a727b8d876eea-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMake sure to get rid of as many enemies getting in your way as possible. It’s the best way to earn additional credits! So have no mercy! Blast everything that moves! The SGS will reward you for it! But watch your ammo!\u003c/p\u003e\n\n\n\n\u003cp\u003eCompleting missions will also unlock the Arena Mode. This mode will provide countless hours of gameplay where the player will have to go through all the waves of enemies and try to beat the top ranked players on the leaderboards.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to reach the highest ranks in the leaderboard, the best practice would be to use the weakest weapons first to beat a maximum of the weaker enemies in the early waves. As the player gets to the higher waves it will be useful to use stronger weapons since more enemies will attack or stronger enemies will rise. There is a set number of collectibles items (weapons, mechs, energy kits and health kits) in each arena, so you will have to collect them wisely if you want to make it to the highest ranks.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou have an hour to complete an arena, the faster you complete it, the more points you receive. So, you’ll have to be as accurate as possible to save ammunition and try to be as quick as possible to gain extra points thanks to those sharp shooting skills!\u003c/p\u003e\n\n\n\n\u003cp\u003eWe have also hidden a secret object in each mission and arena. If you want to finish the game, you’ll have to find them all to complete that achievement.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"903\" height=\"508\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/image-2c31ddb0f3ee84586032.jpeg\" alt=\"SGS screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/image-2c31ddb0f3ee84586032.jpeg 903w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/image-2c31ddb0f3ee84586032-768x432.jpeg 768w\" sizes=\"(max-width: 903px) 100vw, 903px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eYou can only earn credits during Campaign mode. So, if you plan on upgrading all the playable characters, you’ll have to redo the missions. The way to go if you want to find all the secret items as well.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlaying the arenas will be a requirement if you plan on completing all the achievements in the game. And you’ll relax while blasting away all the alien creatures and the enemies of the settlers using all the arsenal of weapons available.\u003c/p\u003e\n\n\n\n\u003cp\u003eMaking it to the top ranked players on the leaderboard will feel like a great achievement in itself as you’ll have to beat the score of some relentless pest control players! \u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/stellar-ghosts-settlers/9ph2tw712ttm#:~:text=Stellar%20Ghosts%20Settlers%20is%20a%20Sci%20Fi%20Fantasy,go%20away%20from%20the%20corrupt%20galactic%20Government%27s%20yoke.?msockid=03b34b078247628d221f5e3083fd6318\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSGS \u003c/a\u003e\u003c/em\u003eis available today on Xbox!\u003c/p\u003e\n\n\n\n\u003cdiv data-product-id=\"9ph2tw712ttm#:\" id=\"msp1738794152298\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9ph2tw712ttm#:\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.13416.14243914710686754.c2598852-0771-4dc7-afd1-a093adcb45d2.0d05531f-63b2-4ca7-9fed-b192e5fdcdd3?w=400\u0026amp;h=600\" alt=\"Stellar Ghosts Settlers\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tStellar Ghosts Settlers is a Sci Fi Fantasy 3rd person action shooter game that sticks to the basics and immerses you in a world full of original and powerful wildlife.\n\nYou are part of a group of settlers who decided to go away from the corrupt galactic Government\u0026#39;s yoke. The settlers decided to set their first colony on the recently discovered and uninhabited planet Prosopopia B-21, planet full of resources so that the colonists could thrive. Despite the hostile wildlife the settlers managed to set multiple bases across the planet. Unfortunately, it wasn\u0026#39;t that long until the galactic Government found out about that treason and decided to invade the planet in order to get their hands on all those new resources.\n\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-05T22:30:00Z",
  "modifiedTime": "2025-02-06T00:54:10Z"
}
