{
  "id": "0e937482-77c3-4c6d-965a-0b1f9dab5156",
  "title": "Sega president admits live-service games are the company's biggest challenge",
  "link": "https://www.eurogamer.net/sega-president-admits-live-service-games-are-the-companys-biggest-challenge",
  "description": "Sega president and CEO of Sega America and Europe Shuji Utsumi has admitted live-service games are the company's biggest challenge. Read more",
  "author": "Ed Nightingale",
  "published": "Thu, 03 Jul 2025 16:07:05 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Platformer",
    "SEGA",
    "Sonic Team",
    "Battle Royale",
    "Third person",
    "Rovio Entertainment",
    "Party",
    "Racing",
    "Sports",
    "Android",
    "Side view",
    "PC",
    "Multiplayer Competitive",
    "Sonic Rumble",
    "iOS"
  ],
  "byline": "Ed Nightingale",
  "length": 3029,
  "excerpt": "Sega president and CEO of Sega America and Europe Shuji Utsumi has admitted live-service games are the company's biggest challenge.",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/29fd5c26f4ffa346a2221f8f7f55bc0f/icon/apple-touch-icon-152x152.png",
  "text": "Image credit: Sega / Eurogamer Sega president and CEO of Sega America and Europe Shuji Utsumi has admitted live-service games are the company's biggest challenge. Live-service games dominate playtime, but at present Sega does not have a competitive offering in this space. In an interview with The Game Business, Utsumi stated: \"One of the biggest challenges is the GaaS [Games as a service] business for us. The game companies with a strong record tend to have a strong GaaS business globally. Console/PC standalone business is getting to be better but we are still working on making the GaaS business global. So that's one of the big challenges.\" Sonic Rumble - Pre-Registration Trailer Sonic Rumble - Pre-Registration TrailerWatch on YouTube In response to what the company is doing to address this, Utsumi cited Sega's acquisition of Angry Birds maker Rovio in 2023. \"They have deep knowledge of the global mobile business and they have very strong IP like Angry Birds,\" he said. That's why the company is now working on the mobile party game Sonic Rumble, although this was delayed earlier this year. Added Utsumi: \"We are giving [Rovio] access to our IPs including Sonic to come up with nice welcoming GaaS titles.\" It's important that Utsumi mentioned global business in his comments. Later in the interview, he discussed emerging countries as an opportunity for growth, particularly with mobile games - including the likes of countries in the Middle East and Africa. Sega did, of course, have looter shooter Hyenas from Creative Assembly, which was intended to be a live-service game. However, Hyenas was cancelled in 2023, due to \"lower profitability of the European region\". Back in 2022, Sega announced the development of a \"Super Game\", though little has been revealed since. \"The ultimate goal in the 'Super Game' strategy is to create a game so revolutionary that it attracts far more active users than any of the Group's games to date,\" reads the company's strategy report from the time. \"One key to achieving this goal is whether we can draw together a large community, involving not only players but also streamers who stream the game and viewers who watch their videos. \"That kind of community expands and further develops game content, adding value to the game that is unimagined by developers, and sparking a broader movement - which can then draw in even more users and grow the game's presence dramatically.\" Earlier this month, Atlus and Sega released Persona 5: The Phantom X on PC and mobile, a free-to-play gacha spin-off of its RPG series. Perhaps this could build on the heights of the Persona series to find global success. Sega isn't alone in struggling with its live-service ambitions. Sony infamously cancelled Concord last year, as well as other unannounced projects. Still, PlayStation's Hermen Hulst recently stated the company remains committed to building \"a diverse and resilient\" portfolio of live service games - Marathon and Fairgames in particular.",
  "image": "https://assetsio.gnwcdn.com/Sonic-Rumble---Pre-Registration-Trailer-0-1-screenshot-(1)-(1).png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Sonic-Rumble---Pre-Registration-Trailer-0-1-screenshot-(1)-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Sonic-Rumble---Pre-Registration-Trailer-0-1-screenshot-(1)-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Sonic-Rumble---Pre-Registration-Trailer-0-1-screenshot-(1)-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Trailer screenshot from Sonic Rumble showing multiple cartoon Sonic series characters reaching for golden rings, with a red Angry Birds character superimposed in the corner\" data-src-full=\"https://assetsio.gnwcdn.com/Sonic-Rumble---Pre-Registration-Trailer-0-1-screenshot-(1)-(1).png?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"414\" height=\"233\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eSega / Eurogamer\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eSega president and CEO of Sega America and Europe Shuji Utsumi has admitted live-service games are the company\u0026#39;s biggest challenge.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.eurogamer.net/live-service-games-continue-to-dominate-accounting-for-40-of-time-spent-on-ps5-and-xbox-in-us-last-month\"\u003eLive-service games dominate playtime\u003c/a\u003e, but at present Sega does not have a competitive offering in this space.\u003c/p\u003e\n\u003cp\u003eIn an interview with \u003ca href=\"https://www.youtube.com/watch?v=SZDinRJa2C4\"\u003eThe Game Business\u003c/a\u003e, Utsumi stated: \u0026#34;One of the biggest challenges is the GaaS [Games as a service] business for us. The game companies with a strong record tend to have a strong GaaS business globally. Console/PC standalone business is getting to be better but we are still working on making the GaaS business global. So that\u0026#39;s one of the big challenges.\u0026#34;\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Sonic Rumble - Pre-Registration Trailer\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/ckFLOcCsO_I?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/ckFLOcCsO_I/hqdefault.jpg\"/\u003e\u003cspan\u003eSonic Rumble - Pre-Registration Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/ckFLOcCsO_I?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/ckFLOcCsO_I?autoplay=1\" title=\"Sonic Rumble - Pre-Registration Trailer\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eSonic Rumble - Pre-Registration Trailer\u003ca href=\"https://www.youtube.com/watch?v=ckFLOcCsO_I\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eIn response to what the company is doing to address this, Utsumi cited \u003ca href=\"https://www.eurogamer.net/sega-buys-angry-birds-maker-rovio-for-625m\"\u003eSega\u0026#39;s acquisition of Angry Birds maker Rovio\u003c/a\u003e in 2023. \u0026#34;They have deep knowledge of the global mobile business and they have very strong IP like \u003ca href=\"https://www.eurogamer.net/games/angry-birds\"\u003eAngry Birds\u003c/a\u003e,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s why the company is now working on the mobile party game Sonic Rumble, although \u003ca href=\"https://www.eurogamer.net/angry-birds-maker-and-sega-delay-sonic-rumble-release-once-again\"\u003ethis was delayed earlier this year\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAdded Utsumi: \u0026#34;We are giving [Rovio] access to our IPs including Sonic to come up with nice welcoming GaaS titles.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s important that Utsumi mentioned global business in his comments. Later in the interview, he discussed emerging countries as an opportunity for growth, particularly with mobile games - including the likes of countries in the Middle East and Africa.\u003c/p\u003e\n\u003cp\u003eSega did, of course, have looter shooter Hyenas from Creative Assembly, which was intended to be a live-service game. However, Hyenas \u003ca href=\"https://www.eurogamer.net/sega-has-cancelled-hyenas\"\u003ewas cancelled in 2023\u003c/a\u003e, due to \u0026#34;lower profitability of the European region\u0026#34;.\u003c/p\u003e\n\u003cp\u003eBack in 2022, \u003ca href=\"https://www.eurogamer.net/sega-is-aiming-to-create-a-super-game-by-march-2026\"\u003eSega announced the development of a \u0026#34;Super Game\u0026#34;\u003c/a\u003e, though little has been revealed since.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The ultimate goal in the \u0026#39;Super Game\u0026#39; strategy is to create a game so revolutionary that it attracts far more active users than any of the Group\u0026#39;s games to date,\u0026#34; reads the company\u0026#39;s strategy report from the time. \u0026#34;One key to achieving this goal is whether we can draw together a large community, involving not only players but also streamers who stream the game and viewers who watch their videos.\u003c/p\u003e\n\u003cp\u003e\u0026#34;That kind of community expands and further develops game content, adding value to the game that is unimagined by developers, and sparking a broader movement - which can then draw in even more users and grow the game\u0026#39;s presence dramatically.\u0026#34;\u003c/p\u003e\n\u003cp\u003eEarlier this month, \u003ca href=\"https://www.eurogamer.net/persona-5-the-phantom-x-coming-to-pc-and-mobile-next-month\"\u003eAtlus and Sega released Persona 5: The Phantom X\u003c/a\u003e on PC and mobile, a free-to-play gacha spin-off of its RPG series. Perhaps this could build on the heights of the Persona series to find global success.\u003c/p\u003e\n\u003cp\u003eSega isn\u0026#39;t alone in struggling with its live-service ambitions. Sony infamously cancelled Concord last year, as well as other unannounced projects. Still, \u003ca href=\"https://www.eurogamer.net/sony-remains-committed-to-diverse-and-resilient-live-service-games-including-forthcoming-marathon-and-fairgames-despite-high-profile-failures\"\u003ePlayStation\u0026#39;s Hermen Hulst recently stated the company remains committed to building \u0026#34;a diverse and resilient\u0026#34; portfolio of live service games\u003c/a\u003e - Marathon and Fairgames in particular.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-03T16:07:05.587617Z",
  "modifiedTime": null
}
