{
  "id": "21b47f4c-5db0-47df-a7ac-a3d816fa252a",
  "title": "We Say Goodbye To Andor, One Of The Best TV Shows Of 2025",
  "link": "https://kotaku.com/andor-season-2-ending-vgchat-star-wars-rogue-one-10-12-1851780720",
  "description": "Well, we’ve reached the end of the road. Andor’s second and final season brought us 12 episodes of (mostly) exceptional Star Wars drama released in three-episode chunks, a format which served the structure of the show brilliantly, with each chunk representing one year in the four years leading up to Rogue One, but…Read more...",
  "author": "Zack Zwiezen",
  "published": "Wed, 14 May 2025 20:45:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "andor",
    "draftandor season 1",
    "george lucas",
    "bix",
    "cassian andor",
    "tony gilroy",
    "partagaz",
    "rogue",
    "luthen rael",
    "star wars",
    "orson krennic",
    "rogue one",
    "rebel alliance",
    "dedra meero",
    "cassian",
    "palpatine",
    "carolyn petit",
    "rogue one",
    "disney",
    "saw gerrera",
    "ethan gach",
    "lonni",
    "tony gilroy and co",
    "luthen",
    "k 2so"
  ],
  "byline": "Zack Zwiezen",
  "length": 16327,
  "excerpt": "The Star Wars series wrapped up its second and final season last night with a bit of hope",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "Well, we’ve reached the end of the road. Andor’s second and final season brought us 12 episodes of (mostly) exceptional Star Wars drama released in three-episode chunks, a format which served the structure of the show brilliantly, with each chunk representing one year in the four years leading up to Rogue One, but also meant that we didn’t get to savor the show for nearly as long.Suggested ReadingFallout Season 2 Teaser Confirms Lucy and Ghoul are Heading to New VegasOffEnglishSuggested ReadingEach week, we’ve gathered to discuss our reactions to the show’s latest episodes (you can find last week’s conversation here), and now, we do so for the last time. Join us as we say goodbye to this extraordinary series. Ethan Gach: I’m in camp Kleya, who called her arrival on Yavin in the final stretch of Andor “a bitter ending,” but perhaps somewhat more consoled than she was by Cassian reassurance that “nothing’s ending.”The final three episodes of season 2 were always going to be somewhat disappointing and bittersweet since we knew the show was ending and in some cases we knew where it would need to funnel people to set up Rogue One, but the final chapter still managed a surprising amount of high-stakes tension and unexpected backstory. How would you both rate the final episodes and what are you feeling now that the journey’s over?Carolyn Petit: I thought episode 10, with its look at how Luthen and Kleya formed their bond and her undertaking the terrible task of doing what needed to be done, was outstanding. (It also gave us an alien who instantly became one of my favorite Star Wars creatures ever!) Episodes 11 and 12 weren’t peak Andor, but I have to admit that the final slow-motion montage sequence really worked for me, and they had a political dimension I found somewhat surprising that I’ll discuss a bit more later.Zack Zwiezen: I was worried that the final episode would run out of steam as Tony Gilroy and co literally ran out of space for storytelling and had to slam the brakes to set up Rogue One. And while I enjoyed the montage slow-walk, I wonder if that works if you haven’t seen Rogue One. But overall, the final three episodes are really good. And I think the Kleya-Luthen focused episode is one of my favorite Andor episodes ever. I’m so happy she got a big spotlight before the end.CP: Me, too. That episode also helped cement, I think, that the show recognizes how necessary all of Luthen’s efforts were, even if those fussy ineffectual bureaucrats on Yavin don’t. This is an issue I’ve long had with how Star Wars has at times sanded away its own political dimensions in my view, something that Andor not only seeks to undo but takes farther than ever before. In truth, the act of blowing up the Death Star in the first film, that act which people cheered for in theaters in 1977 and that Star Wars fans for decades since have loved and admired, would, in universe, be considered an act of terrorism. That’s what the Empire would call it. That’s what governments do: they present their own violence as “legitimate” or “necessary” and the violence of those rebelling against them as “terrorism.” But there were times in Star Wars history where I felt like the people at the reins of the franchise wanted to send a message that you shouldn’t be “too extreme” in your resistance, don’t be a Saw Gerrera, do it through “proper channels.” And so I loved that Andor gave us that scene with Bail and some other politicians all kind of hemming and hawing over Luthen while the show, I think, was emphatically telling all of us, “Luthen was right. Maybe not every single little decision he made was right, but his ethos was fundamentally right and without someone like him, none of this would have been here.” And I loved it for that.ZZ: I think, and they talk about this in the behind the scenes, it’s very important that Luthen’s fight against the empire was really because Kleya wanted revenge.CP: Right. She’s the humanity that he’s fighting for. She’s what radicalizes him.ZZ: If he hadn’t found her and saved her, Luthen likely doesn’t become the rebel we know in Andor. And it also adds a new layer of complexity to their relationship. He was part of the army that brutalized her people. So she still has some lingering hatred for him. And yet she does care about him. And in that moment when she sneaks into the hospital to finish the job, you can feel that.EG: I think that scene with the Rebel Alliance leaders also helps show the Senate mentality creeping back in as the insurgency professionalizes itself.It’s easy to see why even after defeating the Empire in key battles it might struggle to rebuild or retain power, issues explored in Ahsoka and The Mandalorian. These last few episodes help situate Cassian between the uncompromising logic of Luthen’s spycraft and the “no one left behind” mentality of the Rebellion. Luthen’s final sacrifice is to die, and Cassian’s is to go back and risk everything just to save someone.ZZ: We should rewind a bit and talk about that moment between Luthen and Dedra. Or even further actually, and pour one out for Lonni, who I knew was dead the moment he sat down at that bench.CP: Yeah. When he mentioned his wife and kid, for a moment I thought mayyyyyyyybe Luthen would be like “You know what? I owe this guy.” But alas, no.ZZ: I also loved that line Luthen gave Klaya before the meeting: “I think we used up all the perfect.” CP: So good.ZZ: And then we get Dedra Meero walking into Luthen’s shop as he’s destroying evidence. My wife literally gasped “OH SHIT!” at seeing Dedra at the door.EG: Only two artifacts may not be what they seem!CP: In a show that so often demands that characters put on a performance to blend into their surroundings, it was great seeing those two feel each other out and Luthen pretend for a bit that she was maybe not there to arrest him. But then, of course, he tries to kill himself, and you see that he was thinking a few steps ahead when he picked up the knife, though he made it seem like it was just part of their friendly dealings.ZZ: When he picked up the knife I was so distracted by him mentioning it being a Nautolan artifact (Kit Fisto’s species) that I didn’t realize why he picked a knife.CP: Hahaha, the perils of having a database of Star Wars knowledge in your brain!ZZ: And then after he’s taken to the hospital, we get that wonderful sequence with Klaya sneaking in and taking him off life support. Anybody else want a Hitman-like Star Wars game now?CP: If that alien Kleya pushes around as she’s pretending to be hospital personnel is in it, absolutely! But yes, that was a great infiltration sequence, both thrilling and kind of excruciating because we knew what she was going there to do.EG: It included some of the best Coruscant backdrops we’ve ever gotten, I think.CP: One other moment from that episode that I can’t stop thinking about was the flashback scene in which we see Imperial officers drag some civilians through town, put them up against a wall, and kill them. It was another gut-wrenching reminder of the Empire’s evil and another moment that felt weirdly resonant as more and more people are being arrested by agents who often won’t even show warrants or identification in the streets of our towns.ZZ: On the flipside of that horrible moment that made me feel a pit in my stomach, we have Dedra getting arrested for being reckless and not following orders by chasing after Luthen long after she was supposed to be off the Axis investigation. I have to admit I smiled when I realized it was all over for her.CP: Man, I don’t know. I mean I absolutely hate her, don’t get me wrong, and yet that final shot of her, where we see that she’s in a prison very much like the one Cassian was in last season (if not the same one) was complicated for me. Like, I think that kind of incarceration is just wrong in and of itself and so it elicited this weird moment of something like sympathy for her, which in no way means I forgive her for what she’s done. It’s just one of those reminders that it’s ultimately a systemic evil that will sometimes grind up the people operating inside of it and supporting it as much as those being actively persecuted.The leopards ate her face, in other words.ZZ: Space leopards.But I agree, yes, that the Empire is evil and the way it operates (like many real-world countries) is to crush people up to fuel the fires of growth and war. And I think it was very arrogant of her to believe she would be spared. Or maybe she truly bought into the lies that the Empire was good and doing the right thing? Surely, she won’t end up in some horrible place and left to rot forever.CP: Yep.ZZ: Meanwhile, her boss, after all of these failures and letting the info on the Death Star slip out, realizes what’s coming for him and knows he doesn’t want to be ripped apart by the machine he helped create. And takes an easier way out. CP: That was the first and only indication we ever got that Nemik’s manifesto is actually spreading around, right, that people are listening to it? That was a cool moment, I thought, where at first we think it’s non-diegetic, just the writers and filmmakers reminding us one last time of Nemik’s stirring words, but then we see, oh, no, Partagaz was actually listening to it, the fire is spreading. It’s out there.EG: I loved the scene right outside when the gun shot goes off.CP: Yeah, so clear that the guy knew Partagaz wasn’t just taking a moment to “collect his thoughts,” he knew exactly what was coming.ZZ: The slight “stand down” gesture to the troopers.EG: I appreciate the minor moments of humanity Andor evokes even between the worst people.CP: Yeah, they’re essential IMO.ZZ: It makes them more evil. They are human beings. People with feelings and thoughts. And yet they still do this shit.EG: Something also given to Krennic when he and Partagaz wish each other luck at facing Palpatine’s wrath. Unlike the more buffoonish bad guy energy he gives off in Rogue One.ZZ: Also, very fun to see a character call out the Death Star name. Partagaz thinks its dumb.ZZ: I’m so happy to see K-2SO back!CP: Yes. Not unlike C-3P0 he can be so exasperating at times (in an endearing and funny way), but when he goes full Terminator on Empire goons, man it feels good.For me, the whole tone of the scene with Andor and Melshi in the safehouse with Kleya and the communications jammed changed from “Oh shit, oh shit, get outta there!” to “LMAO y’all are about to get owned” as soon as K-2SO left the ship to go in for them, and it was glorious.ZZ: Yeah. The moment K-2SO shows up, it’s basically over for those imperial assholes and I loved it so much. I also like that the show uses its limited time with K-2SO to really develop a relationship between him and Cassian. They seem like buds!The part where they are playing space poker or whatever was great. Gilroy mentioned that after Bix leaves the place becomes a frat house, with Melshi moving in and them all drinking and partying between missions.CP: Ah, that totally makes sense!ZZ: I wonder if Andor is trying to drink away some pain and fill his life with friends to deal with losing Bix? That’s my read. He needs some buds and suds.CP: Definitely. There’s a part of me that still feels like Andor, the title character, could have maybe used a little bit more character development in this show, that with all of its moving pieces his own journey, both ideologically and as a person, maybe got a smidge sidelined. But I do like that we see him dreaming about his sister, since finding her was the big obsession driving him in the early episodes of season one. Now, I feel like he’s accepted that she’s gone but still the idea of her, his depth of feeling for her and the pain of losing her is part of what drives him to create a better world, not entirely unlike Luthen being driven by his love for Kleya. And speaking of love and the things that drive us, how did y’all feel about that final-final image of the show?ZZ: I loved it! To me it worked perfectly with a theme in Andor: hope.EG: “There is another.” lmao.CP: Right, to me it did in part feel like a nod to Star Wars’ obsession with dynasties and legacies, like we have to believe that, though Andor himself dies, what he stands for will live on not just as an idea but because he literally has a child. And yet, I still kinda liked it. We didn’t get a lightsaber but we did get a continued bloodline!ZZ: I think the show needed some hope at the end.EG: I think it was very thematically appropriate, even if I’m torn on the merits of mixing insurgency and family. It’s a division that feels a bit too tidy.ZZ: I think it did provide more reason for Bix leaving like she did. She was pregnant. She wanted to give her child a peaceful life and knew Andor would follow her if he knew. And in her mind, she’s thinking that they’ll get back together one day after the Empire has fallen. It’s both a very tragic final scene and also this reminder that there is more. This isn’t an ending.Screenshot: Lucasfilm / KotakuCP: Vel even tells him not to wait too long to reconnect, and we already know he never gets the chance! Really loved that those two, Cassian and Vel, got a moment here, too, and got to acknowledge all those they’ve lost along the way. But yes, you’re right, it was a lovely mix of deeply sad and hopeful, that final image. Luthen, Cassian, Saw, and so many others know they’re fighting for a world they themselves will likely not live to see. But that kid might.ZZ: And before we leave, I did like that we got one more tiny moment with Mon’s husbasndHe seems to be with the mother of the boy his daughter married? It was very fast. Couldn’t tell. But him just getting drunk in a limo on Coruscant, presumably throwing his wife under the bus and pledging loyalty to the Empire, seemed like all we needed to know about what happened to him.CP: Exactly. He is who we knew he was and his sad empty privileged life is his reward for it.I’d be curious to know how that final montage plays for folks who haven’t seen Rogue One. It really worked for me, seeing Cassian all dressed up for his fateful mission, the cuts to Dedra and other characters, and all around him, the Rebel base on Yavin, active and buzzing, about to change the galaxy, and now we know it’s all because of the efforts of so many people but among them, one Luthen Rael, an unsung hero of Star Wars. Are either of you planning on rewatching Rogue One any time soon?ZZ: I wanted to hold off until after this VG chat so I came into this without the weight of Rogue One on my mind. I plan on watching it this weekend! EG: I will say, as a parting thought, I don’t know that I needed the show to try and line up so neatly with Rogue One, perhaps the worst part of which is that silly blueprint handoff that directly leads into A New Hope. I do think some of the broader thrust of Andor and the unease and disquiet within its characters ended up being subsumed a little to neatly by the end of episode 12.CP: Oh, I agree. At a certain point in the final episode you really feel the show shift into “Okay, let’s get all the pieces in place for Rogue One” mode.ZZ: Yeah. It reminds me of the ending of Star Wars Episode III, where George Lucas sets up all the pieces for A New Hope and it feels less like an actual ending and more like a checkpoint.CP: And I think heading right from Andor into Rogue One will be quite jarring because—sorry Rogue One!—your dialogue is just not on the same level!ZZ: Nope! And what happened to Bail Organa! Did he get a haircut?CP: Hahaha.ZZ: But really, if that’s my biggest complaint about Andor—that its ending isn’t as strong as it could have been because of Rogue One—I’m still really happy.I’m not sure we’ll ever get a show like this again, or at least not for a long time. Real sets. Lots of actors. Incredible writing. Big budgets. Set in a large franchise. All this freedom. Even Gilroy has stated he’s not sure if this kind of thing will ever happen again.CP: It was glorious, and while I really hope we see more like it, I’ll try to just be grateful for the miracle that we ever got it at all. Now I just need Disney to put it on Blu-ray so I have it on physical media and it’s not trapped on a streaming service forever!ZZ: Rebellions and physical libraries of movies we love are built on hope. .",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/fbd62f29d1b04c370e458396c41549b8.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWell, we’ve reached the end of the road. \u003cem\u003eAndor\u003c/em\u003e’s second and final season brought us 12 episodes of (mostly) exceptional \u003cem\u003eStar Wars\u003c/em\u003e drama released in three-episode chunks, a format which served the structure of the show brilliantly, with each chunk representing one year in the four years leading up to \u003cem\u003eRogue One\u003c/em\u003e, but also meant that we didn’t get to savor the show for nearly as long.\u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"197564\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Fallout Season 2 Teaser Confirms Lucy and Ghoul are Heading to New Vegas\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"106\" data-playlist=\"197564,197562,197559\" data-current=\"197564\"\u003e\u003cdiv\u003e\u003cp\u003eFallout Season 2 Teaser Confirms Lucy and Ghoul are Heading to New Vegas\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197564/197564_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197564/197564_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197564/197564_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003ctrack kind=\"captions\" label=\"English\" src=\"https://kinja.com/api/videoupload/caption/23088.vtt\" srclang=\"en\"/\u003e\u003c/video\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-label=\"\"\u003eOff\u003c/li\u003e\u003cli data-label=\"English\"\u003eEnglish\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eEach week, we’ve gathered to discuss our reactions to the show’s latest episodes (you can find \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/andor-s2-episode-7-8-9-review-vgchat-recap-star-wars-1851780084\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/andor-s2-episode-7-8-9-review-vgchat-recap-star-wars-1851780084\" target=\"_blank\"\u003elast week’s conversation here\u003c/a\u003e\u003c/span\u003e), and now, we do so for the last time. Join us as we say goodbye to this extraordinary series. \u003c/p\u003e\u003cfigure id=\"\" data-id=\"afpvuwnfoibrncd6upmy\" data-recommend-id=\"image://afpvuwnfoibrncd6upmy\" data-format=\"png\" data-width=\"800\" data-height=\"88\" data-lightbox=\"true\" data-recommended=\"false\" data-hide=\"false\" contenteditable=\"false\" draggable=\"false\"\u003e\u003cp\u003e\u003cspan\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 37.31em)\" type=\"image/jpeg\" srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" data-srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/afpvuwnfoibrncd6upmy.jpg\"/\u003e\u003csource media=\"(min-width: 37.37em)\" type=\"image/jpeg\" srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" data-srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1315/afpvuwnfoibrncd6upmy.jpg\"/\u003e\u003cimg alt=\"Image for article titled We Say Goodbye To Andor, One Of The Best TV Shows Of 2025\" data-chomp-id=\"afpvuwnfoibrncd6upmy\" data-format=\"png\" data-height=\"88\" data-alt=\"Image for article titled We Say Goodbye To Andor, One Of The Best TV Shows Of 2025\" data-anim-src=\"\" data-src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/afpvuwnfoibrncd6upmy.jpg\" src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/afpvuwnfoibrncd6upmy.jpg\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/span\u003e\u003c/p\u003e\u003cspan data-id=\"afpvuwnfoibrncd6upmy\" data-recommend-id=\"image://afpvuwnfoibrncd6upmy\" data-format=\"png\" data-width=\"800\" data-height=\"88\" data-lightbox=\"true\" data-recommended=\"false\" data-hide=\"false\"\u003e\u003c/span\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eEthan Gach:\u003c/strong\u003e I’m in camp Kleya, who called her arrival on Yavin in the final stretch of \u003cem\u003eAndor \u003c/em\u003e“a bitter ending,” but perhaps somewhat more consoled than she was by Cassian reassurance that “nothing’s ending.”\u003c/p\u003e\u003cp\u003eThe final three episodes of season 2 were always going to be somewhat disappointing and bittersweet since we knew the show was ending and in some cases we knew where it would need to funnel people to set up \u003cem\u003eRogue One,\u003c/em\u003e but the final chapter still managed a surprising amount of high-stakes tension and unexpected backstory. \u003c/p\u003e\u003cp\u003eHow would you both rate the final episodes and what are you feeling now that the journey’s over?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCarolyn Petit: \u003c/strong\u003eI thought episode 10, with its look at how Luthen and Kleya formed their bond and her undertaking the terrible task of doing what needed to be done, was outstanding. (It also gave us an alien who instantly became one of my favorite \u003cem\u003eStar Wars \u003c/em\u003ecreatures ever!) \u003c/p\u003e\u003cp\u003eEpisodes 11 and 12 weren’t peak \u003cem\u003eAndor\u003c/em\u003e, but I have to admit that the final slow-motion montage sequence really worked for me, and they had a political dimension I found somewhat surprising that I’ll discuss a bit more later.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZack Zwiezen:\u003c/strong\u003e I was worried that the final episode would run out of steam as Tony Gilroy and co literally ran out of space for storytelling and had to slam the brakes to set up \u003cem\u003eRogue One. \u003c/em\u003eAnd while I enjoyed the montage slow-walk, I wonder if that works if you haven’t seen \u003cem\u003eRogue One\u003c/em\u003e. \u003c/p\u003e\u003cp\u003eBut overall, the final three episodes are really good. And I think the Kleya-Luthen focused episode is one of my favorite \u003cem\u003eAndor \u003c/em\u003eepisodes ever. I’m so happy she got a big spotlight before the end.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eMe, too. That episode also helped cement, I think, that the show recognizes how necessary all of Luthen’s efforts were, even if those fussy ineffectual bureaucrats on Yavin don’t. \u003c/p\u003e\u003cp\u003eThis is an issue I’ve long had with how \u003cem\u003eStar Wars\u003c/em\u003e has at times sanded away its own political dimensions in my view, something that \u003cem\u003eAndor \u003c/em\u003enot only seeks to undo but takes farther than ever before. In truth, the act of blowing up the Death Star in the first film, that act which people cheered for in theaters in 1977 and that \u003cem\u003eStar Wars\u003c/em\u003e fans for decades since have loved and admired, would, in universe, be considered an act of terrorism. That’s what the Empire would call it. That’s what governments do: they present their own violence as “legitimate” or “necessary” and the violence of those rebelling against them as “terrorism.” \u003c/p\u003e\u003cp\u003eBut there were times in \u003cem\u003eStar Wars\u003c/em\u003e history where I felt like the people at the reins of the franchise wanted to send a message that you shouldn’t be “too extreme” in your resistance, don’t be a Saw Gerrera, do it through “proper channels.” And so I loved that \u003cem\u003eAndor \u003c/em\u003egave us that scene with Bail and some other politicians all kind of hemming and hawing over Luthen while the show, I think, was emphatically telling all of us, “Luthen was right. Maybe not every single little decision he made was right, but his ethos was fundamentally right and without someone like him, none of this would have been here.” And I loved it for that.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e I think, and they talk about this in the behind the scenes, it’s very important that Luthen’s fight against the empire was really because Kleya wanted revenge.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Right. She’s the humanity that he’s fighting for. She’s what radicalizes him.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eIf he hadn’t found her and saved her, Luthen likely doesn’t become the rebel we know in \u003cem\u003eAndor\u003c/em\u003e. And it also adds a new layer of complexity to their relationship. He was part of the army that brutalized her people. So she still has some lingering hatred for him. And yet she does care about him. And in that moment when she sneaks into the hospital to finish the job, you can feel that.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG:\u003c/strong\u003e I think that scene with the Rebel Alliance leaders also helps show the Senate mentality creeping back in as the insurgency professionalizes itself.\u003c/p\u003e\u003cp\u003eIt’s easy to see why even after defeating the Empire in key battles it might struggle to rebuild or retain power, issues explored in \u003cem\u003eAhsoka \u003c/em\u003eand \u003cem\u003eThe Mandalorian\u003c/em\u003e. These last few episodes help situate Cassian between the uncompromising logic of Luthen’s spycraft and the “no one left behind” mentality of the Rebellion. Luthen’s final sacrifice is to die, and Cassian’s is to go back and risk everything just to save someone.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eWe should rewind a bit and talk about that moment between Luthen and Dedra. Or even further actually, and pour one out for Lonni, who I knew was dead the moment he sat down at that bench.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eYeah. When he mentioned his wife and kid, for a moment I thought mayyyyyyyybe Luthen would be like “You know what? I owe this guy.” But alas, no.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e I also loved that line Luthen gave Klaya before the meeting: “I think we used up all the perfect.” \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e So good.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e And then we get Dedra Meero walking into Luthen’s shop as he’s destroying evidence. My wife literally gasped “OH SHIT!” at seeing Dedra at the door.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG: \u003c/strong\u003eOnly two artifacts may not be what they seem!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e In a show that so often demands that characters put on a performance to blend into their surroundings, it was great seeing those two feel each other out and Luthen pretend for a bit that she was maybe not there to arrest him. \u003c/p\u003e\u003cp\u003eBut then, of course, he tries to kill himself, and you see that he was thinking a few steps ahead when he picked up the knife, though he made it seem like it was just part of their friendly dealings.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e When he picked up the knife I was so distracted by him mentioning it being a Nautolan artifact (Kit Fisto’s species) that I didn’t realize why he picked a knife.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Hahaha, the perils of having a database of\u003cem\u003e Star Wars\u003c/em\u003e knowledge in your brain!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e And then after he’s taken to the hospital, we get that wonderful sequence with Klaya sneaking in and taking him off life support. Anybody else want a \u003cem\u003eHitman\u003c/em\u003e-like \u003cem\u003eStar Wars\u003c/em\u003e game now?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e If that alien Kleya pushes around as she’s pretending to be hospital personnel is in it, absolutely! But yes, that was a great infiltration sequence, both thrilling and kind of excruciating because we knew what she was going there to do.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG:\u003c/strong\u003e It included some of the best Coruscant backdrops we’ve ever gotten, I think.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e One other moment from that episode that I can’t stop thinking about was the flashback scene in which we see Imperial officers drag some civilians through town, put them up against a wall, and kill them. \u003c/p\u003e\u003cp\u003eIt was another gut-wrenching reminder of the Empire’s evil and another moment that felt weirdly resonant as more and more people are being arrested by agents who often won’t even show warrants or identification in the streets of our towns.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e On the flipside of that horrible moment that made me feel a pit in my stomach, we have Dedra getting arrested for being reckless and not following orders by chasing after Luthen long after she was supposed to be off the Axis investigation. I have to admit I smiled when I realized it was all over for her.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Man, I don’t know. I mean I absolutely hate her, don’t get me wrong, and yet that final shot of her, where we see that she’s in a prison very much like the one Cassian was in last season (if not the same one) was complicated for me. Like, I think that kind of incarceration is just wrong in and of itself and so it elicited this weird moment of something like sympathy for her, which in no way means I forgive her for what she’s done. It’s just one of those reminders that it’s ultimately a systemic evil that will sometimes grind up the people operating inside of it and supporting it as much as those being actively persecuted.\u003c/p\u003e\u003cp\u003eThe leopards ate her face, in other words.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eSpace leopards.\u003c/p\u003e\u003cp\u003eBut I agree, yes, that the Empire is evil and the way it operates (like many real-world countries) is to crush people up to fuel the fires of growth and war. And I think it was very arrogant of her to believe she would be spared. Or maybe she truly bought into the lies that the Empire was good and doing the right thing? Surely, she won’t end up in some horrible place and left to rot forever.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eYep.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eMeanwhile, her boss, after all of these failures and letting the info on the Death Star slip out, realizes what’s coming for him and knows he doesn’t want to be ripped apart by the machine he helped create. And takes an easier way out. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e That was the first and only indication we ever got that Nemik’s manifesto is actually spreading around, right, that people are listening to it? That was a cool moment, I thought, where at first we think it’s non-diegetic, just the writers and filmmakers reminding us one last time of Nemik’s stirring words, but then we see, oh, no, Partagaz was actually listening to it, the fire is spreading. It’s out there.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG: \u003c/strong\u003eI loved the scene right outside when the gun shot goes off.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eYeah, so clear that the guy knew Partagaz wasn’t just taking a moment to “collect his thoughts,” he knew exactly what was coming.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eThe slight “stand down” gesture to the troopers.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG: \u003c/strong\u003eI appreciate the minor moments of humanity \u003cem\u003eAndor \u003c/em\u003eevokes even between the worst people.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eYeah, they’re essential IMO.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e It makes them more evil. They are human beings. People with feelings and thoughts. And yet they still do this shit.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG:\u003c/strong\u003e Something also given to Krennic when he and Partagaz wish each other luck at facing Palpatine’s wrath. Unlike the more buffoonish bad guy energy he gives off in \u003cem\u003eRogue One\u003c/em\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e Also, very fun to see a character call out the Death Star name. Partagaz thinks its dumb.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e I’m so happy to see K-2SO back!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Yes. Not unlike C-3P0 he can be so exasperating at times (in an endearing and funny way), but when he goes full Terminator on Empire goons, man it feels good.\u003c/p\u003e\u003cp\u003eFor me, the whole tone of the scene with Andor and Melshi in the safehouse with Kleya and the communications jammed changed from “Oh shit, oh shit, get outta there!” to “LMAO y’all are about to get owned” as soon as K-2SO left the ship to go in for them, and it was glorious.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e Yeah. The moment K-2SO shows up, it’s basically over for those imperial assholes and I loved it so much. I also like that the show uses its limited time with K-2SO to really develop a relationship between him and Cassian. They seem like buds!\u003c/p\u003e\u003cp\u003eThe part where they are playing space poker or whatever was great. Gilroy mentioned that after Bix leaves the place becomes a frat house, with Melshi moving in and them all drinking and partying between missions.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eAh, that totally makes sense!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e I wonder if Andor is trying to drink away some pain and fill his life with friends to deal with losing Bix? That’s my read. He needs some buds and suds.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eDefinitely. \u003c/p\u003e\u003cp\u003eThere’s a part of me that still feels like Andor, the title character, could have maybe used a little bit more character development in this show, that with all of its moving pieces his own journey, both ideologically and as a person, maybe got a smidge sidelined. But I do like that we see him dreaming about his sister, since finding her was the big obsession driving him in the early episodes of season one. \u003c/p\u003e\u003cp\u003eNow, I feel like he’s accepted that she’s gone but still the idea of her, his depth of feeling for her and the pain of losing her is part of what drives him to create a better world, not entirely unlike Luthen being driven by his love for Kleya. And speaking of love and the things that drive us, how did y’all feel about that final-final image of the show?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eI loved it! To me it worked perfectly with a theme in \u003cem\u003eAndor\u003c/em\u003e: hope.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG:\u003c/strong\u003e “There is another.” lmao.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Right, to me it did in part feel like a nod to \u003cem\u003eStar Wars\u003c/em\u003e’ obsession with dynasties and legacies, like we have to believe that, though Andor himself dies, what he stands for will live on not just as an idea but because he literally has a child. And yet, I still kinda liked it. We didn’t get a lightsaber but we did get a continued bloodline!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e I think the show needed some hope at the end.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG:\u003c/strong\u003e I think it was very thematically appropriate, even if I’m torn on the merits of mixing insurgency and family. It’s a division that feels a bit too tidy.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ: \u003c/strong\u003eI think it did provide more reason for Bix leaving like she did. She was pregnant. She wanted to give her child a peaceful life and knew Andor would follow her if he knew. And in her mind, she’s thinking that they’ll get back together one day after the Empire has fallen. It’s both a very tragic final scene and also this reminder that there is more. This isn’t an ending.\u003c/p\u003e\u003cfigure id=\"\" data-id=\"fad46f7e30d05a59aba45bbdb8a7cd39\" data-recommend-id=\"image://fad46f7e30d05a59aba45bbdb8a7cd39\" data-format=\"jpg\" data-width=\"1920\" data-height=\"1080\" data-lightbox=\"true\" data-recommended=\"false\" data-hide=\"false\" contenteditable=\"false\" draggable=\"false\"\u003e\u003cdiv contenteditable=\"false\" data-link-reference=\"\" data-link-target=\"\" data-syndicationrights=\"true\" data-imagerights=\"fair-use\" data-hide=\"false\" data-hidecredit=\"false\"\u003e\u003cp\u003e\u003cspan\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 37.31em)\" type=\"image/jpeg\" srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" data-srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/fad46f7e30d05a59aba45bbdb8a7cd39.jpg\"/\u003e\u003csource media=\"(min-width: 37.37em)\" type=\"image/jpeg\" srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" data-srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1315/fad46f7e30d05a59aba45bbdb8a7cd39.jpg\"/\u003e\u003cimg alt=\"Image for article titled We Say Goodbye To Andor, One Of The Best TV Shows Of 2025\" data-chomp-id=\"fad46f7e30d05a59aba45bbdb8a7cd39\" data-format=\"jpg\" data-height=\"1080\" data-alt=\"Image for article titled We Say Goodbye To Andor, One Of The Best TV Shows Of 2025\" data-anim-src=\"\" data-src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/fad46f7e30d05a59aba45bbdb8a7cd39.jpg\" src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/fad46f7e30d05a59aba45bbdb8a7cd39.jpg\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cfigcaption\u003eScreenshot: Lucasfilm / Kotaku\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cspan data-id=\"fad46f7e30d05a59aba45bbdb8a7cd39\" data-recommend-id=\"image://fad46f7e30d05a59aba45bbdb8a7cd39\" data-format=\"jpg\" data-width=\"1920\" data-height=\"1080\" data-lightbox=\"true\" data-recommended=\"false\" data-hide=\"false\"\u003e\u003c/span\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Vel even tells him not to wait too long to reconnect, and we already know he never gets the chance! Really loved that those two, Cassian and Vel, got a moment here, too, and got to acknowledge all those they’ve lost along the way. \u003c/p\u003e\u003cp\u003eBut yes, you’re right, it was a lovely mix of deeply sad and hopeful, that final image. Luthen, Cassian, Saw, and so many others know they’re fighting for a world they themselves will likely not live to see. But that kid might.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e And before we leave, I did like that we got one more tiny moment with Mon’s husbasnd\u003c/p\u003e\u003cp\u003eHe seems to be with the mother of the boy his daughter married? It was very fast. Couldn’t tell. But him just getting drunk in a limo on Coruscant, presumably throwing his wife under the bus and pledging loyalty to the Empire, seemed like all we needed to know about what happened to him.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Exactly. He is who we knew he was and his sad empty privileged life is his reward for it.\u003c/p\u003e\u003cp\u003eI’d be curious to know how that final montage plays for folks who haven’t seen \u003cem\u003eRogue One\u003c/em\u003e. It really worked for me, seeing Cassian all dressed up for his fateful mission, the cuts to Dedra and other characters, and all around him, the Rebel base on Yavin, active and buzzing, about to change the galaxy, and now we know it’s all because of the efforts of so many people but among them, one Luthen Rael, an unsung hero of \u003cem\u003eStar Wars.\u003c/em\u003e Are either of you planning on rewatching \u003cem\u003eRogue One\u003c/em\u003e any time soon?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e I wanted to hold off until after this VG chat so I came into this without the weight of \u003cem\u003eRogue One \u003c/em\u003eon my mind. I plan on watching it this weekend! \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEG:\u003c/strong\u003e I will say, as a parting thought, I don’t know that I needed the show to try and line up so neatly with \u003cem\u003eRogue One,\u003c/em\u003e perhaps the worst part of which is that silly blueprint handoff that directly leads into \u003cem\u003eA New Hope.\u003c/em\u003e I do think some of the broader thrust of \u003cem\u003eAndor \u003c/em\u003eand the unease and disquiet within its characters ended up being subsumed a little to neatly by the end of episode 12.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP: \u003c/strong\u003eOh, I agree. At a certain point in the final episode you really feel the show shift into “Okay, let’s get all the pieces in place for \u003cem\u003eRogue On\u003c/em\u003ee” mode.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e Yeah. It reminds me of the ending of \u003cem\u003eStar Wars Episode III\u003c/em\u003e, where George Lucas sets up all the pieces for \u003cem\u003eA New Hope \u003c/em\u003eand it feels less like an actual ending and more like a checkpoint.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e And I think heading right from \u003cem\u003eAndor \u003c/em\u003einto \u003cem\u003eRogue One\u003c/em\u003e will be quite jarring because—sorry \u003cem\u003eRogue On\u003c/em\u003ee!—your dialogue is just not on the same level!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e Nope! And what happened to Bail Organa! Did he get a haircut?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e Hahaha.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e But really, if that’s my biggest complaint about \u003cem\u003eAndor\u003c/em\u003e—that its ending isn’t as strong as it could have been because of \u003cem\u003eRogue One\u003c/em\u003e—I’m still really happy.\u003c/p\u003e\u003cp\u003eI’m not sure we’ll ever get a show like this again, or at least not for a long time. Real sets. Lots of actors. Incredible writing. Big budgets. Set in a large franchise. All this freedom. Even Gilroy has stated he’s not sure if this kind of thing will ever happen again.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCP:\u003c/strong\u003e It was glorious, and while I really hope we see more like it, I’ll try to just be grateful for the miracle that we ever got it at all. Now I just need Disney to put it on Blu-ray so I have it on physical media and it’s not trapped on a streaming service forever!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eZZ:\u003c/strong\u003e Rebellions and physical libraries of movies we love are built on hope. \u003c/p\u003e\u003cp\u003e .\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-05-14T16:45:00-04:00",
  "modifiedTime": null
}
