{
  "id": "25e0deb9-82b9-4af1-9d15-9a83fc10465d",
  "title": "Cozy road trip adventure Outbound is coming To PS5",
  "link": "https://blog.playstation.com/2025/07/24/cozy-road-trip-adventure-outbound-is-coming-to-ps5/",
  "description": "Hi there. Square Glade Games here! We’re excited to share that we’re bringing Outbound, our cozy open-world exploration game, to PlayStation 5. Alone or with up to four players, Outbound starts you off with an empty camper van and sets you off on a journey to scavenge, craft, and build up your dream home as […]",
  "author": "Marc Volger",
  "published": "Thu, 24 Jul 2025 15:00:07 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PS5",
    "Outbound",
    "Square Glade Games"
  ],
  "byline": "Adam Michel Director, Game Services – Content, Sony Interactive Entertainment",
  "length": 4036,
  "excerpt": "The Square Glade Games co-founders share insights into their upcoming open-world “cozyvival” adventure.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjEEIaCXVzLWVhc3QtMSJGMEQCICnBx9ibIYrHLKhtzBIo0OxQ6YHXu8iAKc1KOMEFmnd1AiB0bOCOofoCVCSRxzWxZc21g0rAKi0JRlnZTXuZMYtzeyr9AwhqEAAaDDU3NzQxODgxODQxMyIMqQWGFSlhXEaj8Go7KtoDxIgqig5Sugyq9sHkFtrSX04g6rBO6b3AX1pzOpwjlXrT2vyP3JGPj4j5pAK8Cbo%252Bvj8PPlLUeem%252F%252BKOgc6kS0v7GDrWm%252Bvg4CwvNnujIT3gLKkRptYksU0R8nMSpjW8ncVKZhKyWu2V%252B5V4kEUoHt9vHboxaEgpSt5zSd7AcoIEwZKLhqwcad8hFfxIU3%252BS5fGPUwDs2gqulqfp%252BnITJU%252FR0qZBX4fMcIsz3cFLyBm5HvL08z0FfXjam%252BRgbgiNisxfLhSnI9fvtsbbpafuRYJuzsTS5Pd%252Fo756obsUMG2OQa21Fs531pUUcDVkt%252FgdgpoJh0%252FKD514cqAkkMOChCE5Oo7I0AHA9pA2wOcBJ9IRgY2epx%252BzDDOCQJXNU%252BsqmcdHa50AQtrjZDvBmJ2X%252Btba5i6GpNQz2tIJ7V44YT0Ydpr2ODCWX%252Fz3LKzhmDNMIhLqQTUkuCDxiY%252B5aqYj1BYJxCrHrM65BFhMyDwPy08IxI3kJMmSzDk2BOpCUrxci%252Bka8aoOYJ8ViMup5gkUStz8EltnxbivKnipSHrxfWI9Gk8I5B8boMz1MVcfO%252BX%252BpG%252FOJHDYJh0iKdVRmU%252Fs6d4zj2hBPaq5D2FPDapKSIUYdmE8%252F4s7Bj48BMJP9lcQGOqYBBfAMM7QKMb2uIxJmYO4ipNhWwvDsRWPYVXV%252FdyWDOuCDZ0kuerryrVmODg9KrCh8Wo3awYi8S8VQJDHS1h9ve9anQdbXHwmEERUZKaVRYsIgAUu5nekcN9kYmz9shy1T4LmXGCuinVK1hYya7myM2go9NHFbZ%252F6YmdFlbra34F4j93J8BzOo1N8iUgAtoBSIsnTP0%252FxFw%252Fai%252BcaD7ZG5OznkmRbYig%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NW4U3HLN3H%252F20250727%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20250727T013059Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3D827829a316a2e6ac8c51da59b984f62cc012c6600f24ddc7f893a0237603b67f\u0026fit=192%2C192",
  "text": "Hi there. Square Glade Games here! We’re excited to share that we’re bringing Outbound, our cozy open-world exploration game, to PlayStation 5. Alone or with up to four players, Outbound starts you off with an empty camper van and sets you off on a journey to scavenge, craft, and build up your dream home as you adapt to the changing environment.  I’m Marc Volger, co-founder of our studio, and I’m here to introduce Outbound to our wonderful PlayStation community, giving a deeper look into what you can do in our title, along with help from my fellow co-founder, Tobi Schnackenberg, who will share a bit about the inspiration behind our upcoming game. Outbound is a “cozyvival,” a term our team started using after Alpha testing when we stepped back and took a look at what players found enjoyable. We found that they fell in love with the satisfying survival mechanics, like managing energy, gathering materials, and growing food, paired with the cozy, low-pressure vibe of living in the van. Other titles tend to lean further into one end of the spectrum or the other, but we feel cozyvival perfectly expresses that balance our players enjoy — that’s the sweet spot where Outbound is found. Chill solo adventure or cheery multiplayer road trip? As a solo player, Outbound gives you a wonderful off-grid feeling, where you’re gathering resources and building up your camper van at your own pace. You’re the captain of your own ship, so to speak, and it gives you a sense of calm and empowerment. Outbound can also be played with up to three other friends; however, it changes the DNA of the experience in a significant way. With others along for the ride, friendly cooperation can turn Outbound into more of a high-energy road trip, very much like when you go on road trips with friends in real life. We loved to see that energy change, so while not required, multiplayer is a key addition from our perspective. We also recognized, as we brought Outbound over to PS5, that we had an opportunity to take advantage of the PlayStation Portal, as the PlayStation ecosystem doesn’t require any optimization to be Portal ready. We absolutely love the idea of a group of friends sitting together with Portal devices, playing together. The ease of carrying it with you (on a road trip, maybe) is something we hope our players will cherish. Grand fields of inspiration “Part of the inspiration for Outbound came when I was on a road trip of my own from Germany to the Netherlands,” says Tobi. “And I saw a beautiful old-school camper van as it drove by a field of solar panels and windmills. We were in the prototyping stage at that point, and this moment sparked the idea of building it around an electric van with sustainability in mind.” “Thus, sustainability is a huge theme that we’ve woven into the design,” Tobi continues. “The sun, wind, and rain are key sources of energy, and recycling litter earns you new blueprints for van upgrades. Those are merely a couple of ways Outbound shines a light on sustainability through gameplay, and we inject that energy aesthetically, as well, like how we show sailboats on the horizon as opposed to massive tankers and cargo ships.” Pet that good pup For the dog fans out there, you do have one with you on your Outbound journey, and, yes, you can pet the dog. This functional companion, which you adopt and name yourself, brings another layer to the cozyvival experience — players can teach them to fetch resources, carry them back to the vehicle, and more. They’re not there just to be an incredibly cute face. Video games are often platforms that catapult us into far-reaching fantasies, dropping us into glorious worlds where we take on fantastic creatures with weapons and magic. Other adventures tap into fantasies that are a bit more grounded in our reality, and that is where Outbound lives. We’re looking forward to setting you all off on a glorious adventure when Outbound comes to PlayStation 5. Trending Stories",
  "image": "https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-407995\"\u003e\n\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\n\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"1088\" height=\"612\" src=\"https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\" alt=\"Cozy road trip adventure Outbound is coming To PS5\" sizes=\"(min-width: 1170px) 936px, (min-width: 960px) 80vw, 100vw\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1 1088w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.99 1077w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.75 816w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.61 664w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.49 533w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.41 446w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.32 348w, https://blog.playstation.com/tachyon/2028/07/d20af4b31b664831b96d9f9fdf2692b6bdda48b5.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.25 272w\"/\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cp\u003eHi there. Square Glade Games here! We’re excited to share that we’re bringing \u003ca href=\"https://store.playstation.com/concept/10016008\"\u003eOutbound\u003c/a\u003e, our cozy open-world exploration game, to PlayStation 5. Alone or with up to four players, Outbound starts you off with an empty camper van and sets you off on a journey to scavenge, craft, and build up your dream home as you adapt to the changing environment. \u003c/p\u003e\n\n\n\n\u003cp\u003eI’m Marc Volger, co-founder of our studio, and I’m here to introduce Outbound to our wonderful PlayStation community, giving a deeper look into what you can do in our title, along with help from my fellow co-founder, Tobi Schnackenberg, who will share a bit about the inspiration behind our upcoming game.\u003c/p\u003e\n\n\n\n\u003cp\u003eOutbound is a “cozyvival,” a term our team started using after Alpha testing when we stepped back and took a look at what players found enjoyable. We found that they fell in love with the satisfying survival mechanics, like managing energy, gathering materials, and growing food, paired with the cozy, low-pressure vibe of living in the van. Other titles tend to lean further into one end of the spectrum or the other, but we feel cozyvival perfectly expresses that balance our players enjoy — that’s the sweet spot where Outbound is found.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54664130975_b1686ed01d_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54664130975_b1686ed01d_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eChill solo adventure or cheery multiplayer road trip?\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs a solo player, Outbound gives you a wonderful off-grid feeling, where you’re gathering resources and building up your camper van at your own pace. You’re the captain of your own ship, so to speak, and it gives you a sense of calm and empowerment. Outbound can also be played with up to three other friends; however, it changes the DNA of the experience in a significant way.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith others along for the ride, friendly cooperation can turn Outbound into more of a high-energy road trip, very much like when you go on road trips with friends in real life. We loved to see that energy change, so while not required, multiplayer is a key addition from our perspective. We also recognized, as we brought Outbound over to PS5, that we had an opportunity to take advantage of the PlayStation Portal, as the PlayStation ecosystem doesn’t require any optimization to be Portal ready. We absolutely love the idea of a group of friends sitting together with Portal devices, playing together. The ease of carrying it with you (on a road trip, maybe) is something we hope our players will cherish.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54663798851_51ac6b3df2_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54663798851_51ac6b3df2_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eGrand fields of inspiration\u003c/h2\u003e\n\n\n\n\u003cp\u003e“Part of the inspiration for Outbound came when I was on a road trip of my own from Germany to the Netherlands,” says Tobi. “And I saw a beautiful old-school camper van as it drove by a field of solar panels and windmills. We were in the prototyping stage at that point, and this moment sparked the idea of building it around an electric van with sustainability in mind.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“Thus, sustainability is a huge theme that we’ve woven into the design,” Tobi continues. “The sun, wind, and rain are key sources of energy, and recycling litter earns you new blueprints for van upgrades. Those are merely a couple of ways Outbound shines a light on sustainability through gameplay, and we inject that energy aesthetically, as well, like how we show sailboats on the horizon as opposed to massive tankers and cargo ships.”\u003c/p\u003e\n\n\n\n\u003ch2\u003ePet that good pup\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://stream.mux.com/oC8g4q2J2z99K9kTu79iI6802kW2TKV01L7SvW8LiDAw4/capped-1080p.mp4?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiJ9.eyJzdWIiOiJvQzhnNHEySjJ6OTlLOWtUdTc5aUk2ODAya1cyVEtWMDFMN1N2VzhMaURBdzQiLCJhdWQiOiJ2IiwiZXhwIjoxNzUzNjIzMDU5LCJraWQiOiI0TDV5T2NqclYxTlVxVnpjVXZKQm4xd1RtNGVUR0c5TWgwMjAxWWs1anU5TkEifQ.AF6f0yo6kJjNVqAQ762WD__EELg0mWjhSgIdDKHlNrK6FhnpsCHjpWvLe0LMEjoIKn8pOMVAKcYI4prhdeykl0o2fVWbYY_pnIvsIrNd-2KubC0J8g_kXvYOSQ8zFXGK1FMUFcLNfsGQCdkr2Dvk77-6UCfY4N81FooiS8b9-iGjRV88PMmn2VxbnrTOT0nc4OmJvAWr4k6vhsCvn5uKymYmp3c1TFnWO6oEO3DmMnGcw4ZzwxZZlFBKT7puX7vjF-26VrZR2xQVFtKovY6I1mjs5UOEb18YO-LuqwCTpi2QiLh6HLARd-rJLaomH1mzhv59VTgOH0rfqdJqdZXBzQ\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eFor the dog fans out there, you do have one with you on your Outbound journey, and, yes, you can pet the dog. This functional companion, which you adopt and name yourself, brings another layer to the cozyvival experience — players can teach them to fetch resources, carry them back to the vehicle, and more. They’re not there just to be an incredibly cute face.\u003c/p\u003e\n\n\n\n\u003cp\u003eVideo games are often platforms that catapult us into far-reaching fantasies, dropping us into glorious worlds where we take on fantastic creatures with weapons and magic. Other adventures tap into fantasies that are a bit more grounded in our reality, and that is where Outbound lives. We’re looking forward to setting you all off on a glorious adventure when Outbound comes to PlayStation 5.\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/article\u003e\u003csection\u003e\n\t\u003ch2\u003eTrending Stories\u003c/h2\u003e\n\n\t\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-24T08:00:07-07:00",
  "modifiedTime": "2025-07-24T08:51:44-07:00"
}
