{
  "id": "3f170625-7b4c-424b-bdf0-2cd068121e25",
  "title": "Nintendo began working on Switch 2 \"shortly after the release\" of Switch 1, new Genki lawsuit papers reveal",
  "link": "https://www.eurogamer.net/nintendo-began-working-on-switch-2-shortly-after-the-release-of-switch-1-new-genki-lawsuit-papers-reveal",
  "description": "UPDATE 2.12pm: Genki has responded to Nintendo's legal complaint, saying it is \"taking it seriously\", and is \"proud of the work [it has] done\". Read more",
  "author": "Vikki Blake",
  "published": "Sun, 04 May 2025 11:42:00 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Nintendo",
    "Nintendo Switch 2",
    "Genki"
  ],
  "byline": "Vikki Blake",
  "length": 6319,
  "excerpt": "UPDATE 2.12pm: Genki has responded to Nintendo's legal complaint, saying it is \"taking it seriously\", and is \"proud of …",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/a33f5f27a28c7bfad6b7bd3d9ff2f2ef/icon/apple-touch-icon-152x152.png",
  "text": "UPDATE: Genki responds to Nintendo's lawsuit. Image credit: Nintendo UPDATE 2.12pm: Genki has responded to Nintendo's legal complaint, saying it is \"taking it seriously\", and is \"proud of the work [it has] done\". \"You may have seen that Nintendo recently filed a lawsuit against us. We're taking it seriously and working with legal counsel to respond thoughtfully,\" the statement said. \"What we can say is this: Genki has always been an independent company focused on building innovative gaming accessories for the community we love. We're proud of the work we've done, and we stand by the quality and originality of our products.\" A Note from the Genki TeamYou may have seen that Nintendo recently filed a lawsuit against us. We’re taking it seriously and working with legal counsel to respond thoughtfully.What we can say is this: Genki has always been an independent company focused on building innovative…— GENKI (@GenkiThings) May 4, 2025 \"While we can't comment in detail, we're continuing preparations to fulfill orders and showcase our newest products at PAX East this week. \"We're grateful for the overwhelming support we've received so far. We'll share more when we can, but for now, we're staying focused on doing what we do best: building gear for gamers. Original story follows. Original story: Court papers filed in California, USA, show Nintendo is formally suing accessories manufacturer Genki for infringing its trademark, as well as alleging unfair competition and false advertising. Nintendo lawyers reportedly visited Genki on the CES trade show floor in January after videos of its dummy Switch 2 console went viral before the system was formally revealed by Nintendo on 2nd April. Now, Nintendo has filed its copyright claim against Genki, accusing the company of \"capitalising\" on demand for Switch 2 news and giving \"contradictory and inconsistent\" statements. Nintendo Direct: Nintendo Switch 2 – 02.04.2025 Nintendo's Switch 2 Direct.Watch on YouTube \"Beginning at least as early as December 2024, [Genki] embarked upon a strategic campaign intended to capitalise on the public interest surrounding Nintendo's next-generation console,\" court papers said, \"In January 2025, [Genki] began advertising that it gained unauthorised access to Nintendo's upcoming Nintendo Switch 2 console, which had not yet been released or even revealed publicly by Nintendo. Following its initial claims of access to a genuine Nintendo Switch 2 console, Defendant's statements were contradictory and inconsistent, with Defendant later stating that it was never in possession of a console. Nevertheless, Defendant has since maintained its representation to consumers that its accessories will be compatible with the Nintendo Switch 2 upon the console's release.\" Nintendo said that \"ensuring the compatibility of Defendant's accessories would not be possible unless and until Defendant has access to a Nintendo Switch 2 console\" and insists it neither provided nor authorised a Switch 2 to the company. Therefore, Nintendo alleges Genki either misled consumers by pretending to have a \"genuine console\" when it didn't, or \"unlawfully or illicitly obtained an authentic Nintendo Switch 2, or proprietary technical information about the Nintendo Switch 2, prior to the console's release to the public\". \"Genki boasted its alleged early access to the unreleased console and allowed guests to hold and measure the mockups,\" Nintendo's lawyers said, adding the videos, renders, and images Genki displayed at its CES booth and on its website infringed Nintendo's copyright and \"garnered significant attention from the media and public resulting in confusion among consumers as to the validity of Genki's statements and association with Nintendo\". \"Public discourse and confusion over Genki's announcements were so significant that on January 10, 2025, Nintendo issued a statement to reporters about the incident, clarifying that 'the gaming hardware that Genki presented as Nintendo hardware at CES is unofficial and was not provided to the company by us',\" Nintendo added. Then, on 20th January, Genki posted a picture of its CEO, Edward Tsai, on its official Twitter account with the caption: \"Genki ninjas infiltrate Nintendo Kyoto HQ\", which Nintendo said was \"an apparent attempt to further confuse the public as to whether Genki had access to a Nintendo Switch 2 and/or an affiliation with Nintendo\". It then updated its website and advertisements \"to boast about its early access to Nintendo Switch 2 information\", saying: \"Can you keep a secret? We can’t...\" On 1st April, 2025 - the day before Nintendo's Switch 2 Nintendo Direct - Genki allegedly \"mass-emailed its marketing list and posted on social media an announcement of its own 'Direct' presentation to be held on the same day as Nintendo's highly anticipated presentation\". Nintendo then took issue with the name of Genki's broadcast - Genki Direct - and its branding materials. \"Genki's claims of compatibility would be impossible to guarantee without unauthorised, illegal early access to the Nintendo Switch 2. Thus, Genki has misled and is misleading the public as to its ability to guarantee the compatibility of its products with the Nintendo Switch 2.\" Nintendo is asking for Genki to be stopped from using \"Nintendo Switch\" in its marketing, destroy any products or marketing that does use Nintendo's copyright, and \"recover all damages it has sustained as a result of Defendant's infringement, unfair competition, and false advertising, and that said damages be trebled\". Interestingly, the court papers also revealed that Nintendo wasted no time designing the Switch successor, saying: \"Shortly after the release of the Nintendo Switch, Nintendo began planning its successor console, with formal hardware development beginning around 2019.\" The Switch 2 will release on 5th June and cost £396. Nintendo is gearing up for the launch of Switch 2 by releasing a chunky update for the original Switch. Update Version 20.0.0 adds a number of features to the console, including the new Virtual Game Card system, which allows players to share their digital games with another console or Family Group members in the same way they might swap a physical cartridge.",
  "image": "https://assetsio.gnwcdn.com/A-Nintendo-Switch-2-console-on-sitting-on-a-TV-stand.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eUPDATE: Genki responds to Nintendo\u0026#39;s lawsuit.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/A-Nintendo-Switch-2-console-on-sitting-on-a-TV-stand.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/A-Nintendo-Switch-2-console-on-sitting-on-a-TV-stand.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/A-Nintendo-Switch-2-console-on-sitting-on-a-TV-stand.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A Nintendo Switch 2 console on sitting on a TV stand\" data-src-full=\"https://assetsio.gnwcdn.com/A-Nintendo-Switch-2-console-on-sitting-on-a-TV-stand.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eNintendo\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\u003cstrong\u003eUPDATE 2.12pm:\u003c/strong\u003e Genki has responded to Nintendo\u0026#39;s legal complaint, saying it is \u0026#34;taking it seriously\u0026#34;, and is \u0026#34;proud of the work [it has] done\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\u0026#34;You may have seen that Nintendo recently filed a lawsuit against us. We\u0026#39;re taking it seriously and working with legal counsel to respond thoughtfully,\u0026#34; the statement said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;What we can say is this: Genki has always been an independent company focused on building innovative gaming accessories for the community we love. We\u0026#39;re proud of the work we\u0026#39;ve done, and we stand by the quality and originality of our products.\u0026#34;\u003c/p\u003e \u003cdiv data-domain=\"twitter.com\"\u003e\u003cblockquote\u003e\u003cdiv dir=\"ltr\" lang=\"en\"\u003e\u003cp\u003eA Note from the Genki Team\u003c/p\u003e\u003cp\u003eYou may have seen that Nintendo recently filed a lawsuit against us. We’re taking it seriously and working with legal counsel to respond thoughtfully.\u003c/p\u003e\u003cp\u003eWhat we can say is this: Genki has always been an independent company focused on building innovative…\u003c/p\u003e\u003c/div\u003e— GENKI (@GenkiThings) \u003ca href=\"https://twitter.com/GenkiThings/status/1918852177046737231?ref_src=twsrc%5Etfw\"\u003eMay 4, 2025\u003c/a\u003e\u003c/blockquote\u003e\u003c/div\u003e\n\u003cp\u003e\u0026#34;While we can\u0026#39;t comment in detail, we\u0026#39;re continuing preparations to fulfill orders and showcase our newest products at PAX East this week.\n\u003c/p\u003e\n\u003cp\u003e\u0026#34;We\u0026#39;re grateful for the overwhelming support we\u0026#39;ve received so far. We\u0026#39;ll share more when we can, but for now, we\u0026#39;re staying focused on doing what we do best: building gear for gamers.\u003c/p\u003e\n\u003cp\u003eOriginal story follows.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cstrong\u003eOriginal story:\u003c/strong\u003e Court papers filed in California, USA, show Nintendo is formally suing accessories manufacturer Genki for infringing its trademark, as well as alleging unfair competition and false advertising.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.eurogamer.net/nintendo-lawyers-visited-genki-to-discuss-those-switch-2-leaks-reporter-claims\"\u003eNintendo lawyers reportedly visited Genki on the CES trade show floor in January\u003c/a\u003e after videos of \u003ca href=\"https://www.eurogamer.net/switch-2-leaks-turn-into-deluge-as-dummy-units-shown-at-ces\"\u003eits dummy Switch 2 console went viral\u003c/a\u003e before the system was \u003ca href=\"https://www.eurogamer.net/switch-2-release-date-revealed\"\u003eformally revealed by Nintendo on 2nd April\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNow, Nintendo has filed its copyright claim against Genki, accusing the company of \u0026#34;capitalising\u0026#34; on demand for \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/switch-2-nintendo-direct-everything-announced\"\u003eSwitch 2\u003c/a\u003e news and giving \u0026#34;contradictory and inconsistent\u0026#34; statements.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Nintendo Direct: Nintendo Switch 2 – 02.04.2025\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/1uGRs-ispRU?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/1uGRs-ispRU/hqdefault.jpg\"/\u003e\u003cspan\u003eNintendo Direct: Nintendo Switch 2 – 02.04.2025\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/1uGRs-ispRU?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/1uGRs-ispRU?autoplay=1\" title=\"Nintendo Direct: Nintendo Switch 2 – 02.04.2025\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eNintendo\u0026#39;s Switch 2 Direct.\u003ca href=\"https://www.youtube.com/watch?v=1uGRs-ispRU\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u0026#34;Beginning at least as early as December 2024, [Genki] embarked upon a strategic campaign intended to capitalise on the public interest surrounding Nintendo\u0026#39;s next-generation console,\u0026#34; court papers \u003ca href=\"https://storage.courtlistener.com/recap/gov.uscourts.cacd.969015/gov.uscourts.cacd.969015.1.0.pdf\"\u003esaid\u003c/a\u003e,\u003c/p\u003e\n\u003cp\u003e\u0026#34;In January 2025, [Genki] began advertising that it gained unauthorised access to Nintendo\u0026#39;s upcoming Nintendo Switch 2 console, which had not yet been released or even revealed publicly by Nintendo. Following its initial claims of access to a genuine Nintendo Switch 2 console, Defendant\u0026#39;s statements were contradictory and inconsistent, with Defendant later stating that it was never in possession of a console. Nevertheless, Defendant has since maintained its representation to consumers that its accessories will be compatible with the Nintendo Switch 2 upon the console\u0026#39;s release.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNintendo said that \u0026#34;ensuring the compatibility of Defendant\u0026#39;s accessories would not be possible unless and until Defendant has access to a Nintendo Switch 2 console\u0026#34; and insists it neither provided nor authorised a Switch 2 to the company. Therefore, Nintendo alleges Genki either misled consumers by pretending to have a \u0026#34;genuine console\u0026#34; when it didn\u0026#39;t, or \u0026#34;unlawfully or illicitly obtained an authentic Nintendo Switch 2, or proprietary technical information about the Nintendo Switch 2, prior to the console\u0026#39;s release to the public\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Genki boasted its alleged early access to the unreleased console and allowed guests to hold and measure the mockups,\u0026#34; Nintendo\u0026#39;s lawyers said, adding the videos, renders, and images Genki displayed at its CES booth and on its website infringed Nintendo\u0026#39;s copyright and \u0026#34;garnered significant attention from the media and public resulting in confusion among consumers as to the validity of Genki\u0026#39;s statements and association with Nintendo\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Public discourse and confusion over Genki\u0026#39;s announcements were so significant that on January 10, 2025, Nintendo issued a statement to reporters about the incident, clarifying that \u0026#39;the gaming hardware that Genki presented as Nintendo hardware at CES is unofficial and was not provided to the company by us\u0026#39;,\u0026#34; Nintendo added.\u003c/p\u003e\n\u003cp\u003eThen, on 20th January, Genki posted a picture of its CEO, Edward Tsai, on its official Twitter account with the caption: \u0026#34;Genki ninjas infiltrate Nintendo Kyoto HQ\u0026#34;, which Nintendo said was \u0026#34;an apparent attempt to further confuse the public as to whether Genki had access to a Nintendo Switch 2 and/or an affiliation with Nintendo\u0026#34;. It then updated its website and advertisements \u0026#34;to boast about its early access to Nintendo Switch 2 information\u0026#34;, saying: \u0026#34;Can you keep a secret? We can’t...\u0026#34;\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/Screenshot-2025-05-04-at-12.39.58.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"444\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Screenshot-2025-05-04-at-12.39.58.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Screenshot-2025-05-04-at-12.39.58.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Screenshot-2025-05-04-at-12.39.58.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003c/figure\u003e\n\u003cp\u003eOn 1st April, 2025 - the day before Nintendo\u0026#39;s Switch 2 Nintendo Direct - Genki allegedly \u0026#34;mass-emailed its marketing list and posted on social media an announcement of its own \u0026#39;Direct\u0026#39; presentation to be held on the same day as Nintendo\u0026#39;s highly anticipated presentation\u0026#34;. Nintendo then took issue with the name of Genki\u0026#39;s broadcast - Genki Direct - and its branding materials.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Genki\u0026#39;s claims of compatibility would be impossible to guarantee without unauthorised, illegal early access to the Nintendo Switch 2. Thus, Genki has misled and is misleading the public as to its ability to guarantee the compatibility of its products with the Nintendo Switch 2.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNintendo is asking for Genki to be stopped from using \u0026#34;Nintendo Switch\u0026#34; in its marketing, destroy any products or marketing that does use Nintendo\u0026#39;s copyright, and \u0026#34;recover all damages it has sustained as a result of Defendant\u0026#39;s infringement, unfair competition, and false advertising, and that said damages be trebled\u0026#34;.\u003c/p\u003e\n\u003cp\u003eInterestingly, the court papers also revealed that Nintendo wasted no time designing the Switch successor, saying: \u0026#34;Shortly after the release of the Nintendo Switch, Nintendo began planning its successor console, with formal hardware development beginning around 2019.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe Switch 2 will release on 5th June and cost £396. Nintendo is gearing up for the launch of Switch 2 \u003ca href=\"https://www.eurogamer.net/nintendo-prepares-for-switch-2-with-original-console-update-adding-gameshare-virtual-game-cards-and-more\"\u003eby releasing a chunky update for the original Switch\u003c/a\u003e. Update Version 20.0.0 adds a number of features to the console, including the new Virtual Game Card system, which \u003ca href=\"https://www.eurogamer.net/nintendo-unveils-virtual-game-cards-thatll-let-you-share-you-digital-switch-and-switch-2-games\"\u003eallows players to share their digital games with another console\u003c/a\u003e or Family Group members in the same way they might swap a physical cartridge.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-04T11:42:00.372878Z",
  "modifiedTime": "2025-05-04T13:17:58.620752Z"
}
