{
  "id": "53ea2655-7ee9-4751-a018-ae6fed2ba48b",
  "title": "TorilMUD Adding Campaigns and Other Enhancements",
  "link": "https://tagn.wordpress.com/2025/01/17/torilmud-adding-campaigns-and-other-enhancements/",
  "description": "It has been a while since I mentioned TorilMUD, a title past the 30 year mark at this point, a miletsone I celebrated with a post back in late 2023. It has been over 20 years since the last pwipe.  We kicked off playing what was billed as “the final time” in the ASCII splash […]",
  "author": "Wilhelm Arcturus",
  "published": "Fri, 17 Jan 2025 16:15:55 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "TorilMUD",
    "ZMud"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 6273,
  "excerpt": "It has been a while since I mentioned TorilMUD, a title past the 30 year mark at this point, a miletsone I celebrated with a post back in late 2023. It has been over 20 years since the last pwipe. …",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "It has been a while since I mentioned TorilMUD, a title past the 30 year mark at this point, a miletsone I celebrated with a post back in late 2023. All text, all the time, login page from the past It has been over 20 years since the last pwipe.  We kicked off playing what was billed as “the final time” in the ASCII splash screen above and were engaged for over a year before one of our guild members suggested we try the upcoming EverQuest II. Still, the amazing thing isn’t that TorilMUD is still there… the resources to store and run it must be minuscule compared to any modern title… but that it keeps getting updated.  New zones have been a staple for ages as they are the new challenges and puzzles that keep the long playing regulars forming up to do zones daily.  Seriously, the LFG channel on the Discord server announces a run pretty much every day.  The City of Dis was the last new zone in the news. There have also been changes and up dates to classes as well as continuing to evolve the whole thing to align more with modern Dungeons \u0026 Dragons rules, it having started off based on AD\u0026D 2.0, when THAC0 was a thing. But it has, in all that time, mostly remained what it was at launch.  While a rich and enhanced example of the genre, at its heart it embodies the DikuMUD style that has dominated MMORPG thinking since Brad McQuaid and crew recreated it in 3D for with EverQuest in 1999. It has continued to grow, and the “world stat” command has numbers up from when last I checked: Total number of zones in world: 361 Total number of rooms in world: 68976 Total number of different mobiles: 21089 Total number of living mobiles: 50958 Total number of different objects: 21324 Total number of existing objects: 143369 But big changes… save for maybe the built-in map now available… aren’t really to be expected. So I was a bit surprised when, at the tail end of last year there was kind of a big announcement in a post with the modest title New Area Features Preview. Right up top it laid out that something big was coming to TorilMUD: Soon, we’re introducing four new systems that give us more ways to build content. These features open up possibilities for different kinds of challenges and rewards, though we’ll be starting small to ensure everything works smoothly. The four new systems are to be: Campaigns – game-wide events that let everyone work together toward a common goal. Armor Enhancements – gear that can have both impactful primary stats and additional depth through enchantments Zone Currencies – custom currencies, earned by defeating enemies and spent at special merchants. Encounter Settings – new tools to fine-tune specific fights or zones without affecting the entire game All four are spelled out in more detail in the post I linked. This is a pretty big change, and one that might even stir things up a bit in the old game. Not that I am going to jump back in and play… so much scrolling text is now too much for my eyes… but it did inspire me to see if I could, yet again, get my “last updated in 2005” copy of ZMud 7.2.1 running.  The last time I had to stir it from the dead was back in 2018, when I got it running again on Windows 10 64-bit. Windows 11 proved at least as forgiving and I was to get it going after only a bit of tinkering with comparability modes. ZMud 7.2.1 up and running again I am pretty sure that ASCII dragon was red in some past iteration… of course, I have a screen shot somewhere… here we go. TorilMUD Something is getting rendered in a different way… though I was likely using the same version of ZMud for both. That also meant logging in and making sure the maps I spent hundreds of hours creating more than 20 years ago now were still working.  Gone are the days of 100 people being on, but 28 players… not bad for a text based MUD past the 30 year mark. The “who sort” list result I recognize a few of those names.  Some people carry on… have carried on… playing pretty much daily for decades.  I think I even mentioned Lilithelle in a past post who at one point broke the game by accumulating so much experience that she basically “rolled over” the counter and her experience went negative and they had to fix the game to accommodate that much xp gain. When I log in I always think I should take a bit of time to get back to level 50.  I was there for a long time, then played a game in the forum where I would plane shift… travel to random locations between planes… with some valuables on me to see who could find my corpse and claim the goods. But even that was a long time ago.  The harsh death penalty that once included the loss of xp, possibly levels, and all your gear if you couldn’t find your corpse, has been out of the game for almost a decade at this point. Still, I have since managed to gear back up a bit. I am sure this was the druid drip back in 2005 I say this because every time I go peek in after a year or so away I am nostalgic to go back and play again… which is the way I am with so many titles I have spent a lot of time with.  History indicates however that I am not likely to go back.  I only got to level cap in the first place back in the day because there had been a pwipe so everybody was trying to get to level cap again so there were lots of groups out for xp and gear and what not. Now, as you can see from that roster above, most people who play are at level cap already, while the rest are likely alts of people at level cap.  Starting back in alone at level 47 would be hard… though I could probably get dragged along to fill out a few zone runs now and then.  The problem is that I would be more of a hindrance than a help.  Meanwhile, starting from scratch… that is a long climb and solo isn’t really a thing. But maybe this burst of nostalgia will get me to finish up a couple of old posts about the place I still have in my drafts folder.  I was going to write something about Ice Crag Castle at one point, which holds the distinction for me of likely being the oldest zone in the game that I think of as a “new” zone. Anyway, for those who do play, some interesting times could be coming. Related Links: TorilMUD Web Site (You can play from this page) TorilMUD News Page TorilMUD Forums (I think I have some 20+ year old posts in there) TorilMUD Discord",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eIt has been a while since I mentioned \u003cem\u003eTorilMUD\u003c/em\u003e, a title past the 30 year mark at this point, a miletsone I celebrated \u003ca href=\"https://tagn.wordpress.com/2023/12/15/thirty-years-of-toril-mud/\"\u003ewith a post back in late 2023\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_6702\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-6702\" data-attachment-id=\"6702\" data-permalink=\"https://tagn.wordpress.com/2009/10/31/october-in-review-4/torillogon-2/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png\" data-orig-size=\"439,371\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;}\" data-image-title=\"TorilLogon\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;All text, all the time, login page from the past\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png?w=439\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png?w=439\" src=\"https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png\" alt=\"\" width=\"439\" height=\"371\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png 439w, https://tagn.wordpress.com/wp-content/uploads/2009/10/torillogon1.png?w=150\u0026amp;h=127 150w\" sizes=\"(max-width: 439px) 100vw, 439px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-6702\"\u003eAll text, all the time, login page from the past\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eIt has been over 20 years since the last pwipe.  We kicked off playing what was billed as “the final time” in the ASCII splash screen above and were engaged for over a year before one of our guild members suggested we try the upcoming \u003cem\u003eEverQuest II\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eStill, the amazing thing isn’t that \u003cem\u003eTorilMUD\u003c/em\u003e is still there… the resources to store and run it must be minuscule compared to any modern title… but that it keeps getting updated.  New zones have been a staple for ages as they are the new challenges and puzzles that keep the long playing regulars forming up to do zones daily.  Seriously, the LFG channel on the Discord server announces a run pretty much every day.  \u003ca href=\"https://www.torilmud.com/news/new-zone-dis/\"\u003eThe City of Dis\u003c/a\u003e was the last new zone in the news.\u003c/p\u003e\n\u003cp\u003eThere have also been changes and up dates to classes as well as continuing to evolve the whole thing to align more with modern \u003cem\u003eDungeons \u0026amp; Dragons\u003c/em\u003e rules, it having started off based on AD\u0026amp;D 2.0, when THAC0 was a thing.\u003c/p\u003e\n\u003cp\u003eBut it has, in all that time, mostly remained what it was at launch.  While a rich and enhanced example of the genre, at its heart it embodies the \u003cem\u003eDikuMUD\u003c/em\u003e style that has dominated MMORPG thinking since Brad McQuaid and crew recreated it in 3D for with \u003cem\u003eEverQuest\u003c/em\u003e in 1999.\u003c/p\u003e\n\u003cp\u003eIt has continued to grow, and the “world stat” command has numbers up from when last I checked:\u003c/p\u003e\n\u003cp\u003eTotal number of zones in world: 361\u003c/p\u003e\n\u003cp\u003eTotal number of rooms in world: 68976\u003cbr/\u003e\nTotal number of different mobiles: 21089\u003cbr/\u003e\nTotal number of living mobiles: 50958\u003c/p\u003e\n\u003cp\u003eTotal number of different objects: 21324\u003cbr/\u003e\nTotal number of existing objects: 143369\u003c/p\u003e\n\u003cp\u003eBut big changes… save for maybe the built-in map now available… aren’t really to be expected.\u003c/p\u003e\n\u003cp\u003eSo I was a bit surprised when, at the tail end of last year there was kind of a big announcement in a post with the modest title \u003ca href=\"https://www.torilmud.com/news/new-area-features-preview/\"\u003eNew Area Features Preview\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eRight up top it laid out that something big was coming to \u003cem\u003eTorilMUD:\u003c/em\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eSoon, we’re introducing four new systems that give us more ways to build content. These features open up possibilities for different kinds of challenges and rewards, though we’ll be starting small to ensure everything works smoothly.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThe four new systems are to be:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eCampaigns\u003c/strong\u003e – game-wide events that let everyone work together toward a common goal.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eArmor Enhancements\u003c/strong\u003e – gear that can have both impactful primary stats and additional depth through enchantments\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eZone Currencies\u003c/strong\u003e – custom currencies, earned by defeating enemies and spent at special merchants.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eEncounter Settings\u003c/strong\u003e – new tools to fine-tune specific fights or zones without affecting the entire game\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAll four are spelled out in more detail in the post I linked.\u003c/p\u003e\n\u003cp\u003eThis is a pretty big change, and one that might even stir things up a bit in the old game.\u003c/p\u003e\n\u003cp\u003eNot that I am going to jump back in and play… so much scrolling text is now too much for my eyes… but it did inspire me to see if I could, yet again, get my “last updated in 2005” copy of ZMud 7.2.1 running.  The last time I had to stir it from the dead was back in 2018, \u003ca href=\"https://tagn.wordpress.com/2018/08/10/windows-10-zmud-and-other-options/\"\u003ewhen I got it running again on Windows 10 64-bit\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWindows 11 proved at least as forgiving and I was to get it going after only a bit of tinkering with comparability modes.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_131637\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-131637\" data-attachment-id=\"131637\" data-permalink=\"https://tagn.wordpress.com/2025/01/17/torilmud-adding-campaigns-and-other-enhancements/torilmud_zmud721/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png\" data-orig-size=\"1503,1050\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TorilMUD_ZMud721\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;ZMud 7.2.1 up and running again\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=600\" alt=\"\" width=\"600\" height=\"419\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_zmud721.png?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-131637\"\u003eZMud 7.2.1 up and running again\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI am pretty sure that ASCII dragon was red in some past iteration… of course, I have a screen shot somewhere… here we go.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_18411\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-18411\" data-attachment-id=\"18411\" data-permalink=\"https://tagn.wordpress.com/2011/10/12/unity-live-on-torilmud/torilmudnew/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg\" data-orig-size=\"769,800\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;}\" data-image-title=\"TorilMUDnew\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;TorilMUD\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=385\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=433\" src=\"https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=433\" alt=\"\" width=\"433\" height=\"450\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=433 433w, https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=144 144w, https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=385 385w, https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg?w=768 768w, https://tagn.wordpress.com/wp-content/uploads/2011/10/torilmudnew.jpg 769w\" sizes=\"(max-width: 433px) 100vw, 433px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-18411\"\u003eTorilMUD\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eSomething is getting rendered in a different way… though I was likely using the same version of ZMud for both.\u003c/p\u003e\n\u003cp\u003eThat also meant logging in and making sure the maps I spent hundreds of hours creating more than 20 years ago now were still working.  Gone are the days of 100 people being on, but 28 players… not bad for a text based MUD past the 30 year mark.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_131628\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-131628\" data-attachment-id=\"131628\" data-permalink=\"https://tagn.wordpress.com/2025/01/17/torilmud-adding-campaigns-and-other-enhancements/torilmud_whosort26/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png\" data-orig-size=\"616,668\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TorilMUD_WhoSort26\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;The “who sort” list result\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png?w=369\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png?w=415\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png?w=415\" alt=\"\" width=\"415\" height=\"450\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png?w=415 415w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png?w=138 138w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png?w=369 369w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_whosort26.png 616w\" sizes=\"(max-width: 415px) 100vw, 415px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-131628\"\u003eThe “who sort” list result\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI recognize a few of those names.  Some people carry on… have carried on… playing pretty much daily for decades.  I think I even mentioned Lilithelle in a past post who at one point broke the game by accumulating so much experience that she basically “rolled over” the counter and her experience went negative and they had to fix the game to accommodate that much xp gain.\u003c/p\u003e\n\u003cp\u003eWhen I log in I always think I should take a bit of time to get back to level 50.  I was there for a long time, then played a game in the forum where I would plane shift… travel to random locations between planes… with some valuables on me to see who could find my corpse and claim the goods.\u003c/p\u003e\n\u003cp\u003eBut even that was a long time ago.  The harsh death penalty that once included the loss of xp, possibly levels, and all your gear if you couldn’t find your corpse, has been \u003ca href=\"https://tagn.wordpress.com/2015/05/22/torilmud-and-the-end-of-the-harsh-death-penalty/\"\u003eout of the game for almost a decade\u003c/a\u003e at this point.\u003c/p\u003e\n\u003cp\u003eStill, I have since managed to gear back up a bit.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_131629\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-131629\" data-attachment-id=\"131629\" data-permalink=\"https://tagn.wordpress.com/2025/01/17/torilmud-adding-campaigns-and-other-enhancements/torilmud_gear2025/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png\" data-orig-size=\"627,408\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TorilMUD_Gear2025\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;I am sure this was the stuff back in 2005\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png\" alt=\"\" width=\"627\" height=\"408\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png 627w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png?w=150\u0026amp;h=98 150w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png?w=500\u0026amp;h=325 500w, https://tagn.wordpress.com/wp-content/uploads/2025/01/torilmud_gear2025.png?w=600\u0026amp;h=390 600w\" sizes=\"(max-width: 627px) 100vw, 627px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-131629\"\u003eI am sure this was the druid drip back in 2005\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI say this because every time I go peek in after a year or so away I am nostalgic to go back and play again… which is the way I am with so many titles I have spent a lot of time with.  History indicates however that I am not likely to go back.  I only got to level cap in the first place back in the day because there had been a pwipe so everybody was trying to get to level cap again so there were lots of groups out for xp and gear and what not.\u003c/p\u003e\n\u003cp\u003eNow, as you can see from that roster above, most people who play are at level cap already, while the rest are likely alts of people at level cap.  Starting back in alone at level 47 would be hard… though I could probably get dragged along to fill out a few zone runs now and then.  The problem is that I would be more of a hindrance than a help.  Meanwhile, starting from scratch… that is a long climb and solo isn’t really a thing.\u003c/p\u003e\n\u003cp\u003eBut maybe this burst of nostalgia will get me to finish up a couple of old posts about the place I still have in my drafts folder.  I was going to write something about Ice Crag Castle at one point, which holds the distinction for me of likely being the oldest zone in the game that I think of as a “new” zone.\u003c/p\u003e\n\u003cp\u003eAnyway, for those who do play, some interesting times could be coming.\u003c/p\u003e\n\u003cp\u003eRelated Links:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"http://www.torilmud.com/\"\u003eTorilMUD Web Site\u003c/a\u003e (You can play from this page)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"http://www.torilmud.com/news/\"\u003eTorilMUD News Page\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"http://www.torilmud.com/phpBB3/\"\u003eTorilMUD Forums\u003c/a\u003e (I think I have some 20+ year old posts in there)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://discord.gg/TKfPagrb\"\u003eTorilMUD Discord\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-17T16:15:55Z",
  "modifiedTime": "2025-01-17T18:36:40Z"
}
