{
  "id": "54fd0cbb-1a19-41c9-8c8f-b7aeaf6d95ac",
  "title": "Xbox Partner Showcase Announced For October 17, \"World Premieres\" Promised; How To Watch Live",
  "link": "https://www.gamespot.com/articles/xbox-partner-showcase-announced-for-october-17-world-premieres-promised-how-to-watch-live/1100-6527142/?ftag=CAD-01-10abi2f",
  "description": "Microsoft has announced the next Xbox Partner Preview showcase, and it's coming very soon. The event is set to take place on Thursday, October 17, featuring \"new and upcoming games\" from outside teams like Remedy, Sega, and 505, among others. In short, Microsoft is promising \"over a dozen\" new trailers throughout the 25-minute show.This is an \"no fluff, all games\" broadcast, Microsoft said. Here's everything we know about the event and how to watch.How to watch the October Xbox Partner PreviewThe Xbox Partner Preview takes place Thursday, October 17 at 10 AM PT / 1 PM ET. The event will stream live in all the usual places, including the Xbox YouTube and Twitch channels.Continue Reading at GameSpot",
  "author": "",
  "published": "Mon, 14 Oct 2024 10:00:00 -0700",
  "source": "https://www.gamespot.com/feeds/mashup/",
  "categories": [
    ""
  ],
  "byline": "Eddie Makuch",
  "length": 2464,
  "excerpt": "Here's how to watch and what to expect from the upcoming \"no fluff, all games\" Xbox showcase.",
  "siteName": "GameSpot",
  "favicon": "https://www.gamespot.com/a/bundles/gamespotsite/images/touch-icon-ipad-retina-precomposed.png",
  "text": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links. Microsoft has announced the next Xbox Partner Preview showcase, and it's coming very soon. The event is set to take place on Thursday, October 17, featuring \"new and upcoming games\" from outside teams like Remedy, Sega, and 505, among others. In short, Microsoft is promising \"over a dozen\" new trailers throughout the 25-minute show.This is an \"no fluff, all games\" broadcast, Microsoft said. Here's everything we know about the event and how to watch.How to watch the October Xbox Partner PreviewThe Xbox Partner Preview takes place Thursday, October 17 at 10 AM PT / 1 PM ET. The event will stream live in all the usual places, including the Xbox YouTube and Twitch channels.Microsoft noted that at only the official Xbox YouTube page will carry the stream in 4K/60fps. Every other channel will be capped at 1080p/60fps.Xbox Partner Preview start times:October 1710 AM PT1 PM ET6 PM GMT7 PM SASTOctober 182 AM JST3 AM AESTWhat to expectThe Xbox Partner Preview will include the first look at gameplay footage from Alan Wake II's The Lake House expansion, which is set to arrive later this month. There will also be an \"action-packed\" new trailer for Like A Dragon: Pirate Yakuza in Hawaii, along with \"a peek at multiple bosses\" for the dark-fantasy action game Wuchang: Fallen Feathers.Beyond all this, Microsoft said fans can expect \"multiple world premieres,\" along with \"other great titles\" coming to Xbox consoles, PC, and Game Pass.\"As always, Xbox Partner Preview is all about sharing exciting games news from our talented partners across the globe: you'll get new game reveals, release date announcements, and fresh new gameplay from upcoming games. And to sweeten the deal, during the broadcast, Xbox Wire will post exclusive behind-the-scenes stories about select titles shown,\" Microsoft said.Check back with GameSpot for lots more in the days ahead. What are you hoping to see at the Xbox Partner Preview? Let us know in the comments below! Got a news tip or want to contact us directly? Email news@gamespot.com",
  "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4383847-xboxsphere.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    \u003cspan data-nosnippet=\"\"\u003eGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\u003c/span\u003e\n  \u003c/p\u003e\u003carticle itemscope=\"\" data-type-id=\"1100\" data-guid=\"1100-6527142\"\u003e\n\n            \n            \n  \n\n\n        \n\n  \n\n\n        \n        \n              \u003csection\u003e\n\n                  \n          \u003cdiv data-content-element-selector=\"p, .js-buylink-item-container\" data-allowed-classes-selector=\"js-buylink-item-container\"\u003e\n                \u003cp\u003eMicrosoft has announced the next Xbox Partner Preview showcase, and it\u0026#39;s coming very soon. The event is set to take place on Thursday, October 17, featuring \u0026#34;new and upcoming games\u0026#34; from outside teams like Remedy, Sega, and 505, among others. In short, Microsoft is promising \u0026#34;over a dozen\u0026#34; new trailers throughout the 25-minute show.\u003c/p\u003e\u003cp\u003eThis is an \u0026#34;no fluff, all games\u0026#34; broadcast, Microsoft said. Here\u0026#39;s everything we know about the event and how to watch.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eHow to watch the October Xbox Partner Preview\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe Xbox Partner Preview takes place \u003cstrong\u003eThursday, October 17\u003c/strong\u003e at 10 AM PT / 1 PM ET. The event will stream live in all the usual places, including the Xbox YouTube and Twitch channels.\u003c/p\u003e\u003cp\u003eMicrosoft noted that at only the \u003ca href=\"https://YouTube.com/Xbox\" data-target=\"true\" target=\"_blank\" rel=\"noopener nofollow\"\u003eofficial Xbox YouTube page\u003c/a\u003e will carry the stream in 4K/60fps. Every other channel will be capped at 1080p/60fps.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eXbox Partner Preview start times:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOctober 17\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e10 AM PT\u003c/li\u003e\u003cli\u003e1 PM ET\u003c/li\u003e\u003cli\u003e6 PM GMT\u003c/li\u003e\u003cli\u003e7 PM SAST\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eOctober 18\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e2 AM JST\u003c/li\u003e\u003cli\u003e3 AM AEST\u003c/li\u003e\u003c/ul\u003e\u003ch2\u003e\u003cstrong\u003eWhat to expect\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eThe Xbox Partner Preview will include the first look at gameplay footage from Alan Wake II\u0026#39;s The Lake House expansion, which is set to arrive later this month. There will also be an \u0026#34;action-packed\u0026#34; new trailer for Like A Dragon: Pirate Yakuza in Hawaii, along with \u0026#34;a peek at multiple bosses\u0026#34; for the dark-fantasy action game Wuchang: Fallen Feathers.\u003c/p\u003e\u003cp\u003eBeyond all this, Microsoft said fans can expect \u0026#34;multiple world premieres,\u0026#34; along with \u0026#34;other great titles\u0026#34; coming to Xbox consoles, PC, and Game Pass.\u003c/p\u003e\u003cp\u003e\u0026#34;As always, Xbox Partner Preview is all about sharing exciting games news from our talented partners across the globe: you\u0026#39;ll get new game reveals, release date announcements, and fresh new gameplay from upcoming games. And to sweeten the deal, during the broadcast, Xbox Wire will post exclusive behind-the-scenes stories about select titles shown,\u0026#34; Microsoft said.\u003c/p\u003e\u003cp\u003eCheck back with GameSpot for lots more in the days ahead. What are you hoping to see at the Xbox Partner Preview? Let us know in the comments below!\u003c/p\u003e\n  \n                        \n    \n        \n        \n  \n                                  \u003c/div\u003e\n\n          \n        \n  \n  \n                    \n  \n    \n          \n            \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eGot a news tip or want to contact us directly? Email \u003ca href=\"mailto:news@gamespot.com?subject=Hi GameSpot! I have a news tip for you!\"\u003enews@gamespot.com\u003c/a\u003e\u003c/i\u003e\u003c/p\u003e\n\n    \n      \u003c/div\u003e\n        \n      \u003c/section\u003e\n    \n            \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-14T10:00:00Z",
  "modifiedTime": null
}
