{
  "id": "57a6b784-6e57-4579-930a-d97d1237b788",
  "title": "Cyberpunk 2077 Apple Mac review: an impressive, thoughtful port from CD Projekt RED",
  "link": "https://www.eurogamer.net/digitalfoundry-2025-cyberpunk-2077-apple-mac-review-an-impressive-thoughtful-port-from-cd-projekt-red",
  "description": "Cyberpunk 2077 is a massive game - and now it's finally out on Mac. Nearly five years on from its original release, CD Projekt Red has delivered a version of the RPG epic for Apple Silicon Mac computers, promising ray tracing support and advanced MetalFX features. So how does the sci-fi adventure hold up on Apple's current-gen computer lineup and what should gamers expect in performance and stability? We put the port through its paces on a range of modern Mac hardware, helpfully supplied by Apple, and the results are intriguing. Read more",
  "author": "Oliver Mackenzie",
  "published": "Fri, 25 Jul 2025 18:12:54 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "CD Projekt RED",
    "Xbox Series X/S",
    "CD Projekt",
    "Mac",
    "PS4",
    "Single Player",
    "Third person",
    "Open World",
    "First person",
    "PC",
    "Action Adventure",
    "Cyberpunk 2077: Phantom Liberty",
    "Shooter",
    "Science Fiction",
    "Story Rich",
    "Digital Foundry",
    "Cyberpunk 2077",
    "RPG",
    "Multiplayer Competitive",
    "PS5",
    "Xbox One"
  ],
  "byline": "Oliver Mackenzie",
  "length": 14310,
  "excerpt": "Packed with MetalFX technology and supporting high-end path tracing features, CD Projekt RED's Cyberpunk 2077 port for Apple Mac is a solid, impressive port.",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/96bbb56cd6bfa1d96bb08ae05360769f/icon/apple-touch-icon-152x152.png",
  "text": "Tested on M4-powered Mac Mini, MacBook Pro and Mac Studio - with PC performance comparisons. Image credit: Apple/CD Projekt RED Cyberpunk 2077 is a massive game - and now it's finally out on Mac. Nearly five years on from its original release, CD Projekt Red has delivered a version of the RPG epic for Apple Silicon Mac computers, promising ray tracing support and advanced MetalFX features. So how does the sci-fi adventure hold up on Apple's current-gen computer lineup and what should gamers expect in performance and stability? We put the port through its paces on a range of modern Mac hardware, helpfully supplied by Apple, and the results are intriguing. Out of the box, the Mac version of Cyberpunk 2077 is fairly straightforward. The game boots without issue on my M4 Max Macbook Pro, and it presents a settings menu that is essentially identical to the PC version of the game. There are very few items of note here, except for the presence of Apple's MetalFX temporal upscaler, which is available here alongside the analytically-based FSRs 2.1 and 3.0. The game supports any M-series Mac chip with at least 16GB of RAM, so no 8GB machines or Intel-based Macs. I'm testing three machines today, including a lower-end M4 Mac Mini, and an M4 Max MacBook Pro and M3 Ultra Mac Studio in essentially maxed-out configurations. When you load your first save, the game seems to undergo a rapid burn of shader compilation, as observed using the detailed MacOS 26 Metal performance HUD. The number of compiled shaders explodes during the first load here on a fresh MacOS 26 install, with very little apparent shader compilation activity during gameplay. Loading another save in a different segment of the world fires up another round of shader burn, and shader compilation while in-game is fairly limited. As a result, the game doesn't appear to suffer from shader compilation stutter, so this solution seems pretty effective. I ran Cyberpunk under MacOS 15.5 for the testing in this video, but I did dip into the MacOS 26 Beta 3 to surface some of these metrics. Cyberpunk 2077 Mac DF Review - Mac Mini/MacBook Pro/Mac Studio Tested - PC Perf Comparisons + More! Digital Foundry's video breakdown of Cyberpunk 2077's Apple Mac port, tested on Mac Mini, MacBook Pro 16 and the mighty Mac Studio with top-end M3 Ultra processor.Watch on YouTube Test Systems Mac Mini MacBook Pro 16 Mac Studio Processor Apple M4 Apple M4 Max Apple M3 Ultra CPU 4P Cores/6E Cores 12P Cores/4E Cores 24P Cores/8E Cores GPU 10 Cores 40 Cores 80 Cores Memory 16GB LPDDR5X at 120GB/s 128GB LPDDR5X at 546GB/s 512GB LPDDR5X at 819GB/s Thanks to Apple for supplying the above hardware for this piece. By default, the game kicks you into the \"For This Mac\" graphics preset, which changes graphical settings based on the chip you're using. For the M4 Max laptop, we're essentially getting ultra settings at 1440p with MetalFX as the upscaler of choice. Dynamic resolution scaling is enabled to balance GPU load against a 60fps frame-rate target. This default setting seems to work pretty well on the MacBook, generally logging a 60fps update without issue. There are some slightly concerning drops during open-world traversal, where the game suffers from pronounced stutters for a few moments. Heavy combat moments can drag down the frame-rate graph as well with brief but harsh tumbles down into the 50s. Lengthy stutters pop up in these sequences too, which momentarily pause the action. I'm not sure exactly what's going on here. I did try changing the MetalFX preset to performance to eliminate any DRS-driven variance, and that seemed to alleviate the issues to some degree, but I struggled to replicate the problems on a consistent enough basis to be sure. It's hard to tell exactly where these drops stem from because the game's GPU time readout in the Metal Performance HUD doesn't seem to correspond with actual in-game load. Generally speaking, I wouldn't be too concerned and I played through lengthy stretches of gameplay with no performance issues whatsoever, but you may not enjoy a totally faultless run of play here. Apple's MetalFX temporal upscaler is key to the visual results as it's a very capable upscaling solution for this title. Raw, native MetalFX resolution metrics are a perfect match for AMD's FSR scaling presets, and line up closely with Nvidia's DLSS presets as well. Using MetalFX with dynamic resolution scaling appears to expose a wider scaling range compared to the presets, with a floor at 50 percent axis res and a ceiling at 80 percent axis res in my testing at 1440p. So, at native 1440p, the dynamic resolution range is 720p to 1152p. If we compare MetalFX down the preset ladder, we're looking at a near-doubling of performance going from native 4K with TAA to MetalFX quality with the performance preset yielding about a 130 percent bump in frame-rates. 1440p carries somewhat less compelling boosts, topping out at roughly double the performance with the largest scaling factor. MetalFX should yield some satisfying outcomes here, especially towards the higher end of the resolution range. Image quality comparisons prove quite compelling for MetalFX. FSR 3 is easily conquered here at 1440p resolution with performance mode upscaling, with less troublesome breakup and disocclusion when propelled forward through the environment. Curiously though, it actually compares somewhat favourably to Nvidia's top-tier Transformer model DLSS on PC, producing a more stable, though softer, image in my tests. Slower traversal exposes more of that MetalFX softness and shimmering issues tend to be fairly obvious on both machines. Our prior tests found that MetalFX is competitive with PC ML-based upscalers, and that trend is broadly holding true here. Unfortunately, that isn't quite true when the game's lighting is path traced. RT Overdrive tends to be pretty messy using MetalFX on the MacBook, while DLSS 4 Ray Reconstruction manages to clean up the image effectively. The splotchy, shimmery reflections on the lobby floor in this shot reflect the disadvantage Macs have without a Ray Reconstruction alternative. Image quality with RR isn't perfect, but it's a far cry from the super resolution-only solutions we would otherwise use. Image credit: Digital Foundry MetalFX Upscaling 1080p 1440p 2160p MetalFX Quality (66.7% scale) 720p 960p 1440p MetalFX Balanced (58.9% scale) 635p 847p 1271p MetalFX Performance (50.0% scale) 540p 720p 1080p Apple is set to debut the MetalFX denoised upscaler in MacOS 26 later this year, which replaces hand-tuned denoisers with one machine learning-based denoising pass. This will hopefully produce a more competitive visual result with the likes of DLSS Ray Reconstruction, with which it shares a range of common inputs. The Mac version of Cyberpunk is a pretty solid experience on the MacBook Pro I've been testing so far, in ways that aren't strictly performance-driven. HDR on the internal display for instance looks highly impactful, with searing bright highlights and dimmed blacks. MacOS does a superb job integrating HDR and SDR content in the same interface - something Windows doesn't even attempt to manage - so Cyberpunk can operate in HDR while the rest of the OS looks perfectly fine mapped within a more limited, dimmer luminance space. No built-in Mac screen supports VRR, but the MacBook Pro does support Apple's ProMotion tech, which allows for different fixed refresh rates up to 120Hz. I had no issue capping Cyberpunk to 30fps, 40fps, or 60fps through the in-game v-sync options, and these frame-rates presented without frame-time inconsistencies. Meanwhile, battery life on the MacBook Pro is solid for a laptop under heavy gaming load, running for about an hour and eighteen minutes on the default 'for this mac' settings with HDR enabled at max display brightness. That's a good result for a gaming laptop running at essentially full-tilt. Most gaming laptops can't even supply full power to their GPU and CPU under battery, but the MacBook fully maintains its performance level whether connected to the mains or running solo. On the MacBook Pro 16 with the M4 Max processor, the \"for this Mac\" setting delivers 1440p output using MetalFX upscaling with dynamic resolution scaling, RT disabled and targeting 60fps. The game runs at full performance level from battery, lasting 78 minutes - impressive stuff. | Image credit: Digital Foundry That's driven by the impressive efficiency of Apple's SoCs. Under load, we're pulling about 55 Watts at peak for the CPU, GPU, and Apple Neural Engine combined. It would be interesting to see these figures compared against AMD's Strix Halo, which adopts a similar power-sipping system-on-a-chip design. Apple is packing a 99.6 Wh battery that's calibrated right to the FAA 100 Wh limit, so this is about as good as it gets for Mac staying power. As an overall experience on a high-end Mac, I'm satisfied with Cyberpunk 2077 - it's a well-done port that doesn't step into prior Mac port pitfalls and it comes packed with plenty of Apple-specific technology to justify its place on the Mac platform. However, we do need to test performance a little more thoroughly to see how Apple's Macs fare against popular PC chips in the Windows ecosystem. With that in mind, we tested across three Macs, two representing the high-end of Apple's current-gen offerings and one more characteristic of its lower-end parts. The M4 Max and M3 Ultra in the MacBook Pro and Mac Studio are those higher-end chips, and the M3 Ultra ends up beating its weaker counterpart by 35 percent to 41 percent in benchmark tests across ultra settings and RT overdrive, falling to about 23 percent in ultra RT. Despite its name, the M3 Ultra was actually introduced after the M4 Max and consists of two M3 Max chips connected over a silicon interposer. Apple has indicated they may be skipping an Ultra chip for the M4 generation, so this is probably going to stand as the fastest Apple chip available for some time to come. If we add the Mac Mini to the mix, we're logging a performance level that is very good for an iGPU, but is a small fraction of the throughput of the larger chips. The Mac Mini has about a quarter of the M4 Max's GPU resources, and comes in at about a quarter of its frame-rate in these tests. 1 of 4 Caption Attribution The M4 Max MacBook Pro's closest PC competition in this game is probably the RTX 4060, which trades blows with it in our raster-only Ultra benchmarking, though keep in mind the MacBook Pro is managing with a small fraction of the RTX 4060's 115W TDP. These PC settings do appear to match their Mac counterparts, so these should be like-for-like tests. When we dial in ray tracing though, the M4 Max starts to trail the RTX 4060 a little bit. It's not a huge deficit, but it is noticeable. M3 Ultra falls somewhere between the 4060 and 5060 Ti in matched raster tests at ultra settings - closer to the 4060, but still straddling the two cards. However, it drops further when we throw ray tracing into the mix, falling into lockstep with the 4060. This is a pretty comfortable level of performance for rasterized Cyberpunk, and I wouldn't expect any real issues with reasonable settings. The Mac Mini proves a bit of a trickier prospect. Measured against a relatively weak modern discrete GPU, the AMD RX 6600, it falls substantially behind. The difference between the cards is actually a bit larger with ray tracing, which perhaps suggests a persistent MacOS deficit here, given the relative weakness of RNDA 2's RT acceleration. However, compared to something like a Steam Deck - which has integrated graphics and is more in line with the power consumption of an M4 chip - the M4 scores a superior result with 47 percent better performance in our raster benchmarks. Your point of reference matters a lot here, but compared to most PC integrated graphics solutions, I suspect the M4 fares just fine. Switch 2 vs Steam Deck: Cyberpunk 2077 Benchmarked - Docked \u0026 Handheld Tested More SoC (system on chip) ARM vs x86 testing as we stack up Cyberpunk 2077 on Switch 2 up against Steam Deck OLED.Watch on YouTube I think the Mac port of Cyberpunk 2077 is quite good. Barring some hard-to-reproduce initial hitches, it runs smoothly, is easy to understand and configure, and supports key Apple tech like MetalFX upscaling. This is definitely one of the best AAA ports to MacOS I've seen. Evaluating PC performance comparisons is a little tricky. In a lot of benchmarks, higher-end Mac GPU hardware lands somewhere around the 70 series Nvidia products, sometimes even reaching the 80 series chips. That's especially true in productivity tasks, or in more synthetic rendering tests. However, performance in actual retail games tends to slip a little - often closer to lower-end desktop kit and midrange laptop parts. This is something I hope to test more thoroughly in the near future. That said, power efficiency is highly impressive compared to PC parts and Mac hardware can squeeze into relatively slim enclosures, with minimal thermal load and fan noise. Getting full performance on battery, and well over an hour of gaming time under load at max brightness, is something the MacBook Pro can deliver and most gaming laptops can't. Plus, the Mac carries a console-like simplicity that is reassuring: there are no driver updates to contend with, there's no need to worry about some obscure parts combination that could cause headaches, and Macs have high-quality built in displays that are perfectly calibrated to the needs of the operating system and games. Apple eliminates a lot of the troubleshooting that Windows PC users are probably used to, which leaves more time to actually enjoy software. All told, I'm relatively pleased with the overall experience of playing Cyberpunk 2077 on Mac hardware and the efforts made to deliver a tailored experience for particular Apple Silicon - an almost console-like set-up, with the option to drop back to a fully tailored experience. CD Projekt RED has really put the legwork in here, so if you have the kit, this is a solid port that's well worth a look.",
  "image": "https://assetsio.gnwcdn.com/CP2077-MAC-SIT.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eTested on M4-powered Mac Mini, MacBook Pro and Mac Studio - with PC performance comparisons.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/CP2077-MAC-SIT.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/CP2077-MAC-SIT.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/CP2077-MAC-SIT.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/CP2077-MAC-SIT.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eApple/CD Projekt RED\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n  \n\n\n            \u003cp\u003e\u003ca href=\"https://www.eurogamer.net/games/cyberpunk-2077\"\u003eCyberpunk 2077\u003c/a\u003e is a massive game - and now it\u0026#39;s finally out on Mac. Nearly five years on from its original release, CD Projekt Red has delivered a version of the RPG epic for Apple Silicon Mac computers, promising ray tracing support and advanced MetalFX features. So how does the sci-fi adventure hold up on Apple\u0026#39;s current-gen computer lineup and what should gamers expect in performance and stability? We put the port through its paces on a range of modern Mac hardware, helpfully supplied by Apple, and the results are intriguing.\u003c/p\u003e\n\u003cp\u003eOut of the box, the Mac version of Cyberpunk 2077 is fairly straightforward. The game boots without issue on my M4 Max Macbook Pro, and it presents a settings menu that is essentially identical to the PC version of the game. There are very few items of note here, except for the presence of Apple\u0026#39;s MetalFX temporal upscaler, which is available here alongside the analytically-based FSRs 2.1 and 3.0. The game supports any M-series Mac chip with at least 16GB of RAM, so no 8GB machines or Intel-based Macs. I\u0026#39;m testing three machines today, including a lower-end M4 Mac Mini, and an M4 Max MacBook Pro and M3 Ultra Mac Studio in essentially maxed-out configurations.\u003c/p\u003e\n\u003cp\u003eWhen you load your first save, the game seems to undergo a rapid burn of shader compilation, as observed using the detailed MacOS 26 Metal performance HUD. The number of compiled shaders explodes during the first load here on a fresh MacOS 26 install, with very little apparent shader compilation activity during gameplay. Loading another save in a different segment of the world fires up another round of shader burn, and shader compilation while in-game is fairly limited. As a result, the game doesn\u0026#39;t appear to suffer from shader compilation stutter, so this solution seems pretty effective. I ran Cyberpunk under MacOS 15.5 for the testing in this video, but I did dip into the MacOS 26 Beta 3 to surface some of these metrics.\u003c/p\u003e\n\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Cyberpunk 2077 Mac DF Review - Mac Mini/MacBook Pro/Mac Studio Tested - PC Perf Comparisons + More!\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/qXTU3Dgiqt8?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/qXTU3Dgiqt8/hqdefault.jpg\"/\u003e\u003cspan\u003eCyberpunk 2077 Mac DF Review - Mac Mini/MacBook Pro/Mac Studio Tested - PC Perf Comparisons + More!\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/qXTU3Dgiqt8?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/qXTU3Dgiqt8?autoplay=1\" title=\"Cyberpunk 2077 Mac DF Review - Mac Mini/MacBook Pro/Mac Studio Tested - PC Perf Comparisons + More!\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eDigital Foundry\u0026#39;s video breakdown of Cyberpunk 2077\u0026#39;s Apple Mac port, tested on Mac Mini, MacBook Pro 16 and the mighty Mac Studio with top-end M3 Ultra processor.\u003ca href=\"https://www.youtube.com/watch?v=qXTU3Dgiqt8\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\u003ctable\u003e\n\u003ctbody\u003e\u003ctr\u003e\n\u003cth\u003eTest Systems\u003c/th\u003e\n\u003cth\u003eMac Mini\u003c/th\u003e\n\u003cth\u003eMacBook Pro 16\u003c/th\u003e\n\u003cth\u003eMac Studio\u003c/th\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eProcessor\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eApple M4\u003c/td\u003e\n\u003ctd\u003eApple M4 Max\u003c/td\u003e\n\u003ctd\u003eApple M3 Ultra\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eCPU\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e4P Cores/6E Cores\u003c/td\u003e\n\u003ctd\u003e12P Cores/4E Cores\u003c/td\u003e\n\u003ctd\u003e24P Cores/8E Cores\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eGPU\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e10 Cores\u003c/td\u003e\n\u003ctd\u003e40 Cores\u003c/td\u003e\n\u003ctd\u003e80 Cores\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eMemory\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e16GB LPDDR5X at 120GB/s\u003c/td\u003e\n\u003ctd\u003e128GB LPDDR5X at 546GB/s\u003c/td\u003e\n\u003ctd\u003e512GB LPDDR5X at 819GB/s\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\u003c/table\u003e\n\u003cp\u003e\u003cem\u003eThanks to Apple for supplying the above hardware for this piece.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBy default, the game kicks you into the \u0026#34;For This Mac\u0026#34; graphics preset, which changes graphical settings based on the chip you\u0026#39;re using. For the M4 Max laptop, we\u0026#39;re essentially getting ultra settings at 1440p with MetalFX as the upscaler of choice. Dynamic resolution scaling is enabled to balance GPU load against a 60fps frame-rate target. This default setting seems to work pretty well on the MacBook, generally logging a 60fps update without issue. There are some slightly concerning drops during open-world traversal, where the game suffers from pronounced stutters for a few moments. Heavy combat moments can drag down the frame-rate graph as well with brief but harsh tumbles down into the 50s. Lengthy stutters pop up in these sequences too, which momentarily pause the action. I\u0026#39;m not sure exactly what\u0026#39;s going on here.\u003c/p\u003e\n\u003cp\u003eI did try changing the MetalFX preset to performance to eliminate any DRS-driven variance, and that seemed to alleviate the issues to some degree, but I struggled to replicate the problems on a consistent enough basis to be sure. It\u0026#39;s hard to tell exactly where these drops stem from because the game\u0026#39;s GPU time readout in the Metal Performance HUD doesn\u0026#39;t seem to correspond with actual in-game load. Generally speaking, I wouldn\u0026#39;t be too concerned and I played through lengthy stretches of gameplay with no performance issues whatsoever, but you may not enjoy a totally faultless run of play here.\u003c/p\u003e\n\u003cp\u003eApple\u0026#39;s MetalFX temporal upscaler is key to the visual results as it\u0026#39;s a very capable upscaling solution for this title. Raw, native MetalFX resolution metrics are a perfect match for AMD\u0026#39;s FSR scaling presets, and line up closely with Nvidia\u0026#39;s DLSS presets as well. Using MetalFX with dynamic resolution scaling appears to expose a wider scaling range compared to the presets, with a floor at 50 percent axis res and a ceiling at 80 percent axis res in my testing at 1440p. So, at native 1440p, the dynamic resolution range is 720p to 1152p.\u003c/p\u003e\n\n\u003cp\u003eIf we compare MetalFX down the preset ladder, we\u0026#39;re looking at a near-doubling of performance going from native 4K with TAA to MetalFX quality with the performance preset yielding about a 130 percent bump in frame-rates. 1440p carries somewhat less compelling boosts, topping out at roughly double the performance with the largest scaling factor. MetalFX should yield some satisfying outcomes here, especially towards the higher end of the resolution range.\u003c/p\u003e\n\u003cp\u003eImage quality comparisons prove quite compelling for MetalFX. FSR 3 is easily conquered here at 1440p resolution with performance mode upscaling, with less troublesome breakup and disocclusion when propelled forward through the environment. Curiously though, it actually compares somewhat favourably to Nvidia\u0026#39;s top-tier Transformer model DLSS on PC, producing a more stable, though softer, image in my tests. Slower traversal exposes more of that MetalFX softness and shimmering issues tend to be fairly obvious on both machines. Our prior tests found that MetalFX is competitive with PC ML-based upscalers, and that trend is broadly holding true here.\u003c/p\u003e\n\u003cp\u003eUnfortunately, that isn\u0026#39;t quite true when the game\u0026#39;s lighting is path traced. RT Overdrive tends to be pretty messy using MetalFX on the MacBook, while DLSS 4 Ray Reconstruction manages to clean up the image effectively. The splotchy, shimmery reflections on the lobby floor in this shot reflect the disadvantage Macs have without a Ray Reconstruction alternative. Image quality with RR isn\u0026#39;t perfect, but it\u0026#39;s a far cry from the super resolution-only solutions we would otherwise use.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/photo_59cpWPJ.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/photo_59cpWPJ.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/photo_59cpWPJ.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/photo_59cpWPJ.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eDigital Foundry\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\u003ctr\u003e\n\u003cth\u003eMetalFX Upscaling\u003c/th\u003e\n\u003cth\u003e1080p\u003c/th\u003e\n\u003cth\u003e1440p\u003c/th\u003e\n\u003cth\u003e2160p\u003c/th\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eMetalFX Quality (66.7% scale)\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e720p\u003c/td\u003e\n\u003ctd\u003e960p\u003c/td\u003e\n\u003ctd\u003e1440p\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eMetalFX Balanced (58.9% scale)\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e635p\u003c/td\u003e\n\u003ctd\u003e847p\u003c/td\u003e\n\u003ctd\u003e1271p\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eMetalFX Performance (50.0% scale)\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e540p\u003c/td\u003e\n\u003ctd\u003e720p\u003c/td\u003e\n\u003ctd\u003e1080p\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\u003c/table\u003e\n\u003cp\u003eApple is set to debut the MetalFX denoised upscaler in MacOS 26 later this year, which replaces hand-tuned denoisers with one machine learning-based denoising pass. This will hopefully produce a more competitive visual result with the likes of DLSS Ray Reconstruction, with which it shares a range of common inputs.\u003c/p\u003e\n\u003cp\u003eThe Mac version of Cyberpunk is a pretty solid experience on the MacBook Pro I\u0026#39;ve been testing so far, in ways that aren\u0026#39;t strictly performance-driven. HDR on the internal display for instance looks highly impactful, with searing bright highlights and dimmed blacks. MacOS does a superb job integrating HDR and SDR content in the same interface - something Windows doesn\u0026#39;t even attempt to manage - so Cyberpunk can operate in HDR while the rest of the OS looks perfectly fine mapped within a more limited, dimmer luminance space.\u003c/p\u003e\n\u003cp\u003eNo built-in Mac screen supports VRR, but the MacBook Pro does support Apple\u0026#39;s ProMotion tech, which allows for different fixed refresh rates up to 120Hz. I had no issue capping Cyberpunk to 30fps, 40fps, or 60fps through the in-game v-sync options, and these frame-rates presented without frame-time inconsistencies.\u003c/p\u003e\n\u003cp\u003eMeanwhile, battery life on the MacBook Pro is solid for a laptop under heavy gaming load, running for about an hour and eighteen minutes on the default \u0026#39;for this mac\u0026#39; settings with HDR enabled at max display brightness. That\u0026#39;s a good result for a gaming laptop running at essentially full-tilt. Most gaming laptops can\u0026#39;t even supply full power to their GPU and CPU under battery, but the MacBook fully maintains its performance level whether connected to the mains or running solo.\u003c/p\u003e\n\u003cfigure data-count=\"4\" role=\"group\"\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/mbp0.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/mbp0.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/mbp0.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/mbp0.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/mbp1.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/mbp1.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/mbp1.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/mbp1.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/mbp2.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/mbp2.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/mbp2.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/mbp2.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"\" data-src-full=\"https://assetsio.gnwcdn.com/mbp3.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/mbp3.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/mbp3.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/mbp3.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003c/figure\u003e\n\u003cfigcaption\u003eOn the MacBook Pro 16 with the M4 Max processor, the \u0026#34;for this Mac\u0026#34; setting delivers 1440p output using MetalFX upscaling with dynamic resolution scaling, RT disabled and targeting 60fps. The game runs at full performance level from battery, lasting 78 minutes - impressive stuff. | \u003cspan\u003eImage credit: \u003ccite\u003eDigital Foundry\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThat\u0026#39;s driven by the impressive efficiency of Apple\u0026#39;s SoCs. Under load, we\u0026#39;re pulling about 55 Watts at peak for the CPU, GPU, and Apple Neural Engine combined. It would be interesting to see these figures compared against AMD\u0026#39;s Strix Halo, which adopts a similar power-sipping system-on-a-chip design. Apple is packing a 99.6 Wh battery that\u0026#39;s calibrated right to the FAA 100 Wh limit, so this is about as good as it gets for Mac staying power.\u003c/p\u003e\n\u003cp\u003eAs an overall experience on a high-end Mac, I\u0026#39;m satisfied with Cyberpunk 2077 - it\u0026#39;s a well-done port that doesn\u0026#39;t step into prior Mac port pitfalls and it comes packed with plenty of Apple-specific technology to justify its place on the Mac platform. However, we do need to test performance a little more thoroughly to see how Apple\u0026#39;s Macs fare against popular PC chips in the Windows ecosystem.\u003c/p\u003e\n\u003cp\u003eWith that in mind, we tested across three Macs, two representing the high-end of Apple\u0026#39;s current-gen offerings and one more characteristic of its lower-end parts. The M4 Max and M3 Ultra in the MacBook Pro and Mac Studio are those higher-end chips, and the M3 Ultra ends up beating its weaker counterpart by 35 percent to 41 percent in benchmark tests across ultra settings and RT overdrive, falling to about 23 percent in ultra RT.\u003c/p\u003e\n\u003cp\u003eDespite its name, the M3 Ultra was actually introduced after the M4 Max and consists of two M3 Max chips connected over a silicon interposer. Apple has indicated they may be skipping an Ultra chip for the M4 generation, so this is probably going to stand as the fastest Apple chip available for some time to come. If we add the Mac Mini to the mix, we\u0026#39;re logging a performance level that is very good for an iGPU, but is a small fraction of the throughput of the larger chips. The Mac Mini has about a quarter of the M4 Max\u0026#39;s GPU resources, and comes in at about a quarter of its frame-rate in these tests.\u003c/p\u003e\n\u003cfigure\u003e\n\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" src=\"\"/\u003e\n\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e1\u003c/span\u003e \u003cspan\u003eof\u003c/span\u003e \u003cspan\u003e4\u003c/span\u003e \u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\n\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nCaption          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nAttribution          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\u003c/figure\u003e\n\u003cp\u003eThe M4 Max MacBook Pro\u0026#39;s closest PC competition in this game is probably the RTX 4060, which trades blows with it in our raster-only Ultra benchmarking, though keep in mind the MacBook Pro is managing with a small fraction of the RTX 4060\u0026#39;s 115W TDP. These PC settings do appear to match their Mac counterparts, so these should be like-for-like tests. When we dial in ray tracing though, the M4 Max starts to trail the RTX 4060 a little bit. It\u0026#39;s not a huge deficit, but it is noticeable.\u003c/p\u003e\n\u003cp\u003eM3 Ultra falls somewhere between the 4060 and 5060 Ti in matched raster tests at ultra settings - closer to the 4060, but still straddling the two cards. However, it drops further when we throw ray tracing into the mix, falling into lockstep with the 4060. This is a pretty comfortable level of performance for rasterized Cyberpunk, and I wouldn\u0026#39;t expect any real issues with reasonable settings.\u003c/p\u003e\n\u003cp\u003eThe Mac Mini proves a bit of a trickier prospect. Measured against a relatively weak modern discrete GPU, the AMD RX 6600, it falls substantially behind. The difference between the cards is actually a bit larger with ray tracing, which perhaps suggests a persistent MacOS deficit here, given the relative weakness of RNDA 2\u0026#39;s RT acceleration. However, compared to something like a Steam Deck - which has integrated graphics and is more in line with the power consumption of an M4 chip - the M4 scores a superior result with 47 percent better performance in our raster benchmarks. Your point of reference matters a lot here, but compared to most PC integrated graphics solutions, I suspect the M4 fares just fine.\u003c/p\u003e\n\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Switch 2 vs Steam Deck: Cyberpunk 2077 Benchmarked - Docked \u0026amp; Handheld Tested\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/SvGQik3m6ag?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/SvGQik3m6ag/hqdefault.jpg\"/\u003e\u003cspan\u003eSwitch 2 vs Steam Deck: Cyberpunk 2077 Benchmarked - Docked \u0026amp; Handheld Tested\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/SvGQik3m6ag?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/SvGQik3m6ag?autoplay=1\" title=\"Switch 2 vs Steam Deck: Cyberpunk 2077 Benchmarked - Docked \u0026amp; Handheld Tested\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eMore SoC (system on chip) ARM vs x86 testing as we stack up Cyberpunk 2077 on Switch 2 up against Steam Deck OLED.\u003ca href=\"https://www.youtube.com/watch?v=SvGQik3m6ag\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\u003cp\u003eI think the Mac port of Cyberpunk 2077 is quite good. Barring some hard-to-reproduce initial hitches, it runs smoothly, is easy to understand and configure, and supports key Apple tech like MetalFX upscaling. This is definitely one of the best AAA ports to MacOS I\u0026#39;ve seen. Evaluating PC performance comparisons is a little tricky. In a lot of benchmarks, higher-end Mac GPU hardware lands somewhere around the 70 series Nvidia products, sometimes even reaching the 80 series chips. That\u0026#39;s especially true in productivity tasks, or in more synthetic rendering tests. However, performance in actual retail games tends to slip a little - often closer to lower-end desktop kit and midrange laptop parts. This is something I hope to test more thoroughly in the near future.\u003c/p\u003e\n\u003cp\u003eThat said, power efficiency is highly impressive compared to PC parts and Mac hardware can squeeze into relatively slim enclosures, with minimal thermal load and fan noise. Getting full performance on battery, and well over an hour of gaming time under load at max brightness, is something the MacBook Pro can deliver and most gaming laptops can\u0026#39;t. Plus, the Mac carries a console-like simplicity that is reassuring: there are no driver updates to contend with, there\u0026#39;s no need to worry about some obscure parts combination that could cause headaches, and Macs have high-quality built in displays that are perfectly calibrated to the needs of the operating system and games.\u003c/p\u003e\n\u003cp\u003eApple eliminates a lot of the troubleshooting that Windows PC users are probably used to, which leaves more time to actually enjoy software. All told, I\u0026#39;m relatively pleased with the overall experience of playing Cyberpunk 2077 on Mac hardware and the efforts made to deliver a tailored experience for particular Apple Silicon - an almost console-like set-up, with the option to drop back to a fully tailored experience. \u003ca href=\"https://www.eurogamer.net/companies/cd-projekt-red\"\u003eCD Projekt RED\u003c/a\u003e has really put the legwork in here, so if you have the kit, this is a solid port that\u0026#39;s well worth a look.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-07-25T18:12:54.173298Z",
  "modifiedTime": null
}
