{
  "id": "5a3b3f15-1247-4257-a8aa-0dc7ea66384d",
  "title": "Alien: Rogue Incursion is getting a non-VR release later this year",
  "link": "https://www.eurogamer.net/alien-rogue-incursion-is-getting-a-non-vr-release-later-this-year",
  "description": "Alien: Rogue Incursion, the action-horror adventure from developer Survios, is ditching its headset requirements and getting a non-VR release on PS5 and Steam this September. Read more",
  "author": "Matt Wales",
  "published": "Thu, 08 May 2025 21:08:50 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Alien Rogue Incursion",
    "PS5",
    "Shooter",
    "PlayStation VR2",
    "PC",
    "Horror",
    "Meta Quest",
    "Survios",
    "Single Player"
  ],
  "byline": "Matt Wales",
  "length": 2391,
  "excerpt": "Alien: Rogue Incursion, the action-horror adventure from developer Survios, is ditching its headset requirements and ge…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/9254b5965941de19f12d87332edc0fff/icon/apple-touch-icon-152x152.png",
  "text": "Alien: Rogue Incursion, the action-horror adventure from developer Survios, is ditching its headset requirements and getting a non-VR release on PS5 and Steam this September. Alien: Rogue Incursion initially launched for PSVR 2 and PCVR last December, putting players into the big clompy boots of ex-Colonial Marine Zula Hendricks as they - alongside their ever-present synth companion Davis 01 - embarked on a dangerous mission to the uncharted planet Purdan, in the hope of exposing the Weyland-Yutani's black-site experiments. Unsurprisingly, it doesn't take long for those pesky Xenomorphs to make their presence known. Survios calls Alien: Rogue Incursion (which additionally launched for Meta Quest 3 earlier this year) part one of a two-part story, albeit one that \"stands alone as a complete story\" if you don't include \"thrilling cliffhanger\". It's newly announced non-VR release is titled Alien: Rogue Incursion Evolved Edition, and is described as having been \"re-envisioned\" for console and PC. What that means in specific terms isn't entirely clear, but there's talk of \"even deadlier Xenomorphs and enhanced visuals.\" Alien: Rogue Incursion Evolved Edition | PS5 \u0026 PC Announce Trailer Alien: Rogue Incursion Evolved Edition - PS5 \u0026 PC trailer.Watch on YouTube The original Alien: Rogue Incursion currently has a 'mixed' rating on Steam, having garnered criticism for issues ranging from wonky AI to poor performance - but the general concensus seems to be it's built on solid foundations and manages to capture the essence of the beloved sci-fi series. And if that works for you, Alien: Rogue Incursion Evolved Edition will be available in two guises when it launches for PlayStation 5 and Steam on 30th September. There's a $29.99 USD Standard Edition featuring just the base game, plus a $39.99 Deluxe Edition. This includes the base game, a Blue Camo armour skin, a Blue Camo weapon skin, and The Art of Alien: Rogue Incursion in-game art book. It's unclear, however, if owners of the earlier VR edition will be able to access the new version without forking out for the new release. So to recap, Alien: Rogue Incursion Evolved Edition launches for Steam and PS5 on 30th September. And if that's put you in an Alien mood, why not take a trip to last year, when Eurogamer celebrated a decade of Creative Assembly's all-time horror classic Alien: Isolation?",
  "image": "https://assetsio.gnwcdn.com/alien-rogue-incursion-crop.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nAlien: Rogue Incursion, the action-horror adventure from developer Survios, is ditching its headset requirements and getting a non-VR release on PS5 and Steam this September.\n\u003c/p\u003e\n\u003cp\u003e\nAlien: Rogue Incursion initially launched for PSVR 2 and PCVR last December, putting players into the big clompy boots of ex-Colonial Marine Zula Hendricks as they - alongside their ever-present synth companion Davis 01 - embarked on a dangerous mission to the uncharted planet Purdan, in the hope of exposing the Weyland-Yutani\u0026#39;s black-site experiments. Unsurprisingly, it doesn\u0026#39;t take long for those pesky Xenomorphs to make their presence known.\n\u003c/p\u003e\n\u003cp\u003e\nSurvios calls Alien: Rogue Incursion (which additionally launched for Meta Quest 3 earlier this year) part one of a two-part story, albeit one that \u0026#34;stands alone as a complete story\u0026#34; if you don\u0026#39;t include \u0026#34;thrilling cliffhanger\u0026#34;. It\u0026#39;s newly announced non-VR release is titled Alien: Rogue Incursion Evolved Edition, and is described as having been \u0026#34;re-envisioned\u0026#34; for console and PC. What that means in specific terms isn\u0026#39;t entirely clear, but there\u0026#39;s talk of \u0026#34;even deadlier Xenomorphs and enhanced visuals.\u0026#34;\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Alien: Rogue Incursion Evolved Edition | PS5 \u0026amp; PC Announce Trailer\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/0Ho3DAL11eA?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/0Ho3DAL11eA/hqdefault.jpg\"/\u003e\u003cspan\u003eAlien: Rogue Incursion Evolved Edition | PS5 \u0026amp; PC Announce Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/0Ho3DAL11eA?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/0Ho3DAL11eA?autoplay=1\" title=\"Alien: Rogue Incursion Evolved Edition | PS5 \u0026amp; PC Announce Trailer\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eAlien: Rogue Incursion Evolved Edition - PS5 \u0026amp; PC trailer.\u003ca href=\"https://www.youtube.com/watch?v=0Ho3DAL11eA\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\nThe original Alien: Rogue Incursion currently has a \u0026#39;mixed\u0026#39; rating on Steam, having garnered criticism for issues ranging from wonky AI to poor performance - but the general concensus seems to be it\u0026#39;s built on solid foundations and manages to capture the essence of the beloved sci-fi series. And if that works for you, Alien: Rogue Incursion Evolved Edition will be available in two guises when it launches for PlayStation 5 and \u003ca href=\"https://store.steampowered.com/app/3655390/Alien_Rogue_Incursion_Evolved_Edition/\"\u003eSteam\u003c/a\u003e on 30th September.\n\u003c/p\u003e\n\u003cp\u003e\nThere\u0026#39;s a $29.99 USD Standard Edition featuring just the base game, plus a $39.99 Deluxe Edition. This includes the base game, a Blue Camo armour skin, a Blue Camo weapon skin, and The Art of Alien: Rogue Incursion in-game art book. It\u0026#39;s unclear, however, if owners of the earlier VR edition will be able to access the new version without forking out for the new release.\n\u003c/p\u003e\n\u003cp\u003e\nSo to recap, Alien: Rogue Incursion Evolved Edition launches for Steam and PS5 on 30th September. And if that\u0026#39;s put you in an Alien mood, why not take a trip to last year, when Eurogamer \u003ca href=\"https://www.eurogamer.net/a-decade-of-alien-isolation-how-creative-assembly-made-an-all-time-horror-classic\"\u003ecelebrated a decade of Creative Assembly\u0026#39;s all-time horror classic Alien: Isolation\u003c/a\u003e?\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-08T21:08:50.453714Z",
  "modifiedTime": null
}
