{
  "id": "65ac5cb8-06ad-40cd-901d-4b4ea6f05541",
  "title": "Makeup and Beauty Blog Monday Poll, Vol. 874",
  "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-874/",
  "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Group chats: love ‘em or leave ‘em? It depends on the group, hahaha! I mostly love ‘em, and for those chats that I wanna leave (but can’t for whatever reason), well, that’s when the mute button comes in handy. 2. Full, medium or sheer? Hmm. For things like face makeup, then medium or sheer, although to be honest medium feels like full coverage for me these days! When it comes to, like, nail polish, though? Opaque all the way. I’ve got no time for sheer nail polish these days. Oh, and does this apply to perfume, too? Because if we’re talking about scents, I’ve been more into medium and sheer scents lately. 3. Did you pick up anything during the Sephora sale? Not this time, no. I[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 874 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
  "author": "Karen",
  "published": "Tue, 15 Apr 2025 00:06:18 +0000",
  "source": "https://www.makeupandbeautyblog.com/feed/",
  "categories": [
    "Just For Fun"
  ],
  "byline": "Karen",
  "length": 1975,
  "excerpt": "So...what is the Monday Poll? Excellent question! It isn't, contrary to its name, an actual poll, like with little clicky buttons. It's just a list of",
  "siteName": "Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup",
  "favicon": "https://www.makeupandbeautyblog.com/wp-content/uploads/2013/08/favicon.png",
  "text": "It’s going to be a wonderful week, my friend! So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Group chats: love ‘em or leave ‘em? It depends on the group, hahaha! I mostly love ‘em, and for those chats that I wanna leave (but can’t for whatever reason), well, that’s when the mute button comes in handy. 2. Full, medium or sheer? Hmm. For things like face makeup, then medium or sheer, although to be honest medium feels like full coverage for me these days! When it comes to, like, nail polish, though? Opaque all the way. I’ve got no time for sheer nail polish these days. Oh, and does this apply to perfume, too? Because if we’re talking about scents, I’ve been more into medium and sheer scents lately. 3. Did you pick up anything during the Sephora sale? Not this time, no. I was going to grab another bottle of Supergoop Protec(tint), but I kinda forgot, so oh well! It’s not like Sephora isn’t going to have another sale, ya know? 4. Does it feel like spring let in your neighborhood? Yes, because according to my allergies (ah-choo!) and the 70-degree weather today, spring is officially here. 5. Do you own a record player? Nope, although I kinda want one! Now if only I could find my vinyl copy of Madonna’s “Like a Virgin” from the ‘80s. I had it all the way through senior year in college, and it disappeared during one of the many moves while I was a 20-something. Your friendly neighborhood beauty addict, Karen P.S. Here are the questions to copy/paste with your answers in a comment. Talk to ya soon. 1. Group chats: love ‘em or leave ‘em? 2. Full, medium or sheer? 3. Did you pick up anything during the Sephora sale? 4. Does it feel like spring let in your neighborhood? 5. Do you own a record player? Reader Interactions",
  "image": "https://makeupandbeautyblog.com/wp-content/uploads/2025/04/youre-right-where-youre-meant-to-be-monday-poll.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"genesis-content\"\u003e\u003carticle aria-label=\"Makeup and Beauty Blog Monday Poll, Vol. 874\"\u003e\n  \u003cdiv\u003e\u003cfigure id=\"attachment_261763\" aria-describedby=\"caption-attachment-261763\"\u003e\u003cimg decoding=\"async\" src=\"https://makeupandbeautyblog.com/wp-content/uploads/2025/04/youre-right-where-youre-meant-to-be-monday-poll.jpg\" alt=\"\" width=\"1000\" height=\"1250\" srcset=\"https://makeupandbeautyblog.com/wp-content/uploads/2025/04/youre-right-where-youre-meant-to-be-monday-poll.jpg 1000w, https://makeupandbeautyblog.com/wp-content/uploads/2025/04/youre-right-where-youre-meant-to-be-monday-poll-610x763.jpg 610w, https://makeupandbeautyblog.com/wp-content/uploads/2025/04/youre-right-where-youre-meant-to-be-monday-poll-768x960.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003cfigcaption id=\"caption-attachment-261763\"\u003eIt’s going to be a wonderful week, my friend!\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cblockquote\u003e\n\u003ch2\u003eSo…what is the Monday Poll?\u003c/h2\u003e\n\u003cp\u003eExcellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years \u003cstrong\u003e(since 2007)\u003c/strong\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch3\u003e1. Group chats: love ‘em or leave ‘em? \u003c/h3\u003e\n\u003cp\u003eIt depends on the group, hahaha! I mostly love ‘em, and for those chats that I wanna leave (but can’t for whatever reason), well, that’s when the mute button comes in handy.\u003c/p\u003e\n\u003ch3\u003e2. Full, medium or sheer?\u003c/h3\u003e\n\u003cp\u003eHmm. For things like face makeup, then medium or sheer, although to be honest medium feels like full coverage for me these days! When it comes to, like, nail polish, though? Opaque all the way. I’ve got no time for sheer nail polish these days. Oh, and does this apply to perfume, too? Because if we’re talking about scents, I’ve been more into medium and sheer scents lately.\u003c/p\u003e\n\u003ch3\u003e3. Did you pick up anything during the Sephora sale? \u003c/h3\u003e\n\u003cp\u003eNot this time, no. I was going to grab another bottle of Supergoop Protec(tint), but I kinda forgot, so oh well! It’s not like Sephora isn’t going to have another sale, ya know?\u003c/p\u003e\n\u003ch3\u003e4. Does it feel like spring let in your neighborhood?\u003c/h3\u003e\n\u003cp\u003eYes, because according to my allergies (ah-choo!) and the 70-degree weather today, spring is officially here. \u003c/p\u003e\n\u003ch3\u003e5. Do you own a record player?\u003c/h3\u003e\n\u003cp\u003eNope, although I kinda want one! Now if only I could find my vinyl copy of Madonna’s “Like a Virgin” from the ‘80s. I had it all the way through senior year in college, and it disappeared during one of the many moves while I was a 20-something. \u003c/p\u003e\n\u003cp\u003eYour friendly neighborhood beauty addict,\u003c/p\u003e\n\u003cp\u003eKaren\u003c/p\u003e\n\u003cp\u003eP.S. Here are the questions to copy/paste with your answers in a comment. Talk to ya soon.\u003c/p\u003e\n\u003cp\u003e1. Group chats: love ‘em or leave ‘em?\u003cbr/\u003e\n2. Full, medium or sheer?\u003cbr/\u003e\n3. Did you pick up anything during the Sephora sale?\u003cbr/\u003e\n4. Does it feel like spring let in your neighborhood?\u003cbr/\u003e\n5. Do you own a record player?\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003ch2\u003eReader Interactions\u003c/h2\u003e\t\n\t\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-15T00:06:18Z",
  "modifiedTime": null
}
