{
  "id": "69c43f04-5508-45c1-a556-0ba9ad436437",
  "title": "Why is Niantic Selling Pokemon Go? To Jump on the AI Bandwagon of Course!",
  "link": "https://tagn.wordpress.com/2025/02/26/why-is-niantic-selling-pokemon-go-to-jump-on-the-ai-bandwagon-of-course/",
  "description": "It slipped out last week that Niantic was in talks to sell their one and only massive success as a company to Scopely, who runs titles like Marvel Strike Force and Star Trek Fleet Command.  Players were immediately concerned about what impact that might have on Pokemon Go, as though one exploitive publisher would be […]",
  "author": "Wilhelm Arcturus",
  "published": "Wed, 26 Feb 2025 16:15:20 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "Pokemon Go",
    "AI",
    "Capitalism",
    "Niantic",
    "Pokemon Gone",
    "Scopely",
    "The Pokemon Company"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 3944,
  "excerpt": "It slipped out last week that Niantic was in talks to sell their one and only massive success as a company to Scopely, who runs titles like Marvel Strike Force and Star Trek Fleet Command. Players…",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "It slipped out last week that Niantic was in talks to sell their one and only massive success as a company to Scopely, who runs titles like Marvel Strike Force and Star Trek Fleet Command.  Players were immediately concerned about what impact that might have on Pokemon Go, as though one exploitive publisher would be more than a degree or two different from another. Pokemon Gone! It isn’t as though Niantic hasn’t been pushing features to make people pay more.  The whole Dynamax system is pretty much a “cow, meet milking machine” feature set.  And the latest Tour is pretty much selling the access to specific Pokemon.  I know things can always be worse, but it isn’t like things aren’t bad already. (As an aside, Scopely was the former owner of Cold Iron and was involved with the sale of Cold Iron to Daybreak, which ended up never happening or something.  Does this mean they are sketchy already?) But I am more interested in why a company like Niantic would want to dispose of their one primary asset, the one title that makes the company at all noteworthy, the cash machine that is probably paying all the bills. I smell a stupid investor demand. Sure, Niantic has said that the interest in AR gaming has not developed along the lines they were expecting… which is code for the fact they couldn’t repeat the success of Pokemon Go, even when handed an IP like Harry Potter.  And that no doubt is a factor in all of this, that Niantic could not just re-skin Pokemon Go and keep the money machine expanding indefinitely. It is also possible, with the game coming up on the ten year mark, that they might be up for contract negotiations with The Pokemon Company.  Forget about Detective Pikachu, it is Capitalist Pikachu that rules the roost over there and, after seeing nearly a decade of amazing revenue, Capitalist Pikachu might be demanding a bigger slice of the pie. The argument is that Pokemon is what makes Niantic successful, not their technology, so The Pokemon Company is the party that brings the most value to the table, so they should get a larger cut of the revenue. We do not know if that is actually happening, but it is certainly plausible.  Pikachu plays hardball when money is at stake. But, as noted over at Forbes, the future direction for Niantic contains some key words you might recognize: Niantic’s future focus appears to be on enhancing spatial intelligence through large-scale machine learning models, leveraging data collected from its gaming applications to build detailed 3D maps of the world. Oh, they want to use all that data they collected about their users to train some sort of AI or LLM or whatever smokescreen term is popular this week for the over-hyped garbage generation machine technology. Which probably means a key investor has decided that the line for Pokemon Go, and any additional copypasta titles based on it, won’t be going up any more, so they want the company to ditch all that, sell it off while it still has even $3.5 billion in value, and to take that cash to Vegas and put it all on red… or invest it into language model tech, whichever is easier. And since tables in Vegas probably can’t cover that big of a bet, AI is the way forward. So I can feel the pain of players and the worry that a wheeler dealer speculative studio like Scopely will make things worse… though writing to The Pokemon Company because you’re afraid of cash grab monetization is like writing to the NRA asking for stricter gun laws.  If Scopely makes more money, The Pokemon Company makes more money, so it is completely in their best interest for Scopely to do so. Am I too cynical?  I fear I am not. Anyway, so it goes.  In the end, while Niantic managed to grasp the essence of Pokemon for a bit with their Pokemon Go title, they also haven’t exactly been up to the task at multiple points along the way.  I don’t know, maybe we should applaud when a company acknowledges that they are out of their depth?",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eIt slipped out last week that \u003ca href=\"https://en.wikipedia.org/wiki/Scopely\"\u003eNiantic\u003c/a\u003e was in talks to sell their one and only massive success as a company to \u003ca href=\"https://en.wikipedia.org/wiki/Scopely\"\u003eScopely\u003c/a\u003e, who runs titles like \u003cem\u003eMarvel Strike Force\u003c/em\u003e and \u003cem\u003eStar Trek Fleet Command\u003c/em\u003e.  Players were immediately concerned about what impact that might have on \u003cem\u003ePokemon Go\u003c/em\u003e, as though one exploitive publisher would be more than a degree or two different from another.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_132770\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-132770\" data-attachment-id=\"132770\" data-permalink=\"https://tagn.wordpress.com/2025/02/26/why-is-niantic-selling-pokemon-go-to-jump-on-the-ai-bandwagon-of-course/pokemongone/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg\" data-orig-size=\"1200,600\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"PokemonGOne\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Pokemon Gone!\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=600\" alt=\"\" width=\"600\" height=\"300\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pokemongone.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-132770\"\u003ePokemon Gone!\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eIt isn’t as though Niantic hasn’t been pushing features to make people pay more.  The whole Dynamax system is pretty much a “cow, meet milking machine” feature set.  And the latest Tour is pretty much selling the access to specific Pokemon.  I know things can always be worse, but it isn’t like things aren’t bad already.\u003c/p\u003e\n\u003cp\u003e(As an aside, Scopely was the former owner of Cold Iron and was involved with the \u003ca href=\"https://tagn.wordpress.com/2020/08/13/daybreak-buys-cold-iron-studios/\"\u003esale of Cold Iron to Daybreak\u003c/a\u003e, which ended up \u003ca href=\"https://mmofallout.com/2021/08/30/hotcakes-daybreak-quietly-sold-off-cold-iron/\"\u003enever happening or something\u003c/a\u003e.  Does this mean they are sketchy already?)\u003c/p\u003e\n\u003cp\u003eBut I am more interested in why a company like Niantic would want to dispose of their one primary asset, the one title that makes the company at all noteworthy, the cash machine that is probably paying all the bills.\u003c/p\u003e\n\u003cp\u003eI smell a stupid investor demand.\u003c/p\u003e\n\u003cp\u003eSure, Niantic has said that the interest in AR gaming has not developed along the lines they were expecting… which is code for the fact they couldn’t repeat the success of \u003cem\u003ePokemon Go\u003c/em\u003e, even when handed an IP like \u003cem\u003eHarry Potter\u003c/em\u003e.  And that no doubt is a factor in all of this, that Niantic could not just re-skin \u003cem\u003ePokemon Go\u003c/em\u003e and keep the money machine expanding indefinitely.\u003c/p\u003e\n\u003cp\u003eIt is also possible, with the game coming up on the ten year mark, that they might be up for contract negotiations with The Pokemon Company.  Forget about Detective Pikachu, it is Capitalist Pikachu that rules the roost over there and, after seeing nearly a decade of amazing revenue, Capitalist Pikachu might be demanding a bigger slice of the pie.\u003c/p\u003e\n\u003cp\u003eThe argument is that \u003cem\u003ePokemon\u003c/em\u003e is what makes Niantic successful, not their technology, so The Pokemon Company is the party that brings the most value to the table, so they should get a larger cut of the revenue.\u003c/p\u003e\n\u003cp\u003eWe do not know if that is actually happening, but it is certainly plausible.  Pikachu plays hardball when money is at stake.\u003c/p\u003e\n\u003cp\u003eBut, as \u003ca href=\"https://www.forbes.com/sites/charliefink/2025/02/20/niantic-to-unload-pokemon-go-for-35-billion-hp-buys-dead-ai-pin/\"\u003enoted over at Forbes\u003c/a\u003e, the future direction for Niantic contains some key words you might recognize:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eNiantic’s future focus appears to be on enhancing spatial intelligence through large-scale machine learning models, leveraging data collected from its gaming applications to build detailed 3D maps of the world.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eOh, they want to use all that data they collected about their users to train some sort of AI or LLM or whatever smokescreen term is popular this week for the over-hyped garbage generation machine technology.\u003c/p\u003e\n\u003cp\u003eWhich probably means a key investor has decided that the line for \u003cem\u003ePokemon Go\u003c/em\u003e, and any additional copypasta titles based on it, won’t be going up any more, so they want the company to ditch all that, sell it off while it still has even $3.5 billion in value, and to take that cash to Vegas and put it all on red… or invest it into language model tech, whichever is easier.\u003c/p\u003e\n\u003cp\u003eAnd since tables in Vegas probably can’t cover that big of a bet, AI is the way forward.\u003c/p\u003e\n\u003cp\u003eSo I can feel the pain of players and the worry that a wheeler dealer speculative studio like Scopely will make things worse… though \u003ca href=\"https://www.reddit.com/r/TheSilphRoad/comments/1itre34/write_to_the_pok%C3%A9mon_company_if_youre_concerned/\"\u003ewriting to The Pokemon Company\u003c/a\u003e because you’re afraid of cash grab monetization is like writing to the NRA asking for stricter gun laws.  If Scopely makes more money, The Pokemon Company makes more money, so it is completely in their best interest for Scopely to do so.\u003c/p\u003e\n\u003cp\u003eAm I too cynical?  I fear I am not.\u003c/p\u003e\n\u003cp\u003eAnyway, so it goes.  In the end, while Niantic managed to grasp the essence of \u003cem\u003ePokemon\u003c/em\u003e for a bit with their \u003cem\u003ePokemon Go\u003c/em\u003e title, they also haven’t exactly been up to the task at multiple points along the way.  I don’t know, maybe we should applaud when a company acknowledges that they are out of their depth?\u003c/p\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-26T16:15:20Z",
  "modifiedTime": "2025-02-26T16:50:37Z"
}
