{
  "id": "6f433e06-e26d-4249-933d-77e1c6ef0a9c",
  "title": "Fortnite Battle Royale Chapter 6 Season 2: Lawless detailed, live now",
  "link": "https://blog.playstation.com/2025/02/21/fortnite-battle-royale-chapter-6-season-2-lawless-detailed-live-now/",
  "description": "Run amok, PlayStation fans! It’s every outlaw for themselves in Fortnite Battle Royale Chapter 6 Season 2: Lawless. Looting reaches a whole new level as you go from job to job — heisting Fletcher Kane’s train transports, plundering his riches from bank vaults, or targeting his armored caravan. Here, the hustle never stops: Big Dill […]",
  "author": "Molly Dyer",
  "published": "Fri, 21 Feb 2025 16:00:01 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PS4",
    "PS5",
    "epic",
    "fortnite"
  ],
  "byline": "Nicolas Doucet Studio Director, Team Asobi",
  "length": 8855,
  "excerpt": "Epic detail what you can expect with new goods, skins and more.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjENH%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FwEaCXVzLWVhc3QtMSJHMEUCIQCP4%252FF%252BvvbCkLM8D%252FKuIvrYP1db6D%252BuFSQcjeexR9opugIgDPqmaMfFTClR5loxeJduRqDsqBG9q%252Fuj%252B%252B7MRvXDXrAqhgQI%252Bv%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FARAAGgw1Nzc0MTg4MTg0MTMiDBKwmr2AkrDZgllA5iraAyL1hUTNcEjU6e6bmhbfRuVlkMEA8RbXOkB7SZ4%252FG%252F5BlHdIIs1AXbjv0SIjzP5FJ3oV2pFKnAxSn3TTwRTwAFNE8FcqI2v9vph1sKiueUK3JKzsL22WlkBMgZJkYzs9Io5XTAnArOGvnJ6PQf7lg03FVLdl2g8l1UZgsTtWnFWKz%252F%252Fs8zNU%252Bg2KF10xKRaXjWenoWP1H9jbjpqhRIBcDYhqLt6ef6fHicB6vYv6AvRV4AxU4DA0H%252BHVNs0iFYH0RN4AQOc2lNCxUfmZrKz7iOuBMejNP9echU0jxZP1YEe74zX%252FnlWhoQjlk%252B8Vr1KuMNYYyd80qSWGRQQS8P70s7OJp1FO9eYpyK3j4kPzMf7kl2T4zgLUINKD3YJsakcKKUR3Eg0sdgZIswNFrXyeYjN7Dag7thXOn%252F57ElpwBGN%252BDyY%252BGD5r8A0PVEmqKdYAnKnRPuo%252F3AWZ9R9H5yldLZG5qTuy6kahF66ChCpm%252BztbWj6XCrkNCgx3uhdl1cNj%252FNdu1Fu9Elz0Xp8HJP0IErg9CCIj79csSENiCWhe0wbV9W6iel0Y5oo75VFgkmUvmVGwgdbABBG4deXvOIkNscchRGQK53da2DyKucI9nFEWNW%252F2WaYxDk7dJTDA5%252Bm9BjqlAXuFQ%252B9gCYXxRqGzyY5VM3BzTz8FB2e03RHNYu9OzmZvE1bwf5qpdC02PqApN4C8y6SQsQwqEGDiv%252B0Hs%252B4KAzX041sE7yHX0WH%252FoQjQbzs16ujEfXdCdjsDZUNm6oy69s6hhr%252BKtYzHm8V%252Bx%252FQfWfyHGm3dW7HtuRPmi2xSR0fTkvfDmJ7Wx5m%252Fw7EmyuPo7qbNo%252FBJzSHuHH3MfpqkAM3rizddEQ%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NWUEPWTWDW%252F20250223%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20250223T011126Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3D83ffd1ce07ad523291ad9aa75b7e60343a4f5109242f2b7b8e8ca32e2dc6057e\u0026fit=192%2C192",
  "text": "Run amok, PlayStation fans! It’s every outlaw for themselves in Fortnite Battle Royale Chapter 6 Season 2: Lawless. Looting reaches a whole new level as you go from job to job — heisting Fletcher Kane’s train transports, plundering his riches from bank vaults, or targeting his armored caravan. Here, the hustle never stops: Big Dill drops the beat and high-value Dill Bits, Midas returns later in the season, but the real score? The outlaw life. There are plenty of ways to make a splash in some cash, so let’s dive into it! Havens for heisters Go for broke in your mission to be rich! Prized Bars saturate the Island more than normal, but your dreams of living the high life can be snuffed out as public enemy number one Fletcher Kane is in the running to take all the riches for himself. To get ahead of the competition, scope out the potential hauls in these new locales: Welcome to Crime City Corruption and deceit are the name of the game in Crime City. Peruse the Wise Guys Bookstore, Hostile Hotel, or the Launder Mat to build your stash, but don’t linger here too long. Swindling outlaws  — a.k.a. other players — are itching to stop your hot streak. An Outlaw’s Oasis Even heisters need a chance to relax! Outlaw Oasis’ luxurious facilities provide just that, giving you a zen environment to plan your next major raid.  Shiny Shafts Feel like making your claim to highly sought-after wealth? Make a hustle to Fletcher Kane’s Shiny Shafts, the mining source that puts the Bars in his banks.  Lonewolf Lair Cause some chaos at Lonewolf Lair, Fletcher’s mansion hideout that has some rigid security to sneak past (or fight head-on if you’re brash). Kingpin of cunning There isn’t any place in town that the baron Fletcher Kane doesn’t have his paws in. He always seems to appear when you least hope him to, mainly to snatch the loot you just took. But if you have the guts to challenge the Island’s mob don, you can earn the Mythic Fletcher Kane’s Double Down Pistol and the Unstoppable Medallion that increases sprint speed and allows for bashing enemies while sprinting. Remember: Try to keep a low profile!  If you have a Medallion, your enemies will be able to keep an eye on your location on their mini-map! The more Medallions you have, the more precise the radius of your exact location.  Pickle on the beat Big Dill is the newest rap artist on the scene in Fortnite. He’s a mean, green, hot-tempered outlaw aiming to be the grittiest gherkin in the jar. Big Dill \u0026 The Brat make up the dynamic duo known as the Tasty Bois. Their new single Runamok drops on Soundcloud February 21 and is available as a Jam Track in the Battle Pass now. Big Dill is “borrowing” from banks, launching music, and creating his own currency in-game: Dill Bits (more on that in a second). Who knows what he’ll do next… maybe launch a podcast? Your checklist to hit the jackpot Strike it rich by taking advantage of these golden opportunities to put you ahead of the craftiest of rogues: A surge of gold Coming under the effect of a Gold Rush will boost your speed, plus the speed of your Pickaxe swing and how much structure damage it does. Speaking of your Pickaxe, you can also gain Gold Rush by mining Bar-filled Gold Veins!  Grow your wealth big-time with Dill Bits, a coin created by the notorious Tasty Boi rapper Big Dill. The value of Dill Bits are reaching levels that Bars* can never hit, but make sure to use them during your match as they don’t transfer to the next! *Big Dill has more strikes than he does tracks worth listening to, please do not take financial advice from a rapping pickle. Don’t squander your wealth Lay down your Bars and Dill Bits to buy Boons and Legendary items from one of the three Black Markets around the map. Don’t worry about how the Black Markets acquired them — some details are better left unknown. Convoys of treasure  No Bars move around the Island without Fletcher Kane being involved. He’s transporting valuables around the map with his Armored Transport convoys, and they pack a punch. If your plan is to “borrow” these valuables, be ready for a fight with Kane’s henchmen. The loot is yours for the taking after that! Setting your eyes on a higher prize? Feel free to try your hand at raiding Fletcher’s Armored Train. However, this is well-known for being the most dangerous job in town. Hop aboard the train, destroy its turrets, and blow the vault door wide open to bring it to a screeching halt! A boon of boons Season refresh, Boon refresh. Venture to Black Markets or come across Rare Chests to find a new slate of Boons! These persist beyond elimination in the same match (meaning you’ll keep your Boons if you get rebooted in the same match). The Boons in Chapter 6 Season 2 are:  Vulture Boon: Reveal where enemies are eliminated on the map for a short time. Gold Rush Boon: Opening or destroying Chests grants Gold Rush. Adrenaline Rush Boon: Gain the Slap effect (short-term unlimited Energy regen) upon mantling, hurdling, and wall jumping. Gold Ammo Boon: Gain ammo when picking up Bars. Greed Boon: Find extra Bars from eliminations and opening containers. New, nefarious munitions Get into trouble… And stay there with these new tools! Vault crackin’ at its finest These vaults are tough and the only way to crack them is with Thermite, a powerful explosive found stashed away around the map. After you’ve planted it, damage the vault’s weak points to expedite your robbery. The Plasma Burst Laser works great for this, as does the Rocket Drill, coming later this season.  The tools for mayhem Make your “withdrawals” look effortless with the new Collateral Damage Assault Rifle and Falcon Eye Sniper. Also, keep an eye out for the formidable Outlaw Shotgun dropping in a later update! If your style’s a little more ambidextrous, the dual-wield Pump \u0026 Dump, coming in a later update, is your new best friend. Occupying a single weapon slot, hold a Pump Shotgun in one hand and an SMG in the other. Aim for the knees A staple for ne’er-do-wells everywhere, take a crack at The Kneecapper! It’s not just good for giving enemies a whack — it also reduces the Energy cost of sprinting while increasing sprint speed and jump height. Security in the way? No problem New utility items like the protective Port-A-Cover and enemy-detecting Pulse Scanner can be found around the map. Both are tremendously useful for holding off henchmen. There are henchmen and enemy players crawling all over the Island, but it’s all about knowing the tricks of the trade. The Med-Mist Grenade helps heal in a pinch, and Gold Splash grants Gold Rush and heals 20 Health! (It’ll heal 20 Shield if you’re at full Health already.) Slay frosty Your enemies are about to be on thin ice. The cold-blooded cryomancer Sub-Zero has arrived on the Island and can be recruited to your cause! Be sure to pick up Sub-Zero’s Kombat Kit, which empowers you to ice slide into opponents and unleash a flurry of frosty fists. It’s good to be bad with the Lawless Battle Pass Get the Lawless Battle Pass to instantly unlock the Cassidy Quinn Outfit. Like with the other Passes in Fortnite, you can unlock and claim free and premium rewards in the Battle Pass by earning XP in any Fortnite experience! To claim the premium rewards as you earn XP, purchase the Pass for only 1,000 V-Bucks or get it through Fortnite Crew! There are several Outfits included as premium rewards in the Pass: Cassidy Quinn: She’s all in. (Cassidy Quinn is claimable right away upon purchasing the Battle Pass!) Joss: It’s not magic. It’s chemistry! Fletcher Kane: What’s yours is his. Valentina: Get in, get the goods, and get out with style. Big Dill: The original Tasty Boi. Keisha Cross: She rules the road. Sub-Zero (MK3): The Lin Kuei cryomancer of legend. The fallen king with a heart of gold is finding his way back to the Island. The Outlaw Midas Outfit will be unlockable from Battle Pass Quests in March, completable in any Fortnite experience! The Battle Pass will be available to progress in until Chapter 6 Season 2 ends on May 2, 2025 Eastern Time. Let’s go, space cowboy! Prefer stopping criminals? Complete Cowboy Bebop Quests starting March 1 to rake in XP that can go towards Cowboy Bebop Bonus Goals! Meeting these Bonus Goals will unlock the Cowboy Bebop Wrap and Bebop Legends Loading Screen. The Quests and Bonus Goals will be available until March 18. What if we said you can complete these objectives as the famed bounty hunters themselves? The Spike Spiegel Outfit and Faye Valentine Outfit will be in the Fortnite Shop starting February 28 Eastern Time! Fortnite Battle Royale: Lawless ends May 2. Blow that vault door wide open!",
  "image": "https://blog.playstation.com/tachyon/2028/02/cbb17c068444d14a798b64c493d4be6b626f4845.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cp\u003eRun amok, PlayStation fans! It’s every outlaw for themselves in \u003ca href=\"https://www.playstation.com/games/fortnite/\"\u003eFortnite Battle Royale\u003c/a\u003e Chapter 6 Season 2: Lawless.\u003cstrong\u003e \u003c/strong\u003eLooting reaches a whole new level as you go from job to job — heisting Fletcher Kane’s train transports, plundering his riches from bank vaults, or targeting his armored caravan. Here, the hustle never stops: Big Dill drops the beat and high-value Dill Bits, Midas returns later in the season, but the real score? The outlaw life.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere are plenty of ways to make a splash in some cash, so let’s dive into it!\u003c/p\u003e\n\n\n\t\u003cdiv data-youtube-id=\"GQm0M7i3veA\" data-title=\"\"\u003e\n\t\u003cp\u003e\n\t\t\u003cimg src=\"https://img.youtube.com/vi/GQm0M7i3veA/maxresdefault.jpg\" data-srcset=\"https://img.youtube.com/vi/GQm0M7i3veA/default.jpg 120w, https://img.youtube.com/vi/GQm0M7i3veA/mqdefault.jpg 320w, https://img.youtube.com/vi/GQm0M7i3veA/hqdefault.jpg 480w, https://img.youtube.com/vi/GQm0M7i3veA/sddefault.jpg 640w, https://img.youtube.com/vi/GQm0M7i3veA/maxresdefault.jpg 1280w\" data-sizes=\"(min-width: 1170px) 936px, (min-width: 960px) 80vw, 100vw\" data-src=\"https://img.youtube.com/vi/GQm0M7i3veA/maxresdefault.jpg\" alt=\"Fortnite Battle Royale Chapter 6 Season 2: Lawless detailed, live now\" srcset=\"https://img.youtube.com/vi/GQm0M7i3veA/default.jpg 120w, https://img.youtube.com/vi/GQm0M7i3veA/mqdefault.jpg 320w, https://img.youtube.com/vi/GQm0M7i3veA/hqdefault.jpg 480w, https://img.youtube.com/vi/GQm0M7i3veA/sddefault.jpg 640w, https://img.youtube.com/vi/GQm0M7i3veA/maxresdefault.jpg 1280w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\t\n\n\n\n\u003ch2\u003e\u003cstrong\u003eHavens for heisters\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eGo for broke in your mission to be rich! Prized Bars\u003cstrong\u003e \u003c/strong\u003esaturate the Island more than normal, but your dreams of living the high life can be snuffed out as public enemy number one Fletcher Kane is in the running to take all the riches for himself. To get ahead of the competition, scope out the potential hauls in these new locales:\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eWelcome to Crime City\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54339054185_1bfc472e53_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54339054185_1bfc472e53_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCorruption and deceit are the name of the game in Crime City.\u003cstrong\u003e \u003c/strong\u003ePeruse the Wise Guys Bookstore, Hostile Hotel, or the Launder Mat to build your stash, but don’t linger here too long. Swindling outlaws  — a.k.a. other players — are itching to stop your hot streak.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eAn Outlaw’s Oasis\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54337729917_b4ca8871c8_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54337729917_b4ca8871c8_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEven heisters need a chance to relax! Outlaw Oasis’ luxurious facilities provide just that, giving you a zen environment to plan your next major raid. \u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eShiny Shafts\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338633711_90853264a8_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338633711_90853264a8_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFeel like making your claim to highly sought-after wealth? Make a hustle to Fletcher Kane’s Shiny Shafts, the mining source that puts the Bars in his banks. \u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eLonewolf Lair\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338849124_cd61b7db11_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338849124_cd61b7db11_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCause some chaos at Lonewolf Lair, Fletcher’s mansion hideout that has some rigid security to sneak past (or fight head-on if you’re brash).\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eKingpin of cunning\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThere isn’t any place in town that the baron Fletcher Kane doesn’t have his paws in. He always seems to appear when you least hope him to, mainly to snatch the loot you just took. But if you have the guts to challenge the Island’s mob don, you can earn the Mythic Fletcher Kane’s Double Down Pistol and the Unstoppable Medallion that increases sprint speed and allows for bashing enemies while sprinting.\u003c/p\u003e\n\n\n\n\u003cp\u003eRemember: Try to keep a low profile!  If you have a Medallion, your enemies will be able to keep an eye on your location on their mini-map! The more Medallions you have, the more precise the radius of your exact location. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338633726_dedf3a215a_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338633726_dedf3a215a_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003ePickle on the beat\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eBig Dill is the newest rap artist on the scene in Fortnite. He’s a mean, green, hot-tempered outlaw aiming to be the grittiest gherkin in the jar. Big Dill \u0026amp; The Brat make up the dynamic duo known as the Tasty Bois. Their new single Runamok drops on Soundcloud February 21 and is available as a Jam Track in the Battle Pass now.\u003c/p\u003e\n\n\n\n\u003cp\u003eBig Dill is “borrowing” from banks, launching music, and creating his own currency in-game: Dill Bits (more on that in a second). Who knows what he’ll do next… maybe launch a podcast?\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338849114_91f8d11e29_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338849114_91f8d11e29_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eYour checklist to hit the jackpot\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eStrike it rich by taking advantage of these golden opportunities to put you ahead of the craftiest of rogues:\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eA surge of gold\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eComing under the effect of a Gold Rush will boost your speed, plus the speed of your Pickaxe swing and how much structure damage it does. Speaking of your Pickaxe, you can also gain Gold Rush by mining Bar-filled Gold Veins! \u003c/p\u003e\n\n\n\n\u003cp\u003eGrow your wealth big-time with Dill Bits, a coin created by the notorious Tasty Boi rapper Big Dill. The value of Dill Bits are reaching levels that Bars* can never hit, but make sure to use them during your match as they don’t transfer to the next!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338849159_a0685dcab5_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338849159_a0685dcab5_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e*Big Dill has more strikes than he does tracks worth listening to, please do not take financial advice from a rapping pickle.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eDon’t squander your wealth\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eLay down your Bars and Dill Bits to buy Boons and Legendary items from one of the three Black Markets around the map. Don’t worry about how the Black Markets acquired them — some details are better left unknown.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338633766_c769e040fc_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338633766_c769e040fc_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eConvoys of treasure\u003c/strong\u003e \u003c/h2\u003e\n\n\n\n\u003cp\u003eNo Bars move around the Island without Fletcher Kane being involved. He’s transporting valuables around the map with his Armored Transport convoys, and they pack a punch. If your plan is to “borrow” these valuables, be ready for a fight with Kane’s henchmen. The loot is yours for the taking after that!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338633751_a214020d90_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338633751_a214020d90_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSetting your eyes on a higher prize? Feel free to try your hand at raiding Fletcher’s Armored Train. However, this is well-known for being the most dangerous job in town. Hop aboard the train, destroy its turrets, and blow the vault door wide open to bring it to a screeching halt!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54337729967_f2ea218a29_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54337729967_f2ea218a29_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eA boon of boons\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338859533_0f36507e46_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338859533_0f36507e46_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSeason refresh, Boon refresh. Venture to Black Markets or come across Rare Chests to find a new slate of Boons! These persist beyond elimination in the same match (meaning you’ll keep your Boons if you get rebooted in the same match). The Boons in Chapter 6 Season 2 are: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eVulture Boon:\u003c/strong\u003e Reveal where enemies are eliminated on the map for a short time.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGold Rush Boon:\u003c/strong\u003e Opening or destroying Chests grants Gold Rush.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAdrenaline Rush Boon: \u003c/strong\u003eGain the Slap effect (short-term unlimited Energy regen) upon mantling, hurdling, and wall jumping.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGold Ammo Boon: \u003c/strong\u003eGain ammo when picking up Bars.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGreed Boon: \u003c/strong\u003eFind extra Bars from eliminations and opening containers.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eNew, nefarious munitions\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eGet into trouble… And stay there with these new tools!\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eVault crackin’ at its finest\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThese vaults are tough and the only way to crack them is with Thermite, a powerful explosive found stashed away around the map. After you’ve planted it, damage the vault’s weak points to expedite your robbery. The Plasma Burst Laser works great for this, as does the Rocket Drill, coming later this season. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338849189_0cca04e9bf_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338849189_0cca04e9bf_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eThe tools for mayhem\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eMake your “withdrawals” look effortless with the new Collateral Damage Assault Rifle and Falcon Eye Sniper. Also, keep an eye out for the formidable Outlaw Shotgun dropping in a later update!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54339054225_7a560a59dd_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54339054225_7a560a59dd_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIf your style’s a little more ambidextrous, the dual-wield Pump \u0026amp; Dump, coming in a later update, is your new best friend. Occupying a single weapon slot, hold a Pump Shotgun in one hand and an SMG in the other.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54337729992_1eab0a6e83_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54337729992_1eab0a6e83_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eAim for the knees\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eA staple for ne’er-do-wells everywhere, take a crack at The Kneecapper! It’s not just good for giving enemies a whack — it also reduces the Energy cost of sprinting while increasing sprint speed and jump height.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338859593_6ae4646211_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338859593_6ae4646211_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eSecurity in the way? No problem\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eNew utility items like the protective Port-A-Cover and enemy-detecting Pulse Scanner can be found around the map. Both are tremendously useful for holding off henchmen.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338859598_310adaf6be_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338859598_310adaf6be_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThere are henchmen and enemy players crawling all over the Island, but it’s all about knowing the tricks of the trade. The Med-Mist Grenade helps heal in a pinch, and Gold Splash grants Gold Rush and heals 20 Health! (It’ll heal 20 Shield if you’re at full Health already.)\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eSlay frosty\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eYour enemies are about to be on thin ice. The cold-blooded cryomancer Sub-Zero has arrived on the Island and can be recruited to your cause! Be sure to pick up Sub-Zero’s Kombat Kit, which empowers you to ice slide into opponents and unleash a flurry of frosty fists.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54337730027_e422e5a0da_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54337730027_e422e5a0da_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eIt’s good to be bad with the Lawless Battle Pass\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eGet the Lawless Battle Pass to instantly unlock the Cassidy Quinn Outfit. Like with the other Passes in Fortnite, you can unlock and claim free and premium rewards in the Battle Pass by earning XP in any Fortnite experience!\u003c/p\u003e\n\n\n\n\u003cp\u003eTo claim the premium rewards as you earn XP, purchase the Pass for only 1,000 V-Bucks or get it through\u003ca href=\"https://www.fortnite.com/fortnite-crew-subscription\"\u003e Fortnite Crew\u003c/a\u003e! There are several Outfits included as premium rewards in the Pass:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eCassidy Quinn: She’s all in. \u003cem\u003e(Cassidy Quinn is claimable right away upon purchasing the Battle Pass!)\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eJoss: It’s not magic. It’s chemistry!\u003c/li\u003e\n\n\n\n\u003cli\u003eFletcher Kane: What’s yours is his.\u003c/li\u003e\n\n\n\n\u003cli\u003eValentina: Get in, get the goods, and get out with style.\u003c/li\u003e\n\n\n\n\u003cli\u003eBig Dill: The original Tasty Boi.\u003c/li\u003e\n\n\n\n\u003cli\u003eKeisha Cross: She rules the road.\u003c/li\u003e\n\n\n\n\u003cli\u003eSub-Zero (MK3): The Lin Kuei cryomancer of legend.\u003cbr/\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54339054260_149498939d_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54339054260_149498939d_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe fallen king with a heart of gold is finding his way back to the Island. The Outlaw Midas Outfit will be unlockable from Battle Pass Quests in March, completable in any Fortnite experience! The Battle Pass will be available to progress in until Chapter 6 Season 2 ends on May 2, 2025 Eastern Time.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54338633836_681bc63800_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54338633836_681bc63800_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eLet’s go, space cowboy!\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003ePrefer stopping criminals? Complete Cowboy Bebop Quests starting March 1 to rake in XP that can go towards Cowboy Bebop Bonus Goals! Meeting these Bonus Goals will unlock the Cowboy Bebop Wrap and Bebop Legends Loading Screen.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54337729927_5ceb97a9a0_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54337729927_5ceb97a9a0_k.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe Quests and Bonus Goals will be available until March 18. What if we said you can complete these objectives as the famed bounty hunters themselves? The Spike Spiegel Outfit and Faye Valentine Outfit will be in the Fortnite Shop starting February 28 Eastern Time!\u003c/p\u003e\n\n\n\n\u003cp\u003eFortnite Battle Royale: Lawless ends May 2. Blow that vault door wide open!\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-02-21T08:00:01-08:00",
  "modifiedTime": "2025-02-21T08:00:09-08:00"
}
