{
  "id": "751ca288-b163-4239-859a-d53a08318186",
  "title": "Interscope Records Launches Custom Juice WRLD Fortnite Island and Juice WRLD-inspired Xbox Design Lab Controllers",
  "link": "https://news.xbox.com/en-us/2024/11/27/xbox-juice-wrld-fortnite-controllers/",
  "description": "The post Interscope Records Launches Custom Juice WRLD Fortnite Island and Juice WRLD-inspired Xbox Design Lab Controllers appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Wed, 27 Nov 2024 18:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Accessories",
    "Announcements",
    "Custom Controllers",
    "Epic Games",
    "Fortnite",
    "Fortnite Island",
    "Juice Wrld",
    "Xbox",
    "Xbox Design Lab",
    "Xbox Wireless Controller"
  ],
  "byline": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "length": 1947,
  "excerpt": "Xbox, Interscope, Grade A, and Life Free 999 are teaming up to launch a custom in-game Fortnite Island and Xbox Design Lab Controllers in honor of Juice WRLD.",
  "siteName": "Xbox Wire",
  "favicon": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryOn November 30, a custom Juice WRLD-themed Fortnite Island, “Juice WRLD: The Party Never Ends” launches, featuring unreleased music, iconic tracks, and Xbox Lounges.Xbox will release two Juice WRLD-inspired Xbox Design Lab controllers.Xbox will also host a live Fortnite tournament during the final Juice WRLD Day at Chicago’s United Center. In celebration of the upcoming release of The Party Never Ends, Juice WRLD’s highly anticipated final, posthumous album dropping on November 29, Xbox is partnering with Interscope, Grade A, and Life Free 999 to launch a custom in-game Island – “Juice WRLD: The Party Never Ends” – inspired by the artist. Fans can dive into this unique experience starting November 30, 2024. Please note: this is not sponsored, endorsed, or administered by Epic Games, Inc. This Island features an epic tower-climbing race set amid stunning landscapes of lush mountains, serene lakes, and open fields. Along the way, players will be able to chill at Xbox Lounges, where they’ll hear a snippet of an unreleased Juice WRLD track alongside fan-favorite hits like “Lucid Dreams,” “Wishing Well,” and “Robbery.” Juice-related imagery and collectibles are woven throughout the experience, ensuring fans feel truly immersed in his world. Xbox will also launch Juice WRLD-inspired Xbox Design Lab controllers, available to order starting today. These custom designs honor Juice WRLD’s bold style and love for gaming, giving fans a unique way to incorporate his influence into their gaming setups. You can order them here. The celebration doesn’t stop there—on November 30, Xbox will host a live, in-person Fortnite tournament during the fourth annual and final Juice WRLD Day at Chicago’s United Center. Local students will compete in the custom Island finale, adding excitement to a day filled with an exclusive listening experience, surprise performances, and more. It’s a tribute fans won’t want to miss!",
  "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/XDL_Social-Media-0_38388221_1920x1080-1-6f1650cb57117679e46e.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003eOn November 30, a custom Juice WRLD-themed Fortnite Island, “Juice WRLD: The Party Never Ends” launches, featuring unreleased music, iconic tracks, and Xbox Lounges.\u003c/li\u003e\u003cli\u003eXbox will release two Juice WRLD-inspired Xbox Design Lab controllers.\u003c/li\u003e\u003cli\u003eXbox will also host a live Fortnite tournament during the final Juice WRLD Day at Chicago’s United Center.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eIn celebration of the upcoming release of \u003cem\u003eThe Party Never Ends\u003c/em\u003e, Juice WRLD’s highly anticipated final, posthumous album dropping on November 29, Xbox is partnering with Interscope, Grade A, and Life Free 999 to launch a custom in-game Island – “Juice WRLD: The Party Never Ends” – inspired by the artist. Fans can dive into this unique experience starting November 30, 2024. Please note: this is not sponsored, endorsed, or administered by Epic Games, Inc.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis Island features an epic tower-climbing race set amid stunning landscapes of lush mountains, serene lakes, and open fields. Along the way, players will be able to chill at Xbox Lounges, where they’ll hear a snippet of an unreleased Juice WRLD track alongside fan-favorite hits like “Lucid Dreams,” “Wishing Well,” and “Robbery\u003cem\u003e.\u003c/em\u003e” Juice-related imagery and collectibles are woven throughout the experience, ensuring fans feel truly immersed in his world.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/16x9-Xbox-Controller-a93a946750c6069c9204.jpg\" alt=\"Juice Wrld Xbox Controller\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/16x9-Xbox-Controller-a93a946750c6069c9204.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/16x9-Xbox-Controller-a93a946750c6069c9204-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/16x9-Xbox-Controller-a93a946750c6069c9204-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/16x9-Xbox-Controller-a93a946750c6069c9204-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eXbox will also launch Juice WRLD-inspired Xbox Design Lab controllers, available to order starting today. These custom designs honor Juice WRLD’s bold style and love for gaming, giving fans a unique way to incorporate his influence into their gaming setups. You can order them \u003ca href=\"https://xboxdesignlab.xbox.com/#anchor-inspiration?ocid=JuiceWRLD_soc_emc_xbo_tw_buy\"\u003e\u003cstrong\u003ehere\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e\u003cu\u003e.\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe celebration doesn’t stop there—on November 30, Xbox will host a live, in-person Fortnite tournament during the fourth annual and final Juice WRLD Day at Chicago’s United Center. Local students will compete in the custom Island finale, adding excitement to a day filled with an exclusive listening experience, surprise performances, and more. It’s a tribute fans won’t want to miss!\u003c/p\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-27T18:00:00Z",
  "modifiedTime": "2024-11-27T12:38:46Z"
}
