{
  "id": "7ab0a40d-e5d2-43f8-bc33-75085f4951a3",
  "title": "Kotaku Weekend Guide: 5 Great Games We Can’t Wait To Dive Into",
  "link": "https://kotaku.com/kotaku-weekend-guide-games-marvel-rivals-freedom-wars-1851737421",
  "description": "We’re two weekends into January. How’s everyone’s 2025 going? Have you kept up with your New Year’s resolutions? I’m ten days without soda, but less than 30 minutes without an existential crisis about the state of the world. So it’s been a “mixed bag,” as they say. But another one of my resolutions is to play more…Read more...",
  "author": "Kenneth Shepard, Ethan Gach, Carolyn Petit, and John Walker",
  "published": "Fri, 10 Jan 2025 22:00:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "carolyn petit",
    "dragon age",
    "john walker",
    "ps2",
    "rpg",
    "ethan gach",
    "ps3",
    "dragon age the veilguard",
    "kenneth shepard",
    "google"
  ],
  "byline": "Ethan Gach, John Walker, Carolyn Petit, Kenneth Shepard",
  "length": 5790,
  "excerpt": "Marvel Rivals’ new season is this weekend, but we also have suggestions for solo adventures",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "Image: Bandai Namco / BioWare / Marvel We’re two weekends into January. How’s everyone’s 2025 going? Have you kept up with your New Year’s resolutions? I’m ten days without soda, but less than 30 minutes without an existential crisis about the state of the world. So it’s been a “mixed bag,” as they say. But another one of my resolutions is to play more games than I did last year, and that means carving out some time this weekend for some games. If you, too, are wondering what you could play this weekend to combat the horrors, we’ve got a few suggestions. Play it on: PC, PS5, Xbox Series X/SCurrent goal: Become a Mister Fantastic mainLast weekend I got in some matches as all my favorite Marvel Rivals characters because this weekend I’m about to go ham on Mister Fantastic. I’m a simple guy, I see a man in his 40s with a beard and some grey around his temples and I have to play as him until his spell no longer captivates me. I’ve played around a little with the elastic hero’s kit since he launched this morning, but tonight I’m grouping up with friends to make sure randos don’t autolock him and deprive me of hours of his DPS/tank hybrid playstyle. I’m about to send Hela’s ult back at her and then punch her out of the sky. — Kenneth ShepardPlay it on: PC, PS5, Xbox Series X/S, SwitchCurrent goal: See what all the fuss was about2025 has just begun and there’s not a lot new to play yet. So if I can pry myself away from Marvel Rivals’ Season 1 this weekend, I want to go back and play some of the things I missed in 2024. I still don’t really know Animal Well’s deal, but I do know it ranked pretty high on our Game of the Year list thanks to the passion of those who liked it here at Kotaku. I know it’s a Metroidvania and has some spooky vibes to it, but that’s about as far as my knowledge goes. I haven’t booted up my Switch nearly enough in recent months, so now is the time for me to do so and find out what I’ve been missing. — Kenneth ShepardPlay it on: PS5, PS4, Switch, PCCurrent goal: Complete my CODE 3 exam I was one of those weirdos that got really into Freedom Wars on the PlayStation Vita back in 2014. There were a lot fewer games back then, and the satirical, sci-fi anime vibes wrapped around the Monster Hunter-like gameplay worked really well. It was just the right kind of flashy but repetitive action-RPG for a handheld at the time.How does it hold up over a decade later? Surprisingly well! The upscaled graphics are dated but crisp, sort of like how your imagination remembers PS2 games looking. No weird texture smoothing or other common remaster complaints. Some much-needed gameplay tweaks also help even out the grind, like no longer needing to mash buttons to sever off enemy limbs (you can just hold the button now).All in all it’s led to a pretty painless and quite enjoyable trip down memory lane. The political dystopia humor still hits, and 10 years later there’s still no flavor of Monster Hunter quite like Freedom Wars. I don’t know how long my vacation to the post-apocalyptic panopticon will last, but for now I really hope the Vita exclusive’s arrival on modern platforms will pave the way for the sequel the game always deserved. - Ethan Gach Play it on: PC, PS3, XboxCurrent goal: Revisit a classic Often, the end of one year and the start of the next is a quiet time for game releases, offering me a rare opportunity to catch up on games I missed or revisit old favorites that are calling out to me for a replay. Right now, the game I can’t stop thinking about revisiting is Dragon Age: Origins. I haven’t played it in any real way since around the time it was released, and while I enjoyed The Veilguard, all the ways in which it’s so different from the first game leave me wanting to explore that contrast. How does the original’s tactical combat feel now that I’ve experienced the action of The Veilguard? How does the quest of the original’s heroes, who have few creature comforts and often sleep under the stars, feel in the wake of The Veilguard’s story, with its cozy hangout vibes as party members become friends within the relative luxury of the Lighthouse? In some ways, I’m sure I’ll prefer Origins, though revisiting it may also help me view and appreciate The Veilguard in new ways, too. One thing’s for sure: since I’ve only properly played Origins once, there’s still much in it I have yet to experience. Can it still cast a spell on me after all these years? - Carolyn PetitPlay it on: AndroidCurrent goal: Stop myself Google Play Pass is really good, as it turns out. Apple may fund developers to make games only for its horrid closed system, but Google seems to have gotten into the habit of noticing what’s popular and just sticking it into their own version of a subscription service. I’ve played a whole bunch of stuff I’ve thoroughly enjoyed that way. And sometimes the additions are bizarre and seemingly based on no pattern at all, which I guess is how Grids of Thermometers got on there. And I love it.There’s a version of sudoku that was invented by Cracking the Cryptic which uses a similar principle, but this puzzler is a lot simpler. It’s about filling in a grid based on the numbers along the X and Y axes, and the rule that a thermometer running across tiles, horizontally or vertically, is filled from the bottom up. Oh, I’m not going to try to explain it all here. Just download it if you’ve got Play Pass and thank me later.It’s my current go-to game for playing while watching TV (no, I’m not part of the monstrous second-screen generation, I’m old-school ADHD with a brain that can’t do one thing at a time), and given I plan to spend this weekend just lying on a sofa and complaining about my painful wisdom-tooth-deprived mouth, that seems to be the most likely game I’ll play. - John Walker",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/310f1ba5b3300e3790b890fe3cfd13af.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cfigure id=\"\" data-id=\"310f1ba5b3300e3790b890fe3cfd13af\" data-recommend-id=\"image://310f1ba5b3300e3790b890fe3cfd13af\" data-format=\"jpg\" data-width=\"1920\" data-height=\"1080\" data-lightbox=\"false\" data-alt=\"Art from Dragon Age, Marvel Rivals, and Freedom Wars.\" data-recommended=\"false\" data-hide=\"false\" contenteditable=\"false\" draggable=\"false\"\u003e\u003cdiv contenteditable=\"false\" data-alt=\"Art from Dragon Age, Marvel Rivals, and Freedom Wars.\" data-link-reference=\"\" data-link-target=\"\" data-syndicationrights=\"true\" data-imagerights=\"fair-use\" data-hide=\"false\" data-hidecredit=\"false\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 49.94em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_965/310f1ba5b3300e3790b890fe3cfd13af.jpg\"/\u003e\u003csource media=\"(min-width: 50em) and (max-width: 63.69em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1315/310f1ba5b3300e3790b890fe3cfd13af.jpg\"/\u003e\u003csource media=\"(min-width: 63.75em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1600/310f1ba5b3300e3790b890fe3cfd13af.jpg\"/\u003e\u003cimg alt=\"Art from Dragon Age, Marvel Rivals, and Freedom Wars.\" data-chomp-id=\"310f1ba5b3300e3790b890fe3cfd13af\" data-format=\"jpg\" data-height=\"1080\" data-alt=\"Art from Dragon Age, Marvel Rivals, and Freedom Wars.\" data-anim-src=\"\" src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/310f1ba5b3300e3790b890fe3cfd13af.jpg\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cp\u003e\u003cfigcaption\u003eImage: Bandai Namco / BioWare / Marvel\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cspan data-id=\"310f1ba5b3300e3790b890fe3cfd13af\" data-recommend-id=\"image://310f1ba5b3300e3790b890fe3cfd13af\" data-format=\"jpg\" data-width=\"1920\" data-height=\"1080\" data-lightbox=\"false\" data-alt=\"Art from Dragon Age, Marvel Rivals, and Freedom Wars.\" data-recommended=\"false\" data-hide=\"false\"\u003e\u003c/span\u003e\u003c/figure\u003e\u003cp\u003e We’re two weekends into January. How’s everyone’s 2025 going? Have you kept up with your New Year’s resolutions? I’m ten days without soda, but less than 30 minutes without an existential crisis about the state of the world. So it’s been a “mixed bag,” as they say. But another one of my resolutions is to play more games than I did last year, and that means carving out some time this weekend for some games. If you, too, are wondering what you could play this weekend to combat the horrors, we’ve got a few suggestions. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003ePlay it on: PC, PS5, Xbox Series X/S\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCurrent goal: Become a Mister Fantastic main\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eLast weekend I got in some matches as all my favorite \u003cem\u003eMarvel Rivals\u003c/em\u003e characters because this weekend I’m about to go ham on Mister Fantastic. I’m a simple guy, I see a man in his 40s with a beard and some grey around his temples and I have to play as him until his spell no longer captivates me. I’ve played around a little with the elastic hero’s kit since he launched this morning, but tonight I’m grouping up with friends to make sure randos don’t autolock him and deprive me of hours of his DPS/tank hybrid playstyle. I’m about to send Hela’s ult back at her and then punch her out of the sky. — Kenneth Shepard\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003ePlay it on: PC, PS5, Xbox Series X/S, Switch\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCurrent goal: See what all the fuss was about\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e2025 has just begun and there’s not a lot new to play yet. So if I can pry myself away from \u003cem\u003eMarvel Rivals\u003c/em\u003e’ Season 1 this weekend, I want to go back and play some of the things I missed in 2024. I still don’t really know \u003cem\u003eAnimal Well\u003c/em\u003e’s deal, but I do know it ranked pretty high on our Game of the Year list thanks to the passion of those who liked it here at \u003cem\u003eKotaku\u003c/em\u003e. I know it’s a Metroidvania and has some spooky vibes to it, but that’s about as far as my knowledge goes. I haven’t booted up my Switch nearly enough in recent months, so now is the time for me to do so and find out what I’ve been missing. — Kenneth Shepard\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003ePlay it on:\u003c/strong\u003e PS5, PS4, Switch, PC\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCurrent goal:\u003c/strong\u003e Complete my CODE 3 exam \u003c/p\u003e\u003cp\u003eI was one of those weirdos that got really into\u003cem\u003e \u003c/em\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/freedom-wars-remastered-vita-ps5-switch-scifi-rpg-1851651681\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/freedom-wars-remastered-vita-ps5-switch-scifi-rpg-1851651681\"\u003e\u003cem\u003eFreedom Wars \u003c/em\u003eon the PlayStation Vita\u003c/a\u003e\u003c/span\u003e back in 2014. There were a lot fewer games back then, and the satirical, sci-fi anime vibes wrapped around the \u003cem\u003eMonster Hunter\u003c/em\u003e-like gameplay worked really well. It was just the right kind of flashy but repetitive action-RPG for a handheld at the time.\u003c/p\u003e\u003cp\u003eHow does it hold up over a decade later? Surprisingly well! The upscaled graphics are dated but crisp, sort of like how your imagination remembers PS2 games looking. No weird texture smoothing or other common remaster complaints. Some much-needed gameplay tweaks also help even out the grind, like no longer needing to mash buttons to sever off enemy limbs (you can just hold the button now).\u003c/p\u003e\u003cp\u003eAll in all it’s led to a pretty painless and quite enjoyable trip down memory lane. The political dystopia humor still hits, and 10 years later there’s still no flavor of \u003cem\u003eMonster Hunter\u003c/em\u003e quite like \u003cem\u003eFreedom Wars\u003c/em\u003e. I don’t know how long my vacation to the post-apocalyptic panopticon will last, but for now I really hope the Vita exclusive’s arrival on modern platforms will pave the way for the sequel the game always deserved. - Ethan Gach \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003ePlay it on:\u003c/strong\u003e PC, PS3, Xbox\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCurrent goal: \u003c/strong\u003eRevisit a classic \u003c/p\u003e\u003cp\u003eOften, the end of one year and the start of the next is a quiet time for game releases, offering me a rare opportunity to catch up on games I missed or revisit old favorites that are calling out to me for a replay. Right now, the game I can’t stop thinking about revisiting is \u003cem\u003eDragon Age: Origins. \u003c/em\u003eI haven’t played it in any real way since around the time it was released, and while I enjoyed \u003cem\u003eThe Veilguard\u003c/em\u003e, all the ways in which it’s so different from the first game leave me wanting to explore that contrast. How does the original’s tactical combat feel now that I’ve experienced the action of \u003cem\u003eThe Veilguard\u003c/em\u003e? How does the quest of the original’s heroes, who have few creature comforts and often sleep under the stars, feel in the wake of \u003cem\u003eThe Veilguard\u003c/em\u003e’s story, with its cozy hangout vibes as party members become friends within the relative luxury of the Lighthouse? In some ways, I’m sure I’ll prefer \u003cem\u003eOrigins\u003c/em\u003e, though revisiting it may also help me view and appreciate \u003cem\u003eThe Veilguard \u003c/em\u003ein new ways, too. One thing’s for sure: since I’ve only properly played \u003cem\u003eOrigins \u003c/em\u003eonce, there’s still much in it I have yet to experience. Can it still cast a spell on me after all these years? - Carolyn Petit\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003ePlay it on: \u003c/strong\u003eAndroid\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCurrent goal: \u003c/strong\u003eStop myself \u003c/p\u003e\u003cp\u003eGoogle Play Pass is really good, as it turns out. Apple may fund developers to make games only for its horrid closed system, but Google seems to have gotten into the habit of noticing what’s popular and just sticking it into their own version of a subscription service. I’ve played a whole bunch of stuff I’ve thoroughly enjoyed that way. And sometimes the additions are bizarre and seemingly based on no pattern at all, which I guess is how \u003cem\u003eGrids of Thermometers\u003c/em\u003e got on there. And I love it.\u003c/p\u003e\u003cp\u003eThere’s a version of sudoku that was invented by \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/it-s-legit-thrilling-watching-this-man-solve-an-intense-1843588556\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/it-s-legit-thrilling-watching-this-man-solve-an-intense-1843588556\"\u003eCracking the Cryptic\u003c/a\u003e\u003c/span\u003e which uses a similar principle, but this puzzler is a lot simpler. It’s about filling in a grid based on the numbers along the X and Y axes, and the rule that a thermometer running across tiles, horizontally or vertically, is filled from the bottom up. Oh, I’m not going to try to explain it all here. Just download it if you’ve got Play Pass and thank me later.\u003c/p\u003e\u003cp\u003eIt’s my current go-to game for playing while watching TV (no, I’m not part of the monstrous second-screen generation, I’m old-school ADHD with a brain that can’t do one thing at a time), and given I plan to spend this weekend just lying on a sofa and complaining about my painful wisdom-tooth-deprived mouth, that seems to be the most likely game I’ll play. - John Walker\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-10T17:00:00-05:00",
  "modifiedTime": null
}
