{
  "id": "86d6429a-a3b8-408c-b733-9cefbab0f5d9",
  "title": "Poker Face Season 2 Ending Explained: Does It Set Up Season 3?",
  "link": "https://www.ign.com/articles/poker-face-season-2-ending-explained-does-it-set-up-season-3",
  "description": "Poker Face Season 2 has officially come to an end. Here's what's up with that ending, and how the finale sets up a potential Season 3.",
  "author": "Amelia Emberwing",
  "published": "Fri, 11 Jul 2025 01:07:37 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Alex Zalben",
  "length": 9059,
  "excerpt": "Poker Face Season 2 has officially come to an end. Here's what's up with that ending, and how the finale sets up a potential Season 3.",
  "siteName": "IGN",
  "favicon": "",
  "text": "This article contains spoilers for the Poker Face Season 2 finale, “End Of The Road.”With this week’s finale of Poker Face, Charlie Cale (Natasha Lyonne) has uttered her final “bullshit” – at least for the time being. The Season 2 finale “End of the Road” was a wild episode of the Peacock series that revealed the Moriarty to Charlie’s Sherlock Holmes, included a bonkers cliffhanger that immediately resolved itself, and then changed everything for the series going into a potential Season 3.There’s a lot to unpack here, including the twists topped on twists topped on twists that go back to not just last week’s episode, “Day of the Iguana,” but have been teased in the background since Charlie hit up New York in Episode 9, “A New Lease on Death.”You ready? Here’s the big shocker: Alex (Patti Harrison), isn’t a regular lady who made friends with Charlie and is starting an oyster shucking business called Yippee Kay Yay Oystershucker… She’s the world’s greatest assassin, The Iguana. And she’s been lying to Charlie this whole time.Poker Face Season 2 Ending ExplainedTo lay this all out in order, Alex – or rather, The Iguana – was hired to kill a CEO who was hidden in a panic room 300 feet under the Alaskan tundra. And when she did, she realized that it was too easy, and she was bored. The Iguana was ready to give up entirely until her agent offered her the job killing mob boss Beatrix Hasp (Rhea Perlman), who was at the time in protective custody after making a deal with Charlie in Episode 3, “Whack-a-Mole.” And what intrigued The Iguana was that it’s impossible to lie to Charlie.“When I realized my kryptonite might exist, I couldn’t wait to meet you,” the Iguana explains. That leads us to the moment where she gave the wrong coffee order to Charlie in Episode 9 – and thanks to superhuman control of her sweat glands, adrenaline, voice, body, etc… She was able to successfully lie to Charlie. And then kept lying to her throughout the subsequent episodes… Which she loved, because it was a “herculean effort” every time.Knowing that Charlie is a compulsive do-gooder, she discovered that Beatrix’s son (played by Haley Joel Osment) was getting married. She hired the world’s second greatest assassin to kill a teacher invited to the wedding, then the son, and frame her (meaning The Iguana). Slightly complicating things, the second greatest assassin is a master of disguise, so Justin Theroux played both the teacher and the assassin. Anyway, The Iguana killed Assassin #2 and dumped him in the water, knowing that if Charlie saw “Alex” with the body of the dead son, she would try to help clear her name and take her right to Beatrix Hasp – which is exactly what happened.There are some other twists and turns along the way, but the short version is that with all this out in the open and some quick thinking from Charlie, the FBI closes in on the duo, who end up going over a cliff Thelma \u0026 Louise-style to their deaths in Charlie’s vintage Barracuda. OR DO THEY?? No, they don’t. Despite a “To Be Continued” title card, the cliffhanger is resolved immediately. Charlie throws herself out of the car at the last second… And when the FBI checks the fiery remains of the vehicle at the bottom of a cliff, there’s no body. So The Iguana lives to plague Charlie another day, too.The whole thing is extremely Sherlock and Moriarty to the point that the Iguana says that out loud. But it’s also a riff on the classic fight between the detective and villain duo at the Reichenbach Falls in “The Final Problem.” In that case, Holmes and Moriarty seemingly died; in “End of the Road,” Charlie is definitely alive, and the Iguana seems likely to have survived, as well.That brings us to the end of the episode. Luca Clark (Simon Helberg), Charlie’s friend and FBI contact, rescues her from falling over the cliff, only to provide a punch in the gut: Charlie has to go back on the run.“You just aided and abetted a serial killer, you got a federal witness killed, you revealed the location of a WITSEC safe house, if I keep listing the federal crimes you committed they’ll be here,” Clark explains. “You’ve officially wanted by the FBI.”He gives her a head start, but not before the sobbing Charlie gets a coat from him to keep her warm until she gets to a service road on the highway.“Next time, Charlie, I will arrest you,” Clark says. “I mean I have to at this point.”The final scene, to the tune of “It’s All Over Now, Baby Blue,” by Bob Dylan, finds Charlie trying to hitchhike on the highway, while a stray dog (credited as “the scamp” and played by a dog named Rootbeer) tags along. She ultimately is picked up by a big rig driver (played by Steve Earle) – who confusingly is not Steve Buscemi, the truck driver she’s been communicating with via CB radio all season long.“So, where ya headed?” the driver asks.“Oh, well, I guess that’s a deceptively profound question,” Charlie shoots back. He’s heading to Wichita, and so Charlie and the stray tag along.Poker Face Season 2 GalleryTo take a step back here, Season 1 of Poker Face found Charlie on the run from the mob, a plotline that was somewhat surprisingly resolved back in Episode 3 of Season 2. Most of the rest of this season has been spent with her trying to figure out what’s next, still moving from town to town but trying to find a new home… Only to instead be presented with the worst of humanity each time. The low point came in Episode 7, “One Last Job,” which presented Charlie with a sweet romance with Bill Jackson (Corey Hawkins), only to find him murdered by his best friend and have his body propped up as a display Santa in a big box store.When Charlie cries at the end of the episode, it isn’t just about losing her freedom once again, it’s that after the death of Bill, “Alex” was her salvation – or at least something steady and normal in the middle of murders-of-the-week. As the Iguana explains it, she was playing Watson to Charlie’s Holmes, when really she was Moriarty the whole time. Now, after thinking she’s finally figured it all out, Charlie’s on the road again without a friend, without her car, without anything except the clothes on her back and a mangy mutt.Will There Be A Poker Face Season 3?As of this writing, Poker Face hasn’t been picked up for Season 3, but don’t panic! Season 2 was announced about a month after Season 1 premiered. And while more time has passed since Season 2 premiered on May 8, we’re also in a very different streaming world in terms of renewals and cancellations. The second season debuted strongly on Nielsen’s Top 10 for streaming originals, so there’s every reason to think that Peacock would like to stay in business with both Natasha Lyonne and producer Rian Johnson. Will it get renewed, though? We’ll have to wait and see.How Does The Finale Set Up Season 3?So assuming there is a Poker Face Season 3, there are a couple of things we know would likely happen. First there’s the dynamic flip that the FBI is now after Charlie, versus the mob. That puts her in the interesting situation of not having Luca there to help her, as he previously has. And it also puts her on the wrong side of the law when it comes to solving mysteries.To be clear, there’s zero chance the show will ditch its done-in-one mystery format. But with Season 2 having a clearer emotional arc for Charlie, offering her a life before snatching it away, Season 3 could potentially play with whether she wants a life at all. Does she delve more into The Iguana’s world and try to ignore mysteries? Or cause crime, rather than solving it? Charlie is still a good person, so likely not. But it could be an interesting thread for co-showrunners Nora and Lily Zuckerman to play with.the show has killed off a lot of the cast.As for returning characters, the show has killed off a lot of the cast. But it’s likely Luca would return as a recurring, reluctant antagonist. And we could definitely get Patti Harrison back as The Iguana, as well. On that note, the show introduced some wildly weird spy/sci-fi elements in these last two episodes, thanks to Assassin #2 melting a dude down to goop and then dressing up as him, as well as everything with The Iguana. Would Poker Face go full Bond in Season 3? Maybe, though it excels by focusing on the normal folks around the edges of society, so that might be a step in the wrong direction.There’s also the question of transportation… Charlie’s car is gone, and they could certainly just get her a new Barracuda. But given she bonded with Steve Buscemi’s mysterious trucker, and Season 2 ended with a trucker taking her to Wichita, could we see more of a big rig driving theme? And finally meet Buscemi’s Good Buddy? And perhaps most importantly of all, is Rootbeer the dog now a permanent part of the cast? He seems pretty cute, and the idea of Natasha Lyonne hanging out with a mutt for 10 episodes is a delightful one. Whatever happens, fingers crossed the show does get picked up for Season 3 because cancelling this fantastic, critically acclaimed series would be – to quote Charlie Cale – bullshit.",
  "image": "https://assets-prd.ignimgs.com/2022/10/26/pokerfaceofficialteaser-ign-blogroll-1666801148508.jpg?width=1280\u0026format=jpg\u0026auto=webp\u0026quality=80",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003eThis article contains spoilers for the Poker Face Season 2 finale, “End Of The Road.”\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWith this week’s finale of Poker Face, Charlie Cale (Natasha Lyonne) has uttered her final “bullshit” – at least for the time being. The Season 2 finale “End of the Road” was a wild episode of the Peacock series that revealed the Moriarty to Charlie’s Sherlock Holmes, included a bonkers cliffhanger that immediately resolved itself, and then changed everything for the series going into a potential Season 3.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThere’s a lot to unpack here, including the twists topped on twists topped on twists that go back to not just last week’s episode, “Day of the Iguana,” but have been teased in the background since Charlie hit up New York in Episode 9, “A New Lease on Death.”\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eYou ready? Here’s the big shocker: Alex (Patti Harrison), isn’t a regular lady who made friends with Charlie and is starting an oyster shucking business called Yippee Kay Yay Oystershucker… She’s the world’s greatest assassin, The Iguana. And she’s been lying to Charlie this whole time.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003ePoker Face Season 2 Ending Explained\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eTo lay this all out in order, Alex – or rather, The Iguana – was hired to kill a CEO who was hidden in a panic room 300 feet under the Alaskan tundra. And when she did, she realized that it was too easy, and she was bored. The Iguana was ready to give up entirely until her agent offered her the job killing mob boss Beatrix Hasp (Rhea Perlman), who was at the time in protective custody after making a deal with Charlie in Episode 3, “Whack-a-Mole.” And what intrigued The Iguana was that it’s impossible to lie to Charlie.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e“When I realized my kryptonite might exist, I couldn’t wait to meet you,” the Iguana explains. That leads us to the moment where she gave the wrong coffee order to Charlie in Episode 9 – and thanks to superhuman control of her sweat glands, adrenaline, voice, body, etc… She was able to successfully lie to Charlie. And then \u003cem\u003ekept\u003c/em\u003e lying to her throughout the subsequent episodes… Which she loved, because it was a “herculean effort” every time.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eKnowing that Charlie is a compulsive do-gooder, she discovered that Beatrix’s son (played by Haley Joel Osment) was getting married. She hired the world’s second greatest assassin to kill a teacher invited to the wedding, then the son, and frame her (meaning The Iguana). Slightly complicating things, the second greatest assassin is a master of disguise, so Justin Theroux played both the teacher and the assassin. Anyway, The Iguana killed Assassin #2 and dumped him in the water, knowing that if Charlie saw “Alex” with the body of the dead son, she would try to help clear her name and take her right to Beatrix Hasp – which is exactly what happened.\u003c/p\u003e\u003coutput data-cy=\"article-video\"\u003e\u003c/output\u003e\u003cp data-cy=\"paragraph\"\u003eThere are some other twists and turns along the way, but the short version is that with all this out in the open and some quick thinking from Charlie, the FBI closes in on the duo, who end up going over a cliff Thelma \u0026amp; Louise-style to their deaths in Charlie’s vintage Barracuda. OR DO THEY?? No, they don’t. Despite a “To Be Continued” title card, the cliffhanger is resolved immediately. Charlie throws herself out of the car at the last second… And when the FBI checks the fiery remains of the vehicle at the bottom of a cliff, there’s no body. So The Iguana lives to plague Charlie another day, too.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe whole thing is \u003cem\u003eextremely\u003c/em\u003e Sherlock and Moriarty to the point that the Iguana says that out loud. But it’s also a riff on the classic fight between the detective and villain duo at the Reichenbach Falls in “The Final Problem.” In that case, Holmes and Moriarty seemingly died; in “End of the Road,” Charlie is definitely alive, and the Iguana seems likely to have survived, as well.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThat brings us to the end of the episode. Luca Clark (Simon Helberg), Charlie’s friend and FBI contact, rescues her from falling over the cliff, only to provide a punch in the gut: Charlie has to go back on the run.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e“You just aided and abetted a serial killer, you got a federal witness killed, you revealed the location of a WITSEC safe house, if I keep listing the federal crimes you committed they’ll be here,” Clark explains. “You’ve officially wanted by the FBI.”\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eHe gives her a head start, but not before the sobbing Charlie gets a coat from him to keep her warm until she gets to a service road on the highway.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e“Next time, Charlie, I will arrest you,” Clark says. “I mean I have to at this point.”\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe final scene, to the tune of “It’s All Over Now, Baby Blue,” by Bob Dylan, finds Charlie trying to hitchhike on the highway, while a stray dog (credited as “the scamp” and played by a dog named Rootbeer) tags along. She ultimately is picked up by a big rig driver (played by Steve Earle) – who confusingly is \u003cem\u003enot\u003c/em\u003e Steve Buscemi, the truck driver she’s been communicating with via CB radio all season long.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e“So, where ya headed?” the driver asks.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e“Oh, well, I guess that’s a deceptively profound question,” Charlie shoots back. He’s heading to Wichita, and so Charlie and the stray tag along.\u003c/p\u003e\u003coutput data-cy=\"article-slideshow\"\u003e\u003cdiv data-cy=\"slideshow-view-trigger\"\u003e\u003ch3 data-cy=\"slideshow-preview-title\"\u003ePoker Face Season 2 Gallery\u003c/h3\u003e\u003c/div\u003e\u003c/output\u003e\u003cp data-cy=\"paragraph\"\u003eTo take a step back here, Season 1 of Poker Face found Charlie on the run from the mob, a plotline that was somewhat surprisingly resolved back in Episode 3 of Season 2. Most of the rest of this season has been spent with her trying to figure out what’s next, still moving from town to town but trying to find a new home… Only to instead be presented with the worst of humanity each time. The low point came in Episode 7, “One Last Job,” which presented Charlie with a sweet romance with Bill Jackson (Corey Hawkins), only to find him murdered by his best friend and have his body propped up as a display Santa in a big box store.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWhen Charlie cries at the end of the episode, it isn’t just about losing her freedom once again, it’s that after the death of Bill, “Alex” was her salvation – or at least something steady and normal in the middle of murders-of-the-week. As the Iguana explains it, she was playing Watson to Charlie’s Holmes, when really she was Moriarty the whole time. Now, after thinking she’s finally figured it all out, Charlie’s on the road again without a friend, without her car, without anything except the clothes on her back and a mangy mutt.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eWill There Be A Poker Face Season 3?\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eAs of this writing, Poker Face hasn’t been picked up for Season 3, but don’t panic! Season 2 was \u003ca href=\"https://deadline.com/2023/02/poker-face-season-2-renewal-peacock-natasha-lyonne-rian-johnson-1235260233/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003eannounced\u003c/u\u003e\u003c/a\u003e about a month after Season 1 premiered. And while more time has passed since Season 2 premiered on May 8, we’re also in a very different streaming world in terms of renewals and cancellations. The second season \u003ca href=\"https://www.hollywoodreporter.com/tv/tv-news/streaming-ratings-may-5-11-2025-1236257047/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003edebuted strongly\u003c/u\u003e\u003c/a\u003e on Nielsen’s Top 10 for streaming originals, so there’s every reason to think that Peacock would like to stay in business with both Natasha Lyonne and producer Rian Johnson. Will it get renewed, though? We’ll have to wait and see.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eHow Does The Finale Set Up Season 3?\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eSo assuming there \u003cem\u003eis\u003c/em\u003e a Poker Face Season 3, there are a couple of things we know would likely happen. First there’s the dynamic flip that the FBI is now after Charlie, versus the mob. That puts her in the interesting situation of not having Luca there to help her, as he previously has. And it also puts her on the wrong side of the law when it comes to solving mysteries.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eTo be clear, there’s zero chance the show will ditch its done-in-one mystery format. But with Season 2 having a clearer emotional arc for Charlie, offering her a life before snatching it away, Season 3 could potentially play with whether she wants a life at all. Does she delve more into The Iguana’s world and try to ignore mysteries? Or cause crime, rather than solving it? Charlie is still a good person, so likely not. But it could be an interesting thread for co-showrunners Nora and Lily Zuckerman to play with.\u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003ethe show has killed off a \u003cem\u003elot\u003c/em\u003e of the cast.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eAs for returning characters, the show has killed off a \u003cem\u003elot\u003c/em\u003e of the cast. But it’s likely Luca would return as a recurring, reluctant antagonist. And we could definitely get Patti Harrison back as The Iguana, as well. On that note, the show introduced some wildly weird spy/sci-fi elements in these last two episodes, thanks to Assassin #2 melting a dude down to goop and then dressing up as him, as well as everything with The Iguana. Would Poker Face go full Bond in Season 3? Maybe, though it excels by focusing on the normal folks around the edges of society, so that might be a step in the wrong direction.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThere’s also the question of transportation… Charlie’s car is gone, and they could certainly just get her a new Barracuda. But given she bonded with Steve Buscemi’s mysterious trucker, and Season 2 ended with a trucker taking her to Wichita, could we see more of a big rig driving theme? And finally meet Buscemi’s Good Buddy? And perhaps most importantly of all, is Rootbeer the dog now a permanent part of the cast? He seems pretty cute, and the idea of Natasha Lyonne hanging out with a mutt for 10 episodes is a delightful one. Whatever happens, fingers crossed the show does get picked up for Season 3 because cancelling this fantastic, critically acclaimed series would be – to quote Charlie Cale – bullshit.\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-07-11T01:07:37.704Z",
  "modifiedTime": "2025-07-11T01:07:41.356Z"
}
