{
  "id": "9c6fa279-bcfe-4b52-a698-df4390627cfe",
  "title": "Soul Stalker: Can You Overcome Its Roguelike World Through Pure Skill?",
  "link": "https://news.xbox.com/en-us/2024/10/24/soul-stalker-can-you-overcome-its-roguelike-world-through-pure-skill/",
  "description": "The post Soul Stalker: Can You Overcome Its Roguelike World Through Pure Skill? appeared first on Xbox Wire.",
  "author": "johns",
  "published": "Thu, 24 Oct 2024 17:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "ID@Xbox"
  ],
  "byline": "johns",
  "length": 3873,
  "excerpt": "How to combine power-ups and utilize NPC interaction to get the best out of Soul Stalker, out now on Xbox.",
  "siteName": "Xbox Wire",
  "favicon": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryBattle hordes of corrupted apparitions.Gain world knowledge through NPC interaction and combine items for astounding loadout options.Progress through the ascension system to take full advantage of your overpowered builds. In Soul Stalker, you take on the role of one of 21 unique characters to protect earth-bound ghosts. Set in a distinctive 3D world with paper-like graphics, this bullet heaven roguelike places skill at the core of its design. Rather than improving through grinding, you’ll advance by mastering the game’s mechanics and learning to optimize the interactions between characters, weapons, and trinkets. Wield four to six weapons in simultaneous auto-attacking action to go on runs to defend your ghostly companions, while traversing combat encounters, campfires, and shops along the way. Each run typically lasts 20-25 minutes, and when you die, nothing except the currency called “Souls” carries over to your next attempt. Souls aren’t used for permanent upgrades but to unlock new weapons and trinkets, which you usually find on runs. You can also use them to create your ideal starting loadout. Instead of relying on grinding for stats, the game encourages you to improve by understanding the synergies between characters, weapons, and trinkets. For instance, you might come across a weapon that fires projectiles with a low cooldown and pierces multiple enemies. Pair this with a trinket that applies the “bleed” status effect and another that causes enemies to explode upon death from the bleed, and you’ll end up with a build that clears the screen in an instant by exploding everything in sight! Through learning these powerful combinations, you’ll consistently improve your runs by knowing what to focus on and adapt strategies accordingly. Characters are also a key part in making the strongest builds possible, and you unlock them by completing specific in-game objectives. For example, defeatinga boss with only one weapon unlocks Needle, the one-handed monk, while accumulating over 1,000 coins in a run grants you access to Penny, the merchant. As you unlock more characters, you’ll also discover more areas of the overworld and be able to chat with more of the ghosts you’re protecting. These ghosts can offer valuable tips on weapon and trinket combos, as well as insights into the mysterious events unfolding in Soul Stalker’s spectral world! Once you’ve honed your skills and mastered the interactions across the game’s 21 characters, 35 weapons, and 84 trinkets, you’ll be ready to tackle ascension levels. Ascension levels are difficulty modifiers that you can apply to a run, such as “enemies are tougher”, “heal less whenever you beat a boss”, or even “coins are no longer attracted to you at the end of combats”.  Whenever you beat an ascension level, you unlock the next one with every single character, and if you manage to beat the maximum of level of ten with any of them, you can find a Master Crystal in the overworld that allows you to get a special skin! Learn each character’s strengths and weaknesses and climb the ten ascensions to slay even the most dangerous of apparitions to become the ultimate Soul Stalker! You can play the game on October 24 on Xbox Series X|S, Xbox One, and Microsoft Store with a 10% launch discount until October 31. Soul Stalker is a bullet heaven roguelike where you assume the role of the steward of ghosts bound to eternal life on earth. Wield 4 to 6 weapons simultaneously to fend off waves of apparitions determined to defeat your spirited friends. Choose from a diverse pool of 21 characters, 35 weapons, 84 trinkets, and 21 pets to craft your ultimate build! Slay spooky souls, evolve your weapons, and progress through the Soul Stalker Society's hub to become an unstoppable force of nature.",
  "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Xbox-Thumbnail-25d045e1eea686ff4ac1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003carticle id=\"single-205121\" data-clarity-region=\"article\"\u003e\n\t\n\n\t\u003cdiv\u003e\n                    \n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003eBattle hordes of corrupted apparitions.\u003c/li\u003e\u003cli\u003eGain world knowledge through NPC interaction and combine items for astounding loadout options.\u003c/li\u003e\u003cli\u003eProgress through the ascension system to take full advantage of your overpowered builds.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eIn \u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/soul-stalker/9ntbbsczzzfj?msockid=23981e0c20b96bb600470b2d21036a65\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSoul Stalker\u003c/a\u003e\u003c/em\u003e, you take on the role of one of 21 unique characters to protect earth-bound ghosts. Set in a distinctive 3D world with paper-like graphics, this bullet heaven roguelike places skill at the core of its design. Rather than improving through grinding, you’ll advance by mastering the game’s mechanics and learning to optimize the interactions between characters, weapons, and trinkets.\u003c/p\u003e\n\n\n\n\u003cp\u003eWield four to six weapons in simultaneous auto-attacking action to go on runs to defend your ghostly companions, while traversing combat encounters, campfires, and shops along the way. Each run typically lasts 20-25 minutes, and when you die, nothing except the currency called “Souls” carries over to your next attempt.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-2-b207fdaf7b18ddb68cd4.jpg\" alt=\"Soul Stalker screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-2-b207fdaf7b18ddb68cd4.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-2-b207fdaf7b18ddb68cd4-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-2-b207fdaf7b18ddb68cd4-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-2-b207fdaf7b18ddb68cd4-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eSouls aren’t used for permanent upgrades but to unlock new weapons and trinkets, which you usually find on runs. You can also use them to create your ideal starting loadout. Instead of relying on grinding for stats, the game encourages you to improve by understanding the synergies between characters, weapons, and trinkets. For instance, you might come across a weapon that fires projectiles with a low cooldown and pierces multiple enemies. Pair this with a trinket that applies the “bleed” status effect and another that causes enemies to explode upon death from the bleed, and you’ll end up with a build that clears the screen in an instant by exploding everything in sight! Through learning these powerful combinations, you’ll consistently improve your runs by knowing what to focus on and adapt strategies accordingly.\u003c/p\u003e\n\n\n\n\u003cp\u003eCharacters are also a key part in making the strongest builds possible, and you unlock them by completing specific in-game objectives. For example, defeatinga boss with only one weapon unlocks Needle, the one-handed monk, while accumulating over 1,000 coins in a run grants you access to Penny, the merchant. As you unlock more characters, you’ll also discover more areas of the overworld and be able to chat with more of the ghosts you’re protecting. These ghosts can offer valuable tips on weapon and trinket combos, as well as insights into the mysterious events unfolding in \u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/soul-stalker/9ntbbsczzzfj?msockid=23981e0c20b96bb600470b2d21036a65\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSoul Stalker\u003c/a\u003e\u003c/em\u003e’s spectral world!\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1919\" height=\"1079\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935.jpg\" alt=\"Soul Stalker screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935.jpg 1919w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935-1536x864.jpg 1536w\" sizes=\"(max-width: 1919px) 100vw, 1919px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOnce you’ve honed your skills and mastered the interactions across the game’s 21 characters, 35 weapons, and 84 trinkets, you’ll be ready to tackle ascension levels. Ascension levels are difficulty modifiers that you can apply to a run, such as “enemies are tougher”, “heal less whenever you beat a boss”, or even “coins are no longer attracted to you at the end of combats”.  Whenever you beat an ascension level, you unlock the next one with every single character, and if you manage to beat the maximum of level of ten with any of them, you can find a Master Crystal in the overworld that allows you to get a special skin!\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1919\" height=\"1079\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-1-5bac4b106804851ce9f5.jpg\" alt=\"Soul Stalker screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-1-5bac4b106804851ce9f5.jpg 1919w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-1-5bac4b106804851ce9f5-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-1-5bac4b106804851ce9f5-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/Image-1-5bac4b106804851ce9f5-1536x864.jpg 1536w\" sizes=\"(max-width: 1919px) 100vw, 1919px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eLearn each character’s strengths and weaknesses and climb the ten ascensions to slay even the most dangerous of apparitions to become the ultimate Soul Stalker! You can play the game on October 24 on Xbox Series X|S, Xbox One, and Microsoft Store with a 10% launch discount until October 31.\u003c/p\u003e\n\n\n\n\u003cdiv data-product-id=\"9ntbbsczzzfj\" id=\"msp1729727602658\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9ntbbsczzzfj\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.39411.14417152687337717.d3093a6d-2949-4935-8b19-87305edb6eb1.2d315859-26f1-402e-8798-33108d7413c5?w=400\u0026amp;h=600\" alt=\"Soul Stalker\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png\" alt=\"Xbox Play Anywhere\"/\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tSoul Stalker is a bullet heaven roguelike where you assume the role of the steward of ghosts bound to eternal life on earth. Wield 4 to 6 weapons simultaneously to fend off waves of apparitions determined to defeat your spirited friends. Choose from a diverse pool of 21 characters, 35 weapons, 84 trinkets, and 21 pets to craft your ultimate build!\n\nSlay spooky souls, evolve your weapons, and progress through the Soul Stalker Society\u0026#39;s hub to become an unstoppable force of nature.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\u003c/div\u003e\n\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1919\" height=\"1079\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935.jpg\" alt=\"Soul Stalker screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935.jpg 1919w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/image-3-e2e78c3ed9cffcdb7935-1536x864.jpg 1536w\" sizes=\"(max-width: 1919px) 100vw, 1919px\"/\u003e\u003c/figure\u003e\n                \u003c/div\u003e\n\t\u003c/article\u003e\n\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-24T17:00:00Z",
  "modifiedTime": "2024-10-23T23:58:08Z"
}
