{
  "id": "9f139436-3faf-475a-8be2-815f5b8c4ffb",
  "title": "Put Your Phone Away And Just Watch The Movie",
  "link": "https://kotaku.com/wicked-singing-theater-phone-taking-pictures-screen-1851708935",
  "description": "The film adaptation of Wicked is breaking box office records and is likely to be the biggest movie of the Thanksgiving season. But it’s also become ground zero for a newly invigorated debate about theater etiquette that’s been raging for a few years now and is only getting more heated as more people than ever whip out…Read more...",
  "author": "Zack Zwiezen",
  "published": "Tue, 26 Nov 2024 23:10:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "theatres",
    "entertainment culture",
    "movie theater",
    "twitter",
    "auditoriums"
  ],
  "byline": "Zack Zwiezen",
  "length": 4624,
  "excerpt": "When you enter a theater, please have a little respect for the other people watching Wicked",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "The film adaptation of Wicked is breaking box office records and is likely to be the biggest movie of the Thanksgiving season. But it’s also become ground zero for a newly invigorated debate about theater etiquette that’s been raging for a few years now and is only getting more heated as more people than ever whip out their phones to take photos and videos of the latest big movie. Or start singing. And I’m here to tell these people to knock it off. Suggested ReadingLive Forever in the Universe of 'New World: Aeternum'Suggested ReadingAs I was scrolling the dying corpse of what was once called Twitter, I came across a tweet of someone sharing a photo they took of Wicked’s title card while watching the hit movie in a theater. They asked people to share their photos of seeing Wicked. Hundreds of people did. It was all very depressing and frustrating to see. It then led to even more people calling out the initial post and getting into online debates.The arguments that the people taking photos usually trot out include things like, “I had my screen dimmed and only took one or two pictures!” or “I paid money, I’m allowed to use my phone!” or even “I want to chat with my friends while watching a movie.” All of these arguments are dumb. I don’t care how dim your device’s screen is, you taking a photo is annoying. I’d also wager that anyone willing to hoist their camera up—possibly blocking other people’s view of the screen—to take an image of the movie in a packed theater is likely the kind of person who might also start singing or talking loudly, ruining the experience for other people trying to enjoy the film.Also, you paid money for a ticket to watch a movie. That’s it. That ticket doesn’t magically make you more important than anyone else or absolve you from following the same rules that apply to all moviegoers at your theater. How many fucking ads and videos begging you to turn off your phone and be quiet do you need to see before the movie starts? And if you want to chat with your friends or text or video call them or whatever, why are you doing that in a theater? If you are trying to reach someone because of an emergency, step outside. If someone you really want to talk to DMs you, step outside. If you get a phone call, please, step outside! One time while at a movie, I got a phone call from my father. I had my phone set to vibrate and when I got the call, I looked down, saw he called, got up and texted him from the hallway. It wasn’t an emergency, so I told him I’d call back later, put my phone away, and went back to my seat. It’s really that easy. Stop ruining the experienceAs for taking photos or videos of the screen for TikTok or whichever social media platform you prefer, just don’t do it. Perhaps you don’t care about the experience of seeing a movie in a dark theater, but a lot of people do. A lot of folks pay money, not a small amount these days, to eat some popcorn and enjoy a movie on a big screen in a room where we all collectively agree to be quiet and focused on one thing: the movie. It’s a truly amazing and magical experience. That might sound corny or like I’m taking movies super seriously, but I’m just being honest. I think you should watch movies however you want at home. Watch the latest arthouse flick on your phone. Binge the same MCU movies over and over and claim they are true cinema. Fine! But when you are in public in a theater, you have to act better. You have to have good movie manners. And look, I get it. I’m far too online. My job forces me to be online all the time. My phone is with me 24/7. I check the news at 2 a.m. and work on my vacation. I understand it might be hard to disconnect. But what I love about seeing a movie in a theater is that it forces me, for a few hours, to truly disconnect from reality and all the stresses of living online and just... disappear into a movie. Take advantage of this one rare moment where society (mostly) agrees on disconnecting and being quiet. When some jackass starts using their phone, it breaks all of that, especially if the screen is bright or they are being loud. I don’t want to hear your text message notification noise. I don’t want to see your phone’s glowing screen in the corner of my eye. I just want to watch a movie in a dark, quiet room on a giant screen for like three hours, and I paid money to do so. Don’t ruin that. If you can’t stop using your phone or talking, then go watch a movie at home and do whatever you want. That’s fine! Just leave theaters for people able to keep their phones in their pockets, muted and mostly forgotten, for a few precious hours. Please.",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/b87ebe3a26a06e7d25a22510c66f7ebb.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe film adaptation of \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/wicked-early-critic-reviews-cynthia-erivo-ariana-grande-1851687143\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/wicked-early-critic-reviews-cynthia-erivo-ariana-grande-1851687143\"\u003e\u003cem\u003eWicked\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e\u003cem\u003e \u003c/em\u003eis breaking box office records and is likely to be the biggest movie of the Thanksgiving season. But it’s also become ground zero for a newly invigorated debate about theater etiquette that’s been raging for a few years now and is only getting more heated as more people than ever whip out their phones to take photos and videos of the latest big movie. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.independent.co.uk/life-style/wicked-movie-release-fans-singing-amc-theaters-b2653257.html\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.independent.co.uk/life-style/wicked-movie-release-fans-singing-amc-theaters-b2653257.html\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eOr start singing\u003c/a\u003e\u003c/span\u003e. And I’m here to tell these people to knock it off. \u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"197298\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Live Forever in the Universe of \u0026#39;New World: Aeternum\u0026#39;\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"108\" data-playlist=\"197298,197284,197260\" data-current=\"197298\"\u003e\u003cdiv\u003e\u003cp\u003eLive Forever in the Universe of \u0026#39;New World: Aeternum\u0026#39;\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003c/video\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eAs I was scrolling the dying corpse of what was once called Twitter, I came across a tweet of someone sharing a photo they took of \u003cem\u003eWicked’s \u003c/em\u003etitle card while watching the hit movie in a theater. They asked people to share their photos of seeing \u003cem\u003eWicked\u003c/em\u003e. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/nat_dwbua_/status/1860541618060943677\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/nat_dwbua_/status/1860541618060943677\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eHundreds of people did\u003c/a\u003e\u003c/span\u003e. It was all very depressing and frustrating to see. It then led to even more people calling out the initial post and getting into online debates.\u003c/p\u003e\u003cp\u003eThe arguments that the people taking photos usually trot out include things like, “I had my screen dimmed and only took one or two pictures!” or “I paid money, I’m allowed to use my phone!” or even “I want to chat with my friends while watching a movie.” \u003c/p\u003e\u003cp\u003eAll of these arguments are dumb. \u003c/p\u003e\u003cp\u003eI don’t care how dim your device’s screen is, you taking a photo is annoying. I’d also wager that anyone willing to hoist their camera up—possibly blocking other people’s view of the screen—to take an image of the movie in a packed theater is likely the kind of person who might also start singing or talking loudly, ruining the experience for other people trying to enjoy the film.\u003c/p\u003e\u003cp\u003eAlso, you paid money for a ticket to watch a movie. That’s it. That ticket doesn’t magically make you more important than anyone else or absolve you from following the same rules that apply to all moviegoers at your theater. How many fucking ads and videos begging you to turn off your phone and be quiet do you need to see before the movie starts? \u003c/p\u003e\u003cp\u003eAnd if you want to chat with your friends or text or video call them or whatever, why are you doing that in a theater? If you are trying to reach someone because of an emergency, step outside. If someone you really want to talk to DMs you, step outside. If you get a phone call, please, step outside! \u003c/p\u003e\u003cp\u003eOne time while at a movie, I got a phone call from my father. I had my phone set to vibrate and when I got the call, I looked down, saw he called, got up and texted him from the hallway. It wasn’t an emergency, so I told him I’d call back later, put my phone away, and went back to my seat. It’s really that easy. \u003c/p\u003e\u003ch2 id=\"h55226\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eStop ruining the  experience\u003c/h2\u003e\u003cp\u003eAs for taking photos or videos of the screen for \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/video-game-tiktok-ban-baldurs-gate-3-genshin-impact-1851335795\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/video-game-tiktok-ban-baldurs-gate-3-genshin-impact-1851335795\"\u003eTikTok or whichever social media platform\u003c/a\u003e\u003c/span\u003e you prefer, just don’t do it. Perhaps you don’t care about the experience of seeing a movie in a dark theater, but a lot of people do. A lot of folks pay money, not a small amount these days, to eat some popcorn and enjoy a movie on a big screen in a room where we all collectively agree to be quiet and focused on one thing: the movie. \u003c/p\u003e\u003cp\u003eIt’s a truly amazing and magical experience. \u003c/p\u003e\u003cp\u003eThat might sound corny or like I’m taking movies super seriously, but I’m just being honest. I think you should watch movies however you want at home. Watch the latest arthouse flick on your phone. Binge the same MCU movies over and over and claim they are true cinema. Fine! But when you are in public in a theater, you have to act better. You have to have good movie manners. \u003c/p\u003e\u003cp\u003eAnd look, I get it. I’m far too online. My job forces me to be online all the time. My phone is with me 24/7. I check the news at 2 a.m. and work on my vacation. I understand it might be hard to disconnect. But what I love about seeing a movie in a theater is that it forces me, for a few hours, to truly disconnect from reality and all the stresses of living online and just... disappear into a movie. Take advantage of this one rare moment where society (mostly) agrees on disconnecting and being quiet. \u003c/p\u003e\u003cp\u003eWhen some jackass starts using their phone, it breaks all of that, especially if the screen is bright or they are being loud. I don’t want to hear your text message notification noise. I don’t want to see your phone’s glowing screen in the corner of my eye. I just want to watch a movie in a dark, quiet room on a giant screen for like three hours, and I paid money to do so. Don’t ruin that. \u003c/p\u003e\u003cp\u003eIf you can’t stop using your phone or talking, then go watch a movie at home and do whatever you want. That’s fine! Just leave theaters for people able to keep their phones in their pockets, muted and mostly forgotten, for a few precious hours. Please. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-26T18:10:00-05:00",
  "modifiedTime": null
}
