{
  "id": "aa930479-9d94-422b-b908-7b47e1edac61",
  "title": "\"PlayStation are great\" says Arrowhead's CEO, but whatever the Helldivers 2 devs are making next, it's fully self-funded",
  "link": "https://www.rockpapershotgun.com/playstation-are-great-says-arrowheads-ceo-but-whatever-the-helldivers-2-devs-are-making-next-its-fully-self-funded",
  "description": "Helldivers 2 developer Arrowhead Game Studios are cooking. I'm not exactly sure what just yet, but there's a faint aroma of a new game in the air, and it doesn't seem like they're ready to share anything about the game right now either. Still, after the runaway success of Helldivers 2, something new from the studio is still an exciting prospect. Interestingly enough though, whatever they're making, it won't have anything to do with PlayStation when it comes to funding. Read more",
  "author": "Oisin Kuhnke",
  "published": "Thu, 15 May 2025 21:55:07 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Multiplayer Competitive",
    "PC",
    "First person",
    "Comedy",
    "Science Fiction",
    "Arrowhead Game Studios",
    "Shooter",
    "Multiplayer Cooperative",
    "Third person",
    "Helldivers 2",
    "PS5",
    "Single Player"
  ],
  "byline": "Oisin Kuhnke",
  "length": 2354,
  "excerpt": "Helldivers 2 devs Arrowhead Game Studios haven't shared what they're working on next, but whatever it is, they're doing it with their own money.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/819f0fe3d3b6934f151a2f4a8618f938/icon/apple-touch-icon.png",
  "text": "\"Arrowhead's future is quite bright\" Image credit: Arrowhead Helldivers 2 developer Arrowhead Game Studios are cooking. I'm not exactly sure what just yet, but there's a faint aroma of a new game in the air, and it doesn't seem like they're ready to share anything about the game right now either. Still, after the runaway success of Helldivers 2, something new from the studio is still an exciting prospect. Interestingly enough though, whatever they're making, it won't have anything to do with PlayStation when it comes to funding. Arrowhead's CEO Shams Jorjani recently shared on Helldivers 2's official Discord (cheers, Forbes) that, thanks to the multiplayer game's success, their next game will be fully self-funded. \"The wonderful thing is that thanks to the amazing support of you FINE people Arrowhead's future is quite bright and we have the freedom to explore some really cool concepts that we couldn't have otherwise. Game 6 (our next project) will happen the way it will happen thanks to you,\" wrote Jorjani. After one member of the server asked for whatever said next game is to be available in all regions, Jorjani explained that \"the next game is 100% funded by ourselves so we'll call 100% of those shots.\" For some context, PlayStation tried to make it so that you needed a PSN account to play Helldivers 2 on PC last year, but that went down so badly they dropped the requirement. However, that did lead to the game being pulled from sale in a number of countries where PSN isn't available, presumably why the comment was made by said Discord member. To be clear though, it doesn't sound like Arrowhead's relationship with PlayStation has gone sour, as Jorjani said that the company is \"great\" and that \"there would be no Helldivers if it wasn't for them. We're open to working with them again in the future. They are incredibly game/dev oriented. Solid partners. And this is me just saying it like it is. Not blowing smoke up their asses.\" I'm sure whatever Arrowhead make next will be on PlayStation either way, but that doesn't really matter to us here does it? Personally, it's just nice to know they'll be able to do things their own way, and not lock out a huge number of people from playing a game for such a ridiculously arbitrary reason.",
  "image": "https://assetsio.gnwcdn.com/helldivers-2-shooting-bugs.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003e\u0026#34;Arrowhead\u0026#39;s future is quite bright\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n    \u003cimg src=\"https://assetsio.gnwcdn.com/helldivers-2-shooting-bugs.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/helldivers-2-shooting-bugs.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/helldivers-2-shooting-bugs.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Two Helldivers blast away at approaching alien bugs in Helldivers 2\" data-src-full=\"https://assetsio.gnwcdn.com/helldivers-2-shooting-bugs.png?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"382\" height=\"215\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eArrowhead\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\n\u003ca href=\"https://www.rockpapershotgun.com/games/helldivers-2\"\u003eHelldivers 2\u003c/a\u003e developer \u003ca href=\"https://www.rockpapershotgun.com/companies/arrowhead-game-studios\"\u003eArrowhead Game Studios\u003c/a\u003e are cooking. I\u0026#39;m not exactly sure what just yet, but there\u0026#39;s a faint aroma of a new game in the air, and it doesn\u0026#39;t seem like they\u0026#39;re ready to share anything about the game right now either. Still, after the runaway success of Helldivers 2, something new from the studio is still an exciting prospect. Interestingly enough though, whatever they\u0026#39;re making, it won\u0026#39;t have anything to do with \u003ca href=\"https://www.rockpapershotgun.com/companies/sony-playstation\"\u003ePlayStation\u003c/a\u003e when it comes to funding.\n\u003c/p\u003e\n\n\u003cp\u003e\nArrowhead\u0026#39;s CEO Shams Jorjani recently shared on Helldivers 2\u0026#39;s official Discord (cheers, \u003ca href=\"https://www.forbes.com/sites/paultassi/2025/05/15/helldivers-2-studios-next-game-will-be-free-from-playstation-partnership/\"\u003eForbes\u003c/a\u003e) that, thanks to the \u003ca href=\"https://www.rockpapershotgun.com/the-best-multiplayer-games-on-pc\"\u003emultiplayer\u003c/a\u003e game\u0026#39;s success, their next game will be fully self-funded. \u0026#34;The wonderful thing is that thanks to the amazing support of you FINE people Arrowhead\u0026#39;s future is quite bright and we have the freedom to explore some really cool concepts that we couldn\u0026#39;t have otherwise. Game 6 (our next project) will happen the way it will happen thanks to you,\u0026#34; wrote Jorjani.\n\u003c/p\u003e\n\u003cp\u003e\nAfter one member of the server asked for whatever said next game is to be available in all regions, Jorjani explained that \u0026#34;the next game is 100% funded by ourselves so we\u0026#39;ll call 100% of those shots.\u0026#34; For some context, PlayStation tried to make it so that you \u003ca href=\"https://www.rockpapershotgun.com/helldivers-2-pc-players-will-soon-need-to-link-their-steam-accounts-to-playstation-network\"\u003eneeded a PSN account to play Helldivers 2\u003c/a\u003e on PC last year, but that went down so badly they \u003ca href=\"https://www.rockpapershotgun.com/helldivers-2-drops-psn-account-linking-requirement-for-steam-players-after-widespread-backlash\"\u003edropped the requirement\u003c/a\u003e. However, that did lead to the game being pulled from sale in a number of countries where PSN isn\u0026#39;t available, presumably why the comment was made by said Discord member.\n\u003c/p\u003e\n\u003cp\u003e\nTo be clear though, it doesn\u0026#39;t sound like Arrowhead\u0026#39;s relationship with PlayStation has gone sour, as Jorjani said that the company is \u0026#34;great\u0026#34; and that \u0026#34;there would be no \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/helldivers\"\u003eHelldivers\u003c/a\u003e if it wasn\u0026#39;t for them. We\u0026#39;re open to working with them again in the future. They are incredibly game/dev oriented. Solid partners. And this is me just saying it like it is. Not blowing smoke up their asses.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nI\u0026#39;m sure whatever Arrowhead make next will be on PlayStation either way, but that doesn\u0026#39;t really matter to us here does it? Personally, it\u0026#39;s just nice to know they\u0026#39;ll be able to do things their own way, and not lock out a huge number of people from playing a game for such a ridiculously arbitrary reason.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-15T21:55:07.891573Z",
  "modifiedTime": null
}
