{
  "id": "ae7cedbd-e88b-4283-b996-b0dc2b4c8a92",
  "title": "Switch 2 Launch Day: Everything Happening As Fans Finally Go Hands-On With Nintendo's New Console",
  "link": "https://kotaku.com/switch-2-preorder-day-one-update-live-eshop-mario-kart-1851783549",
  "description": "A bunch of Switch 2s swirl in a circle.Nearly a decade after the original Switch came out, and following years of fans’ pining for a major upgrade to Nintendo’s wildly popular portable gaming platform, the Switch 2 is here. It’s already June 5—the console’s official launch date—in some parts of the world, and a…Read more...",
  "author": "Ethan Gach and Zack Zwiezen",
  "published": "Thu, 05 Jun 2025 21:53:11 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "nintendo",
    "video games developed in japan",
    "gamecube controller",
    "nintendo switch 2",
    "gamecube",
    "handheld game consoles",
    "joy con",
    "sean hollister",
    "nintendo switch online",
    "mario kart world",
    "zelda",
    "bowser",
    "walmart",
    "ars technica",
    "youtube",
    "mario kart",
    "gamestop",
    "tom marks",
    "john ricciardi",
    "mario kart 8",
    "home video game consoles",
    "video game sequels",
    "kyle orland",
    "nintendo switch"
  ],
  "byline": "Zack Zwiezen, Ethan Gach",
  "length": 10755,
  "excerpt": "The Switch 2 is already available in some parts of the world as the day-one patch goes live",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "A bunch of Switch 2s swirl in a circle.Nearly a decade after the original Switch came out, and following years of fans’ pining for a major upgrade to Nintendo’s wildly popular portable gaming platform, the Switch 2 is here. It’s already June 5—the console’s official launch date—in some parts of the world, and a day-one update with “important features and updates” is now live. People are finally starting to go hands-on with games like Mario Kart World, while others prepare for midnight launch parties in their respective time zones.Suggested ReadingNintendo Switch 2 Price Is Set at $450 for Now, But Could Go HigherOffEnglishSuggested ReadingWe’ll be updating this story throughout launch day so be sure to scroll to the end and check back for more news on what players are finding as Nintendo’s most anticipated console ever finally arrives in the wild.Unlike all of Nintendo’s previous consoles, the Switch 2 arrives without any reviews or extensive testing from media or content creators. With the exception of two preview events, the highly anticipated console is going out into the world fresh for everyone. Officially, Nintendo blamed that outcome on the need for a last-minute day-one update, VGC reported yesterday. That had kept even leakers who got the hardware ahead of launch from being able to actually play any games on it, including older Switch 1 cartridges. With the update now live, people have been able to start installing firmware version 20.1.1. It unlocks some of the Switch 2's most important features, including GameChat and access to the Nintendo eShop, Switch Online, virtual game cards, and the controversial game key cards that don’t actually contain the game. As a result, early players in New Zealand and other places have started sharing pictures online of the Switch 2 downloading new games like Mario Kart World while everyone else patiently waits for the clock to strike midnight in their region. The eShop runs great on Switch 2Here’s what the new eShop looks like, for example. After years of stuttering on the old console, it actually seems to run smoothly (for now):Mario Kart World 1.1.0 update makes more characters playable at the startA day-one patch is also live for the open-world racing sequel launch title. Mario Kart World 1.1.0 adds support for Camera Play, online multiplayer, and the ability to upload and download time trial ghosts. More importantly, it looks like Nintendo made some last-minute tuning adjustments as well. “We’ve increased the number of characters that can be selected from the start,” reads one of the patch notes. “The time limit for deciding on a course has been removed when playing Locally or LAN,” reads another. One big question on players’ minds: will blue shells actually be easier to dodge this time around than in past games?Here’s what the inside of a Switch 2 looks likeFor those interested in what’s actually going on inside the Switch 2, someone’s already uploaded a complete teardown of the new hardware. ProModding’s surgery on the console has already raised some important questions, like why is Nintendo hiding so many screws underneath hard-to-replace stickers on the side of the console?For anyone who doesn’t already have the console, Switch 2's launch day could be a lot rockier. While many secured pre-orders months ago, some stores in the U.S. have promised limited day-one inventory for people who show up at the midnight launch. The Switch 2 is expected to sell out at launch, but there’s a big question around just how hard it will be to get and for how long. Walmart has already begun cancelling some fans’ early pre-orders, and “out of stock” signs have been sent out to many stores. Switch 2 launch day stock is available at some stores but not for longAnother big question is when all of those online pre-orders will finally get delivered. My bundle from Target currently isn’t slated to arrive until June 11, so I’m heading to GameStop today to join the masses to try to score a launch-day unit. My local store said they’d have about 10 for people showing up without pre-orders. For now though, backroom inventory is at long last going out on store shelves. Hopefully, there aren’t too many horror stories of people failing to get theirs.Plus we’ll have to see how Nintendo’s servers hold up once the console is out across the globe and millions of players are trying to download games and day-one updates simultaneously. It’ll certainly put the Switch 2's allegedly improved Wi-Fi speeds to the test. Switch 2 can store more than double the number of screenshots Update 6/4/2025 11:02 a.m. ET: The original Switch limited players to 10,000 screenshots no matter how much extra room on an SD expansion card they had (via NintendoSoup). The Switch 2 not only increases that limit to 15,000 for the console itself, it also lets you store another 15,000 screenshots on the auxiliary microSD Express card. It might be enough to document every square inch of Mario Kart World. At the very least, no more sorting through what screenshots to delete in the short term anyway. Bowser’s Fury loads in 8 secondsUpdate 6/4/2025 12:51 p.m. ET: Nintendo’s open world Mario side-project loads lightning fast on Switch 2. Bowser’s Fury, an add-on for Mario Bros. 3D World on the original Switch, takes place in a big, seamless map. I just booted it up on the old hardware using the cartridge version, which is already known to be a couple seconds slower than the digital version, and it took 41 seconds. Footage of the game running on Switch 2 by VGC shows it loading in just 8 seconds. It’s one of many Nintendo games that received free updates for the new console but doesn’t have a paid Switch 2 upgrade. Nintendo Switch 2 Welcome Tour can’t be completed without a 4K TVUpdate 6/4/2025 1:48 p.m. ET: Welcome Tour seemed like the perfect pack-in for Nintendo’s new console: a series of neat mini-games teaching player show the machine works. Instead it’s a $10 download AND players have discovered you need a bunch of extra accessories to technically reach 100 percent completion (something the game tracks). Those additional peripherals include a webcam, a controller with GL/GR buttons, and a 4K TV or monitor display. Which diehard fans will buy a Piranha Plant cam just to hit that achievement? The Switch 2 setup music is a cozy little bangerUpdate 6/4/2025 3:45 p.m. ET: It’s a shame the Nintendo Switch 2 won’t have eShop music, but at least when you first set up the console, you get to hear a nice song. This has been floating around for a few days now, thanks to leaks, but now we have some higher-quality versions of it. Kyle Orland over at Ars Technica has a great recording of it. And here’s a (quiet) recording of it via YouTube. Someone has made Mario Kart’s famous cow eat beefUpdate 6/4/2025 3:48 p.m. ET: Breaking news! Tom Marks, the executive reviews editor at IGN, has released video of the beloved and popular cow from Mario Kart World eating what appears to be a beef burger.Everyone got a Switch 2 at Best Buy’s midnight launch in Union City, CAUpdate 6/5/2025 11:34 a.m. ET: The midnight launches of old returned for Switch 2 and went off without a hitch, mostly. Sean Hollister at The Verge reported hundreds in line at his Best Buy, including both people who pre-ordered the Switch 2 and day-of walk-ins, all went home with one, even if it took a while. My GameStop experience was similarly smoothed. About 60-70 of us were in line at midnight and got home within the hour, though our promised free Red Bulls never materialized. Unfortunately, not every midnight launch went so smoothly. A GameStop in Staten Island, NY was reportedly stapling receipts to the Switch 2 boxes it gave out, which accidentally ended up puncturing the screens of multiple new owner’s consoles due in part to the unusual way the device is boxed. It’s unclear how long those people will have to wait now to get replacement consoles, if GameStop decides to refund them. The GameCube controller has motion controlsUpdate 6/5/2025 11:52 a.m. ET: Nintendo released a new limited-supply replica GameCube controller for the Switch 2 and its new library of GameCube classics for Switch Online + Expansion Pack like The Legend of Zelda: Wind Waker. But the gamepad also also been revised somewhat and now includes motion controls that work with games like Splatoon 3. The new GameCube controller also has a dedicated GameChat button and, as one new owner who tore it apart discovered, a revised D-pad. The old dpad was attached ton the main pcb and had a really long shaft to account for the distance,” DimiBlue wrote on Reddit. “This new setup brings the pcb closer to the surface and increases accuracy by a lot. I’m looking forward to molding the new dpad to add to modded gamecube controllers.”GameChat is vacuum cleaner approvedUpdate 6/5/2025 4:07 p.m. ET: One of the features Nintendo touted when it revealed its new in-game chat and video sharing system was noise canceling that would help filter out sounds that aren’t part of what the person playing is saying. Well, Zelda YouTuber Mr A-Game put it to the test by vacuuming in the background while someone played Mario Kart World online. The GameChat audio itself wasn’t the best, but the signal came in without a hint of vacuum. Now I wonder how well it does with screaming kids in the background. Some Switch 2 games work on Switch 1Update 6/5/2025 5:47 p.m. ET: Some Switch 2 Edition cartridges of Nintendo games work on the old hardware. John Ricciardi on Bluesky discovered that the Switch 2 cartridge for The Legend of Zelda: Tears of the Kingdom actually works if you put it into the OG Swtich. You don’t get any of the next-gen benefits but it’s neat nonetheless and perfect for lending out to any friends who haven’t played the game before and only have the older system. Will Switch 2 Joy-Con have drift issues? Update 6/5/2025 5:54 p.m. ET: As players continue tearing apart their Switch 2 hardware to see what’s inside, a heated debate is raging about whether the new Joy-Con are really rebuilt from “the ground up” as Nintendo has said or are closer to the design of the original, drift-prone Joy-Con as some feared. “LOL they just added LUBE! No wonder people were saying it was smooth,” argued one person on Reddit while pouring over internals of the controller. Someone else pushed back, pointing out subtle changes to the shape of parts that would allow for smoother and wider ranges of motion without degrading. Personally, it’s hard to tell the difference between the new and old Joy-Con in my brief time with them so far. They might hold up better in the long-run but don’t feel any more or less sturdy in the meantime. I’ll still probably spend most of my time using a Hori grip. .",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f86871b294738906e097a4055efe5d38.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eA bunch of Switch 2s swirl in a circle.Nearly a decade after the original Switch came out, and following years of fans’ pining for a major upgrade to Nintendo’s wildly popular portable gaming platform, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/nintendo-switch-2-price-release-date-specs-1851773502\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/nintendo-switch-2-price-release-date-specs-1851773502\"\u003ethe Switch 2 is here\u003c/a\u003e\u003c/span\u003e. It’s already June 5—the console’s official launch date—in some parts of the world, and a day-one update with “important features and updates” is now live. People are finally starting to go hands-on with \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/mario-kart-world-map-size-bigger-gta-v-forza-horizon-5-1851783488\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/mario-kart-world-map-size-bigger-gta-v-forza-horizon-5-1851783488\"\u003egames like\u003cem\u003e Mario Kart World\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e, while others prepare for midnight launch parties in their respective time zones.\u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"197567\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Nintendo Switch 2 Price Is Set at $450 for Now, But Could Go Higher\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"104\" data-playlist=\"197567,197565,195670\" data-current=\"197567\"\u003e\u003cdiv\u003e\u003cp\u003eNintendo Switch 2 Price Is Set at $450 for Now, But Could Go Higher\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197567/197567_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197567/197567_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197567/197567_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003ctrack kind=\"captions\" label=\"English\" src=\"https://kinja.com/api/videoupload/caption/23091.vtt\" srclang=\"en\"/\u003e\u003c/video\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-label=\"\"\u003eOff\u003c/li\u003e\u003cli data-label=\"English\"\u003eEnglish\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003eWe’ll be updating this story throughout launch day so be sure to scroll to the end and check back for more news on what players are finding as Nintendo’s most anticipated console ever finally arrives in the wild.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eUnlike all of Nintendo’s previous consoles, the Switch 2 arrives without any reviews or extensive testing from media or content creators. With the exception of two preview events, the highly anticipated console is going out into the world fresh for everyone. Officially, Nintendo blamed that outcome on the need for a last-minute day-one update, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.videogameschronicle.com/features/opinion/its-official-there-are-no-nintendo-switch-2-reviews-heres-what-that-means-for-us-and-you/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.videogameschronicle.com/features/opinion/its-official-there-are-no-nintendo-switch-2-reviews-heres-what-that-means-for-us-and-you/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cem\u003eVGC\u003c/em\u003e reported yesterday\u003c/a\u003e\u003c/span\u003e. That had kept even leakers who got the hardware ahead of launch \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-leak-nintendo-ban-russia-ukraine-day-one-patch-1851782934\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-leak-nintendo-ban-russia-ukraine-day-one-patch-1851782934\"\u003efrom being able to actually play any games on it\u003c/a\u003e\u003c/span\u003e, including older Switch 1 cartridges. \u003c/p\u003e\u003cp\u003eWith the update now live, people have been able to start installing firmware version 20.1.1. It unlocks some of the Switch 2\u0026#39;s most important features, including GameChat and access to the Nintendo eShop, Switch Online, virtual game cards, and the \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-key-card-game-cart-physical-list-confirmed-1851777742\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-key-card-game-cart-physical-list-confirmed-1851777742\"\u003econtroversial game key cards\u003c/a\u003e\u003c/span\u003e that don’t actually contain the game. As a result, early players in New Zealand and other places have started \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/NintendoSwitch2/comments/1l34cpc/switch_2_connects_online_and_is_playable_now/?utm_source=embedv2\u0026amp;utm_medium=post_embed\u0026amp;utm_content=post_body\u0026amp;embed_host_url=https://kinja.com/embed/inset/iframe\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/NintendoSwitch2/comments/1l34cpc/switch_2_connects_online_and_is_playable_now/?utm_source=embedv2\u0026amp;utm_medium=post_embed\u0026amp;utm_content=post_body\u0026amp;embed_host_url=https://kinja.com/embed/inset/iframe\" target=\"_blank\" rel=\"noopener noreferrer\"\u003esharing pictures online\u003c/a\u003e\u003c/span\u003e of the Switch 2 downloading new games like \u003cem\u003eMario Kart World\u003c/em\u003e while everyone else patiently waits for the clock to strike midnight in their region. \u003c/p\u003e\u003ch2 id=\"h202210\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eThe eShop runs great on Switch 2\u003c/h2\u003e\u003cp\u003eHere’s what the new eShop looks like, for example. After years of stuttering on the old console, it actually seems to run smoothly (for now):\u003c/p\u003e\u003ch2 id=\"h202211\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003e\u003cem\u003eMario Kart World\u003c/em\u003e 1.1.0 update makes more characters playable at the start\u003c/h2\u003e\u003cp\u003eA day-one patch is also live for the open-world racing sequel launch title. \u003cem\u003eMario Kart World\u003c/em\u003e 1.1.0 adds support for Camera Play, online multiplayer, and the ability to upload and download time trial ghosts. More importantly, it looks like Nintendo made some last-minute tuning adjustments as well. “We’ve increased the number of characters that can be selected from the start,” reads one of the patch notes. “The time limit for deciding on a course has been removed when playing Locally or LAN,” reads another. \u003c/p\u003e\u003cp\u003eOne big question on players’ minds: will blue shells actually be easier to dodge this time around than in past games?\u003c/p\u003e\u003ch2 id=\"h202212\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eHere’s what the inside of a Switch 2 looks like\u003c/h2\u003e\u003cp\u003eFor those interested in what’s actually going on inside the Switch 2, someone’s already uploaded a complete teardown of the new hardware. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.youtube.com/@pro-modding\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.youtube.com/@pro-modding\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eProModding\u003c/a\u003e\u003c/span\u003e’s surgery on the console has already raised some important questions, like why is Nintendo hiding so many screws underneath hard-to-replace stickers on the side of the console?\u003c/p\u003e\u003cp\u003eFor anyone who doesn’t already have the console, Switch 2\u0026#39;s launch day could be a lot rockier. While many secured pre-orders months ago, some stores in the U.S. have promised limited day-one inventory for people who show up at the midnight launch. The Switch 2 is expected to sell out at launch, but there’s a big question around just how hard it will be to get and for how long. Walmart has already \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-pre-order-canceled-order-target-walmart-june-5-1851783357\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-pre-order-canceled-order-target-walmart-june-5-1851783357\"\u003ebegun cancelling some\u003c/a\u003e\u003c/span\u003e fans’ early pre-orders, and \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/nintendo-switch-2-out-of-stock-pre-orders-launch-1851783435\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/nintendo-switch-2-out-of-stock-pre-orders-launch-1851783435\"\u003e“out of stock” signs\u003c/a\u003e\u003c/span\u003e have  been sent out to many stores. \u003c/p\u003e\u003ch2 id=\"h202213\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eSwitch 2 launch day stock is available at some stores but not for long\u003c/h2\u003e\u003cp\u003eAnother big question is when all of those online pre-orders will finally get delivered. My bundle from Target currently isn’t slated to arrive until June 11, so I’m heading to \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-in-stock-target-best-buy-gamestop-preorder-1851781532\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-in-stock-target-best-buy-gamestop-preorder-1851781532\"\u003eGameStop today to join the masses to try to score a launch-day unit\u003c/a\u003e\u003c/span\u003e. My local store said they’d have about 10 for people showing up without pre-orders. For now though, backroom inventory is \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/NintendoSwitch2/comments/1l35g2m/best_buy_is_ready/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/NintendoSwitch2/comments/1l35g2m/best_buy_is_ready/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eat long last going out on store shelves\u003c/a\u003e\u003c/span\u003e. Hopefully, there aren’t too many horror stories of people failing to get theirs.\u003c/p\u003e\u003cp\u003ePlus we’ll have to see how Nintendo’s servers hold up once the console is out across the globe and millions of players are trying to download games and day-one updates simultaneously. It’ll certainly put the Switch 2\u0026#39;s allegedly improved Wi-Fi speeds to the test. \u003c/p\u003e\u003ch2 id=\"h202214\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eSwitch 2 can store more than double the number of screenshots \u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/4/2025 11:02 a.m. ET:\u003c/strong\u003e The original Switch limited players to 10,000 screenshots no matter how much extra room on an SD expansion card they had (via \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://nintendosoup.com/nintendo-switch-2-allows-you-to-save-up-to-30000-screenshots/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://nintendosoup.com/nintendo-switch-2-allows-you-to-save-up-to-30000-screenshots/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cem\u003eNintendoSoup\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e). The Switch 2 not only increases that limit to 15,000 for the console itself, it also lets you store another 15,000 screenshots on the auxiliary microSD Express card. It might be enough to document every square inch of Mario Kart World. At the very least, no more sorting through what screenshots to delete in the short term anyway. \u003c/p\u003e\u003ch2 id=\"h202215\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003e\u003cem\u003eBowser’s Fury\u003c/em\u003e loads in 8 seconds\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/4/2025 12:51 p.m. ET: \u003c/strong\u003eNintendo’s open world \u003cem\u003eMario\u003c/em\u003e side-project loads lightning fast on Switch 2. \u003cem\u003eBowser’s Fury\u003c/em\u003e, an add-on for Mario Bros. 3D World on the original Switch, takes place in a big, seamless map. I just booted it up on the old hardware using the cartridge version, which is already known to be a couple seconds slower than the digital version, and it took 41 seconds. Footage of the game running on Switch 2 \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.youtube.com/watch?v=fc7oSh1RFFY\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.youtube.com/watch?v=fc7oSh1RFFY\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eby \u003cem\u003eVGC\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e shows it loading in just 8 seconds. It’s one of \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-free-upgrade-pokemon-scarlet-violet-mario-1851781005?_gl=1*16uz43h*_ga*MTg4NjY0MzM1NS4xNzM5NDU1MDcz*_ga_V4QNJTT5L0*czE3NDkwNTIyNDgkbzI2NiRnMSR0MTc0OTA1NjEyNyRqMiRsMCRoMA..\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-free-upgrade-pokemon-scarlet-violet-mario-1851781005?_gl=1*16uz43h*_ga*MTg4NjY0MzM1NS4xNzM5NDU1MDcz*_ga_V4QNJTT5L0*czE3NDkwNTIyNDgkbzI2NiRnMSR0MTc0OTA1NjEyNyRqMiRsMCRoMA..\"\u003emany Nintendo games that received free updates\u003c/a\u003e\u003c/span\u003e for the new console but doesn’t have a paid Switch 2 upgrade. \u003c/p\u003e\u003ch2 id=\"h202216\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003e\u003cem\u003eNintendo Switch 2 Welcome Tour\u003c/em\u003e can’t be completed without a 4K TV\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/4/2025 1:48 p.m. ET:\u003c/strong\u003e Welcome Tour seemed like the perfect pack-in for Nintendo’s new console: a series of neat mini-games teaching player show the machine works. Instead it’s a $10 download AND \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.resetera.com/threads/nintendo-switch-2-welcome-tour-requires-additional-accessories-peripherals-to-get-100-completion.1206843/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.resetera.com/threads/nintendo-switch-2-welcome-tour-requires-additional-accessories-peripherals-to-get-100-completion.1206843/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eplayers have discovered \u003c/a\u003e\u003c/span\u003eyou need a bunch of extra accessories to technically reach 100 percent completion (something the game tracks). Those additional peripherals include a webcam, a controller with GL/GR buttons, and a 4K TV or monitor display. Which diehard fans will buy a \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://stores.horiusa.com/nsx-001\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://stores.horiusa.com/nsx-001\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ePiranha Plant cam\u003c/a\u003e\u003c/span\u003e just to hit that achievement? \u003c/p\u003e\u003ch2 id=\"h202217\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eThe Switch 2 setup music is a cozy little banger\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/4/2025 3:45 p.m. ET: \u003c/strong\u003eIt’s a shame the Nintendo Switch 2 won’t have eShop music, but at least when you first set up the console, you get to hear a nice song. This has been floating around for a few days now, thanks to leaks, but now we have some higher-quality versions of it. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://arstechnica.com/gaming/2025/06/its-here-unboxing-and-setting-up-our-switch-2-review-unit/#:~:text=And%20while%20you%20peruse%20the%20images%2C%20we%20recommend%20listening%20to%20the%20absolute%20bop%20that%20is%20the%20Switch%202%20setup%20music%2C%20which%20we%27ve%20embedded%20below%3A\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://arstechnica.com/gaming/2025/06/its-here-unboxing-and-setting-up-our-switch-2-review-unit/#:~:text=And%20while%20you%20peruse%20the%20images%2C%20we%20recommend%20listening%20to%20the%20absolute%20bop%20that%20is%20the%20Switch%202%20setup%20music%2C%20which%20we%27ve%20embedded%20below%3A\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eKyle Orland over at \u003cem\u003eArs Technica \u003c/em\u003e\u003c/a\u003e\u003c/span\u003ehas a great recording of it. And here’s a (quiet) recording of it via YouTube. \u003c/p\u003e\u003ch2 id=\"h202218\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eSomeone has made \u003cem\u003eMario Kart\u003c/em\u003e’s famous cow eat beef\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/4/2025 3:48 p.m. ET: \u003c/strong\u003eBreaking news! Tom Marks, the executive reviews editor at \u003cem\u003eIGN\u003c/em\u003e, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://bsky.app/profile/tomrmarks.bsky.social/post/3lqska2gd5s2h\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://bsky.app/profile/tomrmarks.bsky.social/post/3lqska2gd5s2h\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ehas released video\u003c/a\u003e\u003c/span\u003e of the beloved and \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/mario-kart-world-moo-moo-meadows-cow-meme-switch-2-1851774370?_gl=1*1jcxw01*_ga*MTg4NjY0MzM1NS4xNzM5NDU1MDcz*_ga_V4QNJTT5L0*czE3NDkxMzU2NjEkbzI2OSRnMSR0MTc0OTEzOTAwNiRqNjAkbDAkaDA.\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/mario-kart-world-moo-moo-meadows-cow-meme-switch-2-1851774370?_gl=1*1jcxw01*_ga*MTg4NjY0MzM1NS4xNzM5NDU1MDcz*_ga_V4QNJTT5L0*czE3NDkxMzU2NjEkbzI2OSRnMSR0MTc0OTEzOTAwNiRqNjAkbDAkaDA.\"\u003epopular cow from \u003c/a\u003e\u003c/span\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/mario-kart-world-moo-moo-meadows-cow-meme-switch-2-1851774370\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/mario-kart-world-moo-moo-meadows-cow-meme-switch-2-1851774370\"\u003e\u003cem\u003eMario Kart World\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e\u003cem\u003e \u003c/em\u003eeating what appears to be a beef burger.\u003c/p\u003e\u003ch2 id=\"h202219\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eEveryone got a Switch 2 at Best Buy’s midnight launch in Union City, CA\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/5/2025 11:34 a.m. ET: \u003c/strong\u003eThe midnight launches of old returned for Switch 2 and went off without a hitch, mostly. Sean Hollister \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.theverge.com/news/676901/nintendo-switch-2-launch-here\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.theverge.com/news/676901/nintendo-switch-2-launch-here\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eat\u003cem\u003e The Verge\u003c/em\u003e\u003c/a\u003e\u003c/span\u003e reported hundreds in line at his Best Buy, including both people who pre-ordered the Switch 2 and day-of walk-ins, all went home with one, even if it took a while. My GameStop experience was similarly smoothed. About 60-70 of us were in line at midnight and got home within the hour, though our promised free Red Bulls never materialized. \u003c/p\u003e\u003cp\u003eUnfortunately, not every midnight launch went so smoothly. A GameStop in Staten Island, NY \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-box-staples-gamestop-replacement-launch-1851783684\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-box-staples-gamestop-replacement-launch-1851783684\"\u003ewas reportedly stapling receipts to the Switch 2 boxes it gave out\u003c/a\u003e\u003c/span\u003e, which accidentally ended up puncturing the screens of multiple new owner’s consoles due in part to the unusual way the device is boxed. It’s unclear how long those people will have to wait now to get replacement consoles, if GameStop decides to refund them. \u003c/p\u003e\u003ch2 id=\"h202220\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eThe GameCube controller has motion controls\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/5/2025 11:52 a.m. ET: \u003c/strong\u003eNintendo released a new limited-supply replica GameCube controller for the Switch 2 and its new library of GameCube classics for Switch Online + Expansion Pack like \u003cem\u003eThe Legend of Zelda: Wind Waker\u003c/em\u003e. But the gamepad also also been revised somewhat and now includes motion controls that work with games like \u003cem\u003eSplatoon 3\u003c/em\u003e. \u003c/p\u003e\u003cp\u003eThe new GameCube controller also has a dedicated GameChat button and, as one new owner who tore it apart discovered, a revised D-pad. The old dpad was attached ton the main pcb and had a really long shaft to account for the distance,” DimiBlue \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/NintendoSwitch2/comments/1l3u79o/took_them_nearly_24_years_but_they_finally_fixed/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/NintendoSwitch2/comments/1l3u79o/took_them_nearly_24_years_but_they_finally_fixed/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ewrote on Reddit\u003c/a\u003e\u003c/span\u003e. “This new setup brings the pcb closer to the surface and increases accuracy by a lot. I’m looking forward to molding the new dpad to add to modded gamecube controllers.”\u003c/p\u003e\u003ch2 id=\"h202221\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eGameChat is vacuum cleaner approved\u003c/h2\u003e\u003cp\u003eUpdate 6/5/2025 4:07 p.m. ET: One of the features Nintendo touted when it revealed its new in-game chat and video sharing system was noise canceling that would help filter out sounds that aren’t part of what the person playing is saying. \u003c/p\u003e\u003cp\u003e Well, Zelda YouTuber Mr A-Game put it to the test by vacuuming in the background while someone played\u003cem\u003e Mario Kart World \u003c/em\u003eonline. The GameChat audio itself wasn’t the best, but the signal came in without a hint of vacuum. Now I wonder how well it does with screaming kids in the background. \u003c/p\u003e\u003ch2 id=\"h202222\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eSome Switch 2 games work on Switch 1\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/5/2025 5:47 p.m. ET:\u003c/strong\u003e Some Switch 2 Edition cartridges of Nintendo games work on the old hardware. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://bsky.app/profile/johntv.bsky.social/post/3lqtmlfbsjk2s\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://bsky.app/profile/johntv.bsky.social/post/3lqtmlfbsjk2s\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eJohn Ricciardi on Bluesky\u003c/a\u003e\u003c/span\u003e discovered that the Switch 2 cartridge for \u003cem\u003eThe Legend of Zelda: Tears of the Kingdom\u003c/em\u003e actually works if you put it into the OG Swtich. You don’t get any of the next-gen benefits but it’s neat nonetheless and perfect for lending out to any friends who haven’t played the game before and only have the older system. \u003c/p\u003e\u003ch2 id=\"h202223\"\u003e\u003ca id=\"\"\u003e\u003c/a\u003eWill Switch 2 Joy-Con have drift issues?\u003c/h2\u003e\u003cp\u003e  \u003cstrong\u003eUpdate 6/5/2025 5:54 p.m. ET:\u003c/strong\u003e As players continue tearing apart their Switch 2 hardware to see what’s inside, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/NintendoSwitch2/comments/1l3uche/not_hall_effect_not_tmr_no_magnets_in_the_sticks/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/NintendoSwitch2/comments/1l3uche/not_hall_effect_not_tmr_no_magnets_in_the_sticks/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ea heated debate is raging\u003c/a\u003e\u003c/span\u003e about whether the new Joy-Con are really rebuilt from “\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-joy-cons-no-hall-effect-stick-drift-nintendo-1851775099\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-joy-cons-no-hall-effect-stick-drift-nintendo-1851775099\"\u003ethe ground up\u003c/a\u003e\u003c/span\u003e” as Nintendo has said or are closer to the design of the original, drift-prone Joy-Con as some feared. “LOL they just added LUBE! No wonder people were saying it was smooth,” argued one person on Reddit while pouring over internals of the controller.\u003c/p\u003e\u003cp\u003e Someone else pushed back, pointing out \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://imgur.com/a/test-obyKQZz\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://imgur.com/a/test-obyKQZz\" target=\"_blank\" rel=\"noopener noreferrer\"\u003esubtle changes\u003c/a\u003e\u003c/span\u003e to the shape of parts that would allow for smoother and wider ranges of motion without degrading. Personally, it’s hard to tell the difference between the new and old Joy-Con in my brief time with them so far. They might hold up better in the long-run but don’t feel any more or less sturdy in the meantime. I’ll still probably spend most of my time using a Hori grip. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-06-04T09:45:00-04:00",
  "modifiedTime": "2025-06-05T21:53:11.225Z"
}
