{
  "id": "b1af9e2d-946a-4942-8f1e-ab9ed950a697",
  "title": "‘What’s Going On?’: Jimmy Kimmel Exposes His Staff’s Wild Reactions to the ‘Hottest Cold-Blooded Killer In America’",
  "link": "https://www.escapistmagazine.com/whats-going-on-jimmy-kimmel-exposes-his-staffs-wild-reactions-to-the-hottest-cold-blooded-killer-in-america/",
  "description": "",
  "author": "Sarah Barrett",
  "published": "Wed, 11 Dec 2024 15:30:57 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Movies \u0026 TV",
    "News",
    "Featured",
    "Jimmy Kimmel"
  ],
  "byline": "Sarah Barrett",
  "length": 3461,
  "excerpt": "Jimmy Kimmel did a bit on his late-night show were he revealed his staff's wild reactions to Luigi Mangione.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "The internet gave a collective gasp of delight when the first pictures of the man who allegedly shot Brian Thompson came out. No one knew his name at that point, but it was fair to say they were dazzled by his beauty. Now we do know the name of the alleged shooter. He’s Luigi Mangione. We’ve now seen his full face, and so many people are thirsting for him. Even Jimmy Kimmel has noticed, and the late-night host did a whole bit on him last night. After mentioning how end-of-year “best of” lists are starting to come out, Kimmel said, “We definitely know who wins Time‘s Sexiest Alleged Murderer of the Year. That would go to Luigi Mangione, the suspect in the shooting of the CEO of UnitedHealthcare, who’s become the hottest cold-blooded killer in America.” “I’m not sure what this says about us,” Kimmel went on as the audience laughed. He showed a montage of the Mangione images uncovered so far, including one where he was shirtless. “Ryan Murphy right now is flying to Netflix headquarters in a jetpack,” Kimmel quipped. Jokes about Murphy, the man who brought us Monster, making a show about Mangione have been all over the internet the past few days. “So many women and so many men are going nuts over how good-looking this killer is,” continued Kimmel. “There’s a huge wave of horny washing over us right now. It’s like when one of the guys you work with says, ‘I had a dream about you last night.’ When it’s the FedEx guy with the big muscles and the rolled-up sleeves, you’re like, ‘ohhh.’ But if it’s the bald IT guy wearing Crocs with black socks, you’re on the phone with HR.” Related: Stephen Colbert Weighs In on the ‘Weird’ Obsession With the UHC Murder Suspect He went on, “Our staff today – I have never experienced anything like this – these are screen grabs of actual exchanges between members of our staff and their friends, relatives, whatever.” And the screen grabs were really something. One noted “People are saying a NY jury has the power to find him innocent. Because we all love him,” while the reply said, “I’m not mad at him.” Yep, few people are mad at Mangione when it comes down to it. Another person talked of visiting Mangione in prison, baking him cookies, and “perhaps more but I haven’t thought that far ahead.” And a man, the husband of one of Kimmel’s staffers, sent a message with a picture of Mangione reading, “I’m about to be a jailhouse bride.” The thirst was incredible. Of course, it’s not just Kimmel’s staffers. X, formerly known as Twitter, has absolutely exploded with posts celebrating Mangione’s good looks. your honor, my client luigi mangione is innocent. he was just demonstrating the true power of having \"looks that could kill.\" the only thing criminal is his bone structure. pic.twitter.com/2Pqvv9bZXc— Frank Costa (@feistyfrank) December 9, 2024 Of course, a lot of people are just having fun, but underneath it, there’s a very real fury at the system Mangione’s victim represented. There have been countless posts about Mangione but very, very few expressing sadness at Thompson’s death. Even without his good looks, Mangione would probably have still become a folk hero to the millions of people in America who have suffered because of health insurance companies. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/12/Jimmy-Kimmel-Reading.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"217\" data-injectable=\"true\" data-video=\"true\"\u003eThe internet gave a collective gasp of delight when the first pictures of the man who allegedly shot Brian Thompson came out. No one knew his name at that point, but it was fair to say they were dazzled by his beauty.\u003c/p\u003e\n\n    \u003cp data-characters=\"242\" data-current-count=\"242\" data-injectable=\"false\"\u003eNow we do know the name of the alleged shooter. He’s Luigi Mangione. We’ve now seen his full face, and so many people are thirsting for him. Even \u003ca href=\"https://www.escapistmagazine.com/tag/jimmy-kimmel/\"\u003eJimmy Kimmel\u003c/a\u003e has noticed, and the late-night host \u003ca href=\"https://www.youtube.com/watch?time_continue=44\u0026amp;v=vbAc4DJhlEU\u0026amp;embeds_referring_euri=https%3A%2F%2Ftrello.com%2F\u0026amp;source_ve_path=Mjg2NjY\" target=\"_blank\"\u003edid a whole bit on him last night\u003c/a\u003e.\u003c/p\u003e    \u003cp data-characters=\"344\" data-current-count=\"586\" data-injectable=\"false\"\u003eAfter mentioning how end-of-year “best of” lists are starting to come out, Kimmel said, “We definitely know who wins \u003cem\u003eTime\u003c/em\u003e‘s Sexiest Alleged Murderer of the Year. That would go to Luigi Mangione, the suspect in the shooting of the CEO of UnitedHealthcare, who’s become the hottest cold-blooded killer in America.”\u003c/p\u003e    \u003cp data-characters=\"428\" data-current-count=\"1014\" data-injectable=\"true\"\u003e“I’m not sure what this says about us,” Kimmel went on as the audience laughed. He showed a montage of the Mangione images uncovered so far, including one where he was shirtless. “Ryan Murphy right now is flying to Netflix headquarters in a jetpack,” Kimmel quipped. Jokes about Murphy, the man who brought us \u003cem\u003eMonster\u003c/em\u003e, making a show about Mangione have been all over the internet the past few days.\u003c/p\u003e\n\n    \u003cp data-characters=\"467\" data-current-count=\"467\" data-injectable=\"false\"\u003e“So many women and so many men are going nuts over how good-looking this killer is,” continued Kimmel. “There’s a huge wave of horny washing over us right now. It’s like when one of the guys you work with says, ‘I had a dream about you last night.’ When it’s the FedEx guy with the big muscles and the rolled-up sleeves, you’re like, ‘ohhh.’ But if it’s the bald IT guy wearing Crocs with black socks, you’re on the phone with HR.”\u003c/p\u003e    \u003cp data-characters=\"91\" data-current-count=\"558\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.escapistmagazine.com/stephen-colbert-weighs-in-on-the-weird-obsession-with-the-uhc-murder-suspect/\"\u003eStephen Colbert Weighs In on the ‘Weird’ Obsession With the UHC Murder Suspect\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e    \u003cp data-characters=\"494\" data-current-count=\"1052\" data-injectable=\"true\"\u003eHe went on, “Our staff today – I have never experienced anything like this – these are screen grabs of actual exchanges between members of our staff and their friends, relatives, whatever.” And the screen grabs were really something. One noted “People are saying a NY jury has the power to find him innocent. Because we all love him,” while the reply said, “I’m not mad at him.” Yep, few people are mad at Mangione when it comes down to it.\u003c/p\u003e\n\n    \u003cp data-characters=\"339\" data-current-count=\"339\" data-injectable=\"false\"\u003eAnother person talked of visiting Mangione in prison, baking him cookies, and “perhaps more but I haven’t thought that far ahead.” And a man, the husband of one of Kimmel’s staffers, sent a message with a picture of Mangione reading, “I’m about to be a jailhouse bride.” The thirst was \u003cem\u003eincredible.\u003c/em\u003e\u003c/p\u003e    \u003cp data-characters=\"162\" data-current-count=\"501\" data-injectable=\"false\"\u003eOf course, it’s not just Kimmel’s staffers. X, formerly known as Twitter, has absolutely exploded with posts celebrating Mangione’s good looks. \u003c/p\u003e    \u003cfigure data-current-count=\"801\" data-injectable=\"true\"\u003e\u003c/figure\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cdiv\u003e \u003cblockquote data-width=\"550\" data-dnt=\"true\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003eyour honor, my client luigi mangione is innocent. he was just demonstrating the true power of having \u0026#34;looks that could kill.\u0026#34; the only thing criminal is his bone structure. \u003ca href=\"https://t.co/2Pqvv9bZXc\" target=\"_blank\"\u003epic.twitter.com/2Pqvv9bZXc\u003c/a\u003e\u003c/p\u003e— Frank Costa (@feistyfrank) \u003ca href=\"https://twitter.com/feistyfrank/status/1866201821238202653?ref_src=twsrc%5Etfw\" target=\"_blank\"\u003eDecember 9, 2024\u003c/a\u003e\u003c/blockquote\u003e \u003c/div\u003e\u003c/figure\u003e    \u003cp data-characters=\"437\" data-current-count=\"737\" data-injectable=\"false\"\u003eOf course, a lot of people are just having fun, but underneath it, there’s a very real fury at the system Mangione’s victim represented. There have been countless posts about Mangione but very, very few expressing sadness at Thompson’s death. Even without his good looks, Mangione would probably have still become a folk hero to the millions of people in America who have suffered because of health insurance companies.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-11T15:30:57Z",
  "modifiedTime": "2024-12-11T15:31:00Z"
}
