{
  "id": "b2fb16d4-2ce7-43bf-acdf-7e9bf8cbd014",
  "title": "Ubisoft shutting studios, laying off 277 employees as it pulls plug on live-service shooter XDefiant",
  "link": "https://www.eurogamer.net/ubisoft-shutting-studios-laying-off-277-employees-as-it-pulls-plug-on-live-service-shooter-xdefiant",
  "description": "A month after denying reports it was poised to pull the plug on its free-to-play live-service shooter XDefiant - which launched back in May - Ubisoft has confirmed it's doing just that, resulting in the closure of three production studios and 277 employees losing their jobs. Read more",
  "author": "Matt Wales",
  "published": "Wed, 04 Dec 2024 00:38:15 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Xbox One",
    "Ubisoft",
    "Tom Clancy's XDefiant",
    "Ubisoft Entertainment",
    "Multiplayer Competitive",
    "PC",
    "Shooter",
    "First person",
    "Xbox Series X/S",
    "PS5",
    "Ubisoft San Francisco",
    "PS4"
  ],
  "byline": "Matt Wales",
  "length": 3120,
  "excerpt": "A month after denying reports it was poised to pull the plug on its free-to-play live-service shooter XDefiant - which …",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/1e968f4617616ee7ee1cfece321e9181/icon/apple-touch-icon-152x152.png",
  "text": "One month after denying closure reports. Image credit: Ubisoft A month after denying reports it was poised to pull the plug on its free-to-play live-service shooter XDefiant - which launched back in May - Ubisoft has confirmed it's doing just that, resulting in the closure of three production studios and 277 employees losing their jobs. Ubisoft's chief Studios and portfolio officer Marie-Sophie de Waubert announced the end of XDefiant's development in a post on the company's website. \"Despite an encouraging start,\" de Waubert explained, \"the team's passionate work, and a committed fan base, we've not been able to attract and retain enough players in the long run to compete at the level we aim for in the very demanding free-to-play FPS market.\" \"The game is too far away from reaching the results required to enable further significant investment,\" de Waubert continued, \"and we are announcing that we will be sunsetting it.\" As such, new downloads, player registrations, and purchases will no longer be available from today, but Season 3 will launch as planned and servers will remain online until 3rd June, 2025. XDefiant: Season 2 Overview Trailer XDefiant: Season 2 overview trailer.Watch on YouTube Unfortunately, the news doesn't end with XDefiant's cancellation. Ubisoft has also confirmed it's closing its San Francisco and Osaka production studios, and will \"ramp down\" its Sydney production site. As a result, 277 employees across all three units will lose their jobs. This equates to a little over half of the XDefiant team worldwide, with Ubisoft noting other employees working on the project will transition elsewhere within Ubisoft. \"To those team members leaving Ubisoft,\" de Waubert continued in her statement. \"I want to express my deepest gratitude for your work and contributions. Please know that we are committed to supporting you during this transition.\" In a message to the XDefiant community, executive producer Mark Rubin - who last month insisted there were \"no plans\" to shut down the game - wrote, \"Free-to-play, in particular, is a long journey. Many free-to-play games take a long time to find their footing and become profitable. It's a long journey that Ubisoft and the teams working on the game were prepared to make until very recently. But unfortunately, the journey became too much to sensibly continue.\" The announcement comes at a turbulent time for Ubisoft, which has been dogged by underperforming titles, delays, and project cancellations over the last few years. In an emergency investor call held at the start of 2023, Ubisoft announced considerably lower-than-expected earnings, leading to the cancellation of three unannounced projects and a programme of \"targeted restructuring\" that resulted in a series of layoffs. Since then, the publisher has cancelled The Division: Heartland after more than three years of work, and has delayed Assassin's Creed Shadows' release into next year following a \"softer than expected launch\" for Star Wars Outlaws.",
  "image": "https://assetsio.gnwcdn.com/xdefiant-art_NeQyfv9.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n        \n\n        \u003cp\u003eOne month after denying closure reports.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/xdefiant-art_NeQyfv9.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/xdefiant-art_NeQyfv9.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/xdefiant-art_NeQyfv9.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/xdefiant-art_NeQyfv9.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"XDefiant promotional art showing a masked and heavily armoured soldier looking toward the camera.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eUbisoft\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nA month after denying reports it was poised to pull the plug on its free-to-play live-service shooter \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/tom-clancys-xdefiant\"\u003eXDefiant\u003c/a\u003e - which launched back in May - Ubisoft has confirmed it\u0026#39;s doing just that, resulting in the closure of three production studios and 277 employees losing their jobs.\n\u003c/p\u003e\n\u003cp\u003e\nUbisoft\u0026#39;s chief Studios and portfolio officer Marie-Sophie de Waubert \u003ca href=\"https://news.ubisoft.com/en-au/article/1EywTnGrZdDqCoxKs2zNhZ/ubisoft-discontinues-development-on-xdefiant\"\u003eannounced the end of XDefiant\u0026#39;s development in a post on the company\u0026#39;s website\u003c/a\u003e. \u0026#34;Despite an encouraging start,\u0026#34; de Waubert explained, \u0026#34;the team\u0026#39;s passionate work, and a committed fan base, we\u0026#39;ve not been able to attract and retain enough players in the long run to compete at the level we aim for in the very demanding free-to-play FPS market.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;The game is too far away from reaching the results required to enable further significant investment,\u0026#34; de Waubert continued, \u0026#34;and we are announcing that we will be sunsetting it.\u0026#34; As such, new downloads, player registrations, and purchases will no longer be available from today, but Season 3 will launch as planned and servers will remain online until 3rd June, 2025.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"XDefiant:  Season 2 Overview Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/NMgTEcLGbPU?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/NMgTEcLGbPU/hqdefault.jpg\"/\u003e\u003cspan\u003eXDefiant:  Season 2 Overview Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/NMgTEcLGbPU?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/NMgTEcLGbPU?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eXDefiant: Season 2 overview trailer.\u003ca href=\"https://www.youtube.com/watch?v=NMgTEcLGbPU\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\nUnfortunately, the news doesn\u0026#39;t end with XDefiant\u0026#39;s cancellation. Ubisoft has also confirmed it\u0026#39;s closing its San Francisco and Osaka production studios, and will \u0026#34;ramp down\u0026#34; its Sydney production site. As a result, 277 employees across all three units will lose their jobs. This equates to a little over half of the XDefiant team worldwide, with Ubisoft noting other employees working on the project will transition elsewhere within Ubisoft.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;To those team members leaving Ubisoft,\u0026#34; de Waubert continued in her statement. \u0026#34;I want to express my deepest gratitude for your work and contributions. Please know that we are committed to supporting you during this transition.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nIn a \u003ca href=\"https://news.ubisoft.com/en-au/article/2wPUTEuXKpVoCvINTcxvGR/xdefiant-a-message-to-our-community\"\u003emessage\u003c/a\u003e to the XDefiant community, executive producer Mark Rubin - who last month insisted \u003ca href=\"https://www.eurogamer.net/xdefiant-will-not-shut-down-after-season-four-executive-producer-insists\"\u003ethere were \u0026#34;no plans\u0026#34; to shut down the game\u003c/a\u003e - wrote, \u0026#34;Free-to-play, in particular, is a long journey. Many free-to-play games take a long time to find their footing and become profitable. It\u0026#39;s a long journey that Ubisoft and the teams working on the game were prepared to make until very recently. But unfortunately, the journey became too much to sensibly continue.\u0026#34;\n\u003c/p\u003e\u003cp\u003e\nThe announcement comes at a turbulent time for Ubisoft, which has been dogged by underperforming titles, delays, and project cancellations over the last few years. In an emergency investor call held at the start of 2023, Ubisoft \u003ca href=\"https://www.eurogamer.net/ubisoft-cancels-three-unannounced-games-delays-skull-and-bones-again\"\u003eannounced considerably lower-than-expected earnings\u003c/a\u003e, leading to the cancellation of three unannounced projects and a programme of \u0026#34;targeted restructuring\u0026#34; that resulted in a \u003ca href=\"https://www.eurogamer.net/ubisoft-suffers-third-round-of-job-losses-this-year\"\u003eseries of layoffs\u003c/a\u003e.\n\u003c/p\u003e\n\u003cp\u003e\nSince then, the publisher has \u003ca href=\"https://www.eurogamer.net/ubisofts-free-to-play-shooter-the-division-heartland-cancelled-three-years-after-being-announced\"\u003ecancelled The Division: Heartland\u003c/a\u003e after more than three years of work, and has \u003ca href=\"https://www.eurogamer.net/assassins-creed-shadows-delayed-to-2025-following-learnings-from-star-wars-outlaws\"\u003edelayed Assassin\u0026#39;s Creed Shadows\u0026#39; release into next year\u003c/a\u003e following a \u0026#34;softer than expected launch\u0026#34; for \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/star-wars-outlaws\"\u003eStar Wars Outlaws\u003c/a\u003e.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-04T00:38:15.372256Z",
  "modifiedTime": null
}
