{
  "id": "b3f40967-ae6a-45c5-8cbb-ad4c0b74e275",
  "title": "Milhouse VA Pamela Hayden is Leaving The Simpsons",
  "link": "https://www.escapistmagazine.com/milhouse-va-pamela-hayden-is-leaving-the-simpsons/",
  "description": "",
  "author": "Jorge A. Aguilar",
  "published": "Thu, 21 Nov 2024 20:07:20 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Movies \u0026 TV",
    "Movies and TV",
    "News",
    "simpsons",
    "The Simpsons"
  ],
  "byline": "Jorge A. Aguilar",
  "length": 2239,
  "excerpt": "Pamela Hayden, a longtime voice actress for The Simpsons, is retiring after 35 years. At 70 years old, she is most known for voicing Milhouse Van Houten, Bart Simpson’s unlucky friend.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "Pamela Hayden, a longtime voice actress for The Simpsons, is retiring after 35 years. At 70 years old, she is most known for voicing Milhouse Van Houten, Bart Simpson’s unlucky friend. Her last episode will air on November 24, 2024, during the Treehouse of Horror. Besides Milhouse, Hayden also voiced characters like Jimbo Jones, Rod Flanders, Janey, and Malibu Stacy. Related: One Tree Hill’s Paul Teal’s Cause of Death Revealed Hayden shared her thankfulness for being part of the long-running animated show, saying, “It’s been an honor and a joy to have worked on such a funny, witty, and groundbreaking show.” Matt Groening, the creator of The Simpsons, complimented Hayden’s portrayal of Milhouse, pointing out how she made the character funny and relatable. He also mentioned that the show will be looking for someone new to take on her roles. The Simpsons creator Matt Groening said, “Pamela gave us tons of laughs with Milhouse, the hapless kid with the biggest nose in Springfield. She made Milhouse hilarious and real, and we will miss her.” It must be a lot to lose such a vital team member, but it’s clear that there was always love there. Related: Taylor Lautner Is Still Team Jacob With Twilight Ending Claims Milhouse first appeared in a Butterfinger commercial in 1989. The creator, Matt Groening, named him after Richard Nixon, thinking it was a very unlucky name for a kid. Milhouse has poor eyesight and is often the main target of jokes and bullying, especially from a character named Nelson Muntz. His adventures are usually pretty wild, like being wrongly listed on America’s Most Wanted or having Bart Simpson trade his soul. Some of which are shown in an Instagram video dedicated to the actress. Even though the show will keep going without her, the impact she made as the voice of Milhouse and other favorite characters will always be remembered. Finding someone to replace her will be a big challenge, as she has a special talent for her roles, so we wish her nothing but happiness. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/11/Milhouse-from-the-Simpsons-in-front-of-the-town.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"190\" data-injectable=\"true\" data-video=\"true\"\u003ePamela Hayden, a longtime voice actress for \u003cem\u003eThe Simpsons\u003c/em\u003e, is retiring after 35 years. At 70 years old, she is most known for voicing Milhouse Van Houten, Bart Simpson’s unlucky friend.\u003c/p\u003e\n\n    \u003cp data-characters=\"184\" data-current-count=\"184\" data-injectable=\"false\"\u003eHer last episode will air on November 24, 2024, during the Treehouse of Horror. Besides Milhouse, Hayden also voiced characters like Jimbo Jones, Rod Flanders, Janey, and Malibu Stacy.\u003c/p\u003e    \u003cp data-characters=\"64\" data-current-count=\"248\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated:\u003c/strong\u003e \u003ca href=\"https://www.escapistmagazine.com/one-tree-hills-paul-teals-cause-of-death-revealed/\"\u003eOne Tree Hill’s Paul Teal’s Cause of Death Revealed\u003c/a\u003e\u003c/p\u003e    \u003cp data-characters=\"435\" data-current-count=\"683\" data-injectable=\"true\"\u003eHayden shared her thankfulness for being part of the long-running animated show, saying, “It’s been an honor and a joy to have worked on such a funny, witty, and groundbreaking show.” Matt Groening, the creator of \u003cem\u003eThe Simpsons\u003c/em\u003e, complimented Hayden’s portrayal of Milhouse, pointing out how she made the character funny and relatable. He also mentioned that the show will be looking for someone new to take on her roles.\u003c/p\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cp\u003e \u003ciframe title=\"Milhouse\u0026#39;s First Appearance\" width=\"1200\" height=\"900\" src=\"https://www.youtube.com/embed/CNuRGv3a53w?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e \u003c/p\u003e\u003c/figure\u003e    \u003cp data-characters=\"311\" data-current-count=\"611\" data-injectable=\"true\"\u003e\u003cem\u003eThe Simpsons\u003c/em\u003e creator Matt Groening said, “Pamela gave us tons of laughs with Milhouse, the hapless kid with the biggest nose in Springfield. She made Milhouse hilarious and real, and we will miss her.” It must be a lot to lose such a vital team member, but it’s clear that there was always love there.\u003c/p\u003e\n\n    \u003cp data-characters=\"71\" data-current-count=\"71\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003c/strong\u003e\u003ca href=\"https://www.escapistmagazine.com/taylor-lautner-is-still-team-jacob-with-twilight-ending-claims/\"\u003eTaylor Lautner Is Still Team Jacob With Twilight Ending Claims\u003c/a\u003e\u003c/p\u003e    \u003cp data-characters=\"502\" data-current-count=\"573\" data-injectable=\"false\"\u003eMilhouse first appeared in a Butterfinger commercial in 1989. The creator, Matt Groening, named him after Richard Nixon, thinking it was a very unlucky name for a kid. Milhouse has poor eyesight and is often the main target of jokes and bullying, especially from a character named Nelson Muntz. His adventures are usually pretty wild, like being wrongly listed on America’s Most Wanted or having Bart Simpson trade his soul. Some of which are shown in \u003ca href=\"https://www.instagram.com/reel/DCmjv8kJrRA/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ean Instagram video\u003c/a\u003e dedicated to the actress.\u003c/p\u003e    \u003cfigure data-current-count=\"873\" data-injectable=\"true\"\u003e\u003cdiv\u003e \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DCmjv8kJrRA/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e \u003c/div\u003e\u003c/figure\u003e\n\n    \u003cp data-characters=\"288\" data-current-count=\"288\" data-injectable=\"false\"\u003eEven though the show will keep going without her, the impact she made as the voice of Milhouse and other favorite characters will always be remembered. Finding someone to replace her will be a big challenge, as she has a special talent for her roles, so we wish her nothing but happiness.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://escapistmagazine.com/affiliate-policy\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-21T20:07:20Z",
  "modifiedTime": "2024-11-21T20:07:23Z"
}
