{
  "id": "bb78e301-b9ef-4303-a7dc-a95d4d0f831c",
  "title": "Acclaimed colony sim RimWorld lifts off for a life in orbit as new Odyssey expansion arrives",
  "link": "https://www.eurogamer.net/acclaimed-colony-sim-rimworld-lifts-off-for-a-life-in-orbit-as-new-odyssey-expansion-arrives",
  "description": "RimWorld is boldly going where no acclaimed sci-fi colony sim with a weird cannibalism obsession has gone before: up a bit. RimWorld is leaving the ground behind and heading into space for the first time in its new paid Odyssey expansion, which launches today on PC. Read more",
  "author": "Matt Wales",
  "published": "Fri, 11 Jul 2025 16:49:41 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Strategy: Real-Time Strategy",
    "Strategy",
    "Simulation",
    "PC",
    "Indie",
    "Single Player",
    "RimWorld",
    "Bird view / Isometric"
  ],
  "byline": "Matt Wales",
  "length": 3209,
  "excerpt": "RimWorld is boldly going where no acclaimed sci-fi colony sim with a weird cannibalism obsession has gone before: up a …",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/733340927610ebb59d6c25459de7f424/icon/apple-touch-icon-152x152.png",
  "text": "Image credit: Eurogamer/Ludeon Studios RimWorld is boldly going where no acclaimed sci-fi colony sim with a weird cannibalism obsession has gone before: up a bit. RimWorld is leaving the ground behind and heading into space for the first time in its new paid Odyssey expansion, which launches today on PC. Core to Odyssey's heft of new stuff is the ability to built a gravship; essentially a mobile colony players can slowly expand to include the likes of living quarters, labs, workshops, and pretty much anything else they might need. Things start small, though, and initially you'll be using your gravship to explore the planet, landing anywhere you can reach in search of food, fuel, treasure, special weapons, even souvenirs such as exotic birds. And to add some variety to your jaunts, Odyssey introduces new biomes, including the fungal glowforest, gaseous scarlands (home to mechanoids and toxic rain), the bountiful grasslands, the blizzard-ravaged glacier plains, even the molten lava fields - all making use of a new landmarks system said to 'transform' world generation with the likes of cliffs, chasms, fjords, islands, and more. And to spice things up even further, Odyssey introduces 40 new animals to tame, train, trade, or even eat, including sparrows and bluebirds, wolves and scimitar cats, seals and otters, even porcupines and prairie dogs. Oh, and there's fishing now too. RimWorld - Odyssey trailer RimWorld - Odyssey trailer.Watch on YouTube As you explore, you'll encounter trap-rigged reactors, insect-infested caves, and downed orbital platforms - all potentially home to gravcores you can use to grow your ship and travel further still. And, yes, it'll eventually be possible to leave the planet's atmosphere to start a new chapter in orbit: mining for ore on asteroids, or exploring orbital platforms and hollowed-out satellites (just watch out for scavengers). And tying this together are new multi-part quests players can pick up from ancient maps, passing visitors, and anonymous signals. \"Space is a harsh place,\" warns developer Ludeon Studios in its Odyssey announcement, \"so build your ship to survive. Airtight walls protect your colonists and their pets from the vacuum of space. Heaters keep the interiors warm, while oxygen pumps provide life support. Build airlocks with vac barriers to prevent depressurisation of the ship, and equip spacefaring colonists with vac suits before they exit into the void.\" Elsewhere, there's new gear and weapons - think AI-assisted rifles and sawn-off shotguns - plus new enemies, including hunter drones, wasp drones, ancient sentries, and the cyclops mechanoid. That's all leading up to a new late-game threat in the form of the hateful mechhive. \"When you reach the inhuman mind behind this terror, you face a choice,\" Ludeon teases. \"Will you destroy it and shut down every mechanoid for good - or take control of its power?\" Odyssey - RimWorld's fifth expansion since its release all the way back in 2013 - is available through Ludeon's website and Steam right now, costing £19.99/$24.99 USD. And if you've yet to pick up the base game, it's currently discounted by 20 percent.",
  "image": "https://assetsio.gnwcdn.com/rimworld-odyssey-art-screen.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/rimworld-odyssey-art-screen.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/rimworld-odyssey-art-screen.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/rimworld-odyssey-art-screen.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Artwork for RimWorld\u0026#39;s Odyssey expansion showing a red-headed colonist with a gun over one shoulder and a bird on his other, all superimposed over an in-game shot of a gravship in orbit.\" data-src-full=\"https://assetsio.gnwcdn.com/rimworld-odyssey-art-screen.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eEurogamer/Ludeon Studios\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\n\u003ca href=\"https://www.eurogamer.net/games/rimworld\"\u003eRimWorld\u003c/a\u003e is boldly going where no acclaimed sci-fi colony sim with a weird cannibalism obsession has gone before: up a bit. RimWorld is leaving the ground behind and heading into space for the first time in its new paid Odyssey expansion, which launches today on PC.\n\u003c/p\u003e\n\u003cp\u003e\nCore to Odyssey\u0026#39;s heft of new \u003cem\u003estuff\u003c/em\u003e is the ability to built a gravship; essentially a mobile colony players can slowly expand to include the likes of living quarters, labs, workshops, and pretty much anything else they might need. Things start small, though, and initially you\u0026#39;ll be using your gravship to explore the planet, landing anywhere you can reach in search of food, fuel, treasure, special weapons, even souvenirs such as exotic birds.\n\u003c/p\u003e\n\u003cp\u003e\nAnd to add some variety to your jaunts, Odyssey introduces new biomes, including the fungal glowforest, gaseous scarlands (home to mechanoids and toxic rain), the bountiful grasslands, the blizzard-ravaged glacier plains, even the molten lava fields - all making use of a new landmarks system said to \u0026#39;transform\u0026#39; world generation with the likes of cliffs, chasms, fjords, islands, and more. And to spice things up even further, Odyssey introduces 40 new animals to tame, train, trade, or even eat, including sparrows and bluebirds, wolves and scimitar cats, seals and otters, even porcupines and prairie dogs. Oh, and there\u0026#39;s fishing now too.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"RimWorld - Odyssey trailer\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/FutmQwQ-O2A?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/FutmQwQ-O2A/hqdefault.jpg\"/\u003e\u003cspan\u003eRimWorld - Odyssey trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/FutmQwQ-O2A?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/FutmQwQ-O2A?autoplay=1\" title=\"RimWorld - Odyssey trailer\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eRimWorld - Odyssey trailer.\u003ca href=\"https://www.youtube.com/watch?v=FutmQwQ-O2A\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\nAs you explore, you\u0026#39;ll encounter trap-rigged reactors, insect-infested caves, and downed orbital platforms - all potentially home to gravcores you can use to grow your ship and travel further still. And, yes, it\u0026#39;ll eventually be possible to leave the planet\u0026#39;s atmosphere to start a new chapter in orbit: mining for ore on asteroids, or exploring orbital platforms and hollowed-out satellites (just watch out for scavengers). And tying this together are new multi-part quests players can pick up from ancient maps, passing visitors, and anonymous signals.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;Space is a harsh place,\u0026#34; warns developer Ludeon Studios in its Odyssey announcement, \u0026#34;so build your ship to survive. Airtight walls protect your colonists and their pets from the vacuum of space. Heaters keep the interiors warm, while oxygen pumps provide life support. Build airlocks with vac barriers to prevent depressurisation of the ship, and equip spacefaring colonists with vac suits before they exit into the void.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nElsewhere, there\u0026#39;s new gear and weapons - think AI-assisted rifles and sawn-off shotguns - plus new enemies, including hunter drones, wasp drones, ancient sentries, and the cyclops mechanoid. That\u0026#39;s all leading up to a new late-game threat in the form of the hateful mechhive. \u0026#34;When you reach the inhuman mind behind this terror, you face a choice,\u0026#34; Ludeon teases. \u0026#34;Will you destroy it and shut down every mechanoid for good - or take control of its power?\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nOdyssey - RimWorld\u0026#39;s fifth expansion since its  release all the way back in 2013 - is available through \u003ca href=\"https://rimworldgame.com/odyssey/\"\u003eLudeon\u0026#39;s website\u003c/a\u003e and \u003ca href=\"https://store.steampowered.com/app/3022790/RimWorld__Odyssey/\"\u003eSteam\u003c/a\u003e right now, costing £19.99/$24.99 USD. And if you\u0026#39;ve yet to pick up the base game, it\u0026#39;s \u003ca href=\"https://store.steampowered.com/app/294100/RimWorld/\"\u003ecurrently discounted by 20 percent\u003c/a\u003e.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-11T16:49:41.993384Z",
  "modifiedTime": null
}
