{
  "id": "c24d9b16-373f-47eb-a3a0-abe3ae4a184b",
  "title": "Modder putting GTA 6's map in GTA 5 hit with Take-Two copyright claim",
  "link": "https://www.eurogamer.net/mod-putting-gta-6s-map-in-gta-5-pulled-following-take-two-copyright-claim",
  "description": "A mod putting a playable approximation of GTA 6's map into GTA 5 has run into trouble after Rockstar owner Take-Two issued a copyright removal request to its creator's YouTube channel. Read more",
  "author": "Matt Wales",
  "published": "Mon, 24 Mar 2025 22:25:11 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Rockstar North",
    "Multiplayer Competitive",
    "Grand Theft Auto 6",
    "PS5",
    "Take-Two Interactive",
    "PC",
    "Single Player",
    "Open World",
    "Third person",
    "PS3",
    "Action Adventure",
    "Xbox One",
    "Shooter",
    "Multiplayer Cooperative",
    "Xbox Series X/S",
    "Racing",
    "Xbox 360",
    "Full product",
    "Grand Theft Auto V",
    "Rockstar Games",
    "Modern Day",
    "First person",
    "PS4",
    "Shooter: Third Person"
  ],
  "byline": "Matt Wales",
  "length": 3125,
  "excerpt": "A mod putting a playable approximation of GTA 6's map into GTA 5 has run into trouble after Rockstar owner Take-Two iss…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/bd79e7beec0d89693e6730fe524ee2e1/icon/apple-touch-icon-152x152.png",
  "text": "\"My guess is that the map is probably a little too accurate.\" Image credit: Eurogamer/Rockstar Games A mod putting a playable approximation of GTA 6's map into GTA 5 has run into trouble after Rockstar owner Take-Two issued a copyright removal request to its creator's YouTube channel. The mod, developed by Youtuber Dark Space, was an effort to bring GTA 6's map to life in GTA 5 by building on the work of the Mapping Vice City project - a community led attempt to piece together GTA 6's map by scrutinising all currently released official media and combining any discoveries with previously leaked map coordinates. Dark Space began detailing his progress on social media in January and a version 1.0 release of his mod - built from GTA 5 assets - launched last week. However, the project may already have run aground; Dark Space is reining things in after Take-Two's legal team hit his YouTube channel with a copyright removal request. Grand Theft Auto VI Trailer 1 Here's what Grand Theft Auto 6 will actually look like when it turns up.Watch on YouTube \"I spent months building a fan-made GTA 6-inspired map inside GTA 5 - something purely made out of passion, not profit,\" Dark Space wrote in an introduction to a new video detailing the week's events. \"But shortly after uploading a video showcasing the project, Take-Two Interactive took it down. No warning. No conversation. Just gone.\" \"I've also removed the download link even though they didn't ask me to,\" Dark Space continued in the video itself. \"But I think it's smarter to get out in front of them rather than waiting for their email that will never come... So why did they remove my video?... Well, my guess is that the map is probably a little too accurate.\"\" In a follow-up interview with IGN, Dark Space admitted he'd anticipated Take-Two might respond the way it did based on previous mod takedowns. \"I went into this project knowing it was a possibility,\" he explained, \"and the fact that it happened does not surprise me.\" \"I think my map could have ruined the surprise of their map, which I get,\" he continued. \"If you spent years building out this amazing game world just to have some YouTuber spoil the experience of the map's shape, size, and vibe... I'd want it removed too.\" Take-Two has long been at loggerheads with the GTA modding community, most recently shutting down the Liberty City Preservation Project - an ambitious mod adding a playable version of GTA 4's map to GTA5. In 2023, however, it hired Cfx.re - the team behind the popular GTA 5 FiveM and RDR2 RedM mods (and another group that's previously faced Rockstar's wrath) - which is currently working on an official \"conversion tool\" to bring GTA 5 mods into the recently released PC version of GTA 5 Enhanced. As for GTA 6, it's still targeting the autumn 2025 release window previously announced by Take-Two, despite persistent reports of a delay - although a third-party accessories company recently claimed the PC version won't arrive until early next year.",
  "image": "https://assetsio.gnwcdn.com/gta-6-trailer-city.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003e\u0026#34;My guess is that the map is probably a little too accurate.\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/gta-6-trailer-city.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/gta-6-trailer-city.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/gta-6-trailer-city.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/gta-6-trailer-city.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"GTA 6 protagonists Lucia and Jason superimposed over GTA 6\u0026#39;s Vice City and its adjacent beach.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eEurogamer/Rockstar Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nA mod putting a playable approximation of \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/gta-6-everything-we-know-so-far-9357\"\u003eGTA 6\u003c/a\u003e\u0026#39;s map into \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/grand-theft-auto-v\"\u003eGTA 5\u003c/a\u003e has run into trouble after Rockstar owner Take-Two issued a copyright removal request to its creator\u0026#39;s YouTube channel.\n\u003c/p\u003e\n\u003cp\u003e\nThe mod, developed by Youtuber Dark Space, was an effort to bring GTA 6\u0026#39;s map to life in GTA 5 by building on the work of the \u003ca href=\"https://gtaforums.com/topic/985670-mapping-vice-city-map-discussion-thread-no-leak-footage-allowed/\"\u003eMapping Vice City project\u003c/a\u003e - a community led attempt to piece together GTA 6\u0026#39;s map by scrutinising all \u003ca href=\"https://www.eurogamer.net/gta-6-will-release-on-xbox-series-xs-and-playstation-5-in-2025\"\u003ecurrently released official media\u003c/a\u003e and combining any discoveries with previously leaked map coordinates.\n\u003c/p\u003e\n\u003cp\u003e\nDark Space began \u003ca href=\"https://x.com/Dark_SpaceYT/status/1882980876201685289\"\u003edetailing his progress on social media\u003c/a\u003e in January and a version 1.0 release of his mod - built from GTA 5 assets - launched last week. However, the project may already have run aground; Dark Space is reining things in after Take-Two\u0026#39;s legal team hit his YouTube channel with a copyright removal request.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Grand Theft Auto VI Trailer 1\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/ZvqP6ziEQ3Y?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/ZvqP6ziEQ3Y/hqdefault.jpg\"/\u003e\u003cspan\u003eGrand Theft Auto VI Trailer 1\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/ZvqP6ziEQ3Y?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/ZvqP6ziEQ3Y?autoplay=1\" title=\"Grand Theft Auto VI Trailer 1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eHere\u0026#39;s what Grand Theft Auto 6 will \u003cem\u003eactually\u003c/em\u003e look like when it turns up.\u003ca href=\"https://www.youtube.com/watch?v=ZvqP6ziEQ3Y\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\n\u0026#34;I spent months building a fan-made GTA 6-inspired map inside GTA 5 - something purely made out of passion, not profit,\u0026#34; Dark Space wrote in an introduction to a \u003ca href=\"https://www.youtube.com/watch?v=7LmLfJAuR_U\"\u003enew video detailing the week\u0026#39;s events\u003c/a\u003e. \u0026#34;But shortly after uploading a video showcasing the project, \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/companies/take-two-interactive\"\u003eTake-Two Interactive\u003c/a\u003e took it down. No warning. No conversation. Just gone.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;I\u0026#39;ve also removed the download link even though they didn\u0026#39;t ask me to,\u0026#34; Dark Space continued in the video itself. \u0026#34;But I think it\u0026#39;s smarter to get out in front of them rather than waiting for their email that will never come... So why did they remove my video?... Well, my guess is that the map is probably a little too accurate.\u0026#34;\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nIn a \u003ca href=\"https://www.ign.com/articles/gta-6-map-in-gta-5-mod-suffers-inevitable-take-two-takedown-creator-believes-it-was-probably-a-little-too-accurate-and-could-have-ruined-the-surprise\"\u003efollow-up interview with IGN\u003c/a\u003e, Dark Space admitted he\u0026#39;d anticipated Take-Two might respond the way it did based on previous mod takedowns. \u0026#34;I went into this project knowing it was a possibility,\u0026#34; he explained, \u0026#34;and the fact that it happened does not surprise me.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;I think my map could have ruined the surprise of their map, which I get,\u0026#34; he continued. \u0026#34;If you spent years building out this amazing game world just to have some YouTuber spoil the experience of the map\u0026#39;s shape, size, and vibe... I\u0026#39;d want it removed too.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nTake-Two has long been at loggerheads with the GTA modding community, most recently \u003ca href=\"https://www.eurogamer.net/rockstar-shuts-down-ambitious-mod-that-put-gta-4s-liberty-city-in-grand-theft-auto-5\"\u003eshutting down the Liberty City Preservation Project\u003c/a\u003e - an ambitious mod adding a playable version of GTA 4\u0026#39;s map to GTA5. In 2023, however, it hired Cfx.re - the team behind the popular GTA 5 FiveM and \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/red-dead-redemption-2-walkthrough-guide-4975\"\u003eRDR2\u003c/a\u003e RedM mods (and another group that\u0026#39;s \u003ca href=\"https://www.eurogamer.net/rockstar-bans-gta5-modders-who-made-their-own-multiplayer\"\u003epreviously faced Rockstar\u0026#39;s wrath\u003c/a\u003e) - which is \u003ca href=\"https://www.eurogamer.net/gta-5-enhanced-official-modding-utility-is-on-its-way\"\u003ecurrently working on an official \u0026#34;conversion tool\u0026#34;\u003c/a\u003e to bring GTA 5 mods into the \u003ca href=\"https://www.eurogamer.net/grand-theft-auto-5s-next-gen-upgrades-finally-arrive-on-pc\"\u003erecently released PC version of GTA 5 Enhanced\u003c/a\u003e.\n\u003c/p\u003e\n\u003cp\u003e\nAs for GTA 6, it\u0026#39;s \u003ca href=\"https://www.eurogamer.net/gta-6-still-coming-this-autumn-confirms-take-two-despite-ongoing-delay-rumours\"\u003estill targeting the autumn 2025 release window previously announced by Take-Two\u003c/a\u003e, despite persistent reports of a delay - although a third-party accessories company \u003ca href=\"https://www.eurogamer.net/gta-6-set-for-pc-debut-in-early-2026-accessories-company-claims\"\u003erecently claimed the PC version won\u0026#39;t arrive until early next year\u003c/a\u003e.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-24T22:25:11.770414Z",
  "modifiedTime": null
}
