{
  "id": "c9ce211e-a974-4f10-9856-ca6e0d3880f0",
  "title": "Neva: Nomada Studio shares a deep dive into the design and DualSense features of its gorgeous PS5 platformer",
  "link": "https://blog.playstation.com/2024/10/10/neva-nomada-studio-shares-a-deep-dive-into-the-design-and-dualsense-features-of-its-gorgeous-ps5-platformer/",
  "description": "Neva is the next game from Nomada, the studio behind Gris. In it, the hero Alba forms a bond with a teenage wolf. Over time, the wolf will grow bigger and stronger, and the duo’s relationship will evolve. You’ll be able to play Neva on PlayStation 5 soon, and we have implemented a number of […]",
  "author": "Roger Mendoza",
  "published": "Thu, 10 Oct 2024 15:00:50 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PS5",
    "devolver digital",
    "neva",
    "nomada studio"
  ],
  "byline": "Luke Karmali PR \u0026 Communications Director, Larian Studios",
  "length": 3499,
  "excerpt": "The beautiful adventure features unique DualSense features and 4K/120fps.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjECwaCXVzLWVhc3QtMSJHMEUCIQDTcMXR447SG0cfxiy4pWyz%252Bjcunizs%252FnJHL5VMKD2tzQIgfXAIhBsDhM3vkj3dtJoJPQRWUAsdoYVNLG2aCOSuKooqhgQIhf%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FARAAGgw1Nzc0MTg4MTg0MTMiDHNhuT635kq6WIgu%252FCraA59QwZNSxJy863Epg4CNi9Q9qDpZ1C9bcXdEfAlK0ax0gvfZfJycsi%252Fi4sHCgYSuXkPkIKuyZ4vrOHSnk%252FBfWcb17uYsKH%252BCWglESUyyTEeZteVnH4iVoJxB1pTH3g69dI4mgXwWswoNnrwa9M4A7%252B7jXdFsdP%252B3qvPG326LRGgU8GSC1KWVKq%252FiE0cTdtDDNC2t32lCjupIQ3xbwoDnevdRSdRkX9OVm9kcpZFGwyoqgHkq4KQWCtCvs3ESHfhgc42GX0JDwRHl2fxKyDd14hMwkS35U3wVMT8JxsRATVDyXPZG7QpkPub0d6bOpzuDrmorxLHlnIuh%252F1iQKgxLsRIuTaOD0QM%252FxIze8iq9j2arXmUce86pf3BuGxKjdE9r4jacHG1ZHDsip7uAyA5QWmO7EeQUwEyPrWk6wN0AttKkuHx2wcWRic%252FNtnE%252F4ajjNaTO6FrKCZXd705MX0MGrSnjag92fvgDQ0OvHo2X7NTMfzJSBvkCvStR4H25HU96dC1YncNdKW813edAtrOIIkRY14MFK6baKSbGTaio4ySBpJNLYYFdQv6AF8xp3%252FCzTY82fd4GiS%252BS8OEJXn9ds1Btn5HUU53GkFBsMZd0PnfxGaC9sMV5QnwBGTCixaK4BjqlAQDohvkP4QK5Pkf%252Bp%252B4KiK8TnkzRkbriWELKfutuYOL7S3thAsAkryP2cKgiK9xxOlnQfetR8eRBRi7pK9a73%252BNgWZGZaFZ%252FQlAM%252FydM%252FfUC1de1yBSDUnvRQZABIhDcI0TZadEVqg0IcXze4%252BJYHF%252FeWosPWkxrOgX62Kn2h%252BNPozAQmKhf1tO5v12bjAZJ8%252FLsfjmPKYaZzqMQUiPhnAwAAsIQ8A%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NWTXFMPAK2%252F20241011%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20241011T040256Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3D594b71721c6e32972e0744dd10cb91e802b21be651fd0a3c103e946811334e71\u0026fit=192%2C192",
  "text": "Neva is the next game from Nomada, the studio behind Gris. In it, the hero Alba forms a bond with a teenage wolf. Over time, the wolf will grow bigger and stronger, and the duo’s relationship will evolve. You’ll be able to play Neva on PlayStation 5 soon, and we have implemented a number of features designed especially for the console. The game’s original concept was about two human characters then morphed to an animal – including a bear – before settling on the wolf cub that the team felt will provide a more interesting relationship and striking visual. Neva will make full use of the unique features of the PS5, including utilizing the DualSense controller to draw you deeper into the game’s hauntingly beautiful world. We want you to be as immersed as possible in Neva’s story as Alba and her wolf, Neva, forge their bond and work together to defeat the strange creatures confronting them. There was a lot of gameplay testing to understand what sort of attacks would be interesting without getting in the players’ way. Neva doesn’t always auto-attack, as she grows and becomes more capable Abla will be able to direct her attacks using the thumbstick and adding a more strategic approach to combat and even puzzles. In combat, Alba can command her wolf companion Neva, to attack enemies that she can’t handle on her own. When the wolf lunges at a foe and unleashes a fury of teeth and claws, you’ll feel the full kinetic force of the attack through the DualSense’s haptic triggers. Alba is a woman of few words, but whenever she calls for her furry friend, you’ll hear her shout out Neva’s name. On PS5, her voice will echo through the DualSense controller’s built-in speaker. When Neva is a young cub, the mischievous wolf will be easily distracted, and you’ll have to call out his name to make him stick by your side. Early in the story when Neva is just a cub there will be tender, sweeter moments where she is a bit nervous about jumping over chasms or by the world around her so Alba will need to call to her, encourage her, or give her a comforting pet to reassure Neva of her capabilities. Neva is, as you can see from the screenshots, a vibrantly colorful game, and each lovingly hand-crafted level has its own distinctive palette. As you progress through Alba’s journey on PS5 , the light bar on the DualSense controller will change to reflect the current stage’s colors. So if Alba and Neva suddenly plunge into a part of the world lit with an atmospheric crimson red glow, your DualSense will shift hue to match it. This is a world being overrun with an unnamed evil, often taking form of ‘infected’ fauna that stand in the way of Neva and Alba. Almost everything is organic to the world so it was important to the team that this evil was present in once beautiful places and creatures and it’s the mission of Neva and Alba to cleanse the world of this evil and return the beauty that lies within these corrupt animals. Neva will also take advantage of the power of the PS5’s hardware to run at 4K and 120fps out of the box, making its lush artwork really sing on your TV. Neva features a minimal UI, delicate art, high-quality traditional animation, and an elegant musical score, all of which will come beautifully to life on PS5. We can’t wait for all you PlayStation players to lose yourselves in our story and world and enjoy Alba and Neva’s adventures together. Trending Stories",
  "image": "https://blog.playstation.com/tachyon/2084/10/2272538620648746700c57694fba80d235cb3372.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-397196\"\u003e\n\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\n\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"1088\" height=\"612\" src=\"https://blog.playstation.com/tachyon/2084/10/2272538620648746700c57694fba80d235cb3372.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\" alt=\"Neva: Nomada Studio shares a deep dive into the design and DualSense features of its gorgeous PS5 platformer\" sizes=\"(min-width: 1440px) 1200px, (min-width: 960px) 80vw, 100vw\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://blog.playstation.com/tachyon/2084/10/2272538620648746700c57694fba80d235cb3372.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1.5 1632w, https://blog.playstation.com/tachyon/2084/10/2272538620648746700c57694fba80d235cb3372.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1 1088w, https://blog.playstation.com/tachyon/2084/10/2272538620648746700c57694fba80d235cb3372.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.5 544w, https://blog.playstation.com/tachyon/2084/10/2272538620648746700c57694fba80d235cb3372.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.25 272w\"/\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cp\u003eNeva is the next game from Nomada, the studio behind Gris. In it, the\u003cstrong\u003e\u003cem\u003e \u003c/em\u003e\u003c/strong\u003ehero Alba forms a bond with a teenage wolf. Over time\u003cstrong\u003e\u003cem\u003e,\u003c/em\u003e\u003c/strong\u003e the wolf will grow bigger and stronger, and the duo’s relationship will evolve.\u003c/p\u003e\n\n\n\t\u003cdiv data-youtube-id=\"mTwJe_m4Vt4\" data-title=\"\"\u003e\n\t\u003cp\u003e\n\t\t\u003cimg src=\"https://img.youtube.com/vi/mTwJe_m4Vt4/maxresdefault.jpg\" data-srcset=\"https://img.youtube.com/vi/mTwJe_m4Vt4/default.jpg 120w, https://img.youtube.com/vi/mTwJe_m4Vt4/mqdefault.jpg 320w, https://img.youtube.com/vi/mTwJe_m4Vt4/hqdefault.jpg 480w, https://img.youtube.com/vi/mTwJe_m4Vt4/sddefault.jpg 640w, https://img.youtube.com/vi/mTwJe_m4Vt4/maxresdefault.jpg 1280w\" data-sizes=\"(min-width: 1440px) 1200px, (min-width: 960px) 80vw, 100vw\" data-src=\"https://img.youtube.com/vi/mTwJe_m4Vt4/maxresdefault.jpg\" alt=\"Neva: Nomada Studio shares a deep dive into the design and DualSense features of its gorgeous PS5 platformer\" srcset=\"https://img.youtube.com/vi/mTwJe_m4Vt4/default.jpg 120w, https://img.youtube.com/vi/mTwJe_m4Vt4/mqdefault.jpg 320w, https://img.youtube.com/vi/mTwJe_m4Vt4/hqdefault.jpg 480w, https://img.youtube.com/vi/mTwJe_m4Vt4/sddefault.jpg 640w, https://img.youtube.com/vi/mTwJe_m4Vt4/maxresdefault.jpg 1280w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\t\n\n\n\n\u003cp\u003eYou’ll be able to play Neva on PlayStation 5 soon, and we have implemented a number of features designed especially for the console.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/51bf488ed96afbc3503b4ef28d97a0e23bc035da.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe game’s original concept was about two human characters then morphed to an animal – including a bear – before settling on the wolf cub that the team felt will provide a more interesting relationship and striking visual.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNeva will make full use of the unique features of the PS5, including utilizing the DualSense controller to draw you deeper into the game’s hauntingly beautiful world. We want you to be as immersed as possible in Neva’s story as Alba and her wolf, Neva, forge their bond and work together to defeat the strange creatures confronting them.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/93643ecb591c4436f54010f04b42a750232e4f91.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThere was a lot of gameplay testing to understand what sort of attacks would be interesting without getting in the players’ way. Neva doesn’t always auto-attack, as she grows and becomes more capable Abla will be able to direct her attacks using the thumbstick and adding a more strategic approach to combat and even puzzles.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIn combat, Alba can command her wolf companion Neva, to attack enemies that she can’t handle on her own. When the wolf lunges at a foe and unleashes a fury of teeth and claws, you’ll feel the full kinetic force of the attack through the DualSense’s haptic triggers.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/6b9084854f02d7e29d35c7fecf0b6e298c1f5040.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAlba is a woman of few words, but whenever she calls for her furry friend, you’ll hear her shout out Neva’s name. On PS5, her voice will echo through the DualSense controller’s built-in speaker. When Neva is a young cub, the mischievous wolf will be easily distracted, and you’ll have to call out his name to make him stick by your side.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/ed1168bccaea83f06f77184605ccd35b8c428eb9.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eEarly in the story when Neva is just a cub there will be tender, sweeter moments where she is a bit nervous about jumping over chasms or by the world around her so Alba will need to call to her, encourage her, or give her a comforting pet to reassure Neva of her capabilities.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNeva is, as you can see from the screenshots, a vibrantly colorful game, and each lovingly hand-crafted level has its own distinctive palette. As you progress through Alba’s journey on PS5 , the light bar on the DualSense controller will change to reflect the current stage’s colors. So if Alba and Neva suddenly plunge into a part of the world lit with an atmospheric crimson red glow, your DualSense will shift hue to match it.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/6d81cec3d01d8dfbbe86396d85eff704b68dcec6.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThis is a world being overrun with an unnamed evil, often taking form of ‘infected’ fauna that stand in the way of Neva and Alba. Almost everything is organic to the world so it was important to the team that this evil was present in once beautiful places and creatures and it’s the mission of Neva and Alba to cleanse the world of this evil and return the beauty that lies within these corrupt animals.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNeva will also take advantage of the power of the PS5’s hardware to run at 4K and 120fps out of the box, making its lush artwork really sing on your TV. Neva features a minimal UI, delicate art, high-quality traditional animation, and an elegant musical score, all of which will come beautifully to life on PS5. We can’t wait for all you PlayStation players to lose yourselves in our story and world and enjoy Alba and Neva’s adventures together.\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/article\u003e\u003csection\u003e\n\t\u003ch2\u003eTrending Stories\u003c/h2\u003e\n\n\t\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-10T08:00:50-07:00",
  "modifiedTime": "2024-10-10T08:00:56-07:00"
}
