{
  "id": "cfddce3b-fc30-485b-8c96-6204357ab9f1",
  "title": "Monstrous 40ft Alligator, Two-Toed Tom Spotted Near New Orleans (with a Gaming Lounge in His Mouth)",
  "link": "https://news.xbox.com/en-us/2025/04/03/south-of-midnight-two-toed-tom-partnership-real-life-gator/",
  "description": "The post Monstrous 40ft Alligator, Two-Toed Tom Spotted Near New Orleans (with a Gaming Lounge in His Mouth) appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Thu, 03 Apr 2025 16:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Announcements",
    "bayou adventure",
    "Compulsion Games",
    "folklore horror",
    "South of Midnight",
    "Two-Toed Tom",
    "Xbox",
    "Xbox Game Studios"
  ],
  "byline": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "length": 6701,
  "excerpt": "South of Midnight is here - Xbox has recreated the monstrous alligator, Two-Toed Tom and dropped him in a real gator-infested bayou for a truly unique gaming experience.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryTwo-Toed Tom, a legendary beast of Southern folklore, comes to life in South of Midnight, the new action-adventure from Compulsion GamesTo celebrate the launch, Xbox has recreated Two-Toed Tom and dropped him in a real gator-infested bayou for a truly unique gaming experience. Register now for a chance to enter the belly of the beast.South of Midnight launches on April 8, or play now with the Premium Edition. Deep in the heart of the bayou, something stirs. Bigger than any gator you’ve ever seen, Two-Toed Tom is a legend of scales, survival, and insatiable hunger. More than double the size of the world’s biggest recorded alligator, Tom is an unstoppable force of nature. To celebrate the launch of South of Midnight, in which Tom makes a very big appearance, Xbox has brought this monstrous gator to life in the gator-infested waters of Marrero, Louisiana, a location chosen for its haunting resemblance to the game’s Southern-inspired setting. Murky swamps, ancient cypress trees, and the distant splash of unseen creatures make it the perfect place to step into Hazel’s world and experience the bayou’s dark magic first-hand. Our recreation of Tom is truly startling – at 40 feet long, his jaws alone stand open at almost twice the height of a person, and inside his belly lies a 20-foot cabin, inspired by the very one that Hazel, the protagonist of South of Midnight lives in. Inside that cabin, players will find an immersive gaming space featuring four 42-inch screens connected to Xbox Series X consoles, ensuring a unique experience as they navigate the perilous world of South of Midnight. Fans can register here for a chance to visit Tom in person on April 5, 2025. Fans will be treated to a tour by Jean Lafitte Swamp Tours located in Marrero, LA. Hurry, spots are limited and he is not in a good mood. Spots will be granted on a first-come, first-served basis for eligible attendees over the age of 18. Attendees must provide their own transportation to designated pickup spot. Survive the Legend: Two-Toed Tom is Coming for You in South of Midnight They say legends never die, but Two-Toed Tom is proof that some only grow stronger. Once a mistreated pet, Tom was so desperate to survive that he chewed off his own toes to escape. But hunger doesn’t just fade, it grows. And so did Tom. He gorged on livestock, tore through buildings, and sent entire towns running. The villagers tried everything, bullets, poison, and even dynamite. But Tom didn’t flinch. He just got bigger. Now, he waits. Watching. Biding his time for the river to rise again. Developed by Compulsion Games, South of Midnight is a darkly enchanting third-person action-adventure set in a reimagined Deep South. Players take on the role of Hazel, a courageous young woman pulled into a world of folklore, mystery, and danger. As she explores a land shaped by ancient myths and supernatural forces, Hazel must harness her magical abilities to confront terrifying creatures, including the legendary Two-Toed Tom. With stunning visuals, deep storytelling, and a hauntingly immersive atmosphere, South of Midnight invites players to step into a world where the past lingers, and legends come to life. South of Midnight Premium Edition Immerse yourself into the macabre and fantastical world of South of Midnight with the Premium Edition, which includes the full game, up to 5 days early access, and digital access (in English) to: • South of Midnight Artbook • Original Soundtrack composed by Olivier Deriviere • The Boo-Hag Comic book by Rob Guillory • Music Video: Songs \u0026 Tales of South of Midnight • Documentary: Weaving Hazel’s Journey, Director’s Cut UNRAVEL THE PAST From the creators of Contrast and We Happy Few, South of Midnight is a spellbinding third person action-adventure game set in the American Deep South. As Hazel, you will explore the mythos and encounter creatures of Southern folklore in a macabre and fantastical world. When disaster strikes her hometown, Hazel is called to become a Weaver: a magical mender of broken bonds and spirits. Imbued with these new abilities, Hazel will confront and subdue dangerous creatures, untangle the webs of her own family's shared past and – if she's lucky – find her way to a place that feels like home. A DARK MODERN FOLKTALE When a hurricane rips through Prospero, Hazel is pulled into a Southern Gothic world of memory made real and must embark on a journey to rescue her mother and safeguard her hometown. In this folktale for modern times, Hazel will need to reconcile the weight of family, history, and legacy against her own identity. CONFRONT MYTHICAL CREATURES Wield an ancient power to restore creatures and uncover the traumas that consume them. Cast weaving magic to fight destructive Haints, explore the diverse regions of the South, and reweave the tears in the Grand Tapestry. HAUNTING BEAUTY OF THE GOTHIC SOUTH Discover the lush, decayed county of Prospero and its locals. Experience a crafted visual style, touching storytelling, and immersive music inspired by the complex and rich history of the South. South of Midnight From the creators of Contrast and We Happy Few, South of Midnight is a spellbinding third person action-adventure game set in the American Deep South. As Hazel, you will explore the mythos and encounter creatures of Southern folklore in a macabre and fantastical world. When disaster strikes her hometown, Hazel is called to become a Weaver: a magical mender of broken bonds and spirits. Imbued with these new abilities, Hazel will confront and subdue dangerous creatures, untangle the webs of her own family's shared past and – if she's lucky – find her way to a place that feels like home. A DARK MODERN FOLKTALE When a hurricane rips through Prospero, Hazel is pulled into a Southern Gothic world of memory made real and must embark on a journey to rescue her mother and safeguard her hometown. In this folktale for modern times, Hazel will need to reconcile the weight of family, history, and legacy against her own identity. CONFRONT MYTHICAL CREATURES Wield an ancient power to restore creatures and uncover the traumas that consume them. Cast weaving magic to fight destructive Haints, explore the diverse regions of the South, and reweave the tears in the Grand Tapestry. HAUNTING BEAUTY OF THE GOTHIC SOUTH Discover the lush, decayed county of Prospero and its locals. Experience a crafted visual style, touching storytelling, and immersive music inspired by the complex and rich history of the South.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/04/SoMGatorfinal-1-45182e97493da412495d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\n\n\u003cdiv\u003e\n\n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003eTwo-Toed Tom, a legendary beast of Southern folklore, comes to life in \u003cem\u003eSouth of Midnight\u003c/em\u003e, the new action-adventure from Compulsion Games\u003c/li\u003e\u003cli\u003eTo celebrate the launch, Xbox has recreated Two-Toed Tom and dropped him in a real gator-infested bayou for a truly unique gaming experience. \u003ca href=\"https://www.jeanlafitteswamptour.com/tours/index.htm\"\u003eRegister now\u003c/a\u003e for a chance to enter the belly of the beast.\u003c/li\u003e\u003cli\u003e\u003cem\u003eSouth of Midnight \u003c/em\u003elaunches on April 8, or play now with the Premium Edition.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eDeep in the heart of the bayou, something stirs. Bigger than any gator you’ve ever seen, Two-Toed Tom is a legend of scales, survival, and insatiable hunger. More than double the size of the world’s biggest recorded alligator, Tom is an unstoppable force of nature.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"South of Midnight Two-Toed Tom Gaming Houseboat\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/6f4xKyVXYGg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eTo celebrate the launch of \u003cem\u003eSouth of Midnight\u003c/em\u003e, in which Tom makes a very big appearance, Xbox has brought this monstrous gator to life in the gator-infested waters of Marrero, Louisiana, a location chosen for its haunting resemblance to the game’s Southern-inspired setting. Murky swamps, ancient cypress trees, and the distant splash of unseen creatures make it the perfect place to step into Hazel’s world and experience the bayou’s dark magic first-hand.\u003c/p\u003e\n\n\n\n\u003cp\u003eOur recreation of Tom is truly startling – at 40 feet long, his jaws alone stand open at almost twice the height of a person, and inside his belly lies a 20-foot cabin, inspired by the very one that Hazel, the protagonist of South of Midnight lives in.\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eInside that cabin, players will find an immersive gaming space featuring four 42-inch screens connected to Xbox Series X consoles, ensuring a unique experience as they navigate the perilous world of South of Midnight.\u003c/p\u003e\n\n\n\n\u003cp\u003eFans can \u003ca href=\"https://www.jeanlafitteswamptour.com/tours/index.htm\"\u003eregister here\u003c/a\u003e for a chance to visit Tom in person on April 5, 2025. Fans will be treated to a tour by Jean Lafitte Swamp Tours located in Marrero, LA. Hurry, spots are limited and he is not in a good mood. Spots will be granted on a first-come, first-served basis for eligible attendees over the age of 18. Attendees must provide their own transportation to designated pickup spot.\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003ch2\u003e\u003cstrong\u003eSurvive the Legend: Two-Toed Tom is Coming for You in South of Midnight\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThey say legends never die, but Two-Toed Tom is proof that some only grow stronger. Once a mistreated pet, Tom was so desperate to survive that he chewed off his own toes to escape. But hunger doesn’t just fade, it grows. And so did Tom. He gorged on livestock, tore through buildings, and sent entire towns running. The villagers tried everything, bullets, poison, and even dynamite. But Tom didn’t flinch. He just got bigger.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, he waits. Watching. Biding his time for the river to rise again. Developed by Compulsion Games, \u003cem\u003eSouth of Midnight\u003c/em\u003e is a darkly enchanting third-person action-adventure set in a reimagined Deep South. Players take on the role of Hazel, a courageous young woman pulled into a world of folklore, mystery, and danger.\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\t\t\t\u003cp\u003eAs she explores a land shaped by ancient myths and supernatural forces, Hazel must harness her magical abilities to confront terrifying creatures, including the legendary Two-Toed Tom. With stunning visuals, deep storytelling, and a hauntingly immersive atmosphere, \u003cem\u003eSouth of Midnight\u003c/em\u003e invites players to step into a world where the past lingers, and legends come to life.\u003c/p\u003e\t\t\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cdiv data-product-id=\"9PNX7LQ1SB8D\" id=\"msp1743500517911\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9PNX7LQ1SB8D\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.29624.14340290650177747.0a722d69-4044-4ae9-bf07-adb4050678c4.686dff2e-4e1e-4ce4-9702-f5d0b9e50ce8?w=400\u0026amp;h=600\" alt=\"South of Midnight Premium Edition\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png\" alt=\"Xbox Play Anywhere\"/\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\u003ch2\u003eSouth of Midnight Premium Edition\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tImmerse yourself into the macabre and fantastical world of South of Midnight with the Premium Edition, which includes the full game, up to 5 days early access, and digital access (in English) to: \n•\tSouth of Midnight Artbook \n•\tOriginal Soundtrack composed by Olivier Deriviere\n•\tThe Boo-Hag Comic book by Rob Guillory\n•\tMusic Video: Songs \u0026amp; Tales of South of Midnight \n•\tDocumentary: Weaving Hazel’s Journey, Director’s Cut\n\nUNRAVEL THE PAST \nFrom the creators of Contrast and We Happy Few, South of Midnight is a spellbinding third person action-adventure game set in the American Deep South.  \n\nAs Hazel, you will explore the mythos and encounter creatures of Southern folklore in a macabre and fantastical world. When disaster strikes her hometown, Hazel is called to become a Weaver: a magical mender of broken bonds and spirits. Imbued with these new abilities, Hazel will confront and subdue dangerous creatures, untangle the webs of her own family\u0026#39;s shared past and – if she\u0026#39;s lucky – find her way to a place that feels like home. \n\nA DARK MODERN FOLKTALE  \nWhen a hurricane rips through Prospero, Hazel is pulled into a Southern Gothic world of memory made real and must embark on a journey to rescue her mother and safeguard her hometown. In this folktale for modern times, Hazel will need to reconcile the weight of family, history, and legacy against her own identity. \n\nCONFRONT MYTHICAL CREATURES \nWield an ancient power to restore creatures and uncover the traumas that consume them. Cast weaving magic to fight destructive Haints, explore the diverse regions of the South, and reweave the tears in the Grand Tapestry. \n\nHAUNTING BEAUTY OF THE GOTHIC SOUTH \nDiscover the lush, decayed county of Prospero and its locals. Experience a crafted visual style, touching storytelling, and immersive music inspired by the complex and rich history of the South. \t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\u003cdiv data-product-id=\"9NJCVGS6T30K\" id=\"msp1743500517911\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9NJCVGS6T30K\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.45547.13678609147241298.c742bfe1-6624-4d6a-800e-503c12872c58.e240d226-a024-4880-9c66-0f0f15b8a378?w=400\u0026amp;h=600\" alt=\"South of Midnight\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png\" alt=\"Xbox Play Anywhere\"/\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\u003ch2\u003eSouth of Midnight\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tFrom the creators of Contrast and We Happy Few, South of Midnight is a spellbinding third person action-adventure game set in the American Deep South. \n\nAs Hazel, you will explore the mythos and encounter creatures of Southern folklore in a macabre and fantastical world. When disaster strikes her hometown, Hazel is called to become a Weaver: a magical mender of broken bonds and spirits. Imbued with these new abilities, Hazel will confront and subdue dangerous creatures, untangle the webs of her own family\u0026#39;s shared past and – if she\u0026#39;s lucky – find her way to a place that feels like home.\n\nA DARK MODERN FOLKTALE \nWhen a hurricane rips through Prospero, Hazel is pulled into a Southern Gothic world of memory made real and must embark on a journey to rescue her mother and safeguard her hometown. In this folktale for modern times, Hazel will need to reconcile the weight of family, history, and legacy against her own identity.\n\nCONFRONT MYTHICAL CREATURES\nWield an ancient power to restore creatures and uncover the traumas that consume them. Cast weaving magic to fight destructive Haints, explore the diverse regions of the South, and reweave the tears in the Grand Tapestry.\n\nHAUNTING BEAUTY OF THE GOTHIC SOUTH\nDiscover the lush, decayed county of Prospero and its locals. Experience a crafted visual style, touching storytelling, and immersive music inspired by the complex and rich history of the South.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\u003c/div\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-03T16:00:00Z",
  "modifiedTime": "2025-04-03T09:54:22Z"
}
