{
  "id": "d65ce9c5-c0b6-4371-9c91-64f65c768a16",
  "title": "The US just added the world's biggest games publisher Tencent to their list of Chinese military companies",
  "link": "https://www.rockpapershotgun.com/the-us-just-added-worlds-biggest-games-publisher-tencent-to-their-list-of-chinese-military-companies",
  "description": "Chinese publisher Tencent are the biggest video game company in the world. Their wholly owned subsidiaries including League Of Legends developers Riot Games, Path Of Exile developers Grinding Gear Games, and UK outfit Sumo Group. They own shares in everything from Epic Games through Ubisoft to Silent Hill 2 rebooters Bloober Team. Are you a game developer? Odds are that at least one percent of your body belongs to Tencent. Maybe one of your toes. And now it turns out that Tencent are some kind of military operator, as well. Or at least, that's what the US Department of Defence would have us believe: they've just somewhat randomly added the firm to an infamous list of Chinese military companies, together with lithium-ion battery maker CATL. This potentially makes it difficult for Tencent to do business in the States, but Tencent say that it's all based on a \"misunderstanding\". Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Tue, 07 Jan 2025 17:10:10 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": null,
  "byline": "Edwin Evans-Thirlwell",
  "length": 3712,
  "excerpt": "Chinese publisher Tencent are the biggest video game company in the world. Their wholly owned subsidiaries including Le…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/78813ef66c4d48aed643ad8c3a57062a/icon/apple-touch-icon.png",
  "text": "Tencent say it's a mistake Image credit: Tencent Chinese publisher Tencent are the biggest video game company in the world. Their wholly owned subsidiaries including League Of Legends developers Riot Games, Path Of Exile developers Grinding Gear Games, and UK outfit Sumo Group. They own shares in everything from Epic Games through Ubisoft to Silent Hill 2 rebooters Bloober Team. Are you a game developer? Odds are that at least one percent of your body belongs to Tencent. Maybe one of your toes. And now it turns out that Tencent are some kind of military operator, as well. Or at least, that's what the US Department of Defence would have us believe: they've just somewhat randomly added the firm to an infamous list of Chinese military companies, together with lithium-ion battery maker CATL. This potentially makes it difficult for Tencent to do business in the States, but Tencent say that it's all based on a \"misunderstanding\". As reported by Bloomberg, the US DoD's list of Chinese military companies dates back to an executive order given by recently re-elected president Donald Trump in 2020, which sought to prevent US companies from investing in entities with ties to the Chinese military. Formally known as Section 1260H, the list is updated annually and currently runs to 134 companies, including phone manufacturer Huawei. Being on there doesn't mean the companies in question are immediately banned from doing business with the USA, but it puts pressure on the US Treasury Department to sanction them. This might scare away investors: the BBC reports that Tencent has already seen a share price fall in Hong Kong as of today, Tuesday 7th January.Tencent, naturally, say the whole thing is an error, and that the designation will have no material effect on their activities. \"We are not a military company or supplier,\" Tencent spokesperson Danny Marti commented to the BBC. \"Unlike sanctions or export controls, this listing has no impact on our business. We will nonetheless work with the Department of Defense to address any misunderstanding.\" I'm no scholar of superpower geopolitics, but my understanding is that all this forms part of US efforts to contain China both economically, and in terms of the military applications and connections of Chinese tech companies and research organisations. Here's a US Department of Defence press release from 2022 which spells out the thinking. An excerpt: \"The Department is determined to highlight and counter the PRC Military-Civil Fusion strategy, which supports the modernization goals of the People's Liberation Army (PLA) by ensuring its access to advanced technologies and expertise are acquired and developed by PRC companies, universities, and research programs that appear to be civilian entities. Section 1260H directs the Department to begin identifying, among other things, Military-Civil Fusion contributors operating directly or indirectly in the United States.\" Given the sheer scale of Tencent's operations - they also work in generative AI and cloud computing and own WeChat, one of the largest social media networks - it seems probable that they have military connections somewhere. But then again, so do many large US tech companies, like Activision-Blizzard and Microsoft. Many are the links between the tech biz and the world's armed forces.All this comes amid news that Tencent are considering a buyout of Ubisoft with the aid of the founding Guillemot family. It also follows the resignation of two Tencent-appointed Epic Games directors, in response to a US Department of Justice investigation into potential antitrust violations.",
  "image": "https://assetsio.gnwcdn.com/Tencent_UaHPEyg.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eTencent say it\u0026#39;s a mistake\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Tencent_UaHPEyg.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Tencent_UaHPEyg.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Tencent_UaHPEyg.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Tencent_UaHPEyg.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"The Tencent Games logo floating against a blue 3D background with images of games\" width=\"382\" height=\"216\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eTencent\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eChinese publisher Tencent are the biggest video game company in the world. Their wholly owned subsidiaries including League Of Legends developers Riot Games, Path Of Exile developers Grinding Gear Games, and UK outfit Sumo Group. They own shares in everything from Epic Games through Ubisoft to \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/silent-hill-2\"\u003eSilent Hill 2\u003c/a\u003e rebooters Bloober Team. Are you a game developer? Odds are that at least one percent of your body belongs to Tencent. Maybe one of your toes.\u003c/p\u003e\n\u003cp\u003eAnd now it turns out that Tencent are some kind of military operator, as well. Or at least, that\u0026#39;s what the US Department of Defence would have us believe: they\u0026#39;ve just somewhat randomly added the firm to an infamous list of Chinese military companies, together with lithium-ion battery maker CATL. This potentially makes it difficult for Tencent to do business in the States, but Tencent say that it\u0026#39;s all based on a \u0026#34;misunderstanding\u0026#34;.\u003c/p\u003e\n\u003cp\u003eAs reported by \u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-06/us-adds-tencent-to-chinese-military-blacklist-shares-decline\"\u003eBloomberg\u003c/a\u003e, the US DoD\u0026#39;s list of Chinese military companies dates back to an executive order given by recently re-elected president Donald Trump in 2020, which sought to prevent US companies from investing in entities with ties to the Chinese military.\u003c/p\u003e\n\u003cp\u003eFormally known as \u003ca href=\"https://www.federalregister.gov/documents/2025/01/07/2025-00070/notice-of-availability-of-designation-of-chinese-military-companies\"\u003eSection 1260H\u003c/a\u003e, the list is updated annually and currently runs to 134 companies, including phone manufacturer Huawei. Being on there doesn\u0026#39;t mean the companies in question are immediately banned from doing business with the USA, but it puts pressure on the US Treasury Department to sanction them. This might scare away investors: the BBC \u003ca href=\"https://www.bbc.co.uk/news/articles/c9q78wn9g8zo\"\u003ereports\u003c/a\u003e that Tencent has already seen a share price fall in Hong Kong as of today, Tuesday 7th January.\u003c/p\u003e\u003cp\u003eTencent, naturally, say the whole thing is an error, and that the designation will have no material effect on their activities. \u0026#34;We are not a military company or supplier,\u0026#34; Tencent spokesperson Danny Marti commented to the BBC. \u0026#34;Unlike sanctions or export controls, this listing has no impact on our business. We will nonetheless work with the Department of Defense to address any misunderstanding.\u0026#34;\u003c/p\u003e\n\u003cp\u003eI\u0026#39;m no scholar of superpower geopolitics, but my understanding is that all this forms part of US efforts to contain China both economically, and in terms of the military applications and connections of Chinese tech companies and research organisations. Here\u0026#39;s \u003ca href=\"https://www.defense.gov/News/Releases/Release/article/3180636/dod-releases-list-of-peoples-republic-of-china-prc-military-companies-in-accord/\"\u003ea US Department of Defence press release from 2022\u003c/a\u003e which spells out the thinking. An excerpt:\u003c/p\u003e\n\u003cblockquote\u003e\u0026#34;The Department is determined to highlight and counter the PRC Military-Civil Fusion strategy, which supports the modernization goals of the People\u0026#39;s Liberation Army (PLA) by ensuring its access to advanced technologies and expertise are acquired and developed by PRC companies, universities, and research programs that appear to be civilian entities. Section 1260H directs the Department to begin identifying, among other things, Military-Civil Fusion contributors operating directly or indirectly in the United States.\u0026#34;\u003c/blockquote\u003e\n\u003cp\u003eGiven the sheer scale of Tencent\u0026#39;s operations - they also work in generative AI and cloud computing and own WeChat, one of the largest social media networks - it seems probable that they have military connections somewhere. But then again, so do many large US tech companies, like Activision-Blizzard and Microsoft. Many are the links between the tech biz and the world\u0026#39;s armed forces.\u003c/p\u003e\u003cp\u003eAll this comes amid news that Tencent are \u003ca href=\"https://www.rockpapershotgun.com/tencent-and-guillemot-family-considering-buyout-of-ubisoft-report-says\"\u003econsidering a buyout of Ubisoft with the aid of the founding Guillemot family\u003c/a\u003e. It also follows the \u003ca href=\"https://www.rockpapershotgun.com/two-epic-games-directors-step-down-after-us-department-of-justice-investigate-games-companies-under-antitrust-laws\"\u003eresignation of two Tencent-appointed Epic Games directors\u003c/a\u003e, in response to a US Department of Justice investigation into potential antitrust violations.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-07T17:10:10.65441Z",
  "modifiedTime": null
}
