{
  "id": "d8f9cdfd-bd85-48b4-b03d-e95709b1cbd6",
  "title": "Topdown tactical shooter Intravenous 2 now has Steam Workshop support and a map editor",
  "link": "https://www.rockpapershotgun.com/topdown-tactical-shooter-intravenous-2-now-has-steam-workshop-support-and-a-map-editor",
  "description": "I don't think we've ever written about Intravenous 2, but the topdown shooter has been on my radar since its release last year. It's a blend of tactical stealth and frenetic Hotline Miami spraying, and it just got a major update to add Steam Workshop support and a map editor. Read more",
  "author": "Graham Smith",
  "published": "Sat, 18 Jan 2025 23:29:36 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Shooter",
    "Single Player",
    "Intravenous 2",
    "Hypetrain Digital",
    "Action Adventure",
    "Bird view / Isometric",
    "Strategy"
  ],
  "byline": "Graham Smith",
  "length": 1987,
  "excerpt": "Intravenous 2 is a topdown tactical shooter and now it has Steam Workshop support and a map editor.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/78813ef66c4d48aed643ad8c3a57062a/icon/apple-touch-icon.png",
  "text": "Image credit: Explosive Squat Games I don't think we've ever written about Intravenous 2, but the topdown shooter has been on my radar since its release last year. It's a blend of tactical stealth and frenetic Hotline Miami spraying, and it just got a major update to add Steam Workshop support and a map editor. The Workshop will let players download and share maps, campaigns, new weapons and gadgets that they've added to the game, although ambitious modders will need to know the Lua scripting language to implement their changes. It looks like the map editor is pretty friendly, however, given the 2D tile-based levels. There are plenty of topdown games that aim to walk in Hotline Miami's bloody footprints, but Intravenous 2 differs by going deep on tactical elements. You can stealth through the levels if you choose: enemies of vision cones, you can hide in shadows, and you can manipulate the environment by turning off lights, lockpicking doors, or using items to distract or lure enemies. You can also tinker with your skills and weaponry. There are 29 weapons according to the Steam page - although whether that's been updated to reflect those added in updates such as this one, I don't know - and those weapons can be customised with suppressors, laser sights, ammo types and so on. Perhaps most ambitiously, Intravenous 2 brags that its storyline is dynamic and changes based on your style of play. I don't know how far it follows through with that, but I'm interested in giving it a go just because I love stealth games and tactical combat. I've had good experiences with topdown games like Door Kickers, and I'd be onboard with a less fiddly, more action-oriented take on a similar experience. Topdown Splinter Cell, as opposed to topdown SWAT? I dare to dream. One day, one day I will find time to play it. For now: hey, it's cool that its got mod support. All games should have mod support. You can find more on Steam",
  "image": "https://assetsio.gnwcdn.com/intravenous-2-header.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/intravenous-2-header.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/intravenous-2-header.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/intravenous-2-header.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/intravenous-2-header.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Hiding is harder if you throw grenades, in Intravenous 2, a topdown tactical shooter.\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eExplosive Squat Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eI don\u0026#39;t think we\u0026#39;ve ever written about Intravenous 2, but the topdown shooter has been on my radar since its release last year. It\u0026#39;s a blend of tactical stealth and frenetic \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/hotline-miami\"\u003eHotline Miami\u003c/a\u003e spraying, and it just got a major update to add Steam Workshop support and a map editor.\n\u003c/p\u003e\n\n\u003cp\u003eThe Workshop will let players download and share maps, campaigns, new weapons and gadgets that they\u0026#39;ve added to the game, although ambitious modders will need to know the Lua scripting language to implement their changes. It looks like the map editor is pretty friendly, however, given the 2D tile-based levels.\n\u003c/p\u003e\n\u003cp\u003eThere are plenty of topdown games that aim to walk in Hotline Miami\u0026#39;s bloody footprints, but Intravenous 2 differs by going deep on tactical elements. You can stealth through the levels if you choose: enemies of vision cones, you can hide in shadows, and you can manipulate the environment by turning off lights, lockpicking doors, or using items to distract or lure enemies.\n\u003c/p\u003e\n\u003cp\u003eYou can also tinker with your skills and weaponry. There are 29 weapons according to the Steam page - although whether that\u0026#39;s been updated to reflect those added in updates such as this one, I don\u0026#39;t know - and those weapons can be customised with suppressors, laser sights, ammo types and so on.\n\u003c/p\u003e\u003cp\u003ePerhaps most ambitiously, Intravenous 2 brags that its storyline is dynamic and changes based on your style of play. I don\u0026#39;t know how far it follows through with that, but I\u0026#39;m interested in giving it a go just because I love stealth games and tactical combat. I\u0026#39;ve had good experiences with topdown games like \u003ca href=\"https://www.rockpapershotgun.com/games/door-kickers\"\u003eDoor Kickers\u003c/a\u003e, and I\u0026#39;d be onboard with a less fiddly, more action-oriented take on a similar experience. Topdown \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/splinter-cell\"\u003eSplinter Cell\u003c/a\u003e, as opposed to topdown SWAT? I dare to dream.\n\u003c/p\u003e\n\u003cp\u003eOne day, one day I will find time to play it. For now: hey, it\u0026#39;s cool that its got mod support. All games should have mod support. You can find more \u003ca href=\"https://store.steampowered.com/app/2608270/Intravenous_2/\"\u003eon Steam\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-18T23:29:36.071654Z",
  "modifiedTime": null
}
