{
  "id": "d916ef6e-c318-4ee5-b262-3bfcefd3adff",
  "title": "Mark Zuckerberg Doesn't Think You--Or Anyone Else--Can Beat Him At Civilization",
  "link": "https://www.gamespot.com/articles/mark-zuckerberg-doesnt-think-you-or-anyone-else-can-beat-him-at-civilization/1100-6527106/?ftag=CAD-01-10abi2f",
  "description": "Meta founder Mark Zuckerberg has hinted at launching a Twitch channel focused on the strategy video game Civilization. During the Meta Connect 2024 conference, he spoke with Pubity, revealing his deep passion for the game: \"In terms of strategy games, the one that I'm more likely to want to be the best in the world at is Civilization.\" Zuckerberg didn't specify which version of Civilization he plays, leaving it unclear whether he means the original or a more recent entry in the series.Zuckerberg offered insight into his gaming routine, joking about his wife's reaction to his playtime logged. \"Priscilla looked at my Steam account the other day and she's like: 'What? You've played this for more than a thousand hours?'\" He went on to say, \"I think at some point, I should do like a Twitch stream of me playing with someone. Because I'm pretty convinced that I'm close to grandmaster status. I'd be surprised if anyone in the world could beat me at that.\" The Sid Meier's Civilization franchise, developed by Firaxis Games, has sold over 50 million copies globally, according to publisher 2K Games. Zuckerberg has previously mentioned his fondness for the game, even recalling during his 2017 Harvard commencement speech how he received his college acceptance letter while playing it.Continue Reading at GameSpot",
  "author": "",
  "published": "Thu, 10 Oct 2024 12:45:00 -0700",
  "source": "https://www.gamespot.com/feeds/mashup/",
  "categories": [
    ""
  ],
  "byline": "David Wolinsky",
  "length": 2773,
  "excerpt": "\"I'd be surprised if anyone in the world could beat me.\"",
  "siteName": "GameSpot",
  "favicon": "https://www.gamespot.com/a/bundles/gamespotsite/images/touch-icon-ipad-retina-precomposed.png",
  "text": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links. Meta founder Mark Zuckerberg has hinted at launching a Twitch channel focused on the strategy video game Civilization. During the Meta Connect 2024 conference, he spoke with Pubity, revealing his deep passion for the game: \"In terms of strategy games, the one that I'm more likely to want to be the best in the world at is Civilization.\" Zuckerberg didn't specify which version of Civilization he plays, leaving it unclear whether he means the original or a more recent entry in the series.Zuckerberg offered insight into his gaming routine, joking about his wife's reaction to his playtime logged. \"Priscilla looked at my Steam account the other day and she's like: 'What? You've played this for more than a thousand hours?'\" He went on to say, \"I think at some point, I should do like a Twitch stream of me playing with someone. Because I'm pretty convinced that I'm close to grandmaster status. I'd be surprised if anyone in the world could beat me at that.\" The Sid Meier's Civilization franchise, developed by Firaxis Games, has sold over 50 million copies globally, according to publisher 2K Games. Zuckerberg has previously mentioned his fondness for the game, even recalling during his 2017 Harvard commencement speech how he received his college acceptance letter while playing it.The timing of Zuckerberg's comments appears to coincide with efforts to reshape his public persona. During the interview, he sported a black T-shirt reading \"Zuck or nothing\" in Latin, a departure from his usual minimalist wardrobe of gray shirts.Following his remarks, popular Civilization streamer Potato McWhiskey issued a challenge, stating, \"I challenge you, Mark Zuckerberg, to a 1v1 duel in Civilization,\" on his YouTube channel. The official Civilization account also chimed in, responding, \"See you in the arena, Zuckerberg.\"Civilization fans have been eagerly awaiting the next installment, which arrives on PC and consoles in February 2025. Early access for Civilization 7 begins February 6 for select editions, while the standard release is set for February 11. David Wolinsky on Google+ There are currently no available deals GameSpot may get a commission from retail offers. Got a news tip or want to contact us directly? Email news@gamespot.com",
  "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1600/16003485/4382736-4353497-sidmeier%27scivilizationvii-benjaminfranklinvs.ashoka.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    \u003cspan data-nosnippet=\"\"\u003eGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\u003c/span\u003e\n  \u003c/p\u003e\u003carticle itemscope=\"\" data-type-id=\"1100\" data-guid=\"1100-6527106\"\u003e\n\n            \n            \n  \n\n\n    \n\n\n        \n        \n              \u003csection\u003e\n\n                  \n          \u003cdiv data-content-element-selector=\"p, .js-buylink-item-container\" data-allowed-classes-selector=\"js-buylink-item-container\" data-in-content-placements=\"[{\u0026#34;adType\u0026#34;:\u0026#34;mobile-incontent-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:1,\u0026#34;minElements\u0026#34;:2},{\u0026#34;placeIndex\u0026#34;:4,\u0026#34;minElements\u0026#34;:5}]},{\u0026#34;adType\u0026#34;:\u0026#34;mobile-banner-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:7,\u0026#34;minElements\u0026#34;:8},{\u0026#34;placeIndex\u0026#34;:10,\u0026#34;minElements\u0026#34;:11},{\u0026#34;placeIndex\u0026#34;:13,\u0026#34;minElements\u0026#34;:14}]}]\"\u003e\n                \u003cp dir=\"ltr\"\u003eMeta founder Mark Zuckerberg has hinted at launching a Twitch channel focused on the strategy video game Civilization. During the Meta Connect 2024 conference, he spoke with \u003ca href=\"https://www.tiktok.com/@pubity/video/7422388239169785120?is_from_webapp=1\u0026amp;sender_device=pc\" rel=\"nofollow \"\u003ePubity\u003c/a\u003e\u003cspan\u003e, revealing his \u003c/span\u003e\u003cspan\u003edeep passion for the game: \u0026#34;In terms of strategy games, the one that I\u0026#39;m more likely to want to be the best in the world at is Civilization.\u0026#34; \u003c/span\u003eZuckerberg didn\u0026#39;t specify which version of Civilization he plays, leaving it unclear whether he means the original or a more recent entry in the series.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eZuckerberg offered insight into his gaming routine, joking about his wife\u0026#39;s reaction to his playtime logged. \u0026#34;Priscilla looked at my Steam account the other day and she\u0026#39;s like: \u0026#39;What? You\u0026#39;ve played this for more than a thousand hours?\u0026#39;\u0026#34; He went on to say, \u0026#34;I think at some point, I should do like a Twitch stream of me playing with someone. Because I\u0026#39;m pretty convinced that I\u0026#39;m close to grandmaster status. I\u0026#39;d be surprised if anyone in the world could beat me at that.\u0026#34;\u003c/p\u003e\u003cp data-embed-type=\"video\" data-src=\"https://www.youtube.com/watch?v=kK_JrrP9m2U\" data-width=\"100%\" data-height=\"100%\"\u003e          \u003ciframe src=\"https://www.youtube-nocookie.com/embed/kK_JrrP9m2U\" height=\"100%\" width=\"100%\" scrolling=\"no\" frameborder=\"\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003cp dir=\"ltr\"\u003eThe Sid Meier\u0026#39;s Civilization franchise, developed by Firaxis Games, has sold over 50 million copies globally, according to publisher 2K Games. Zuckerberg has previously mentioned his fondness for the game, even recalling during his \u003ca href=\"https://youtu.be/BmYv8XGl-YU?t=133\" rel=\"nofollow \"\u003e2017 Harvard commencement speech\u003c/a\u003e how he received his college acceptance letter while playing it.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eThe timing of Zuckerberg\u0026#39;s comments appears to coincide with efforts to reshape his public persona. During the interview, he sported a black T-shirt reading \u0026#34;Zuck or nothing\u0026#34; in Latin, a departure from his usual minimalist wardrobe of gray shirts.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eFollowing his remarks, popular Civilization streamer Potato McWhiskey \u003ca href=\"https://youtu.be/fbo5qiXi1f0\" rel=\"nofollow \"\u003eissued a challenge\u003c/a\u003e, stating, \u0026#34;I challenge you, Mark Zuckerberg, to a 1v1 duel in Civilization,\u0026#34; on his YouTube channel. The official Civilization account also chimed in, responding, \u0026#34;See you in the arena, Zuckerberg.\u0026#34;\u003c/p\u003e\u003cp dir=\"ltr\"\u003eCivilization fans have been eagerly awaiting the next installment, which arrives on PC and consoles in February 2025. Early access for \u003ca href=\"https://www.gamespot.com/games/sid-meiers-civilization-vii/\"\u003eCivilization 7\u003c/a\u003e begins February 6 for select editions, while the standard release is set for February 11.\u003c/p\u003e\n  \n                        \n        \n    \n    \n                                  \u003c/div\u003e\n\n          \n        \n                                              \n            \u003cspan\u003e\n        \u003ca itemprop=\"reviewer\" href=\"https://plus.google.com/111126049094055875785?rel=author\"\u003eDavid Wolinsky\u003c/a\u003e on Google+\n      \u003c/span\u003e\n      \n                    \n  \n        \u003cdiv data-merchant-service-api-link=\"https://www.gamespot.com/merchantapi/offer/?gameid=631817\"\u003e\u003cdiv\u003e\u003cp\u003e\n      There are currently no available deals\n    \u003c/p\u003e\u003c/div\u003e\u003cp\u003eGameSpot may get a commission from retail offers.\u003c/p\u003e\u003c/div\u003e  \n          \n            \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eGot a news tip or want to contact us directly? Email \u003ca href=\"mailto:news@gamespot.com?subject=Hi GameSpot! I have a news tip for you!\"\u003enews@gamespot.com\u003c/a\u003e\u003c/i\u003e\u003c/p\u003e\n\n    \n      \u003c/div\u003e\n        \n      \u003c/section\u003e\n    \n            \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-10T13:02:00Z",
  "modifiedTime": null
}
