{
  "id": "d99c109a-14c9-4a73-9ae8-e7b317401e2e",
  "title": "\"Even the smallest of gestures can lift somebody up\" - developer Popcannibal on the lasting impact of Kind Words",
  "link": "https://www.eurogamer.net/even-the-smallest-of-gestures-can-lift-somebody-up-developer-popcannibal-on-the-lasting-impact-of-kind-words",
  "description": "Editor's note: 10th October every year is World Mental Health Day. This year, we're marking it with a look at the wonderful Kind Words. Please be advised this piece contains discussion of sensitive topics such as self harm. Read more",
  "author": "Victoria Kennedy",
  "published": "Thu, 10 Oct 2024 09:44:27 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Single Player",
    "Kind Words 2 (Lofi City Pop)",
    "Multiplayer Cooperative",
    "Popcannibal",
    "Kind Words",
    "Multiplayer Competitive",
    "Life Simulation",
    "PC",
    "Indie"
  ],
  "byline": "Victoria Kennedy",
  "length": 11170,
  "excerpt": "Popcannibal's Ziba Scott talks to Victoria about Kind Words and its successor Kind Words 2, on World Mental Health Day.",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/5c0439771999944c461aed3a75d8230b/icon/apple-touch-icon-152x152.png",
  "text": "Editor's note: 10th October every year is World Mental Health Day. This year, we're marking it with a look at the wonderful Kind Words. Please be advised this piece contains discussion of sensitive topics such as self harm. \"After Trump won the election in America, it was sort of horrifying, and I was in a stupor. I was just reflecting on how everybody could be so cruel, dismissive and insensitive; of how everybody could just be not good to each other. \"There was just so much of that, that it just pushed me into the direction of thinking 'I don't believe the world is as bad as it seems', and we need to give people a chance to behave better. I bet they would.\" I'm speaking with Popcannibal developer Ziba Scott about Kind Words, and its successor Kind Words 2. In September 2019, Scott and fellow developer Luigi Guatieri released Kind Words, a relatively simple but incredibly beautiful game about helping others by writing encouraging letters. The duo had no idea what type of reception or impact Kind Words could have, if any, and Scott admits he assumed any community would just \"fizzle out\" pretty quickly. But that didn't matter. Scott knew he needed to create something which would at least give people the opportunity to, quite simply, \"be less mean to each other\" - and it worked. Kind Words 2 (lofi city pop) - Release Date Trailer Kind Words 2 (lofi city pop) - Release Date Trailer. Watch on YouTube A quick look at reviews for Kind Words shows the positive impact the game has had since its release five years ago. Comments such as \"this game saved me\" and \"it restored my faith in mankind\" are all there, while others are just grateful to have a safe space to share their feelings.Everyone at some point needs care and attention, Scott says, adding when the idea for Kind Words first came to him, he was going through a \"complicated\" period in his own life. Along with the political changes happening in America at that time, Popcannibal had also just released a physics-based construction game called Make Sail. It did not go well. \"It was the biggest thing we'd ever done, and we'd put it out, and it absolutely cratered,\" Scott recalls. \"There were problems with the game. Sales didn't go well, and so it was just... it was a depressing time. I was thinking, 'maybe I shouldn't be making games, maybe I should do something else'. I was counting myself out of being an indie game developer.\" In the same week Kind Words released, Scott started working for a different company. Image credit: Popcannibal However, Kind Words quickly defied expectations and became a surprise hit for Popcannibal. Following its debut, the studio landed itself both a Game Awards and BAFTA nomination, before ultimately winning the Game Beyond Entertainment BAFTA in 2020. These acknowledgements from the industry naturally raised Kind Words' profile even further, and the growing popularity meant extra work for Scott and Guateiri, who felt an almost parental duty to their players.\"We didn't expect a big community to form around it… but once we saw what sort of magnetism it had to pull people in, and how the complicated and vulnerable parts of themselves got pulled in, it became very clear very quick that we had a responsibility to be good stewards of these people, their feelings, and especially this data,\" Scott says. Kind Words Wins Game Beyond Entertainment | BAFTA Games Awards 2020 Scott and the Kind Words team accepting their BAFTA during lockdown. Watch on YouTube Kind Words was a turning point for Popcannibal. The studio's previous games had been relatively - in Scott's own words - frivolous, and remained that way right up until Kind Words' release. \"I've made a game called Block Pooper, and you just poop blocks. It's like Smash Brothers but all you do is just poop blocks, right,\" Scott laughs. \"That's the game we put out, like, a month before Kind Words, and it was… you know… [shrugs]. But with Kind Words, it felt like we had people who were counting on us to be the grown ups in the room, and to take care of this thing.\"In the time since Kind Words was released, Scott and Guatieri have made \"over 370,000 moderation decisions\" between them, as part of their efforts to take care of the growing community. \"We moderate every day, all day,\" Scott says. \"You know, before I got out of bed this morning, I pulled up the little phone web page that I have and made 30 decisions.\" I tell Scott I can't even imagine doing something like that, especially not before at least one cup of very strong coffee, to which he laughs. \"We have a lot of patterns,\" he smiles. \"You know, we're certainly not perfect, but we've structured the game to have a lot of tolerance for these decisions, so they aren't too disruptive. And that's a big, important part. We don't want people to feel slapped down, or like they don't belong there.\" A lot of the moderation in Kind Words is \"very gentle or quiet\" to ensure the environment remains a calm and inclusive one. \"I do have the ability to talk to players… we do send messages directly to players as the deer Ella [Kind Words' postman] in the game,\" he says, noting these messages can also be things like helping players navigate the menu. He goes on to praise the community itself for ensuring Kind Words remains a safe space. \"In-game user reporting is very important. It brings things to our attention, and when some players' behaviour is brought to our attention enough, it automatically gets extra special attention. So, we don't ban players. We started banning players originally, but it was too messy from a communication perspective to deal with and it caused a real storm among people. You ban someone from a game and they're going to lash out in other areas… So banning wasn't particularly helpful,\" Scott says.\"We do have certain players who have clear limits to their generosity, where they will be very kind and good to everybody, until say, an issue of sexual identity comes up, and then they may have some very conservative and unkind philosophies on that. And so, we make sure we remove some types of content from some people, but still let other stuff through.\" Image credit: Popcannibal Since Kind Words' debut, both Scott and Guatieri have read thousands upon thousands of messages from across the world, and as a result the developers have been exposed to some strong, and at times distressing, emotional states. \"Players also, they get quite shocked when they see others talking about self harm, or people talking about killing themselves, which happens all the time in the game,\" Scott says. \"It's been a little heartbreaking to see how many people really feel like they're not allowed to talk about these things, because they aren't allowed to in other spaces. People will often type in 'I'm worried I'm going to unalive myself', because other platforms just literally won't let them type the word 'suicide'. \"And so you see all these people dancing around things because they've been squeezed out of these other spaces where they're not allowed to talk about mental health.\" Scott himself spoke with friends who work in both psychiatry and other mental health services, to make sure Popcannibal wasn't inadvertently making things worse by allowing these types of conversations to take place in Kind Words. He was pleased to find it wasn't, and rather Kind Words was helping many of those who needed it. He also made sure there were links to various resources within the game, signposting players to professionals as required. Image credit: Popcannibal Popcannibal has just released Kind Words 2, which expands upon the world players can visit but still retains that core premise of sending letters and, well, sharing kind words with others. The game, which has the original Kind Words wrapped up into it, now lets players venture out of their home, and into a bustling neighbourhood. Here, you can have conversations with other players, share recommendations and partake in a spot of poetry. And as the game has grown, so has Scott, who tells me he feels more comfortable in his own abilities now. \"If you told me before Kind Words launched, like while I was finishing up making it, if you told me the number of people who would be playing it, I would have been paralysed,\" Scott laughs. \"I probably would have held this little Fabergé egg too close. I would have squished it for fear of like: 'Oh no, people are actually going to look at it. I'd better keep it here forever.'\"Thankfully though, Scott is confident in Popcannibal's latest project. In addition, he has also started helping other developers who are creating their own games like Kind Words. He specifically highlights Campfire, a game in which sharing emotions and listening to others is the main premise. \"Embody a cute character, create your cosiest safe place and gather around the campfire to be a part of a collective story. We all need a good talk under the stars,\" reads Campfire's Steam page. \"[Campfire's developers] reached out because we're in the same work, in the same zone and area, and they just wanted to talk about it,\" Scott says. \"And, you know, I've talked to a few other developers who are also working in this type of area with these topics.\" This is all a far cry from the man who once considered leaving indie game development because he had lost faith in his own capabilities. Image credit: Popcannibal Given his own journey, I ask Scott what advice he would now give to others who may need a boost. His message: \"It's surprisingly meaningful to say something simple and perhaps unoriginal to somebody. I've been surprised over and over in Kind Words at how common platitudes like 'you'll be alright, I believe in you', or 'you're going to get through this' and 'someone out there loves you' can really mean the world to someone. \"I've seen 10,000 variations of these phrases over and over, and I've seen 10,000 replies to those messages saying: Thanks, that's what I needed to hear right now.\" Scott actually has a tablet he leaves on in his kitchen, which shows the positive affirmations that come through the game. \"Initially, I put it up there as a monitor to make sure the server wasn't down, but I became really attached to having this stream of strangers' positive affirmations flowing through my kitchen, even though they don't know me and were clearly not directed to what's going on in my life right now,\" he says. \"I guess the point I'm making is, expose yourself to the nice things that people are saying, and make a little effort to just say something simple and nice as well,\" Scott closes with a smile. \"Even the smallest of gestures can really help lift somebody up.\" If you need someone to talk to, the Samaritans are there to help. They can be called, for free, on 116 123 in the UK and Ireland, or emailed on jo@samaritans.org / jo@samaritans.ie. Lines are open 24 hours a day, 365 days a year. Other international suicide helplines can be found at Befrienders Worldwide. You can also find more details on the Mental Health Foundation here. For Europe, more information on various helplines can be found via Mental Health Europe.",
  "image": "https://assetsio.gnwcdn.com/A-cosy-room-in-Kind-Words-2-set-against-an-autumnal-scene.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n  \n\n  \n\n\n            \u003cp\u003e\u003cem\u003e\u003cstrong\u003eEditor\u0026#39;s note:\u003c/strong\u003e 10th October every year is World Mental Health Day. This year, we\u0026#39;re marking it with a look at the wonderful Kind Words. Please be advised this piece contains discussion of sensitive topics such as self harm.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;After Trump won the election in America, it was sort of horrifying, and I was in a stupor. I was just reflecting on how everybody could be so cruel, dismissive and insensitive; of how everybody could just be not good to each other.\u003c/p\u003e\n\u003cp\u003e\u0026#34;There was just so much of that, that it just pushed me into the direction of thinking \u0026#39;I don\u0026#39;t believe the world is as bad as it seems\u0026#39;, and we need to give people a chance to behave better. I bet they would.\u0026#34;\u003c/p\u003e\n\u003cp\u003eI\u0026#39;m speaking with Popcannibal developer Ziba Scott about Kind Words, and its successor Kind Words 2. In September 2019, Scott and fellow developer Luigi Guatieri released Kind Words, a relatively simple but incredibly beautiful game about helping others by writing encouraging letters. The duo had no idea what type of reception or impact Kind Words could have, if any, and Scott admits he assumed any community would just \u0026#34;fizzle out\u0026#34; pretty quickly.\u003c/p\u003e\n\u003cp\u003eBut that didn\u0026#39;t matter. Scott knew he needed to create something which would at least give people the opportunity to, quite simply, \u0026#34;be less mean to each other\u0026#34; - and it worked.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Kind Words 2 (lofi city pop) - Release Date Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/YYX4rrhXXfQ?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/YYX4rrhXXfQ/hqdefault.jpg\"/\u003e\u003cspan\u003eKind Words 2 (lofi city pop) - Release Date Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/YYX4rrhXXfQ?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/YYX4rrhXXfQ?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eKind Words 2 (lofi city pop) - Release Date Trailer. \u003ca href=\"https://www.youtube.com/watch?v=YYX4rrhXXfQ\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eA quick look at \u003ca href=\"https://steamcommunity.com/app/1070710/reviews/?browsefilter=toprated\u0026amp;snr=1_5_100010_\"\u003ereviews for Kind Words\u003c/a\u003e shows the positive impact the game has had since its release five years ago. Comments such as \u0026#34;this game saved me\u0026#34; and \u0026#34;it restored my faith in mankind\u0026#34; are all there, while others are just grateful to have a safe space to share their feelings.\u003c/p\u003e\u003cp\u003eEveryone at some point needs care and attention, Scott says, adding when the idea for Kind Words first came to him, he was going through a \u0026#34;complicated\u0026#34; period in his own life. Along with the political changes happening in America at that time, Popcannibal had also just released a physics-based construction game called \u003ca href=\"https://store.steampowered.com/app/417200/Make_Sail/\"\u003eMake Sail\u003c/a\u003e. It did not go well.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It was the biggest thing we\u0026#39;d ever done, and we\u0026#39;d put it out, and it absolutely cratered,\u0026#34; Scott recalls. \u0026#34;There were problems with the game. Sales didn\u0026#39;t go well, and so it was just... it was a depressing time. I was thinking, \u0026#39;maybe I shouldn\u0026#39;t be making games, maybe I should do something else\u0026#39;. I was counting myself out of being an indie game developer.\u0026#34; In the same week Kind Words released, Scott started working for a different company.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/kw1.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Letter writing in Kind Words\" height=\"389\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/kw1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/kw1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/kw1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003ePopcannibal\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eHowever, Kind Words quickly defied expectations and became a surprise hit for Popcannibal. Following its debut, the studio landed itself both a Game Awards and BAFTA nomination, before ultimately winning the Game Beyond Entertainment BAFTA in 2020. These acknowledgements from the industry naturally raised Kind Words\u0026#39; profile even further, and the growing popularity meant extra work for Scott and Guateiri, who felt an almost parental duty to their players.\u003c/p\u003e\u003cp\u003e\u0026#34;We didn\u0026#39;t expect a big community to form around it… but once we saw what sort of magnetism it had to pull people in, and how the complicated and vulnerable parts of themselves got pulled in, it became very clear very quick that we had a responsibility to be good stewards of these people, their feelings, and especially this data,\u0026#34; Scott says.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Kind Words Wins Game Beyond Entertainment | BAFTA Games Awards 2020\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/YWP1SiMzrY8?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/YWP1SiMzrY8/hqdefault.jpg\"/\u003e\u003cspan\u003eKind Words Wins Game Beyond Entertainment | BAFTA Games Awards 2020\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/YWP1SiMzrY8?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/YWP1SiMzrY8?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eScott and the Kind Words team accepting their BAFTA during lockdown. \u003ca href=\"https://www.youtube.com/watch?v=YWP1SiMzrY8\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eKind Words was a turning point for Popcannibal. The studio\u0026#39;s previous games had been relatively - in Scott\u0026#39;s own words - frivolous, and remained that way right up until Kind Words\u0026#39; release.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;ve made a game called \u003ca href=\"https://store.steampowered.com/app/972600/Block_Pooper_9/\"\u003eBlock Pooper\u003c/a\u003e, and you just poop blocks. It\u0026#39;s like Smash Brothers but all you do is just poop blocks, right,\u0026#34; Scott laughs. \u0026#34;That\u0026#39;s the game we put out, like, a month before Kind Words, and it was… you know… [shrugs]. But with Kind Words, it felt like we had people who were counting on us to be the grown ups in the room, and to take care of this thing.\u0026#34;\u003c/p\u003e\u003cp\u003eIn the time since Kind Words was released, Scott and Guatieri have made \u0026#34;over 370,000 moderation decisions\u0026#34; between them, as part of their efforts to take care of the growing community. \u0026#34;We moderate every day, all day,\u0026#34; Scott says. \u0026#34;You know, before I got out of bed this morning, I pulled up the little phone web page that I have and made 30 decisions.\u0026#34;\u003c/p\u003e\n\u003cp\u003eI tell Scott I can\u0026#39;t even imagine doing something like that, especially not before at least one cup of very strong coffee, to which he laughs. \u0026#34;We have a lot of patterns,\u0026#34; he smiles. \u0026#34;You know, we\u0026#39;re certainly not perfect, but we\u0026#39;ve structured the game to have a lot of tolerance for these decisions, so they aren\u0026#39;t too disruptive. And that\u0026#39;s a big, important part. We don\u0026#39;t want people to feel slapped down, or like they don\u0026#39;t belong there.\u0026#34;\u003c/p\u003e\n\u003cp\u003eA lot of the moderation in Kind Words is \u0026#34;very gentle or quiet\u0026#34; to ensure the environment remains a calm and inclusive one. \u0026#34;I do have the ability to talk to players… we do send messages directly to players as the deer Ella [Kind Words\u0026#39; postman] in the game,\u0026#34; he says, noting these messages can also be things like helping players navigate the menu. He goes on to praise the community itself for ensuring Kind Words remains a safe space.\u003c/p\u003e\n\u003cp\u003e\u0026#34;In-game user reporting is very important. It brings things to our attention, and when some players\u0026#39; behaviour is brought to our attention enough, it automatically gets extra special attention. So, we don\u0026#39;t ban players. We started banning players originally, but it was too messy from a communication perspective to deal with and it caused a real storm among people. You ban someone from a game and they\u0026#39;re going to lash out in other areas… So banning wasn\u0026#39;t particularly helpful,\u0026#34; Scott says.\u003c/p\u003e\u003cp\u003e\u0026#34;We do have certain players who have clear limits to their generosity, where they will be very kind and good to everybody, until say, an issue of sexual identity comes up, and then they may have some very conservative and unkind philosophies on that. And so, we make sure we remove some types of content from some people, but still let other stuff through.\u0026#34;\u003c/p\u003e\n\u003cfigure data-count=\"2\" role=\"group\"\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/image-(403)_fN5wU0r.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Ella, Kind Words\u0026#39; deer postman\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/image-(403)_fN5wU0r.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/image-(403)_fN5wU0r.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/image-(403)_fN5wU0r.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/image-(402)_iJaMIPA.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Ella, Kind Words\u0026#39; deer postman\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/image-(402)_iJaMIPA.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/image-(402)_iJaMIPA.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/image-(402)_iJaMIPA.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003ePopcannibal\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eSince Kind Words\u0026#39; debut, both Scott and Guatieri have read thousands upon thousands of messages from across the world, and as a result the developers have been exposed to some strong, and at times distressing, emotional states.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Players also, they get quite shocked when they see others talking about self harm, or people talking about killing themselves, which happens all the time in the game,\u0026#34; Scott says. \u0026#34;It\u0026#39;s been a little heartbreaking to see how many people really feel like they\u0026#39;re not allowed to talk about these things, because they aren\u0026#39;t allowed to in other spaces. People will often type in \u0026#39;I\u0026#39;m worried I\u0026#39;m going to unalive myself\u0026#39;, because other platforms just literally won\u0026#39;t let them type the word \u0026#39;suicide\u0026#39;.\u003c/p\u003e\n\u003cp\u003e\u0026#34;And so you see all these people dancing around things because they\u0026#39;ve been squeezed out of these other spaces where they\u0026#39;re not allowed to talk about mental health.\u0026#34;\u003c/p\u003e\n\u003cp\u003eScott himself spoke with friends who work in both psychiatry and other mental health services, to make sure Popcannibal wasn\u0026#39;t inadvertently making things worse by allowing these types of conversations to take place in Kind Words. He was pleased to find it wasn\u0026#39;t, and rather Kind Words was helping many of those who needed it. He also made sure there were links to various resources within the game, signposting players to professionals as required.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Poetry-in-Kind-Words-2.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Poetry in Kind Words 2\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Poetry-in-Kind-Words-2.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Poetry-in-Kind-Words-2.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Poetry-in-Kind-Words-2.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003ePopcannibal\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003ePopcannibal has just released \u003ca href=\"https://store.steampowered.com/app/2118120/Kind_Words_2_lofi_city_pop/?curator_clanid=6857515\"\u003eKind Words 2\u003c/a\u003e, which expands upon the world players can visit but still retains that core premise of sending letters and, well, sharing kind words with others. The game, which has the original Kind Words wrapped up into it, now lets players venture out of their home, and into a bustling neighbourhood. Here, you can have conversations with other players, share recommendations and partake in a spot of poetry.\u003c/p\u003e\n\u003cp\u003eAnd as the game has grown, so has Scott, who tells me he feels more comfortable in his own abilities now.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If you told me before Kind Words launched, like while I was finishing up making it, if you told me the number of people who would be playing it, I would have been paralysed,\u0026#34; Scott laughs. \u0026#34;I probably would have held this little Fabergé egg too close. I would have squished it for fear of like: \u0026#39;Oh no, people are actually going to look at it. I\u0026#39;d better keep it here forever.\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003eThankfully though, Scott is confident in Popcannibal\u0026#39;s latest project. In addition, he has also started helping other developers who are creating their own games like Kind Words. He specifically highlights Campfire, a game in which sharing emotions and listening to others is the main premise. \u0026#34;Embody a cute character, create your cosiest safe place and gather around the campfire to be a part of a collective story. We all need a good talk under the stars,\u0026#34; reads \u003ca href=\"https://store.steampowered.com/app/2990600/Campfire/\"\u003eCampfire\u0026#39;s Steam page\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;[Campfire\u0026#39;s developers] reached out because we\u0026#39;re in the same work, in the same zone and area, and they just wanted to talk about it,\u0026#34; Scott says. \u0026#34;And, you know, I\u0026#39;ve talked to a few other developers who are also working in this type of area with these topics.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis is all a far cry from the man who once considered leaving indie game development because he had lost faith in his own capabilities.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Kind-Words-2-screenshot-showing-encouraging-words-across-a-blue-sky-as-a-neighbour-community-gathers-together-in-a-park-below.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Kind Words 2 screenshot showing encouraging words across a blue sky as a neighbour community gathers together in a park below\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Kind-Words-2-screenshot-showing-encouraging-words-across-a-blue-sky-as-a-neighbour-community-gathers-together-in-a-park-below.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Kind-Words-2-screenshot-showing-encouraging-words-across-a-blue-sky-as-a-neighbour-community-gathers-together-in-a-park-below.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Kind-Words-2-screenshot-showing-encouraging-words-across-a-blue-sky-as-a-neighbour-community-gathers-together-in-a-park-below.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003ePopcannibal\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eGiven his own journey, I ask Scott what advice he would now give to others who may need a boost. His message:\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s surprisingly meaningful to say something simple and perhaps unoriginal to somebody. I\u0026#39;ve been surprised over and over in Kind Words at how common platitudes like \u0026#39;you\u0026#39;ll be alright, I believe in you\u0026#39;, or \u0026#39;you\u0026#39;re going to get through this\u0026#39; and \u0026#39;someone out there loves you\u0026#39; can really mean the world to someone.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;ve seen 10,000 variations of these phrases over and over, and I\u0026#39;ve seen 10,000 replies to those messages saying: Thanks, that\u0026#39;s what I needed to hear right now.\u0026#34;\u003c/p\u003e\n\u003cp\u003eScott actually has a tablet he leaves on in his kitchen, which shows the positive affirmations that come through the game. \u0026#34;Initially, I put it up there as a monitor to make sure the server wasn\u0026#39;t down, but I became really attached to having this stream of strangers\u0026#39; positive affirmations flowing through my kitchen, even though they don\u0026#39;t know me and were clearly not directed to what\u0026#39;s going on in my life right now,\u0026#34; he says.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I guess the point I\u0026#39;m making is, expose yourself to the nice things that people are saying, and make a little effort to just say something simple and nice as well,\u0026#34; Scott closes with a smile.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Even the smallest of gestures can really help lift somebody up.\u0026#34;\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cem\u003eIf you need someone to talk to, the Samaritans are there to help. They can be called, for free, on 116 123 in the UK and Ireland, or emailed on jo@samaritans.org / jo@samaritans.ie. Lines are open 24 hours a day, 365 days a year.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eOther international suicide helplines can be found at \u003c/em\u003e\u003ca href=\"https://www.befrienders.org/\"\u003e\u003cem\u003eBefrienders Worldwide\u003c/em\u003e\u003c/a\u003e\u003cem\u003e. You can also find more details on the \u003c/em\u003e\u003ca href=\"https://www.mentalhealth.org.uk/\"\u003e\u003cem\u003eMental Health Foundation here\u003c/em\u003e\u003c/a\u003e\u003cem\u003e. For Europe, more information on various helplines can be found via \u003c/em\u003e\u003ca href=\"https://www.mhe-sme.org/library/helplines/\"\u003e\u003cem\u003eMental Health Europe\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-10-10T09:44:27.61094Z",
  "modifiedTime": null
}
