{
  "id": "e827a4e7-c98c-42c3-bf02-e384c0ec28ce",
  "title": "Dragon Age Adopting Mass Effect’s Structure Isn’t Ideal, But It’s Exactly What BioWare Needed",
  "link": "https://www.escapistmagazine.com/dragon-age-adopting-mass-effects-structure-isnt-ideal-but-its-exactly-what-bioware-needed/",
  "description": "",
  "author": "Fran Ruiz",
  "published": "Sat, 16 Nov 2024 23:00:00 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Features",
    "Opinion",
    "Video Games",
    "BioWare",
    "Dragon Age The Veilguard",
    "Featured",
    "Mass Effect"
  ],
  "byline": "Fran Ruiz",
  "length": 6312,
  "excerpt": "BioWare might not realize it, but having Dragon Age adopt Mass Effect's structure will help in the long run.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "Dragon Age: The Veilguard ended up arriving a full decade after Inquisition. With BioWare on its last legs before this seemingly successful launch and the industry also starting to anticipate the new Mass Effect, was leaning on its sci-fi franchise’s strengths in order to save this fantasy RPG really the right call? For the longest time, countless RPG fanatics and veteran followers of the franchise have gaslighted themselves into thinking Dragon Age had a cohesive identity (it didn’t). The creative swings haven’t always come out of a drive to rework the formula, though. In spite of the reasonable success the series has found over the years, we can safely state that many of its big changes happened out of necessity. The Veilguard arrives right after Baldur’s Gate 3 rekindled mainstream love for CRPGs and spicy romances set in lush fantasy worlds. Modern Dragon Age could deliver on only the second front, and I think it’s a good thing BioWare read the room correctly, deciding to use its own set of well-tested “weapons” versus trying to return to its too-distant past. Screenshot by The Escapist If you ask around nowadays, you’ll find more genuine love for Mass Effect than the previous three Dragon Age entries because they’re absolutely enjoyable to play. I continue to believe no installment has aged badly, with each one giving the systems different spins and trying to update party-based RPG mechanics in its own way. There’s a uniqueness to this series, as I said, and I don’t think they’re rougher to control than the (admittedly excellent) Larian RPG that everyone keeps praising. There’s also the weird misconception that past Dragon Age games were expansive open worlds. They weren’t. Only Inquisition absorbed the early 2010s sandbox trends, both good and bad. Perhaps this lie has been brought up time and again recently (much like countless more stupid ones) to try and shoot down Dragon Age: The Veilguard. Like it or not, it’s a very BioWare game, one that actually returns to the studio’s golden era and pays little attention to posterior fumbles like Mass Effect: Andromeda and Anthem. “Mass Effect 2 but make it fantasy” is a perfectly apt way to quickly describe Dragon Age: The Veilguard. It might sound lazy, but that’s what the game is. And it’s perfectly fine. Throughout the year, I play a ton of games, both big and small, and I can confidently say BioWare’s newest is the most polished AAA release I’ve encountered in a good bit. Sure, that’s what embracing several delays gets you, but I think it also feels “clean” due to its commitment to a more streamlined, oddly tight structure that seems to run in the opposite direction of current Western trends. Screenshot by The Escapist Related: All Major Voice Actors \u0026 Cast List for Dragon Age: The Veilguard If Inquisition (a game I love for the most part) marked the beginning of BioWare’s struggles with overextended game worlds, then Andromeda and Anthem made it abundantly clear the company wasn’t a good fit for that line of game design. It’s interesting to discuss whether Dragon Age: The Veilguard feels too safe in places (it does), but structure isn’t one of its problems. Quite the opposite. This doesn’t mean it’s a “short” RPG, either, as most people’s first playthroughs are clocking around the 60-hour mark. It just doesn’t do filler. Sure, you can walk around and unlock new areas to explore as you progress through its branching main story, but cleaning loot and finding little pieces of side content only requires a bit of curiosity, not the unhealthy dedication the average modern open-world asks of players. The very same applies to its remarkable side quests. It all feels familiar yet refreshing. We just don’t get many big-budget RPGs that feel perfect for relaxed end-of-the-day consumption anymore. The densest thing about Dragon Age: The Veilguard is its narrative and how much it fleshes out its colorful cast of characters. I’d have liked a bit more friction for sure, but it overall feels like a good ol’ fantasy book that happens to be playable and looks super expensive. It’s long, but the key here is that it’s never a chore to play through. Screenshot by The Escapist There’s a reason why late 2000s and early 2010s BioWare managed to capture the attention of so many casual gamers, and I think this might be it. Without sacrificing engrossing storytelling or rock-solid role-playing (it’s always been about embodying someone else, not piling up numbers), the teams came up with big-budget spectacles that weren’t nearly as demanding as the original Baldur’s Gate entries. This might not be everyone’s cup of tea (or coffee, if you’re a Lucanis stan), but it’s what worked wonders for BioWare back in the day, and I’m happy to see them getting back on that saddle, warts and all. Beyond the overall game and story structure, a transition into fully real-time combat with proper dodges, parries, and cancellable actions also feels like a natural evolution. Again, I’d have enjoyed maybe a bit of control over my squad mates instead of going full Mass Effect here, but it’s hard to deny it works as well as Dragon’s Dogma’s direct and crunchy approach to combat. It’s also the one fantasy RPG that made me pounce on the mage class from the get-go since it enjoys as many mobility options and sick tricks as the more physical ones. Rad. Looking at the future, it’s clear that BioWare is back on track even if Dragon Age: The Veilguard falters in some areas. Rejecting the idea of developing DLCs feels like another smart move, instead keeping the momentum going into the new Mass Effect. About that one, let me just say that I hope it has slightly meaner companions and that it dares to recover some flawed but compelling ideas from Andromeda and Anthem’s ruins. Not every last-gen innovation was a bad one for the company. For now, I’ll focus on making my nice, very charming companions act even nicer to Rook and clutter up the screen with more particle FX. That’ll do. Dragon Age: The Veilguard is available now on PlayStation, Xbox, and PC. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/11/Veilguard_1.png?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"319\" data-injectable=\"true\" data-video=\"true\"\u003e\u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/tag/dragon-age-the-veilguard/\"\u003eDragon Age: The Veilguard\u003c/a\u003e \u003c/em\u003eended up arriving a full decade after \u003cem\u003eInquisition\u003c/em\u003e. With BioWare on its last legs before this seemingly successful launch and the industry also starting to anticipate the new \u003cem\u003eMass Effect\u003c/em\u003e, was leaning on its sci-fi franchise’s strengths in order to save this fantasy RPG really the right call?\u003c/p\u003e\n\n    \u003cp data-characters=\"410\" data-current-count=\"410\" data-injectable=\"false\"\u003eFor the longest time, countless RPG fanatics and veteran followers of the franchise have gaslighted themselves into thinking \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/dragon-ages-inconsistency-has-become-its-biggest-strength/\"\u003eDragon Age\u003c/a\u003e\u003c/em\u003e\u003ca href=\"https://www.escapistmagazine.com/dragon-ages-inconsistency-has-become-its-biggest-strength/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e had a cohesive identity (it didn’t)\u003c/a\u003e. The creative swings haven’t always come out of a drive to rework the formula, though. In spite of the reasonable success the series has found over the years, we can safely state that many of its big changes happened out of necessity.\u003c/p\u003e    \u003cp data-characters=\"371\" data-current-count=\"781\" data-injectable=\"true\"\u003e\u003cem\u003eThe Veilguard \u003c/em\u003earrives right after \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/dragons-dogma-2-delicious-in-dungeon-are-part-of-fantasys-big-post-bg3-refresh/\"\u003eBaldur’s Gate 3\u003c/a\u003e\u003c/em\u003e\u003ca href=\"https://www.escapistmagazine.com/dragons-dogma-2-delicious-in-dungeon-are-part-of-fantasys-big-post-bg3-refresh/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e rekindled mainstream love for CRPGs\u003c/a\u003e and spicy romances set in lush fantasy worlds. Modern \u003cem\u003eDragon Age \u003c/em\u003ecould deliver on only the second front, and I think it’s a good thing BioWare read the room correctly, deciding to use its own set of well-tested “weapons” versus trying to return to its too-distant past.\u003c/p\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2024/11/Veilguard_2.png?w=1024\u0026amp;resize=1200%2C675\" alt=\"Dragon Age: The Veilguard - magic combat\"/\u003e\u003cfigcaption\u003eScreenshot by The Escapist\u003c/figcaption\u003e\u003c/figure\u003e    \u003cp data-characters=\"507\" data-current-count=\"807\" data-injectable=\"true\"\u003eIf you ask around nowadays, you’ll find more genuine love for \u003cem\u003eMass Effect \u003c/em\u003ethan the previous three \u003cem\u003eDragon Age \u003c/em\u003eentries because they’re absolutely enjoyable to play. I continue to believe no installment has aged badly, with each one giving the systems different spins and trying to update party-based RPG mechanics in its own way. There’s a uniqueness to this series, as I said, and I don’t think they’re rougher to control than the (admittedly excellent) Larian RPG that everyone keeps praising.\u003c/p\u003e\n\n    \u003cp data-characters=\"521\" data-current-count=\"521\" data-injectable=\"false\"\u003eThere’s also the weird misconception that past \u003cem\u003eDragon Age \u003c/em\u003egames were expansive open worlds. They weren’t. Only \u003cem\u003eInquisition \u003c/em\u003eabsorbed the early 2010s sandbox trends, both good and bad. Perhaps this lie has been brought up time and again recently (much like countless more stupid ones) to try and shoot down \u003cem\u003eDragon Age: The Veilguard\u003c/em\u003e. Like it or not, it’s a very BioWare game, one that actually returns to the studio’s golden era and pays little attention to posterior fumbles like \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/mass-effect-1-has-aged-worse-than-andromeda/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMass Effect: Andromeda\u003c/a\u003e \u003c/em\u003eand \u003cem\u003eAnthem\u003c/em\u003e.\u003c/p\u003e    \u003cp data-characters=\"611\" data-current-count=\"1132\" data-injectable=\"true\"\u003e“\u003cem\u003eMass Effect 2 \u003c/em\u003ebut make it fantasy” is a perfectly apt way to quickly describe \u003cem\u003eDragon Age: The Veilguard\u003c/em\u003e. It might sound lazy, but that’s what the game is. And it’s perfectly fine. Throughout the year, I play a ton of games, both big and small, and I can confidently say BioWare’s newest is the most polished AAA release I’ve encountered in a good bit. Sure, that’s what embracing several delays gets you, but I think it also feels “clean” due to its commitment to a more streamlined, oddly tight structure that seems to run in the opposite direction of current Western trends.\u003c/p\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2024/11/Veilguard_3.png?w=1024\u0026amp;resize=1200%2C675\" alt=\"Dragon Age: The Veilguard - Lucanis\"/\u003e\u003cfigcaption\u003eScreenshot by The Escapist\u003c/figcaption\u003e\u003c/figure\u003e    \u003cp data-characters=\"77\" data-current-count=\"377\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.escapistmagazine.com/all-major-voice-actors-cast-list-for-dragon-age-the-veilguard/\"\u003eAll Major Voice Actors \u0026amp; Cast List for Dragon Age: The Veilguard\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e    \u003cp data-characters=\"401\" data-current-count=\"778\" data-injectable=\"true\"\u003eIf \u003cem\u003eInquisition \u003c/em\u003e(a game I love for the most part) marked the beginning of BioWare’s struggles with overextended game worlds, then \u003cem\u003eAndromeda \u003c/em\u003eand \u003cem\u003eAnthem\u003c/em\u003e made it abundantly clear the company wasn’t a good fit for that line of game design. It’s interesting to discuss whether\u003cem\u003e Dragon Age: The Veilguard \u003c/em\u003efeels too safe in places (it does), but structure isn’t one of its problems. Quite the opposite.\u003c/p\u003e\n\n    \u003cp data-characters=\"497\" data-current-count=\"497\" data-injectable=\"false\"\u003eThis doesn’t mean it’s a “short” RPG, either, as most people’s first playthroughs are clocking around the 60-hour mark. It just doesn’t do filler. Sure, you can walk around and unlock new areas to explore as you progress through its branching main story, but cleaning loot and finding little pieces of side content only requires a bit of curiosity, not the unhealthy dedication the average modern open-world asks of players. The very same applies to its remarkable side quests.\u003c/p\u003e    \u003cp data-characters=\"502\" data-current-count=\"999\" data-injectable=\"true\"\u003eIt all feels familiar yet refreshing. We just don’t get many big-budget RPGs that feel perfect for relaxed end-of-the-day consumption anymore. The densest thing about\u003cem\u003e Dragon Age: The Veilguard \u003c/em\u003eis its narrative and how much it fleshes out its colorful cast of characters. I’d have liked a bit more friction for sure, but it overall feels like a good ol’ fantasy book that happens to be playable and looks super expensive. It’s long, but the key here is that it’s never a chore to play through.\u003c/p\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2024/11/Veilguard_4.png?w=1024\u0026amp;resize=1200%2C675\" alt=\"Dragon Age: The Veilguard - Minrathous under siege\"/\u003e\u003cfigcaption\u003eScreenshot by The Escapist\u003c/figcaption\u003e\u003c/figure\u003e    \u003cp data-characters=\"627\" data-current-count=\"927\" data-injectable=\"true\"\u003eThere’s a reason why late 2000s and early 2010s BioWare managed to capture the attention of so many casual gamers, and I think this might be it. Without sacrificing engrossing storytelling or rock-solid role-playing (it’s always been about embodying someone else, not piling up numbers), the teams came up with big-budget spectacles that weren’t nearly as demanding as the original \u003cem\u003eBaldur’s Gate \u003c/em\u003eentries. This might not be everyone’s cup of tea (or coffee, if you’re a Lucanis stan), but it’s what worked wonders for BioWare back in the day, and I’m happy to see them getting back on that saddle, warts and all.\u003c/p\u003e\n\n    \u003cp data-characters=\"563\" data-current-count=\"563\" data-injectable=\"false\"\u003eBeyond the overall game and story structure, a transition into fully real-time combat with proper dodges, parries, and cancellable actions also feels like a natural evolution. Again, I’d have enjoyed maybe a bit of control over my squad mates instead of going full \u003cem\u003eMass Effect \u003c/em\u003ehere, but it’s hard to deny it works as well as \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/dragons-dogma-has-the-best-dungeons-people-havent-played/\"\u003eDragon’s Dogma’s\u003c/a\u003e\u003c/em\u003e\u003ca href=\"https://www.escapistmagazine.com/dragons-dogma-has-the-best-dungeons-people-havent-played/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e direct and crunchy approach to combat\u003c/a\u003e. It’s also the one fantasy RPG that made me pounce on the mage class from the get-go since it enjoys as many mobility options and sick tricks as the more physical ones. Rad.\u003c/p\u003e    \u003cp data-characters=\"642\" data-current-count=\"1205\" data-injectable=\"true\"\u003eLooking at the future, it’s clear that BioWare is back on track even if \u003cem\u003eDragon Age: The Veilguard \u003c/em\u003efalters in some areas. \u003ca href=\"https://www.forbes.com/sites/paultassi/2024/11/04/no-dragon-age-the-veilguard-dlc-as-bioware-goes-all-in-on-mass-effect-5/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRejecting the idea of developing DLCs\u003c/a\u003e feels like another smart move, instead keeping the momentum going into the new \u003cem\u003eMass Effect\u003c/em\u003e. About that one, let me just say that I hope it has slightly meaner companions and that it dares to recover some flawed but compelling ideas from \u003cem\u003eAndromeda \u003c/em\u003eand \u003cem\u003eAnthem\u003c/em\u003e’s ruins. Not every last-gen innovation was a bad one for the company. For now, I’ll focus on making my nice, very charming \u003ca href=\"https://www.escapistmagazine.com/all-dragon-age-veilguard-companions-listed/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ecompanions\u003c/a\u003e act even nicer to Rook and clutter up the screen with more particle FX. That’ll do.\u003c/p\u003e\n\n    \u003cp data-characters=\"73\" data-current-count=\"73\" data-injectable=\"false\"\u003e\u003cem\u003e\u003ca href=\"https://www.ea.com/games/dragon-age/dragon-age-the-veilguard\"\u003eDragon Age: The Veilguard\u003c/a\u003e is available now on PlayStation, Xbox, and PC.\u003c/em\u003e\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://escapistmagazine.com/affiliate-policy\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-16T23:00:00Z",
  "modifiedTime": "2024-11-15T13:41:45Z"
}
