{
  "id": "ed48547e-158b-40b3-89a1-c073aee690e1",
  "title": "Awaken – Astral Blade: an inside look at sci-fi inspiration, out tomorrow",
  "link": "https://blog.playstation.com/2024/10/21/awaken-astral-blade-an-inside-look-at-sci-fi-inspiration-out-tomorrow/",
  "description": "Hello everyone! I’m honored to share more on Dark Pigeon Games’ new game, Awaken – Astral Blade. Tian Yuan, Producer at Dark Pigeon Games, and I will share an overview of what players can expect when playing Awaken – Astral Blade, what inspired the deeply intriguing sci-fi world it is set within, and more. First […]",
  "author": "Ilia Svanidze",
  "published": "Mon, 21 Oct 2024 14:00:28 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PS5",
    "Awaken - Astral Blade",
    "Dark Pigeon Games",
    "ESDigital Games"
  ],
  "byline": "Duncan Heaney Content Communications Manager, Square Enix",
  "length": 4586,
  "excerpt": "A sci-fi adventure inspired by Annihilation and Blade Runner 2049.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjEDEaCXVzLWVhc3QtMSJHMEUCIQDgR26AyoYOawbHDZDCBqjbCECcymKRvWcUmHhPt%252BDnvwIgZ2t%252FXXkYBRWVEEN4JHLBi6MCo7dRZZ9RUb%252FJjXfh8VMqhgQImv%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FARAAGgw1Nzc0MTg4MTg0MTMiDLL8JFmcUwf%252F2gu2%252BCraA2v%252BFBLLrWEBC%252FrC6E9ujrCIIuAlf9svTNW8V1VawDcamrRmtotCUNrN%252BC9sj88jOT9HZ7t7QH03Zr2e9%252FIvcpZoo2ZeTYDVAYROEBfst1nsWhq9WSTVAIeS30FnPx4fCn%252FOuotIWfx7UC%252FzpRwiGEecvAHs4gPD0oeMNvd0DklR%252FniF%252BH5Ko575i0GKjlJSPXyJ%252Bf%252BlSNkR9G%252BirG3lhkJlOE%252FRiSG89t%252F2rIePdzYY9js9UaN2Pu89uWoB%252FzG85x%252BZtWGYtPEyrcqBmaB1ykZQKlpVREO9w0BwROEdsQq8q%252F4ZXuBT04393JtKU9Kf7QBjtHMIuvhWrhC03mTYFhwdQf80z8IRQ3rrQ9nU%252FQtIkRtI8uJ8zFymjNotVRK2vNdNZr9bJtvjMHNx96Yo9IfW3DA40pGjvSlXj5m%252FNWXSViDMbYScjSg54K1cjPANJJgDbYA7L9uO3ZgVnxa9NQ1sFb44e0m4jyyv%252F1zDyS6kC81PDXcLUGwSpI9c91ch%252FhAg5arP2m6pjOMueBi%252BDVlejr5if1OZdDKXnPw3ZjlD1RfTGVMdpDtTSmFDXr3G1KxTEtjJy1kZo4qkb0YPZA4VcUFKvuYyXiEFxQ9cnwOvhhW%252FVQIyOTy5HzCH8tu4BjqlAbLM5NgpAW%252BBtNGJl3QS7NIbmHwRganaORU7UM5aRdykKJpM6lpJky86KVo6qy0Pay%252B6%252B1jZQcFblrQded5g08XmJnGNYu5pS9L%252FJSRDnvFKjlIo9JMB%252FWy7jp6p5UEeAMynmyFFxlJk6GXmFPxtB0Z053aKi7PscS8jkxV2NIehgy7KCi4hRzIchG4FwbnW0VFaYzeMY6b015OWOhogOyeblZ%252FaAA%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NWY64TRF2E%252F20241022%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20241022T010356Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3Dc0101a7fe9cb928fadd36975c517eef141c5cac847087f5478e960fd9c6856fd\u0026fit=192%2C192",
  "text": "Hello everyone! I’m honored to share more on Dark Pigeon Games’ new game, Awaken – Astral Blade. Tian Yuan, Producer at Dark Pigeon Games, and I will share an overview of what players can expect when playing Awaken – Astral Blade, what inspired the deeply intriguing sci-fi world it is set within, and more.First and foremost, Awaken – Astral Blade is a platform adventure that marries invigorating and challenging combat with a wondrous and fascinating biopunk setting.“We want to create a mysterious and exhilarating fantasy world that deeply immerses the player, where they experience the growth and transformation of the protagonist while facing challenges head-on,” says Tian. “So, we have drawn inspiration from many excellent films and literary works to enrich our design. For example, the fantastical mutated plants from the movie Annihilation (2018), the fusion of technology and magical elements seen in the sci-fi horror film Pandorum (2009) and neo-noir Blade Runner 2049, and the imaginative works of Neil Gaiman have all been important sources of our inspiration.” The game begins as you’re sent out by Dr. Herveus to search for and rescue a missing Investigation team in the rainforest of Horace Islands and slowly uncover the dark, sinister mystery of what happened to the land and its inhabitants. Players will take control of Tania, one of Dr. Herveus’s bioengineered creations made from unique DNA samples from the Horace Islands. To develop the best Tania, he combined data provided by Gaghti, a Bionic created during the Jacha City era and the AI leader of the indigenous people, with the DNA of Molla, an ancient warrior, and Karpas energy. This resulted in a highly intelligent and physically powerful combatant. Tania’s diverse capabilities translate into the combat design, influenced by various games from the Castlevania series to Devil May Cry. Players deeply value game feel, and the development team’s efforts mirror that importance. You take on your foes with a wide range of combos, parry enemy attacks to gain an advantage, dash into enemies while they’re attacking to slow the world around you, and gain damage immunity. Only using your abilities and combo attacks will help you break through and defeat even the most challenging bosses. And, of course, we have a skill tree in the game — you can enhance Tania’s combat abilities and strength or spend it on valuable skills for various situations. The desire for a positive game feel extends beyond combat as well.“Our primary goal is to make the gameplay experience as smooth and enjoyable as possible for all players,” says Tian. “We’ve incorporated several features that allow for fast travel, such as teleportation points, sprinting, super jumps, and good placement of entrances and exits from the levels. On paper, these should seem appealing, but players will get a real idea of how fluid and fun Awaken – Astral Blade is once they get the controller in their hands and start playing.” What kind of world does a motivated team build with such expressive and distinct inspirations across gaming, film, and literature? One with a profound lore, for one. About two years ago, we at ESDigital Games started looking for new projects for the publishing house, and we eventually came across the incredible Dark Pigeon Games team. We’re honored to witness their enthusiasm and huge potential with Awaken – Astral Blade, which you can see in the effort put forth building this story.“What can I tell you about the game world? So, so many things, but we truly don’t have enough space, heh,” Tian says. “On the Horace Islands, a mysterious alien ship crashed, unleashing the arcane Karpas energy. This energy, with its transformative power, turned the islands’ ecosystem into a marvelously diverse landscape. The native inhabitants, influenced by this energy, built an impressive civilization, but it was eventually torn apart by civil war. Over time, this lost world was buried deep in history, forgotten until it was rediscovered by modern explorer Professor Loir.” Awaken – Astral Blade is a dark fairy tale where players’s decisions throughout the game will not only affect the final ending itself, but also shape the very fabric of the game’s narrative. The game is relatively linear, but players will find various pieces of information to expand on the backstory and reveal new sides to some characters. We could share so much more here, but it is better for you to pick up and play when it releases tomorrow, October 22, for PS5. Trending Stories",
  "image": "https://blog.playstation.com/tachyon/2024/10/26526d33d1c6da36c429b7aac6d948f068343ed7.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-397478\"\u003e\n\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\n\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"1088\" height=\"612\" src=\"https://blog.playstation.com/tachyon/2024/10/26526d33d1c6da36c429b7aac6d948f068343ed7.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\" alt=\"Awaken – Astral Blade: an inside look at sci-fi inspiration, out tomorrow\" sizes=\"(min-width: 1440px) 1200px, (min-width: 960px) 80vw, 100vw\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://blog.playstation.com/tachyon/2024/10/26526d33d1c6da36c429b7aac6d948f068343ed7.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1.5 1632w, https://blog.playstation.com/tachyon/2024/10/26526d33d1c6da36c429b7aac6d948f068343ed7.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1 1088w, https://blog.playstation.com/tachyon/2024/10/26526d33d1c6da36c429b7aac6d948f068343ed7.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.5 544w, https://blog.playstation.com/tachyon/2024/10/26526d33d1c6da36c429b7aac6d948f068343ed7.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.25 272w\"/\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cdiv\u003e\u003cp\u003eHello everyone! I’m honored to share more on Dark Pigeon Games’ new game, Awaken – Astral Blade. Tian Yuan, Producer at Dark Pigeon Games, and I will share an overview of what players can expect when playing Awaken – Astral Blade, what inspired the deeply intriguing sci-fi world it is set within, and more.\u003c/p\u003e\u003cp\u003eFirst and foremost, Awaken – Astral Blade is a platform adventure that marries invigorating and challenging combat with a wondrous and fascinating biopunk setting.\u003c/p\u003e\u003cp\u003e“We want to create a mysterious and exhilarating fantasy world that deeply immerses the player, where they experience the growth and transformation of the protagonist while facing challenges head-on,” says Tian. “So, we have drawn inspiration from many excellent films and literary works to enrich our design. For example, the fantastical mutated plants from the movie Annihilation (2018), the fusion of technology and magical elements seen in the sci-fi horror film Pandorum (2009) and neo-noir Blade Runner 2049, and the imaginative works of Neil Gaiman have all been important sources of our inspiration.”\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54073315853_2048058a93_o.pngr\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54073315853_2048058a93_o.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe game begins as you’re sent out by Dr. Herveus to search for and rescue a missing Investigation team in the rainforest of Horace Islands and slowly uncover the dark, sinister mystery of what happened to the land and its inhabitants. Players will take control of Tania, one of Dr. Herveus’s bioengineered creations made from unique DNA samples from the Horace Islands. To develop the best Tania, he combined data provided by Gaghti, a Bionic created during the Jacha City era and the AI leader of the indigenous people, with the DNA of Molla, an ancient warrior, and Karpas energy. This resulted in a highly intelligent and physically powerful combatant.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/8dc0c4c00059f6d05dc457860465822920251288.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eTania’s diverse capabilities translate into the combat design, influenced by various games from the Castlevania series to Devil May Cry. Players deeply value game feel, and the development team’s efforts mirror that importance. You take on your foes with a wide range of combos, parry enemy attacks to gain an advantage, dash into enemies while they’re attacking to slow the world around you, and gain damage immunity. Only using your abilities and combo attacks will help you break through and defeat even the most challenging bosses. And, of course, we have a skill tree in the game — you can enhance Tania’s combat abilities and strength or spend it on valuable skills for various situations. The desire for a positive game feel extends beyond combat as well.\u003c/p\u003e\u003cp\u003e“Our primary goal is to make the gameplay experience as smooth and enjoyable as possible for all players,” says Tian. “We’ve incorporated several features that allow for fast travel, such as teleportation points, sprinting, super jumps, and good placement of entrances and exits from the levels. On paper, these should seem appealing, but players will get a real idea of how fluid and fun Awaken – Astral Blade is once they get the controller in their hands and start playing.”\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo data-src=\"https://blog.playstation.com/uploads/2024/10/94d36be5ea95c0bd000ee546488c8aeb2317cfe2.mp4\" preload=\"metadata\" autoplay=\"\" controls=\"\" loop=\"\" muted=\"\" playsinline=\"\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eWhat kind of world does a motivated team build with such expressive and distinct inspirations across gaming, film, and literature? One with a profound lore, for one. About two years ago, we at ESDigital Games started looking for new projects for the publishing house, and we eventually came across the incredible Dark Pigeon Games team. We’re honored to witness their enthusiasm and huge potential with Awaken – Astral Blade, which you can see in the effort put forth building this story.\u003c/p\u003e\u003cp\u003e“What can I tell you about the game world? So, so many things, but we truly don’t have enough space, heh,” Tian says. “On the Horace Islands, a mysterious alien ship crashed, unleashing the arcane Karpas energy. This energy, with its transformative power, turned the islands’ ecosystem into a marvelously diverse landscape. The native inhabitants, influenced by this energy, built an impressive civilization, but it was eventually torn apart by civil war. Over time, this lost world was buried deep in history, forgotten until it was rediscovered by modern explorer Professor Loir.”\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54072176242_de5429a3e5_o.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54072176242_de5429a3e5_o.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAwaken – Astral Blade is a dark fairy tale where players’s decisions throughout the game will not only affect the final ending itself, but also shape the very fabric of the game’s narrative. The game is relatively linear, but players will find various pieces of information to expand on the backstory and reveal new sides to some characters. We could share so much more here, but it is better for you to pick up and play when it releases tomorrow, October 22, for PS5.\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/article\u003e\u003csection\u003e\n\t\u003ch2\u003eTrending Stories\u003c/h2\u003e\n\n\t\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-21T07:00:28-07:00",
  "modifiedTime": "2024-10-21T07:00:34-07:00"
}
