{
  "id": "f24cda4c-6214-46a1-b2a1-ff2d0039397b",
  "title": "Viral BookTok author Olivie Blake on what it’s like to be ‘a New Year’s resolution person’",
  "link": "https://www.polygon.com/books/500682/new-years-resolutions-olivie-blake-atlas-six",
  "description": "Fantasy writer Olivie Blake jokingly tells me that she doesn’t know how to write a book. With eight adult fantasy novels and two YA romantic comedies under her belt — including the bestselling Atlas series — it’s a little hard to believe that. But Blake, a self-proclaimed “discovery writer,” insists.   “Every time, it gets done, […]",
  "author": "Petrana Radulovic",
  "published": "2024-12-31T11:00:00-05:00",
  "source": "https://www.polygon.com/rss/index.xml",
  "categories": [
    "Books",
    "Culture",
    "Entertainment",
    "Q\u0026A"
  ],
  "byline": "Petrana Radulovic",
  "length": 9997,
  "excerpt": "‘I like to start the year assuming I will be my least lazy self, and then inevitably be disappointed’",
  "siteName": "Polygon",
  "favicon": "https://www.polygon.com/static-assets/icons/android-chrome-512x512.png",
  "text": "Fantasy writer Olivie Blake jokingly tells me that she doesn’t know how to write a book. With eight adult fantasy novels and two YA romantic comedies under her belt — including the bestselling Atlas series — it’s a little hard to believe that. But Blake, a self-proclaimed “discovery writer,” insists. “Every time, it gets done, and I tell myself I know how to do it,” she laughs. “But when I’m in the middle of the process, I’m like, I don’t know what I’m doing, and we’re just working through it. I’ve come to this embrace of the unknown.”Blake is a prolific writer for an author who claims not to know how to write. She originally self-published her adult novels under a pen name, the same one she used for her fanfiction. When The Atlas Six became a viral sensation via TikTok and other social media, she got a chance to republish that novel in 2022 with Tor. The publishing house also republished her older adult fantasy, and picked up the rest of the Atlas series. At the same time, Blake published her YA debut, My Mechanical Romance, under the name Alexene Farol Follmuth. In 2024, she published the last book of the Atlas trilogy, along with Twelfth Knight, another YA rom-com. With two new stand-alone adult fantasy books coming out in 2025 and a whole lot more planned for down the line, Blake has learned a thing or two about balancing projects, focusing on goals, and figuring out what to work on next. Since the beginning of a new year is always a time for reflection about setting new goals and considering self-improvement, Polygon reached out to Blake to ask how she stays so productive, and discuss the perks of being “a New Year’s resolution person.”This interview has been edited for concision and clarity.Polygon: Do you set professional or creative goals for yourself as the new year approaches, or do you have different strategies?Olivie Blake: I’m a New Year’s resolution person. I like to start the year assuming I will be my least lazy self, and then inevitably be disappointed. But I feel like in the margin for error, there is still some improvement. Photo courtesy of Olivie Blake[For my creative goals], I’m trying to see myself as less of an expert and more of […] I keep trying to put myself back in the feeling of being a hobbyist. I had the most fun when I was a fanfiction writer and there were no expectations. I wasn’t worried about building an audience. I just [thought], Can I do this? Or How good would it feel if I got this exactly as I’ve imagined it? And it never happens that way. But I think the feeling of approaching something like it’s the first time is falling in love all over again.As far as professional goals, artistic careers are really hard to have a sense of measurement for. It’s hard to see that you’ve come a distance or moved up in any way. I’m at a point where I’ve been pretty prolific and some of it is a mix of new [and old self-published titles]. We’re at the point where I don’t have any more backlist titles and everything is new. But I also would like to kind of slow things down so that I’m not so fatigued by the promotional and marketing and all the industry aspects. And so to give myself more, basically more art time, less administrative time, I’m hoping to pace down a little bit. I would like to write every day, which I have not done over the last couple of years as my career has taken off. That means that all the administrative tasks also need to be done. All the things that are very important to selling a book, but are less satisfying to me as an artist.I’m going to try to return to — maybe we write a little less every day, but we still do it every day. Instead of taking these windows where it becomes this big marketing period, the focus will always be writing, even if that means smaller amounts every day. How do you pick between projects, or focus on what you want to do next? I think of it as when you’re bowling and you have the bumper guards on, that’s what my editor is for me. I’m like, Here are the ideas I’m having. Let me bounce this off you. Which one sounds like the right thing? And to be fair, I have a very privileged career, in that I have a long-standing relationship with my editor. She’s here for my career. It’s one of the ways that I always knew I wanted to be traditionally published, because I kind of need to be managed.I’m the kind of creative that has a lot of ideas and wants to cross media and wants to do something new and different every time. So it’s helpful to have someone say, What if we did this? What if we focused on this? Or This is the strongest thing you’ve pitched. So to some extent, I leave that up to someone else, which is a huge relief for me, because I wouldn’t say I have a very good sense for what the market is. Nobody does — everyone who says they understand the market is just selling you something. The two books I have coming out in 2025 are Gifted \u0026 Talented, which is kind of incisive about the tech industry, and then Girl Dinner, which is an interrogation of what feminism is, what contemporary feminism has become. They’re both vaguely political books. I wanted the book after that to be a little bit more of… It’s an LA Gothic, it’s more of a horror romance. I’m conscious of things that I write in similar periods having similar tones, thinking about the same things and working through them. In that sense, it was good to be like, Let’s take a little break. Let’s look at a different aspect of existence or whatever, and then we can yell about the tech industry some more after that. How do you handle distractions, or the urge to jump to another project?Sometimes if I’m feeling the need to work on something else, I will do [both] concurrently. I think in terms of artistic efficiency, there are some ideas that if you try to ignore them, they’ll just slow you down. This idea is what you want to be working on, what you need to be working on — that doesn’t necessarily mean it’s the only thing you’re working on, and that everything else goes away.Right now I’m working on two projects at the same time that are in different phases, so if I feel like one is not quite right for the day, I’ll do the other. But I am also pretty conscious at this point of what the best idea is. The one I should be working on is the one I’m thinking about the most, the one that I find the most interesting.There are times when I think to keep that feeling of play or to keep that hobbyist energy of I’m doing this because I love it, I will sometimes do something shorter. It’s never a loss. That story will become something someday. Part of it is knowing what kind of creative you are and gaming those things, I think. So I identify the priority project. Obviously having actual deadlines is helpful for this — things that actually have to get done. But also knowing that sometimes if your brain just isn’t in it, or the mood is just not right, then a quick break can be helpful. It’s like, Let’s just do this other thing. And maybe that feeling of satisfaction will keep you going on the other projects. How do you restart yourself when you get blocked or overwhelmed?Usually when I’m feeling blocked, when I can’t move forward in the project I’m working on, it’s because there’s a problem in the project I’m working on. Something I just wrote isn’t right. What it really is is kind of a feeling of I need to cut what I just wrote, but I feel like that will be such a loss that I don’t want to do it.Image: MacmillanBut every time without fail, if it’s a “can’t move forward” feeling, it’s because something went wrong behind me, and I need to own that and change it and fix it. Because trying to continue forward will actually be a more inefficient use of time. But if I’m feeling uninspired, which is a different feeling than blocked or overwhelmed, that’s when I would go to a smaller project, something that’s a little bit more bite-sized.I’m bipolar, so a lot of the ways that I game my creative problems are similar to the way that I deal with my mental health. When you’re really depressed, the feeling of satisfaction is even more important, but it’s harder to achieve. So my to-do list when I’m depressed is “take a shower” or “clean this one thing.” I give myself tasks that I know I can accomplish. And so in the creative realm, it’s like, Why don’t you just come up with an idea today? Just think of something today.That feeling of being able to cross something off helps you move forward. The feeling of I have accomplished something, that is progress or doing something that’s smaller, you can still feel like I flexed that creative muscle today. How do you know when it’s time to let a project go?That’s a good question. I’m trying to think of what projects I have let go. There’s not too many that I’ve left unfinished. Usually if I leave something unfinished, it’s because I came up with a better version of the idea, or I want to use the characters in a different way. I have an “unfinished” file, but I always have the sense that I’ll come back to it.I think what’s hard is the feeling like I’m letting this go forever, I’m just dropping it and it’s gone. I prefer the sense that it’s just waiting somewhere, and I can come back to it anytime. But usually it’s because I’m being more driven by the feeling that something else is a better idea, that something else is like, Oh, I really know how to do this, or I can really work on this thing that’s specifically interesting to me.Most of the things I don’t finish are short-story ideas where the tone is wrong. I tried to write this one story. It was meant to be sort of absurd. It was about a demon that was manifesting like Zillow, when they’re trying to buy your house. But for some reason, the tone just kept coming out so melancholy. The narrator was so sad. And I was like, This is not right. So I’ll come back to it when I figure out how to do it. I think my brain is just working on that in the background somewhere, and however long it takes, it’ll come back when the time is right.",
  "image": "https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/polygon-mosaic-6.png?quality=90\u0026strip=all\u0026crop=0%2C10.732984293194%2C100%2C78.534031413613\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003eFantasy writer Olivie Blake jokingly tells me that she doesn’t know how to write a book. With eight adult fantasy novels and two YA romantic comedies under her belt — including the \u003ca href=\"https://www.nytimes.com/books/best-sellers/2022/03/20/\"\u003ebestselling Atlas series\u003c/a\u003e — it’s a little hard to believe that. But Blake, a self-proclaimed “\u003ca href=\"https://www.kendrapatterson.com/blog/2020/12/4/what-is-discovery-writing-anyway\"\u003ediscovery writer\u003c/a\u003e,” insists. \u003c/p\u003e\u003cp\u003e“Every time, it gets done, and I tell myself I know how to do it,” she laughs. “But when I’m in the middle of the process, I’m like, \u003cem\u003eI don’t know what I’m doing, and we’re just working through it. \u003c/em\u003eI’ve come to this embrace of the unknown.”\u003c/p\u003e\u003cp\u003eBlake is a prolific writer for an author who claims not to know how to write. She originally self-published her adult novels under a pen name, the same one she used for her fanfiction. When \u003ca href=\"https://www.pastemagazine.com/books/olivie-blake/the-atlas-six-review-olivie-blake\"\u003e\u003cem\u003eThe Atlas Six \u003c/em\u003ebecame a viral sensation\u003c/a\u003e via TikTok and other social media, she got a chance to republish that novel in 2022 with Tor. The publishing house also republished her older adult fantasy, and picked up the rest of the Atlas series. At the same time, Blake published her YA debut, \u003ca href=\"https://www.penguinrandomhouse.com/books/703149/my-mechanical-romance-by-by-alexene-farol-follmuth/\"\u003e\u003cem\u003eMy Mechanical Romance\u003c/em\u003e\u003c/a\u003e, under the name Alexene Farol Follmuth. \u003c/p\u003e\u003cp\u003eIn 2024, she published the last book of the \u003ca href=\"https://us.macmillan.com/books/9781250855138/theatlascomplex/\"\u003eAtlas trilogy\u003c/a\u003e, along with \u003cem\u003e\u003ca href=\"https://us.macmillan.com/books/9781250884893/twelfthknight/\"\u003eTwelfth Knight\u003c/a\u003e\u003c/em\u003e, another YA rom-com. With two new stand-alone adult fantasy books coming out in 2025 and a whole lot more planned for down the line, Blake has learned a thing or two about balancing projects, focusing on goals, and figuring out what to work on next. Since the beginning of a new year is always a time for reflection about setting new goals and considering self-improvement, Polygon reached out to Blake to ask how she stays so productive, and discuss the perks of being “a New Year’s resolution person.”\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis interview has been edited for concision and clarity.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePolygon: Do you set professional or creative goals for yourself as the new year approaches, or do you have different strategies?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOlivie Blake: \u003c/strong\u003eI’m a New Year’s resolution person. I like to start the year assuming I will be my least lazy self, and then inevitably be disappointed. But I feel like in the margin for error, there is still some improvement. \u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0,0,100,100\" data-pswp-height=\"4032\" data-pswp-width=\"3024\" target=\"_blank\" rel=\"noreferrer\"\u003e\u003cimg alt=\"Author Olivie Blake standing on a roof smiling at the camera, with buildings and a beach behind her in the background\" data-chromatic=\"ignore\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) 50vw, 700px\" srcset=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=256 256w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=376 376w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=384 384w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=415 415w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=480 480w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=540 540w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=640 640w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=750 750w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=828 828w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1080 1080w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1200 1200w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1440 1440w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1920 1920w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2048 2048w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400 2400w\" src=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/Author-portrait.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ccite\u003ePhoto courtesy of Olivie Blake\u003c/cite\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e[For my creative goals], I’m trying to see myself as less of an expert and more of […] I keep trying to put myself back in the feeling of being a hobbyist. I had the most fun when I was a fanfiction writer and there were no expectations. I wasn’t worried about building an audience. I just [thought], \u003cem\u003eCan I do this?\u003c/em\u003e Or \u003cem\u003eHow good would it feel if I got this exactly as I’ve imagined it?\u003c/em\u003e And it never happens that way. But I think the feeling of approaching something like it’s the first time is falling in love all over again.\u003c/p\u003e\u003cp\u003eAs far as professional goals, artistic careers are really hard to have a sense of measurement for. It’s hard to see that you’ve come a distance or moved up in any way. I’m at a point where I’ve been pretty prolific and some of it is a mix of new [and old self-published titles]. We’re at the point where I don’t have any more backlist titles and everything is new. \u003c/p\u003e\u003cp\u003eBut I also would like to kind of slow things down so that I’m not so fatigued by the promotional and marketing and all the industry aspects. And so to give myself more, basically more art time, less administrative time, I’m hoping to pace down a little bit. I would like to write every day, which I have not done over the last couple of years as my career has taken off. That means that all the administrative tasks also need to be done. All the things that are very important to selling a book, but are less satisfying to me as an artist.\u003c/p\u003e\u003cp\u003eI’m going to try to return to — maybe we write a little less every day, but we still do it every day. Instead of taking these windows where it becomes this big marketing period, the focus will always be writing, even if that means smaller amounts every day. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow do you pick between projects, or focus on what you want to do next? \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eI think of it as when you’re bowling and you have the bumper guards on, that’s what my editor is for me. I’m like, \u003cem\u003eHere are the ideas I’m having. Let me bounce this off you. Which one sounds like the right thing?\u003c/em\u003e And to be fair, I have a very privileged career, in that I have a long-standing relationship with my editor. She’s here for my career. It’s one of the ways that I always knew I wanted to be traditionally published, because I kind of need to be managed.\u003c/p\u003e\u003cp\u003eI’m the kind of creative that has a lot of ideas and wants to cross media and wants to do something new and different every time. So it’s helpful to have someone say, \u003cem\u003eWhat if we did this? What if we focused on this? \u003c/em\u003eOr \u003cem\u003eThis is the strongest thing you’ve pitched.\u003c/em\u003e So to some extent, I leave that up to someone else, which is a huge relief for me, because I wouldn’t say I have a very good sense for what the market is. Nobody does — everyone who says they understand the market is just selling you something. \u003c/p\u003e\u003cp\u003eThe two books I have coming out in 2025 are \u003cem\u003eGifted \u0026amp; Talented\u003c/em\u003e, which is kind of incisive about the tech industry, and then \u003cem\u003eGirl Dinner\u003c/em\u003e, which is an interrogation of what feminism is, what contemporary feminism has become. They’re both vaguely political books. I wanted the book after that to be a little bit more of… It’s an LA Gothic, it’s more of a horror romance. I’m conscious of things that I write in similar periods having similar tones, thinking about the same things and working through them. In that sense, it was good to be like, \u003cem\u003eLet’s take a little break. Let’s look at a different aspect of existence or whatever, and then we can yell about the tech industry some more after that. \u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow do you handle distractions, or the urge to jump to another project?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSometimes if I’m feeling the need to work on something else, I will do [both] concurrently. I think in terms of artistic efficiency, there are some ideas that if you try to ignore them, they’ll just slow you down. This idea is what you want to be working on, what you need to be working on — that doesn’t necessarily mean it’s the \u003cem\u003eonly\u003c/em\u003e thing you’re working on, and that everything else goes away.\u003c/p\u003e\u003cp\u003eRight now I’m working on two projects at the same time that are in different phases, so if I feel like one is not quite right for the day, I’ll do the other. But I am also pretty conscious at this point of what the best idea is. The one I should be working on is the one I’m thinking about the most, the one that I find the most interesting.\u003c/p\u003e\u003cp\u003eThere are times when I think to keep that feeling of play or to keep that hobbyist energy of\u003cem\u003e I’m doing this because I love it\u003c/em\u003e, I will sometimes do something shorter. It’s never a loss. That story will become something someday. \u003c/p\u003e\u003cp\u003ePart of it is knowing what kind of creative you are and gaming those things, I think. So I identify the priority project. Obviously having actual deadlines is helpful for this — things that actually have to get done. But also knowing that sometimes if your brain just isn’t in it, or the mood is just not right, then a quick break can be helpful. It’s like, \u003cem\u003eLet’s just do this other thing.\u003c/em\u003e And maybe that feeling of satisfaction will keep you going on the other projects. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow do you restart yourself when you get blocked or overwhelmed?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eUsually when I’m feeling blocked, when I can’t move forward in the project I’m working on, it’s because there’s a problem in the project I’m working on. Something I just wrote isn’t right. What it really is is kind of a feeling of \u003cem\u003eI need to cut what I just wrote, but I feel like that will be such a loss that I don’t want to do it\u003c/em\u003e.\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0,0,100,100\" data-pswp-height=\"3396\" data-pswp-width=\"2194\" target=\"_blank\" rel=\"noreferrer\"\u003e\u003cimg alt=\"A book cover featuring three young adults standing behind and empty chair, their images distorted by a swirl. The title is Gifted \u0026amp; Talented.\" data-chromatic=\"ignore\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) 50vw, 700px\" srcset=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=256 256w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=376 376w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=384 384w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=415 415w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=480 480w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=540 540w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=640 640w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=750 750w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=828 828w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1080 1080w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1200 1200w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1440 1440w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1920 1920w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2048 2048w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400 2400w\" src=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/GT_0529_comp-w-tagline-1.jpeg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ccite\u003eImage: Macmillan\u003c/cite\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eBut every time without fail, if it’s a “can’t move forward” feeling, it’s because something went wrong behind me, and I need to own that and change it and fix it. Because trying to continue forward will actually be a more inefficient use of time. But if I’m feeling uninspired, which is a different feeling than blocked or overwhelmed, that’s when I would go to a smaller project, something that’s a little bit more bite-sized.\u003c/p\u003e\u003cp\u003eI’m bipolar, so a lot of the ways that I game my creative problems are similar to the way that I deal with my mental health. When you’re really depressed, the feeling of satisfaction is even more important, but it’s harder to achieve. So my to-do list when I’m depressed is “take a shower” or “clean this one thing.” I give myself tasks that I know I can accomplish. And so in the creative realm, it’s like, \u003cem\u003eWhy don’t you just come up with an idea today? Just think of something today\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eThat feeling of being able to cross something off helps you move forward. The feeling of \u003cem\u003eI have accomplished something, that is progress\u003c/em\u003e or doing something that’s smaller, you can still feel like \u003cem\u003eI flexed that creative muscle today.\u003c/em\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow do you know when it’s time to let a project go?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThat’s a good question. I’m trying to think of what projects I have let go. There’s not too many that I’ve left unfinished. Usually if I leave something unfinished, it’s because I came up with a better version of the idea, or I want to use the characters in a different way. I have an “unfinished” file, but I always have the sense that I’ll come back to it.\u003c/p\u003e\u003cp\u003eI think what’s hard is the feeling like I’m letting this go forever, I’m just dropping it and it’s gone. I prefer the sense that it’s just waiting somewhere, and I can come back to it anytime. But usually it’s because I’m being more driven by the feeling that something else is a better idea, that something else is like, \u003cem\u003eOh, I really know how to do this\u003c/em\u003e, or \u003cem\u003eI can really work on this thing that’s specifically interesting to me.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eMost of the things I don’t finish are short-story ideas where the tone is wrong. I tried to write this one story. It was meant to be sort of absurd. It was about a demon that was manifesting like Zillow, when they’re trying to buy your house. But for some reason, the tone just kept coming out so melancholy. The narrator was so sad. And I was like, \u003cem\u003eThis is not right.\u003c/em\u003e So I’ll come back to it when I figure out how to do it. I think my brain is just working on that in the background somewhere, and however long it takes, it’ll come back when the time is right. \u003c/p\u003e\u003cdiv data-product-filter=\"\"\u003e\u003cp\u003e\u003ca href=\"https://goto.target.com/c/482924/81938/2092?u=https%3A%2F%2Fwww.target.com%2Fp%2Fgifted-talented-by-olivie-blake-hardcover%2F-%2FA-92204319%23lnk%3Dsametab\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003e\u003cimg alt=\"\" data-chromatic=\"ignore\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"(max-width: 768px) 100vw, 300px\" srcset=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=376 376w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=384 384w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=415 415w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=480 480w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=540 540w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=640 640w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=750 750w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=828 828w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=1080 1080w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=1200 1200w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=1440 1440w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=1920 1920w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=2048 2048w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=2400 2400w\" src=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=16.660516605166%2C0%2C66.678966789668%2C100\u0026amp;w=2400\"/\u003e\u003c/a\u003e\u003ca href=\"https://goto.target.com/c/482924/81938/2092?u=https%3A%2F%2Fwww.target.com%2Fp%2Fgifted-talented-by-olivie-blake-hardcover%2F-%2FA-92204319%23lnk%3Dsametab\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003e\u003cimg alt=\"\" data-chromatic=\"ignore\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"(max-width: 768px) 100vw, 600px\" srcset=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=376 376w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=384 384w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=415 415w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=480 480w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=540 540w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=640 640w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=750 750w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=828 828w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=1080 1080w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=1200 1200w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=1440 1440w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=1920 1920w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=2048 2048w, https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=2400 2400w\" src=\"https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/9781250883407-copy.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0.0092233905183576%2C100%2C99.981553218963\u0026amp;w=2400\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-31T16:00:00Z",
  "modifiedTime": "2024-12-31T16:00:00Z"
}
