{
  "id": "f8f0fc2f-dcc8-488e-988d-a7304346868a",
  "title": "Wildgate is a spacey crew-based shooter from the same ex-Blizzard folks working on Sunderfolk",
  "link": "https://www.rockpapershotgun.com/wildgate-is-a-spacey-crew-based-shooter-from-the-same-ex-blizzard-folks-working-on-sunderfolk",
  "description": "Back in 2020, co-founder and former CEO of Blizzard Mike Morhaime formed Dreamhaven, essentially Blizzard 2, albeit a bit more explicit in the fact that it has different studios working under it. One of said studios, Secret Door, is currently working on co-op strategy game Sunderfolk, and today as part of a showcase presented by The Game Awards, the other studio Moonshot Games revealed its first title: Wildgate, a sci-fi shooter that sees you piloting ships around space looking for loot as you face off against other players. Read more",
  "author": "Oisin Kuhnke",
  "published": "Tue, 25 Mar 2025 21:39:12 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Shooter: First Person",
    "RPG",
    "Strategy: Turn-Based Strategy",
    "Sunderfolk",
    "Blizzard",
    "Action Adventure",
    "PC",
    "PS5",
    "Dreamhaven",
    "Multiplayer Cooperative",
    "Wildgate",
    "Xbox Series X/S",
    "Science Fiction",
    "Party",
    "Nintendo Switch"
  ],
  "byline": "Oisin Kuhnke",
  "length": 2023,
  "excerpt": "Dreamhaven's next game is Wildgate, a sci-fi title that mixes first-person shooting, spaceship battles, and loot hunting.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/ac8d77af111b2bfa658c296cdd501256/icon/apple-touch-icon.png",
  "text": "Image credit: Moonshot Games Back in 2020, co-founder and former CEO of Blizzard Mike Morhaime formed Dreamhaven, essentially Blizzard 2, albeit a bit more explicit in the fact that it has different studios working under it. One of said studios, Secret Door, is currently working on co-op strategy game Sunderfolk, and today as part of a showcase presented by The Game Awards, the other studio Moonshot Games revealed its first title: Wildgate, a sci-fi shooter that sees you piloting ships around space looking for loot as you face off against other players. The way it works is that in each match, you and crews of other players are after an artifact, each of you with your own ship you use to get to your destination. Sometimes you'll have to use said ship to fight against other players, though while the reveal trailer offered a look at space combat, it wasn't too detailed. It looks like all the ships have shields and turrets to shoot at each other with, and you can even disembark your own ship to go and board an enemies' one. Looks pretty neat honestly! Not sure how I feel about it being match based, but hey, can't win 'em all. Wildgate | Reveal Trailer Watch on YouTube Your crew is made up of prospectors, like that one guy voiced by Kelsey Grammer in Toy Story 2, all of which have different abilities and tools, typical hero shooter kind of thing. It looks like there's a few different gun options, and even tools to put out fires on your ship. Again, it doesn't look like there's necessarily anything massively unique on the shooting front, there's only so many different ways you can do a shooter, but it looks fun enough, and I like the character designs. One prospector looks like some kind of axolotl thing in a fishbowl with robot limbs? That'll probably be my main day one. Wildgate doesn't currently have a release date other than sometime this year, i.e. 2025, but you can sign-up to playtest it if the trailer piques your interest.",
  "image": "https://assetsio.gnwcdn.com/wildgate.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/wildgate.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/wildgate.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/wildgate.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/wildgate.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A group of four sci-fi characters, three of them anthropomorphic aliens, one a robot, are charging forward with guns in hand on some kind of alien, rocky place in Wildgate.\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eMoonshot Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\n\u003ca href=\"https://www.rockpapershotgun.com/blizzard-co-founder-opens-new-studios-with-loads-of-ex-blizzard-folks\"\u003eBack in 2020\u003c/a\u003e, co-founder and former CEO of \u003ca href=\"https://www.rockpapershotgun.com/companies/blizzard\"\u003eBlizzard\u003c/a\u003e Mike Morhaime formed Dreamhaven, essentially Blizzard 2, albeit a bit more explicit in the fact that it has different studios working under it. One of said studios, Secret Door, is currently working on co-op strategy game \u003ca href=\"https://www.rockpapershotgun.com/games/sunderfolk\"\u003eSunderfolk\u003c/a\u003e, and today as part of a \u003ca href=\"https://www.youtube.com/watch?v=0Uwjr0raU7k\u0026amp;ab_channel=thegameawards\"\u003eshowcase\u003c/a\u003e presented by The Game Awards, the other studio Moonshot Games revealed its first title: Wildgate, a sci-fi shooter that sees you piloting ships around space looking for loot as you face off against other players.\n\u003c/p\u003e\n\n\u003cp\u003e\nThe way it works is that in each match, you and crews of other players are after an artifact, each of you with your own ship you use to get to your destination. Sometimes you\u0026#39;ll have to use said ship to fight against other players, though while the reveal trailer offered a look at space combat, it wasn\u0026#39;t too detailed. It looks like all the ships have shields and turrets to shoot at each other with, and you can even disembark your own ship to go and board an enemies\u0026#39; one. Looks pretty neat honestly! Not sure how I feel about it being match based, but hey, can\u0026#39;t win \u0026#39;em all.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Wildgate | Reveal Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/f2jvZzieaBo?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/f2jvZzieaBo/hqdefault.jpg\"/\u003e\u003cspan\u003eWildgate | Reveal Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/f2jvZzieaBo?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/f2jvZzieaBo?autoplay=1\" title=\"Wildgate | Reveal Trailer\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=f2jvZzieaBo\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\nYour crew is made up of prospectors, like that one guy voiced by Kelsey Grammer in Toy Story 2, all of which have different abilities and tools, typical hero shooter kind of thing. It looks like there\u0026#39;s a few different gun options, and even tools to put out fires on your ship. \n\u003c/p\u003e\n\u003cp\u003e\nAgain, it doesn\u0026#39;t look like there\u0026#39;s necessarily anything massively unique on the shooting front, there\u0026#39;s only so many different ways you can do a shooter, but it looks fun enough, and I like the character designs. One prospector looks like some kind of axolotl thing in a fishbowl with robot limbs? That\u0026#39;ll probably be my main day one.\n\u003c/p\u003e\n\u003cp\u003e\nWildgate doesn\u0026#39;t currently have a release date other than sometime this year, i.e. 2025, but you can \u003ca href=\"https://playtest.playwildgate.com/signup/communitypreview/account\"\u003esign-up to playtest it\u003c/a\u003e if the trailer piques your interest.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-25T21:39:12.35107Z",
  "modifiedTime": null
}
