{
  "id": "fd072697-85f0-44b3-8ca9-a65c3e6c3ed6",
  "title": "Netflix games boss says consoles not the future as streamer looks to phone-controlled party games",
  "link": "https://www.eurogamer.net/netflix-games-boss-says-consoles-not-the-future-as-streamer-looks-to-phone-controlled-party-games",
  "description": "After Netflix's tentative first few years in games - which has seen it grow its mobile library, acquire studios, and dabble in triple-A development before dramatically changing course - the streamer's new gaming boss, Alain Tascan, has laid out the company's latest vision. This, he says, is less about the console model and more about phone-controlled party games. Read more",
  "author": "Matt Wales",
  "published": "Fri, 28 Mar 2025 23:26:55 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PS5",
    "Xbox Series X/S",
    "PC",
    "iOS",
    "Nintendo Switch",
    "Xbox One",
    "Android",
    "PS4"
  ],
  "byline": "Matt Wales",
  "length": 5096,
  "excerpt": "After Netflix's tentative first few years in games - which has seen it grow its mobile library, acquire studios, and da…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/bd79e7beec0d89693e6730fe524ee2e1/icon/apple-touch-icon-152x152.png",
  "text": "\"Are eight year-olds and ten year-olds dreaming of owning a PlayStation 6?\" Image credit: Netflix After Netflix's tentative first few years in games - which has seen it grow its mobile library, acquire studios, and dabble in triple-A development before dramatically changing course - the streamer's new gaming boss, Alain Tascan, has laid out the company's latest vision. This, he says, is less about the console model and more about phone-controlled party games. Tascan - a 30-year industry veteran who most recently served as executive vice president of game development at Epic Games - joined Netflix last July, taking over the role from Mike Verdu, who briefly transitioned to vice president of generative AI at Netflix before departing the company. And with nine months at the streaming service now under his belt, Tascan recently outlined his vision for Netflix gaming at this year's GDC. As reported by The Game Business , that vision takes a four-pronged approach, focusing on narrative and transmedia projects, on big mainstream IP, on being a trusted destination for families, and on party games played on TVs using mobile phones as a controller. The latter, as Tascan sees it, is Netflix's attempt at Wii-style industry \"disruption\". \"I love the Wii,\" he told The Game Business. \"I am very vigorous about lowering friction and eliminating it if we can. I see that the subscription is friction as well. Maybe good friction because it makes business sense... But the other friction is having enough controllers for family. Having a piece of hardware that might be expensive... Waiting for a game to download... I am [looking at] all the obstacles, and asking if we can reduce them as much as possible.\" As such, it's perhaps not surprising to hear Tascan's dismissal of the classic console model. \"[When it comes to] console, we started to look at the future where the platform is agnostic,\" he said. \"Look at the younger generation. Are eight year-olds and 10 year-olds dreaming of owning a PlayStation 6? I am not sure. They are wanting to interact with any digital screen, whatever it is, wherever it is, even in the car. With console you're thinking about high definition, you're thinking about the controller... If we look at this older model, I think it will restrain us.\" Tascan also seems unconvinced classic console-style games have much value for Netflix - which might go some way to explaining why the streaming service recently culled staff at respected Oxenfree developer Night School Studio, and why it closed its high-profile triple-A studio before it could release a game last year. \"Does it really need to be these super complicated RPG-style games?,\" he posited to The Game Business. \"There is a place for them, for sure. But this for me this is what's interesting... What do we give [Netflix subscribers], and in what way, so they can enjoy and engage with [games] over and over?\" The answer to that question is, apparently, party games. \"I believe we can give instant fun, using the phone controller as a very innovative controller,\" Tascan explained. \"On every phone you have a gyroscope, you have a microphone, you have a speaker, you have a touchscreen... if you give that to creative people, what do they do? Whether you're alone, or with two people, or 20 people, why not? Can we do something really engaging?\" \"We need to push the vision more than anything else and try to disrupt,\" he continued, \"because I believe the threshold you need to hit for people to be entertained by games is very high... In terms of the disruption we can bring, distribution is one and the other is the phone as a controller. The communication between the phone and the TV. The IP. The transmedia aspect... I don't know exactly which one will work, but we have a few cards to play that are very unique.\" \"We have some very special competitive advantages,\" Tascan added. \"We've just scratched the surface. For instance, for Squid Game, you watch the show and you unlock some currency in the game. But that's just the beginning. Imagine places where you watch something and then something special appears in the game, and maybe in the future you do something in the game and then you watch something – because of AI or what have you – and something happens there. We have a lot of things that we can imagine and reimagine.\" No matter how Tascan's vision of mobile-driven party games, unlockable currency, and \"AI or what have you\" pans out, he insists Netflix is in the gaming business for the long haul. \"If you look at our two co-CEOs... and look at where Netflix was 10 years ago in terms of their core business... they know the path of being stubborn, hard-working, innovating, having a vision and going after it... I believe them when they told me that gaming was important, because if [Netflix] wants to entertain the world then there's no-way around it, we need to be in games. When I look at these two leaders in particular... I believe in their full commitment.\"",
  "image": "https://assetsio.gnwcdn.com/netflix-games.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003e\u0026#34;Are eight year-olds and ten year-olds dreaming of owning a PlayStation 6?\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/netflix-games.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/netflix-games.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/netflix-games.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/netflix-games.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A promotional image for Netflix showing the streaming service displayed on a phone, tablet, and TV screen.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eNetflix\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nAfter Netflix\u0026#39;s tentative first few years in games - which has seen it grow its mobile library, acquire studios, and dabble in triple-A development before dramatically changing course - the streamer\u0026#39;s new gaming boss, Alain Tascan, has laid out the company\u0026#39;s latest vision. This, he says, is less about the console model and more about phone-controlled party games.\n\u003c/p\u003e\n\u003cp\u003e\nTascan - a 30-year industry veteran who most recently served as executive vice president of game development at Epic Games - joined Netflix last July, taking over the role from Mike Verdu, who \u003ca href=\"https://www.gamesindustry.biz/netflixs-mike-verdu-reveals-new-role-as-vp-of-genai-for-games\"\u003ebriefly transitioned to vice president of generative AI at Netflix\u003c/a\u003e before \u003ca href=\"https://www.eurogamer.net/former-netflix-gaming-boss-departs-following-move-to-ai-role\"\u003edeparting the company\u003c/a\u003e. And with nine months at the streaming service now under his belt, Tascan recently outlined his vision for Netflix gaming at this year\u0026#39;s GDC.\n\u003c/p\u003e\n\u003cp\u003e\nAs \u003ca href=\"https://www.thegamebusiness.com/p/netflix-games-strategy-evokes-the\"\u003ereported by The Game Business\n\u003c/a\u003e, that vision takes a four-pronged approach, focusing on narrative and transmedia projects, on big mainstream IP, on being a trusted destination for families, and on party games played on TVs using mobile phones as a controller.\n\u003c/p\u003e\n\u003cp\u003e\nThe latter, as Tascan sees it, is Netflix\u0026#39;s attempt at Wii-style industry \u0026#34;disruption\u0026#34;. \u0026#34;I love the Wii,\u0026#34; he told The Game Business. \u0026#34;I am very vigorous about lowering friction and eliminating it if we can. I see that the subscription is friction as well. Maybe good friction because it makes business sense... But the other friction is having enough controllers for family. Having a piece of hardware that might be expensive... Waiting for a game to download... I am [looking at] all the obstacles, and asking if we can reduce them as much as possible.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nAs such, it\u0026#39;s perhaps not surprising to hear Tascan\u0026#39;s dismissal of the classic console model. \u0026#34;[When it comes to] console, we started to look at the future where the platform is agnostic,\u0026#34; he said. \u0026#34;Look at the younger generation. Are eight year-olds and 10 year-olds dreaming of owning a PlayStation 6? I am not sure. They are wanting to interact with any digital screen, whatever it is, wherever it is, even in the car. With console you\u0026#39;re thinking about high definition, you\u0026#39;re thinking about the controller... If we look at this older model, I think it will restrain us.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nTascan also seems unconvinced classic console-style games have much value for Netflix - which might go some way to explaining why the streaming service \u003ca href=\"https://www.eurogamer.net/netflix-culls-staff-at-oxenfree-developer-night-school-studio\"\u003erecently culled staff at respected Oxenfree developer Night School Studio\u003c/a\u003e, and why it \u003ca href=\"https://www.eurogamer.net/netflix-closes-aaa-internal-studio-led-by-halo-creative-head-joseph-staten\"\u003eclosed its high-profile triple-A studio\u003c/a\u003e before it could release a game last year. \u0026#34;Does it really need to be these super complicated RPG-style games?,\u0026#34; he posited to The Game Business. \u0026#34;There is a place for them, for sure. But this for me this is what\u0026#39;s interesting... What do we give [Netflix subscribers], and in what way, so they can enjoy and engage with [games] over and over?\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nThe answer to that question is, apparently, party games. \u0026#34;I believe we can give instant fun, using the phone controller as a very innovative controller,\u0026#34; Tascan explained. \u0026#34;On every phone you have a gyroscope, you have a microphone, you have a speaker, you have a touchscreen... if you give that to creative people, what do they do? Whether you\u0026#39;re alone, or with two people, or 20 people, why not? Can we do something really engaging?\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;We need to push the vision more than anything else and try to disrupt,\u0026#34; he continued, \u0026#34;because I believe the threshold you need to hit for people to be entertained by games is very high... In terms of the disruption we can bring, distribution is one and the other is the phone as a controller. The communication between the phone and the TV. The IP. The transmedia aspect... I don\u0026#39;t know exactly which one will work, but we have a few cards to play that are very unique.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;We have some very special competitive advantages,\u0026#34; Tascan added. \u0026#34;We\u0026#39;ve just scratched the surface. For instance, for Squid Game, you watch the show and you unlock some currency in the game. But that\u0026#39;s just the beginning. Imagine places where you watch something and then something special appears in the game, and maybe in the future you do something in the game and then you watch something – because of AI or what have you – and something happens there. We have a lot of things that we can imagine and reimagine.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nNo matter how Tascan\u0026#39;s vision of mobile-driven party games, unlockable currency, and \u0026#34;AI or what have you\u0026#34; pans out, he insists Netflix is in the gaming business for the long haul. \u0026#34;If you look at our two co-CEOs... and look at where Netflix was 10 years ago in terms of their core business... they know the path of being stubborn, hard-working, innovating, having a vision and going after it... I believe them when they told me that gaming was important, because if [Netflix] wants to entertain the world then there\u0026#39;s no-way around it, we need to be in games. When I look at these two leaders in particular... I believe in their full commitment.\u0026#34;\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-28T23:26:55.387028Z",
  "modifiedTime": null
}
