{
  "id": "fe079fe1-3bd8-4fa4-af4a-a83010b78001",
  "title": "Celebrate Coronation Week with Kingdom Two Crowns: Call of Olympus – Out Now",
  "link": "https://news.xbox.com/en-us/2024/10/08/kingdom-two-crowns-call-of-olympus-out-now/",
  "description": "The post Celebrate Coronation Week with Kingdom Two Crowns: Call of Olympus – Out Now appeared first on Xbox Wire.",
  "author": "johns",
  "published": "Tue, 08 Oct 2024 20:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "ID@Xbox",
    "Kingdom Two Crowns",
    "kingdom two crowns call of olympus",
    "kingdom two crowns coronation week",
    "Raw Fury"
  ],
  "byline": "johns",
  "length": 6067,
  "excerpt": "A post celebrating “Coronation Week” with all Kingdom titles discounted aligned with the release of the new Call of Olympus DLC out today.",
  "siteName": "Xbox Wire",
  "favicon": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "“A long time ago, Mount Olympus stood as a bastion of hope and power. Now, it threatens to crumble against the forces of nature. But we pray for a hero of a royal bloodline to rise from the ashes, and save us all…” Call of Olympus just released and it’s the latest and biggest DLC installment for the beloved co-op game Kingdom Two Crowns, ever. The Kingdom franchise is an acclaimed and awarded roguelite side-scrolling pixel art strategy series where the first game launched in October 2015. We are running a ninth anniversary celebration that we call the “Coronation Week” with a long series of activities, including the launch of Kingdom Two Crowns: Call of Olympus and a free Kingdom Two Crowns 2.0 update! The core experience of Kingdom evolved from the original creator wanting to learn how to animate games. This visual-first approach was quickly complemented with strategic gameplay features with base-building elements. The sequel, Kingdom: New Lands, introduced the island mechanic of exploring and clearing increasing levels of challenges. This is also aided by unlockable perks to amplify your strategic options. The third game in the series, Kingdom Two Crowns, is what most players will associate with Kingdom, and it introduced the foundation we are proudly expanding upon: Explore – Build – Defend – Conquer. By adding a campaign mode with clearable islands that unlock your path forward, and by expanding the strategic options for players with new mounts, units, and an incredible soundtrack – the highly atmospheric experience players have come to love was born. Shortly explained, Kingdom Two Crowns is a beautiful atmospheric adventure that plays perfectly in both solo and co-op mode. The game is set on different islands inspired by different moments in history and as a Monarch, you rule over a Kingdom that you must build from the ground up. As you progress you will encounter a sinister force of nature – the Greed – assaulting your base and trying to steal your crown. It’s a cyclic event, where the Greed comes in waves at night. If you are not into historic-inspired settings, Kingdom Eighties might be for you! Set in the 80s, this game introduces a narrative campaign mode with rad aesthetics and a host of homages and easter eggs to themes from the iconic era. In this game you play as The Leader, a young camp counselor who has just discovered that strange creatures are attacking Camp Kingdom at night. We have several ways for you to quickly get into whatever Kingdom game picks your fancy: Kingdom Two Crowns: Call of Olympus: The latest major expansion launched for Kingdom Two Crowns Kingdom New Lands (90%), Kingdom Two Crowns (75%), and Kingdom Eighties (35%) are now on sale in the Best Rated Sale Kingdom Treasury Collection: Includes the games Kingdom: New Lands, Kingdom Two Crowns and the Kingdom Two Crowns: Norse Lands DLC – now at a 60% discount in Deals with Game Pass Norse Lands Edition: Includes Kingdom Two Crowns and the Norse Lands DLC – now at a 65% discount in Deals with Game Pass Heritage Bundle: Includes both Kingdom Two Crowns and Kingdom Eighties – now on sale at a 60% discount Kingdom Imperial Collection: Includes Kingdom: New Lands, Kingdom Two Crowns and Kingdom Eighties – now on sale at a 65% discount in Deals with Game Pass! Do you want to join the celebrations? Get in on the fun and adventure today! “Sail forth and explore other lands Restore the gods and fulfill their demands” – Oracle In faraway lands, Mount Olympus stands tall among the islands, casting an eerie shadow of unease. A sinister force has seized the divine realm and as a Monarch, you are setting out on a journey to stop it from consuming the world. Mediterranean warmth touches your skin as you slowly ride through dark woods and along beaches with glittering turquoise waters. Your quest is clear and the gods’ presence is palpable, but will they aid you against the Greed attacking at night? Kingdom Two Crowns: Call of Olympus is a major expansion for Kingdom Two Crowns. Set out and build your Kingdom, alone or in co-op with a friend, in a completely new setting featuring legends and mythos inspired by ancient Greece. A Quest to Free Mount Olympus – An Epic New World: Call of Olympus features a reworked map with an epic conclusion at Mount Olympus, and you choose how to get there! – Temple and Quest Islands: These new islands present unique challenges, hidden treasures and powerful artifact rewards – prove your worth to Artemis, Athena, Hephaestus and Hermes to open the path to Mount Olympus. – Mythological mounts: Discover and unlock powerful new mounts, like the fierce three-headed Cerberus, the terrifying fire-breathing Chimera, the majestic winged Pegasus, or the trusty Donkey… and many more! Fight Greed of Epic Scales – Face Your Fears: Muster steadfast defences to protect your crown, the Greed threat is more challenging than ever before, with multi-phased boss battles against the sinister Serpent. – Raise Your Banner: Shift the momentum and lead from the front. Bring the fight to the Greed with new siege mechanics, where the Hoplites will join you in Phalanx formation. – Assemble Your Fleet: Fight on land and at sea – build a fleet with devastating ship-mounted ballistas to join your battle. Once victorious, use your armada to ferry your army across the seas and combat the growing threat of Greed. Discover Godly Powers and Abilities – Powerful Artifacts: Unlock four unique artifacts bestowed by the gods. Whether you choose a bow with a powerful directed attack, or a hammer that boosts your troops’ prowess, these items grant you new offensive and defensive abilities against the Greed. – Guided by the Oracle: Never stray from the task at hand. At your request,the Oracle will provide you with wisdom and directions for the next step of your Odyssey! – Set the Greed Ablaze: Wield powerful fire technology granted by the new hermit. It's as if it was gifted by Prometheus himself!",
  "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/xbox_hero_image-02cf32e073917bdca513.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003e“A long time ago, Mount Olympus stood as a bastion of hope and power. Now, it threatens to crumble against the forces of nature. But we pray for a hero of a royal bloodline to rise from the ashes, and save us all…”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/kingdom-two-crowns-call-of-olympus/9MXPPMG6F1V8?msockid=2c264e58dbd9616406135b4ada6360d7\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCall of Olympus\u003c/a\u003e\u003c/em\u003e just released and it’s the latest and biggest DLC installment for the beloved co-op game \u003cem\u003eKingdom Two Crowns\u003c/em\u003e, ever. The \u003cem\u003eKingdom\u003c/em\u003e franchise is an acclaimed and awarded roguelite side-scrolling pixel art strategy series where the first game launched in October 2015. We are running a ninth anniversary celebration that we call the “Coronation Week” with a long series of activities, including the launch of \u003cem\u003eKingdom Two Crowns: Call of Olympus\u003c/em\u003e and a free \u003cem\u003eKingdom Two Crowns\u003c/em\u003e 2.0 update!\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/01_KNL_1920x1080_xbox-f9f422783cd3a281a54e.jpg\" alt=\"K2Crowns screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/01_KNL_1920x1080_xbox-f9f422783cd3a281a54e.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/01_KNL_1920x1080_xbox-f9f422783cd3a281a54e-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/01_KNL_1920x1080_xbox-f9f422783cd3a281a54e-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/01_KNL_1920x1080_xbox-f9f422783cd3a281a54e-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe core experience of \u003cem\u003eKingdom\u003c/em\u003e evolved from the original creator wanting to learn how to animate games. This visual-first approach was quickly complemented with strategic gameplay features with base-building elements. The sequel, \u003cem\u003eKingdom: New Lands\u003c/em\u003e, introduced the island mechanic of exploring and clearing increasing levels of challenges. This is also aided by unlockable perks to amplify your strategic options.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/02_KTCNL_1920x1080_xbox-ed137572e35c0a0ef359.jpg\" alt=\"K2Crowns screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/02_KTCNL_1920x1080_xbox-ed137572e35c0a0ef359.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/02_KTCNL_1920x1080_xbox-ed137572e35c0a0ef359-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/02_KTCNL_1920x1080_xbox-ed137572e35c0a0ef359-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/02_KTCNL_1920x1080_xbox-ed137572e35c0a0ef359-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe third game in the series, \u003cem\u003eKingdom Two Crowns\u003c/em\u003e, is what most players will associate with \u003cem\u003eKingdom\u003c/em\u003e, and it introduced the foundation we are proudly expanding upon: Explore – Build – Defend – Conquer.\u003c/p\u003e\n\n\n\n\u003cp\u003eBy adding a campaign mode with clearable islands that unlock your path forward, and by expanding the strategic options for players with new mounts, units, and an incredible soundtrack – the highly atmospheric experience players have come to love was born.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/03_KTCCOO_1920x1080_xbox-f8c2f6a8560481bf5f42.jpg\" alt=\"K2Crowns screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/03_KTCCOO_1920x1080_xbox-f8c2f6a8560481bf5f42.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/03_KTCCOO_1920x1080_xbox-f8c2f6a8560481bf5f42-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/03_KTCCOO_1920x1080_xbox-f8c2f6a8560481bf5f42-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/03_KTCCOO_1920x1080_xbox-f8c2f6a8560481bf5f42-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eShortly explained, \u003cem\u003eKingdom Two Crowns\u003c/em\u003e is a beautiful atmospheric adventure that plays perfectly in both solo and co-op mode. The game is set on different islands inspired by different moments in history and as a Monarch, you rule over a Kingdom that you must build from the ground up. As you progress you will encounter a sinister force of nature – the Greed – assaulting your base and trying to steal your crown. It’s a cyclic event, where the Greed comes in waves at night.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/04_k2c_coop_1920x1080_xbox-f03b5a71ddf05fa0579d.jpg\" alt=\"K2Crowns screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/04_k2c_coop_1920x1080_xbox-f03b5a71ddf05fa0579d.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/04_k2c_coop_1920x1080_xbox-f03b5a71ddf05fa0579d-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/04_k2c_coop_1920x1080_xbox-f03b5a71ddf05fa0579d-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/04_k2c_coop_1920x1080_xbox-f03b5a71ddf05fa0579d-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIf you are not into historic-inspired settings, \u003cem\u003eKingdom Eighties\u003c/em\u003e might be for you! Set in the 80s, this game introduces a narrative campaign mode with rad aesthetics and a host of homages and easter eggs to themes from the iconic era. In this game you play as The Leader, a young camp counselor who has just discovered that strange creatures are attacking Camp Kingdom at night.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/05_K801_1920x1080_xbox-a2be9f50e91cd08b3eb1.jpg\" alt=\"K2Crowns screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/05_K801_1920x1080_xbox-a2be9f50e91cd08b3eb1.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/05_K801_1920x1080_xbox-a2be9f50e91cd08b3eb1-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/05_K801_1920x1080_xbox-a2be9f50e91cd08b3eb1-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/10/05_K801_1920x1080_xbox-a2be9f50e91cd08b3eb1-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWe have several ways for you to quickly get into whatever Kingdom game picks your fancy:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/kingdom-two-crowns-call-of-olympus/9MXPPMG6F1V8?msockid=2c264e58dbd9616406135b4ada6360d7\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKingdom Two Crowns: Call of Olympus\u003c/a\u003e\u003c/em\u003e: The latest major expansion launched for \u003cem\u003eKingdom Two Crowns\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eKingdom New Lands\u003c/em\u003e (90%), \u003cem\u003eKingdom Two Crowns\u003c/em\u003e (75%), and \u003cem\u003eKingdom Eighties\u003c/em\u003e (35%) are now on sale in the Best Rated Sale\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eKingdom Treasury Collection\u003c/em\u003e: Includes the games \u003cem\u003eKingdom: New Lands\u003c/em\u003e, \u003cem\u003eKingdom Two Crowns\u003c/em\u003e and the \u003cem\u003eKingdom Two Crowns: Norse Lands DLC\u003c/em\u003e – now at a 60% discount in Deals with Game Pass\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eNorse Lands Edition\u003c/em\u003e: Includes \u003cem\u003eKingdom Two Crowns\u003c/em\u003e and the \u003cem\u003eNorse Lands DLC\u003c/em\u003e – now at a 65% discount in Deals with Game Pass\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eHeritage Bundle\u003c/em\u003e: Includes both \u003cem\u003eKingdom Two Crowns\u003c/em\u003e and \u003cem\u003eKingdom Eighties\u003c/em\u003e – now on sale at a 60% discount\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eKingdom Imperial Collection\u003c/em\u003e: Includes \u003cem\u003eKingdom: New Lands\u003c/em\u003e, \u003cem\u003eKingdom Two Crowns\u003c/em\u003e and \u003cem\u003eKingdom Eighties\u003c/em\u003e – now on sale at a 65% discount in Deals with Game Pass!\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eDo you want to join the celebrations? Get in on the fun and adventure today!\u003c/p\u003e\n\n\n\n\u003cdiv data-product-id=\"9MXPPMG6F1V8\" id=\"msp1728416551951\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9MXPPMG6F1V8\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.49047.13885883445668599.4cfb49f1-bac8-447c-bda4-948ed3c08d2a.7e942447-4193-4dd9-967e-10d15dbe9905?w=400\u0026amp;h=600\" alt=\"Kingdom Two Crowns: Call of Olympus\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\t“Sail forth and explore other lands\nRestore the gods and fulfill their demands” – Oracle\n\nIn faraway lands, Mount Olympus stands tall among the islands, casting an eerie shadow of unease. A sinister force has seized the divine realm and as a Monarch, you are setting out on a journey to stop it from consuming the world. Mediterranean warmth touches your skin as you slowly ride through dark woods and along beaches with glittering turquoise waters. Your quest is clear and the gods’ presence is palpable, but will they aid you against the Greed attacking at night?\n\nKingdom Two Crowns: Call of Olympus is a major expansion for Kingdom Two Crowns. Set out and build your Kingdom, alone or in co-op with a friend, in a completely new setting featuring legends and mythos inspired by ancient Greece.\n\nA Quest to Free Mount Olympus\n\n– An Epic New World: Call of Olympus features a reworked map with an epic conclusion at Mount Olympus, and you choose how to get there!\n– Temple and Quest Islands: These new islands present unique challenges, hidden treasures and powerful artifact rewards – prove your worth to Artemis, Athena, Hephaestus and Hermes to open the path to Mount Olympus.\n– Mythological mounts: Discover and unlock powerful new mounts, like the fierce three-headed Cerberus, the terrifying fire-breathing Chimera, the majestic winged Pegasus, or the trusty Donkey… and many more!\n\nFight Greed of Epic Scales\n\n– Face Your Fears: Muster steadfast defences to protect your crown, the Greed threat is more challenging than ever before, with multi-phased boss battles against the sinister Serpent.\n– Raise Your Banner: Shift the momentum and lead from the front. Bring the fight to the Greed with new siege mechanics, where the Hoplites will join you in Phalanx formation.\n– Assemble Your Fleet: Fight on land and at sea – build a fleet with devastating ship-mounted ballistas to join your battle. Once victorious, use your armada to ferry your army across the seas and combat the growing threat of Greed.\n\nDiscover Godly Powers and Abilities\n\n– Powerful Artifacts: Unlock four unique artifacts bestowed by the gods. Whether you choose a bow with a powerful directed attack, or a hammer that boosts your troops’ prowess, these items grant you new offensive and defensive abilities against the Greed.\n– Guided by the Oracle: Never stray from the task at hand. At your request,the Oracle will provide you with wisdom and directions for the next step of your Odyssey!\n– Set the Greed Ablaze: Wield powerful fire technology granted by the new hermit. It\u0026#39;s as if it was gifted by Prometheus himself!\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-08T20:00:00Z",
  "modifiedTime": "2024-10-08T21:35:49Z"
}
