{
  "id": "0933e392-78ab-4815-9a30-ce0358b387c6",
  "title": "Bad News For Pakistan: Star \"Hospitalised\" Ahead Of Crucial 5th Day vs ENG",
  "link": "https://sports.ndtv.com/cricket/bad-news-for-pakistan-star-hospitalised-ahead-of-crucial-5th-day-against-england-in-multan-test-6761324",
  "description": "A statement from the Pakistan Cricket Board (PCB) said he had undergone a number of tests, and a further update would be issued once the results were received.",
  "author": "",
  "published": "Thu, 10 Oct 2024 21:38:26 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "",
  "length": 2610,
  "excerpt": "A statement from the Pakistan Cricket Board (PCB) said he had undergone a number of tests, and a further update would be issued once the results were received.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "File image of Pakistan cricket team.© AFP Pakistan's legspinner Abrar Ahmed is being treated in hospital after being taken ill, according to ESPNcricinfo. Abrar, who bowled 31 overs on Day 3 of the opening Test against England, complained of body aches and a high fever on the morning of Day 4. He didn't take up the field for the entire Day 4. According to ESPNcricinfo, a statement from the Pakistan Cricket Board (PCB) said he had undergone a number of tests, and a further update would be issued once the results were received. On Day 3, Abrar was at the receiving end of the bashing that English batters delivered on a scorching day in Multan. He went wicketless and conceded 174 runs at an economy of 5.00, which was the story for the majority of Pakistan bowlers. Abrar was the sole frontline bowler in Pakistan's attack who went wicketless in the first inning. His performance is in complete contrast to the one that he delivered against England two years ago, where he scythed a whopping 11 wickets.Abrar has been haunted by injuries since making his professional debut for the Peshawar Zalmi in the Pakistan Super League. He made his first appearance for Zalmi as an 18-year-old. Abrat then went out to spend a couple of years on the sidelines due to a persistent injury.He sustained a nerve injury before Pakistan toured Australia and went on to miss the three Tests.Coming back to the opening Test in Multan, Joe Root and Harry Brook forged a record-breaking 454-run partnership that allowed England to exude control.England eventually declared on 823/7 in reply to Pakistan's first-inning total of 556 runs. The batting masterclass helped England assail to a 267-run lead on a batting paradise.Pakistan's history of succumbing to pressure kicked in as they lost six wickets in the final session to an inspired English bowling attack for a score of 15/6, still trailing by 115 runs.If Abrar fails to take the field on Day 5, Pakistan will be forced to end the game with 10 players.As a result, they could lose the game even if they lose nine wickets. ICC only allows substitutions in case of a concussion.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2024-08/bcq3lcao_pakistan-afp_625x300_25_August_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                            \u003cp\u003e\u003cimg width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2024-08/bcq3lcao_pakistan-afp_625x300_25_August_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"Bad News For Pakistan: Star \u0026#34;Hospitalised\u0026#34; Ahead Of Crucial 5th Day Against England In Multan Test\"/\u003e\n                                                            \u003c/p\u003e\n                                                            \u003cp\u003eFile image of Pakistan cricket team.\u003cspan\u003e© AFP\u003c/span\u003e\u003c/p\u003e\n                                \u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n                                        \n                                                \u003cp\u003ePakistan\u0026#39;s legspinner Abrar Ahmed is being treated in hospital after being taken ill, according to ESPNcricinfo. Abrar, who bowled 31 overs on Day 3 of the opening Test against England, complained of body aches and a high fever on the morning of Day 4. He didn\u0026#39;t take up the field for the entire Day 4. According to ESPNcricinfo, a statement from the Pakistan Cricket Board (PCB) said he had undergone a number of tests, and a further update would be issued once the results were received. On Day 3, Abrar was at the receiving end of the bashing that English batters delivered on a scorching day in Multan. He went wicketless and conceded 174 runs at an economy of 5.00, which was the story for the majority of Pakistan bowlers.\u003c/p\u003e\n\n\u003cp\u003eAbrar was the sole frontline bowler in Pakistan\u0026#39;s attack who went wicketless in the first inning. His performance is in complete contrast to the one that he delivered against England two years ago, where he scythed a whopping 11 wickets.\u003c/p\u003e\u003cp\u003eAbrar has been haunted by injuries since making his professional debut for the Peshawar Zalmi in the Pakistan Super League. He made his first appearance for Zalmi as an 18-year-old. Abrat then went out to spend a couple of years on the sidelines due to a persistent injury.\u003c/p\u003e\u003cp\u003eHe sustained a nerve injury before Pakistan toured Australia and went on to miss the three Tests.\u003c/p\u003e\u003cp\u003eComing back to the opening Test in Multan, Joe Root and Harry Brook forged a record-breaking 454-run partnership that allowed England to exude control.\u003c/p\u003e\u003cp\u003eEngland eventually declared on 823/7 in reply to Pakistan\u0026#39;s first-inning total of 556 runs. The batting masterclass helped England assail to a 267-run lead on a batting paradise.\u003c/p\u003e\u003cp\u003ePakistan\u0026#39;s history of succumbing to pressure kicked in as they lost six wickets in the final session to an inspired English bowling attack for a score of 15/6, still trailing by 115 runs.\u003c/p\u003e\u003cp\u003eIf Abrar fails to take the field on Day 5, Pakistan will be forced to end the game with 10 players.\u003c/p\u003e\u003cp\u003eAs a result, they could lose the game even if they lose nine wickets. ICC only allows substitutions in case of a concussion.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\n                                            \n                                            \n                                        \n                                            \u003cdiv\u003e\n                                                \u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n                                                \n                                            \u003c/div\u003e\n                                        \n\n                                        \n                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-10T21:38:26+05:30",
  "modifiedTime": null
}
