{
  "id": "0bc50961-fc9e-46b8-8d9c-8a7ac09f68d2",
  "title": "Krunal, Kohli and Salt thrash KKR on opening night of IPL 2025",
  "link": "https://www.espncricinfo.com/ci/content/story/1477731.html?ex_cid=OTC-RSS",
  "description": "KKR lost their way after Rahane and Narine's 103-run partnership for the second wicket",
  "author": "",
  "published": "Sun, 23 Mar 2025 01:04:13 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Sidharth Monga",
  "length": 4440,
  "excerpt": "KKR lost their way after Rahane and Narine's 103-run partnership",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Royal Challengers Bengaluru 177 for 3 (Kohli 59*, Salt 56, Patidar 34, Narine 1-27) beat Kolkata Knight Riders 174 for 8 (Rahane 56, Narine 44, Krunal 3-29, Hazlewood 2-22) by seven wicketsThe first IPL after the mega auction brings with it much anticipation of new alliances and loyalties. Royal Challengers Bengaluru (RCB) will be thrilled that their latest acquisitions played an impactful role in their emphatic start to IPL 2025 against defending champions Kolkata Knight Riders (KKR).Josh Hazlewood used the spongy bounce to scuttle KKR's powerplay and death overs with analysis of 4-0-22-1, Krunal Pandya ended Ajinkya Rahane's high-intent fifty in a spell of 4-0-29-3, Suyash Sharma salvaged an ordinary night with the massive wicket of Andre Russell, and Phil Salt killed the chase with 56 off 31, identical score to Rahane's. A regular fixture at RCB, Virat Kohli then sealed the game with 59 off 36 with 22 balls to spare in the chase of 175.Hazlewood: 'This is probably the freshest I've been in a long time'Krunal: 'If you get hit, you should only get hit on a good ball'Known for pushing convention, KKR played safe with their captaincy choice post the auction. Rahane the batter will have to allay doubts practically every day, but he got off to a good start as he and Sunil Narine smashed 98 runs in overs four to ten. However, KKR were outplayed pretty much throughout the night outside those seven overs.Hazlewood's height troubles KKRIt was just two overs at the top but that comprises 10% of the innings in T20s. Hazlewood, unavailable last IPL, was re-acquired by RCB at the auction. Coming off a long injury layoff, he started as if he had never been away: hard length, good pace, extra bounce. He had Quinton de Kock dropped before getting him two balls later in the first over. Then he had Narine swinging and missing through the third over.Rahane takes off, Narine followsRCB did help Rahane out, but he allayed some of the doubts around his batting with a high-intent innings even as Narine struggled to come to terms with the uneven bounce on the pitch. RCB kept feeding him straight balls, and Rahane kept picking them up over the leg side: all his first 30 runs came there. Once Narine joined the mayhem, that slow start was exorcised.One of the key moments was Narine going after his former team-mate Suyash, who tends to get the better of batters when they play him as a legspinner. Narine kept going over the off side as 22 came off the ninth over.Krunal leads RCB's comebackKKR were 107 for 1 in 9.5 overs when Narine tried to crash Rasikh Salam over the off side but was done in by the extra bounce. Struggling for options until that point, RCB could then go back to Krunal as Rahane and Venkatesh Iyer can both be shut down by spin. In each of his last three overs, Krunal, who used clever changes in pace, picked up a wicket with quicker balls. Rahane holed out to deep midwicket while Venkatesh and Rinku Singh were castled.The wicket of Rinku brought in Russell, cue for RCB to bowl legspin. Russell's ordinary record against the wrong'un continued as he failed to pick one from Suyash and lost his middle stump. Since 2018 he averages 13.41 and strikes at 123.24 against the wrong'un. That wicket was worth about 40 runs.Angkrish Raghuvanshi couldn't get going as the ball gripped the surface. Hazlewood and Yash Dayal used the middle of the pitch masterfully to concede just 23 in the last four overs.Salt punishes former teamSalt, who played a huge role in KKR's title run with an average of 58.33 and a strike rate of 185.18 in Kolkata last year, soon reminded KKR they should not have let him go. The first ball of the chase was crashed wide of mid-off for four. The intent never stopped especially with Kohli turbo-charged during the powerplay. KKR were forced to bring in Varun Chakravarthy in the fourth over, and Salt took 20 off him. Also, the ball had stopped gripping by then possibly because of the dew.By the time Varun got the better of Salt, RCB had reached 95 in 8.3 overs. The asking rate had dropped under seven, and Kohli was never going to let such a chase slip. However, what will thrill RCB is that Kohli kept the intent up and sought to get them a big net-run-rate boost. He slog-swept Varun for a six in his last over when it would have been easy to just play him out. New captain Rajat Patidar played the perfect little hand at the other end with 34 off 16 as RCB romped home.",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/398200/398242.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ci\u003e\u003cb\u003eRoyal Challengers Bengaluru\u003c/b\u003e 177 for 3 (Kohli 59*, Salt 56, Patidar 34, Narine 1-27) beat \u003cb\u003eKolkata Knight Riders\u003c/b\u003e 174 for 8 (Rahane 56, Narine 44, Krunal 3-29, Hazlewood 2-22) by seven wickets\u003c/i\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe first IPL after the mega auction brings with it much anticipation of new alliances and loyalties. Royal Challengers Bengaluru (RCB) will be thrilled that their latest acquisitions played an impactful role in their emphatic start to \u003ca href=\"https://www.espncricinfo.com/series/ipl-2025-1449924\"\u003eIPL 2025\u003c/a\u003e against defending champions Kolkata Knight Riders (KKR).\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/josh-hazlewood-288284\"\u003eJosh Hazlewood\u003c/a\u003e used the spongy bounce to scuttle KKR\u0026#39;s powerplay and death overs with analysis of 4-0-22-1, \u003ca href=\"https://www.espncricinfo.com/cricketers/krunal-pandya-471342\"\u003eKrunal Pandya\u003c/a\u003e ended \u003ca href=\"https://www.espncricinfo.com/cricketers/ajinkya-rahane-277916\"\u003eAjinkya Rahane\u003c/a\u003e\u0026#39;s high-intent fifty in a spell of 4-0-29-3, \u003ca href=\"https://www.espncricinfo.com/cricketers/suyash-sharma-1350792\"\u003eSuyash Sharma\u003c/a\u003e salvaged an ordinary night with the massive wicket of Andre Russell, and \u003ca href=\"https://www.espncricinfo.com/cricketers/phil-salt-669365\"\u003ePhil Salt\u003c/a\u003e killed the chase with 56 off 31, identical score to Rahane\u0026#39;s. A regular fixture at RCB, \u003ca href=\"https://www.espncricinfo.com/cricketers/virat-kohli-253802\"\u003eVirat Kohli\u003c/a\u003e then sealed the game with 59 off 36 with 22 balls to spare in the chase of 175.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/kkr-vs-rcb-ipl-2025-josh-hazlewood-this-is-probably-the-freshest-i-ve-been-in-a-long-time-1477753\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eHazlewood: \u0026#39;This is probably the freshest I\u0026#39;ve been in a long time\u0026#39;\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/ipl-2025-kkr-vs-rcb-krunal-pandya-if-you-get-hit-you-should-only-get-hit-on-a-good-ball-1477746\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eKrunal: \u0026#39;If you get hit, you should only get hit on a good ball\u0026#39;\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eKnown for pushing convention, KKR played safe with their captaincy choice post the auction. Rahane the batter will have to allay doubts practically every day, but he got off to a good start as he and \u003ca href=\"https://www.espncricinfo.com/cricketers/sunil-narine-230558\"\u003eSunil Narine\u003c/a\u003e smashed 98 runs in overs four to ten. However, KKR were outplayed pretty much throughout the night outside those seven overs.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eHazlewood\u0026#39;s height troubles KKR\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIt was just two overs at the top but that comprises 10% of the innings in T20s. Hazlewood, unavailable last IPL, was re-acquired by RCB at the auction. Coming off a long injury layoff, he started as if he had never been away: hard length, good pace, extra bounce. He had Quinton de Kock dropped before getting him two balls later in the first over. Then he had Narine swinging and missing through the third over.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eRahane takes off, Narine follows\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRCB did help Rahane out, but he allayed some of the doubts around his batting with a high-intent innings even as Narine struggled to come to terms with the uneven bounce on the pitch. RCB kept feeding him straight balls, and Rahane kept picking them up over the leg side: all his first 30 runs came there. Once Narine joined the mayhem, that slow start was exorcised.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eOne of the key moments was Narine going after his former team-mate Suyash, who tends to get the better of batters when they play him as a legspinner. Narine kept going over the off side as 22 came off the ninth over.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eKrunal leads RCB\u0026#39;s comeback\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eKKR were 107 for 1 in 9.5 overs when Narine tried to crash Rasikh Salam over the off side but was done in by the extra bounce. Struggling for options until that point, RCB could then go back to Krunal as Rahane and Venkatesh Iyer can both be shut down by spin. In each of his last three overs, Krunal, who used clever changes in pace, picked up a wicket with quicker balls. Rahane holed out to deep midwicket while Venkatesh and Rinku Singh were castled.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe wicket of Rinku brought in Russell, cue for RCB to bowl legspin. Russell\u0026#39;s ordinary record against the wrong\u0026#39;un continued as he failed to pick one from Suyash and lost his middle stump. Since 2018 he averages 13.41 and strikes at 123.24 against the wrong\u0026#39;un. That wicket was worth about 40 runs.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAngkrish Raghuvanshi couldn\u0026#39;t get going as the ball gripped the surface. Hazlewood and Yash Dayal used the middle of the pitch masterfully to concede just 23 in the last four overs.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eSalt punishes former team\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSalt, who played a huge role in KKR\u0026#39;s title run with an average of 58.33 and a strike rate of 185.18 in Kolkata last year, soon reminded KKR they should not have let him go. The first ball of the chase was crashed wide of mid-off for four. The intent never stopped especially with Kohli turbo-charged during the powerplay. KKR were forced to bring in Varun Chakravarthy in the fourth over, and Salt took 20 off him. Also, the ball had stopped gripping by then possibly because of the dew.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBy the time Varun got the better of Salt, RCB had reached 95 in 8.3 overs. The asking rate had dropped under seven, and Kohli was never going to let such a chase slip. However, what will thrill RCB is that Kohli kept the intent up and sought to get them a big net-run-rate boost. He slog-swept Varun for a six in his last over when it would have been easy to just play him out. New captain Rajat Patidar played the perfect little hand at the other end with 34 off 16 as RCB romped home.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-22T17:29:00Z",
  "modifiedTime": null
}
