{
  "id": "13ec05ce-dc1b-4d6f-a37b-01122c87bead",
  "title": "Ominous signs for England after toil - Vaughan",
  "link": "https://www.bbc.com/sport/cricket/articles/c5ygj3x8g07o",
  "description": "England's lack of penetration with the ball coupled with fitness concerns are an \"ominous\" sign, says former captain Michael Vaughan.",
  "author": "",
  "published": "Thu, 03 Jul 2025 19:13:31 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Matthew Henry",
  "length": 4067,
  "excerpt": "England's lack of penetration with the ball coupled with fitness concerns are an \"ominous\" sign, says former captain Michael Vaughan.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Ominous signs for England after toil - VaughanMedia caption, Hartley and Rainford-Brent on how England can turn things around against IndiaEngland's lack of penetration with the ball coupled with fitness concerns are an \"ominous\" sign, says former captain Michael Vaughan.Ben Stokes' side toiled throughout the second day at Edgbaston as India piled up 587 before reducing the hosts to 77-3.Brydon Carse struggled with a recurrence of his foot issues while Ben Stokes and Chris Woakes did not bowl after their first spells.\"Clearly there's a problem with Brydon Carse and we're two Test matches into a five-match series in England and then it's not too long after we've got five matches in Australia in the heat on those slabs, some of those drop-in pitches with a Kookaburra ball,\" Vaughan said.\"Their [England's] tactic after 30 overs pretty much is just to whack the ball into the pitch with a square-of-the-wicket field.\"They're going to need some wheelbarrows to get some of these bowlers off the park in Australia. It's so tough on the body.\"Carse was ruled out for three months earlier this year because of serious cuts and blisters on his toes – an issue that first emerged on tours of Pakistan and New Zealand before Christmas.Although he remained on the field in Birmingham, he was seen hobbling at various times when fielding and in his bowling follow-through.Stokes, meanwhile, has returned to bowling this year following hamstring surgery.He was seen stretching his groin on day one and, after a lengthy warm-up before play, opened the bowling on day two. He delivered four overs for 16 runs but did not return to the attack in the remaining 58 overs of India's innings. Similarly, Woakes did not feature after his four overs for 22 runs at the start of the day.Off-spinner Shoaib Bashir bowled 45 overs for 3-167, Josh Tongue struggled as he took 2-119 from 28 overs and even Harry Brook bowled five overs of his part-time seam in their absence.\"India have batted great and with great control but the way England bowled today was a slight concern,\" Vaughan said.\"There were a few things I saw in the field which made me think it was ominous going forward.\"Media caption, Shubman Gill hits highest Test score as India take control of second TestThe fitness issue is heightened by the fact there are only three days off before this Test and the third at Lord's next week.By then England could be boosted by the return of Gus Atkinson, their leading wicket-taker in 2024 who bowled a long and pacey spell in the nets before this match as he recovers from a hamstring injury, while Jofra Archer looks on course to make a long-awaited return to Test cricket too.Jamie Overton has recovered from a broken finger and Essex seamer Sam Cook is available should England require or wish for further changes.It had been thought pace bowler Olly Stone would miss the summer with a knee injury but he has been named in Nottinghamshire‘s squad for their T20 at Durham on Friday.'We are not fussed what's said outside the group'India captain Shubman Gill capitalised on England's struggles and made 267 - the highest score by an India batter in the UK.That came despite Stokes winning the toss on day one and then continuing his preference to bowl first. India's score was the highest England have conceded since Stokes became captain.Bowling coach Jeetan Patel insisted England can still win the match, again following the Stokes mantra of dismissing the prospect of playing for a draw, and said they would not reflect on the toss decision.\"I don't think you reflect on what's happened,\" the New Zealander said.\"Hindsight's hindsight. We decided to bowl and we'll stick by that. \"On the first day it showed enough for us and we created a lot of opportunities and it didn't go our way. The day might've looked different yesterday and this morning if we got those decisions.\"People are going to look at any scorecard and make a decision on what they're going to think. I'm not really fussed and I don't think any of us are fussed about what's said outside of the group.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b7a/live/88b09000-583c-11f0-9074-8989d8c97d87.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle id=\"urn-bbc-ares--article-c5ygj3x8g07o\"\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eOminous signs for England after toil - Vaughan\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eHartley and Rainford-Brent on how England can turn things around against India\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEngland\u0026#39;s lack of penetration with the ball coupled with fitness concerns are an \u0026#34;ominous\u0026#34; sign, says former captain Michael Vaughan.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBen Stokes\u0026#39; side toiled throughout the second day at Edgbaston as India piled up 587 before reducing the hosts to 77-3.\u003c/p\u003e\u003cp\u003eBrydon Carse struggled with a recurrence of his foot issues while Ben Stokes and Chris Woakes did not bowl after their first spells.\u003c/p\u003e\u003cp\u003e\u0026#34;Clearly there\u0026#39;s a problem with Brydon Carse and we\u0026#39;re two Test matches into a five-match series in England and then it\u0026#39;s not too long after we\u0026#39;ve got five matches in Australia in the heat on those slabs, some of those drop-in pitches with a Kookaburra ball,\u0026#34; Vaughan said.\u003c/p\u003e\u003cp\u003e\u0026#34;Their [England\u0026#39;s] tactic after 30 overs pretty much is just to whack the ball into the pitch with a square-of-the-wicket field.\u003c/p\u003e\u003cp\u003e\u0026#34;They\u0026#39;re going to need some wheelbarrows to get some of these bowlers off the park in Australia. It\u0026#39;s so tough on the body.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eCarse was ruled out for three months earlier this year because of serious cuts and blisters on his toes – an issue that first emerged on tours of Pakistan and New Zealand before Christmas.\u003c/p\u003e\u003cp\u003eAlthough he remained on the field in Birmingham, he was seen hobbling at various times when fielding and in his bowling follow-through.\u003c/p\u003e\u003cp\u003eStokes, meanwhile, has returned to bowling this year following hamstring surgery.\u003c/p\u003e\u003cp\u003eHe was seen stretching his groin on day one and, after a lengthy warm-up before play, opened the bowling on day two. \u003c/p\u003e\u003cp\u003eHe delivered four overs for 16 runs but did not return to the attack in the remaining 58 overs of India\u0026#39;s innings. Similarly, Woakes did not feature after his four overs for 22 runs at the start of the day.\u003c/p\u003e\u003cp\u003eOff-spinner Shoaib Bashir bowled 45 overs for 3-167, Josh Tongue struggled as he took 2-119 from 28 overs and even Harry Brook bowled five overs of his part-time seam in their absence.\u003c/p\u003e\u003cp\u003e\u0026#34;India have batted great and with great control but the way England bowled today was a slight concern,\u0026#34; Vaughan said.\u003c/p\u003e\u003cp\u003e\u0026#34;There were a few things I saw in the field which made me think it was ominous going forward.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eShubman Gill hits highest Test score as India take control of second Test\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe fitness issue is heightened by the fact there are only three days off before this Test and the third at Lord\u0026#39;s next week.\u003c/p\u003e\u003cp\u003eBy then England could be boosted by the return of Gus Atkinson, their leading wicket-taker in 2024 who bowled a long and pacey spell in the nets before this match as he recovers from a hamstring injury, while Jofra Archer looks on course to make a long-awaited return to Test cricket too.\u003c/p\u003e\u003cp\u003eJamie Overton has recovered from a broken finger and Essex seamer Sam Cook is available should England require or wish for further changes.\u003c/p\u003e\u003cp\u003eIt had been thought pace bowler Olly Stone would miss the summer with a knee injury but he has been named in Nottinghamshire‘s squad for their T20 at Durham on Friday.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"We-are-not-fussed-whats-said-outside-the-group\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;We are not fussed what\u0026#39;s said outside the group\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIndia captain Shubman Gill capitalised on England\u0026#39;s struggles and made 267 - the highest score by an India batter in the UK.\u003c/p\u003e\u003cp\u003eThat came despite Stokes winning the toss on day one and then continuing his preference to bowl first. India\u0026#39;s score was the highest England have conceded since Stokes became captain.\u003c/p\u003e\u003cp\u003eBowling coach Jeetan Patel insisted England can still win the match, again following the Stokes mantra of dismissing the prospect of playing for a draw, and said they would not reflect on the toss decision.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t think you reflect on what\u0026#39;s happened,\u0026#34; the New Zealander said.\u003c/p\u003e\u003cp\u003e\u0026#34;Hindsight\u0026#39;s hindsight. We decided to bowl and we\u0026#39;ll stick by that. \u003c/p\u003e\u003cp\u003e\u0026#34;On the first day it showed enough for us and we created a lot of opportunities and it didn\u0026#39;t go our way. The day might\u0026#39;ve looked different yesterday and this morning if we got those decisions.\u003c/p\u003e\u003cp\u003e\u0026#34;People are going to look at any scorecard and make a decision on what they\u0026#39;re going to think. I\u0026#39;m not really fussed and I don\u0026#39;t think any of us are fussed about what\u0026#39;s said outside of the group.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-03T19:13:31.682Z",
  "modifiedTime": null
}
