{
  "id": "2104df01-8805-4620-b040-e559e08072e5",
  "title": "India's predicted XI for the Perth Test: At least one debutant expected",
  "link": "https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/indias-predicted-xi-for-the-perth-test-at-least-one-debutant-expected",
  "description": "India have several selection concerns ahead of their first Test against Australia, starting on November 22. Here’s how the visitors are likely to line up in Perth.",
  "author": "Sarah Waris",
  "published": "Tue, 19 Nov 2024 14:13:00 +0000",
  "source": "https://www.wisden.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Sarah Waris",
  "length": 4463,
  "excerpt": "India have several selection concerns ahead of their first Test against Australia, starting on November 22. Here’s how the visitors are likely to line up in Perth.",
  "siteName": "Wisden",
  "favicon": "https://www.wisden.com/static-assets/favicons/apple-touch-icon.png?v=23.07",
  "text": "Openers KL Rahul and Yashasvi Jaiswal Jaiswal is a must in the team, having cemented his place with strong showings ever since he made his debut last July. In 14 Tests, he has made 1,407 runs at an average of 56.28 with three hundreds. In the absence of skipper Rohit, Jaiswal will open alongside an under-fire Rahul, fresh off a bizarre dismissal in the India A game. Rahul’s place in the Test squad was uncertain till a few days ago. After being dropped from India’s XI for the New Zealand Tests, he also looked tentative against Australia A, forcing the team to possibly think of opening with Shubman Gill. He was later injured during India’s simulation training, which further cast down on his place. However, he has since recovered, but Gill’s injury has forced a rethink and it is now all but certain that India will open with Rahul. Rahul has had a topsy-turvy career since his first Test hundred on Australia shores. There have been periods of brilliance overseas followed by sporadic runs of form but Rahul has found a way to rise when the odds have been against him. Middle-order Devdutt Padikkal, Virat Kohli, Rishabh Pant and Dhruv Jurel Padikkal and Jurel would be surprise inclusions in the XI, with the duo not being in the fray until a month ago. Padikkal is likely to replace Gill at No.3, having been asked to stay behind after impressing during the A series. He faced 276 balls across both innings in the first unofficial Test, making 124 runs, including a fine 88 in the second. In the next Test, Padikkal stood tall for 55 on a spicy wicket, making 26 before being undone by the extra bounce. Jurel should play as the specialist batter, having unanimously won over experts with his temperament and batting approach against the quicks in the A game. He made twin fifties at Melbourne on testing conditions and would have been a favourite to bat at No.3 if Gill had been fit and opening. Sarfaraz Khan will be unlucky to miss out after his debut hundred in the previous series, but he has little exposure of playing on bouncy conditions recently, having not been named in the India A team either. He has limited first-class experience outside Asia. Kohli and Pant are, of course, certainties. All-rounders Nitish Kumar Reddy and Ravindra Jadeja Two spots that are up for discussion. India have traditionally not looked at R Ashwin as their first-choice spin-bowling all-rounder outside of Asia of late, and he will likely miss out again despite the proliferation of left-handers in the Australia top seven. The choice, then, will be between Washington Sundar, who came onto his own on the last tour, and Ravindra Jadeja. Sundar’s height will help in extracting bounce and he is also a capable batter, having recently struck 152 in the Ranji Trophy. However, Jadeja has bailed India out innumerable times with the bat of late and has a decent record in Australia with the ball, albeit from a small sample size. Reddy is in line to make his debut, filling in for the slot left vacant by Shardul Thakur, who was recently India’s go-to man in overseas matches. Reddy, a medium-pace swing bowler, has played just 23 first-class games, making 779 runs and picking up 56 wickets. Harshit Rana, a tall, hit-the-deck quick, could be more effective on these pitches, but India have generally preferred the luxury of batting depth away from home. India could also go in with two spinners, with Australia having plenty of in-form left-handers, who can be countered by either Ashwin or Sundar. It will also provide more experience to the bowling attack. Fast bowlers Jasprit Bumrah, Prasidh Krishna and Mohammed Siraj India have four options to pick from from, barring Jasprit Bumrah. Rana and Prasidh Krishna are both tall quicks who can get the ball to kick up off the wicket. Akash Deep has been brilliant with the new ball, using his deceptive pace to trouble batters. Mohammed Siraj was recently dropped for the XI against New Zealand, but has prior experience of bowling - and excelling - Down Under, which will tilt the favour towards him. If India also pick Reddy, they might prefer going in with Krishna to lend variety and experience to the bowling attack. Follow Wisden for all cricket updates, including live scores, match stats, quizzes and more. Stay up to date with the latest cricket news, player updates, team standings, match highlights, video analysis and live match odds. Cover Stories IndiaTrending StoriesSeries Cover Stories",
  "image": "https://www.wisden.com/static-assets/waf-images/c3/26/8a/16-9/PXsUizyS4z.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e \u003cfigure\u003e\u003cimg src=\"https://www.wisden.com/static-assets/waf-images/c3/26/8a/16-9/PXsUizyS4z.png?v=23.07\u0026amp;w=600\" width=\"600px\" height=\"338px\" sizes=\"(min-width: 300px) 600px\" data-src=\"https://www.wisden.com/static-assets/waf-images/c3/26/8a/16-9/PXsUizyS4z.png?v=23.07\u0026amp;w=600\" data-srcset=\"https://www.wisden.com/static-assets/waf-images/c3/26/8a/16-9/PXsUizyS4z.png?v=23.07\u0026amp;w=300 300w, https://www.wisden.com/static-assets/waf-images/c3/26/8a/16-9/PXsUizyS4z.png?v=23.07\u0026amp;w=500 500w, https://www.wisden.com/static-assets/waf-images/c3/26/8a/16-9/PXsUizyS4z.png?v=23.07\u0026amp;w=750 750w\" alt=\"India have several selection concerns ahead of their first Test against Australia, starting on November 22. Here’s how the visitors are likely to line up in Perth. \" importance=\"low\"/\u003e \u003c/figure\u003e\u003c/div\u003e   \u003ch2\u003eOpeners\u003c/h2\u003e \u003ch3\u003eKL Rahul and Yashasvi Jaiswal\u003c/h3\u003e \u003cp\u003eJaiswal is a must in the team, \u003ca href=\"https://www.wisden.com/series/india-vs-bangladesh-m-2024/cricket-news/where-does-yashasvi-jaiswals-start-in-test-cricket-rank-among-the-all-time-best\" target=\"_blank\" rel=\"noopener\"\u003ehaving cemented his place with strong showings\u003c/a\u003e ever since he made his debut last July. In 14 Tests, he has made 1,407 runs at an average of 56.28 with three hundreds. In the absence of skipper Rohit, Jaiswal will open alongside an under-fire Rahul, \u003ca href=\"https://www.wisden.com/cricket-news/watch-kl-rahul-bowled-through-his-legs-leaving-first-ball-by-off-spinner\" target=\"_blank\" rel=\"noopener\"\u003efresh off a bizarre dismissal\u003c/a\u003e in the India A game.\u003c/p\u003e \u003cp\u003eRahul’s place in the Test squad was uncertain till a few days ago. After being dropped from India’s XI for the New Zealand Tests, he also looked tentative against Australia A, forcing the team to possibly think of opening with Shubman Gill.\u003ca href=\"https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/kl-rahul-injury-update-whats-the-latest-on-the-india-batters-recovery\" target=\"_blank\" rel=\"noopener\"\u003e He was later injured during India’s simulation training\u003c/a\u003e, which further cast down on his place. However, he has since recovered, but Gill’s injury has forced a rethink and it is now all but certain that India will open with Rahul.\u003c/p\u003e \u003cp\u003eRahul has had a topsy-turvy career since his first Test hundred on Australia shores. There have been periods of brilliance overseas followed by sporadic runs of form but Rahul has found a way to rise when the odds have been against him.\u003c/p\u003e \u003ch2\u003eMiddle-order\u003c/h2\u003e \u003ch3\u003eDevdutt Padikkal, Virat Kohli, Rishabh Pant and Dhruv Jurel\u003c/h3\u003e \u003cp\u003ePadikkal and Jurel would be surprise inclusions in the XI, with the duo not being in the fray until a month ago. Padikkal is likely to replace Gill at No.3, having been asked to stay behind after impressing during the A series. He faced 276 balls across both innings in the first unofficial Test, making 124 runs, including a fine 88 in the second. In the next Test, Padikkal stood tall for 55 on a spicy wicket, making 26 before being undone by the extra bounce.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.wisden.com/series/australia-vs-india-m-202425/cricket-news/should-india-start-with-dhruv-jurel-as-a-specialist-bat-in-the-perth-test-aus-vs-ind\" target=\"_blank\" rel=\"noopener\"\u003eJurel should play as the specialist batter\u003c/a\u003e, having unanimously won over experts with his temperament and batting approach against the quicks in the A game. He made twin fifties at Melbourne on testing conditions and would have been a favourite to bat at No.3 if Gill had been fit and opening.\u003c/p\u003e \u003cp\u003eSarfaraz Khan will be unlucky to miss out after his debut hundred in the previous series, but he has little exposure of playing on bouncy conditions recently, having not been named in the India A team either. He has limited first-class experience outside Asia.\u003c/p\u003e \u003cp\u003eKohli and Pant are, of course, certainties.\u003c/p\u003e    \u003ch2\u003eAll-rounders\u003c/h2\u003e \u003ch3\u003eNitish Kumar Reddy and Ravindra Jadeja\u003c/h3\u003e \u003cp\u003eTwo spots that are up for discussion. India have traditionally not looked at R Ashwin as their first-choice spin-bowling all-rounder outside of Asia of late, and he will likely miss out again despite the proliferation of left-handers in the Australia top seven. The choice, then, will be between Washington Sundar, who came onto his own on the last tour, and Ravindra Jadeja. \u003ca href=\"https://www.wisden.com/series/india-vs-new-zealand-m-2024/cricket-news/five-takeaways-from-indias-historic-home-whitewash-by-new-zealand\" target=\"_blank\" rel=\"noopener\"\u003eSundar’s height will help in extracting bounce\u003c/a\u003e and he is also a capable batter, having recently struck 152 in the Ranji Trophy. However, Jadeja has bailed India out innumerable times with the bat of late and has a decent record in Australia with the ball, albeit from a small sample size.\u003c/p\u003e \u003cp\u003eReddy is in line to make his debut, filling in for the slot left vacant by Shardul Thakur, \u003ca href=\"https://www.wisden.com/series/icc-mens-cricket-world-cup-2023-24/cricket-news/shardul-thakur-is-a-mystery-india-are-yet-to-solve\" target=\"_blank\" rel=\"noopener\"\u003ewho was recently India’s go-to man in overseas matches\u003c/a\u003e. Reddy, a medium-pace swing bowler, has played just 23 first-class games, making 779 runs and picking up 56 wickets. Harshit Rana, a tall, hit-the-deck quick, could be more effective on these pitches, but India have generally preferred the luxury of batting depth away from home.\u003c/p\u003e \u003cp\u003eIndia could also go in with two spinners, with Australia having plenty of in-form left-handers, who can be countered by either Ashwin or Sundar. It will also provide more experience to the bowling attack.\u003c/p\u003e \u003ch2\u003eFast bowlers\u003c/h2\u003e \u003ch3\u003eJasprit Bumrah, Prasidh Krishna and Mohammed Siraj\u003c/h3\u003e \u003cp\u003eIndia have four options to pick from from, barring Jasprit Bumrah. Rana and Prasidh Krishna are both tall quicks who can get the ball to kick up off the wicket. Akash Deep has been brilliant with the new ball, using his deceptive pace to trouble batters. Mohammed Siraj was recently dropped for the XI against New Zealand, but has prior experience of bowling - and excelling - Down Under, which will tilt the favour towards him. If India also pick Reddy, they might prefer going in with Krishna to lend variety and experience to the bowling attack.\u003c/p\u003e \u003cp\u003e\u003cstrong data-stringify-type=\"bold\"\u003eFollow Wisden for all cricket updates, including \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/live-cricket-scores\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/live-cricket-scores\" data-sk=\"tooltip_parent\"\u003elive scores\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e, match stats, \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/quizzes/daily-quiz\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/quizzes/daily-quiz\" data-sk=\"tooltip_parent\" aria-describedby=\"sk-tooltip-14407\"\u003equizzes\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e and more. Stay up to date with the \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/cricket-news\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/cricket-news\" data-sk=\"tooltip_parent\"\u003elatest cricket news\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e, player updates, team \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/series/icc-mens-t20-world-cup-2024/points-table-standings\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/series/icc-mens-t20-world-cup-2024/points-table-standings\" data-sk=\"tooltip_parent\"\u003estandings,\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e match highlights, \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.youtube.com/@WisdenCricket\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.youtube.com/@WisdenCricket\" data-sk=\"tooltip_parent\"\u003evideo analysis\u003c/a\u003e\u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e and \u003c/strong\u003e\u003cstrong data-stringify-type=\"bold\"\u003e\u003ca href=\"https://www.wisden.com/cricket-betting?utm_source=outro\u0026amp;utm_medium=interlink\u0026amp;utm_campaign=cricketbet_hub\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.wisden.com/cricket-betting?utm_source=outro\u0026amp;utm_medium=interlink\u0026amp;utm_campaign=cricketbet_hub\" data-sk=\"tooltip_parent\"\u003elive match odds\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e       \u003cdiv\u003e \u003cp\u003e\u003cspan title=\"Cover Stories India\"\u003eCover Stories India\u003c/span\u003e\u003cspan title=\"Trending Stories\"\u003eTrending Stories\u003c/span\u003e\u003cspan title=\"Series Cover Stories\"\u003eSeries Cover Stories\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-19T14:13:00Z",
  "modifiedTime": "2024-11-19T20:22:34Z"
}
