{
  "id": "2d21cb63-ca2a-4f2d-8376-95c454c2f6c6",
  "title": "Raine turns tide for Durham after Booth blitz",
  "link": "https://www.espncricinfo.com/ci/content/story/1481027.html?ex_cid=OTC-RSS",
  "description": "Vital 81 leaves Warwickshire with stiff target going into final day",
  "author": "",
  "published": "Sun, 13 Apr 2025 21:18:30 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ECB Reporters Network",
  "length": 4199,
  "excerpt": "Vital 81 leaves Warwickshire with stiff target going into final day",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Day 3 - Warwickshire need 327 runs.ReportVital 81 leaves Warwickshire with stiff target going into final dayMichael Booth routed Durham's top-order before Ben Raine hit back  •  Getty ImagesWarwickshire 325 and 12 for 0 need a further 327 to beat Durham 387 and 276 for 8 dec (Raine 81, Booth 4-66) Ben Raine's vital knock led a Durham fightback with the bat after a four-wicket blitz from Warwickshire's Michael Booth had given his side the upper hand on day three of their Rothesay County Championship encounter.After frustrating Durham in the morning, the Bears were bowled out for 325, 62 runs behind the hosts' total. Durham's second innings started in a serene manner, but a fabulous four-wicket spell from Booth either side of lunch saw momentum swing the way of the visitors.However, Raine had other ideas and picked up his 20th First Class half-century at the Banks Homes Riverside and combined well with David Bedingham for a partnership worth 88 to help the hosts set a target of 339 after finishing their second innings on 276 for eight. Warwickshire began their chase late on and finished on 12 without loss, 327 behind the target.Warwickshire kicked off the day on 287 for eight, with Booth unbeaten on 50 and he resumed alongside Ethan Bamber. The pair frustrated Durham in the early stages of play, taking Warwickshire past 300 and to a second batting bonus point.The resistance of Warwickshire was broken as Potts finally got a first innings wicket when Bamber departed for 21 after he edged one to Colin Ackermann at second slip. The final wicket fell soon after as Doggett bowled Vishwa Fernando for one, to hand Warwickshire a first innings total of 325. Alex Lees and first innings centurion Ben McKinney began Durham's pursuit of building their lead of 62, but Bears bowlers Bamber and Fernando kept things tight.Lees started to look good as he whipped an Ed Barnard delivery to the legside boundary for four and he followed that up in the same over with a lovely straight drive. However, Booth broke the Durham opening partnership as he got skipper Lees LBW for 32 and the Bears bowler struck again as he got Emilio Gay LBW. Booth then had another shortly after lunch as he produced a pearler of a delivery which knocked out two of Ackermann'sstumps and in the same over Ollie Robinson edged a delivery from the 24-year-old to Rob Yates at second slip to leave the hosts in trouble.Bamber joined in on the action as he got Will Rhodes LBW for 18. Despite the difficult situation he found himself in, Raine looked to be positive when he arrived at the crease, while McKinney remained solid as he did in the first innings.Raine continued to attack as he pulled a short ball from Fernando to the boundary, but the Bears picked up the vital wicket of McKinney for 33 as he feathered a Barnard ball through to Kai Smith. That brought Bedingham to the crease, who was assisted by runner Ackermann due to a toe injury sustained in the first innings. Despite the injury, the South African played some delightful shots and had no problems finding the boundary.Raine then reached his 50 from 88 balls, and he produced an inventive ramp shot which went past third man for four just a few balls later. The wounded Bedingham showed no signs of his injury as he smashed back-to-back fours to the legside boundary off the bowling of Booth.Raine was then dropped by Alex Davies at slip on 55, after he nicked a delivery from Taz Ali. However, there was no mistake made in the field for David Bedingham as Bamber got his second of the innings when the Durham man picked out Dan Mousley at deep square and he had to depart for a well made 45. Raine continued to build the lead along with Potts and they took it over 300, with the latter playing a glorious straight drive for four.But Raine departed for 81 shorty after as Yates got him LBW after he was hit on the pads while attempting a sweep. Potts and Daniel Hogg continued to add vital runs for the hosts, with both hitting maximums as they set up a declaration, which came with four overs left in the day. Openers Yates and Davies saw the visitors through to close, with a big job ahead of them on day four.Instant answers to T20 questions",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/399100/399116.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://plus.espn.com/cricket?ex_cid=cricinfonav\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cimg height=\"22\" alt=\"espn plus\" src=\"https://wassets.hscicdn.com/static/images/espn_plus_icon_light.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eDay 3 - Warwickshire need 327 runs.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"section-1481027\"\u003e\u003carticle data-id=\"1481027\" data-src=\"/series/county-championship-division-one-2025-1461819/durham-vs-warwickshire-6th-match-1461829/match-report-3\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/report-3\" title=\"Report\"\u003e\u003cspan\u003eReport\u003c/span\u003e\u003c/a\u003e\u003cp\u003eVital 81 leaves Warwickshire with stiff target going into final day\u003c/p\u003e\u003c/header\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/399100/399116.6.jpg\" alt=\"Michael Booth claimed three wickets on day one, Durham vs Warwickshire, Chester-le-Street, County Championship, April 11, 2025\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMichael Booth routed Durham\u0026#39;s top-order before Ben Raine hit back  •  \u003cspan\u003eGetty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ci\u003e\u003cb\u003eWarwickshire\u003c/b\u003e 325 and 12 for 0 need a further 327 to beat \u003cb\u003eDurham\u003c/b\u003e 387 and 276 for 8 dec (Raine 81, Booth 4-66) \u003c/i\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/ben-raine-459761\"\u003eBen Raine\u0026#39;\u003c/a\u003es vital knock led a Durham fightback with the bat after a four-wicket blitz from Warwickshire\u0026#39;s \u003ca href=\"https://www.espncricinfo.com/cricketers/michael-booth-1071011\"\u003eMichael Booth\u003c/a\u003e had given his side the upper hand on day three of their Rothesay County Championship encounter.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAfter frustrating Durham in the morning, the Bears were bowled out for 325, 62 runs behind the hosts\u0026#39; total. Durham\u0026#39;s second innings started in a serene manner, but a fabulous four-wicket spell from Booth either side of lunch saw momentum swing the way of the visitors.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eHowever, Raine had other ideas and picked up his 20th First Class half-century at the Banks Homes Riverside and combined well with David Bedingham for a partnership worth 88 to help the hosts set a target of 339 after finishing their second innings on 276 for eight. Warwickshire began their chase late on and finished on 12 without loss, 327 behind the target.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWarwickshire kicked off the day on 287 for eight, with Booth unbeaten on 50 and he resumed alongside Ethan Bamber. The pair frustrated Durham in the early stages of play, taking Warwickshire past 300 and to a second batting bonus point.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe resistance of Warwickshire was broken as Potts finally got a first innings wicket when Bamber departed for 21 after he edged one to Colin Ackermann at second slip. The final wicket fell soon after as Doggett bowled Vishwa Fernando for one, to hand Warwickshire a first innings total of 325.\nAlex Lees and first innings centurion Ben McKinney began Durham\u0026#39;s pursuit of building their lead of 62, but Bears bowlers Bamber and Fernando kept things tight.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eLees started to look good as he whipped an Ed Barnard delivery to the legside boundary for four and he followed that up in the same over with a lovely straight drive. However, Booth broke the Durham opening partnership as he got skipper Lees LBW for 32 and the Bears bowler struck again as he got Emilio Gay LBW.\nBooth then had another shortly after lunch as he produced a pearler of a delivery which knocked out two of Ackermann\u0026#39;sstumps and in the same over Ollie Robinson edged a delivery from the 24-year-old to Rob Yates at second slip to leave the hosts in trouble.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBamber joined in on the action as he got Will Rhodes LBW for\n18. Despite the difficult situation he found himself in, Raine looked to be positive when he arrived at the crease, while McKinney remained solid as he did in the first innings.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRaine continued to attack as he pulled a short ball from Fernando to the boundary, but the Bears picked up the vital wicket of McKinney for 33 as he feathered a Barnard ball through to Kai Smith.\nThat brought Bedingham to the crease, who was assisted by runner Ackermann due to a toe injury sustained in the first innings. Despite the injury, the South African played some delightful shots and had no problems finding the boundary.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRaine then reached his 50 from 88 balls, and he produced an inventive ramp shot which went past third man for four just a few balls later. The wounded Bedingham showed no signs of his injury as he smashed back-to-back fours to the legside boundary off the bowling of Booth.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRaine was then dropped by Alex Davies at slip on 55, after he nicked a delivery from Taz Ali. However, there was no mistake made in the field for David Bedingham as Bamber got his second of the innings when the Durham man picked out Dan Mousley at deep square and he had to depart for a well made 45.\nRaine continued to build the lead along with Potts and they took it over 300, with the latter playing a glorious straight drive for four.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBut Raine departed for 81 shorty after as Yates got him LBW after he was hit on the pads while attempting a sweep.\nPotts and Daniel Hogg continued to add vital runs for the hosts, with both hitting maximums as they set up a declaration, which came with four overs left in the day. Openers Yates and Davies saw the visitors through to close, with a big job ahead of them on day four.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/ask\"\u003e\u003cimg width=\"135\" alt=\"AskESPNcricinfo Logo\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eInstant answers to T20 questions\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-13T18:43:00Z",
  "modifiedTime": null
}
