{
  "id": "321896a3-0a64-4edd-9cf8-71a1f97d2656",
  "title": "What's in McCullum's in-tray as England white-ball coach?",
  "link": "https://www.bbc.com/sport/cricket/articles/cm27rzdnlppo",
  "description": "Brendon McCullum will take over the England white-ball teams in the new year but what are the key issues he faces in the job?",
  "author": "",
  "published": "Mon, 18 Nov 2024 00:48:48 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Sam Drury",
  "length": 9323,
  "excerpt": "Brendon McCullum will take over the England white-ball teams in the new year but what are the key issues he faces in the job?",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "What's in McCullum's in-tray as England white-ball coach?Image source, Getty ImagesImage caption, Brendon McCullum begins his England white-ball duties in JanuaryEoin Morgan's England had one goal.Between 2015 and 2019, everything was geared towards one crowning achievement: becoming world champions.A T20 World Cup triumph followed in 2022 but more than five years on from that unforgettable day at Lord's, a state of malaise has engulfed the England limited-overs side once more.Head coach Matthew Mott stepped down in July after his team failed to defend either of their world titles, with Test boss Brendon McCullum confirmed as his successor.However, with the New Zealander only assuming those duties in January, the team has been somewhat in limbo in the intervening months.But now, with a typically up and down tour of the Caribbean at an end, the next time England turn out in white-ball cricket will be as a McCullum outfit.He is the man the England and Wales Cricket Board have tasked with providing purpose and direction to a team that has lost its way, but what is in McCullum's white-ball in-tray?Getting the best out of ButtlerImage source, Getty ImagesImage caption, Jos Buttler took over from Eoin Morgan as England white-ball captain in 2022Jos Buttler was given the unenviable task of taking over from Morgan as white-ball skipper in 2022.While he promptly won the T20 World Cup in his first tournament in charge, two failed title defences later have left him often cutting a disconsolate figure.So much so that McCullum has said part of his role is to cheer up Buttler, who he said had been \"miserable\" at times.Perhaps the best way of putting a smile back on the face of the England skipper, who admitted he feared losing the captaincy following the T20 World Cup in June, is to get the best out of him both with the bat and as captain.Moves have already been made in that regard with Buttler giving up the wicketkeeping gloves and dropping down to bat at three in the T20 series against West Indies.\"I enjoyed it [being captain without keeping], I felt I had a bit more time and it was nice to be out there running around and being closer to the bowlers,\" Buttler said after the series.\"I got everything I wanted to out of doing that.\"He made a brilliant 83 from 45 balls batting at three in the second T20 against West Indies.How Buttler is used in ODIs is perhaps the more intriguing decision McCullum has to make.His skills breaking down a chase have seen him used in the middle order throughout his career and that is something England would be loathe to lose but there is no doubt Buttler could do some damage at the top of the order.A new role for the start of a new era?Priorities and fitting in Test playersImage source, Getty ImagesImage caption, Ben Stokes and Joe Root have not played a limited-overs match for England since the 2023 World CupAs England built their world champion 50-over team in the years leading up to 2019, white-ball - and, in particular, 50-over - cricket was the priority.A year out from an away Ashes series, seen by many as the culmination of the Bazball journey the red-ball side have gone on under McCullum and Ben Stokes, that is not the case now.As a result, one of McCullum's biggest challenges will be getting his best XI on the field in white-ball games - or even getting enough time with the players at his disposal to assess what his best XI actually is.It should come as no surprise that England's white-ball results have dropped off at the same time as they have so regularly had to do without their Test stars.Joe Root, for example, has played just 28 ODIs in more than five years since the 2019 World Cup. In the 18 months prior to that tournament he played 35.The Yorkshireman was one of a number of Test players absent from the tour of the Caribbean, alongside Harry Brook, Ben Duckett, Jamie Smith and Gus Atkinson to name but a few.Then there is Ben Stokes: hero in England's two most recent World Cup finals.He's not played a limited-overs match for England since the 2023 World Cup but has said he will return to the fold if asked by McCullum.At 33, he remains a match-winner with the bat at least - his last ODI wicket came in March 2021 - but given he is less than a year on from surgery on his knee and his importance as leader of the Test side, do England want to add to his workload?\"The skipper and I haven’t spoken, but I'm assuming he's all in. He seems like that sort of bloke,\" McCullum said in September, perhaps hinting at the answer to that question.\"He loves big moments and big stages.\"Given that Duckett, Root, Brook, Stokes and Smith could quite conceivably make up five of England's top seven in 50-over cricket, McCullum's job of balancing rest for his Test players with playing time to establish roles within his white-ball side could be nigh-on impossible.A slightly more forgiving schedule in 2025 compared to previous years will help but, regardless, it seems likely that allowances will have to be made when it comes to three-format players such as Brook or, potentially, Jofra Archer.Picking a balanced bowling attackImage source, Getty ImagesImage caption, Saqib Mahmood was named player of the T20 series after taking nine wickets against West IndiesStrength in depth. That, we are told, is crucial when building a winning team.Well, when it comes to white-ball seam bowlers, England have certainly got depth but who makes up the first-choice bowling unit is anybody's guess.Archer is the frontline seamer, capable of bowling at any stage of the innings in either ODIs or T20s, and the ever-impressive Adil Rashid remains untouchable when it comes to England spinners.Beyond that, it is a choice of three or four from goodness knows how many.When fit, Mark Wood is likely to be one but, like Archer, he could find himself wrapped in cotton wool as next winter's Ashes draws nearer.After establishing himself in the Test side, Atkinson has gone a year without playing an international white-ball game while England look to have moved past Chris Woakes in the shorter formats.Matthew Potts has had his moments in ODI cricket, Brydon Carse looks the closest to being able to replicate the 'Liam Plunkett role' of middle overs enforcer/ partnership breaker, while Reece Topley and Sam Curran offer very different left-arm options.Then you've got John Turner, Olly Stone and Jamie Overton.The big winner from the West Indies tour has been Saqib Mahmood, who took nine wickets at 10.55 with an economy rate of just 6.33 as he was named player of the series in the T20s.Eight of those wickets came in the powerplay; a record for a bowler in a bilateral T20 series, and a boost for an England side who struggled to make those early breakthroughs at the T20 World Cup earlier in the year.\"I feel really free in this team now. It feels like my spot,\" Mahmood said after the third T20 in St Lucia.Bethell and developing a new generationImage source, Getty ImagesImage caption, Jacob Bethell had a strike-rate of 173.97 in the T20 series against West IndiesThe McCullum white-ball era may not officially start for another few weeks but series against Australia and West Indies have provided a stepping stone.The lengthy list of absentees gave Liam Livingstone, Potts and Mahmood to name but three a chance to remind fans what they're capable of.Meanwhile, new talents have also been given their chance to impress, most notably Barbados-born Jacob Bethell.The 21-year-old left-hander came in with a burgeoning reputation after shining for Birmingham Bears in the T20 Blast and Birmingham Phoenix in The Hundred.In just his second T20I, he took Australia leg-spinner Adam Zampa for 20 in an over to help England to victory in Cardiff and has not looked back.Bethell now has three international fifties to his name already, including two in the T20 series against West Indies, in which he averaged 127 - helped by only being dismissed once in four innings - and boasted a strike-rate of 173.97.There have just been glimpses so far but it is little wonder there is such excitement around a player for whom clean ball-striking and an ability to clear the ropes seems to come so naturally.Bethell's Warwickshire team-mate Dan Mousley has also shown his promise with both bat and ball.After making a composed half-century in the ODI series, the all-rounder dumbfounded West Indies skipper Rovman Powell with his very quick and unique spin bowling in the second T20.There were also debuts in both 50 and 20-over formats for Turner, with the 23-year-old seamer doing enough to keep himself in England's thinking moving forward.Early test at the Champions TrophyPlenty then for McCullum to get stuck into come the new year but time is of the essence.It is straight in at the deep end for the 43-year-old as England travel to face India, starting in late January.A five-match ODI series concludes on 12 February, just a week before the Champions Trophy in Pakistan is scheduled to start.While there is undoubtedly work to be done to make either side genuine contenders for a global title, it is the ODI outfit that has looked most disjointed.Since Buttler replaced Morgan as captain, they have won just one of six bilateral series away from home.McCullum will have six weeks to try and get them ready to compete in Pakistan.More on this story",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat\u0026#39;s in McCullum\u0026#39;s in-tray as England white-ball coach?\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"England coach Brendon McCullum\" loading=\"eager\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/44f0/live/d1a8bd10-a445-11ef-b819-cf82b4288c1b.jpg 976w\" width=\"3840\" height=\"2159.277543648405\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eBrendon McCullum begins his England white-ball duties in January\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEoin Morgan\u0026#39;s England had one goal.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBetween 2015 and 2019, everything was geared towards one crowning achievement: becoming world champions.\u003c/p\u003e\u003cp\u003eA T20 World Cup triumph followed in 2022 but more than five years on from that unforgettable day at Lord\u0026#39;s, a state of malaise has engulfed the England limited-overs side once more.\u003c/p\u003e\u003cp\u003eHead coach \u003ca href=\"https://www.bbc.com/sport/cricket/articles/cz9xz36ql00o\"\u003eMatthew Mott stepped down in July\u003c/a\u003e after his team failed to defend either of their world titles, with Test boss Brendon McCullum confirmed as his successor.\u003c/p\u003e\u003cp\u003eHowever, with the New Zealander only assuming those duties in January, the team has been somewhat in limbo in the intervening months.\u003c/p\u003e\u003cp\u003eBut now, with a typically up and down tour of the Caribbean at an end, the next time England turn out in white-ball cricket will be as a McCullum outfit.\u003c/p\u003e\u003cp\u003eHe is the man the England and Wales Cricket Board have tasked with providing purpose and direction to a team that has lost its way, but what is in McCullum\u0026#39;s white-ball in-tray?\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Getting-the-best-out-of-Buttler\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eGetting the best out of Buttler\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eJos Buttler took over from Eoin Morgan as England white-ball captain in 2022\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eJos Buttler was given the unenviable task of taking over from Morgan as white-ball skipper in 2022.\u003c/p\u003e\u003cp\u003eWhile he promptly won the T20 World Cup in his first tournament in charge, two failed title defences later have left him often cutting a disconsolate figure.\u003c/p\u003e\u003cp\u003eSo much so that McCullum has said part of his role is to cheer up Buttler, who he said had been \u0026#34;miserable\u0026#34; at times.\u003c/p\u003e\u003cp\u003ePerhaps the best way of putting a smile back on the face of the England skipper, who admitted he \u003ca href=\"https://www.bbc.com/sport/cricket/articles/c1dpx2dxeklo\"\u003efeared losing the captaincy\u003c/a\u003e following the T20 World Cup in June, is to get the best out of him both with the bat and as captain.\u003c/p\u003e\u003cp\u003eMoves have already been made in that regard with Buttler giving up the wicketkeeping gloves and dropping down to bat at three in the T20 series against West Indies.\u003c/p\u003e\u003cp\u003e\u0026#34;I enjoyed it [being captain without keeping], I felt I had a bit more time and it was nice to be out there running around and being closer to the bowlers,\u0026#34; Buttler said after the series.\u003c/p\u003e\u003cp\u003e\u0026#34;I got everything I wanted to out of doing that.\u0026#34;\u003c/p\u003e\u003cp\u003eHe made a brilliant 83 from 45 balls batting at three in the second T20 against West Indies.\u003c/p\u003e\u003cp\u003eHow Buttler is used in ODIs is perhaps the more intriguing decision McCullum has to make.\u003c/p\u003e\u003cp\u003eHis skills breaking down a chase have seen him used in the middle order throughout his career and that is something England would be loathe to lose but there is no doubt Buttler could do some damage at the top of the order.\u003c/p\u003e\u003cp\u003eA new role for the start of a new era?\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Priorities-and-fitting-in-Test-players\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003ePriorities and fitting in Test players\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eBen Stokes and Joe Root have not played a limited-overs match for England since the 2023 World Cup\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAs England built their world champion 50-over team in the years leading up to 2019, white-ball - and, in particular, 50-over - cricket was the priority.\u003c/p\u003e\u003cp\u003eA year out from an away Ashes series, seen by many as the culmination of the Bazball journey the red-ball side have gone on under McCullum and Ben Stokes, that is not the case now.\u003c/p\u003e\u003cp\u003eAs a result, one of McCullum\u0026#39;s biggest challenges will be getting his best XI on the field in white-ball games - or even getting enough time with the players at his disposal to assess what his best XI actually is.\u003c/p\u003e\u003cp\u003eIt should come as no surprise that England\u0026#39;s white-ball results have dropped off at the same time as they have so regularly had to do without their Test stars.\u003c/p\u003e\u003cp\u003eJoe Root, for example, has played just 28 ODIs in more than five years since the 2019 World Cup. In the 18 months prior to that tournament he played 35.\u003c/p\u003e\u003cp\u003eThe Yorkshireman was one of a number of Test players absent from the tour of the Caribbean, alongside Harry Brook, Ben Duckett, Jamie Smith and Gus Atkinson to name but a few.\u003c/p\u003e\u003cp\u003eThen there is Ben Stokes: hero in England\u0026#39;s two most recent World Cup finals.\u003c/p\u003e\u003cp\u003eHe\u0026#39;s not played a limited-overs match for England since the 2023 World Cup but has said he will return to the fold if asked by McCullum.\u003c/p\u003e\u003cp\u003eAt 33, he remains a match-winner with the bat at least - his last ODI wicket came in March 2021 - but given he is less than a year on from surgery on his knee and his importance as leader of the Test side, do England want to add to his workload?\u003c/p\u003e\u003cp\u003e\u0026#34;The skipper and I haven’t spoken, but I\u0026#39;m assuming he\u0026#39;s all in. He seems like that sort of bloke,\u0026#34; McCullum said in September, perhaps hinting at the answer to that question.\u003c/p\u003e\u003cp\u003e\u0026#34;He loves big moments and big stages.\u0026#34;\u003c/p\u003e\u003cp\u003eGiven that Duckett, Root, Brook, Stokes and Smith could quite conceivably make up five of England\u0026#39;s top seven in 50-over cricket, McCullum\u0026#39;s job of balancing rest for his Test players with playing time to establish roles within his white-ball side could be nigh-on impossible.\u003c/p\u003e\u003cp\u003eA slightly more forgiving schedule in 2025 compared to previous years will help but, regardless, it seems likely that allowances will have to be made when it comes to three-format players such as Brook or, potentially, Jofra Archer.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Picking-a-balanced-bowling-attack\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003ePicking a balanced bowling attack\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eSaqib Mahmood was named player of the T20 series after taking nine wickets against West Indies\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eStrength in depth. That, we are told, is crucial when building a winning team.\u003c/p\u003e\u003cp\u003eWell, when it comes to white-ball seam bowlers, England have certainly got depth but who makes up the first-choice bowling unit is anybody\u0026#39;s guess.\u003c/p\u003e\u003cp\u003eArcher is the frontline seamer, capable of bowling at any stage of the innings in either ODIs or T20s, and the ever-impressive Adil Rashid remains untouchable when it comes to England spinners.\u003c/p\u003e\u003cp\u003eBeyond that, it is a choice of three or four from goodness knows how many.\u003c/p\u003e\u003cp\u003eWhen fit, Mark Wood is likely to be one but, like Archer, he could find himself wrapped in cotton wool as next winter\u0026#39;s Ashes draws nearer.\u003c/p\u003e\u003cp\u003eAfter establishing himself in the Test side, Atkinson has gone a year without playing an international white-ball game while England look to have moved past Chris Woakes in the shorter formats.\u003c/p\u003e\u003cp\u003eMatthew Potts has had his moments in ODI cricket, Brydon Carse looks the closest to being able to replicate the \u0026#39;Liam Plunkett role\u0026#39; of middle overs enforcer/ partnership breaker, while Reece Topley and Sam Curran offer very different left-arm options.\u003c/p\u003e\u003cp\u003eThen you\u0026#39;ve got John Turner, Olly Stone and Jamie Overton.\u003c/p\u003e\u003cp\u003eThe big winner from the West Indies tour has been Saqib Mahmood, who took nine wickets at 10.55 with an economy rate of just 6.33 as he was named player of the series in the T20s.\u003c/p\u003e\u003cp\u003eEight of those wickets came in the powerplay; a record for a bowler in a bilateral T20 series, and a boost for an England side who struggled to make those early breakthroughs at the T20 World Cup earlier in the year.\u003c/p\u003e\u003cp\u003e\u0026#34;I feel really free in this team now. It feels like my spot,\u0026#34; Mahmood said after the third T20 in St Lucia.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Bethell-and-developing-a-new-generation\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eBethell and developing a new generation\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eJacob Bethell had a strike-rate of 173.97 in the T20 series against West Indies\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe McCullum white-ball era may not officially start for another few weeks but series against Australia and West Indies have provided a stepping stone.\u003c/p\u003e\u003cp\u003eThe lengthy list of absentees gave Liam Livingstone, Potts and Mahmood to name but three a chance to remind fans what they\u0026#39;re capable of.\u003c/p\u003e\u003cp\u003eMeanwhile, new talents have also been given their chance to impress, most notably Barbados-born Jacob Bethell.\u003c/p\u003e\u003cp\u003eThe 21-year-old left-hander came in with a burgeoning reputation after shining for Birmingham Bears in the T20 Blast and Birmingham Phoenix in The Hundred.\u003c/p\u003e\u003cp\u003eIn just his second T20I, he took Australia leg-spinner Adam Zampa for 20 in an over to help England to victory in Cardiff and has not looked back.\u003c/p\u003e\u003cp\u003eBethell now has three international fifties to his name already, including two in the T20 series against West Indies, in which he averaged 127 - helped by only being dismissed once in four innings - and boasted a strike-rate of 173.97.\u003c/p\u003e\u003cp\u003eThere have just been glimpses so far but it is little wonder there is such excitement around a player for whom clean ball-striking and an ability to clear the ropes seems to come so naturally.\u003c/p\u003e\u003cp\u003eBethell\u0026#39;s Warwickshire team-mate Dan Mousley has also shown his promise with both bat and ball.\u003c/p\u003e\u003cp\u003eAfter making a composed half-century in the ODI series, the all-rounder dumbfounded West Indies skipper Rovman Powell with his very quick and unique spin bowling in the second T20.\u003c/p\u003e\u003cp\u003eThere were also debuts in both 50 and 20-over formats for Turner, with the 23-year-old seamer doing enough to keep himself in England\u0026#39;s thinking moving forward.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Early-test-at-the-Champions-Trophy\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eEarly test at the Champions Trophy\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePlenty then for McCullum to get stuck into come the new year but time is of the essence.\u003c/p\u003e\u003cp\u003eIt is straight in at the deep end for the 43-year-old as England travel to face India, starting in late January.\u003c/p\u003e\u003cp\u003eA five-match ODI series concludes on 12 February, just a week before the Champions Trophy in Pakistan is scheduled to start.\u003c/p\u003e\u003cp\u003eWhile there is undoubtedly work to be done to make either side genuine contenders for a global title, it is the ODI outfit that has looked most disjointed.\u003c/p\u003e\u003cp\u003eSince Buttler replaced Morgan as captain, they have won just one of six bilateral series away from home.\u003c/p\u003e\u003cp\u003eMcCullum will have six weeks to try and get them ready to compete in Pakistan.\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-18T00:38:36.654Z",
  "modifiedTime": null
}
