{
  "id": "3d61c187-c96b-4ebe-8872-0e4acdb6a88b",
  "title": "\"Bit Of Panic\": Gill's Admission On India's Collapse On Day 1 of 3rd Test",
  "link": "https://sports.ndtv.com/cricket/there-was-a-bit-of-panic-shubman-gills-admission-on-indias-collapse-on-day-1-of-3rd-test-6930111",
  "description": "India suffered \"a bit of panic\" at the end of opening day but \"one good partnership\" of 70-80 runs on third morning should see the hosts through, said Gill.",
  "author": "",
  "published": "Sat, 02 Nov 2024 22:26:21 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "",
  "length": 4318,
  "excerpt": "India suffered \"a bit of panic\" at the end of opening day but \"one good partnership\" of 70-80 runs on third morning should see the hosts through, said Gill.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "India vs New Zealand: Shubman Gill© AFP Shubman Gill believes that revisiting all the technical work that he did before the five-Test series against England earlier this year helped him find his bearings during an impressive knock of 90 on a rank turner that has put India in an advantageous position against New Zealand in the third and final Test here on Saturday. Gill and Rishabh Pant's attacking 60 gave India a 28-run lead after which New Zealand ended the second day at 171 for 9 in their second innings with a lead of 143. “Yes, definitely it's one of my better knocks that I've played in Test cricket. In lead up to this Test, it was all about me working on the areas that I've worked before the England series that we played,” Gill said at the post-match press conference. “In that (England) series, I was batting at my best against spinners and just to be able to go back into that mindset and what my positions were while playing spinners, that is what I was trying to replicate before this match in practice.” “The conversation with the coach was just having more repetitions on what I think is the best idea for me to be able to play spinners,” he added.Gill credited having a clear mindset while batting in pressure situation on a turning track at the start of day two worked well for him.“I was honestly trying to have fun. I love batting, if I try to think of it as just going out there and having another opportunity to bat for the maximum amount that I can, that is what I was thinking,” he said.“I was not trying to put too much pressure on myself (by) thinking I have to score these many runs. I was trying to have fun in the middle and enjoy that moment, even if it was difficult.” “Because you don't get to play that many Test matches. I just feel when I'm batting there, if I would put too much pressure on myself, then I'm losing out on the fun of the art of batting,” he said.Gill said putting pressure on the New Zealand bowlers was an approach that worked well during his partnership with Pant.“When you put the bowlers under pressure, it is difficult for them to bowl in that area consistently and that's what we talked about,” he said.He credited Pant for releasing pressure on him.“The way Rishabh came in and started hitting those boundaries, in that particular session they were not very consistent with their line and length so that's how we were able to cash in.” Gill said he emphasizes on knowing when to use the sweep and the reverse sweep shots.“You play these shots to move the fielders out of their place — the fielders that are in the catching position,” he said.“Yesterday I played sweeps and the fielders where I wanted the gaps, For me, it's all about having those shots, but playing them when I know (they are required to be played) is absolutely necessary.”India suffered “a bit of panic” at the end of opening day but “one good partnership” of 70-80 runs on third morning should see the hosts through, said Gill.“Yesterday, yes, there was a bit of panic, definitely,” Gill told media after stumps on Day Two after his 90-run knock helped India take the lead.“But this is what Test cricket is all about. There are moments where you think everything is rattled and then there are moments like (when) we came this morning and we had a great first hour, hour-and-a-half,” added Gill, who shared a 96-run stand with Pant for the fourth wicket.With India looking to bowl out New Zealand and chase a target under 150, Gill said the team would need one partnership to get over the line.“It's all about one good partnership. When you are chasing a total which is around 150-160, if you have one good partnership of 70-80 runs, the match is done and dusted,” he said.“That is what the conversation will be among the batters, to have one good partnership. For the fielding team, once there is a 70-80 run partnership when you are chasing 150, the body language of the opposition also drops,” he said. Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2024-11/crsj7huo_shubman-gill_625x300_02_November_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                            \u003cp\u003e\u003cimg width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2024-11/crsj7huo_shubman-gill_625x300_02_November_24.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"\u0026#34;There Was A Bit Of Panic\u0026#34;: Shubman Gill\u0026#39;s Admission On India\u0026#39;s Collapse On Day 1 of 3rd Test vs New Zealand\"/\u003e\n                                                            \u003c/p\u003e\n                                                            \u003cp\u003eIndia vs New Zealand: Shubman Gill\u003cspan\u003e© AFP\u003c/span\u003e\u003c/p\u003e\n                                \u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n                                        \n                                                \u003cp\u003e\u003ca href=\"https://sports.ndtv.com/cricket/players/108578-shubman-gill-playerprofile\" title=\"Shubman Gill\"\u003eShubman Gill\u003c/a\u003e believes that revisiting all the technical work that he did before the five-Test series against England earlier this year helped him find his bearings during an impressive knock of 90 on a rank turner that has put India in an advantageous position against New Zealand in the third and final Test here on Saturday. Gill and \u003ca href=\"https://sports.ndtv.com/cricket/players/107048-rishabh-pant-playerprofile\" title=\"Rishabh Pant\"\u003eRishabh Pant\u003c/a\u003e\u0026#39;s attacking 60 gave India a 28-run lead after which New Zealand ended the second day at 171 for 9 in their second innings with a lead of 143. “Yes, definitely it\u0026#39;s one of my better knocks that I\u0026#39;ve played in Test cricket. In lead up to this Test, it was all about me working on the areas that I\u0026#39;ve worked before the England series that we played,” Gill said at the post-match press conference.\u003c/p\u003e\n\n\u003cp\u003e“In that (England) series, I was batting at my best against spinners and just to be able to go back into that mindset and what my positions were while playing spinners, that is what I was trying to replicate before this match in practice.” “The conversation with the coach was just having more repetitions on what I think is the best idea for me to be able to play spinners,” he added.\u003c/p\u003e\u003cp\u003eGill credited having a clear mindset while batting in pressure situation on a turning track at the start of day two worked well for him.\u003c/p\u003e\u003cp\u003e“I was honestly trying to have fun. I love batting, if I try to think of it as just going out there and having another opportunity to bat for the maximum amount that I can, that is what I was thinking,” he said.\u003c/p\u003e\u003cp\u003e“I was not trying to put too much pressure on myself (by) thinking I have to score these many runs. I was trying to have fun in the middle and enjoy that moment, even if it was difficult.” “Because you don\u0026#39;t get to play that many Test matches. I just feel when I\u0026#39;m batting there, if I would put too much pressure on myself, then I\u0026#39;m losing out on the fun of the art of batting,” he said.\u003c/p\u003e\u003cp\u003eGill said putting pressure on the New Zealand bowlers was an approach that worked well during his partnership with Pant.\u003c/p\u003e\u003cp\u003e“When you put the bowlers under pressure, it is difficult for them to bowl in that area consistently and that\u0026#39;s what we talked about,” he said.\u003c/p\u003e\u003cp\u003eHe credited Pant for releasing pressure on him.\u003c/p\u003e\u003cp\u003e“The way Rishabh came in and started hitting those boundaries, in that particular session they were not very consistent with their line and length so that\u0026#39;s how we were able to cash in.” Gill said he emphasizes on knowing when to use the sweep and the reverse sweep shots.\u003c/p\u003e\u003cp\u003e“You play these shots to move the fielders out of their place — the fielders that are in the catching position,” he said.\u003c/p\u003e\u003cp\u003e“Yesterday I played sweeps and the fielders where I wanted the gaps, For me, it\u0026#39;s all about having those shots, but playing them when I know (they are required to be played) is absolutely necessary.”\u003c/p\u003e\u003cp\u003eIndia suffered “a bit of panic” at the end of opening day but “one good partnership” of 70-80 runs on third morning should see the hosts through, said Gill.\u003c/p\u003e\u003cp\u003e“Yesterday, yes, there was a bit of panic, definitely,” Gill told media after stumps on Day Two after his 90-run knock helped India take the lead.\u003c/p\u003e\u003cp\u003e“But this is what Test cricket is all about. There are moments where you think everything is rattled and then there are moments like (when) we came this morning and we had a great first hour, hour-and-a-half,” added Gill, who shared a 96-run stand with Pant for the fourth wicket.\u003c/p\u003e\u003cp\u003eWith India looking to bowl out New Zealand and chase a target under 150, Gill said the team would need one partnership to get over the line.\u003c/p\u003e\u003cp\u003e“It\u0026#39;s all about one good partnership. When you are chasing a total which is around 150-160, if you have one good partnership of 70-80 runs, the match is done and dusted,” he said.\u003c/p\u003e\u003cp\u003e“That is what the conversation will be among the batters, to have one good partnership. For the fielding team, once there is a 70-80 run partnership when you are chasing 150, the body language of the opposition also drops,” he said.\u003c/p\u003e\n\n                                            \n                                            \n                                        \n                                            \u003cdiv\u003e\n                                                \u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n                                                \n                                            \u003c/div\u003e\n                                        \n\n                                        \n                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-02T22:26:21+05:30",
  "modifiedTime": null
}
