{
  "id": "3dd1f024-1a15-4e9a-b4fc-3897588ea075",
  "title": "Bethell has proved he belongs, says Stokes",
  "link": "https://www.bbc.com/sport/cricket/articles/cdekke69enno",
  "description": "Jacob Bethell has proved he belongs in international cricket with his runs against New Zealand, according to England captain Ben Stokes.",
  "author": "",
  "published": "Sun, 08 Dec 2024 10:39:34 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Stephan Shemilt",
  "length": 3256,
  "excerpt": "Jacob Bethell has proved he belongs in international cricket with his runs against New Zealand, according to England captain Ben Stokes.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Jacob Bethell has proved he belongs in international cricket with his runs against New Zealand, according to England captain Ben Stokes.Bethell, 21, was given a Test debut batting at number three for the first time in his first-class career in the series opener in Christchurch and made an unbeaten 50.The left-hander followed up with 96 in the series-clinching 323-run win in the second Test in Wellington.\"I'm pretty sure there were a lot of doubters about the role we brought him into for that first Test match,\" Stokes told BBC Sport.\"You've got a young lad with so much potential and so much talent, why not let him go out there and expose himself to Test cricket at its toughest?\"In Wellington, Bethell fell four runs short of becoming the youngest England batter for 85 years to score a Test century when he edged behind off Tim Southee.\"I was devastated for him to not get that three figures,\" added Stokes. \"I walked in and I said to him: 'It's only four runs, isn't it?'\"His response was: 'Yeah, but it would have been flair if I smacked that through the covers to bring it up.' Class. I think he's proved a lot and proved why we rate him so highly.\"Bethell's chance was originally earmarked for Jordan Cox. Cox was due to keep wicket in place of regular gloveman Jamie Smith, who has missed the tour on paternity leave.When Cox broke his thumb in the nets, regular number three Ollie Pope covered as keeper and slid to number six, opening up the slot for Bethell.Before the Wellington Test, Stokes said England will revert to their usual formation in the home summer, with Pope at three and Smith keeping wicket.But Bethell's success has given England options. He could stay at three or open in place of the struggling Zak Crawley. Pope could retain the gloves, giving flexibility to where Smith bats.Asked if Bethell's runs have given him a selection headache, Stokes replied: \"No, I don't see it like that.\"If it hadn't have gone well for him in those first two Test matches, that wouldn't have changed anyone's mind in our dressing room of him as a player.\"Harry Brook was named player of the match in Wellington for his first-innings 123, his third century of the winter.The Yorkshireman did not field on Sunday, when England bowled out New Zealand for 259, because of an ankle problem sustained playing football.Brook said his ankle is \"a little bit sore\" and \"hopefully\" he will be fit for the third and final Test in Hamilton on Saturday (22:00 GMT, Friday).England's series win is their first away from home in two years and their first in New Zealand since 2008.Victory in Hamilton would leave them as only the third visiting team to win a three-match series 3-0 in this country.For New Zealand, heavy defeats in each of the two Tests against England come after a historic 3-0 win in India, arguably their greatest performance in a Test series.\"We'll head to Hamilton and if we are able to get in a position of strength, hopefully we're able to put a foot on the throat and put them under a bit of pressure too,\" said home captain Tom Latham.On the prospect of making changes to his team, Latham said: \"We'll have to wait until we get to Hamilton, to decide what the surface is doing. Those conversations will be had once we get there.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/2336/live/518bc610-b55f-11ef-ae4a-3915664d7901.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eJacob Bethell has proved he belongs in international cricket with his runs against New Zealand, according to England captain Ben Stokes.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBethell, 21, was given a Test debut batting at number three for the first time in his first-class career in the series opener in Christchurch and made an unbeaten 50.\u003c/p\u003e\u003cp\u003eThe left-hander followed up with 96 in the series-clinching 323-run win in the second Test in Wellington.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m pretty sure there were a lot of doubters about the role we brought him into for that first Test match,\u0026#34; Stokes told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;You\u0026#39;ve got a young lad with so much potential and so much talent, why not let him go out there and expose himself to Test cricket at its toughest?\u0026#34;\u003c/p\u003e\u003cp\u003eIn Wellington, Bethell fell four runs short of becoming the youngest England batter for 85 years to score a Test century when he edged behind off Tim Southee.\u003c/p\u003e\u003cp\u003e\u0026#34;I was devastated for him to not get that three figures,\u0026#34; added Stokes. \u0026#34;I walked in and I said to him: \u0026#39;It\u0026#39;s only four runs, isn\u0026#39;t it?\u0026#39;\u003c/p\u003e\u003cp\u003e\u0026#34;His response was: \u0026#39;Yeah, but it would have been flair if I smacked that through the covers to bring it up.\u0026#39; Class. I think he\u0026#39;s proved a lot and proved why we rate him so highly.\u0026#34;\u003c/p\u003e\u003cp\u003eBethell\u0026#39;s chance was originally earmarked for Jordan Cox. Cox was due to keep wicket in place of regular gloveman Jamie Smith, who has missed the tour on paternity leave.\u003c/p\u003e\u003cp\u003eWhen Cox broke his thumb in the nets, regular number three Ollie Pope covered as keeper and slid to number six, opening up the slot for Bethell.\u003c/p\u003e\u003cp\u003eBefore the Wellington Test, Stokes said England will revert to their usual formation in the home summer, with Pope at three and Smith keeping wicket.\u003c/p\u003e\u003cp\u003eBut Bethell\u0026#39;s success has given England options. He could stay at three or open in place of the struggling Zak Crawley. Pope could retain the gloves, giving flexibility to where Smith bats.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAsked if Bethell\u0026#39;s runs have given him a selection headache, Stokes replied: \u0026#34;No, I don\u0026#39;t see it like that.\u003c/p\u003e\u003cp\u003e\u0026#34;If it hadn\u0026#39;t have gone well for him in those first two Test matches, that wouldn\u0026#39;t have changed anyone\u0026#39;s mind in our dressing room of him as a player.\u0026#34;\u003c/p\u003e\u003cp\u003eHarry Brook was named player of the match in Wellington for his first-innings 123, his third century of the winter.\u003c/p\u003e\u003cp\u003eThe Yorkshireman did not field on Sunday, when England bowled out New Zealand for 259, because of an ankle problem sustained playing football.\u003c/p\u003e\u003cp\u003eBrook said his ankle is \u0026#34;a little bit sore\u0026#34; and \u0026#34;hopefully\u0026#34; he will be fit for the third and final Test in Hamilton on Saturday (22:00 GMT, Friday).\u003c/p\u003e\u003cp\u003eEngland\u0026#39;s series win is their first away from home in two years and their first in New Zealand since 2008.\u003c/p\u003e\u003cp\u003eVictory in Hamilton would leave them as only the third visiting team to win a three-match series 3-0 in this country.\u003c/p\u003e\u003cp\u003eFor New Zealand, heavy defeats in each of the two Tests against England come after a historic 3-0 win in India, arguably their greatest performance in a Test series.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ll head to Hamilton and if we are able to get in a position of strength, hopefully we\u0026#39;re able to put a foot on the throat and put them under a bit of pressure too,\u0026#34; said home captain Tom Latham.\u003c/p\u003e\u003cp\u003eOn the prospect of making changes to his team, Latham said: \u0026#34;We\u0026#39;ll have to wait until we get to Hamilton, to decide what the surface is doing. Those conversations will be had once we get there.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-08T10:39:34.372Z",
  "modifiedTime": null
}
