{
  "id": "41dd6a07-1a8a-4dfb-adfa-5fec469b3912",
  "title": "धोनी : हम पावरप्ले में 60 रन बनाने की नहीं सोच सकते",
  "link": "https://www.espncricinfo.com/ci/content/story/1480740.html?ex_cid=OTC-RSS",
  "description": "धोनी ने कहा कि लगातार विकेट गंवाने के बाद एक मज़बूत स्पिन के आक्रमण के सामने वापसी करना मुश्किल था",
  "author": "",
  "published": "Fri, 11 Apr 2025 20:15:14 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ESPNcricinfo staff",
  "length": 2106,
  "excerpt": "धोनी ने कहा कि लगातार विकेट गंवाने के बाद एक मज़बूत स्पिन के आक्रमण के सामने वापसी करना मुश्किल था",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "ख़बरेंधोनी ने कहा कि लगातार विकेट गंवाने के बाद एक मज़बूत स्पिन के आक्रमण के सामने वापसी करना मुश्किल थाIPL 2025 में चेन्नई सुपर किंग्स (CSK) को मिली लगातार पांचवीं हार के बाद CSK के कप्तान महेंद्र सिंह धोनी ने कहा कि उनकी टीम को गहन चिंतन की आवश्यकता है। हालांकि धोनी ने यह भी उम्मीद जताई कि कुछ पहलुओं को अगर उनकी टीम ठीक कर ले तो हालात सुधर सकते हैं।एमएस धोनी के LBW आउट पर विवाद : किनारा लगा था या नहीं?सुनील नारायण के दम पर KKR ने दी CSK को उनकी सबसे बड़ी हारधोनी ने मैच के बाद कहा, \"सिर्फ़ आज ही नहीं इस सीज़न कई बार चीज़ें हमारे पक्ष में नहीं गई हैं। हमें देखना होगा कि हम कहां ग़लती कर रहे हैं और उन्हें सुधारना होगा। हमें गहन चिंतन की ज़रूरत है। स्थिति चुनौतीपूर्ण थी लेकिन हमें उससे निपटना चाहिए था। हमारे पास स्कोरबोर्ड पर रन नहीं थे। गेंद रुक कर आ रही थी और वैसे स्पिन आक्रमण के सामने यह मुश्किल होता है। दूसरी पारी में भी गेंद रुक रही थी। आप विकेट गंवा देते हैं तो मैच में वापस आना मुश्किल होता है।\"CSK को KKR ने बल्लेबाज़ी के लिए आमंत्रित किया था लेकिन एक बार फिर CSK की शुरुआत अच्छी नहीं रही। पावरप्ले में CSK सिर्फ़ 31 रन ही जोड़ पाई और उनके दोनों सलामी बल्लेबाज़ पवेलियन लौट चुके थे। हालांकि धोनी ने अपने सलामी बल्लेबाज़ों का बचाव किया।धोनी ने कहा, \"हमारे पास अच्छे ओपनर हैं। वो ऐसे खिलाड़ी हैं जो पारंपरिक शॉट खेलते हैं और एक्रॉस द लाइन नहीं खेलते। ज़रूरी है कि स्कोरबोर्ड को देखकर हम अपने ऊपर दबाव ना लें। कुछ बाउंड्री आने से स्कोरबोर्ड चलते रहता है। जैसा लाइन अप हमारा है, अगर हम यह सोचकर खेलें कि छह ओवर में 60 रन बनाने हैं तो काफ़ी मुश्किल हो जाता है।\"CSK की यह लगातार चेपॉक पर उनकी लगातार तीसरी हार थी, किसी एक IPL सीज़न में वह पहली बार चेपॉक पर लगातार तीन मुक़ाबले हारे हैं। KKR ने 59 गेंद रहते ही 104 का लक्ष्य हासिल कर लिया जो कि गेंदों के लिहाज़ से CSK की अब तक की सबसे बड़ी हार भी है।धोनी ने कहा, \"हमें साझेदारी बनाने और मध्य ओवरों को भुनाने की ज़रूरत है। और जब हम विकेट गंवा देते हैं तो मध्य क्रम को अलग तरह का खेल खेलना पड़ता है। कुछ चीज़ें अगर हम ठीक कर लें तो स्थिति और बेहतर हो सकती है।\"इस हार के बावजूद CSK अंक तालिका में सबसे निचले पायदान पर नहीं लुढ़की है। CSK इस समय नौवें स्थान पर है जबकि पांच मैच में चार हार के साथ सनराइज़र्स हैदराबाद (SRH) सबसे अंतिम पायदान पर है।",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/399000/399054.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/hindi\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv id=\"section-1480740\"\u003e\u003carticle data-id=\"1480740\" data-src=\"/hindi/story/ipl-2025-csk-vs-kkr-ms-dhoni-quotes-after-csk-lose-streak-continues-1480740\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/hindi/genre/news-1\" title=\"ख़बरें\"\u003e\u003cspan\u003eख़बरें\u003c/span\u003e\u003c/a\u003e\u003cp\u003eधोनी ने कहा कि लगातार विकेट गंवाने के बाद एक मज़बूत स्पिन के आक्रमण के सामने वापसी करना मुश्किल था\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/hindi/series/ipl-2025-1449924/match-schedule-fixtures-and-results\"\u003eIPL 2025\u003c/a\u003e में चेन्नई सुपर किंग्स (CSK) को मिली \u003ca href=\"https://www.espncricinfo.com/hindi/series/ipl-2025-1449924/chennai-super-kings-vs-kolkata-knight-riders-25th-match-1473462/live-cricket-score\"\u003eलगातार पांचवीं हार\u003c/a\u003e के बाद CSK के कप्तान \u003ca href=\"https://www.espncricinfo.com/cricketers/ms-dhoni-28081\"\u003eमहेंद्र सिंह धोनी\u003c/a\u003e ने कहा कि उनकी टीम को गहन चिंतन की आवश्यकता है। हालांकि धोनी ने यह भी उम्मीद जताई कि कुछ पहलुओं को अगर उनकी टीम ठीक कर ले तो हालात सुधर सकते हैं।\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/hindi/story/csk-vs-kkr-ipl-2025-ms-dhoni-lbw-stirs-up-debate-1480738\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eएमएस धोनी के LBW आउट पर विवाद : किनारा लगा था या नहीं?\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/hindi/series/ipl-2025-1449924/chennai-super-kings-vs-kolkata-knight-riders-25th-match-1473462/match-report\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eसुनील नारायण के दम पर KKR ने दी CSK को उनकी सबसे बड़ी हार\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eधोनी ने मैच के बाद कहा, \u0026#34;सिर्फ़ आज ही नहीं इस सीज़न कई बार चीज़ें हमारे पक्ष में नहीं गई हैं। हमें देखना होगा कि हम कहां ग़लती कर रहे हैं और उन्हें सुधारना होगा। हमें गहन चिंतन की ज़रूरत है। स्थिति चुनौतीपूर्ण थी लेकिन हमें उससे निपटना चाहिए था। हमारे पास स्कोरबोर्ड पर रन नहीं थे। गेंद रुक कर आ रही थी और वैसे स्पिन आक्रमण के सामने यह मुश्किल होता है। दूसरी पारी में भी गेंद रुक रही थी। आप विकेट गंवा देते हैं तो मैच में वापस आना मुश्किल होता है।\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eCSK को KKR ने बल्लेबाज़ी के लिए आमंत्रित किया था लेकिन एक बार फिर CSK की शुरुआत अच्छी नहीं रही। पावरप्ले में CSK सिर्फ़ 31 रन ही जोड़ पाई और उनके दोनों सलामी बल्लेबाज़ पवेलियन लौट चुके थे। हालांकि धोनी ने अपने सलामी बल्लेबाज़ों का बचाव किया।\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eधोनी ने कहा,  \u0026#34;हमारे पास अच्छे ओपनर हैं। वो ऐसे खिलाड़ी हैं जो पारंपरिक शॉट खेलते हैं और एक्रॉस द लाइन नहीं खेलते। ज़रूरी है कि स्कोरबोर्ड को देखकर हम अपने ऊपर दबाव ना लें। कुछ बाउंड्री आने से स्कोरबोर्ड चलते रहता है। जैसा लाइन अप हमारा है, अगर हम यह सोचकर खेलें कि छह ओवर में 60 रन बनाने हैं तो काफ़ी मुश्किल हो जाता है।\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eCSK की यह लगातार चेपॉक पर उनकी लगातार तीसरी हार थी, किसी एक IPL सीज़न में वह पहली बार चेपॉक पर लगातार तीन मुक़ाबले हारे हैं। KKR ने 59 गेंद रहते ही 104 का लक्ष्य हासिल कर लिया जो कि गेंदों के लिहाज़ से CSK की अब तक की सबसे बड़ी हार भी है।\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eधोनी ने कहा, \u0026#34;हमें साझेदारी बनाने और मध्य ओवरों को भुनाने की ज़रूरत है। और जब हम विकेट गंवा देते हैं तो मध्य क्रम को अलग तरह का खेल खेलना पड़ता है। कुछ चीज़ें अगर हम ठीक कर लें तो स्थिति और बेहतर हो सकती है।\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eइस हार के बावजूद CSK \u003ca href=\"https://www.espncricinfo.com/hindi/series/ipl-2025-1449924/points-table-standings\"\u003eअंक तालिका\u003c/a\u003e में सबसे निचले पायदान पर नहीं लुढ़की है। CSK इस समय नौवें स्थान पर है जबकि पांच मैच में चार हार के साथ सनराइज़र्स हैदराबाद (SRH) सबसे अंतिम पायदान पर है।\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-11T17:40:00Z",
  "modifiedTime": null
}
