{
  "id": "48c57b70-70e3-4042-9a17-a9913fa93396",
  "title": "Buttler captaining better than I did at times - Root",
  "link": "https://www.bbc.com/sport/cricket/articles/cj4n9p717nno",
  "description": "Batter Joe Root backs \"brilliant leader\" Jos Buttler and says the England captain is making a better fist of the job than he did at times during his tenure as Test skipper.",
  "author": "",
  "published": "Mon, 24 Feb 2025 18:00:15 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Matthew Henry",
  "length": 2254,
  "excerpt": "Batter Joe Root backs \"brilliant leader\" Jos Buttler and says the England captain is making a better fist of the job than he did at times during his tenure as Test skipper.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Batter Joe Root has backed \"brilliant leader\" Jos Buttler and says the England captain is making a better fist of the job than he did at times during his tenure as Test skipper.England likely need to beat Afghanistan on Wednesday and South Africa on Saturday to avoid a group-stage exit at the Champions Trophy.Were they to go out, it would be England's third disappointing global event since Buttler led them to the T20 World Cup title in 2022.\"He's doing so much right on the field, making good decisions and creating a really good environment for us to thrive in,\" Root said.\"He's a brilliant leader. He's the best white-ball player we've ever produced and he's got the full support of everyone within our dressing room to keep doing and keep bringing everything that he's brought so far to this team.\"Buttler's side won only three of nine matches as defending champions at the 50-over World Cup in India in 2023. Last year they reached the semi-finals in their defence of the T20 World Cup but were ultimately well beaten by India, having lost to Australia and South Africa earlier in the tournament.Root captained England in 64 Tests from 2017 to 2022 - the most of any player. He won a record 27 of those matches but ended his tenure with one win in 17 before resigning in 2022. He also suffered two heavy defeats in Ashes series in Australia.\"I certainly think that this team are doing more things right than maybe some of the teams I captained,\" Root said.England's difficult position at the Champions Trophy comes after defeat by Australia in their opening game on Saturday. They scored 351-8, with Ben Duckett making 165, but still lost by five wickets. It follows four defeats in a row in bilateral one-day international series.\"What I would say is you can be frustrated by it or you can be excited by it,\" Root said.\"The fact that we are doing a lot of things right is a good thing and that's what we have to really focus on.\"England are expected to make one change for Wednesday's match in Lahore after bowler Brydon Carse was ruled out of the tournament with a toe injury.Rehan Ahmed has been called up in his place, but the leg-spinner is not expected to arrive in Pakistan until Wednesday so Jamie Overton is most likely to replace Carse.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ef46/live/3a9f8d00-f2d7-11ef-9c1f-0b4ee7c29264.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eBatter Joe Root has backed \u0026#34;brilliant leader\u0026#34; Jos Buttler and says the England captain is making a better fist of the job than he did at times during his tenure as Test skipper.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eEngland likely need to beat Afghanistan on Wednesday and South Africa on Saturday to avoid a group-stage exit at the Champions Trophy.\u003c/p\u003e\u003cp\u003eWere they to go out, it would be England\u0026#39;s third disappointing global event since Buttler led them to the T20 World Cup title in 2022.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s doing so much right on the field, making good decisions and creating a really good environment for us to thrive in,\u0026#34; Root said.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s a brilliant leader. He\u0026#39;s the best white-ball player we\u0026#39;ve ever produced and he\u0026#39;s got the full support of everyone within our dressing room to keep doing and keep bringing everything that he\u0026#39;s brought so far to this team.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eButtler\u0026#39;s side won only three of nine matches as defending champions at the 50-over World Cup in India in 2023. \u003c/p\u003e\u003cp\u003eLast year they reached the semi-finals in their defence of the T20 World Cup but were ultimately well beaten by India, having lost to Australia and South Africa earlier in the tournament.\u003c/p\u003e\u003cp\u003eRoot captained England in 64 Tests from 2017 to 2022 - the most of any player. He won a record 27 of those matches but ended his tenure with one win in 17 before resigning in 2022. He also suffered two heavy defeats in Ashes series in Australia.\u003c/p\u003e\u003cp\u003e\u0026#34;I certainly think that this team are doing more things right than maybe some of the teams I captained,\u0026#34; Root said.\u003c/p\u003e\u003cp\u003eEngland\u0026#39;s difficult position at the Champions Trophy comes after \u003ca href=\"https://www.bbc.com/sport/cricket/articles/cly6vmnnnpjo\"\u003edefeat by Australia in their opening game on Saturday\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eThey scored 351-8, with Ben Duckett making 165, but still lost by five wickets. It follows four defeats in a row in bilateral one-day international series.\u003c/p\u003e\u003cp\u003e\u0026#34;What I would say is you can be frustrated by it or you can be excited by it,\u0026#34; Root said.\u003c/p\u003e\u003cp\u003e\u0026#34;The fact that we are doing a lot of things right is a good thing and that\u0026#39;s what we have to really focus on.\u0026#34;\u003c/p\u003e\u003cp\u003eEngland are expected to make one change for Wednesday\u0026#39;s match in Lahore after \u003ca href=\"https://www.bbc.com/sport/cricket/articles/cj4n9qp8krxo\"\u003ebowler Brydon Carse was ruled out of the tournament\u003c/a\u003e with a toe injury.\u003c/p\u003e\u003cp\u003eRehan Ahmed has been called up in his place, but the leg-spinner is not expected to arrive in Pakistan until Wednesday so Jamie Overton is most likely to replace Carse.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-24T18:00:15.427Z",
  "modifiedTime": null
}
