{
  "id": "548ce7ee-ce2c-4083-b7a9-5c9dfbd7c1e4",
  "title": "Stead calls time on seven-year tenure as New Zealand coach",
  "link": "https://www.espncricinfo.com/ci/content/story/1488985.html?ex_cid=OTC-RSS",
  "description": "Gary Stead, New Zealand men's most successful coach, bows out after seven years in the role",
  "author": "",
  "published": "Wed, 04 Jun 2025 01:07:13 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Alex Malcolm",
  "length": 4652,
  "excerpt": "Gary Stead, New Zealand men's most successful coach, bows out after seven years in the role",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsGary Stead, New Zealand men's most successful coach, bows out after seven years in the roleGary Stead bows out as New Zealand's most successful coach  •  Getty ImagesNew Zealand's most successful national coach, Gary Stead, will bow of the role at the end of the month after a seven-year tenure that included a World Test Championship (WTC) title, three global limited-overs final appearances, and a historic 3-0 Test series win in India.Stead, 53, had already stood down from the white-ball role and was given some time to consider his future with the Test side, but New Zealand Cricket (NZC) appear set to appoint one coach for all formats with Stead standing down when his contract finishes at the end of the month.He has left a huge imprint on New Zealand cricket after taking the role from Mike Hesson in 2018. Stead coached New Zealand to the ODI World Cup final in 2019 where they lost on a heartbreaking boundary countback. The 2021 WTC final win over India was New Zealand's first global title since the 2000 ICC Knockout (Champions Trophy) title. He was in charge as New Zealand got to the 2021 T20 World Cup final and the 2025 Champions Trophy final as well as two other semi-finals in the 2022 T20 World Cup and the 2023 ODI World Cup.Stead weighs future as New Zealand advertise for split head coach roles Rob Walter linked to NZ role after quitting as SA coachHay, Abbas among fresh faces on New Zealand contract listStead's crowning achievement came last year when New Zealand became the first team to clean sweep India at home in a 3-0 Test series.\"There's been some amazing memories over the past seven years based around a group of fantastic and talented people who have gone out to give their best for their country, each other and for the fans,\" Stead said. \"Brendon McCullum and Mike Hesson had left the team with strong values and a style of play, and I've just tried to build and shape that further to grow our ability to be consistent in everything we do.\"It's been nice to be competitive across all three formats and I'd like to think that, regardless of results, the opposition know the Blackcaps are a team that won't fold and will always show the grit and determination to compete.\"To work alongside some of New Zealand's best cricketers and have had a ringside seat to every training and match has been very special and an absolute honour. For a country with five million people and limited resources, we comparatively perform outstandingly well against the other powerhouses of the game.\"There was no one more hard-working and passionate about seeing the Blackcaps grow and succeed. He was always thorough in his planning and preparation and will go down as one of our best coaches, but an even better bloke\"Kane Williamson\"I am grateful to all those that have helped and supported me during my time, especially to my wife Rachel and children Alex and Libby who have sacrificed much. I also want to pay special thanks to NZC, and in particular all of the support staff I have worked with who are hands-on with the team and in the thick of things day-in and day-out.\"I'd like to wish the new coach well and the team every success in the future.\"Stead said he would initially take some time off but hopes to continue coaching in come capacity either at home or overseas. \"I'll initially take some time to refresh and recharge, but I still have the coaching bug and will look to explore opportunities at home and abroad where I can look to share what I've learned from my 30 years of professional sport as a player and coach.\"Stead's long-time captain Kane Williamson paid tribute to him as one of New Zealand's best ever coaches.\"Steady gave absolutely everything to the team,\" Williamson said. \"There was no one more hard-working and passionate about seeing the Blackcaps grow and succeed. He was always thorough in his planning and preparation and will go down as one of our best coaches, but an even better bloke.\"NZC chief executive Scott Weenick said Stead had left a lasting legacy on the Blackcaps and New Zealand cricket at large.\"Gary's been an exceptional leader for the BLACKCAPS, elevating the team to the pinnacle of world cricket with remarkable consistency and courage,\" said Weenink. \"His achievements, from the World Test Championship triumph to historic series wins abroad, have inspired the country and set a new benchmark for excellence in the New Zealand game.\"On behalf of NZC, I want to extend Gary our deepest gratitude for his dedication and commitment and wish him every success in his future endeavours.\"Alex Malcolm is an associate editor at ESPNcricinfoGet latest cricket updates on WhatsApp",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/377400/377420.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle data-id=\"1488985\" data-src=\"/story/gary-stead-calls-time-on-seven-year-tenure-as-new-zealand-coach-1488985\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eGary Stead, New Zealand men\u0026#39;s most successful coach, bows out after seven years in the role\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/alex-malcolm-382\"\u003e\u003cspan\u003e\u003cimg width=\"40\" height=\"40\" alt=\"Alex Malcolm\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_960,q_50/lsci/db/PICTURES/CMS/377400/377420.6.jpg\" alt=\"Gary Stead in a good mood before play, New Zealand vs Australia, 2nd Test, Christchurch, 2nd Day, March 9, 2024\" fetchpriority=\"auto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGary Stead bows out as New Zealand\u0026#39;s most successful coach  •  \u003cspan\u003eGetty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/team/new-zealand-5\"\u003eNew Zealand\u003c/a\u003e\u0026#39;s most successful national coach, \u003ca href=\"https://www.espncricinfo.com/cricketers/gary-stead-38403\"\u003eGary Stead\u003c/a\u003e, will bow of the role at the end of the month after a seven-year tenure that included a World Test Championship (WTC) title, three global limited-overs final appearances, and a historic 3-0 Test series win in India.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eStead, 53, had already stood down from the white-ball role and was given some time to consider his future with the Test side, but New Zealand Cricket (NZC) appear set to appoint one coach for all formats with Stead standing down when his contract finishes at the end of the month.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eHe has left a huge imprint on New Zealand cricket after taking the role from Mike Hesson in 2018. Stead coached New Zealand to the ODI World Cup final in 2019 where they lost on a heartbreaking boundary countback. The 2021 WTC final win over India was New Zealand\u0026#39;s first global title since the 2000 ICC Knockout (Champions Trophy) title. He was in charge as New Zealand got to the 2021 T20 World Cup final and the 2025 Champions Trophy final as well as two other semi-finals in the 2022 T20 World Cup and the 2023 ODI World Cup.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/gary-stead-weighs-future-as-new-zealand-advertise-for-split-head-coach-roles-1480236\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eStead weighs future as New Zealand advertise for split head coach roles \u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/rob-walter-linked-to-new-zealand-role-after-quitting-as-south-africa-coach-1479488\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eRob Walter linked to NZ role after quitting as SA coach\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/mitch-hay-muhammad-abbas-among-fresh-faces-on-new-zealand-contract-list-1488813\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eHay, Abbas among fresh faces on New Zealand contract list\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eStead\u0026#39;s crowning achievement came last year when New Zealand became the first team to clean sweep India at home in a 3-0 Test series.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;There\u0026#39;s been some amazing memories over the past seven years based around a group of fantastic and talented people who have gone out to give their best for their country, each other and for the fans,\u0026#34; Stead said. \u0026#34;Brendon McCullum and Mike Hesson had left the team with strong values and a style of play, and I\u0026#39;ve just tried to build and shape that further to grow our ability to be consistent in everything we do.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It\u0026#39;s been nice to be competitive across all three formats and I\u0026#39;d like to think that, regardless of results, the opposition know the Blackcaps are a team that won\u0026#39;t fold and will always show the grit and determination to compete.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;To work alongside some of New Zealand\u0026#39;s best cricketers and have had a ringside seat to every training and match has been very special and an absolute honour. For a country with five million people and limited resources, we comparatively perform outstandingly well against the other powerhouses of the game.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u0026#34;There was no one more hard-working and passionate about seeing the Blackcaps grow and succeed. He was always thorough in his planning and preparation and will go down as one of our best coaches, but an even better bloke\u0026#34;\u003c/p\u003e\u003ccite\u003e\u003cp\u003e\u003cb\u003eKane Williamson\u003c/b\u003e\u003c/p\u003e\u003c/cite\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I am grateful to all those that have helped and supported me during my time, especially to my wife Rachel and children Alex and Libby who have sacrificed much. I also want to pay special thanks to NZC, and in particular all of the support staff I have worked with who are hands-on with the team and in the thick of things day-in and day-out.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I\u0026#39;d like to wish the new coach well and the team every success in the future.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eStead said he would initially take some time off but hopes to continue coaching in come capacity either at home or overseas. \u0026#34;I\u0026#39;ll initially take some time to refresh and recharge, but I still have the coaching bug and will look to explore opportunities at home and abroad where I can look to share what I\u0026#39;ve learned from my 30 years of professional sport as a player and coach.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eStead\u0026#39;s long-time captain \u003ca href=\"https://www.espncricinfo.com/cricketers/kane-williamson-277906\"\u003eKane Williamson\u003c/a\u003e paid tribute to him as one of New Zealand\u0026#39;s best ever coaches.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Steady gave absolutely everything to the team,\u0026#34; Williamson said. \u0026#34;There was no one more hard-working and passionate about seeing the Blackcaps grow and succeed. He was always thorough in his planning and preparation and will go down as one of our best coaches, but an even better bloke.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eNZC chief executive Scott Weenick said Stead had left a lasting legacy on the Blackcaps and New Zealand cricket at large.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Gary\u0026#39;s been an exceptional leader for the BLACKCAPS, elevating the team to the pinnacle of world cricket with remarkable consistency and courage,\u0026#34; said Weenink. \u0026#34;His achievements, from the World Test Championship triumph to historic series wins abroad, have inspired the country and set a new benchmark for excellence in the New Zealand game.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;On behalf of NZC, I want to extend Gary our deepest gratitude for his dedication and commitment and wish him every success in his future endeavours.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAlex Malcolm is an associate editor at ESPNcricinfo\u003c/p\u003e\u003ca href=\"https://whatsapp.com/channel/0029Va5oNnUKGGGLrFKvkH3E\" title=\"Get latest cricket updates on WhatsApp\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cp\u003e\u003ci\u003e\u003c/i\u003e\u003cspan\u003eGet latest cricket updates on WhatsApp\u003c/span\u003e\u003c/p\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-04T00:50:00Z",
  "modifiedTime": null
}
