{
  "id": "5590eba5-2fbe-477b-ad1a-7b4ac159e185",
  "title": "'Frustrated' but not 'out of touch' - Markram keen to contribute more",
  "link": "https://www.espncricinfo.com/ci/content/story/1466850.html?ex_cid=OTC-RSS",
  "description": "\"It would be a completely different conversation if I was feeling quite scratchy and feeling out of touch. I'm very fortunate that that's not the case\"",
  "author": "",
  "published": "Fri, 27 Dec 2024 18:30:49 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Firdose Moonda",
  "length": 6090,
  "excerpt": "\"It would be a completely different conversation if I was feeling quite scratchy and feeling out of touch. I'm very fortunate that that's not the case\"",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "The numbers say Aiden Markram has had exactly the kind of Test year he always has. Currently on 499 runs, he averages 35.64 in 2024 which is only a fraction lower than his overall average of 35.75, and more than the 34.60 in 2021 and 33.60 in 2018, his other two profitable years. Before this match, he scored an important fifty just a game ago, but still, he came into this Test under so much pressure that his captain Temba Bavuma was asked whether he felt the need to take Markram out for a cup of coffee and check on him and Bavuma indicated that he might have.\"I look at Aiden and the struggles that he's going through and I resonate a lot with the experiences that he's going through as a player. Putting myself in his shoes, sometimes you just need someone to speak to. Not necessarily someone to tell you what to do, but just to be empathetic to whatever it is that you're going through,\" Bavuma said before the match.Bavuma went on to heap praise on Markram as a leader in the side and a mentor to the younger players and promised that when he \"gets over to the other side, that's where the satisfaction is.\"A score of 89 is not quite getting over the line, especially in a year where South African batters have collectively scored ten hundreds but Markam can appreciate the value of what he did at SuperSport Park.\"For me, it's not about me making hundreds. Obviously, making hundreds is great and it does feel good and you know you're contributing, but it's more the situation of the game that you find yourself in and when you find yourself getting out, that can frustrate you a lot,\" Markram said. \"The hundred would be fantastic if it were to happen, but it's not about Aidan Markram scoring a hundred. It's more about getting the team into a really strong position where we can hopefully win a game of cricket.\"Markram used the word \"frustrated\" several times to describe the space he finds himself in and he explained it not as someone who thinks his spot in the team is under scrutiny (sidenote: it's not) but as someone who knows he is capable of a little more.\"It was really frustrating because I feel like I've been moving well and seeing the ball nicely, but finding some really interesting ways to get out. That's more the frustrating part, but it's been quite a busy year.\"There's times where you lack a little bit of mental edge because you're playing so often and you go through a bit of mental fatigue. That's where the frustration comes from. It would be a completely different conversation if I was feeling quite scratchy and feeling out of touch. I'm very fortunate that that's not the case. I'm obviously frustrated that I haven't been scoring runs. Obviously, it plays on you as a guy who has pride in performance and wants to contribute to winning games at cricket.\"The real pressure is in the format he captains South Africa in: T20Is. In 18 matches in 2024, he averages 15.56 and has only crossed 30 once, and his form during this year's T20 World Cup was reminiscent of Bavuma's during the 2022 tournament.Then Bavuma was captain of the T20I side and in poor white-ball form which did not endear him to the South African public and explains why he has such a close understanding of the spotlight Markram has been under.And while it can be difficult for fans to separate form across formats, especially in a calendar where everything seems to morph into one cricketing monolith, it has to be said that white and red-ball forms are different and while South Africa's white-ball teams are going through a difficult time, Tests are, as Markram called them, \"a beast\", or rather, a different beast.Initially, Markram played like it was the same animal and hit ten boundaries in his first fifty runs he scored in what looked like an all-or-bust approach to the innings.Markram explained it as being down to him not having the softest hands in the game and adjusting between his instinct to attack and his understanding of the patience required on what is a fairly spicy pitch.The latter came out deeper into his knock, when he was happy to see his former under-19 team-mate Corbin Bosch take Pakistan on and worked his way from 87 to 89 in 14 balls. Markram was trying to anchor the tail, and though he ended up being dismissed before the proper fireworks began, perhaps his presence gave Bosch the confidence to play with the freedom he did.It was Markram who capped Bosch in ODIs and who has been his friend and team-mate since childhood. While they took vastly different journeys to the national side, Markram almost seemed to take more pride in what Bosch did than his own runs and the sense of genuine pride in his friend shone through.\"It looks pretty easy for him at this moment, this whole Test cricket thing, and (his innings) was a great momentum shift for us. It's a hugely valuable knock, probably worth more than a hundred,\" he said.\"He's always been a really talented guy. In the last few years, he's really put his head down, grafted and put in performances to get the chance. I'm really happy for him that he's grabbed his opportunity as he has. There's still a lot left in his tank that he has to offer and I'm glad some of the world can see what he's about.\"But to Bosch himself he said \"nothing inspirational\".\"I just told him whatever he's done to get the call-up and to get the opportunity will certainly be good enough at this level as well,\" Markram said. \"You don't want to put things in his mind that make him second-guess things and stuff like that. He's had a great debut so far and it's good for him that it started out this way.\"That's where seniority, in terms of caps, not age, comes in. As someone who Bavuma has entrusted with some of the team talks and some of the on-the-sidelines chats, Markram has also found a way to help himself.\"(As a leader), it's more just about being there for guys that need it. It's not about getting too involved,\" he said. \"Often what you say to other people can help you as well.\"Maybe this time, for him, it did.Firdose Moonda is ESPNcricinfo's correspondent for South Africa and women's cricket",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/393700/393787.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe numbers say \u003ca href=\"https://www.espncricinfo.com/cricketers/aiden-markram-600498\"\u003eAiden Markram\u003c/a\u003e has had exactly the kind of Test year he always has. Currently on 499 runs, he averages 35.64 in 2024 which is only a fraction lower than his overall average of 35.75, and more than the 34.60 in 2021 and 33.60 in 2018, his other two profitable years. Before this match, he scored an important fifty just a game ago, but still, he came into this Test under so much pressure that his captain \u003ca href=\"https://www.espncricinfo.com/cricketers/temba-bavuma-372116\"\u003eTemba Bavuma\u003c/a\u003e was asked whether he felt the need to take Markram out for a cup of coffee and check on him and Bavuma indicated that he might have.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I look at Aiden and the struggles that he\u0026#39;s going through and I resonate a lot with the experiences that he\u0026#39;s going through as a player. Putting myself in his shoes, sometimes you just need someone to speak to. Not necessarily someone to tell you what to do, but just to be empathetic to whatever it is that you\u0026#39;re going through,\u0026#34; Bavuma said before the match.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBavuma went on to heap praise on Markram as a leader in the side and a mentor to the younger players and promised that when he \u0026#34;gets over to the other side, that\u0026#39;s where the satisfaction is.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA score of 89 is not quite getting over the line, especially in a year where South African batters have collectively scored ten hundreds but Markam can appreciate the value of what he did \u003ca href=\"https://www.espncricinfo.com/series/south-africa-vs-pakistan-2024-25-1432205/south-africa-vs-pakistan-1st-test-1432217/full-scorecard\"\u003eat SuperSport Park\u003c/a\u003e.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;For me, it\u0026#39;s not about me making hundreds. Obviously, making hundreds is great and it does feel good and you know you\u0026#39;re contributing, but it\u0026#39;s more the situation of the game that you find yourself in and when you find yourself getting out, that can frustrate you a lot,\u0026#34; Markram said. \u0026#34;The hundred would be fantastic if it were to happen, but it\u0026#39;s not about Aidan Markram scoring a hundred. It\u0026#39;s more about getting the team into a really strong position where we can hopefully win a game of cricket.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMarkram used the word \u0026#34;frustrated\u0026#34; several times to describe the space he finds himself in and he explained it not as someone who thinks his spot in the team is under scrutiny (sidenote: it\u0026#39;s not) but as someone who knows he is capable of a little more.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It was really frustrating because I feel like I\u0026#39;ve been moving well and seeing the ball nicely, but finding some really interesting ways to get out. That\u0026#39;s more the frustrating part, but it\u0026#39;s been quite a busy year.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;There\u0026#39;s times where you lack a little bit of mental edge because you\u0026#39;re playing so often and you go through a bit of mental fatigue. That\u0026#39;s where the frustration comes from. It would be a completely different conversation if I was feeling quite scratchy and feeling out of touch. I\u0026#39;m very fortunate that that\u0026#39;s not the case. I\u0026#39;m obviously frustrated that I haven\u0026#39;t been scoring runs. Obviously, it plays on you as a guy who has pride in performance and wants to contribute to winning games at cricket.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe real pressure is in the format he captains South Africa in: T20Is. In 18 matches in 2024, he averages 15.56 and has only crossed 30 once, and his form during this year\u0026#39;s T20 World Cup was reminiscent of Bavuma\u0026#39;s during the 2022 tournament.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThen Bavuma was captain of the T20I side and in poor white-ball form which did not endear him to the South African public and explains why he has such a close understanding of the spotlight Markram has been under.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAnd while it can be difficult for fans to separate form across formats, especially in a calendar where everything seems to morph into one cricketing monolith, it has to be said that white and red-ball forms are different and while South Africa\u0026#39;s white-ball teams are going through a difficult time, Tests are, as Markram called them, \u0026#34;a beast\u0026#34;, or rather, a different beast.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eInitially, Markram played like it was the same animal and hit ten boundaries in his first fifty runs he scored in what looked like an all-or-bust approach to the innings.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMarkram explained it as being down to him not having the softest hands in the game and adjusting between his instinct to attack and his understanding of the patience required on what is a fairly spicy pitch.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe latter came out deeper into his knock, when he was happy to see his former under-19 team-mate \u003ca href=\"https://www.espncricinfo.com/cricketers/corbin-bosch-594322\"\u003eCorbin Bosch\u003c/a\u003e take Pakistan on and worked his way from 87 to 89 in 14 balls. Markram was trying to anchor the tail, and though he ended up being dismissed before the proper fireworks began, perhaps his presence gave Bosch the confidence to play with the freedom he did.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIt was Markram who capped Bosch in ODIs and who has been his friend and team-mate since childhood. While they took vastly different journeys to the national side, Markram almost seemed to take more pride in what Bosch did than his own runs and the sense of genuine pride in his friend shone through.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It looks pretty easy for him at this moment, this whole Test cricket thing, and (his innings) was a great momentum shift for us. It\u0026#39;s a hugely valuable knock, probably worth more than a hundred,\u0026#34; he said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;He\u0026#39;s always been a really talented guy. In the last few years, he\u0026#39;s really put his head down, grafted and put in performances to get the chance. I\u0026#39;m really happy for him that he\u0026#39;s grabbed his opportunity as he has. There\u0026#39;s still a lot left in his tank that he has to offer and I\u0026#39;m glad some of the world can see what he\u0026#39;s about.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eBut to Bosch himself he said \u0026#34;nothing inspirational\u0026#34;.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I just told him whatever he\u0026#39;s done to get the call-up and to get the opportunity will certainly be good enough at this level as well,\u0026#34; Markram said. \u0026#34;You don\u0026#39;t want to put things in his mind that make him second-guess things and stuff like that. He\u0026#39;s had a great debut so far and it\u0026#39;s good for him that it started out this way.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThat\u0026#39;s where seniority, in terms of caps, not age, comes in. As someone who Bavuma has entrusted with some of the team talks and some of the on-the-sidelines chats, Markram has also found a way to help himself.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;(As a leader), it\u0026#39;s more just about being there for guys that need it. It\u0026#39;s not about getting too involved,\u0026#34; he said. \u0026#34;Often what you say to other people can help you as well.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMaybe this time, for him, it did.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eFirdose Moonda is ESPNcricinfo\u0026#39;s correspondent for South Africa and women\u0026#39;s cricket\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-27T18:27:00Z",
  "modifiedTime": null
}
