{
  "id": "5fce37c7-a4c1-4a0c-a191-4bf9a880dbc7",
  "title": "CWI asks ICC for 'fair and transparent' pathway to LA28 Olympics",
  "link": "https://www.espncricinfo.com/ci/content/story/1486006.html?ex_cid=OTC-RSS",
  "description": "The Caribbean region hopes to have at least one of its sovereign states in play",
  "author": "",
  "published": "Thu, 15 May 2025 18:41:31 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ESPNcricinfo staff",
  "length": 3637,
  "excerpt": "The Caribbean region hopes to have at least one of its sovereign states in play",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Cricket West Indies (CWI) has impored the ICC to provide a fair and transparent pathway for at least one of the Caribbean's sovereign nations to represent West indies at the Los Angeles Olympics.The heart of the problem here is that while in cricket many countries compete under the name West Indies and are administered by the same cricket board (CWI), the Olympics only allows sovereign nations to contest. There can be no team in which for instance, Barbadans, Jamaicans, Trinidadians, Guyanese, St. Lucians play in the same team, even though that is how regular cricket is organised.So in the Los Angeles Olympics in 2028, an event in which six nations will compete in cricket, the region hopes to have at least one of its sovereign states in play. Currently, West Indies women are ranked sixth on the T20I ICC rankings, and the men are fifth. West Indies men have won the T20 World Cup twice, and the women once. It is up to the ICC to nominate the teams that will participate in the Olympics.There is also the additional complication that the United States, as the host nation of these Olympics, may be a frontrunner to gain automatic qualification despite their low rankings, though that has not been confirmed by the ICC. This means only five further spots are available.\"The Caribbean has always punched above its weight at the Olympics, inspiring the world with our athletic brilliance,\" CWI president Kishore Swallow said. \"Cricket's return to the Games in 2028 must not exclude our young cricketers from the same dream that has inspired our athletes. The Olympic Charter emphasizes fairness, transparency, and universality. We are simply asking that these principles be upheld--not just in spirit, but in structure. West Indies cricket must have a pathway, and fully deserves an opportunity to compete.\"CWI has provided the ICC with two possible ways forward. To quote from the CWI release: If rankings are used and West Indies men and women teams technically qualify, an internal qualifying tournament among its Olympic affiliated member countries will determine which country represents the West Indies; or A global qualifying pathway that includes associate ICC members in the five ICC Development Regions plus member countries of the West Indies. The first of these options would have the CWI, through domestic tournaments, pick their champions for the LA Olympics. The second would involve a more rigorous selection process, in which the sovereign nations that are members of the West Indies board compete alongside a host of other nations for Olympics spots.What the CWI board stresses to ICC, however, is that qualification criteria must be \"fair and transparent\", citing a bylaw in the Olympic Charter. Caribbean nations are accustomed to Olympic success, as several of them are frequently atop Olympics leaderboards for medals per capita. Their collective achievements in track events in particular, are recognised almost universally as extraordinary.CWI CEO Chris Dehring said: \"Our nations have proudly flown their individual flags atop Olympic podiums as perennial gold medalists. Now, with cricket's inclusion, we must ensure that our cricketers are not shut out of history. We are ready to collaborate. We are ready to compete. But above all, we are asking for fairness.\"The ICC has made no announcement on what the Olympics qualification process will be, so far.Cricket has only once been played in the Olympics, way back in 1900. On that occasion, France and Great Britain competed, with Great Britain winning the two-day match by 158 runs. The highest individual score for France in the second innings was 8.",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/325900/325976.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eCricket West Indies (CWI) has impored the ICC to provide a fair and transparent pathway for at least one of the Caribbean\u0026#39;s sovereign nations to represent West indies at the Los Angeles Olympics.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe heart of the problem here is that while in cricket many countries compete under the name West Indies and are administered by the same cricket board (CWI), the Olympics only allows sovereign nations to contest. There can be no team in which for instance, Barbadans, Jamaicans, Trinidadians, Guyanese, St. Lucians play in the same team, even though that is how regular cricket is organised.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSo in the Los Angeles Olympics in 2028, an event in which six nations will compete in cricket, the region hopes to have at least one of its sovereign states in play. Currently, West Indies women are ranked sixth on the T20I ICC rankings, and the men are fifth. West Indies men have won the T20 World Cup twice, and the women once. It is up to the ICC to nominate the teams that will participate in the Olympics.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThere is also the additional complication that the United States, as the host nation of these Olympics, may be a frontrunner to gain automatic qualification despite their low rankings, though that has not been confirmed by the ICC. This means only five further spots are available.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;The Caribbean has always punched above its weight at the Olympics, inspiring the world with our athletic brilliance,\u0026#34; CWI president Kishore Swallow said. \u0026#34;Cricket\u0026#39;s return to the Games in 2028 must not exclude our young cricketers from the same dream that has inspired our athletes. The Olympic Charter emphasizes fairness, transparency, and universality. We are simply asking that these principles be upheld--not just in spirit, but in structure. West Indies cricket must have a pathway, and fully deserves an opportunity to compete.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eCWI has provided the ICC with two possible ways forward. To quote from the CWI release:\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cdiv\u003e\u003cul\u003e\n\u003cli\u003eIf rankings are used and West Indies men and women teams technically qualify, an internal qualifying tournament among its Olympic affiliated member countries will determine which country represents the West Indies; or\n\u003c/li\u003e\u003cli\u003eA global qualifying pathway that includes associate ICC members in the five ICC Development Regions plus member countries of the West Indies.\n\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe first of these options would have the CWI, through domestic tournaments, pick their champions for the LA Olympics. The second would involve a more rigorous selection process, in which the sovereign nations that are members of the West Indies board compete alongside a host of other nations for Olympics spots.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWhat the CWI board stresses to ICC, however, is that qualification criteria must be \u0026#34;fair and transparent\u0026#34;, citing a bylaw in the Olympic Charter. Caribbean nations are accustomed to Olympic success, as several of them are frequently atop Olympics leaderboards for medals per capita. Their collective achievements in track events in particular, are recognised almost universally as extraordinary.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eCWI CEO Chris Dehring said: \u0026#34;Our nations have proudly flown their individual flags atop Olympic podiums as perennial gold medalists. Now, with cricket\u0026#39;s inclusion, we must ensure that our cricketers are not shut out of history. We are ready to collaborate. We are ready to compete. But above all, we are asking for fairness.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eThe ICC has made no announcement on what the Olympics qualification process will be, so far.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eCricket has only once been played in the Olympics, way back in 1900. On that occasion, France and Great Britain competed, with \u003ca href=\"https://www.espncricinfo.com/series/olympics-1900-320837/france-vs-great-britain-final-320838/full-scorecard\"\u003eGreat Britain winning the two-day match by 158 runs\u003c/a\u003e. The highest individual score for France in the second innings was 8.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-15T18:37:00Z",
  "modifiedTime": null
}
