{
  "id": "6baf59fe-ba8e-4796-b051-37c096358a82",
  "title": "ECB bans transgender women from women's cricket",
  "link": "https://www.bbc.com/sport/cricket/articles/c0l0rje87y5o",
  "description": "The England and Wales Cricket Board bans transgender women from women's cricket with immediate effect.",
  "author": "",
  "published": "Fri, 02 May 2025 10:42:40 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Sean Kearns",
  "length": 4219,
  "excerpt": "The England and Wales Cricket Board bans transgender women from women's cricket with immediate effect.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Image source, Getty ImagesImage caption, The England and Wales Cricket Board have updated their transgender policy regulations Transgender women have been banned from competing in all levels of women's cricket with immediate effect, the England and Wales Cricket Board has announced.In an update to its transgender regulations, the ECB said \"only those whose biological sex is female\" will be able to participate in women's and girls' cricket.The ECB say transgender women and girls can continue playing in open and mixed cricket categories. The policy change follows a UK Supreme Court ruling on 16 April which said the legal definition of a woman is based on biological sex. \"Our regulations for recreational cricket have always aimed at ensuring that cricket remains as inclusive a sport as possible,\" the ECB said in a statement.\"These included measures to manage disparities, irrespective of someone's gender, and safeguard the enjoyment of all players. \"However, given the new advice received about the impact of the Supreme Court ruling, we believe the changes announced today are necessary.\"The ECB added that abuse and discrimination \"has no place in our sport\" and that it is committed to ensuring cricket is \"played in a spirit of respect and inclusivity\". The decision follows an announcement from the English Football Association (FA) on Thursday that transgender women will no longer be able to participate in women's football in England from 1 June.What was the ECB's previous policy?The ECB announced new transgender policy regulations in 2024, which stipulated that any player who had gone through male puberty was not eligible to feature in the top two tiers of the women's game.The policy allowed transgender women to compete in the third tier of the domestic structure. The regulations came after the International Cricket Council (ICC) announced in November 2023 that transgender women who had gone through male puberty were banned from playing in international women's matches.What about other sports? On Thursday, The Football Association became sport's first major governing body to amend its transgender eligibility criteria following the Supreme Court ruling.Later in the day, England Netball also changed its guidelines by banning transgender women from its female category.The new rules, which will apply from 1 September, recognise three distinct gender participation categories: female, male and mixed.The female category would be \"exclusively for players born female, irrespective of their gender identity\", while mixed netball will \"serve as the sport's inclusive category, allowing players to complete under the gender with which they identify\".The Ultimate Pool Group (UPG) - the professional body for eight-ball pool - banned transgender women from its female category last month.Other governing bodies, including the World Professional Billiards and Snooker Association (WPBSA), are reassessing their transgender eligibility criteria.Athletics, cycling and aquatics have implemented outright bans on transgender women taking part in women's events.In 2022 British Triathlon became the first British sporting body to establish an open category in which transgender athletes can compete.What has the reaction been? Amelia Short, a transgender cricketer for amateur side Lindow, says the ECB should have consulted with transgender players before altering its policy.\"What the ECB has done is not give us as transgender women a chance to say that there isn't much advantage going on. We're not doing an injustice to the women's game,\" Short told BBC Sport.\"They haven't given us that opportunity to come out and say that. \"From the teams I've played women's cricket for, I'm pretty sure the opposition and teams I've played on would vouch they've not been at risk of injury with me playing.\"I was nowhere near the biggest hitter in the team, nor the fastest bowler in the team.\"Fiona McAnena, director of campaigns for human rights group Sex Matters, said the ECB's previous policy was \"never coherent\" and \"indefensible\".\"Now that the UK Supreme Court has said it is lawful to exclude 'all men, including trans women', the ECB has done the right thing,\" said McAnena. More on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg.webp 800w\" type=\"image/webp\"/\u003e\u003cimg alt=\"A cricket bat, helmet and stumps. \" src=\"https://ichef.bbci.co.uk/ace/standard/943/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b6ad/live/2714b2e0-2745-11f0-a023-7133bf8b5793.jpg 800w\" width=\"943\" height=\"530\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eThe England and Wales Cricket Board have updated their transgender policy regulations \u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eTransgender women have been banned from competing in all levels of women\u0026#39;s cricket with immediate effect, the England and Wales Cricket Board has announced.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIn an update to its transgender regulations, the ECB said \u0026#34;only those whose biological sex is female\u0026#34; will be able to participate in women\u0026#39;s and girls\u0026#39; cricket.\u003c/p\u003e\u003cp\u003eThe ECB say transgender women and girls can continue playing in open and mixed cricket categories. \u003c/p\u003e\u003cp\u003eThe policy change follows a \u003ca href=\"https://www.bbc.com/news/articles/cvg7pqzk47zo\"\u003eUK Supreme Court ruling on 16 April\u003c/a\u003e which said the legal definition of a woman is based on biological sex. \u003c/p\u003e\u003cp\u003e\u0026#34;Our regulations for recreational cricket have always aimed at ensuring that cricket remains as inclusive a sport as possible,\u0026#34; the ECB said in a statement.\u003c/p\u003e\u003cp\u003e\u0026#34;These included measures to manage disparities, irrespective of someone\u0026#39;s gender, and safeguard the enjoyment of all players. \u003c/p\u003e\u003cp\u003e\u0026#34;However, given the new advice received about the impact of the Supreme Court ruling, we believe the changes announced today are necessary.\u0026#34;\u003c/p\u003e\u003cp\u003eThe ECB added that abuse and discrimination \u0026#34;has no place in our sport\u0026#34; and that it is committed to ensuring cricket is \u0026#34;played in a spirit of respect and inclusivity\u0026#34;. \u003c/p\u003e\u003cp\u003eThe decision follows an announcement from the English Football Association (FA) on Thursday that transgender women will no longer be able to participate in women\u0026#39;s football in England from 1 June.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-was-the-ECBs-previous-policy\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat was the ECB\u0026#39;s previous policy?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe ECB announced new \u003ca href=\"https://www.bbc.com/sport/cricket/articles/c3vk40xkqy0o\"\u003etransgender policy regulations in 2024,\u003c/a\u003e which stipulated that any player who had gone through male puberty was not eligible to feature in the top two tiers of the women\u0026#39;s game.\u003c/p\u003e\u003cp\u003eThe policy allowed transgender women to compete in the third tier of the domestic structure. \u003c/p\u003e\u003cp\u003eThe regulations came after the International Cricket Council (ICC) announced in November 2023 that transgender women who had gone through male puberty were banned from playing in international women\u0026#39;s matches.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-about-other-sports-\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat about other sports? \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOn Thursday, The Football Association became sport\u0026#39;s first major governing body to amend its transgender eligibility criteria following the Supreme Court ruling.\u003c/p\u003e\u003cp\u003eLater in the day, England Netball also changed its guidelines by banning transgender women from its female category.\u003c/p\u003e\u003cp\u003eThe new rules, which will apply from 1 September, recognise three distinct gender participation categories: female, male and mixed.\u003c/p\u003e\u003cp\u003eThe female category would be \u0026#34;exclusively for players born female, irrespective of their gender identity\u0026#34;, while mixed netball will \u0026#34;serve as the sport\u0026#39;s inclusive category, allowing players to complete under the gender with which they identify\u0026#34;.\u003c/p\u003e\u003cp\u003eThe Ultimate Pool Group (UPG) - the professional body for eight-ball pool - banned transgender women from its female category last month.\u003c/p\u003e\u003cp\u003eOther governing bodies, including the World Professional Billiards and Snooker Association (WPBSA), are reassessing their transgender eligibility criteria.\u003c/p\u003e\u003cp\u003eAthletics, cycling and aquatics have implemented outright bans on transgender women taking part in women\u0026#39;s events.\u003c/p\u003e\u003cp\u003eIn 2022 British Triathlon became the first British sporting body to establish an open category in which transgender athletes can compete.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-has-the-reaction-been-\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat has the reaction been? \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAmelia Short, a transgender cricketer for amateur side Lindow, says the ECB should have consulted with transgender players before altering its policy.\u003c/p\u003e\u003cp\u003e\u0026#34;What the ECB has done is not give us as transgender women a chance to say that there isn\u0026#39;t much advantage going on. We\u0026#39;re not doing an injustice to the women\u0026#39;s game,\u0026#34; Short told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;They haven\u0026#39;t given us that opportunity to come out and say that. \u003c/p\u003e\u003cp\u003e\u0026#34;From the teams I\u0026#39;ve played women\u0026#39;s cricket for, I\u0026#39;m pretty sure the opposition and teams I\u0026#39;ve played on would vouch they\u0026#39;ve not been at risk of injury with me playing.\u003c/p\u003e\u003cp\u003e\u0026#34;I was nowhere near the biggest hitter in the team, nor the fastest bowler in the team.\u0026#34;\u003c/p\u003e\u003cp\u003eFiona McAnena, director of campaigns for human rights group Sex Matters, said the ECB\u0026#39;s previous policy was \u0026#34;never coherent\u0026#34; and \u0026#34;indefensible\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Now that the UK Supreme Court has said it is lawful to exclude \u0026#39;all men, including trans women\u0026#39;, the ECB has done the right thing,\u0026#34; said McAnena. \u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/section\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-02T10:42:40.834Z",
  "modifiedTime": null
}
