{
  "id": "72471762-4c41-4800-befd-8559fe305b82",
  "title": "Australia shocked in World Cup semis by South Africa",
  "link": "https://www.bbc.com/sport/cricket/articles/c70wddz40r1o",
  "description": "South Africa produce a stunning performance to knock Australia out of the Women's T20 World Cup in the semi-finals.",
  "author": "",
  "published": "Thu, 17 Oct 2024 17:24:48 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Ffion Wynne",
  "length": 5249,
  "excerpt": "South Africa produce a stunning performance to knock Australia out of the Women's T20 World Cup in the semi-finals.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Women's T20 World Cup, Dubai Australia 134-5 (20 overs): Mooney 44 (42); Khaka 2-24 South Africa 135-2 (17.2 overs): Bosch 74* (48), Wolvaardt 42 (37); Sutherland 2-26South Africa won by eight wicketsScorecard.Australia suffered a shock semi-final exit from the T20 World Cup as South Africa raced to an emphatic eight-wicket win in Dubai.The defending champions missed out on an eighth final appearance as the Proteas reached their target of 135 with 16 balls to spare.Anneke Bosch struck a sensational unbeaten 74 from 48 balls while captain Laura Wolvaardt added a classy 42 in a second-wicket partnership of 96 that left Australia reeling.Wolvaardt later described her team's victory as \"one of our biggest wins ever\".The brilliantly executed run chase came after South Africa's bowlers had smartly restricted Australia to 134-5 in a curiously underwhelming innings.Grace Harris and Georgia Wareham fell early in the powerplay before opener Beth Mooney dropped anchor with 44 from 42 balls.Australia paid the price for stuttering in the middle overs, with the run-rate rarely creeping over a run a ball as captain Tahlia McGrath trudged to 27 from 33. Ellyse Perry's 31 from 23 and Phoebe Litchfield's nine-ball 16 added a late burst but the total still felt below par on a pitch that favoured chasing, as West Indies proved against England on Wednesday.South Africa started the chase confidently with a powerplay of 43-1, comfortably ahead of Australia's 35-2 at the same stage, before Tazmin Brits' departure for 15 opened the door for the phenomenal match-winning partnership.Bosch, whose previous high score in the tournament was 25, crunched eight fours and a six in her match-winning effort.It rewarded the faith of the South Africa selectors who kept her at number three, and meant they reached their second successive final after the 2023 edition on home soil.The second semi-final takes place between New Zealand and West Indies at Sharjah on Friday, meaning Sunday's final will be the first in either white-ball format without Australia or England involved.Reacting to the win, South African cricket writer Firdose Moonda told BBC Radio 5 Live: \"We have had an incredible 18 months of sport in South Africa.\"We are a country with very little financial resource, compared to others like Australia for example, and we are a country punching so far above its weight, while being one of the most diverse teams and unifying South Africa.\"Many people survive on hope alone in our country and these women have brought so much hope.\"After being put in to bat, Australia did not carry the usual swagger and confidence expected from the six-time winners of this tournament. In fact, they were timid, only hitting 11 boundaries in total. That is despite the enviable batting depth that they possess which often results in them playing with much more freedom than other teams who tend to be protecting fragile, inexperienced middle orders.Harris and Wareham's early departures did not feel overly worrying, with the likes of Perry, Litchfield, McGrath and Ash Gardner to come - but with each over that passed by without an acceleration, there was a sense that such a kickstart would never appear.In the end, being five wickets down felt like a big waste with the destructive Gardner and Annabel Sutherland left waiting in the dugout.And they were punished for such caution as South Africa's innings was a complete contradiction.Wolvaardt timed the ball beautifully from the outset with her trademark exquisite cover drives but Bosch's knock was a spectacle.Against England in the group stage, the 31-year-old stuttered to 18 from 26 balls and did not look the part at three, but against the world's most formidable force she struck the ball with such clarity and power in a manner that we had yet to see in this tournament.It is the highest individual score so far, and for that to be delivered under the most pressure and against such a high-quality opponent was astonishing - and the ease of South Africa's victory was such that Marizanne Kapp was not required to bat.Australia did not do too much wrong with the ball as Bosch did not even offer a chance, but they will rue their lack of ambition with the bat as they allowed South Africa to take one step closer to their first global title.England bowler Tash Farrant on BBC Test Match Special: \"It is a really great thing that none of Australia, England or India are left in the tournament.\"People were concerned that with the domestic structures underneath those three sides that the gap would get bigger, but in World Cup cricket it is literally about who turns up on the day.\"South Africa captain Laura Wolvaardt: \"It is right up there with one of our biggest wins ever, the biggest win of my career for sure. It’s been such a good year for us and a real collective group effort.\"Anneke [Bosch] batted superbly and played her role perfectly, she played one of the best innings of her career.\"Australia stand-in captain Tahlia McGrath: \"It's pretty hard to take. We didn't show up tonight, you can't afford to do that in tournaments like this. Credit to South Africa.\"We've had this World Cup in our minds for a long time now, we were really well prepped, just didn't show up on the night.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/17ef/live/51c0b480-8ca9-11ef-b6b0-c9af5f7f16e4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eWomen\u0026#39;s T20 World Cup, Dubai \u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eAustralia 134-5 (20 overs): \u003c/b\u003eMooney 44 (42); Khaka 2-24 \u003c/p\u003e\u003cp\u003e\u003cb\u003eSouth Africa 135-2 (17.2 overs): \u003c/b\u003eBosch 74* (48), Wolvaardt 42 (37); Sutherland 2-26\u003c/p\u003e\u003cp\u003e\u003ci\u003eSouth Africa won by eight wickets\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.co.uk/sport/cricket/scorecard/e-221800\"\u003eScorecard.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAustralia suffered a shock semi-final exit from the T20 World Cup as South Africa raced to an emphatic eight-wicket win in Dubai.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe defending champions missed out on an eighth final appearance as the Proteas reached their target of 135 with 16 balls to spare.\u003c/p\u003e\u003cp\u003eAnneke Bosch struck a sensational unbeaten 74 from 48 balls while captain Laura Wolvaardt added a classy 42 in a second-wicket partnership of 96 that left Australia reeling.\u003c/p\u003e\u003cp\u003eWolvaardt later described her team\u0026#39;s victory as \u0026#34;one of our biggest wins ever\u0026#34;.\u003c/p\u003e\u003cp\u003eThe brilliantly executed run chase came after South Africa\u0026#39;s bowlers had smartly restricted Australia to 134-5 in a curiously underwhelming innings.\u003c/p\u003e\u003cp\u003eGrace Harris and Georgia Wareham fell early in the powerplay before opener Beth Mooney dropped anchor with 44 from 42 balls.\u003c/p\u003e\u003cp\u003eAustralia paid the price for stuttering in the middle overs, with the run-rate rarely creeping over a run a ball as captain Tahlia McGrath trudged to 27 from 33. \u003c/p\u003e\u003cp\u003eEllyse Perry\u0026#39;s 31 from 23 and Phoebe Litchfield\u0026#39;s nine-ball 16 added a late burst but  the total still felt below par on a pitch that favoured chasing, as \u003ca href=\"https://www.bbc.co.uk/sport/cricket/articles/cr4x9d9ylero\"\u003eWest Indies proved against England on Wednesday.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSouth Africa started the chase confidently with a powerplay of 43-1, comfortably ahead of Australia\u0026#39;s 35-2 at the same stage, before Tazmin Brits\u0026#39; departure for 15 opened the door for the phenomenal match-winning partnership.\u003c/p\u003e\u003cp\u003eBosch, whose previous high score in the tournament was 25, crunched eight fours and a six in her match-winning effort.\u003c/p\u003e\u003cp\u003eIt rewarded the faith of the South Africa selectors who kept her at number three, and meant they reached their second successive final after the 2023 edition on home soil.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe second semi-final takes place between New Zealand and West Indies at Sharjah on Friday, meaning Sunday\u0026#39;s final will be the first in either white-ball format without Australia or England involved.\u003c/p\u003e\u003cp\u003eReacting to the win, South African cricket writer Firdose Moonda told BBC Radio 5 Live: \u0026#34;We have had an incredible 18 months of sport in South Africa.\u003c/p\u003e\u003cp\u003e\u0026#34;We are a country with very little financial resource, compared to others like Australia for example, and we are a country punching so far above its weight, while being one of the most diverse teams and unifying South Africa.\u003c/p\u003e\u003cp\u003e\u0026#34;Many people survive on hope alone in our country and these women have brought so much hope.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAfter being put in to bat, Australia did not carry the usual swagger and confidence expected from the six-time winners of this tournament. \u003c/p\u003e\u003cp\u003eIn fact, they were timid, only hitting 11 boundaries in total. That is despite the enviable batting depth that they possess which often results in them playing with much more freedom than other teams who tend to be protecting fragile, inexperienced middle orders.\u003c/p\u003e\u003cp\u003eHarris and Wareham\u0026#39;s early departures did not feel overly worrying, with the likes of Perry, Litchfield, McGrath and Ash Gardner to come - but with each over that passed by without an acceleration, there was a sense that such a kickstart would never appear.\u003c/p\u003e\u003cp\u003eIn the end, being five wickets down felt like a big waste with the destructive Gardner and Annabel Sutherland left waiting in the dugout.\u003c/p\u003e\u003cp\u003eAnd they were punished for such caution as South Africa\u0026#39;s innings was a complete contradiction.\u003c/p\u003e\u003cp\u003eWolvaardt timed the ball beautifully from the outset with her trademark exquisite cover drives but Bosch\u0026#39;s knock was a spectacle.\u003c/p\u003e\u003cp\u003eAgainst England in the group stage, the 31-year-old stuttered to 18 from 26 balls and did not look the part at three, but against the world\u0026#39;s most formidable force she struck the ball with such clarity and power in a manner that we had yet to see in this tournament.\u003c/p\u003e\u003cp\u003eIt is the highest individual score so far, and for that to be delivered under the most pressure and against such a high-quality opponent was astonishing - and the ease of South Africa\u0026#39;s victory was such that Marizanne Kapp was not required to bat.\u003c/p\u003e\u003cp\u003eAustralia did not do too much wrong with the ball as Bosch did not even offer a chance, but they will rue their lack of ambition with the bat as they allowed South Africa to take one step closer to their first global title.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEngland bowler Tash Farrant on BBC Test Match Special:\u003c/b\u003e \u0026#34;It is a really great thing that none of Australia, England or India are left in the tournament.\u003c/p\u003e\u003cp\u003e\u0026#34;People were concerned that with the domestic structures underneath those three sides that the gap would get bigger, but in World Cup cricket it is literally about who turns up on the day.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eSouth Africa captain Laura Wolvaardt:\u003c/b\u003e \u0026#34;It is right up there with one of our biggest wins ever, the biggest win of my career for sure. It’s been such a good year for us and a real collective group effort.\u003c/p\u003e\u003cp\u003e\u0026#34;Anneke [Bosch] batted superbly and played her role perfectly, she played one of the best innings of her career.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eAustralia stand-in captain Tahlia McGrath:\u003c/b\u003e \u0026#34;It\u0026#39;s pretty hard to take. We didn\u0026#39;t show up tonight, you can\u0026#39;t afford to do that in tournaments like this. Credit to South Africa.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve had this World Cup in our minds for a long time now, we were really well prepped, just didn\u0026#39;t show up on the night.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-17T16:59:19.277Z",
  "modifiedTime": null
}
