{
  "id": "757f1df6-0ea7-4c51-a18c-db135c9007e6",
  "title": "England thrashed in first T20 as Australia retain Ashes",
  "link": "https://www.bbc.com/sport/cricket/articles/cy08yl8y5ero",
  "description": "Australia beat England by 57 runs in the first T20 to take an 8-0 lead and retain the Women's Ashes at the earliest opportunity.",
  "author": "",
  "published": "Mon, 20 Jan 2025 12:18:25 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Ffion Wynne",
  "length": 5938,
  "excerpt": "Australia beat England by 57 runs in the first T20 to take an 8-0 lead and retain the Women's Ashes at the earliest opportunity.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "England thrashed in first T20 as Australia retain AshesMedia caption, Australia retain Women's Ashes after another England collapseWomen's Ashes, first T20: Sydney Cricket Ground Australia 198-7 (20 overs): Mooney 75 (51); Ecclestone 2-26England 141 (16 overs): Dunkley 59 (30); Wareham 3-25Australia won by 57 runs, lead series 8-0ScorecardAustralia retained the Women's Ashes at the earliest opportunity with a 57-run thrashing over England in the first T20 at the Sydney Cricket Ground. England slumped to 141 all out in 16 overs after being set an imposing 199 to win, despite Sophia Dunkley's brilliant 59 from 30 balls in her first appearance of the tour. Dunkley put England in a great position by reaching 62-3 from the six-over powerplay and 96-3 at the halfway mark. But the last seven wickets fell for 45 runs as Australia turned the screw, with leg-spinners Alana King and Georgia Wareham taking 2-14 and 3-25 respectively.The victory gives Australia an 8-0 points lead in the multi-format series, meaning England can only draw if they win all of their remaining matches. Dunkley's fearless approach from number three was all the more impressive considering England had suffered another top-order failure, with openers Maia Bouchier and Danni Wyatt-Hodge falling for ducks in the first two overs. Nat Sciver-Brunt's 20 was the next top score as England buckled under the run-rate pressure, but they also paid the price for conceding too many runs via some loose bowling and several mistakes in the field despite winning the toss. Beth Mooney made 75 from 51 balls at the top of the order for Australia, but she was dropped by Amy Jones on 16 and there was another missed opportunity on 23 when a miscommunication between Nat Sciver-Brunt and Charlie Dean saw them leave a straightforward catch to one another and it eventually plugged in the outfield.Sophie Ecclestone's exceptional figures of 2-26 were an outlier in an unconvincing bowling effort, as every other bowler finished with an economy rate of more than eight an over. The second of three T20s, all worth two points each, takes place in Canberra on Thursday. Magnificent Mooney makes England payMedia caption, England's fielding errors allow Australia off the hookAustralia managed to win the preceding one-day international series 3-0 despite their top order struggling but at the first time of asking in the shorter format, they were ruthless. England looked shell-shocked in the opening overs as Mooney and 21-year-old debutant Georgia Voll came out swinging, which led to fielding mistakes and loose bowling. Too often the ball raced through fielders' hands, there were overthrows and three missed catching opportunities. Voll was put down by Lauren Bell on 13, before Bell got her revenge to pin her lbw for 21 from 11 balls, and Phoebe Litchfield's 25 subsequently kept the momentum going Australia's way. Mooney then capitalised on England's errors to strike 11 fours in her innings which was a masterclass in fitness and running between the wickets, displaying her speed and judgement before she was stumped off Freya Kemp in the 18th over. Stand-in captain Tahlia McGrath stepped up with 26 from nine balls to dent England's hopes after they had removed Annabel Sutherland and Ellyse Perry cheaply, and followed it by marshalling her bowlers cannily to ensure that England are only playing for pride from the rest of the tour.McGrath was in charge in the absence of Alyssa Healy, who was ruled out with a foot injury, while all-rounder Ash Gardner - the star of the third ODI - was missing with a calf niggle. Dunkley stands apart as England wiltMedia caption, Watch: Dunkley's 'magnificent' half-century against AustraliaDunkley has endured a difficult 18 months being moved in and out of England's side but faced with the joint second-highest run chase in women's T20 history, she delivered a timely reminder of her power-hitting talent which had Australia on the ropes in the early stages.Having seen Bouchier pull Megan Schutt's second ball to deep mid-wicket and then Wyatt-Hodge edge Kim Garth behind, Dunkley struck the ball cleanly down the ground with six fours and four sixes in her knock. Sciver-Brunt also played aggressively for her 20 from 12 balls but she was bowled by King's first ball, and England could not maintain their intent. Captain Heather Knight made 18 before being pinned lbw by King after a smart review, and when Dunkley was bowled by McGrath to leave England 110-5, the game was all-but over. Amy Jones managed 12 and then the lower order capitulated, with spin continuing to haunt England as they have now lost 18 wickets to King and Wareham's leg-spin across the series so far. Australia are a world-class side and England were always going to face a difficult task away from home, but their inability to nail the basics and continually repeat mistakes - such as in the field and when batting against spin - has been the biggest disappointment.'We want to win outright' - what they saidMedia caption, Litchfield strikes brilliant switch hit for sixEngland batter Sophia Dunkley speaking to TNT Sports: \"I think we're just really disappointed - we wanted to bring a lot of energy and we fell quite short.\"I wanted to go out there and give it my best shot and put the pressure on Australia. We can still draw the Ashes, it's not completely gone, so we'll focus on that.\"Australia spinner Georgia Wareham: \"The girls are pretty pumped, but the job's not done, we want to win it outright. We always strive to keep on winning games.\"England captain Heather Knight: \"I thought it was an outstanding innings by Beth Mooney. She makes it really hard for the bowlers to execute. We gave them 20-30 too many runs, if we'd conceded less we'd have been in with a real chance.\"We felt like we were in it, Sophia Dunkley's innings was really smart. She was outstanding, played with freedom. It was frustrating today.\"More on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fc2/live/d8b9f460-d722-11ef-94cb-5f844ceb9e30.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eEngland thrashed in first T20 as Australia retain Ashes\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eAustralia retain Women\u0026#39;s Ashes after another England collapse\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eWomen\u0026#39;s Ashes, first T20: Sydney Cricket Ground \u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eAustralia 198-7 (20 overs): \u003c/b\u003eMooney 75 (51); Ecclestone 2-26\u003c/p\u003e\u003cp\u003e\u003cb\u003eEngland 141 (16 overs): \u003c/b\u003eDunkley 59 (30); Wareham 3-25\u003c/p\u003e\u003cp\u003e\u003ci\u003eAustralia won by 57 runs, lead series 8-0\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.bbc.com/sport/cricket/scorecard/e-221346\"\u003eScorecard\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAustralia retained the Women\u0026#39;s Ashes at the earliest opportunity with a 57-run thrashing over England in the first T20 at the Sydney Cricket Ground. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eEngland slumped to 141 all out in 16 overs after being set an imposing 199 to win, despite Sophia Dunkley\u0026#39;s brilliant 59 from 30 balls in her first appearance of the tour. \u003c/p\u003e\u003cp\u003eDunkley put England in a great position by reaching 62-3 from the six-over powerplay and 96-3 at the halfway mark.  \u003c/p\u003e\u003cp\u003eBut the last seven wickets fell for 45 runs as Australia turned the screw, with leg-spinners Alana King and Georgia Wareham taking 2-14 and 3-25 respectively.\u003c/p\u003e\u003cp\u003eThe victory gives Australia an 8-0 points lead in the multi-format series, meaning England can only draw if they win all of their remaining matches. \u003c/p\u003e\u003cp\u003eDunkley\u0026#39;s fearless approach from number three was all the more impressive considering England had suffered another top-order failure, with openers Maia Bouchier and Danni Wyatt-Hodge falling for ducks in the first two overs. \u003c/p\u003e\u003cp\u003eNat Sciver-Brunt\u0026#39;s 20 was the next top score as England buckled under the run-rate pressure, but they also paid the price for conceding too many runs via some loose bowling and several mistakes in the field despite winning the toss. \u003c/p\u003e\u003cp\u003eBeth Mooney made 75 from 51 balls at the top of the order for Australia, but she was dropped by Amy Jones on 16 and there was another missed opportunity on 23 when a miscommunication between Nat Sciver-Brunt and Charlie Dean saw them leave a straightforward catch to one another and it eventually plugged in the outfield.\u003c/p\u003e\u003cp\u003eSophie Ecclestone\u0026#39;s exceptional figures of 2-26 were an outlier in an unconvincing bowling effort, as every other bowler finished with an economy rate of more than eight an over. \u003c/p\u003e\u003cp\u003eThe second of three T20s, all worth two points each, takes place in Canberra on Thursday. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Magnificent-Mooney-makes-England-pay\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eMagnificent Mooney makes England pay\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eEngland\u0026#39;s fielding errors allow Australia off the hook\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAustralia managed to win the preceding one-day international series 3-0 despite their top order struggling but at the first time of asking in the shorter format, they were ruthless. \u003c/p\u003e\u003cp\u003eEngland looked shell-shocked in the opening overs as Mooney and 21-year-old debutant Georgia Voll came out swinging, which led to fielding mistakes and loose bowling. \u003c/p\u003e\u003cp\u003eToo often the ball raced through fielders\u0026#39; hands, there were overthrows and three missed catching opportunities. \u003c/p\u003e\u003cp\u003eVoll was put down by Lauren Bell on 13, before Bell got her revenge to pin her lbw for 21 from 11 balls, and Phoebe Litchfield\u0026#39;s 25 subsequently kept the momentum going Australia\u0026#39;s way.  \u003c/p\u003e\u003cp\u003eMooney then capitalised on England\u0026#39;s errors to strike 11 fours in her innings which was a masterclass in fitness and running between the wickets, displaying her speed and judgement before she was stumped off Freya Kemp in the 18th over. \u003c/p\u003e\u003cp\u003eStand-in captain Tahlia McGrath stepped up with 26 from nine balls to dent England\u0026#39;s hopes after they had removed Annabel Sutherland and Ellyse Perry cheaply, and followed it by marshalling her bowlers cannily to ensure that England are only playing for pride from the rest of the tour.\u003c/p\u003e\u003cp\u003eMcGrath was in charge in the absence of Alyssa Healy, who was ruled out with a foot injury, while all-rounder Ash Gardner - \u003ca href=\"https://www.bbc.com/sport/cricket/articles/cgq003y4qv3o\"\u003ethe star of the third OD\u003c/a\u003eI - was missing with a calf niggle. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Dunkley-stands-apart-as-England-wilt\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eDunkley stands apart as England wilt\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eWatch: Dunkley\u0026#39;s \u0026#39;magnificent\u0026#39; half-century against Australia\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDunkley has endured a difficult 18 months being moved in and out of England\u0026#39;s side but faced with the joint second-highest run chase in women\u0026#39;s T20 history, she delivered a timely reminder of her power-hitting talent which had Australia on the ropes in the early stages.\u003c/p\u003e\u003cp\u003eHaving seen Bouchier pull Megan Schutt\u0026#39;s second ball to deep mid-wicket and then Wyatt-Hodge edge Kim Garth behind, Dunkley struck the ball cleanly down the ground with six fours and four sixes in her knock. \u003c/p\u003e\u003cp\u003eSciver-Brunt also played aggressively for her 20 from 12 balls but she was bowled by King\u0026#39;s first ball, and England could not maintain their intent. \u003c/p\u003e\u003cp\u003eCaptain Heather Knight made 18 before being pinned lbw by King after a smart review, and when Dunkley was bowled by McGrath to leave England 110-5, the game was all-but over. \u003c/p\u003e\u003cp\u003eAmy Jones managed 12 and then the lower order capitulated, with spin continuing to haunt England as they have now lost 18 wickets to King and Wareham\u0026#39;s leg-spin across the series so far. \u003c/p\u003e\u003cp\u003eAustralia are a world-class side and England were always going to face a difficult task away from home, but their inability to nail the basics and continually repeat mistakes - such as in the field and when batting against spin - has been the biggest disappointment.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"We-want-to-win-outright-what-they-said\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;We want to win outright\u0026#39; - what they said\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eLitchfield strikes brilliant switch hit for six\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEngland batter Sophia Dunkley speaking to TNT Sports: \u003c/b\u003e\u0026#34;I think we\u0026#39;re just really disappointed - we wanted to bring a lot of energy and we fell quite short.\u003c/p\u003e\u003cp\u003e\u0026#34;I wanted to go out there and give it my best shot and put the pressure on Australia. We can still draw the Ashes, it\u0026#39;s not completely gone, so we\u0026#39;ll focus on that.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eAustralia spinner Georgia Wareham: \u003c/b\u003e\u0026#34;The girls are pretty pumped, but the job\u0026#39;s not done, we want to win it outright. We always strive to keep on winning games.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eEngland captain Heather Knight:\u003c/b\u003e \u0026#34;I thought it was an outstanding innings by Beth Mooney. She makes it really hard for the bowlers to execute. We gave them 20-30 too many runs, if we\u0026#39;d conceded less we\u0026#39;d have been in with a real chance.\u003c/p\u003e\u003cp\u003e\u0026#34;We felt like we were in it, Sophia Dunkley\u0026#39;s innings was really smart. She was outstanding, played with freedom. It was frustrating today.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-20T11:42:09.192Z",
  "modifiedTime": null
}
