{
  "id": "771c29b4-6131-40fc-b572-0ee51376db88",
  "title": "'Everything's an option' - Could Lyon be left out for first time in 12 years?",
  "link": "https://www.espncricinfo.com/ci/content/story/1494710.html?ex_cid=OTC-RSS",
  "description": "Pat Cummins often confirms his XI the day before a Test, but that wasn't the case in Jamaica with 'unknowns' at play",
  "author": "",
  "published": "Fri, 11 Jul 2025 22:50:19 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Andrew McGlashan",
  "length": 4161,
  "excerpt": "Pat Cummins often confirms his XI the day before a Test, but that wasn't the case in Jamaica with 'unknowns' at play",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsPat Cummins often confirms his XI the day before a Test, but that wasn't the case in Jamaica with 'unknowns' at playA combination of the pink ball and pitch conditions at Sabina Park have left Australia pondering the balance of their side with captain Pat Cummins not ruling out omitting Nathan Lyon in favour of another pace bowler.Aside from the three matches Lyon missed in the 2023 Ashes when he injured his calf at Lord's he has not been absent from a Test XI since the 2013 series against England.Asked directly whether leaving out Lyon was a possibility, Cummins said: \"I think everything's an option. We honestly haven't settled on it. We all left yesterday and thought we'd just sleep on it, come back and have a look and make up our mind today.\"'Might be a few things going on' as Sabina Park makes pink-ball debutStarc @ 100: A beast at home, a pink-ball master and a menace for left-handersWest Indies, Australia weigh up selection for pink-ball challengeAs Australia's training session wound up on Friday, there was a lengthy chat in the middle between Cummins, head coach Andrew McDonald and touring selector Tony Dodemaide. Chair of selectors George Bailey returned to Australia after the second Test. It has become common for Cummins to name the XI the day before the match.\"[There are] a few more unknowns…I think mainly [the] pink ball and trying to get our heads around exactly what it's going to do,\" Cummins had said before the training session. \"That last session [under lights] might be a little bit longer than Adelaide.\"Even in a series dominated by the quicks, Lyon has taken nine wickets at 18.33 including six in Grenada to leave him on 562 overall - one short of equaling Glenn McGrath's record as the second-most for Australia behind Shane Warne.Overall in day-night Tests Lyon has 43 wickets at 25.62 which is a lower average than in red-ball Tests at 30.52. However, last season against India he only bowled one over in Adelaide and he wasn't required at all against England in Hobart during the 2021-22 Ashes. This match against West Indies is Australia's first day-night Test away from home.Scott Boland, who has taken 12 wickets at 16.75 in three day-night Tests, would be the likely bowler to come into the side. Beau Webster, who has been the fourth seamer this series, would be able to provide offspin if required along with Travis Head. The other slim option Australia may consider is bolstering the batting if they believed three frontline quicks and Webster would suffice as the attack.Not too long ago in Australia it became something of an annual question around whether Lyon would ever be left out on the more pace-friendly grounds at home such as the Gabba and WACA but, since 2013, he has always been there, and it could easily transpire that way on this occasion.It would be a significant game for Lyon to miss with Mitchell Starc making his 100th appearance. On Thursday, Starc spoke of the strong bond between himself, Lyon, Pat Cummins and Josh Hazlewood who are all from New South Wales.\"We've spent a lot of time together,\" Starc said. \"So to play with a lot of really close mates, to play with a lot of really good people around the staff and the playing group has been really special.\"However, Cummins did not foresee a negative reaction should a change be made. \"I mean, it's all hypothetical here. I think everyone here has a pretty good track record of doing whatever the team needs and being really excited for the guys that play.\"Interestingly, West Indies captain Roston Chase said one of the key decisions they are mulling over is whether to recall their specialist spinner, Jomel Warrican, after he was left out in Grenada. \"I think the wicket will offer some spin as well,\" Chase said.\"It has a bit of grass on it, but I think the groundsman said he might shave off a bit,\" he added. \"So still yet to see what the final surface will look like, but it looks pretty hard. I mean, the practice wickets look similar, so the ball has been doing a bit in the practice session. Looks like a good cricket wicket.\"Andrew McGlashan is a deputy editor at ESPNcricinfoGet latest cricket updates on WhatsApp",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/403100/403188.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle data-id=\"1494710\" data-src=\"/story/wi-vs-aus-3rd-test-2025-could-nathan-lyon-be-left-out-for-first-time-in-12-years-1494710\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003ePat Cummins often confirms his XI the day before a Test, but that wasn\u0026#39;t the case in Jamaica with \u0026#39;unknowns\u0026#39; at play\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/andrew-mcglashan-7\" title=\"\"\u003e\u003cspan\u003e\u003cimg width=\"40\" height=\"40\" alt=\"Andrew McGlashan\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA combination of the pink ball and pitch conditions at Sabina Park have left \u003ca href=\"https://www.espncricinfo.com/team/australia-2\"\u003eAustralia\u003c/a\u003e pondering the balance of their side with captain \u003ca href=\"https://www.espncricinfo.com/cricketers/pat-cummins-489889\"\u003ePat Cummins\u003c/a\u003e not ruling out omitting \u003ca href=\"https://www.espncricinfo.com/cricketers/nathan-lyon-272279\"\u003eNathan Lyon\u003c/a\u003e in favour of another pace bowler.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAside from the three matches Lyon missed in the 2023 Ashes when he injured his calf at Lord\u0026#39;s he has not been absent from a Test XI since the 2013 series against England.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eAsked directly whether leaving out Lyon was a possibility, Cummins said: \u0026#34;I think everything\u0026#39;s an option. We honestly haven\u0026#39;t settled on it. We all left yesterday and thought we\u0026#39;d just sleep on it, come back and have a look and make up our mind today.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/wi-vs-aus-3rd-test-mitchell-starc-and-brandon-king-on-the-players-concerns-ahead-of-sabina-park-test-1494501\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003e\u0026#39;Might be a few things going on\u0026#39; as Sabina Park makes pink-ball debut\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/mitchell-starc-100th-test-a-pink-ball-master-and-a-menace-for-left-handers-1494630\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eStarc @ 100: A beast at home, a pink-ball master and a menace for left-handers\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/australia-in-west-indies-2025-1472501/west-indies-vs-australia-3rd-test-1472519/match-preview\" title=\"\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eWest Indies, Australia weigh up selection for pink-ball challenge\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAs Australia\u0026#39;s training session wound up on Friday, there was a lengthy chat in the middle between Cummins, head coach Andrew McDonald and touring selector Tony Dodemaide. Chair of selectors George Bailey returned to Australia after the second Test. It has become common for Cummins to name the XI the day before the match.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;[There are] a few more unknowns…I think mainly [the] pink ball and trying to get our heads around exactly what it\u0026#39;s going to do,\u0026#34; Cummins had said before the training session. \u0026#34;That last session [under lights] might be a little bit longer than Adelaide.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eEven in a series dominated by the quicks, Lyon has taken nine wickets at 18.33 including six in Grenada to leave him on 562 overall - one short of equaling Glenn McGrath\u0026#39;s record as the second-most for Australia behind Shane Warne.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://stats.espncricinfo.com/ci/engine/player/272279.html?class=1;filter=advanced;floodlit=2;orderby=start;template=results;type=bowling;view=match\"\u003eOverall in day-night Tests Lyon has 43 wickets at 25.62\u003c/a\u003e which is a lower average than in red-ball Tests at 30.52. However, last season against India he only bowled one over in Adelaide and he wasn\u0026#39;t required at all against England in Hobart during the 2021-22 Ashes. This match against West Indies is Australia\u0026#39;s first day-night Test away from home.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/scott-boland-446548\"\u003eScott Boland\u003c/a\u003e, who has taken 12 wickets at 16.75 in three day-night Tests, would be the likely bowler to come into the side. \u003ca href=\"https://www.espncricinfo.com/cricketers/beau-webster-381329\"\u003eBeau Webster\u003c/a\u003e, who has been the fourth seamer this series, would be able to provide offspin if required along with Travis Head. The other slim option Australia may consider is bolstering the batting if they believed three frontline quicks and Webster would suffice as the attack.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eNot too long ago in Australia it became something of an annual question around whether Lyon would ever be left out on the more pace-friendly grounds at home such as the Gabba and WACA but, since 2013, he has always been there, and it could easily transpire that way on this occasion.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eIt would be a significant game for Lyon to miss with Mitchell Starc making his 100th appearance. On Thursday, Starc spoke of the strong bond between himself, Lyon, Pat Cummins and Josh Hazlewood who are all from New South Wales.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve spent a lot of time together,\u0026#34; Starc said. \u0026#34;So to play with a lot of really close mates, to play with a lot of really good people around the staff and the playing group has been really special.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eHowever, Cummins did not foresee a negative reaction should a change be made. \u0026#34;I mean, it\u0026#39;s all hypothetical here. I think everyone here has a pretty good track record of doing whatever the team needs and being really excited for the guys that play.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eInterestingly, West Indies captain \u003ca href=\"https://www.espncricinfo.com/cricketers/roston-chase-391832\"\u003eRoston Chase\u003c/a\u003e said one of the key decisions they are mulling over is whether to recall their specialist spinner, Jomel Warrican, after he was left out in Grenada. \u0026#34;I think the wicket will offer some spin as well,\u0026#34; Chase said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It has a bit of grass on it, but I think the groundsman said he might shave off a bit,\u0026#34; he added. \u0026#34;So still yet to see what the final surface will look like, but it looks pretty hard. I mean, the practice wickets look similar, so the ball has been doing a bit in the practice session. Looks like a good cricket wicket.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAndrew McGlashan is a deputy editor at ESPNcricinfo\u003c/p\u003e\u003ca href=\"https://whatsapp.com/channel/0029Va5oNnUKGGGLrFKvkH3E\" title=\"Get latest cricket updates on WhatsApp\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cp\u003e\u003ci\u003e\u003c/i\u003e\u003cspan\u003eGet latest cricket updates on WhatsApp\u003c/span\u003e\u003c/p\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-11T22:48:00Z",
  "modifiedTime": null
}
