{
  "id": "868e0444-e89c-4fb5-abd4-6250d26e534a",
  "title": "Harmanpreet hails Sciver-Brunt and Ismail after MI make 150 look 'like 180'",
  "link": "https://www.espncricinfo.com/ci/content/story/1477118.html?ex_cid=OTC-RSS",
  "description": "\"They had that belief that they can give us breakthroughs in the powerplay\"",
  "author": "",
  "published": "Sat, 15 Mar 2025 20:04:57 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ESPNcricinfo staff",
  "length": 4897,
  "excerpt": "\"They had that belief that they can give us breakthroughs in the powerplay\"",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Harmanpreet Kaur has hailed Mumbai Indians' fighting spirit after they withstood severe pressure from Delhi Capitals on their way to an eight-run win in the final of WPL 2025. It was MI's second title in three seasons of the tournament.\"The way we played today, we fought till the last ball, even though we didn't start the way we wanted,\" Harmanpreet, who was also the Player of the Match for her 44-ball 66, said at the presentation. \"But I think it's all about being there, doing the right things again and again, and that's what we were thinking and we were trying [to do].\"Sciver-Brunt, Harmanpreet seal second WPL title for Mumbai IndiansStats - Delhi Capitals' hat-trick of defeats in WPL finalsHarmanpreet came to the crease with MI 14 for 2 in the fifth over, and proceeded to put on a match-turning 89 runs with Nat Sciver-Brunt, who capped a Player-of-the-Tournament-winning season with another superb all-round display, scoring 30 and picking up 3 for 30.\"It wasn't easy when I went to bat, but I had that belief that if I stay there and keep rotating the strike, when Nat is there I don't need to take too much pressure because she's been in great touch and she was doing the job for the team,\" Harmanpreet said. \"I just wanted to support her at that time, and I think that partnership with Nat was amazing. We tried to keep things simple and easy and whoever was there took calculated risks at that time.\"For all that, MI only set a target of 150, which Harmanpreet felt wasn't enough given DC's batting strength. But Sciver-Brunt and Shabnim Ismail gave MI the perfect start in their defence, picking up a wicket each in the powerplay.\"I think 150 was not a decent total [against] DC, but matches like that are always pressure games - 150 in these kind of games always looks like 180. I think credit goes to our bowlers. They had that belief that they can give us breakthroughs in the powerplay. It was good to see Ismail bring important wickets for us, and the other side how Nat bowled. They created that opportunity for us, and they got us [into] the game, really happy with the way everybody in the team bowled today.\"One of Mumbai's great strengths this season has been the proven overseas bowling quartet of Ismail and allrounders Sciver-Brunt, Amelia Kerr and Hayley Matthews. That's still left other, less experienced bowlers to deliver four overs, though, and Harmanpreet was full of praise for Amanjot Kaur, Sanskriti Gupta and Saika Ishaque for doing this role whenever required. In the final, Ishaque took 1 for 16 from her first three overs before Marizanne Kapp went after her in an expensive fourth over.\"We made things very clear for everyone [before the season],\" Harmanpreet said. \"We had very good one-to-one meetings where we tried to [clarify] their roles for the team. We knew we have four experienced bowlers, they can do the job for [us] but it's a T20 and [the other] four overs are always important. We knew that whoever is in the game that day, we'll try to give them that opportunity to do the job for us.\"Today Saika was there, she did a great job for us, she bowled those crucial three overs for us. Before that Amanjot was there and in between Sanskriti did a really good job for us. They knew their role, they knew whenever they are there they have to deliver in the best way. I really enjoy playing with them.\"Lanning: 'One more partnership may have given us a chance'For DC, a third final in three seasons ended with a third defeat, but their captain Meg Lanning didn't see any pattern running through the three losses.\"We haven't been able to put our best performances on the board in the final, which is disappointing, but that's cricket,\" she said. \"It's no fault of anyone's. We came in here as prepped as we could be to do as well as we could, and it just hasn't happened for us. It's been different each time around.\"We're bitterly disappointed, we feel like we put ourselves into a good position to win, but that's the game. You win some, you lose some, and unfortunately we've been on the wrong side.\"Lanning felt 150 was chaseable, and one more partnership could have taken DC over the line.\"We didn't quite get it together with the bat,\" she said. \"I thought chasing 150 was a pretty good target for us, and just one more partnership there for a couple of overs may have given us a chance. But very proud of the group, we put in a good season, we had some really good moments, but yeah, we're all pretty disappointed.\"DC topped the league table, but this meant they came into the final a full eight days after their last game. Lanning didn't think this made any significant difference to the way the final went.\"I'm not sure. Some people will say Mumbai might be tired, so you can't win these things. I don't think there's any right or wrong way to do it. It's about performing well on the night, and Mumbai were too good for us tonight.\"",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/398000/398054.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/harmanpreet-kaur-372317\"\u003eHarmanpreet Kaur\u003c/a\u003e has hailed Mumbai Indians\u0026#39; fighting spirit after they withstood severe pressure from Delhi Capitals on their way to an \u003ca href=\"https://www.espncricinfo.com/series/wpl-2024-25-1463356/delhi-capitals-women-vs-mumbai-indians-women-final-1469319/full-scorecard\"\u003eeight-run win\u003c/a\u003e in the final of WPL 2025. It was MI\u0026#39;s second title in three seasons of the tournament.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;The way we played today, we fought till the last ball, even though we didn\u0026#39;t start the way we wanted,\u0026#34; Harmanpreet, who was also the Player of the Match for her 44-ball 66, said at the presentation. \u0026#34;But I think it\u0026#39;s all about being there, doing the right things again and again, and that\u0026#39;s what we were thinking and we were trying [to do].\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/wpl-2024-25-1463356/delhi-capitals-women-vs-mumbai-indians-women-final-1469319/match-report\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eSciver-Brunt, Harmanpreet seal second WPL title for Mumbai Indians\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/stats-delhi-capitals-hat-trick-of-defeats-in-wpl-finals-1477113\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eStats - Delhi Capitals\u0026#39; hat-trick of defeats in WPL finals\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eHarmanpreet came to the crease with MI 14 for 2 in the fifth over, and proceeded to put on a match-turning 89 runs with \u003ca href=\"https://www.espncricinfo.com/cricketers/nat-sciver-brunt-515905\"\u003eNat Sciver-Brunt\u003c/a\u003e, who capped a Player-of-the-Tournament-winning season with another superb all-round display, scoring 30 and picking up 3 for 30.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It wasn\u0026#39;t easy when I went to bat, but I had that belief that if I stay there and keep rotating the strike, when Nat is there I don\u0026#39;t need to take too much pressure because she\u0026#39;s been in great touch and she was doing the job for the team,\u0026#34; Harmanpreet said. \u0026#34;I just wanted to support her at that time, and I think that partnership with Nat was amazing. We tried to keep things simple and easy and whoever was there took calculated risks at that time.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eFor all that, MI only set a target of 150, which Harmanpreet felt wasn\u0026#39;t enough given DC\u0026#39;s batting strength. But Sciver-Brunt and \u003ca href=\"https://www.espncricinfo.com/cricketers/shabnim-ismail-276997\"\u003eShabnim Ismail\u003c/a\u003e gave MI the perfect start in their defence, picking up a wicket each in the powerplay.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think 150 was not a decent total [against] DC, but matches like that are always pressure games - 150 in these kind of games always looks like 180. I think credit goes to our bowlers. They had that belief that they can give us breakthroughs in the powerplay. It was good to see Ismail bring important wickets for us, and the other side how Nat bowled. They created that opportunity for us, and they got us [into] the game, really happy with the way everybody in the team bowled today.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eOne of Mumbai\u0026#39;s great strengths this season has been the proven overseas bowling quartet of Ismail and allrounders Sciver-Brunt, Amelia Kerr and Hayley Matthews. That\u0026#39;s still left other, less experienced bowlers to deliver four overs, though, and Harmanpreet was full of praise for \u003ca href=\"https://www.espncricinfo.com/cricketers/amanjot-kaur-1255411\"\u003eAmanjot Kaur\u003c/a\u003e, \u003ca href=\"https://www.espncricinfo.com/cricketers/sanskriti-gupta-1464472\"\u003eSanskriti Gupta\u003c/a\u003e and \u003ca href=\"https://www.espncricinfo.com/cricketers/saika-ishaque-597815\"\u003eSaika Ishaque\u003c/a\u003e for doing this role whenever required. In the final, Ishaque took 1 for 16 from her first three overs before Marizanne Kapp went after her in an expensive fourth over.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We made things very clear for everyone [before the season],\u0026#34; Harmanpreet said. \u0026#34;We had very good one-to-one meetings where we tried to [clarify] their roles for the team. We knew we have four experienced bowlers, they can do the job for [us] but it\u0026#39;s a T20 and [the other] four overs are always important. We knew that whoever is in the game that day, we\u0026#39;ll try to give them that opportunity to do the job for us.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Today Saika was there, she did a great job for us, she bowled those crucial three overs for us. Before that Amanjot was there and in between Sanskriti did a really good job for us. They knew their role, they knew whenever they are there they have to deliver in the best way. I really enjoy playing with them.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003ch2\u003eLanning: \u0026#39;One more partnership may have given us a chance\u0026#39;\u003c/h2\u003e\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eFor DC, a third final in three seasons ended with a third defeat, but their captain \u003ca href=\"https://www.espncricinfo.com/cricketers/meg-lanning-329336\"\u003eMeg Lanning\u003c/a\u003e didn\u0026#39;t see any pattern running through the three losses.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We haven\u0026#39;t been able to put our best performances on the board in the final, which is disappointing, but that\u0026#39;s cricket,\u0026#34; she said. \u0026#34;It\u0026#39;s no fault of anyone\u0026#39;s. We came in here as prepped as we could be to do as well as we could, and it just hasn\u0026#39;t happened for us. It\u0026#39;s been different each time around.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We\u0026#39;re bitterly disappointed, we feel like we put ourselves into a good position to win, but that\u0026#39;s the game. You win some, you lose some, and unfortunately we\u0026#39;ve been on the wrong side.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eLanning felt 150 was chaseable, and one more partnership could have taken DC over the line.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We didn\u0026#39;t quite get it together with the bat,\u0026#34; she said. \u0026#34;I thought chasing 150 was a pretty good target for us, and just one more partnership there for a couple of overs may have given us a chance. But very proud of the group, we put in a good season, we had some really good moments, but yeah, we\u0026#39;re all pretty disappointed.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eDC topped the league table, but this meant they came into the final a full eight days after their last game. Lanning didn\u0026#39;t think this made any significant difference to the way the final went.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I\u0026#39;m not sure. Some people will say Mumbai might be tired, so you can\u0026#39;t win these things. I don\u0026#39;t think there\u0026#39;s any right or wrong way to do it. It\u0026#39;s about performing well on the night, and Mumbai were too good for us tonight.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-15T20:00:00Z",
  "modifiedTime": null
}
