{
  "id": "90ad2334-9fe9-4f6c-aa2f-bde98eba2130",
  "title": "Paarl Royals hit by Miller niggle; Ngidi absence concern for South Africa",
  "link": "https://www.espncricinfo.com/ci/content/story/1470725.html?ex_cid=OTC-RSS",
  "description": "David Miller says \"right groin a little tight\", while Marcus Stoinis also limps off for DSG",
  "author": "",
  "published": "Mon, 27 Jan 2025 20:18:41 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Firdose Moonda",
  "length": 3607,
  "excerpt": "David Miller says \"right groin a little tight\", while Marcus Stoinis also limps off for DSG",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsDavid Miller says \"right groin a little tight\", while Marcus Stoinis also limps off for DSGDavid Miller left the field during Paarl Royals' home game  •  CPL T20/Getty ImagesSouth Africa's injury watch ahead of the Champions Trophy has grown after Paarl Royals' captain David Miller left the field in the team's final home game, against Durban's Super Giants.Miller was fielding in the covers in the 14th over, when Marcus Stoinis threaded a ball between two fielders and he was unable to stop it. Two balls later, Miller left the field accompanied by Royals support staff. He walked unassisted, but gingerly, and managed to get up the stairs and into the changeroom.Miller did not bat during the Royals innings and was seen sitting in the changeroom as his side secured a six-wicket win. \"My right groin is a little tight,\" he told SuperSport afterwards. \"It's just a little tweak. Tried to get off before it could get any worse.\"Back injury rules Nortje out of Champions TrophySouth Africa's rash of injured quicks hints at systemic issues for CSAPaarl Royals in playoffs courtesy dominant spin unit, consistent home showAustralia's Champions Trophy prep also took a potential hit when Stoinis, playing in his second match of the SA20, left the field halfway through his third over. Stoinis had earlier hit an unbeaten 55 off 40 balls to give DSG a competitive total and bowled a two-over spell with a return of 1 for 15. He returned for the 18th over, with Paarl needing 24 runs off the last three overs, and bowled three balls before calling on the physio for what appeared to be a hamstring problem. He left the field after a short conversation and Wiaan Mulder had to complete the over.\"He just felt something in his hamstring,\" Keshav Maharaj, DSG captain, said. \"I don't think it was too serious but obviously the logical thing to do as a fast bowler is to go off the field. So I'm sure the medical staff will assess and then communicate with Cricket Australia.\"But I think he'll be okay. He's a soldier, he's a fighter and he's a big unit so I'm sure he'll be okay.\"Royals were also without Lungi Ngidi for a fourth match in succession, and he has missed five of their eight games. Ngidi has only just returned to action after sitting out the entire international summer with a groin injury and indications from the Royals' camp are that he is being eased back into a regular playing schedule. On Saturday, their coach Trevor Penney, indicated Ngidi would return for Royals' match against JSK this Thursday, and the playoffs.\"With Lungi, we know big fast bowlers like him, they sometimes needed a couple of weeks to get back into that full flow and the rhythm. It's a tough thing for fast bowlers. He was out [with a groin injury] for like eight weeks. So he's on a programme where he's almost back now. So we played him in the first few games so he could get some game time. And I'm sure when we go to the Highveld, he's going to be straight back in,\" Penney said.South Africa's white-ball coach Rob Walter will be particularly concerned about Ngidi because of the number of fast bowling injuries in the country, one of which has already affected the Champions Trophy squad. Anrich Nortje was ruled out of the tournament with a back injury while the bowler most likely to replace him, Gerald Coetzee, is out of the SA20 with a hamstring injury. South Africa are yet to name a player in Nortje's place but will have to do so before the ICC's squad deadline on February 11.Firdose Moonda is ESPNcricinfo's correspondent for South Africa and women's cricketGet latest cricket updates on WhatsApp",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/388000/388022.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg width=\"138\" height=\"21\" alt=\"ESPNcricinfo\" src=\"https://wassets.hscicdn.com/static/images/logo.png\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"section-1470725\"\u003e\u003carticle data-id=\"1470725\" data-src=\"/story/sa20-paarl-royals-hit-by-millers-niggle-ngidi-absence-a-concern-for-sa-1470725\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eDavid Miller says \u0026#34;right groin a little tight\u0026#34;, while Marcus Stoinis also limps off for DSG\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/firdose-moonda-315\"\u003e\u003cspan\u003e\u003cimg width=\"40\" height=\"40\" alt=\"Firdose Moonda\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_960,q_50/lsci/db/PICTURES/CMS/388000/388022.6.jpg\" alt=\"David Miller scored 71 not out off 34 balls in his 500th T20, Guyana Amazon Warriors vs Barbados Royals, Providence, Caribbean Premier League, September 25, 2024\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eDavid Miller left the field during Paarl Royals\u0026#39; home game  •  \u003cspan\u003eCPL T20/Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eSouth Africa\u0026#39;s injury watch ahead of the Champions Trophy has grown after Paarl Royals\u0026#39; captain \u003ca href=\"https://www.espncricinfo.com/cricketers/david-miller-321777\"\u003eDavid Miller\u003c/a\u003e left the field in the team\u0026#39;s final home game, against Durban\u0026#39;s Super Giants.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMiller was fielding in the covers in the 14th over, when \u003ca href=\"https://www.espncricinfo.com/cricketers/marcus-stoinis-325012\"\u003eMarcus Stoinis\u003c/a\u003e threaded a ball between two fielders and he was unable to stop it. Two balls later, Miller left the field accompanied by Royals support staff. He walked unassisted, but gingerly, and managed to get up the stairs and into the changeroom.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eMiller did not bat during the Royals innings and was seen sitting in the changeroom as his side secured a six-wicket win. \u0026#34;My right groin is a little tight,\u0026#34; he told SuperSport afterwards. \u0026#34;It\u0026#39;s just a little tweak. Tried to get off before it could get any worse.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/anrich-nortje-ruled-out-of-champions-trophy-2025-with-back-injury-to-miss-rest-of-sa20-too-1469185\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eBack injury rules Nortje out of Champions Trophy\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/south-africa-s-rash-of-injured-quicks-hints-at-systemic-issues-for-csa-1469831\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eSouth Africa\u0026#39;s rash of injured quicks hints at systemic issues for CSA\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/sa20-paarl-royals-in-playoffs-courtesy-dominant-spin-unit-consistent-home-show-1470509\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003ePaarl Royals in playoffs courtesy dominant spin unit, consistent home show\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAustralia\u0026#39;s Champions Trophy prep also took a potential hit when Stoinis, playing in his second match of the SA20, left the field halfway through his third over. Stoinis had earlier hit an unbeaten 55 off 40 balls to give DSG a competitive total and bowled a two-over spell with a return of 1 for 15. He returned for the 18th over, with Paarl needing 24 runs off the last three overs, and bowled three balls before calling on the physio for what appeared to be a hamstring problem. He left the field after a short conversation and Wiaan Mulder had to complete the over.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;He just felt something in his hamstring,\u0026#34; Keshav Maharaj, DSG captain, said. \u0026#34;I don\u0026#39;t think it was too serious but obviously the logical thing to do as a fast bowler is to go off the field. So I\u0026#39;m sure the medical staff will assess and then communicate with Cricket Australia.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;But I think he\u0026#39;ll be okay. He\u0026#39;s a soldier, he\u0026#39;s a fighter and he\u0026#39;s a big unit so I\u0026#39;m sure he\u0026#39;ll be okay.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eRoyals were also without \u003ca href=\"https://www.espncricinfo.com/cricketers/lungi-ngidi-542023\"\u003eLungi Ngidi\u003c/a\u003e for a fourth match in succession, and he has missed five of their eight games. Ngidi has only just returned to action after sitting out the entire international summer with a groin injury and indications from the Royals\u0026#39; camp are that he is being eased back into a regular playing schedule. On Saturday, their coach \u003ca href=\"https://www.espncricinfo.com/cricketers/trevor-penney-18497\"\u003eTrevor Penney\u003c/a\u003e,  indicated Ngidi would return for Royals\u0026#39; match against JSK this Thursday, and the playoffs.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;With Lungi, we know big fast bowlers like him, they sometimes needed a couple of weeks to get back into that full flow and the rhythm. It\u0026#39;s a tough thing for fast bowlers. He was out [with a groin injury] for like eight weeks. So he\u0026#39;s on a programme where he\u0026#39;s almost back now. So we played him in the first few games so he could get some game time. And I\u0026#39;m sure when we go to the Highveld, he\u0026#39;s going to be straight back in,\u0026#34; Penney said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSouth Africa\u0026#39;s white-ball coach Rob Walter will be particularly concerned about Ngidi because of the number of fast bowling injuries in the country, one of which has already affected the Champions Trophy squad. Anrich Nortje was ruled out of the tournament with a back injury while the bowler most likely to replace him, Gerald Coetzee, is out of the SA20 with a hamstring injury. South Africa are yet to name a player in Nortje\u0026#39;s place but will have to do so before the ICC\u0026#39;s squad deadline on February 11.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eFirdose Moonda is ESPNcricinfo\u0026#39;s correspondent for South Africa and women\u0026#39;s cricket\u003c/p\u003e\u003ca href=\"https://whatsapp.com/channel/0029Va5oNnUKGGGLrFKvkH3E\" title=\"Get latest cricket updates on WhatsApp\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cp\u003e\u003ci\u003e\u003c/i\u003e\u003cspan\u003eGet latest cricket updates on WhatsApp\u003c/span\u003e\u003c/p\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-27T17:06:00Z",
  "modifiedTime": null
}
