{
  "id": "9958d85c-e3b0-443e-9b37-6d16f230c205",
  "title": "Williamson hails 'outstanding' Conway after record partnership",
  "link": "https://www.espncricinfo.com/ci/content/story/1472787.html?ex_cid=OTC-RSS",
  "description": "\"Obviously playing one day cricket here when other teams haven't played a lot, is nice\"",
  "author": "",
  "published": "Mon, 10 Feb 2025 17:34:13 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Danyal Rasool",
  "length": 4846,
  "excerpt": "\"Obviously playing one day cricket here when other teams haven't played a lot, is nice\"",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "Sometimes scorecards really do tell the story of a game, and in this case, a cursory glance makes what happened obvious. A Kane Williamson masterclass - his 14th ODI hundred and first since 2019, made light work of a South African total not too far removed from the one that saw Pakistan fall well short on Saturday - helped book New Zealand's place in the final, and earn them three rest days. The former captain said he felt the pitch was there to be taken advantage of, and praised his team-mates, most of all Devon Conway - who came into the side following Rachin Ravindra's freak injury and scored a brisk 97.\"It was great to be out there and be a part of some important partnerships,\" Williamson said after the game. \"Devon Conway was outstanding - he was at his best and got us off to a great start. We were able to put that partnership together that took us a long way into that chase. That was really valuable.\"What looks inexorable in hindsight was anything but certain. South Africa had put on a stiff 304 thanks largely to a stunning onslaught from Matthew Breetzke as he became the first debutant to score 150 in an ODI. They pillaged 108 in the last ten overs with momentum on their side at the lunch break. When New Zealand had subjected Pakistan to a similar assault, they wilted in the second innings, losing wickets in bunches and falling well short.Breetzke bats his way from scratchy to sublime in ODI debut to rememberWilliamson powers New Zealand home, Breetzke's record 150 in vainBut after a steady opening partnership, Conway and Williamson put together a huge stand, taking advantage of some inexperienced South African bowling and a true pitch that only appeared to get better as the day aged. Williamson looked in the form of his life, and appeared to take no risks while continuing to score at a strike rate close to 140. He brought up his century in 72 balls, the second fastest ODI hundred he has scored. The two put on 187 runs off 154 balls for the second wicket, and by the time Conway sliced one to a fielder, the contest was effectively done and dusted.\"The pitch was definitely a better surface [to bat] today,\" he said. \"For whatever reason, I'm not sure. That's part of some of the good learnings, really - different times of the day going into the evening. It came onto the bat quite nicely and it still took a little bit of turn. So it's quite interesting; it's the sort of wicket where if you're able to get breakthroughs, you can apply some pressure. But it was nice we were able to build those partnerships and break the back of the chase. For me, it's about trying to assess conditions and do the best job I can and then be a part of partnerships for the team in whatever role it is. It was tough going - kept quite low in that day time innings. But it did change a bit.\"Williamson understands the value of getting some extra game time in with the Champions Trophy around the corner, but also has the experience of not reading too much into it. This game was played during the day - a timeslot that will not be in play for any game during the Champions Trophy. However, just as New Zealand were ruthless in defence of a total against Pakistan, they were equally clinical at hunting one down today.\"It helps us to try and get as familiar as you can with our roles and how we operate as a unit and also the conditions.\"Kane Williamson\"Obviously playing one day cricket here when other teams haven't probably been playing a huge amount of one day cricket is nice,\" Williamson added. \"It helps us to try and get as familiar as you can with our roles and how we operate as a unit and also the conditions. Having said that, we know that each game is a match in isolation. When you come to a tournament like Champions Trophy, the top eight teams on their day giving the conditions, anyone can beat anybody, so a really competitive tournament. That is exciting, I think, and a great prospect for viewers as well.\"Today, though, a sizeable crowd, considering it was a weekday with two neutral teams, were not thinking of the Champions Trophy. Williamson was the man they had come to see, and as he pointed out, it was his side they seemed to support. And, as he has proved to fans on the other side of the world time and again, he showed Pakistan supporters what it felt to throw their support behind a cricketer who never seems to let anyone down.\"It was great to see a crowd here today,\" Williamson said. \"Pakistan not a part of this match, but heard a few chants for the Kiwis which was nice as well. I suppose we have been here fairly often in recent years and that was great. So it's nice to get a bit of a crowd along to this match and certainly had an outstanding atmosphere in the first one and that was great to be a part of as well.\"Danyal Rasool is ESPNcricinfo's Pakistan correspondent. @Danny61000",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/396300/396388.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eSometimes scorecards really do tell the story of a game, and in this case, a cursory glance makes what happened obvious. A \u003ca href=\"https://www.espncricinfo.com/cricketers/kane-williamson-277906\"\u003eKane Williamson\u003c/a\u003e masterclass - his 14th ODI hundred and first since 2019, made light work of \u003ca href=\"https://www.espncricinfo.com/series/pakistan-tri-nation-series-2024-25-1442210/new-zealand-vs-south-africa-2nd-match-1442221/full-scorecard\"\u003ea South African total\u003c/a\u003e not too far removed from the one that saw Pakistan fall well short on Saturday - helped book New Zealand\u0026#39;s place in the final, and earn them three rest days. The former captain said he felt the pitch was there to be taken advantage of, and praised his team-mates, most of all \u003ca href=\"https://www.espncricinfo.com/cricketers/devon-conway-379140\"\u003eDevon Conway\u003c/a\u003e - who came into the side following Rachin Ravindra\u0026#39;s freak injury and scored a brisk 97.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It was great to be out there and be a part of some important partnerships,\u0026#34; Williamson said after the game. \u0026#34;Devon Conway was outstanding - he was at his best and got us off to a great start. We were able to put that partnership together that took us a long way into that chase. That was really valuable.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWhat looks inexorable in hindsight was anything but certain. South Africa had put on a stiff 304 thanks largely to a stunning onslaught from \u003ca href=\"https://www.espncricinfo.com/cricketers/matthew-breetzke-595267\"\u003eMatthew Breetzke\u003c/a\u003e as he became the first debutant to score 150 in an ODI. They pillaged 108 in the last ten overs with momentum on their side at the lunch break. When New Zealand had subjected Pakistan to a similar assault, they wilted in the second innings, losing wickets in bunches and falling well short.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/pakistan-tri-series-nz-vs-sa-matthew-breetzke-bats-his-way-from-scratchy-to-sublime-in-odi-debut-to-remember-1472783\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eBreetzke bats his way from scratchy to sublime in ODI debut to remember\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/pakistan-tri-nation-series-2024-25-1442210/new-zealand-vs-south-africa-2nd-match-1442221/match-report\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eWilliamson powers New Zealand home, Breetzke\u0026#39;s record 150 in vain\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eBut after a steady opening partnership, Conway and Williamson put together a huge stand, taking advantage of some inexperienced South African bowling and a true pitch that only appeared to get better as the day aged. Williamson looked in the form of his life, and appeared to take no risks while continuing to score at a strike rate close to 140. He brought up his century in 72 balls, the second fastest ODI hundred he has scored. The two put on 187 runs off 154 balls for the second wicket, and by the time Conway sliced one to a fielder, the contest was effectively done and dusted.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;The pitch was definitely a better surface [to bat] today,\u0026#34; he said. \u0026#34;For whatever reason, I\u0026#39;m not sure. That\u0026#39;s part of some of the good learnings, really - different times of the day going into the evening. It came onto the bat quite nicely and it still took a little bit of turn. So it\u0026#39;s quite interesting; it\u0026#39;s the sort of wicket where if you\u0026#39;re able to get breakthroughs, you can apply some pressure. But it was nice we were able to build those partnerships and break the back of the chase. For me, it\u0026#39;s about trying to assess conditions and do the best job I can and then be a part of partnerships for the team in whatever role it is. It was tough going - kept quite low in that day time innings. But it did change a bit.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWilliamson understands the value of getting some extra game time in with the Champions Trophy around the corner, but also has the experience of not reading too much into it. This game was played during the day - a timeslot that will not be in play for any game during the Champions Trophy. However, just as New Zealand were ruthless in defence of a total against Pakistan, they were equally clinical at hunting one down today.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u0026#34;It helps us to try and get as familiar as you can with our roles and how we operate as a unit and also the conditions.\u0026#34;\u003c/p\u003e\u003ccite\u003e\u003cp\u003eKane Williamson\u003c/p\u003e\u003c/cite\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Obviously playing one day cricket here when other teams haven\u0026#39;t probably been playing a huge amount of one day cricket is nice,\u0026#34; Williamson added. \u0026#34;It helps us to try and get as familiar as you can with our roles and how we operate as a unit and also the conditions. Having said that, we know that each game is a match in isolation. When you come to a tournament like Champions Trophy, the top eight teams on their day giving the conditions, anyone can beat anybody, so a really competitive tournament. That is exciting, I think, and a great prospect for viewers as well.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eToday, though, a sizeable crowd, considering it was a weekday with two neutral teams, were not thinking of the Champions Trophy. Williamson was the man they had come to see, and as he pointed out, it was his side they seemed to support. And, as he has proved to fans on the other side of the world time and again, he showed Pakistan supporters what it felt to throw their support behind a cricketer who never seems to let anyone down.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;It was great to see a crowd here today,\u0026#34; Williamson said. \u0026#34;Pakistan not a part of this match, but heard a few chants for the Kiwis which was nice as well. I suppose we have been here fairly often in recent years and that was great. So it\u0026#39;s nice to get a bit of a crowd along to this match and certainly had an outstanding atmosphere in the first one and that was great to be a part of as well.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDanyal Rasool is ESPNcricinfo\u0026#39;s Pakistan correspondent. @Danny61000\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-10T17:22:00Z",
  "modifiedTime": null
}
