{
  "id": "9a2b301f-d08e-47d5-998d-dd54a071c9c6",
  "title": "Wade retires from international cricket, makes swift move to coaching",
  "link": "https://www.espncricinfo.com/ci/content/story/1457477.html?ex_cid=OTC-RSS",
  "description": "The wicketkeeper-batter will continue to play BBL and other franchise T20 tournaments",
  "author": "",
  "published": "Tue, 29 Oct 2024 00:39:45 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "Andrew McGlashan",
  "length": 3145,
  "excerpt": "The wicketkeeper-batter will continue to play BBL and other franchise T20 tournaments",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsThe wicketkeeper-batter will continue to play BBL and other franchise T20 tournamentsMatthew Wade has brought the curtain down on a 13-year international career  •  Getty ImagesMatthew Wade has announced his retirement from international cricket and will immediately transition into a coaching role with Australia for the T20I series against Pakistan next month.Wade was part of Australia's side at the T20 World Cup in June and it had been expected that tournament would mark the end of his international career after he was overlooked for the tour of the UK in September. In March he had retired from red-ball cricket after Tasmania's run to the Sheffield Shield final.Wade to retire from first-class cricket after Sheffield Shield finalRizwan announced white-ball captain; Babar, Afridi, Naseem return for Australia tourAustralia Test players rested for T20Is against Pakistan with captain to be namedWade will continue to play in the BBL for Hobart Hurricanes and some franchise tournaments around the world. He will also now work with what is a reasonably youthful Australia T20I squad which will be coached by Andre Borovec while Andrew McDonald and his other assistants preparing for the Test series against India. Wade will also spend time with Australia's coaching group during the ODI series in an unofficial capacity.\"I was fully aware my international days were most likely over at the end of the last T20 World Cup. My international retirement and coaching has been a constant conversation with George [Bailey] and Andrew [McDonald] over the past six months,\" Wade said.\"Coaching has been on my radar over the last few years and thankfully some great opportunities have come my way, for which I am very grateful and excited.\"\"As my international career closes, I want to thank all of my Australian team-mates, staff and coaches,\" he said. \"I enjoyed the ride as challenging as it can be at international level. Without good people around me I would have never got as much out of myself as I did.\"I also thank my family, mum, dad and sisters for the countless hours they put in over the years getting me to games and training.\"Lastly to Julia and the kids. I can't thank them enough for the sacrifices they have made for me to continue to pursue my dreams. No words can explain how grateful I am to them, none of this would have happened without their support.\"Wade's Test career ended in 2021, during India's previous tour, after he had made a successful return to the side as a specialist batter for the 2019 Ashes where he scored two centuries. His last ODI also came in 2021 when he briefly returned to the team after a gap of four years during the tour of West Indies in the Covid period.\"Congratulations to Matthew on what has been a wonderful international career during which his skill and versatility has made him an outstanding performer across all formats,\" Cricket Australia CEO Nick Hockley said.\"I'm delighted he will add to his massive contribution by coaching the next generation of stars and also continuing to light up the Big Bash with the Hobart Hurricanes.\"Andrew McGlashan is a deputy editor at ESPNcricinfo",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/371900/371999.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://plus.espn.com/cricket?ex_cid=cricinfonav\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cimg height=\"22\" alt=\"espn plus\" src=\"https://wassets.hscicdn.com/static/images/espn_plus_icon_light.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv id=\"section-1457477\"\u003e\u003carticle data-id=\"1457477\" data-src=\"/story/australia-news-matthew-wade-retires-from-international-cricket-makes-swift-move-to-coaching-1457477\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eThe wicketkeeper-batter will continue to play BBL and other franchise T20 tournaments\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/andrew-mcglashan-7\"\u003e\u003cspan\u003e\u003cimg width=\"48\" height=\"48\" alt=\"Andrew McGlashan\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/371900/371999.6.jpg\" alt=\"There it goes: Mathew Wade launches the ball back, India vs Australia, 3rd T20I, Guwahati, November 28, 2023\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMatthew Wade has brought the curtain down on a 13-year international career  •  \u003cspan\u003eGetty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/matthew-wade-230193\"\u003eMatthew Wade\u003c/a\u003e has announced his retirement from international cricket and will immediately transition into a coaching role with Australia for the T20I series against Pakistan next month.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWade was part of Australia\u0026#39;s side at the T20 World Cup in June and it had been expected that tournament would mark the end of his international career after he was overlooked for the tour of the UK in September. In March he had retired from red-ball cricket after Tasmania\u0026#39;s run to the Sheffield Shield final.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/matthew-wade-to-retire-from-first-class-cricket-after-sheffield-shield-final-1424954\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eWade to retire from first-class cricket after Sheffield Shield final\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/pakistan-news-rizwan-captain-babar-afridi-naseem-back-as-pcb-announce-squads-for-tours-of-australia-zimbabwe-1457293\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eRizwan announced white-ball captain; Babar, Afridi, Naseem return for Australia tour\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/australia-test-players-rested-for-t20is-against-pakistan-with-captain-to-be-named-1457367\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\"/\u003e\u003cp\u003eAustralia Test players rested for T20Is against Pakistan with captain to be named\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eWade will continue to play in the BBL for Hobart Hurricanes and some franchise tournaments around the world. He will also now work with what is a \u003ca href=\"https://www.espncricinfo.com/story/australia-test-players-rested-for-t20is-against-pakistan-with-captain-to-be-named-1457367\"\u003ereasonably youthful Australia T20I squad\u003c/a\u003e which will be coached by Andre Borovec while Andrew McDonald and his other assistants preparing for the Test series against India. Wade will also spend time with Australia\u0026#39;s coaching group during the ODI series in an unofficial capacity.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I was fully aware my international days were most likely over at the end of the last T20 World Cup. My international retirement and coaching has been a constant conversation with George [Bailey] and Andrew [McDonald] over the past six months,\u0026#34; Wade said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Coaching has been on my radar over the last few years and thankfully some great opportunities have come my way, for which I am very grateful and excited.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;As my international career closes, I want to thank all of my Australian team-mates, staff and coaches,\u0026#34; he said. \u0026#34;I enjoyed the ride as challenging as it can be at international level. Without good people around me I would have never got as much out of myself as I did.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I also thank my family, mum, dad and sisters for the countless hours they put in over the years getting me to games and training.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Lastly to Julia and the kids. I can\u0026#39;t thank them enough for the sacrifices they have made for me to continue to pursue my dreams. No words can explain how grateful I am to them, none of this would have happened without their support.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWade\u0026#39;s Test career ended in 2021, during India\u0026#39;s previous tour, after he had made a successful return to the side as a specialist batter for the 2019 Ashes where he scored two centuries. His last ODI also came in 2021 when he briefly returned to the team after a gap of four years during the tour of West Indies in the Covid period.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Congratulations to Matthew on what has been a wonderful international career during which his skill and versatility has made him an outstanding performer across all formats,\u0026#34; Cricket Australia CEO Nick Hockley said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I\u0026#39;m delighted he will add to his massive contribution by coaching the next generation of stars and also continuing to light up the Big Bash with the Hobart Hurricanes.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAndrew McGlashan is a deputy editor at ESPNcricinfo\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-29T00:33:00Z",
  "modifiedTime": null
}
