{
  "id": "9fd452e9-ff31-478d-80c2-629268960ac9",
  "title": "All too familiar as England crumble when it matters most",
  "link": "https://www.bbc.com/sport/cricket/articles/c93p425jndlo",
  "description": "England crumble in must-win territory again to suffer an early exit from the Women's T20 World Cup in Dubai.",
  "author": "",
  "published": "Tue, 15 Oct 2024 20:46:34 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "Ffion Wynne",
  "length": 6612,
  "excerpt": "England crumble in must-win territory again to suffer an early exit from the Women's T20 World Cup in Dubai.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Pressure can do strange things in sport. It can provide clarity - Trent Alexander-Arnold can calmly slot in his penalty against Switzerland to book England's place in the semi-final of the European Championships, or Keely Hodgkinson can time her race to perfection for Olympic 800m glory. Or it can provide chaos, which was the unfortunate outcome for England's cricketers at the Women's T20 World Cup in Dubai. Most notably in the field, they crumbled under the weight of expectation - the five dropped catches will take the headlines, but the way their heads dropped so quickly in the face of West Indies' batting aggression was concerning.But more so, is the fact that this is not the first time. Against South Africa in 2023 the body language similarly slumped after things did not got to plan and on the field they looked like 11 individuals rather than one team. The same happened in Dubai, despite coach Jon Lewis and captain Heather Knight's insistence that England have got smarter, have adapted their desire for attacking cricket to suit various situations, and have improved their on-field communication. It is harsh to attribute the 2023 result to Lewis, who was very early in his tenure, and it is harsh to attribute this one to Knight, who was not on the field for the second innings because of a calf injury. But England are the second-best team in the world behind Australia, with a vastly improved domestic system and The Hundred boosting their player stocks and chances to play in high-pressure situations.Of course, T20 cricket is unpredictable and in a 10-team competition with net run-rate playing such a crucial part, the brutal format can see a team knocked out by just one defeat, as England have learned. Still, for England, anything less than a semi-final is a disappointment, a group-stage exit even more unprecedented - especially against a team they have beat in 13 successive T20s and have much less investment and resources.After an unbeaten home summer and a thrilling Ashes series last year which saw England beat world champions Australia in both white-ball formats, Knight's side should have been brimming with confidence and in their first three games they rightfully played in that manner. Again, though, they have fallen short the minute that intensity has been applied. They have talked the talk, but could not walk the walk. Lewis has hammered home his positive intent for the past 18 months and how he wants England to take teams on with their aggression, and it has largely worked. Their dominance over Pakistan and New Zealand this summer was so one-sided it was sometimes difficult to watch and led to a lack of pressure being applied to England.The Ashes fightback last summer provided one of the great sporting narratives with huge crowds at Edgbaston, Lord's and The Oval. Their batters attack the powerplay, Nat Sciver-Brunt is ruthlessly consistent in the middle order with her 360 scoring and they boast three of the best spinners in the world to tie batting opposition in knots. Perhaps the frustrating thing is that during the Ashes, against the world's best, they handled the occasion brilliantly and caught Australia off guard with their confidence. In Dubai, their first-innings 141 felt like enough without quite dealing a hammer blow. Only Sciver-Brunt and, agonisingly Knight before her injury, looked fluent as the early jitters were understandably on show and in the end only 13 boundaries were scored. West Indies struck 22 in two fewer overs. But, it was definitely a defendable total and it was a huge opportunity missed by England because of the dropped catches that seemed to be as contagious as the back-to-school germs in early September. In the end, West Indies played England at their own game. Lewis commented on his disappointment at players \"drifting from the energy and tempo we play at\". Hayley Matthews sent the early warning by taking 14 from Lauren Bell's opening over, and Qiana Joseph followed her lead. It was streaky, it was often reckless, it was not always pretty - but it worked. England made her job a lot easier with drops on six, 31, 35, 42 and 52 - which was her eventual score as Wyatt-Hodge eventually clung on to one - but her simple approach of \"just keep swinging\" had England rattled and they could not respond quickly enough. \"You just feel like the pressure simply got to them. But the way West Indies came out from the start with that intent, they looked stunned,\" said England bowler Tash Farrant on BBC Test Match Special.There will be plenty for England to reflect upon as they enter another busy winter of cricket with a multi-format series against South Africa in November and December before the Ashes in Australia in the new year. But one thing that should not be up for debate is Knight's place as captain. England missed her calmness and her experience. Sciver-Brunt is a phenomenal cricketer, arguably the best England has produced, but carrying the batting, bowling her four overs and then having to lead unexpectedly was too much even for her to handle. Joseph's innings, while brilliantly entertaining, was extraordinarily one-dimensional: plant the front foot, and swing for the hills. With a bit more clarity of thought, England could have gone with a simple bowling plan of hanging the ball outside off stump and forcing her to move, but they kept firing it straight. It could be argued that their tactic worked and England just did not take the chances that Joseph gave, but they seemed quite surprised by just how hard she was able to pummel the ball to the ropes with the chances bursting through.Charlie Dean was the recipient of most of the damage, conceding 46 from four wicketless overs and was also the subject of another bizarre tactical move by being promoted to number six, the highest she has ever batted for England. It seemed unusually defensive from Lewis and England, assuming the thought process was for Dean to rotate the strike and allow Sciver-Brunt and the lower order to play around her. But Dean was dropped first ball going for an audacious sweep and eventually fell to a similar shot off spinner Afy Fletcher, which made little sense considering the power-hitting ability that England possess in Dani Gibson and Sophie Ecclestone, who eventually hit their only six.And while the way that England crumpled without Knight was indicative of her importance, it was also an alarming insight into how poorly prepared they are for her absence in the future. With an Ashes months away and a 50-over World Cup next winter, England need to find ways to handle pressure, and quickly.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/146e/live/72e56380-8b38-11ef-8936-1185f9e7d044.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003ePressure can do strange things in sport. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eIt can provide clarity - Trent Alexander-Arnold can calmly slot in his penalty against Switzerland to book England\u0026#39;s place in the semi-final of the European Championships, or Keely Hodgkinson can time her race to perfection for Olympic 800m glory. \u003c/p\u003e\u003cp\u003eOr it can provide chaos, which was the unfortunate outcome for England\u0026#39;s cricketers at the Women\u0026#39;s T20 World Cup in Dubai. \u003c/p\u003e\u003cp\u003eMost notably in the field, they crumbled under the weight of expectation - the five dropped catches will take the headlines, but the way their heads dropped so quickly in the face of West Indies\u0026#39; batting aggression was concerning.\u003c/p\u003e\u003cp\u003eBut more so, is the fact that this is not the first time. \u003c/p\u003e\u003cp\u003eAgainst South Africa in 2023 the body language similarly slumped after things did not got to plan and on the field they looked like 11 individuals rather than one team. \u003c/p\u003e\u003cp\u003eThe same happened in Dubai, despite coach Jon Lewis and captain Heather Knight\u0026#39;s insistence that England have got smarter, have adapted their desire for attacking cricket to suit various situations, and have improved their on-field communication. \u003c/p\u003e\u003cp\u003eIt is harsh to attribute the 2023 result to Lewis, who was very early in his tenure, and it is harsh to attribute this one to Knight, who was not on the field for the second innings because of a calf injury. \u003c/p\u003e\u003cp\u003eBut England are the second-best team in the world behind Australia, with a vastly improved domestic system and The Hundred boosting their player stocks and chances to play in high-pressure situations.\u003c/p\u003e\u003cp\u003eOf course, T20 cricket is unpredictable and in a 10-team competition with net run-rate playing such a crucial part, the brutal format can see a team knocked out by just one defeat, as England have learned. \u003c/p\u003e\u003cp\u003eStill, for England, anything less than a semi-final is a disappointment, a group-stage exit even more unprecedented - especially against a team they have beat in 13 successive T20s and have much less investment and resources.\u003c/p\u003e\u003cp\u003eAfter an unbeaten home summer and a thrilling Ashes series last year which saw England beat world champions Australia in both white-ball formats, Knight\u0026#39;s side should have been brimming with confidence and in their first three games they rightfully played in that manner. \u003c/p\u003e\u003cp\u003eAgain, though, they have fallen short the minute that intensity has been applied. They have talked the talk, but could not walk the walk. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLewis has hammered home his positive intent for the past 18 months and how he wants England to take teams on with their aggression, and it has largely worked. \u003c/p\u003e\u003cp\u003eTheir dominance over Pakistan and New Zealand this summer was so one-sided it was sometimes difficult to watch and led to a lack of pressure being applied to England.\u003c/p\u003e\u003cp\u003eThe Ashes fightback last summer provided one of the great sporting narratives with huge crowds at Edgbaston, Lord\u0026#39;s and The Oval. \u003c/p\u003e\u003cp\u003eTheir batters attack the powerplay, Nat Sciver-Brunt is ruthlessly consistent in the middle order with her 360 scoring and they boast three of the best spinners in the world to tie batting opposition in knots. \u003c/p\u003e\u003cp\u003ePerhaps the frustrating thing is that during the Ashes, against the world\u0026#39;s best, they handled the occasion brilliantly and caught Australia off guard with their confidence. \u003c/p\u003e\u003cp\u003eIn Dubai, their first-innings 141 felt like enough without quite dealing a hammer blow. Only Sciver-Brunt and, agonisingly Knight before her injury, looked fluent as the early jitters were understandably on show and in the end only 13 boundaries were scored. West Indies struck 22 in two fewer overs. \u003c/p\u003e\u003cp\u003eBut, it was definitely a defendable total and it was a huge opportunity missed by England because of the dropped catches that seemed to be as contagious as the back-to-school germs in early September. \u003c/p\u003e\u003cp\u003eIn the end, West Indies played England at their own game. \u003c/p\u003e\u003cp\u003eLewis commented on his disappointment at players \u0026#34;drifting from the energy and tempo we play at\u0026#34;.  \u003c/p\u003e\u003cp\u003eHayley Matthews sent the early warning by taking 14 from Lauren Bell\u0026#39;s opening over, and Qiana Joseph followed her lead. \u003c/p\u003e\u003cp\u003eIt was streaky, it was often reckless, it was not always pretty - but it worked. England made her job a lot easier with drops on six, 31, 35, 42 and 52 - which was her eventual score as Wyatt-Hodge eventually clung on to one - but her simple approach of \u0026#34;just keep swinging\u0026#34; had England rattled and they could not respond quickly enough. \u003c/p\u003e\u003cp\u003e\u0026#34;You just feel like the pressure simply got to them. But the way West Indies came out from the start with that intent, they looked stunned,\u0026#34; said England bowler Tash Farrant on BBC Test Match Special.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThere will be plenty for England to reflect upon as they enter another busy winter of cricket with a multi-format series against South Africa in November and December before the Ashes in Australia in the new year. \u003c/p\u003e\u003cp\u003eBut one thing that should not be up for debate is Knight\u0026#39;s place as captain. \u003c/p\u003e\u003cp\u003eEngland missed her calmness and her experience. Sciver-Brunt is a phenomenal cricketer, arguably the best England has produced, but carrying the batting, bowling her four overs and then having to lead unexpectedly was too much even for her to handle. \u003c/p\u003e\u003cp\u003eJoseph\u0026#39;s innings, while brilliantly entertaining, was extraordinarily one-dimensional: plant the front foot, and swing for the hills. \u003c/p\u003e\u003cp\u003eWith a bit more clarity of thought, England could have gone with a simple bowling plan of hanging the ball outside off stump and forcing her to move, but they kept firing it straight. \u003c/p\u003e\u003cp\u003eIt could be argued that their tactic worked and England just did not take the chances that Joseph gave, but they seemed quite surprised by just how hard she was able to pummel the ball to the ropes with the chances bursting through.\u003c/p\u003e\u003cp\u003eCharlie Dean was the recipient of most of the damage, conceding 46 from four wicketless overs and was also the subject of another bizarre tactical move by being promoted to number six, the highest she has ever batted for England.  \u003c/p\u003e\u003cp\u003eIt seemed unusually defensive from Lewis and England, assuming the thought process was for Dean to rotate the strike and allow Sciver-Brunt and the lower order to play around her. \u003c/p\u003e\u003cp\u003eBut Dean was dropped first ball going for an audacious sweep and eventually fell to a similar shot off spinner Afy Fletcher, which made little sense considering the power-hitting ability that England possess in Dani Gibson and Sophie Ecclestone, who eventually hit their only six.\u003c/p\u003e\u003cp\u003eAnd while the way that England crumpled without Knight was indicative of her importance, it was also an alarming insight into how poorly prepared they are for her absence in the future. \u003c/p\u003e\u003cp\u003eWith an Ashes months away and a 50-over World Cup next winter, England need to find ways to handle pressure, and quickly. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-15T20:46:34.353Z",
  "modifiedTime": null
}
