{
  "id": "a2e2f768-2c1e-41a0-b1d8-6835d7abfc63",
  "title": "Ben Stokes Adamant Jofra Archer 'Desperate' For England Return",
  "link": "https://sports.ndtv.com/cricket/ben-stokes-adamant-jofra-archer-desperate-for-england-return-8711506#publisher=newsstand",
  "description": "For all his undeniable talent, a succession of injury problems have blighted the Sussex speedster's career.",
  "author": "",
  "published": "Fri, 20 Jun 2025 00:07:56 +0530",
  "source": "http://feeds.feedburner.com/ndtvsports-cricket",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 2639,
  "excerpt": "For all his undeniable talent, a succession of injury problems have blighted the Sussex speedster's career.",
  "siteName": "NDTV Sports",
  "favicon": "",
  "text": "Jofra Archer played the last of his 13 Tests in February 2021.© BCCI England captain Ben Stokes says Jofra Archer is \"absolutely desperate\" to be involved in the upcoming home series against India and so revive a Test career that has been stalled for more than four years. Archer enjoyed a spectacular start with England in 2019.  The Barbados-born fast bowler played a key role in the team's 50-over World Cup final win at Lord's and made his presence felt in a dramatic drawn Ashes series with Australia. For all his undeniable talent, a succession of injury problems have blighted the Sussex speedster's career. Archer played the last of his 13 Tests in February 2021.England have kept faith with Archer. He is due to make his first-class return for Sussex against Durham on Sunday as part of a plan that could see him feature during a five-match series with India that starts at Headingley on Friday.Archer's latest rehabilitation has been delayed by a broken thumb, although that did not stop the 30-year-old pushing for what might have been a rushed return in last month's one-off Test against Zimbabwe.\"He's been absolutely desperate to put the white shirt back on,\" Stokes told a pre-match press conference at Headingley on Thursday. \"Randomly, a couple of times, he would just send me a text saying, 'Zim?'\"I was like, 'let's just hold it there, all right. I know you're in a good spot right now, but let's not just rush into it'.\"Stokes added: \"He's obviously had a horrific time with injuries, but he's had some good amount of cricket, albeit in the white-ball formats.\"It's really exciting for England, but also more exciting for Jof that he's in a position now where we're able to have a plan in place and hopefully him get through something to actually be considered for selection for Test cricket.\"Express quick Archer's return would be a boost to England's attack as they prepare to face two major rivals over the next seven months, with an Ashes tour of Australia following the India series.Were he to become an Ashes-winning skipper 'Down Under', Stokes would join a select group of England captains, although the all-rounder himself says he is not concerned by his place in cricket history.\"Defining a career as England captain isn't something that I sit there and really think about, honestly,\" he said. \"If that's what I'm really bothered about, in my opinion it's just completely and utterly selfish and that ain't me.\"jdg/pb(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.) Topics mentioned in this article",
  "image": "https://c.ndtvimg.com/2021-02/adr8a0c8_jofra-archer-bcci_625x300_11_February_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"639\" height=\"479\" src=\"https://c.ndtvimg.com/2021-02/adr8a0c8_jofra-archer-bcci_625x300_11_February_21.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605\" title=\"Ben Stokes Adamant Jofra Archer \u0026#39;Desperate\u0026#39; For England Return\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eJofra Archer played the last of his 13 Tests in February 2021.\u003cspan\u003e© BCCI\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv data-maxheight=\"190\"\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eEngland captain Ben Stokes says Jofra Archer is \u0026#34;absolutely desperate\u0026#34; to be involved in the upcoming home series against India and so revive a Test career that has been stalled for more than four years. Archer enjoyed a spectacular start with England in 2019.  The Barbados-born fast bowler played a key role in the team\u0026#39;s 50-over World Cup final win at Lord\u0026#39;s and made his presence felt in a dramatic drawn Ashes series with Australia. For all his undeniable talent, a succession of injury problems have blighted the Sussex speedster\u0026#39;s career. Archer played the last of his 13 Tests in February 2021.\u003c/p\u003e\u003cp\u003eEngland have kept faith with Archer. He is due to make his first-class return for Sussex against Durham on Sunday as part of a plan that could see him feature during a five-match series with India that starts at Headingley on Friday.\u003c/p\u003e\u003cp\u003eArcher\u0026#39;s latest rehabilitation has been delayed by a broken thumb, although that did not stop the 30-year-old pushing for what might have been a rushed return in last month\u0026#39;s one-off Test against Zimbabwe.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s been absolutely desperate to put the white shirt back on,\u0026#34; Stokes told a pre-match press conference at Headingley on Thursday. \u0026#34;Randomly, a couple of times, he would just send me a text saying, \u0026#39;Zim?\u0026#39;\u003c/p\u003e\u003cp\u003e\u0026#34;I was like, \u0026#39;let\u0026#39;s just hold it there, all right. I know you\u0026#39;re in a good spot right now, but let\u0026#39;s not just rush into it\u0026#39;.\u0026#34;\u003c/p\u003e\u003cp\u003eStokes added: \u0026#34;He\u0026#39;s obviously had a horrific time with injuries, but he\u0026#39;s had some good amount of cricket, albeit in the white-ball formats.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s really exciting for England, but also more exciting for Jof that he\u0026#39;s in a position now where we\u0026#39;re able to have a plan in place and hopefully him get through something to actually be considered for selection for Test cricket.\u0026#34;\u003c/p\u003e\u003cp\u003eExpress quick Archer\u0026#39;s return would be a boost to England\u0026#39;s attack as they prepare to face two major rivals over the next seven months, with an Ashes tour of Australia following the India series.\u003c/p\u003e\u003cp\u003eWere he to become an Ashes-winning skipper \u0026#39;Down Under\u0026#39;, Stokes would join a select group of England captains, although the all-rounder himself says he is not concerned by his place in cricket history.\u003c/p\u003e\u003cp\u003e\u0026#34;Defining a career as England captain isn\u0026#39;t something that I sit there and really think about, honestly,\u0026#34; he said. \u0026#34;If that\u0026#39;s what I\u0026#39;m really bothered about, in my opinion it\u0026#39;s just completely and utterly selfish and that ain\u0026#39;t me.\u0026#34;\u003c/p\u003e\u003cp\u003ejdg/pb\u003c/p\u003e\u003cp\u003e\u003ci\u003e(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTopics mentioned in this article \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-20T00:07:54+05:30",
  "modifiedTime": null
}
