{
  "id": "b2752c72-a95e-4e53-b701-22a2dede49c9",
  "title": "Labuschagne: 'Anyone's guess' who will open, but Smith at No. 4 'pretty simple fix'",
  "link": "https://www.espncricinfo.com/ci/content/story/1456674.html?ex_cid=OTC-RSS",
  "description": "The incumbent No. 3 has been suggested as an opening candidate although he believes the selectors will opt for a specialist",
  "author": "",
  "published": "Wed, 23 Oct 2024 23:30:15 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "AAP",
  "length": 2708,
  "excerpt": "The incumbent No. 3 has been suggested as an opening candidate although he believes the selectors will opt for a specialist",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "NewsThe incumbent No. 3 has been suggested as an opening candidate although he believes the selectors will opt for a specialist AAP23-Oct-2024 • 1 hr agoMarnus Labuschagne's name has been suggested for a move up to open  •  Getty ImagesMarnus Labuschagne says the race for the vacant Test opening spot is an open field, but insists it is fitting Steven Smith is no longer in that frame after his guaranteed switch back to No. 4 for the India series.Smith, speaking this week about the termination of his opening experiment, said Test opener Usman Khawaja and No. 3 Labuschagne made it clear they preferred him to bat behind them.\"They hated me up top...so that was a big part of it,\" Smith  said. \"They call it security behind them - I don't know, ask them about it. Honestly, I'm not that fussed. They didn't like it at all...I can understand that.\"Labuschagne said Smith's return to the position he had shone in for most of his career was not rocket science.\"One of the best players for Australia batting in the position he has had the most success in is a pretty simple fix,\" he said. \"Cameron Green is unavailable for the summer. There is no one batting at No. 4 as we currently stand in our team. Why not have the person who has done it best for Australia batting in that position? It just makes sense.\"People want to know if there is something more [to it], but that is the reality.\"Labuschagne added Smith was naturally suited to the spot.\"I think it is his ability to read match scenarios and adapt his game to whatever the game needs,\" he said. \"At No. 4 you have to be good at playing spin, work on when you need to push, when you need to hold and when you need to get through a tough spell. That has always been his strength.\"\"I don't know if he was serious or whether he was joking. It is always hard to tell,\" he chuckled. \"I don't know what to make of that.\"Warner had also floated the possibility of Labuschagne moving up the order to fill the void, a concept the Test No. 3 answered forthrightly.\"I will bat wherever they tell me to bat. Currently I would say that how I have played at No. 3 has been relatively successful,\" he said.\"Hopefully it should be more successful, but that's where I have batted. If [selectors] think I should move and that is best for the team that is what will happen, but at this stage I think they have made it clear they are going to look down the opener route. Who that is...is anyone's guess. It is a very open field.\"New South Wales teenager Sam Konstas, Victorian opener Marcus Harris and Western Australia's suddenly out-of-form Cameron Bancroft are the three specialist openers in contention and all will feature for Australia A against India A next week.",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/388700/388723.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"__next\"\u003e\u003cdiv\u003e\u003cnav\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/\"\u003e\u003cimg src=\"https://wassets.hscicdn.com/static/images/logo.png\" alt=\"ESPNcricinfo\" width=\"138\" height=\"21\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://plus.espn.com/cricket?ex_cid=cricinfonav\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cimg height=\"22\" alt=\"espn plus\" src=\"https://wassets.hscicdn.com/static/images/espn_plus_icon_light.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/nav\u003e\u003c/div\u003e\u003cdiv id=\"section-1456674\"\u003e\u003carticle data-id=\"1456674\" data-src=\"/story/australia-news-marnus-labuschagne-anyones-guess-who-will-open-but-smith-at-no-4-pretty-simple-fix-1456674\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003ca href=\"https://www.espncricinfo.com/genre/news-1\" title=\"News\"\u003e\u003cspan\u003eNews\u003c/span\u003e\u003c/a\u003e\u003cp\u003eThe incumbent No. 3 has been suggested as an opening candidate although he believes the selectors will opt for a specialist \u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/author/aap-774\" title=\"AAP\"\u003e\u003cspan\u003eAAP\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e23-Oct-2024 • 1 hr ago\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://img1.hscicdn.com/image/upload/f_auto,t_ds_wide_w_1280,q_70/lsci/db/PICTURES/CMS/388700/388723.6.jpg\" alt=\"Marnus Labuschagne drives down the ground, Western Australia vs Queensland, day 1, Sheffield Shield, WACA ground, October 9, 2024\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMarnus Labuschagne\u0026#39;s name has been suggested for a move up to open  •  \u003cspan\u003eGetty Images\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u003ca href=\"https://www.espncricinfo.com/cricketers/marnus-labuschagne-787987\"\u003eMarnus Labuschagne\u003c/a\u003e says the race for the vacant Test opening spot is an open field, but insists it is fitting \u003ca href=\"https://www.espncricinfo.com/cricketers/steven-smith-267192\"\u003eSteven Smith\u003c/a\u003e is no longer in that frame after his guaranteed switch back to No. 4 for the India series.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eSmith, speaking this week about the termination of his opening experiment, said Test opener Usman Khawaja and No. 3 Labuschagne made it clear they \u003ca href=\"https://www.espncricinfo.com/story/australia-news-steven-smith-marnus-labuschagne-and-usman-khawaja-hated-me-opening-1456394\"\u003epreferred him to bat behind them\u003c/a\u003e.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;They hated me up top...so that was a big part of it,\u0026#34; Smith  said. \u0026#34;They call it security behind them - I don\u0026#39;t know, ask them about it. Honestly, I\u0026#39;m not that fussed. They didn\u0026#39;t like it at all...I can understand that.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eLabuschagne said Smith\u0026#39;s return to the position he had shone in for most of his career was not rocket science.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;One of the best players for Australia batting in the position he has had the most success in is a pretty simple fix,\u0026#34; he said. \u0026#34;Cameron Green is unavailable for the summer. There is no one batting at No. 4 as we currently stand in our team. Why not have the person who has done it best for Australia batting in that position? It just makes sense.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;People want to know if there is something more [to it], but that is the reality.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eLabuschagne added Smith was naturally suited to the spot.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think it is his ability to read match scenarios and adapt his game to whatever the game needs,\u0026#34; he said. \u0026#34;At No. 4 you have to be good at playing spin, work on when you need to push, when you need to hold and when you need to get through a tough spell. That has always been his strength.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t know if he was serious or whether he was joking. It is always hard to tell,\u0026#34; he chuckled. \u0026#34;I don\u0026#39;t know what to make of that.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eWarner had also floated the possibility of Labuschagne moving up the order to fill the void, a concept the Test No. 3 answered forthrightly.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I will bat wherever they tell me to bat. Currently I would say that how I have played at No. 3 has been relatively successful,\u0026#34; he said.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Hopefully it should be more successful, but that\u0026#39;s where I have batted. If [selectors] think I should move and that is best for the team that is what will happen, but at this stage I think they have made it clear they are going to look down the opener route. Who that is...is anyone\u0026#39;s guess. It is a very open field.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eNew South Wales teenager Sam Konstas, Victorian opener Marcus Harris and Western Australia\u0026#39;s suddenly out-of-form Cameron Bancroft are the three specialist openers in contention and all will feature for Australia A against India A next week.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-23T23:23:00Z",
  "modifiedTime": null
}
