{
  "id": "b7149a32-f2cc-4ac4-894c-4116393456bc",
  "title": "Kohli: 'Applied ourselves well after three average games at home'",
  "link": "https://www.espncricinfo.com/ci/content/story/1482845.html?ex_cid=OTC-RSS",
  "description": "After they won their first home game of IPL 2025, Kohli felt RCB were finally getting to grips with their batting template at the Chinnaswamy",
  "author": "",
  "published": "Thu, 24 Apr 2025 19:32:15 GMT",
  "source": "http://www.espncricinfo.com/rss/content/story/feeds/0.xml",
  "categories": null,
  "byline": "ESPNcricinfo staff",
  "length": 3588,
  "excerpt": "After they won their first home game of IPL 2025, Kohli felt RCB were finally getting to grips with their batting template at the Chinnaswamy",
  "siteName": "ESPNcricinfo",
  "favicon": "https://wassets.hscicdn.com/static/images/ios-180.png",
  "text": "After three consecutive home defeats featuring underwhelming batting displays, Royal Challengers Bengaluru (RCB) finally posted a total north of 200 at the M Chinnaswamy Stadium to set up a thrilling win over Rajasthan Royals (RR). Virat Kohli, who top-scored with 70, said the batting unit had discussed what they needed to do differently, and on Thursday they were able to apply themselves and find a template that worked.\"We've had three pretty average games at home and we discussed a few things in the batting unit that we need to get right and I think we applied ourselves well enough today to get that total on the board,\" Kohli told the host broadcaster after RCB's first home win of IPL 2025. \"We felt like the pitch wasn't as flat as the score displayed on the scoreboard.\"Unlike in their previous three home games, where they lost at least three wickets in the powerplay trying to take on the bowlers, RCB got through the first six overs against RR with all their wickets intact. And after Phil Salt became the first batter dismissed in the seventh over, Kohli and Devdutt Padikkal put on a 95-run stand to set up a grand finish.How's the Josh? Too goodKohli and Hazlewood break RCB's home duck as RR botch another chaseParag: We didn't show enough intent against the spinners\"I think the template is simple, you know, one of the guys to kind of bat through and the others to kind of attack around him,\" Kohli said. \"So I have that responsibility. I know this pitch very well, so does Devdutt. So yeah, that was basically the plan. Let Salty do his thing and then once we have a couple of wickets down, then really capitalise and rebuild and yeah, today it paid off.\"On the eve of the match, RCB captain Rajat Patidar had called on the batters to focus on their shot selection, and Kohli underlined the change in approach that helped them on Thursday.\"There's pace and bounce in the first three-four overs with the new ball, especially in the first innings. So I think we were trying to force the shots a bit too much in the last three games.\"Today, we kind of let the ball come to us and, you know, really time the ball into the gaps and I think that was the adjustment and the application that I spoke about to assess the pitch and then find our options and then hopefully put enough pressure on the opposition for them to keep giving us boundary balls, which was the case today and we were able to capitalise on those.\"RCB posted 205 for 5, a total that RR fell 11 runs short of despite looking comfortable for large parts of their chase. That RCB prevailed was thanks largely to Josh Hazlewood's excellent spell at the death.\"[205] was enough in the end, but at one stage, I thought maybe [we needed] a few more,\" Kohli said. \"That's the tricky part right now. We've figured out a way to bat now, so [the batters] have more confidence.\"So heading into the last three more home games, I think we should be in a better position to try and get those 25-30 extra runs.\"Kohli highlighted the importance of the toss in Bengaluru, citing dew as an important factor helping chasing teams. For the fourth home game in a row, Patidar lost the toss on Thursday.\"I think the first challenge is to win the toss, to be honest, because the first half and second half … the second half you kind of have a look at the pitch,\" Kohli said. \"Also, the dew comes in, so it becomes a bit of an advantage. So we've been fighting hard to kind of get the total on the board in the first innings. We've fallen short by 25-30.\"Today, we were able to get past 200, so that always kept us in the game.\"",
  "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/399700/399772.6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAfter three consecutive home defeats featuring underwhelming batting displays, Royal Challengers Bengaluru (RCB) finally posted a total north of 200 at the M Chinnaswamy Stadium to set up \u003ca href=\"https://www.espncricinfo.com/series/ipl-2025-1449924/royal-challengers-bengaluru-vs-rajasthan-royals-42nd-match-1473479/full-scorecard\"\u003ea thrilling win\u003c/a\u003e over Rajasthan Royals (RR). \u003ca href=\"https://www.espncricinfo.com/cricketers/virat-kohli-253802\"\u003eVirat Kohli\u003c/a\u003e, who top-scored with 70, said the batting unit had discussed what they needed to do differently, and on Thursday they were able to apply themselves and find a template that worked.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve had three pretty average games at home and we discussed a few things in the batting unit that we need to get right and I think we applied ourselves well enough today to get that total on the board,\u0026#34; Kohli told the host broadcaster after RCB\u0026#39;s first home win of \u003ca href=\"https://www.espncricinfo.com/series/ipl-2025-1449924\"\u003eIPL 2025\u003c/a\u003e. \u0026#34;We felt like the pitch wasn\u0026#39;t as flat as the score displayed on the scoreboard.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eUnlike in their previous three home games, where they lost at least three wickets in the powerplay trying to take on the bowlers, RCB got through the first six overs against RR with all their wickets intact. And after Phil Salt became the first batter dismissed in the seventh over, Kohli and \u003ca href=\"https://www.espncricinfo.com/cricketers/devdutt-padikkal-1119026\"\u003eDevdutt Padikkal\u003c/a\u003e put on a 95-run stand to set up a grand finish.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/ipl-2025-josh-hazlewood-too-good-for-rr-at-the-death-1482854\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eHow\u0026#39;s the Josh? Too good\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/series/ipl-2025-1449924/royal-challengers-bengaluru-vs-rajasthan-royals-42nd-match-1473479/match-report\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eKohli and Hazlewood break RCB\u0026#39;s home duck as RR botch another chase\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.espncricinfo.com/story/rcb-vs-rr-ipl-2025-riyan-parag-we-didn-t-show-enough-intent-against-the-spinners-1482839\"\u003e\u003cimg width=\"64\" height=\"64\" alt=\"Story Image\" src=\"https://wassets.hscicdn.com/static/images/lazyimage-noaspect.svg\" fetchpriority=\"auto\"/\u003e\u003cp\u003eParag: We didn\u0026#39;t show enough intent against the spinners\u003c/p\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think the template is simple, you know, one of the guys to kind of bat through and the others to kind of attack around him,\u0026#34; Kohli said. \u0026#34;So I have that responsibility. I know this pitch very well, so does Devdutt. So yeah, that was basically the plan. Let Salty do his thing and then once we have a couple of wickets down, then really capitalise and rebuild and yeah, today it paid off.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eOn the eve of the match, RCB captain Rajat Patidar had called on the batters to \u003ca href=\"https://www.espncricinfo.com/story/rajat-patidar-urges-rcb-batters-to-focus-on-shot-selection-to-break-home-jinx-against-rr-1482700\"\u003efocus on their shot selection\u003c/a\u003e, and Kohli underlined the change in approach that helped them on Thursday.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;There\u0026#39;s pace and bounce in the first three-four overs with the new ball, especially in the first innings. So I think we were trying to force the shots a bit too much in the last three games.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Today, we kind of let the ball come to us and, you know, really time the ball into the gaps and I think that was the adjustment and the application that I spoke about to assess the pitch and then find our options and then hopefully put enough pressure on the opposition for them to keep giving us boundary balls, which was the case today and we were able to capitalise on those.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eRCB posted 205 for 5, a total that RR fell 11 runs short of despite looking comfortable for large parts of their chase. That RCB prevailed was thanks largely to Josh Hazlewood\u0026#39;s excellent spell at the death.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;[205] was enough in the end, but at one stage, I thought maybe [we needed] a few more,\u0026#34; Kohli said. \u0026#34;That\u0026#39;s the tricky part right now. We\u0026#39;ve figured out a way to bat now, so [the batters] have more confidence.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;So heading into the last three more home games, I think we should be in a better position to try and get those 25-30 extra runs.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003eKohli highlighted the importance of the toss in Bengaluru, citing dew as an important factor helping chasing teams. For the fourth home game in a row, Patidar lost the toss on Thursday.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;I think the first challenge is to win the toss, to be honest, because the first half and second half … the second half you kind of have a look at the pitch,\u0026#34; Kohli said. \u0026#34;Also, the dew comes in, so it becomes a bit of an advantage. So we\u0026#39;ve been fighting hard to kind of get the total on the board in the first innings. We\u0026#39;ve fallen short by 25-30.\u003c/p\u003e\u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u0026#34;Today, we were able to get past 200, so that always kept us in the game.\u0026#34;\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-24T19:26:00Z",
  "modifiedTime": null
}
