{
  "id": "f7fd84dd-657f-455d-99f6-1beafab1c96f",
  "title": "England did not lose because of athleticism - Lewis",
  "link": "https://www.bbc.com/sport/cricket/articles/c9vmrd1dg9zo",
  "description": "Australia are more athletic and powerful than England - but that is not the reason for the gulf between the two teams, says head coach Jon Lewis.",
  "author": "",
  "published": "Fri, 24 Jan 2025 11:27:20 GMT",
  "source": "http://feeds.bbci.co.uk/sport/cricket/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 4274,
  "excerpt": "Australia are more athletic and powerful than England - but that is not the reason for the gulf between the two teams, says head coach Jon Lewis.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Australia are more athletic, agile and powerful than England - but that is not the reason for the gulf between the two teams in the Women's Ashes, says head coach Jon Lewis.England are 10-0 down on points in the multi-format series, with Australia saying they want to clean sweep the tourists and \"embarrass\" them.One of the areas where the gap is most apparent is in the field, where England have suffered from a number of dropped catches and mistakes in contrast to some world-class efforts by Australia.\"I would say yeah they are, they're a much more athletic team than us, they're more agile, they look faster, at times they look more powerful,\" said Lewis.\"Is that the reason that we're not winning cricket matches here in this country? No.\"I think their discipline and their skill level has been higher. It's an area of the game that we work on continually - all of our players do - and work really hard on it.\"After England were knocked out of the 2024 T20 World Cup following an abject fielding display, ex-England spinner Alex Hartley said some England players were \"letting the team down when it comes to fitness\".Before the Ashes, Hartley's assertion was rejected by Lewis, who pointed to the climate benefits Australia have - using the example of his 11-year-old son, who he has to \"push out the door\" for football practice when it's \"minus five and raining sideways\".Lewis added: \"I walked from Bondi to Coogee the other Sunday morning and pretty much the whole of the eastern suburbs of Sydney were out swimming in the sea and running and walking so you're like, there's a cultural difference there as well in terms of Australia versus England, as well as there is England versus India or India versus South Africa. So comparing the two nations I think is slightly different.\"We definitely need to get faster and we can access more power for sure. If you're talking about whether or not we can run marathons, we don't need to. We need to be fit for purpose.\"During the three ODIs, England managed a highest total of 222 and in the two T20s so far, they were bowled out for 141 chasing 199 before an improved showing in Canberra saw Knight's side fall six runs short chasing 186. England's next chance to get points on the board comes in the final T20 in Adelaide on Saturday, before the day-night Test at the Melbourne Cricket Ground starts on 30 January. Lewis said they are still searching for a complete performance in order to challenge Australia. \"You haven't seen the best version of this team on this tour, but there is so much potential,\" said Lewis.\"If you look at the drawn Ashes in 2023, I think we poked the bear a little bit.\"They've gone away and reset. The scoreline is bigger but I don't think the gap is bigger. \"We won those critical moments in games last time, and they have turned them on their side in this series. We are clearly disappointed we haven't got the results but I think we've been more competitive than the scoreline suggests.\"It was the first time during the eventful tour that Lewis had faced the media and addressed the recent controversy that has followed his side. After England's first T20 defeat in Sydney, it was revealed spinner Sophie Ecclestone had refused a television interview with Hartley, after the comments she had made criticising the team's fitness. Hartley, who did not name Ecclestone or any player in her initial comments, said she had received \"the cold shoulder\" from some members of the team.When asked about his future after this tour, Lewis said: \"I love this job, and I am committed to making them a better team.\"I expected this to be a really, really hard tour for us to come and compete and win.\"They're an exceptional team, playing on a home soil, they have been world-beating for a long period of time and we've got a developing group of cricketers.\"The third T20 could see some players rested, including fast bowler Lauren Bell who has played in every game so far, as they prepare for the challenge of the Test match, which could see experienced seamer Kate Cross feature for the first time on the tour after her troubles with a back injury.For Australia, they are waiting on the fitness of captain Alyssa Healy who has a foot problem, and all-rounder Ash Gardner's recovery from a calf niggle.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30e5/live/2348c700-da47-11ef-a37f-eba91255dc3d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAustralia are more athletic, agile and powerful than England - but that is not the reason for the gulf between the two teams in the Women\u0026#39;s Ashes, says head coach Jon Lewis.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eEngland are 10-0 down on points in the multi-format series, with Australia saying they want to clean sweep the tourists and \u0026#34;embarrass\u0026#34; them.\u003c/p\u003e\u003cp\u003eOne of the areas where the gap is most apparent is in the field, where England have suffered from a number of dropped catches and mistakes in contrast to some world-class efforts by Australia.\u003c/p\u003e\u003cp\u003e\u0026#34;I would say yeah they are, they\u0026#39;re a much more athletic team than us, they\u0026#39;re more agile, they look faster, at times they look more powerful,\u0026#34; said Lewis.\u003c/p\u003e\u003cp\u003e\u0026#34;Is that the reason that we\u0026#39;re not winning cricket matches here in this country? No.\u003c/p\u003e\u003cp\u003e\u0026#34;I think their discipline and their skill level has been higher. It\u0026#39;s an area of the game that we work on continually - all of our players do - and work really hard on it.\u0026#34;\u003c/p\u003e\u003cp\u003eAfter England were knocked out of the 2024 T20 World Cup following an abject fielding display, ex-England spinner Alex Hartley said some England players were \u0026#34;letting the team down when it comes to fitness\u0026#34;.\u003c/p\u003e\u003cp\u003eBefore the Ashes, Hartley\u0026#39;s assertion was rejected by Lewis, who pointed to the climate benefits Australia have - using the example of his 11-year-old son, who he has to \u0026#34;push out the door\u0026#34; for football practice when it\u0026#39;s \u0026#34;minus five and raining sideways\u0026#34;.\u003c/p\u003e\u003cp\u003eLewis added: \u0026#34;I walked from Bondi to Coogee the other Sunday morning and pretty much the whole of the eastern suburbs of Sydney were out swimming in the sea and running and walking so you\u0026#39;re like, there\u0026#39;s a cultural difference there as well in terms of Australia versus England, as well as there is England versus India or India versus South Africa. So comparing the two nations I think is slightly different.\u003c/p\u003e\u003cp\u003e\u0026#34;We definitely need to get faster and we can access more power for sure. If you\u0026#39;re talking about whether or not we can run marathons, we don\u0026#39;t need to. We need to be fit for purpose.\u0026#34;\u003c/p\u003e\u003cp\u003eDuring the three ODIs, England managed a highest total of 222 and in the two T20s so far, they were bowled out for 141 chasing 199 before an improved showing in Canberra saw Knight\u0026#39;s side fall six runs short chasing 186. \u003c/p\u003e\u003cp\u003eEngland\u0026#39;s next chance to get points on the board comes in the final T20 in Adelaide on Saturday, before the day-night Test at the Melbourne Cricket Ground starts on 30 January. \u003c/p\u003e\u003cp\u003eLewis said they are still searching for a complete performance in order to challenge Australia. \u003c/p\u003e\u003cp\u003e\u0026#34;You haven\u0026#39;t seen the best version of this team on this tour, but there is so much potential,\u0026#34; said Lewis.\u003c/p\u003e\u003cp\u003e\u0026#34;If you look at the drawn Ashes in 2023, I think we poked the bear a little bit.\u003c/p\u003e\u003cp\u003e\u0026#34;They\u0026#39;ve gone away and reset. The scoreline is bigger but I don\u0026#39;t think the gap is bigger. \u003c/p\u003e\u003cp\u003e\u0026#34;We won those critical moments in games last time, and they have turned them on their side in this series. We are clearly disappointed we haven\u0026#39;t got the results but I think we\u0026#39;ve been more competitive than the scoreline suggests.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIt was the first time during the eventful tour that Lewis had faced the media and addressed the recent controversy that has followed his side. \u003c/p\u003e\u003cp\u003eAfter England\u0026#39;s first T20 defeat in Sydney, it was revealed spinner Sophie Ecclestone had refused a television interview with Hartley, after the comments she had made criticising the team\u0026#39;s fitness. \u003c/p\u003e\u003cp\u003eHartley, who did not name Ecclestone or any player in her initial comments, said she had received \u003ca href=\"https://www.bbc.com/sport/cricket/articles/clyn1pz2ez9o\"\u003e\u0026#34;the cold shoulder\u0026#34;\u003c/a\u003e from some members of the team.\u003c/p\u003e\u003cp\u003eWhen asked about his future after this tour, Lewis said: \u0026#34;I love this job, and I am committed to making them a better team.\u003c/p\u003e\u003cp\u003e\u0026#34;I expected this to be a really, really hard tour for us to come and compete and win.\u003c/p\u003e\u003cp\u003e\u0026#34;They\u0026#39;re an exceptional team, playing on a home soil, they have been world-beating for a long period of time and we\u0026#39;ve got a developing group of cricketers.\u0026#34;\u003c/p\u003e\u003cp\u003eThe third T20 could see some players rested, including fast bowler Lauren Bell who has played in every game so far, as they prepare for the challenge of the Test match, which could see experienced seamer Kate Cross feature for the first time on the tour after her troubles with a back injury.\u003c/p\u003e\u003cp\u003eFor Australia, they are waiting on the fitness of captain Alyssa Healy who has a foot problem, and all-rounder Ash Gardner\u0026#39;s recovery from a calf niggle. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-24T11:27:20.082Z",
  "modifiedTime": null
}
