[
  {
    "id": "5a2851f9-6ba4-4ec5-968b-eb086305298d",
    "title": "Building a Fire",
    "link": "https://xkcd.com/3114/",
    "description": "",
    "author": "",
    "published": "Fri, 11 Jul 2025 04:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/building_a_fire.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "caa66ca8-f980-484e-a566-3d7b2d02b80b",
    "title": "Fix This Sign",
    "link": "https://xkcd.com/3113/",
    "description": "",
    "author": "",
    "published": "Wed, 09 Jul 2025 04:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/fix_this_sign.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "58157e9e-0d3c-4a7b-86a6-36f9490c682a",
    "title": "Colin Jost is Surprisingly Chill About Another Man Kissing His Wife on Red Carpets",
    "link": "https://www.cracked.com/article_47349_colin-jost-is-surprisingly-chill-about-another-man-kissing-his-wife-on-red-carpets.html?newsletter-cat=movies-tv",
    "description": "By Opheli Garcia Lawler Published: July 12th, 2025",
    "author": "",
    "published": "Sat, 12 Jul 2025 11:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "d3400882-9fe9-4a22-b0ca-691a662b98e3",
    "title": "22 of the Most Shocking Reveals in Movie History",
    "link": "https://www.cracked.com/article_47210_22-of-the-most-shocking-reveals-in-movie-history.html?newsletter-cat=movies-tv",
    "description": "By Amanda Mannen Published: July 12th, 2025",
    "author": "",
    "published": "Sat, 12 Jul 2025 09:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "ca3db781-6a8f-44f0-a88d-5b686d1b6210",
    "title": "Comic for 2021.12.21",
    "link": "http://explosm.net/comics/6060/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Tue, 21 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "73c230e6-14b1-4257-a534-1c9562fc47f8",
    "title": "Comic for 2021.12.20",
    "link": "http://explosm.net/comics/6059/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Mon, 20 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "21e83587-70a5-480d-ae64-2cb6a7f31fc1",
    "title": "Employee fakes pregnancy to get 3 weeks of PTO after using up their annual vacation alotment; gets away with it: 'She photoshopped a sonogram'",
    "link": "https://cheezburger.com/41449989/employee-fakes-pregnancy-to-get-3-weeks-of-pto-after-using-up-their-annual-vacation-alotment-gets",
    "description": "The only way to afford the PTO for a decent vacation is by digging deep into your own morally-grey pocket. Many of you would do anything for a little extra PTO. After a long, hard week in the workplace, a vacation starts to seem like the only antidote for a poisonous job and a collection of mean coworkers. Even with dreams of white sand, turquoise beaches, and an all-inclusive swim-up bar dancing in your head, there is still a limit to what we'd do for a trip. \"Would I do anything for a vacation?\" you wonder.But there's a line in the sand of common decency that mustn't be crossed, even for the sake of a well-deserved vacay.",
    "author": "Jesse Kessenheimer",
    "published": "Sat, 12 Jul 2025 16:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "boss",
      "worker",
      "pregnancy",
      "employee",
      "manager",
      "job",
      "work",
      "coworkers",
      "working",
      "ceo",
      "employees",
      "faked",
      "supervisor",
      "workplace",
      "company",
      "coworker",
      "business"
    ]
  },
  {
    "id": "de49f75c-27b5-4575-8027-460bab1af503",
    "title": "‘I laughed, told her to go away’: 50-year-old woman losses it over young woman parked in handicapped spot, gets put in her place by security and nurses",
    "link": "https://cheezburger.com/41392645/i-laughed-told-her-to-go-away-50-year-old-woman-losses-it-over-young-woman-parked-in-handicapped",
    "description": "There are certain accommodations that societies provide for their citizens with disabilities. Things like ramps, brail signage, and, of course, handicap parking spots. However, there are always those few individuals who try to take advantage of things that do not belong to them. Not so much the ramps or brail, but definitely the handicap parking spots. These spots are important for people with disabilities because it gives them enough space to do what they gotta do to get out of the car and gets them close to the establishment they're trying to reach. It's usually a large fine for parking in one of these spots when you do not carry the proper credentials for it.  However, sometimes people who really do need the spot and have the credentials still get scruff because they aren't the poster child for \"disabilities.\" Take, for instance, young people with a non-physical disabilities. Young people with disabilities are always getting flak because they don't \"look like\" they have anything \"wrong\" with them.",
    "author": "Elna McHilderson",
    "published": "Sat, 12 Jul 2025 15:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": null
  },
  {
    "id": "5d913239-7d4b-4e63-9a82-26a43b70c7b4",
    "title": "'We're not a long-term boarding facility': Previous owner calls new pawrent a “cat thief” and demands rehomed cat back, despite giving up her fluffy feline on a whim half a year ago",
    "link": "https://cheezburger.com/41360389/were-not-a-long-term-boarding-facility-previous-owner-calls-new-pawrent-a-cat-thief-and-demands",
    "description": "If you are forced to rehome your cat, that is your time to say goodbye. There are no \"take-backsies\" after giving your fluffy feline up to another purrson that loves them.Rehoming a cat, and introducing them to a new household, is a daunting task. Cats, despite all of their stereotypes, are sensitive creatures and take a lot of time to adjust to new surroundings. It took one of our rescues three full months before she felt comfortable sleeping on the couch, or in her bed. The first couple of weeks, she hid under the bed. You have to give them their space to come to you.So imagine adopting a friend's rehomed cat, taking the time to introduce it to your own cat, and then falling in love with your new fuzzy feline. Then, five months later, the original owner comes back and demands their cat back! No thanks, this cat is ours now. Don't let the door hit you on the way out! Scroll down to read through the spicy story below.Fluff. Chaos. Drama! Our weekly cat newsletter has it all -  subscribe here.",
    "author": "Blake Seidel",
    "published": "Thu, 10 Jul 2025 08:00:00 -0700",
    "image": "https://i.chzbgr.com/completestore/25/7/7/EBGHu32nhkqgOYyLxAlp5g2.png",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "fluffy felines",
      "friendship drama",
      "rehome",
      "cat owners",
      "cat parents",
      "Cats",
      "animals"
    ]
  },
  {
    "id": "61a725b4-da0d-47e6-a4c3-142cbce76f3c",
    "title": "22 Meowsical Memes for When Cats Take Over Your Playlist",
    "link": "https://cheezburger.com/41395973/22-meowsical-memes-for-when-cats-take-over-your-playlist",
    "description": "Cats and music. Two things that make life instantly better, and when you put them together? Pawsitively iconic. Whether it's a fluffy tabby sprawled on a record player like it's a VIP lounge, or a dramatic meow breaking the silence like a true opera diva, cats know how to enjoy a good tune.Some like to vibe in silence, eyes closed, soaking in every note like they're deep in a jazz club. Others prefer chaos: yowling along to pop songs, slapping piano keys like they're composing the next big hit, or attacking your headphones mid-chorus because their taste is clearly superior. And let's not forget the ones who love to nap right in front of the speaker.They might not read music, but they sure know how to feel it. With every tail flick, ear twitch, and soulful stare into the distance, these fur-covered music critics remind us that the best way to enjoy a song is with your whole heart… and maybe a little cattitude.Fluff. Chaos. Drama! Our weekly cat newsletter has it all -  subscribe here.",
    "author": "Sarah Brown",
    "published": "Thu, 10 Jul 2025 16:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "Music",
      "cute",
      "Memes",
      "lol",
      "feline",
      "hissterical",
      "Cats",
      "funny",
      "cat memes"
    ]
  },
  {
    "id": "df436e76-f1a9-413b-8a73-05aeb6b42a9e",
    "title": "01/15/21 PHD comic: 'NEW BOOK! Out of Your Mind!'",
    "link": "http://www.phdcomics.com/comics.php?f=2051",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"NEW BOOK! Out of Your Mind!\" - originally published 1/15/2021 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Mon, 31 Jan 2022 11:24:26 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd011525s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "82701290-1584-4a07-9a67-8c6dfec1c114",
    "title": "08/31/23 PHD comic: 'New Book! Oliver's Great Big Universe!'",
    "link": "http://www.phdcomics.com/comics.php?f=2050",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"New Book! Oliver's Great Big Universe!\" - originally published 8/31/2023 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Tue, 14 Dec 2021 11:53:03 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd083123s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "39b1e743-4889-44b7-926f-fd9070b14837",
    "title": "Turmoil In The Toybox",
    "link": "https://www.penny-arcade.com/news/post/2025/07/11/turmoil-in-the-toybox",
    "description": "When Gabe and I were writing the strip, Brenna came in and was talking about some kind of altercation she had gotten into with a man online about \"woke diabetes barbie.\" I feel like… I feel like if I had spent a lot of time thinking about that, I would be kind of embarrassed. I have a somewhat complex relationship with masculinity in general, which I'm sure comes as no surprise given my, you know, everything. I had to compile a custom manhood from snips of things I found on GitHub and I don't know if it would even be a durable identity for anyone else. I don't feel any particular compulsion to be a guard on the gate that winnows true men from beta cucks. I have much, much bigger fish to fry. Whatever masculinity is, though, I'm certain it doesn't involve arguing with my wife online about dolls.",
    "author": "",
    "published": "Fri, 11 Jul 2025 18:21:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "f3515503-24ca-4875-9644-702631dec8b9",
    "title": "Turmoil In The Toybox",
    "link": "https://www.penny-arcade.com/comic/2025/07/11/turmoil-in-the-toybox",
    "description": "New Comic: Turmoil In The Toybox",
    "author": "",
    "published": "Fri, 11 Jul 2025 07:01:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "d0335063-cdda-45ac-ad91-016073c835d6",
    "title": "Sunday Secrets",
    "link": "https://postsecret.com/2025/07/06/sunday-secrets-561/",
    "description": "The post Sunday Secrets appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 06 Jul 2025 00:14:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2025/07/brother.jpg?resize=384%2C526\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "73b3fc16-a815-45be-9c40-d0e0be07db40",
    "title": "Classic Secrets",
    "link": "https://postsecret.com/2025/07/06/classic-secrets-567/",
    "description": "The post Classic Secrets appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 06 Jul 2025 00:11:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2025/07/judicialchoice.jpg?resize=526%2C361\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "96d80c78-4eeb-4902-a359-d769a820ae7f",
    "title": "Saturday Morning Breakfast Cereal - Rolling",
    "link": "https://www.smbc-comics.com/comic/rolling-2",
    "description": "Click here to go see the bonus panel!Hovertext:Today's News:",
    "author": "Zach Weinersmith",
    "published": "Sat, 12 Jul 2025 11:20:00 -0400",
    "image": "https://www.smbc-comics.com/comics/1752123748-20250712.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "1f73f151-7dd0-4ddf-95c0-a2cfc5dfd11b",
    "title": "Saturday Morning Breakfast Cereal - Sex",
    "link": "https://www.smbc-comics.com/comic/sex",
    "description": "Click here to go see the bonus panel!Hovertext:Surely there's a LITTLE degradation? Maybe on weekends or Halloween?Today's News:",
    "author": "Zach Weinersmith",
    "published": "Fri, 11 Jul 2025 11:20:00 -0400",
    "image": "https://www.smbc-comics.com/comics/1752123717-20250711.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "1c82a7a0-dce0-4815-9a78-9f9d79c57ca7",
    "title": "Error'd: Another One Rides the Bus",
    "link": "https://thedailywtf.com/articles/another-one-rides-the-bus",
    "description": "\"Toledo is on Earth, Adrian must be on Venus,\" remarks Russell M. , explaining \"This one's from weather.gov. Note that Adrian is 28 million miles away from Toledo. Being raised in Toledo, Michigan did feel like another world sometimes, but this is something else.\" Even Toledo itself is a good bit distant from Toledo. Definitely a long walk.   \"TDSTF\", reports regular Michael R. from London, well distant from Toledo OH and Toledo ES.   Also on the bus, astounded Ivan muses \"It's been a long while since I've seen a computer embedded in a piece of public infrastructure (here: a bus payment terminal) literally snow crash. They are usually better at listening to Reason...\"   From Warsaw, Jaroslaw time travels twice. First with this entry \"Busses at the bus terminus often display time left till departure, on the front display and on the screens inside. So one day I entered the bus - front display stating \"Departure in 5 minutes\". Inside I saw this (upper image)... After two minutes the numbers changed to the ones on the lower image. I'm pretty sure I was not sitting there for six hours...\"   And again with an entry we dug out of the way back bin while I was looking for more bus-related items. Was it a total concidence this bus bit also came from Jaroslaw? who just wanted to know \"Is bus sharing virtualised that much?\" I won't apologize, any kind of bus will do when we're searching hard to match a theme.   [Advertisement] ProGet’s got you covered with security and access controls on your NuGet feeds. Learn more.",
    "author": "Lyle Seaman",
    "published": "Fri, 11 Jul 2025 06:30:00 GMT",
    "image": "https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/280/screenshot_20250706_095047_chrome.jpeg",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Error'd"
    ]
  },
  {
    "id": "6c26de2b-198e-47cb-a1c6-a9bf855dea27",
    "title": "The Middle(ware) Child",
    "link": "https://thedailywtf.com/articles/the-middle-ware-child",
    "description": "Once upon a time, there was a bank whose business relied on a mainframe. As the decades passed and the 21st century dawned, the bank's bigwigs realized they had to upgrade their frontline systems to applications built in Java and .NET, but—for myriad reasons that boiled down to cost, fear, and stubbornness—they didn't want to migrate away from the mainframe entirely. They also didn't want the new frontline systems to talk directly to the mainframe or vice-versa. So they tasked old-timer Edgar with writing some middleware. Edgar's brainchild was a Windows service that took care of receiving frontline requests, passing them to the mainframe, and sending the responses back. Edgar's middleware worked well, so well that it was largely forgotten about. It outlasted Edgar himself, who, after another solid decade of service, moved on to another company. A few years later, our submitter John F. joined the bank's C# team. By this point, the poor middleware seemed to be showing its age. A strange problem had arisen: between 8:00AM and 5:00PM, every 45 minutes or so, it would lock up and have to be restarted. Outside of those hours, there was no issue. The problem was mitigated by automatic restarts, but it continued to inflict pain and aggravation upon internal users and external customers. A true solution had to be found. Unfortunately, Edgar was long gone. The new \"owner\" of the middleware was an infrastructure team containing zero developers. Had Edgar left them any documentation? No. Source code? Sort of. Edgar had given a copy of the code to his friend Bob prior to leaving. Unfortunately, Bob's copy was a few point releases behind the version of middleware running in production. It was also in C, and there were no C developers to be found anywhere in the company. And so, the bank's bigwigs cobbled together a diverse team of experts. There were operating system people, network people, and software people ... including the new guy, John. Poor John had the unenviable task of sifting through Edgar's source code. Just as the C# key sits right next to the C key on a piano, reasoned the bigwigs, C# couldn't be that different from C. John toiled in an unfamiliar language with no build server or test environment to aid him. It should be no great surprise that he got nowhere. A senior coworker suggested that he check what Windows' Process Monitor registered when the middleware was running. John allowed a full day to pass, then looked at the results: it was now clear that the middleware was constantly creating and destroying threads. John wrote a Python script to analyze the threads, and found that most of them lived for only seconds. However, every 5 minutes, a thread was created but never destroyed. This only happened during the hours of 8:00AM to 5:00PM. At the next cross-functional team meeting behind closed doors, John finally had something of substance to report to the large group seated around the conference room table. There was still a huge mystery to solve: where were these middleware-killing threads coming from? \"Wait a minute! Wasn't Frank doing something like that?\" one of the other team members piped up. \"Frank!\" A department manager with no technical expertise, who insisted on attending every meeting regardless, darted up straight in his chair. For once, he wasn't haranguing them for their lack of progress. He resembled a wolf who'd sniffed blood in the air. \"You mean Frank from Accounting?!\" This was the corporate equivalent of an arrest warrant. Frank from Accounting was duly called forth. \"That's my program.\" Frank stood before the table, laid back and blithe despite the obvious frayed nerves of several individuals within the room. \"It queries the middleware every 5 minutes.\" They were finally getting somewhere. Galvanized, John's heart pounded. \"How?\" he asked. \"Well, it could be that the middleware is down, so first, my program opens a connection just to make sure it's working,\" Frank explained. \"If that works, it opens another connection and sends the query.\" John's confusion mirrored the multiple frowns that filled the room. He forced himself to carefully parse what he'd just heard. \"What happens to the first connection?\" \"What do you mean?\" Frank asked. \"You said your program opens two connections. What do you do with the first one?\" \"Oh! I just use that one to test whether the middleware is up.\" \"You don't need to do that!\" one of the networking experts snarled. \"For Pete's sake, take that out of your code! Don't you realize you're tanking this thing for everyone else?\" Frank's expression made clear that he was entirely oblivious to the chaos wrought by his program. Somehow, he survived the collective venting of frustration that followed within that conference room. After one small update to Frank's program, the middleware stabilized—for the time being. And while Frank became a scapegoat and villain to some, he was a hero to many, many more. After all, he single-handedly convinced the bank's bigwigs that the status quo was too precarious. They began to plan out a full migration away from mainframe, a move that would free them from their dependence upon aging, orphaned middleware. Now that the mystery had been solved, John knew where to look in Edgar's source code. The thread pool had a limit of 10, and every thread began by waiting for input. The middleware could handle bad input well enough, but it hadn't been written to handle the case of no input at all. [Advertisement] Utilize BuildMaster to release your software with confidence, at the pace your business demands. Download today!",
    "author": "Ellis Morning",
    "published": "Thu, 10 Jul 2025 06:30:00 GMT",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Edgar_Degas_-_Waiting_-_Google_Art_Project.jpg/512px-Edgar_Degas_-_Waiting_-_Google_Art_Project.jpg?20121019043457",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Feature Articles"
    ]
  },
  {
    "id": "ee5360f7-4441-48de-9b19-bfe2a90093a4",
    "title": "A toddler tells a joke",
    "link": "http://theoatmeal.com/comics/toddler_joke?no_popup=1",
    "description": "A comic about a toddler telling his first joke.View on my website",
    "author": "Matthew Inman",
    "published": "2025-07-09T21:58:45+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/toddler_joke_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "f25aafad-a298-4e37-86ed-a9aa36f796b3",
    "title": "Rage",
    "link": "http://theoatmeal.com/comics/rat_rage?no_popup=1",
    "description": "A comic about a ratView on my website",
    "author": "Matthew Inman",
    "published": "2025-06-25T17:23:37+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/rat_rage_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "eb80acd4-b826-4103-ad95-0f059e5b72bc",
    "title": "The Onion Film Standard: ‘28 Years Later’",
    "link": "https://theonion.com/the-onion-film-standard-28-years-later/",
    "description": "The post The Onion Film Standard: ‘28 Years Later’ appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Fri, 11 Jul 2025 16:15:55 +0000",
    "image": "",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "Onion Film Standard",
      "Video"
    ]
  },
  {
    "id": "f509a30e-f61a-4701-9f97-bbf919d9ba03",
    "title": "What To Know About The New ‘Superman’ Movie",
    "link": "https://theonion.com/what-to-know-about-the-new-superman-movie/",
    "description": "A new Superman movie directed by James Gunn is now in theaters. The Onion shares everything you need to know about the film. Q: What is Superman about? A: Superman trying to reconnect with his roots by opening a Kryptonian restaurant in a skeptical Midwestern town. Q: What is the film’s run time? A: Five […] The post What To Know About The New ‘Superman’ Movie appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Fri, 11 Jul 2025 15:48:36 +0000",
    "image": "",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "Entertainment",
      "Explainer",
      "Movies",
      "Vol 61: Issue 28"
    ]
  },
  {
    "id": "a19e9eaa-a5c5-4030-879a-35be283ce66f",
    "title": "Wait…is this going to work?",
    "link": "https://thebloggess.com/2025/07/08/wait-is-this-going-to-work/",
    "description": "I have not been ignoring you but my blog has been broken and giving error messages every time I try to write, but I think maybe it’s fixed? I guess we’ll see if this goes through. I’m too tired to be entirely cohesive or funny but I wanted you to know that Hailey is homeContinue reading \"Wait…is this going to work?\"",
    "author": "thebloggess",
    "published": "Tue, 08 Jul 2025 19:38:03 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "0d1e0a99-0b22-473e-bc27-224870aef330",
    "title": "Rough week",
    "link": "https://thebloggess.com/2025/06/29/rough-week/",
    "description": "It’s been a very rough week and I’m lightly exhausted so instead of writing a real post I’m just sharing the letter I sent everyone on my art substack. Sorry. Any week with spinal taps in it doesn’t count as a real week. Hi friend, I’m writing this from the hospital where I’ve been withContinue reading \"Rough week\"",
    "author": "thebloggess",
    "published": "Mon, 30 Jun 2025 04:17:53 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  }
]
