{
  "id": "170f5bfc-fc24-4cd4-88f4-38b8358f91e8",
  "title": "Lucinda Williams, CeCe Winans, Aimee Mayo \u0026 Tony Martin Among 2025 Nashville Songwriters Hall of Fame Nominees",
  "link": "https://www.billboard.com/music/awards/2025-nashville-songwriters-hall-of-fame-nominees-1236011413/",
  "description": "The Nashville Songwriters Hall of Fame Gala will be held Oct. 6.",
  "author": "Jessica Nicholson",
  "published": "Tue, 01 Jul 2025 00:00:30 +0000",
  "source": "https://www.billboard.com/feed/",
  "categories": [
    "Awards",
    "Music",
    "genre country",
    "Music News"
  ],
  "byline": "Jessica Nicholson",
  "length": 8658,
  "excerpt": "The Nashville Songwriters Hall of Fame has revealed the 12 songcrafters who are the nominees for the class of 2025.",
  "siteName": "Billboard",
  "favicon": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/apple-touch-icon.png",
  "text": "The Nashville Songwriters Hall of Fame Gala will be held Oct. 6. Lucinda Williams performs onstage at the Class of 2024 Medallion Ceremony at Country Music Hall of Fame and Museum on October 20, 2024 in Nashville, Tenn. Jason Kempin/Getty Images for Country Music Hall of Fame and Museum The Nashville Songwriters Hall of Fame has revealed the 12 songcrafters who are the nominees for the class of 2025. In the contemporary songwriters category, this year’s nominees are Steve Bogard, Shawn Camp, Don Henry, Gordon Kennedy, Tony Martin, Aimee Mayo, Jim Rushing and Darrell Scott. The nominees for the contemporary songwriter/artists category are Jim Lauderdale, Gillian Welch \u0026 David Rawlings, Lucinda Williams and CeCe Winans. The 55th-anniversary Nashville Songwriters Hall of Fame Gala will be held Monday, Oct. 6, at Nashville’s Music City Center. “Well-deserved congratulations to all the nominees in our contemporary categories,” Nashville Songwriters Hall of Fame executive director Mark Ford said in a statement. “We look forward in several weeks to announcing those who will be inducted this fall as members of our Class of 2025.” Trending on Billboard Each of the nominees earned their first significant songs at least two decades ago. A total of two songwriters and one songwriter/artist will be elected in the contemporary categories by members of the Hall of Fame, along with other professional songwriters and artists who are prominently associated with Nashville, or who have written/co-written at least one original and significant Nashville song. Three additional songwriters will also be named to the Class of 2025, as a separate body of veteran voters will elect a veteran songwriter, veteran songwriter/artist and legacy songwriter (honoring a deceased songwriter), each of whom have earned their first significant songs at least three decades ago (nominees in these categories are not announced). Bogard is known for writing songs including Marty Robbins’ “Touch Me With Magic,” George Strait’s “Carrying Your Love With Me,” Rascal Flatts’ “Prayin’ For Daylight” and Dierks Bentley’s “Long Trip Alone” and “Every Mile a Memory.” Camp’s writing catalog includes Brooks \u0026 Dunn’s “How Long Gone,” Garth Brooks’s “Two Pina Coladas,” Josh Turner’s “Would You Go With Me” and “Firecracker,” Blake Shelton’s “Nobody But Me,” Strait’s “River of Love,” the Ricky Skaggs and Kentucky Thunder bluegrass hit “Sis Draper,” Billy Strings’s “Don’t Be Calling Me (at 4 AM),” and Willie Nelson’s “A Beautiful Time.” Henry’s writing credits include “Class Reunion” (recorded by artists including John Conlee, The Oak Ridge Boys and Ray Charles), “Blue Highway” (T.G. Sheppard and Conlee), “All Kinds of Kinds” (Miranda Lambert) and the Grammy/CMA/ACM award winner “Where’ve You Been” (Kathy Mattea). Kennedy is known as a writer on songs including the Grammy-winning “Change The World” (recorded by Wynonna and then by Eric Clapton). Kennedy also has more than a dozen songs recorded by Garth Brooks, including “You Move Me” and “Love Will Always Win” (with Trisha Yearwood), as well as songs recorded by Ricky Skaggs (“Return to Sender”) and Bonnie Raitt (“I Can’t Help You Now”). Gordon also co-wrote songs with his frequent writing collaborator Peter Frampton on songs for Frampton’s 2007 album Fingerprints. Gordon’s songs were also included in the Disney movie The Fox and the Hound 2. Martin is known for songs such as the Strait-recorded “Baby’s Gotten Good at Goodbye,” Rascal Flatts’ “Banjo,” Lee Ann Womack’s “I’ll Think of a Reason Later,” Tim McGraw’s “Just to See You Smile,” Sara Evans’s “No Place That Far,” Joe Diffie’s “Third Rock From the Sun,” “Keith Urban’s “You Look Good in My Shirt,” Josh Turner’s “Time Is Love” and Dierks Bentley’s “Settle For a Slow Down.” Mayo’s catalog of songs includes hits recorded by Tim McGraw (“My Best Friend”), Mark Wills (“Places I’ve Never Been”), and Lonestar (“Amazed,” which won the ACM’s song and single of the year and was nominated for a Grammy). Mayo was named BMI’s 2001 Country Songwriter of the Year. Other songs she’s contributed writing to are the Faith Hill/Tim McGraw classic “Let’s Make Love,” Martina McBride’s “This One’s For The Girls,” and Kenny Chesney’s “Bar at the End of the World” and “Who You’d Be Today.” Mayo is author of the memoir Talking to the Sky. Rushing is known for contributing writing to songs including Charley Pride’s “Hope You’re Feelin’ Me (Like I’m Feelin’ You),” Doyle Lawson \u0026 Quicksilver’s 1993 IBMA song of the year winner “Little Mountain Church House,” Ricky Skaggs’ “Canjun Moon” and “Thanks Again,” Garth Brooks’ “American Honky-Tonk Bar Association,” and the 1993 IBMA song of the year winner “Lonesome Standard Time,” (also a hit for Kathy Mattea). Scott’s catalog of hits includes songs recorded by Travis Tritt (“It’s a Great Day to Be Alive”), Sara Evans (“Born to Fly”), The Chicks (“Long Time Gone”), Patty Loveless (“You’ll Never Leave Harlan Alive”), Darin \u0026 Brooke Aldridge (“Cumberland Plateau”), Blue Highway (“Bleeding For a Little Piece of Mind”) and the Zac Brown Band/Chris Cornell collaboration “Heavy Is The Head.” Scott was named the 2000-2001 NSAI songwriter of the year and the 2002 ASCAP country songwriter of the year. In the 1990s, Lauderdale saw his songs recorded by artists including Mark Chesnutt (“Gonna Get a Life”), Patty Loveless (“Halfway Down,” as well as Loveless’ George Jones collaboration “You Don’t Seem to Miss Me”), and the Strait-recorded hits “We Really Shouldn’t Be Doing This” and “What Do You Say to That.” In the Americana realm, Lauderdale has released 37 albums and won two Grammy accolades for bluegrass album of the year (for Lost in the Lonesome Pines and The Bluegrass Diaries), as well as earning bluegrass hits including “Mighty Lonesome” and “One Blue Mule.” Lauderdale was honored with the Americana Music Association’s lifetime achievement award in 2016. Welch and Rawlings have shared a musical and songwriting partnership that goes back at least three decades. Since their debut project in 1996, the two have released songs in a variety of genres, including “Orphan Girl,” “Elvis Presley Blues” and “455 Rocket” (which also became a hit for Mattea), and “Tear My Stillhouse Down” (which became a bluegrass hit for The Nashville Bluegrass Band). Dailey \u0026 Vincent recorded a version of “By The Mark,” which was named the 2009 SPBGMA (Society for the Preservation of Bluegrass Music of America) bluegrass song of the year. “When A Cowboy Trades His Spurs For Wings” was recorded by Tim Blake Nelson and Willie Nelson for the film The Ballad of Buster Scruggs and was nominated for an Oscar for best original song. Welch and Rawlings received the AMA’s lifetime achievement award for songwriters in 2015. Williams earned her breakthrough hit with “Changed the Locks” in 1988, which reached No. 16 on Billboard’s Mainstream Rock chart and became a hit for Tom Petty nearly a decade later. Williams’ “Passionate Kisses” also became a top 5 Country Airplay hit for Mary Chapin Carpenter in 1993, and earned Williams a Grammy for best country song. She also earned Americana Music Honors and Awards nominations for songs including “Are You Alright?” and “East Side of Town.” She earned the 2011 Americana Music Honors \u0026 Awards lifetime achievement award for songwriting and earned a BMI troubadour award in 2022. Williams was inducted into the Austin City Limits Hall of Fame in 2021.Winans started out as part of the luminous gospel music group the Winans Family, before joining musical forces with her brother BeBe Winans to form a duo. Their song “Addictive Love,” co-written by CeCe, earned a GMA Dove Award for contemporary Gospel song of the year in 1992. In 1995, Winans launched her solo career. Her song “Hallelujah Praise” won a 2004 GMA Dove Award for contemporary Gospel song of the year, while in 2009 she was nominated for a Dove Award for “Waging War.” In 2021, her song “Believe For It” won a Grammy for best contemporary Christian performance/song and the 2022 GMA Dove Award for song of the year. Winans has also written songs including “Let Them Fall In Love,” “Pray,” “Say A Prayer,” “Slippin’,” and “Well Alright.” Winans was inducted into the 2015 Gospel Music Hall of Fame in 2015, and has stars on the Hollywood Walk of Fame and Music City Walk of Fame. Get weekly rundowns straight to your inbox Sign Up",
  "image": "https://www.billboard.com/wp-content/uploads/2025/06/Lucinda-Williams-oct-20-2024-billboard-1548.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-1236011413\"\u003e\n\t\t\u003cheader\u003e\n\t\t\t\n\t\t\t\n\t\t\t\n\u003cp\u003eThe Nashville Songwriters Hall of Fame Gala will be held Oct. 6.\u003c/p\u003e\n\n\t\t\t\n\t\t\u003c/header\u003e\n\n\t\t\u003carticle\u003e\n\n\t\t\t\n\t\t\t\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg src=\"https://www.billboard.com/wp-content/uploads/2025/06/Lucinda-Williams-oct-20-2024-billboard-1548.jpg?w=942\u0026amp;h=623\u0026amp;crop=1\" alt=\"Lucinda Williams\" srcset=\"https://www.billboard.com/wp-content/uploads/2025/06/Lucinda-Williams-oct-20-2024-billboard-1548.jpg?w=942\u0026amp;h=623\u0026amp;crop=1 1548w, https://www.billboard.com/wp-content/uploads/2025/06/Lucinda-Williams-oct-20-2024-billboard-1548.jpg?w=942\u0026amp;h=623\u0026amp;crop=1\u0026amp;resize=300%2C198 300w, https://www.billboard.com/wp-content/uploads/2025/06/Lucinda-Williams-oct-20-2024-billboard-1548.jpg?w=942\u0026amp;h=623\u0026amp;crop=1\u0026amp;resize=942%2C623 942w\" sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 100vw\" height=\"\" width=\"\" decoding=\"async\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\t\t\n\t\t\t\n\u003cfigcaption\u003e\n\t\t\t\u003cp\u003e\u003cspan\u003eLucinda Williams performs onstage at the Class of 2024 Medallion Ceremony at Country Music Hall of Fame and Museum on October 20, 2024 in Nashville, Tenn.\u003c/span\u003e\n\t\t\n\t\t\t\t\t\t\t\t\t\u003ccite\u003eJason Kempin/Getty Images for Country Music Hall of Fame and Museum\u003c/cite\u003e\n\t\t\t\t\t\n\t\t\t\t\t\u003c/p\u003e\n\t\t\n\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\t\t\t\u003cdiv\u003e\u003cp\u003e\n\tThe \u003ca href=\"https://nashvillesongwritersfoundation.com/Site/news-item?entry_id=7709\" data-type=\"link\" data-id=\"https://nashvillesongwritersfoundation.com/Site/news-item?entry_id=7709\" rel=\"nofollow\" target=\"_blank\"\u003eNashville Songwriters Hall of Fame \u003c/a\u003ehas revealed the 12 songcrafters who are the nominees for the class of 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the contemporary songwriters category, this year’s nominees are Steve Bogard, Shawn Camp, Don Henry, Gordon Kennedy, Tony Martin, Aimee Mayo, Jim Rushing and Darrell Scott. The nominees for the contemporary songwriter/artists category are \u003ca href=\"https://www.billboard.com/artist/jim-lauderdale/\" data-type=\"link\" data-id=\"https://www.billboard.com/artist/jim-lauderdale/\"\u003eJim Lauderdale\u003c/a\u003e, Gillian Welch \u0026amp; David Rawlings, \u003ca href=\"https://www.billboard.com/artist/lucinda-williams/\" data-type=\"link\" data-id=\"https://www.billboard.com/artist/lucinda-williams/\"\u003eLucinda Williams \u003c/a\u003eand \u003ca href=\"https://www.billboard.com/artist/cece-winans/\" data-type=\"link\" data-id=\"https://www.billboard.com/artist/cece-winans/\"\u003eCeCe Winans\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\tThe 55th-anniversary Nashville Songwriters Hall of Fame Gala will be held Monday, Oct. 6, at Nashville’s Music City Center.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\t“Well-deserved congratulations to all the nominees in our contemporary categories,” Nashville Songwriters Hall of Fame executive director Mark Ford said in a statement. “We look forward in several weeks to announcing those who will be inducted this fall as members of our Class of 2025.”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"10140328\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tTrending on Billboard\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tEach of the nominees earned their first significant songs at least two decades ago. A total of two songwriters and one songwriter/artist will be elected in the contemporary categories by members of the Hall of Fame, along with other professional songwriters and artists who are prominently associated with Nashville, or who have written/co-written at least one original and significant Nashville song. Three additional songwriters will also be named to the Class of 2025, as a separate body of veteran voters will elect a veteran songwriter, veteran songwriter/artist and legacy songwriter (honoring a deceased songwriter), each of whom have earned their first significant songs at least three decades ago (nominees in these categories are not announced).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBogard is known for writing songs including Marty Robbins’ “Touch Me With Magic,” George Strait’s “Carrying Your Love With Me,” Rascal Flatts’ “Prayin’ For Daylight” and Dierks Bentley’s “Long Trip Alone” and “Every Mile a Memory.” \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tCamp’s writing catalog includes Brooks \u0026amp; Dunn’s “How Long Gone,” Garth Brooks’s “Two Pina Coladas,” Josh Turner’s “Would You Go With Me” and “Firecracker,” Blake Shelton’s “Nobody But Me,” Strait’s “River of Love,” the Ricky Skaggs and Kentucky Thunder bluegrass hit “Sis Draper,” Billy Strings’s “Don’t Be Calling Me (at 4 AM),” and Willie Nelson’s “A Beautiful Time.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHenry’s writing credits include “Class Reunion” (recorded by artists including John Conlee, The Oak Ridge Boys and Ray Charles), “Blue Highway” (T.G. Sheppard and Conlee), “All Kinds of Kinds” (Miranda Lambert) and the Grammy/CMA/ACM award winner “Where’ve You Been” (Kathy Mattea).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKennedy is known as a writer on songs including the Grammy-winning “Change The World” (recorded by Wynonna and then by Eric Clapton). Kennedy also has more than a dozen songs recorded by Garth Brooks, including “You Move Me” and “Love Will Always Win” (with Trisha Yearwood), as well as songs recorded by Ricky Skaggs (“Return to Sender”) and Bonnie Raitt (“I Can’t Help You Now”). Gordon also co-wrote songs with his frequent writing collaborator Peter Frampton on songs for Frampton’s 2007 album \u003cem\u003eFingerprints\u003c/em\u003e. Gordon’s songs were also included in the Disney movie \u003cem\u003eThe Fox and the Hound 2\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMartin is known for songs such as the Strait-recorded “Baby’s Gotten Good at Goodbye,” Rascal Flatts’ “Banjo,” Lee Ann Womack’s “I’ll Think of a Reason Later,” Tim McGraw’s “Just to See You Smile,” Sara Evans’s “No Place That Far,” Joe Diffie’s “Third Rock From the Sun,” “Keith Urban’s “You Look Good in My Shirt,” Josh Turner’s “Time Is Love” and Dierks Bentley’s “Settle For a Slow Down.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMayo’s catalog of songs includes hits recorded by Tim McGraw (“My Best Friend”), Mark Wills (“Places I’ve Never Been”), and Lonestar (“Amazed,” which won the ACM’s song and single of the year and was nominated for a Grammy). Mayo was named BMI’s 2001 Country Songwriter of the Year. Other songs she’s contributed writing to are the Faith Hill/Tim McGraw classic “Let’s Make Love,” Martina McBride’s “This One’s For The Girls,” and Kenny Chesney’s “Bar at the End of the World” and “Who You’d Be Today.” Mayo is author of the memoir \u003cem\u003eTalking to the Sky\u003c/em\u003e.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tRushing is known for contributing writing to songs including Charley Pride’s “Hope You’re Feelin’ Me (Like I’m Feelin’ You),” Doyle Lawson \u0026amp; Quicksilver’s 1993 IBMA song of the year winner “Little Mountain Church House,” Ricky Skaggs’ “Canjun Moon” and “Thanks Again,”  Garth Brooks’ “American Honky-Tonk Bar Association,” and the 1993 IBMA song of the year winner “Lonesome Standard Time,” (also a hit for Kathy Mattea).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tScott’s catalog of hits includes songs recorded by Travis Tritt (“It’s a Great Day to Be Alive”), Sara Evans (“Born to Fly”), The Chicks (“Long Time Gone”), Patty Loveless (“You’ll Never Leave Harlan Alive”), Darin \u0026amp; Brooke Aldridge (“Cumberland Plateau”), Blue Highway (“Bleeding For a Little Piece of Mind”) and the Zac Brown Band/Chris Cornell collaboration “Heavy Is The Head.” Scott was named the 2000-2001 NSAI songwriter of the year and the 2002 ASCAP country songwriter of the year.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the 1990s, Lauderdale saw his songs recorded by artists including Mark Chesnutt (“Gonna Get a Life”), Patty Loveless (“Halfway Down,” as well as Loveless’ George Jones collaboration “You Don’t Seem to Miss Me”), and the Strait-recorded hits “We Really Shouldn’t Be Doing This” and “What Do You Say to That.” In the Americana realm, Lauderdale has released 37 albums and won two Grammy accolades for bluegrass album of the year (for \u003cem\u003eLost in the Lonesome Pines \u003c/em\u003eand \u003cem\u003eThe Bluegrass Diaries\u003c/em\u003e), as well as earning bluegrass hits including “Mighty Lonesome” and “One Blue Mule.” Lauderdale was honored with the Americana Music Association’s lifetime achievement award in 2016.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWelch and Rawlings have shared a musical and songwriting partnership that goes back at least three decades. Since their debut project in 1996, the two have released songs in a variety of genres, including “Orphan Girl,” “Elvis Presley Blues” and “455 Rocket” (which also became a hit for Mattea), and “Tear My Stillhouse Down” (which became a bluegrass hit for The Nashville Bluegrass Band). Dailey \u0026amp; Vincent recorded a version of “By The Mark,” which was named the 2009 SPBGMA (Society for the Preservation of Bluegrass Music of America) bluegrass song of the year. “When A Cowboy Trades His Spurs For Wings” was recorded by Tim Blake Nelson and Willie Nelson for the film \u003cem\u003eThe Ballad of Buster Scruggs\u003c/em\u003e and was nominated for an Oscar for best original song. Welch and Rawlings received the AMA’s lifetime achievement award for songwriters in 2015.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cdiv\u003e\u003cp\u003e\n\tWilliams earned her breakthrough hit with “Changed the Locks” in 1988, which reached No. 16 on Billboard’s Mainstream Rock chart and became a hit for Tom Petty nearly a decade later. Williams’ “Passionate Kisses” also became a top 5 Country Airplay hit for Mary Chapin Carpenter in 1993, and earned Williams a Grammy for best country song. She also earned Americana Music Honors and \u003ca href=\"https://www.billboard.com/t/awards/\" id=\"auto-tag_awards\" data-tag=\"awards\"\u003eAwards\u003c/a\u003e nominations for songs including “Are You Alright?” and “East Side of Town.” She earned the 2011 Americana Music Honors \u0026amp; Awards lifetime achievement award for songwriting and earned a BMI troubadour award in 2022. Williams was inducted into the Austin City Limits Hall of Fame in 2021.\u003c/p\u003e\u003cp\u003eWinans started out as part of the luminous gospel music group the Winans Family, before joining musical forces with her brother BeBe Winans to form a duo. Their song “Addictive Love,” co-written by CeCe, earned a GMA Dove Award for contemporary Gospel song of the year in 1992. In 1995, Winans launched her solo career. Her song “Hallelujah Praise” won a 2004 GMA Dove Award for contemporary Gospel song of the year, while in 2009 she was nominated for a Dove Award for “Waging War.” In 2021, her song “Believe For It” won a Grammy for best contemporary Christian performance/song and the 2022 GMA Dove Award for song of the year. Winans has also written songs including “Let Them Fall In Love,” “Pray,” “Say A Prayer,” “Slippin’,” and “Well Alright.” Winans was inducted into the 2015 Gospel Music Hall of Fame in 2015, and has stars on the Hollywood Walk of Fame and Music City Walk of Fame.\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\n\n\t\t\t\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\u003ca href=\"https://www.billboard.com/\" title=\"Billboard\"\u003e\n\t\t\u003csvg xmlns=\"http://www.w3.org/2000/svg\" style=\"height:100%;width:100%\" viewBox=\"0 0 455.133 94.711\"\u003e\u003cpath d=\"M70.107 28.859h21.318V93.69H70.107zM95.834 3.51h21.312v90.18H95.834zm25.723 0h21.312v90.18h-21.312zm250.711 32.035v-6.686h-21.315V93.69h21.315V62.792c0-7.949 4.154-12.237 11.728-12.237h2.522V28.229c-6.432.253-11.1 2.271-14.25 7.316M80.764 0c-6.822 0-12.359 5.535-12.359 12.361s5.537 12.363 12.359 12.363c6.828 0 12.361-5.537 12.361-12.363S87.592 0 80.764 0m244.457 33.795c-2.996-3.268-9.967-5.965-15.26-5.965-16.098 0-27.646 10.613-30.473 26.389-3.082-15.135-16.273-26.78-32.359-26.78-16.24 0-29.537 11.781-32.444 27.2-2.822-16.026-15.428-26.648-31.061-26.648-5.801 0-10.596 1.262-14.76 4.16V3.521h-21.312V93.7h20.938v-5.93c5.045 4.668 10.467 6.812 17.154 6.812 14.398 0 26.52-11.271 29.113-26.807 3.055 15.203 16.169 26.76 32.373 26.76 16.065 0 28.949-11.312 32.228-26.125 2.711 16.18 15.531 26.301 30.854 26.301 5.293 0 11.099-1.771 15.009-4.668V93.7h21.312V65.327q.002-1.745-.031-3.406.033-1.66.031-3.405V28.969h-21.312zM181.355 73.948c-6.826 0-12.359-5.535-12.359-12.363 0-6.824 5.533-12.358 12.359-12.358 6.824 0 12.359 5.534 12.359 12.358.001 6.828-5.534 12.363-12.359 12.363m65.774-.99c-6.822 0-12.361-5.539-12.361-12.363s5.539-12.358 12.361-12.358c6.824 0 12.359 5.535 12.359 12.358.001 6.823-5.532 12.363-12.359 12.363m64.047.392c-6.826 0-12.354-5.539-12.354-12.363s5.527-12.358 12.354-12.358c6.832 0 12.359 5.535 12.359 12.358.001 6.824-5.527 12.363-12.359 12.363M433.815 3.5v28.631c-4.156-2.9-8.949-4.16-14.757-4.16-17.782 0-31.654 13.746-31.654 33.55 0 18.664 13.368 33.043 29.642 33.043 6.68 0 12.103-2.146 17.152-6.811v5.928h20.938V3.5zm-12.553 70.288c-6.817 0-12.354-5.539-12.354-12.358 0-6.828 5.535-12.365 12.354-12.365 6.828 0 12.363 5.537 12.363 12.365 0 6.819-5.535 12.358-12.363 12.358M36.072 27.99c-5.803 0-10.594 1.262-14.76 4.16V3.521H0V93.7h20.936v-5.93c5.045 4.668 10.469 6.812 17.156 6.812 16.268 0 29.637-14.383 29.637-33.047 0-19.797-13.874-33.545-31.657-33.545m-2.269 45.958c-6.824 0-12.359-5.535-12.359-12.363 0-6.824 5.535-12.358 12.359-12.358 6.826 0 12.359 5.534 12.359 12.358 0 6.828-5.533 12.363-12.359 12.363\"\u003e\u003c/path\u003e\u003c/svg\u003e\t\t\u003cspan\u003e\u003c/span\u003e\n\t\u003c/a\u003e\n\t\n\t\u003cp\u003eGet weekly rundowns straight to your inbox\u003c/p\u003e\n\n\t\n\u003cp\u003e\u003ca href=\"https://cloud.email.billboard.com/signup/\" rel=\"noopener noreferrer\"\u003e\n\tSign Up\u003c/a\u003e\n\u003c/p\u003e\u003c/div\u003e\n\n\n\n\t\t\u003c/article\u003e\n\n\t\t\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-07-01T00:00:30Z",
  "modifiedTime": "2025-07-01T00:00:36Z"
}
