{
  "id": "191ac6d1-bf3e-4b5e-9b76-06ae83c1106d",
  "title": "GLASSJAW Finally Release Their Don Fury Sessions Demo Tape",
  "link": "https://metalinjection.net/news/glassjaw-finally-release-their-don-fury-sessions-demo-tape",
  "description": "In December of last year, Glassjaw announced the release of their original demos with producer Don Fury. Yesterday, March 7th, the demos made their debut on vinyl, which are available […] The post GLASSJAW Finally Release Their Don Fury Sessions Demo Tape appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Sat, 08 Mar 2025 21:06:29 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "glassjaw"
  ],
  "byline": "By Isabella Ambrosio Published 2 hours ago",
  "length": 889,
  "excerpt": "In December of last year, Glassjaw announced the release of their original demos with producer Don Fury. Yesterday, March 7th, the demos made their debut on vinyl, which are available for purchase here. With no confirmation on whether or not the demos will be available on streaming platforms from",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "In December of last year, Glassjaw announced the release of their original demos with producer Don Fury. Yesterday, March 7th, the demos made their debut on vinyl, which are available for purchase here. With no confirmation on whether or not the demos will be available on streaming platforms from Glassjaw, the vinyl may be the only way to hear the demos. Recorded back in 1998 before their debut record Everything You Ever Wanted to Know About Silence in 2000, the demos have sat untouched for 25 years. You can find the track list below. \"Pretty Lush\" \"One Eight Becomes Two Zeros\" \"Ry Ry's Song\" \"Majour\" \"Motel Of White Lotus\" \"Matchbook Blackbook\" \"Harlem\" \"Train In Vain\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Don-Fury.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eIn December of last year, \u003ca href=\"https://metalinjection.net/tag/glassjaw\"\u003e\u003cstrong\u003eGlassjaw\u003c/strong\u003e\u003c/a\u003e announced the release of their original demos with producer Don Fury. Yesterday, March 7th, the demos made their debut on vinyl, which are available for purchase \u003ca href=\"https://www.glassjaw.com/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith no confirmation on whether or not the demos will be available on streaming platforms from \u003cstrong\u003eGlassjaw\u003c/strong\u003e, the vinyl may be the only way to hear the demos.\n\n\n\n\u003c/p\u003e\u003cp\u003eRecorded back in 1998 before their debut record \u003cem\u003eEverything You Ever Wanted to Know About Silence\u003c/em\u003e in 2000, the demos have sat untouched for 25 years. \n\n\n\n\u003c/p\u003e\u003cp\u003eYou can find the track list below.\n\n\n\n\u003c/p\u003e\u003col\u003e\n\u003cli\u003e\u0026#34;Pretty Lush\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;One Eight Becomes Two Zeros\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Ry Ry\u0026#39;s Song\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Majour\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Motel Of White Lotus\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Matchbook Blackbook\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Harlem\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Train In Vain\u0026#34;\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-08T16:06:29-05:00",
  "modifiedTime": "2025-03-08T16:06:31-05:00"
}
