{
  "id": "455ea4c2-fda7-4095-95ff-02a7c0c70cfc",
  "title": "AARON ROSSI (Ex-PRONG, Ex-MINISTRY) Dead At 44 Years Old",
  "link": "https://metalinjection.net/this-is-just-a-tribute/aaron-rossi-ex-prong-ex-ministry-dead-at-44-years-old",
  "description": "We extend our deepest condolences to Rossi's friends and family at this time. The post AARON ROSSI (Ex-PRONG, Ex-MINISTRY) Dead At 44 Years Old appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Thu, 06 Mar 2025 21:37:49 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "This Is Just A Tribute"
  ],
  "byline": "By Greg Kennelty Published 3 hours ago",
  "length": 1555,
  "excerpt": "We extend our deepest condolences to Rossi's friends and family at this time.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Drummer Aaron Rossi has sadly died at 44 years old from a heart attack. Rossi drummed for Prong between 2005 and 2009, and then again between 2018 and 2022; he also drummed for Ministry for the majority of the years between 2007 and 2016. We extend our deepest condolences to Rossi's friends and family at this time. The following is a statement posted to Rossi's social media: \"It is with overwhelming sadness to share that on January 27, 2025, Aaron John Rossi passed away from a sudden, severe heart attack. \"AAron was a force with his own gravitational pull. His powerful energy instantly captured you. If you saw him on stage, you were blown away by his immense power, speed and agility – and if you were lucky enough to know him in person, you were equally taken by his kindness, humor and humility. \"AAron leaving us so soon is beyond devastating, but we know that he would not want to be remembered that way. He made us laugh and told us stories like it was his job. We sincerely hope you will share some of your own stories of AAron in the comments. \"There will be a Celebration of Life in the future and details will be shared as soon as possible. AAron's talent on the drums and his ear for music was incomparable – and his sound will live on forever. He will always be The Shredder, The Beast, The Big Dog. Rock In Peace, AAron! We love and miss you!!!\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Aaron-Rossi.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eDrummer \u003cstrong\u003eAaron Rossi\u003c/strong\u003e has sadly died at 44 years old from a heart attack. \u003cstrong\u003eRossi\u003c/strong\u003e drummed for \u003cstrong\u003eProng\u003c/strong\u003e between 2005 and 2009, and then again between 2018 and 2022; he also drummed for \u003cstrong\u003eMinistry\u003c/strong\u003e for the majority of the years between 2007 and 2016. We extend our deepest condolences to \u003cstrong\u003eRossi\u003c/strong\u003e\u0026#39;s friends and family at this time.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe following is a statement posted to \u003cstrong\u003eRossi\u003c/strong\u003e\u0026#39;s social media: \u0026#34;It is with overwhelming sadness to share that on January 27, 2025, \u003cstrong\u003eAaron John Rossi\u003c/strong\u003e passed away from a sudden, severe heart attack.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;\u003cstrong\u003eAAron\u003c/strong\u003e was a force with his own gravitational pull. His powerful energy instantly captured you. If you saw him on stage, you were blown away by his immense power, speed and agility – and if you were lucky enough to know him in person, you were equally taken by his kindness, humor and humility.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;\u003cstrong\u003eAAron\u003c/strong\u003e leaving us so soon is beyond devastating, but we know that he would not want to be remembered that way. He made us laugh and told us stories like it was his job. We sincerely hope you will share some of your own stories of \u003cstrong\u003eAAron\u003c/strong\u003e in the comments.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;There will be a Celebration of Life in the future and details will be shared as soon as possible. \u003cstrong\u003eAAron\u003c/strong\u003e\u0026#39;s talent on the drums and his ear for music was incomparable – and his sound will live on forever. He will always be The Shredder, The Beast, The Big Dog. Rock In Peace, \u003cstrong\u003eAAron\u003c/strong\u003e! We love and miss you!!!\u0026#34;\u003c/p\u003e\n\n\n\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DG3y7RtSEr1/\" data-instgrm-version=\"14\" data-instgrm-captioned=\"\"\u003e\u003c/blockquote\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-06T16:37:49-05:00",
  "modifiedTime": "2025-03-06T16:39:11-05:00"
}
