{
  "id": "47762382-6259-4c06-b90c-22eac664e5be",
  "title": "SEEYOUSPACECOWBOY Drops Off THE DEVIL WEARS PRADA's European Tour, May Have Broken Up",
  "link": "https://metalinjection.net/news/seeyouspacecowboy-drops-off-the-devil-wears-prada-tour-may-have-broken-up",
  "description": "Things have been rough in the SeeYouSpaceCowboy camp lately. It all started when SeeYouSpaceCowboy was announced as support for Dance Gavin Dance on their upcoming North American tour. Dance Gavin […]",
  "author": "Greg Kennelty",
  "published": "Fri, 24 Jan 2025 17:48:26 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "featured",
    "SeeYouSpaceCowboy"
  ],
  "byline": "By Greg Kennelty Published 7 hours ago",
  "length": 1737,
  "excerpt": "Things have been rough in the SeeYouSpaceCowboy camp lately. It all started when SeeYouSpaceCowboy was announced as support for Dance Gavin Dance on their upcoming North American tour. Dance Gavin Dance had previously found themselves in hot water when they split with vocalist Tilian Pearson over al",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Things have been rough in the SeeYouSpaceCowboy camp lately. It all started when SeeYouSpaceCowboy was announced as support for Dance Gavin Dance on their upcoming North American tour. Dance Gavin Dance had previously found themselves in hot water when they split with vocalist Tilian Pearson over allegations of sexual assault, reunited with Pearson, and then split with him again. On January 14, SeeYouSpaceCowboy vocalist Connie Sgarbossa took to social media to express concerns over the tour, saying: \"Believe me, there is no part of me as an individual that backs this either. Probably gonna be leaving SYSC due to a lack of urgency on issues I have been bringing up for a while now. It was fun while it lasted.\" SeeYouSpaceCowboy then removed all mention of the Dance Gavin Dance tour from their social media, but was never announced as being dropped from the tour. Rumors of SeeYouSpaceCowboy's demise have now heated up as the band has dropped off the coming European tour with The Devil Wears Prada, Kingdom Of Giants, and Senna. While SeeYouSpaceCowboy hasn't issued a statement just yet, The Devil Wears Prada have stated the following: \"UK and Europe, we warned you these shows would sell out! Do not miss out if there’s still tickets available near you. Now we will be joined by Ocean Grove stepping in alongside Kingdom Of Giants and Senna so trust us… you really, REALLY don't wanna miss this party! Get your tickets now before they're gone.\" SeeYouSpaceCowboy has not addressed their status as a band as of this post being published. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/03/SeeYouSpaceCowboy-2024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eThings have been rough in the \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e camp lately. It all started when \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e was announced as support for \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/dance-gavin-dance\"\u003eDance Gavin Dance\u003c/a\u003e\u003c/strong\u003e on their upcoming North American tour. \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/dance-gavin-dance\"\u003eDance Gavin Dance\u003c/a\u003e\u003c/strong\u003e had previously found themselves in hot water when they split with vocalist \u003cstrong\u003eTilian Pearson\u003c/strong\u003e over allegations of sexual assault, reunited with \u003cstrong\u003ePearson\u003c/strong\u003e, and then split with him again.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn January 14, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e vocalist \u003cstrong\u003eConnie Sgarbossa\u003c/strong\u003e took to social media to express concerns over the tour, saying: \u0026#34;Believe me, there is no part of me as an individual that backs this either. Probably gonna be leaving \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSYSC\u003c/a\u003e\u003c/strong\u003e due to a lack of urgency on issues I have been bringing up for a while now. It was fun while it lasted.\u0026#34; \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e then removed all mention of the \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/dance-gavin-dance\"\u003eDance Gavin Dance\u003c/a\u003e\u003c/strong\u003e tour from their social media, but was never announced as being dropped from the tour.\n\n\n\n\u003c/p\u003e\u003cp\u003eRumors of \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e\u0026#39;s demise have now heated up as the band has dropped off the coming European tour with \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/the-devil-wears-prada\"\u003eThe Devil Wears Prada\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003eKingdom Of Giants\u003c/strong\u003e, and \u003cstrong\u003eSenna\u003c/strong\u003e. While \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e hasn\u0026#39;t issued a statement just yet, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/the-devil-wears-prada\"\u003eThe Devil Wears Prada\u003c/a\u003e\u003c/strong\u003e have stated the following: \u0026#34;UK and Europe, we warned you these shows would sell out! Do not miss out if there’s still tickets available near you. Now we will be joined by \u003cstrong\u003eOcean Grove\u003c/strong\u003e stepping in alongside \u003cstrong\u003eKingdom Of Giants\u003c/strong\u003e and \u003cstrong\u003eSenna\u003c/strong\u003e so trust us… you really, REALLY don\u0026#39;t wanna miss this party! Get your tickets now before they\u0026#39;re gone.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/seeyouspacecowboy\"\u003eSeeYouSpaceCowboy\u003c/a\u003e\u003c/strong\u003e has not addressed their status as a band as of this post being published.\n\n\n\u003c/p\u003e\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DFNu7oJuewA/\" data-instgrm-version=\"14\" data-instgrm-captioned=\"\"\u003e\u003c/blockquote\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-24T12:48:26-05:00",
  "modifiedTime": "2025-01-24T12:48:41-05:00"
}
