{
  "id": "501f6231-631b-41d0-8d12-c2800107971c",
  "title": "Sheryl Crow Sells Her Tesla, Donates Proceeds to NPR",
  "link": "https://consequence.net/2025/02/sheryl-crow-sells-tesla-donates-to-npr/",
  "description": "“There comes a time when you have to decide who you are willing to align with,” she wrote. “So long Tesla.” Sheryl Crow Sells Her Tesla, Donates Proceeds to NPR Jo Vito",
  "author": "Jo Vito",
  "published": "Sun, 16 Feb 2025 02:40:13 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "News",
    "Elon Musk",
    "NPR",
    "Quoteworthy",
    "Tesla"
  ],
  "byline": "Jo Vito",
  "length": 1938,
  "excerpt": "Sheryl Crow has sold her Tesla and donated the proceeds to NPR in response to Elon Musk’s actions in Donald Trump’s second administration.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Sheryl Crow is the latest Tesla owner to jump ship in the face of CEO Elon Musk’s actions as a member of the Trump administration. In a video posted to Instagram on Friday, the “Soak Up the Sun” singer waved goodbye to her Tesla as it was being towed away. In the caption, she explained that she had sold the vehicle, and donated the money to National Public Radio, which she said is “under threat by President Musk.” Get Sheryl Crow Tickets Here Crow — who was once a proud Tesla owner — also wrote, “My parents always said… you are who you hang out with. There comes a time when you have to decide who you are willing to align with. So long Tesla.” With her donation to NPR, she expressed a hope that “the truth will continue to find its way to those willing to know the truth.” In the comments, Crow received support from several of her musician friends, including Margo Price, who wrote “Love to see it,” and Kacey Musgraves, who left two separate comments reading “Sheryl Queen” and “Sheryl CrowN.” The move comes in the wake of Musk’s actions in Donald Trump’s second administration, including targeting recipients of government subsidies. Earlier this month, he tweeted “Defund NPR. It should survive on its own.” On paper, NPR receives only 1% of its funding from the federal government directly, but in reality, a large portion of its income relies on government support by way of the funding provided to local stations, who then purchase programming produced by NPR. According to The Hill, $90 million of NPR’s $309 million revenue in 2021 came from these programming contracts, with an additional $121 million coming from corporate sponsorships. Meanwhile, Crow has a number of upcoming tour dates, including headlining shows and sets on the 2025 iteration of Willie Nelson’s Outlaw Music Festival tour. Get tickets here. Earlier this month, Crow supported rising artists with an intimate concert showcase in Massachusetts.",
  "image": "https://consequence.net/wp-content/uploads/2025/02/Sheryl-Crow.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1465984\" data-title=\"Sheryl Crow Sells Her Tesla, Donates Proceeds to NPR\" data-url=\"https://consequence.net/2025/02/sheryl-crow-sells-tesla-donates-to-npr/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1465984\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Sheryl Crow Sells Her Tesla, Donates Proceeds to NPR\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003e\u003ca href=\"https://consequence.net/artist/sheryl-crow/\" target=\"_blank\" rel=\"noopener\"\u003eSheryl Crow\u003c/a\u003e is the latest Tesla owner to jump ship in the face of CEO \u003ca href=\"https://consequence.net/tag/elon-musk/\" target=\"_blank\" rel=\"noopener\"\u003eElon Musk\u003c/a\u003e’s actions as a member of the Trump administration.\u003c/p\u003e\n\u003cp\u003eIn a video posted to Instagram on Friday, the “Soak Up the Sun” singer waved goodbye to her Tesla as it was being towed away. In the caption, she explained that she had sold the vehicle, and donated the money to National Public Radio, which she said is “under threat by President Musk.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:sheryl-crow*tesla-npr-button/destination:https%3A%2F%2Fwww.stubhub.com%2Fsheryl-crow-tickets%2Fperformer%2F5483\" target=\"_blank\" rel=\"nofollow noopener\"\u003eGet Sheryl Crow Tickets Here\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eCrow — who was once a proud Tesla owner — also wrote, “My parents always said… you are who you hang out with. There comes a time when you have to decide who you are willing to align with. So long Tesla.”\n\t\u003c/p\u003e\n\n\n\u003cp\u003eWith her donation to NPR, she expressed a hope that “the truth will continue to find its way to those willing to know the truth.”\u003c/p\u003e\n\u003cp\u003eIn the comments, Crow received support from several of her musician friends, including Margo Price, who wrote “Love to see it,” and Kacey Musgraves, who left two separate comments reading “Sheryl Queen” and “Sheryl CrowN.”\u003c/p\u003e\n\u003cp\u003eThe move comes in the wake of Musk’s actions in Donald Trump’s second administration, including targeting recipients of government subsidies. Earlier this month, he tweeted “Defund NPR. It should survive on its own.”\u003c/p\u003e\n\u003cp\u003eOn paper, NPR receives only 1% of its funding from the federal government directly, but in reality, a large portion of its income relies on government support by way of the funding provided to local stations, who then purchase programming produced by NPR. According to \u003ca href=\"https://thehill.com/opinion/campaign/3950550-the-truth-about-nprs-funding-and-its-possible-future/\" target=\"_blank\" rel=\"noopener nofollow\"\u003eThe Hill\u003c/a\u003e, $90 million of NPR’s $309 million revenue in 2021 came from these programming contracts, with an additional $121 million coming from corporate sponsorships.\u003c/p\u003e\n\u003cp\u003eMeanwhile, Crow has a number of upcoming tour dates, including headlining shows and sets on the \u003ca href=\"https://consequence.net/2025/02/willie-nelson-bob-dylan-outlaw-music-festival-tour-2025/\" target=\"_blank\" rel=\"noopener\"\u003e2025 iteration\u003c/a\u003e of Willie Nelson’s Outlaw Music Festival tour. \u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:sheryl-crow*tesla-npr/destination:https%3A%2F%2Fwww.stubhub.com%2Fsheryl-crow-tickets%2Fperformer%2F5483\" target=\"_blank\" rel=\"noopener nofollow\"\u003eGet tickets here.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eEarlier this month, Crow \u003ca href=\"https://consequence.net/2025/02/sheryl-crow-concert-review-salt-lick/\" target=\"_blank\" rel=\"noopener\"\u003esupported rising artists\u003c/a\u003e with an intimate concert showcase in Massachusetts.\u003c/p\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DGEf88eBMVX/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\n\n\u003c/blockquote\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-15T21:40:13-05:00",
  "modifiedTime": "2025-02-15T21:45:14-05:00"
}
