{
  "id": "536e869b-fabf-4b95-98f9-3cc0b53202d7",
  "title": "Song of the Week: Kendrick Lamar Says “Fuck Everybody” and Means It on “wacced out murals”",
  "link": "https://consequence.net/2024/11/kendrick-lamar-wacced-out-murals-sotw/",
  "description": "As well as other notable releases from Young Franco, Horsegirl, Panchiko, Baby Rose, and more. Song of the Week: Kendrick Lamar Says “Fuck Everybody” and Means It on “wacced out murals” Jonah Krueger and Consequence Staff",
  "author": "Jonah Krueger and Consequence Staff",
  "published": "Fri, 22 Nov 2024 21:53:44 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Top Song of the Week",
    "Features",
    "Music",
    "Amazon Music",
    "Pop",
    "Rap",
    "Rock"
  ],
  "byline": "Jonah Krueger",
  "length": 2649,
  "excerpt": "Kendrick Lamar's \"wacced out murals\" takes aim at just about everyone, amping up Lamar's fury. Here's why it is our Song of the Week.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Every week, Consequence’s Songs of the Week column puts a spotlight on quality new tunes from the last seven days and analyzes notable releases. Find our new favorites and more on our Top Songs playlist, and for other great songs from emerging artists, check out our New Sounds playlist. This week, Kendrick Lamar takes aim at everyone on “wacced out murals.” Not sure if y’all have heard, but Kendrick Lamar has a new album out. It’s called GNX and it arrived this morning without warning. Isn’t that something? Who could have seen that coming? Not Father John Misty, that’s for sure… If you’re anything like us, you raced to stream the record as soon as you heard the news. You found that cool-ass picture of Lamar leaning on his car in seconds flat and hit play on track one, “wacced out murals.” Then, after about half a minute of admiring the insane production and Deyra Barrera’s introductory vocals, you came to a realization: Oh shit, K.Dot’s pissed. Like, really fucking pissed. We should have known that would be the case. He spent most of the year taking out his anger via his beef with Drake, subsequently (and perhaps accidentally) achieving the rare feat of fostering a moment of 21st-century monoculture. Whether he was addressing Aubrey’s family members directly or getting baseball stadiums to vibe out to a diss track where he unambiguously calls Drake a pedophile, Lamar wasn’t exactly coming through with happy-go-lucky tunes. So, how does he kick off what will easily go down as one of the most talked about albums of 2024? By making one point clear — fuck everyone. “All this talk is bitch-made, that’s on my Lord/ I’ll kill ’em all before I let ’em kill my joy,” he raps in his first verse. “It used to be fuck that n****, but now it’s plural/ Fuck everybody, that’s on my body.” Overtop a hard-hitting, surprisingly minimal (at least when compared to the compositions found on his previous projects) beat, Lamar lays out both what’s got him so amped up and what he’s going to do about it. And it’s not just Drake in the center of his crosshairs, as he hits J. Cole for stirring up the beef in the first place, slams Snoop Dog for posting Drake’s AI-enhanced diss track “Taylor Made Freestyle,” and addresses Lil Wayne’s reaction to Lamar securing the 2025 Super Bowl Halftime Show. Like he said, “now it’s plural.” It’s a fiery, intensely confrontational way to start GNX, one that primes the listener for the rest of the fiery, intensely confrontational tracks. Because if you thought “wacced out murals” was merely Lamar getting it out of his system, boy are you in for a beating… — Jonah Krueger Editorial Coordinator",
  "image": "https://consequence.net/wp-content/uploads/2024/11/kendrick-lamar.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1444172\" data-title=\"Song of the Week: Kendrick Lamar Says “Fuck Everybody” and Means It on “wacced out murals”\" data-url=\"https://consequence.net/2024/11/kendrick-lamar-wacced-out-murals-sotw/\" data-page=\"1\" data-pages=\"2\" data-total-posts=\"2\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1444172\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Song of the Week: Kendrick Lamar Says “Fuck Everybody” and Means It on “wacced out murals”\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003e\u003cem\u003eEvery week,\u003c/em\u003e Consequence’\u003cem\u003es\u003c/em\u003e \u003cem\u003e\u003ca href=\"https://consequence.net/category/cos-exclusive-features/top-song-of-the-week/\" target=\"_blank\" rel=\"noopener\"\u003eSongs of the Week\u003c/a\u003e column puts a spotlight on quality new tunes from the last seven days and analyzes notable releases.\u003c/em\u003e\u003cem\u003e Find our new favorites and more on our \u003ca href=\"https://www.tryamazonmusic.com/N9KYYb\" target=\"_blank\" rel=\"noopener nofollow\"\u003eTop Songs\u003c/a\u003e playlist, and for other great songs from emerging artists, check out our \u003ca href=\"https://www.tryamazonmusic.com/mOgkka\" target=\"_blank\" rel=\"nofollow noopener\"\u003eNew Sounds\u003c/a\u003e playlist. This week, Kendrick Lamar takes aim at everyone on “wacced out murals.”\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eNot sure if y’all have heard, but \u003ca href=\"https://consequence.net/artist/kendrick-lamar/\" target=\"_blank\" rel=\"noopener\"\u003eKendrick Lamar\u003c/a\u003e has a new album out. It’s called \u003cem\u003e\u003ca href=\"https://consequence.net/2024/11/kendrick-lamar-gnx-new-album-stream/\" target=\"_blank\" rel=\"noopener\"\u003eGNX\u003c/a\u003e \u003c/em\u003eand it arrived this morning without warning. Isn’t that something? Who could have seen that coming? \u003ca href=\"https://x.com/consequence/status/1860029363141664925\" target=\"_blank\" rel=\"noopener nofollow\"\u003eNot Father John Misty\u003c/a\u003e, that’s for sure…\u003c/p\u003e\n\u003cp\u003eIf you’re anything like us, you raced to stream the record as soon as you heard the news. You found that cool-ass picture of Lamar leaning on his car in seconds flat and hit play on track one, “wacced out murals.” Then, after about half a minute of admiring the insane production and Deyra Barrera’s introductory vocals, you came to a realization: \u003cem\u003eOh shit, K.Dot’s pissed. Like, really fucking pissed\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eWe should have known that would be the case. He spent most of the year taking out his anger via his beef with Drake, subsequently (and perhaps accidentally) achieving the rare feat of fostering a moment of 21st-century monoculture. Whether he was addressing Aubrey’s family members directly or getting \u003ca href=\"https://youtu.be/jg0qYFVe64M?si=yjFnOdGEsbS41Krr\" target=\"_blank\" rel=\"noopener nofollow\"\u003ebaseball stadiums to vibe out\u003c/a\u003e to a diss track where he unambiguously calls Drake a pedophile, Lamar wasn’t exactly coming through with happy-go-lucky tunes.\n\t\u003c/p\u003e\n\n\n\u003cp\u003eSo, how does he kick off what will easily go down as one of the most talked about albums of 2024? By making one point clear — fuck \u003cem\u003eeveryone\u003c/em\u003e. “All this talk is bitch-made, that’s on my Lord/ I’ll kill ’em all before I let ’em kill my joy,” he raps in his first verse. “It used to be fuck that n****, but now it’s plural/ Fuck everybody, that’s on my body.”\u003c/p\u003e\n\u003cp\u003eOvertop a hard-hitting, surprisingly minimal (at least when compared to the compositions found on his previous projects) beat, Lamar lays out both what’s got him so amped up and what he’s going to do about it. And it’s not just Drake in the center of his crosshairs, as he hits J. Cole for stirring up the beef in the first place, slams Snoop Dog for posting Drake’s AI-enhanced diss track “Taylor Made Freestyle,” and addresses Lil Wayne’s reaction to Lamar securing the \u003ca href=\"https://consequence.net/2024/09/kendrick-lamar-2025-super-bowl-halftime-show/\" target=\"_blank\" rel=\"noopener\"\u003e2025 Super Bowl Halftime Show\u003c/a\u003e. Like he said, “now it’s plural.”\u003c/p\u003e\n\u003cp\u003eIt’s a fiery, intensely confrontational way to start \u003cem\u003eGNX\u003c/em\u003e, one that primes the listener for the rest of the fiery, intensely confrontational tracks. Because if you thought “wacced out murals” was merely Lamar getting it out of his system, boy are you in for a beating…\u003c/p\u003e\n\u003cp\u003e— \u003cem\u003eJonah Krueger\u003cbr/\u003e\nEditorial Coordinator\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-22T16:53:44-05:00",
  "modifiedTime": "2024-11-22T17:37:45-05:00"
}
