{
  "id": "53ea4948-e4bf-4dc7-a3f5-8987cc72c69e",
  "title": "Alf Clausen, The Simpsons’ Longtime Composer, Dead at 84",
  "link": "https://consequence.net/2025/05/alf-clausen-the-simpsons-longtime-composer-dead-at-84/",
  "description": "The two-time Emmy Award winner scored more than 560 episodes over the course of his 27-year run on the show. Alf Clausen, The Simpsons’ Longtime Composer, Dead at 84 Scoop Harrison",
  "author": "Scoop Harrison",
  "published": "Fri, 30 May 2025 22:31:54 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "TV",
    "Music",
    "News",
    "Obituary",
    "The Simpsons"
  ],
  "byline": "Alex Young",
  "length": 1200,
  "excerpt": "Alf Clausen, the longtime composer of The Simpsons who scored more than 560 episodes of the animated series, had died at the age of 84.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Alf Clausen, the longtime composer of The Simpsons who scored more than 560 episodes of the animated series, had died at the age of 84. Clausen died after a decade-long battle with Progressive Supernuclear Palsy (PSP). A two-time Emmy Award winner with 30 additional nominations, Clausen provided the music for The Simpsons for 27 years, composing a unique piece each week accompanied by a 35-piece orchestra. In a cost-cutting measure, Fox fired Clausen in 2017, leading the composer to sue the network for  ageism and disability discrimination two years later. He later dropped the suit, and Simpsons producers recognized in later seasons as “composer emeritus.” “I think that’s one of the reasons they’ve kept me all these years: they were looking for somebody who could score all those different types of music in small clip-form,” Clausen reflected in a 2017 interview with Consequence. “That’s what’s been fun for me. I think that anyone else who would have been hired for this job and stayed for this long would have gone to the nuthouse.” Clausen also composed music for the television series ALF, and well contributed to films like The Naked Gun, Ferris Bueller’s Day Off, and Weird Science.",
  "image": "https://consequence.net/wp-content/uploads/2025/05/alf-clausen.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1489071\" data-title=\"Alf Clausen, The Simpsons’ Longtime Composer, Dead at 84\" data-url=\"https://consequence.net/2025/05/alf-clausen-the-simpsons-longtime-composer-dead-at-84/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1489071\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Alf Clausen, The Simpsons’ Longtime Composer, Dead at 84\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eAlf Clausen, the longtime composer of\u003ca href=\"https://consequence.net/tag/the-simpsons/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003e The Simpsons \u003c/em\u003e\u003c/a\u003ewho scored more than 560 episodes of the animated series, had died at the age of 84.\u003c/p\u003e\n\u003cp\u003eClausen died after a decade-long battle with Progressive Supernuclear Palsy (PSP).\u003c/p\u003e\n\u003cp\u003eA two-time Emmy Award winner with 30 additional nominations, Clausen provided the music for \u003cem\u003eThe Simpsons\u003c/em\u003e for 27 years, composing a unique piece each week accompanied by a 35-piece orchestra.\u003c/p\u003e\n\u003cp\u003eIn a cost-cutting measure, Fox fired Clausen in 2017, leading the composer to sue the network for  ageism and disability discrimination two years later. He later dropped the suit, and \u003cem\u003eSimpsons\u003c/em\u003e producers recognized in later seasons as “composer emeritus.”\u003c/p\u003e\n\u003cp\u003e“I think that’s one of the reasons they’ve kept me all these years: they were looking for somebody who could score all those different types of music in small clip-form,” Clausen \u003ca href=\"https://consequence.net/2017/04/he-put-the-spring-in-springfield-a-conversation-with-the-simpsons-composer-alf-clausen/\" target=\"_blank\" rel=\"noopener\"\u003ereflected in a 2017 interview with \u003cem\u003eConsequence\u003c/em\u003e\u003c/a\u003e. “That’s what’s been fun for me. I think that anyone else who would have been hired for this job and stayed for this long would have gone to the nuthouse.”\u003c/p\u003e\n\u003cp\u003eClausen also composed music for the television series \u003cem\u003eALF\u003c/em\u003e, and well contributed to films like\u003cem\u003e The Naked Gun\u003c/em\u003e, \u003cem\u003eFerris Bueller’s Day Off\u003c/em\u003e, and \u003cem\u003eWeird Science\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ciframe title=\"Alf Clausen \u0026#34;The Simpsons\u0026#34; music cue compilation\" width=\"100%\" src=\"https://www.youtube.com/embed/OrZsSUWg07U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-30T18:31:54-04:00",
  "modifiedTime": "2025-05-30T18:37:00-04:00"
}
