{
  "id": "572a4650-45b3-495f-a5d5-b9b9ea9a8ed2",
  "title": "Mel Gibson’s Flight Risk Is So Bad, It’s Funny: Review",
  "link": "https://consequence.net/2025/01/flight-risk-review-mel-gibson/",
  "description": "The subpar action thriller does feature some comedy gold, in the form of Mark Wahlberg's hairline. Mel Gibson’s Flight Risk Is So Bad, It’s Funny: Review Liz Shannon Miller",
  "author": "Liz Shannon Miller",
  "published": "Thu, 23 Jan 2025 23:00:16 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Film",
    "Film Reviews",
    "Reviews",
    "Mark Wahlberg",
    "Mel Gibson",
    "Michelle Dockery",
    "Topher Grace"
  ],
  "byline": "Liz Shannon Miller",
  "length": 5666,
  "excerpt": "The subpar action thriller movie Flight Risk, directed by Mel Gibson, features some comedy gold in the form of Mark Wahlberg's hairline.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Pop quiz, hotshot: You’re a U.S. Marshal on a tiny plane who’s just discovered that the pilot of said tiny plane is a cold-blooded murderer, hired to kill the federal witness you’re transporting. (The federal witness might be someone deemed a “flight risk,” though the term comes to have broader implications for you over the course of the journey.) You somehow manage to subdue said hitman, tying him up in the back of the plane while you try to figure out how to fly the plane yourself. Do you: A. Occasionally turn on the autopilot so you can keep tabs on said hitman, in case he breaks free and attempts to kill you again. B. Focus on the whole plane-flying thing, but suggest to the federal witness you’re transporting that he keep an eye on the hitman, in case the hitman breaks free and attempts to kill you again. C. Assume that you did a great job tying up the hitman, so good that you never once look back at him. Which is why you don’t notice that the hitman, literally less than 10 feet away, is sawing away at the cloth strap securing him to the side of the plane, so that he can break free and attempt to kill you again. If you couldn’t guess, U.S. Marshal Madolyn Harris, played by Michelle Dockery, chooses Option C from the above — just one of the many painfully dumb moments one might experience while watching the new action thriller Flight Risk. The movie, also starring Topher Grace and Mark Wahlberg, wouldn’t feel out of place as a direct-to-streaming project — except it’s getting a theatrical release, and it was directed by Mel Gibson. Yes, that Mel Gibson. The same Mel Gibson who has previously directed five other feature films, including the insane box office phenomenon The Passion of the Christ. The same Mel Gibson who has received two Oscar nominations for Best Director. The same Mel Gibson who won the Oscar for Best Director Oscar, thanks to 1995’s Braveheart. Yes, this is also the same Mel Gibson who currently occupies a complicated place in the film industry, due to a long history of racist and antisemitic comments. But of all the critiques you could level towards him, being bad at the actual craft of directing wasn’t ever on the list. Until now. Conceptually, Flight Risk had a lot of potential as a very specific kind of movie. The script almost takes place in real-time, with the vast majority of the action confined to the very small interior of the plane transporting Madolyn and Winston (Grace) from rural Alaska to Anchorage. While its three main characters aren’t particularly well-developed, they each offer a unique spark to play, and the cast seems relatively game. Overall, it’s a setup that would allow a talented director to really showcase their ability to build tension and suspense. An exercise in storytelling that someone like Steven Soderbergh or David Fincher would make unforgettable. Instead, there are elements of this movie that are just sloppy in their execution. Blatant continuity errors. A CGI moose that’s less convincing than Dockery’s attempt at a badass American accent. Even a lot of the flying action fails to play coherently, with the exterior shots of the plane flying through the Alaskan mountains rarely feeling like they match with the interior action. The performances, at least, manage to be relatively consistent: Topher Grace feels like he’s wisecracking through a different movie than the one we’re watching, but he at least gets a few funny moments. Dockery’s accent work, as noted above, isn’t great, but she otherwise demonstrates more grit than we typically get from an actress perhaps still most famous for playing Lady Mary. And to Mark Wahlberg’s credit, he’s in serious character actor mode here, leaning hard into every ugly trait of hitman Daryl. This includes his instantly hilarious choice of a Friar Tuck-inspired hairstyle for the role, which is concealed for the first portion of the movie by not just a baseball cap, but a toupee. To be explicitly clear about this: Wahlberg is playing a hitman impersonating the plane’s original pilot. At one point, we see a photo of the original pilot, who has a very short buzz cut. But rather than attempt to replicate that hairstyle, Daryl instead chooses to wear a full toupee, under the baseball cap, for the sake of… vanity? It’s certainly not to help him look more like the original pilot. It just makes him look like a guy who wants to maintain the illusion that he’s got hair under his baseball cap, which of course he is wearing backwards. Not that this writer has any direct experience with male pattern baldness, but doesn’t the baseball cap on its own usually do the job? There’s no nuance to Daryl as a character; he’s a malevolent force motivated by what appears to be an equal mix of greed and petty vengeance, with a penchant for flinging sexually threatening comments at both Dockery and Grace’s characters. Does that make him canonically bisexual? Or just a guy who likes to be equal opportunity with his rape jokes? Daryl inspires a lot of questions. Truly, Flight Risk has its funny moments, though none of them are funnier than when the end credits start and you’re reminded, once again, that this movie was directed by Mel Gibson. This isn’t an example of a director once celebrated as a genius taking a huge risk, like Francis Ford Coppola did with Megalopolis. As a Netflix original movie, directed by someone with a few TV episodes under their belt, it’d be a passable enough way to spend 90 minutes. As the latest addition to Gibson’s filmography, though — it’s just embarrassing. Flight Risk arrives in theaters on Friday, January 24th — the trailer is below. Or you could stream Con Air on Hulu.",
  "image": "https://consequence.net/wp-content/uploads/2025/01/flight-risk-mark-wahlberg.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1460680\" data-title=\"Mel Gibson’s Flight Risk Is So Bad, It’s Funny: Review\" data-url=\"https://consequence.net/2025/01/flight-risk-review-mel-gibson/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1460680\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Mel Gibson’s Flight Risk Is So Bad, It’s Funny: Review\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003ePop quiz, hotshot: You’re a U.S. Marshal on a tiny plane who’s just discovered that the pilot of said tiny plane is a cold-blooded murderer, hired to kill the federal witness you’re transporting. (The federal witness might be someone deemed a “\u003ca href=\"https://www.youtube.com/watch?v=npAz2MMLCr8\" target=\"_blank\" rel=\"noopener nofollow\"\u003eflight risk\u003c/a\u003e,” though the term comes to have broader implications for you over the course of the journey.) You somehow manage to subdue said hitman, tying him up in the back of the plane while you try to figure out how to fly the plane yourself. Do you:\u003c/p\u003e\n\u003cp\u003eA. Occasionally turn on the autopilot so you can keep tabs on said hitman, in case he breaks free and attempts to kill you again.\u003cbr/\u003e\nB. Focus on the whole plane-flying thing, but suggest to the federal witness you’re transporting that \u003ci\u003ehe\u003c/i\u003e keep an eye on the hitman, in case the hitman breaks free and attempts to kill you again.\u003cbr/\u003e\nC. Assume that you did a great job tying up the hitman, so good that you never once look back at him. Which is why you don’t notice that the hitman, literally less than 10 feet away, is sawing away at the cloth strap securing him to the side of the plane, so that he can break free and attempt to kill you again.\u003c/p\u003e\n\u003cp\u003eIf you couldn’t guess, U.S. Marshal Madolyn Harris, played by \u003ca href=\"https://consequence.net/tag/michelle-dockery/\" target=\"_blank\" rel=\"noopener\"\u003eMichelle Dockery\u003c/a\u003e, chooses Option C from the above — just one of the many painfully dumb moments one might experience while watching the new action thriller \u003ci\u003eFlight Risk\u003c/i\u003e. The movie, also starring \u003ca href=\"https://consequence.net/tag/topher-grace/\" target=\"_blank\" rel=\"noopener\"\u003eTopher Grace\u003c/a\u003e and \u003ca href=\"https://consequence.net/tag/mark-wahlberg/\" target=\"_blank\" rel=\"noopener\"\u003eMark Wahlberg\u003c/a\u003e, wouldn’t feel out of place as a direct-to-streaming project — except it’s getting a theatrical release, and it was directed by \u003ca href=\"https://consequence.net/tag/mel-gibson/\" target=\"_blank\" rel=\"noopener\"\u003eMel Gibson\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eYes, that Mel Gibson. The same Mel Gibson who has previously directed five other feature films, including the insane box office phenomenon \u003ci\u003eThe Passion of the Christ\u003c/i\u003e. The same Mel Gibson who has received \u003ci\u003etwo Oscar nominations\u003c/i\u003e for Best Director. The same Mel Gibson who \u003ci\u003ewon\u003c/i\u003e the Oscar for Best Director Oscar, thanks to 1995’s \u003ci\u003eBraveheart\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eYes, this is also the same Mel Gibson who currently occupies a complicated place in the film industry, due to a long history of racist and antisemitic comments. But of all the critiques you could level towards him, being bad at the actual craft of directing wasn’t ever on the list. Until now.\u003c/p\u003e\n\u003cp\u003eConceptually, \u003ci\u003eFlight Risk\u003c/i\u003e had a lot of potential as a very specific kind of movie. The script almost takes place in real-time, with the vast majority of the action confined to the very small interior of the plane transporting Madolyn and Winston (Grace) from rural Alaska to Anchorage. While its three main characters aren’t particularly well-developed, they each offer a unique spark to play, and the cast seems relatively game. Overall, it’s a setup that would allow a talented director to really showcase their ability to build tension and suspense. An exercise in storytelling that someone like Steven Soderbergh or David Fincher would make unforgettable.\u003c/p\u003e\n\u003cp\u003eInstead, there are elements of this movie that are just \u003ci\u003esloppy\u003c/i\u003e in their execution. Blatant continuity errors. A CGI moose that’s less convincing than Dockery’s attempt at a badass American accent. Even a lot of the flying action fails to play coherently, with the exterior shots of the plane flying through the Alaskan mountains rarely feeling like they match with the interior action.\u003c/p\u003e\n\u003cp\u003eThe performances, at least, manage to be relatively consistent: Topher Grace feels like he’s wisecracking through a different movie than the one we’re watching, but he at least gets a few funny moments. Dockery’s accent work, as noted above, isn’t great, but she otherwise demonstrates more grit than we typically get from an actress perhaps still most famous for playing Lady Mary.\u003c/p\u003e\n\u003cp\u003eAnd to Mark Wahlberg’s credit, he’s in serious character actor mode here, leaning hard into every ugly trait of hitman Daryl. This includes his instantly hilarious choice of a Friar Tuck-inspired hairstyle for the role, which is concealed for the first portion of the movie by not just a baseball cap, but a toupee.\u003c/p\u003e\n\u003cp\u003eTo be explicitly clear about this: Wahlberg is playing a hitman impersonating the plane’s original pilot. At one point, we see a photo of the original pilot, who has a very short buzz cut. But rather than attempt to replicate that hairstyle, Daryl instead chooses to wear a full toupee, \u003ci\u003eunder\u003c/i\u003e the baseball cap, for the sake of… vanity? It’s certainly not to help him look more like the original pilot. It just makes him look like a guy who wants to maintain the illusion that he’s got hair under his baseball cap, which of course he is wearing \u003ci\u003ebackwards\u003c/i\u003e. Not that this writer has any direct experience with male pattern baldness, but doesn’t the baseball cap on its own usually do the job?\u003c/p\u003e\n\u003cp\u003eThere’s no nuance to Daryl as a character; he’s a malevolent force motivated by what appears to be an equal mix of greed and petty vengeance, with a penchant for flinging sexually threatening comments at both Dockery and Grace’s characters. Does that make him canonically bisexual? Or just a guy who likes to be equal opportunity with his rape jokes? Daryl inspires a \u003ci\u003elot\u003c/i\u003e of questions.\u003c/p\u003e\n\u003cp\u003eTruly, \u003ci\u003eFlight Risk\u003c/i\u003e has its funny moments, though none of them are funnier than when the end credits start and you’re reminded, once again, that this movie was directed by Mel Gibson. This isn’t an example of a director once celebrated as a genius taking a huge risk, like Francis Ford Coppola did with \u003ci\u003eMegalopolis\u003c/i\u003e. As a Netflix original movie, directed by someone with a few TV episodes under their belt, it’d be a passable enough way to spend 90 minutes. As the latest addition to Gibson’s filmography, though — it’s just embarrassing.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eFlight Risk\u003c/i\u003e arrives in theaters on Friday, January 24th — the trailer is below. Or you could stream \u003ci\u003eCon Air\u003c/i\u003e on \u003ca href=\"https://www.kmtrak.com/F876M7/3HWS9F7/\" target=\"_blank\" rel=\"noopener nofollow\"\u003eHulu\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003ciframe loading=\"lazy\" width=\"100%\" height=\"360\" src=\"https://www.youtube.com/embed/Cml3CFDBj2s?version=3\u0026amp;rel=1\u0026amp;showsearch=0\u0026amp;showinfo=1\u0026amp;iv_load_policy=1\u0026amp;fs=1\u0026amp;hl=en-US\u0026amp;autohide=2\u0026amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-23T18:00:16-05:00",
  "modifiedTime": null
}
