{
  "id": "5f9d7490-26d1-4d82-83da-ca4c13e4e470",
  "title": "ALICE IN CHAINS Cancels Their Immediate Shows Due To Drummer's Health",
  "link": "https://metalinjection.net/news/bummer-alert/alice-in-chains-cancels-their-immediate-shows-due-to-drummers-health",
  "description": "Here's hoping everything turns out alright. The post ALICE IN CHAINS Cancels Their Immediate Shows Due To Drummer's Health appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Fri, 09 May 2025 21:16:56 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Bummer Alert",
    "featured2",
    "Alice In Chains"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 1514,
  "excerpt": "Here's hoping everything turns out alright.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Alice In Chains originally cancelled their May 8 show at the Mohegan Sun Arena in Uncasville, CT after drummer Sean Kinney suffered \"a non-life-threatening medical emergency.\" Unfortunately that situation has only gotten worse, and has forced Alice In Chains to cancel all the other shows they had planned for this month. Hopefully everything is alright with Kinney and Alice In Chains can get back to doing what they do. \"After careful consideration and following the advice of medical professionals, we have made the decision to cancel our upcoming festival performances and the Alice in Chains headline shows,\" wrote the band. \"While we were all eager to return to the stage, Sean’s health is our top priority at this moment. Although the issue requires immediate attention, his long-term prognosis is positive. We sincerely appreciate your understanding and support during this time.\" The following shows and festival performances have been affected. No word on if this also includes the Black Sabbath show in July, but I guess we'll find out soon enough. 5/10 Camden, NJ WMMR 93.3 Philadelphia MMRBQ 20255/11 Columbus, OH Sonic Temple Art \u0026 Music Festival 20255/13 Nashville, TN The Pinnacle5/15 Dothan, AL Dothan Civic Center Arena5/16 Daytona Beach, FL Welcome to Rockville 20255/17 Ocean City, MD Boardwalk Rock 2025 Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/05/Sean-Kinney.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eAlice In Chains\u003c/strong\u003e originally cancelled their May 8 show at the Mohegan Sun Arena in Uncasville, CT after drummer Sean Kinney suffered \u0026#34;a non-life-threatening medical emergency.\u0026#34; Unfortunately that situation has only gotten worse, and has forced \u003cstrong\u003eAlice In Chains\u003c/strong\u003e to cancel all the other shows they had planned for this month. Hopefully everything is alright with \u003cstrong\u003eKinney\u003c/strong\u003e and \u003cstrong\u003eAlice In Chains\u003c/strong\u003e can get back to doing what they do.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;After careful consideration and following the advice of medical professionals, we have made the decision to cancel our upcoming festival performances and the \u003cstrong\u003eAlice in Chains\u003c/strong\u003e headline shows,\u0026#34; wrote the band.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;While we were all eager to return to the stage, \u003cstrong\u003eSean\u003c/strong\u003e’s health is our top priority at this moment. Although the issue requires immediate attention, his long-term prognosis is positive. We sincerely appreciate your understanding and support during this time.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eThe following shows and festival performances have been affected. No word on if this also includes the \u003cstrong\u003eBlack Sabbath\u003c/strong\u003e show in July, but I guess we\u0026#39;ll find out soon enough.\n\n\n\n\u003c/p\u003e\u003cp\u003e5/10 Camden, NJ WMMR 93.3 Philadelphia MMRBQ 2025\u003cbr/\u003e5/11 Columbus, OH Sonic Temple Art \u0026amp; Music Festival 2025\u003cbr/\u003e5/13 Nashville, TN The Pinnacle\u003cbr/\u003e5/15 Dothan, AL Dothan Civic Center Arena\u003cbr/\u003e5/16 Daytona Beach, FL Welcome to Rockville 2025\u003cbr/\u003e5/17 Ocean City, MD Boardwalk Rock 2025\u003c/p\u003e\n\n\n\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DJcn7lWzVtj/\" data-instgrm-version=\"14\" data-instgrm-captioned=\"\"\u003e\u003c/blockquote\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-09T17:16:56-04:00",
  "modifiedTime": "2025-05-09T17:19:41-04:00"
}
