{
  "id": "669a03c7-0b76-4136-a02d-63e0187bfd26",
  "title": "SAETIA Streams First New Single Since 1999, Announces New EP",
  "link": "https://metalinjection.net/new-music/saetia-streams-first-new-single-since-1999-announces-new-ep",
  "description": "The screamo legends make a return!",
  "author": "Greg Kennelty",
  "published": "Sat, 04 Jan 2025 14:43:58 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "New Music",
    "Saetia"
  ],
  "byline": "By Greg Kennelty Published 9 hours ago",
  "length": 1681,
  "excerpt": "The screamo legends make a return!",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "NYC-based screamo act Saetia is back with their first new song since 1999, \"Tendrils\". The song comes from a 3-song EP of the same name due out April 25, though Saetia notes the other two songs will be released prior to the EP dropping. Tendrils is available for pre-order here via Deathwish Inc. and here on Bandcamp. \"Today we get to share new music with you for the first time in 26 years,\" wrote Saetia of the single. \"'Tendrils' is the first song from a three song EP of the same name, and is available now on Bandcamp and all streaming platforms. \"Back in December of 2023 Colin shared an idea that he wrote on bass. We weren't really serious about working on new music up until that point, but the five of us slowly started building on that original idea. Through lots of file sharing, trips to Philly and different rehearsal spaces around the United States over the past year, we were able to write and record these three songs. \"We are releasing this music ourselves just as we did with our demo in 1997. We’ve pressed 1,000 copies on black vinyl (one sided 12\"), which are available NOW for pre-order via @deathwishinc and @deathwisheurope (link in bio). Not sure if or when we’ll do a second pressing of this, so we suggest grabbing one if you’re interested. These will ship sometime at the end of April. \"We will also have very special, limited versions of the EP with alternate covers and colored vinyl at our NYC \u0026 LA record release shows. More details on that this Monday.\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/01/saetia-.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eNYC-based screamo act \u003cstrong\u003eSaetia\u003c/strong\u003e is back with their first new song since 1999, \u0026#34;Tendrils\u0026#34;. The song comes from a 3-song EP of the same name due out April 25, though \u003cstrong\u003eSaetia\u003c/strong\u003e notes the other two songs will be released prior to the EP dropping. \u003cem\u003eTendrils\u003c/em\u003e is available for \u003ca href=\"https://dthw.sh/saetia\"\u003epre-order here via Deathwish Inc.\u003c/a\u003e and \u003ca href=\"https://saetianyc.bandcamp.com/track/tendrils\"\u003ehere on Bandcamp\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Today we get to share new music with you for the first time in 26 years,\u0026#34; wrote \u003cstrong\u003eSaetia\u003c/strong\u003e of the single. \u0026#34;\u0026#39;Tendrils\u0026#39; is the first song from a three song EP of the same name, and is available now on Bandcamp and all streaming platforms.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Back in December of 2023 \u003cstrong\u003eColin\u003c/strong\u003e shared an idea that he wrote on bass. We weren\u0026#39;t really serious about working on new music up until that point, but the five of us slowly started building on that original idea. Through lots of file sharing, trips to Philly and different rehearsal spaces around the United States over the past year, we were able to write and record these three songs.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;We are releasing this music ourselves just as we did with our demo in 1997. We’ve pressed 1,000 copies on black vinyl (one sided 12\u0026#34;), which are available NOW for pre-order via @deathwishinc and @deathwisheurope (link in bio). Not sure if or when we’ll do a second pressing of this, so we suggest grabbing one if you’re interested. These will ship sometime at the end of April.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;We will also have very special, limited versions of the EP with alternate covers and colored vinyl at our NYC \u0026amp; LA record release shows. More details on that this Monday.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Tendrils\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/tE3Rlst9lBk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-04T09:43:58-05:00",
  "modifiedTime": "2025-01-04T09:44:01-05:00"
}
