{
  "id": "692ffada-bace-4f5c-a8cb-bdeb587f3fb2",
  "title": "Sammy Hagar: Alex Van Halen Not Acknowledging “Van Hagar” Is “Blasphemy” to Eddie’s Legacy",
  "link": "https://consequence.net/2024/12/sammy-hagar-alex-van-halen-blasphemy/",
  "description": "Hagar's remarks are in response to Alex Van Halen not including the \"Van Hagar\" years in his recent memoir. Sammy Hagar: Alex Van Halen Not Acknowledging “Van Hagar” Is “Blasphemy” to Eddie’s Legacy Jon Hadusek",
  "author": "Jon Hadusek",
  "published": "Tue, 31 Dec 2024 16:15:00 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Heavy Consequence",
    "Heavy Music News",
    "Music",
    "News",
    "Classic Rock",
    "Hard Rock"
  ],
  "byline": "Jon Hadusek",
  "length": 2272,
  "excerpt": "Sammy Hagar has responded to Alex Van Halen skipping the \"Van Hagar\" era in his book, calling the omission \"blasphemy\" to Eddie's legacy.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Sammy Hagar has responded to Alex Van Halen skipping the “Van Hagar” era in his memoir, calling the lack of acknowledgement “blasphemy” to Eddie’s legacy. Hagar’s remarks came via an otherwise innocuous Instagram post that saw the Red Rocker nostalgically reflecting on his time in Van Halen. In the original post, featuring a photo from 1991 of Hagar and Eddie heading to the stage, Hagar joked about their choice of fashion at the time before taking a more serious tone when commenters began to compare the David Lee Roth years to Van Hagar. “No disrespect to Alex but it’s ok to like VH with Sammy, even if he doesn’t anymore,” wrote one commenter, prompting another: “Most purists believe VH ended with DLR.” Here, Hagar chimed in. “It could have [ended], my friend, but instead we went on to sell over 50 million records for [a] No. 1 album [then] sold out every building and stadium in the world for a whole decade,” commented Hagar. “That never happened again.” Then Hagar addressed the absence of the post-DLR era of Van Halen in Alex’s new memoir, Brothers (purchase here). “Alex is not doing his brother’s musical legacy justice by not acknowledging all the No. 1 albums and some great music Eddie and I wrote together — not Alex — but Eddie and I wrote together,” wrote Hagar. “To not acknowledge [those] 10 years of music is blasphemy to his brother’s musicianship, songwriting and legacy.” Alex’s book makes no mention of the Hagar years, instead ending just before DLR’s initial exit from the band in 1985. Alex later explained the omission in an interview with Billboard. “What happened after Dave left is not the same band. … The magic was in the first years,” he said, “when we didn’t know what we were doing; when we were willing to try anything.” Alex maintained that “the original band was the driving force,” in a more recent interview with the “Bringing It Back to The Beatles” podcast. “That’s why the book ends in 1984, because that was true rock and roll,” he said. “After that, it became much more — I don’t know; I can’t explain it. But it’s not to say that it was not any good. We always did our best at whatever we were doing, but it wasn’t the same.” You can see Sammy Hagar’s Instagram post and Alex Van Halen’s recent video interview below.",
  "image": "https://consequence.net/wp-content/uploads/2024/12/Sammy-Hagar-Alex-Van-Halen.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1456323\" data-title=\"Sammy Hagar: Alex Van Halen Not Acknowledging “Van Hagar” Is “Blasphemy” to Eddie’s Legacy\" data-url=\"https://consequence.net/2024/12/sammy-hagar-alex-van-halen-blasphemy/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1456323\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Sammy Hagar: Alex Van Halen Not Acknowledging “Van Hagar” Is “Blasphemy” to Eddie’s Legacy\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003e\u003ca href=\"https://consequence.net/artist/sammy-hagar/\" target=\"_blank\" rel=\"noopener\"\u003eSammy Hagar\u003c/a\u003e has responded to \u003ca href=\"https://consequence.net/artist/alex-van-halen/\" target=\"_blank\" rel=\"noopener\"\u003eAlex Van Halen\u003c/a\u003e skipping the “Van Hagar” era in his memoir, calling the lack of acknowledgement “blasphemy” to Eddie’s legacy.\u003c/p\u003e\n\u003cp\u003eHagar’s remarks came via an otherwise innocuous \u003ca href=\"https://www.instagram.com/p/DELeDtsSvsY/\" target=\"_blank\" rel=\"noopener nofollow\"\u003eInstagram post\u003c/a\u003e that saw the Red Rocker nostalgically reflecting on his time in Van Halen. In the original post, featuring a photo from 1991 of Hagar and Eddie heading to the stage, Hagar joked about their choice of fashion at the time before taking a more serious tone when commenters began to compare the David Lee Roth years to Van Hagar.\u003c/p\u003e\n\u003cp\u003e“No disrespect to Alex but it’s ok to like VH with Sammy, even if he doesn’t anymore,” wrote one commenter, prompting another: “Most purists believe VH ended with DLR.”\u003c/p\u003e\n\u003cp\u003eHere, Hagar chimed in.\u003c/p\u003e\n\u003cp\u003e“It could have [ended], my friend, but instead we went on to sell over 50 million records for [a] No. 1 album [then] sold out every building and stadium in the world for a whole decade,” commented Hagar. “That never happened again.”\u003c/p\u003e\n\u003cp\u003eThen Hagar addressed the absence of the post-DLR era of Van Halen in Alex’s new memoir, \u003cem\u003eBrothers \u003c/em\u003e(\u003ca href=\"https://amzn.to/4gT1GpS\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003epurchase here\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003e“Alex is not doing his brother’s musical legacy justice by not acknowledging all the No. 1 albums and some great music Eddie and I wrote together — not Alex — but Eddie and I wrote together,” wrote Hagar. “To not acknowledge [those] 10 years of music is blasphemy to his brother’s musicianship, songwriting and legacy.”\u003c/p\u003e\n\u003cp\u003eAlex’s book makes no mention of the Hagar years, instead ending just before DLR’s initial exit from the band in 1985. Alex later explained the omission in an interview with \u003cem\u003eBillboard\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e“What happened after Dave left is not the same band. … The magic was in the first years,” he \u003ca href=\"https://consequence.net/2024/10/alex-van-halen-van-halen-magic-was-with-david-lee-roth/\" target=\"_blank\" rel=\"noopener\"\u003esaid\u003c/a\u003e, “when we didn’t know what we were doing; when we were willing to try anything.”\u003c/p\u003e\n\u003cp\u003eAlex maintained that “the original band was the driving force,” in a more recent interview with the \u003ca href=\"https://www.youtube.com/watch?v=JTqB6SLe6CQ\" target=\"_blank\" rel=\"noopener nofollow\"\u003e“Bringing It Back to The Beatles” podcast\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e“That’s why the book ends in 1984, because that was true rock and roll,” he said. “After that, it became much more — I don’t know; I can’t explain it. But it’s not to say that it was not any good. We always did our best at whatever we were doing, but it wasn’t the same.”\u003c/p\u003e\n\u003cp\u003eYou can see Sammy Hagar’s Instagram post and Alex Van Halen’s recent video interview below.\u003c/p\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DELeDtsSvsY/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\n\n\u003c/blockquote\u003e\n\n\u003cp\u003e\u003cspan\u003e\u003ciframe loading=\"lazy\" width=\"100%\" height=\"360\" src=\"https://www.youtube.com/embed/JTqB6SLe6CQ?version=3\u0026amp;rel=1\u0026amp;showsearch=0\u0026amp;showinfo=1\u0026amp;iv_load_policy=1\u0026amp;fs=1\u0026amp;hl=en-US\u0026amp;autohide=2\u0026amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-31T11:15:00-05:00",
  "modifiedTime": "2024-12-31T11:16:19-05:00"
}
