{
  "id": "7513d076-d7ff-414a-89c2-89bf2c986ce1",
  "title": "Drew Carey Spins Funky Jams at Phish New Year’s Eve Afterparty as DJ Blender",
  "link": "https://consequence.net/2025/01/drew-carey-phish-dj-blender-watch/",
  "description": "The comedian and Price Is Right host also wore a t-shirt saying “I Don’t Know the Price of Anything.” Drew Carey Spins Funky Jams at Phish New Year’s Eve Afterparty as DJ Blender Jo Vito",
  "author": "Jo Vito",
  "published": "Fri, 03 Jan 2025 22:22:34 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "News",
    "TV",
    "Drew Carey",
    "Jam Band"
  ],
  "byline": "Jo Vito",
  "length": 1461,
  "excerpt": "Drew Carey adopted the stage name DJ Blender to host a recent afterparty for Phish’s New Year’s Eve show at Madison Square Garden.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "After saying that he would stick his “dick in a blender” to see Phish at the Sphere again last April, Drew Carey has continued his reign as Phish Fan Supreme by DJing an afterparty for the band’s recent New Year’s Eve concert under the apt name DJ Blender. The afterparty was hosted at Hill Country Barbecue in New York following Phish’s fourth and final show in their New Year’s Eve run at Madison Square Garden. Hosting alongside Phish radio personality Tad Cautious and DJ Cooley, the Price Is Right host delivered a set of funky jams, donning a t-shirt that said “I Don’t Know the Price of Anything.” In fan-uploaded footage, Carey can be seen spinning Lettuce’s 2018 track “Sam Huff’s Flying Raging Machine.” Watch the video below. Carey has become perhaps the highest-profile Phish fan of the past year, after essentially listening to them for the very first time at the Sphere in Las Vegas. After that experience — and his infamous blender remark — the band thanked him by sending him a signed blender. The next week, Carey said Phish’s show at the Las Vegas venue made U2 — who performed there previously — look like a bar band. Meanwhile, Phish will perform their annual run of shows in Riviera Maya, Mexico later this month. In the spring, frontman Trey Anastasio will embark on a 20-date solo acoustic tour (get tickets). Drew Carey DJ set phish after playing Lettuce pic.twitter.com/qWmVaHpYsf — Joe Marcinek Band (@Joemarcinekband) January 1, 2025",
  "image": "https://consequence.net/wp-content/uploads/2025/01/Drew-Carey-hosts-Phish-New-Years-Eve-afterparty-as-DJ-Blender.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1456662\" data-title=\"Drew Carey Spins Funky Jams at Phish New Year’s Eve Afterparty as DJ Blender\" data-url=\"https://consequence.net/2025/01/drew-carey-phish-dj-blender-watch/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1456662\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Drew Carey Spins Funky Jams at Phish New Year’s Eve Afterparty as DJ Blender\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eAfter saying that he would \u003ca href=\"https://consequence.net/2024/04/drew-carey-phish-dick-in-blender/\" target=\"_blank\" rel=\"noopener\"\u003estick his “dick in a blender”\u003c/a\u003e to see \u003ca href=\"https://consequence.net/artist/phish/\" target=\"_blank\" rel=\"noopener\"\u003ePhish\u003c/a\u003e at the Sphere again last April, \u003ca href=\"https://consequence.net/tag/drew-carey/\" target=\"_blank\" rel=\"noopener\"\u003eDrew Carey\u003c/a\u003e has continued his reign as Phish Fan Supreme by DJing an afterparty for the band’s recent New Year’s Eve concert under the apt name DJ Blender.\u003c/p\u003e\n\u003cp\u003eThe afterparty was hosted at Hill Country Barbecue in New York following Phish’s fourth and final show in their New Year’s Eve run at Madison Square Garden. Hosting alongside Phish radio personality Tad Cautious and DJ Cooley, the Price Is Right host delivered a set of funky jams, donning a t-shirt that said “I Don’t Know the Price of Anything.”\u003c/p\u003e\n\u003cp\u003eIn fan-uploaded footage, Carey can be seen spinning Lettuce’s 2018 track “Sam Huff’s Flying Raging Machine.” Watch the video below.\u003c/p\u003e\n\u003cp\u003eCarey has become perhaps the highest-profile Phish fan of the past year, after essentially listening to them for the very first time at the Sphere in Las Vegas. After that experience — and his infamous blender remark — the band thanked him by \u003ca href=\"https://consequence.net/2024/04/phish-drew-carey-blender/\" target=\"_blank\" rel=\"noopener\"\u003esending him a signed blender.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe next week, Carey said Phish’s show at the Las Vegas venue made U2 — who performed there previously — \u003ca href=\"https://consequence.net/2024/05/drew-carey-phish-the-sphere-u2-bar-band/\" target=\"_blank\" rel=\"noopener\"\u003elook like a bar band.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eMeanwhile, Phish will perform their annual run of shows in Riviera Maya, Mexico later this month. In the spring, frontman Trey Anastasio will embark on a 20-date solo acoustic tour \u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:trey-anastasio*drew-carey-dj-blender/destination:https%3A%2F%2Fwww.stubhub.com%2Ftrey-anastasio-tickets%2Fperformer%2F1565\" target=\"_blank\" rel=\"noopener nofollow\"\u003e(get tickets).\u003c/a\u003e\u003c/p\u003e\n\u003cblockquote data-width=\"500\" data-dnt=\"true\"\u003e\n\u003cp lang=\"en\" dir=\"ltr\"\u003eDrew Carey DJ set phish after playing Lettuce \u003ca href=\"https://t.co/qWmVaHpYsf\" target=\"_blank\" rel=\"nofollow\"\u003epic.twitter.com/qWmVaHpYsf\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Joe Marcinek Band (@Joemarcinekband) \u003ca href=\"https://twitter.com/Joemarcinekband/status/1874523445981315567?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow noopener\"\u003eJanuary 1, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-03T17:22:34-05:00",
  "modifiedTime": null
}
