{
  "id": "88f08938-3c60-4cbd-a217-3012a7b4fd6a",
  "title": "3 DOORS DOWN's BRAD ARNOLD Diagnosed With Stage 4 Kidney Cancer, Band Cancels Tour Plans",
  "link": "https://metalinjection.net/news/3-doors-downs-brad-arnold-diagnosed-with-stage-4-kidney-cancer-band-cancels-tour-plans",
  "description": "It's metastasized to his lungs as well. The post 3 DOORS DOWN's BRAD ARNOLD Diagnosed With Stage 4 Kidney Cancer, Band Cancels Tour Plans appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Wed, 07 May 2025 19:09:35 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "3 doors down",
    "featured"
  ],
  "byline": "By Greg Kennelty Published 6 hours ago",
  "length": 1446,
  "excerpt": "It's metastasized to his lungs as well.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "3 Doors Down vocalist Brad Arnold has sadly revealed that he is battling stage 4 clear cell renal cell carcinoma (ccRCC), a type of kidney cancer. Arnold revealed the news in a video message to fans, understandably also noting that 3 Doors Down will not be touring this summer as he undergoes treatment. We wish Arnold all the best with his battle and look forward to hearing that he's doing way better in the future. \"Hey, everybody, it's Brad from 3 Doors Down,\" said Arnold. \"I hope you're having a great day today. I've got some not-so-good news for you today. So I'd been sick a couple of weeks ago and then went to the hospital and got checked out and had actually got the diagnosis that I had clear cell renal [cell] carcinoma that had metastasized into my lung. And it's stage four, and that's not real good. But you know what? We serve a mighty God, and he can overcome anything. \"So I have no fear. I really, sincerely am not scared of it at all. But it is gonna force us to cancel our tour this summer. And we're sorry for that. And I'd love for you to lift me up in prayer every chance you get. And I think it is time for me to maybe go listen to 'It's Not My Time' a little bit. \"Thank you, guys, so much. God loves you. We love you. See you.\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/09/3-Doors-Down-01-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003e3 Doors Down\u003c/strong\u003e vocalist \u003cstrong\u003eBrad Arnold\u003c/strong\u003e has sadly revealed that he is battling stage 4 clear cell renal cell carcinoma (ccRCC), a type of kidney cancer. \u003cstrong\u003eArnold\u003c/strong\u003e revealed the news in a video message to fans, understandably also noting that \u003cstrong\u003e3 Doors Down\u003c/strong\u003e will not be touring this summer as he undergoes treatment. We wish \u003cstrong\u003eArnold\u003c/strong\u003e all the best with his battle and look forward to hearing that he\u0026#39;s doing way better in the future.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Hey, everybody, it\u0026#39;s \u003cstrong\u003eBrad\u003c/strong\u003e from \u003cstrong\u003e3 Doors Down\u003c/strong\u003e,\u0026#34; said \u003cstrong\u003eArnold\u003c/strong\u003e. \u0026#34;I hope you\u0026#39;re having a great day today. I\u0026#39;ve got some not-so-good news for you today. So I\u0026#39;d been sick a couple of weeks ago and then went to the hospital and got checked out and had actually got the diagnosis that I had clear cell renal [cell] carcinoma that had metastasized into my lung. And it\u0026#39;s stage four, and that\u0026#39;s not real good. But you know what? We serve a mighty God, and he can overcome anything.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;So I have no fear. I really, sincerely am not scared of it at all. But it is gonna force us to cancel our tour this summer. And we\u0026#39;re sorry for that. And I\u0026#39;d love for you to lift me up in prayer every chance you get. And I think it is time for me to maybe go listen to \u0026#39;It\u0026#39;s Not My Time\u0026#39; a little bit.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Thank you, guys, so much. God loves you. We love you. See you.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"A Message From Brad\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/hp7KlgiRxRM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-07T15:09:35-04:00",
  "modifiedTime": "2025-05-07T15:09:36-04:00"
}
