{
  "id": "89c597a1-4050-4cad-8e1b-9722093ae9e7",
  "title": "The Great Music You Didn’t Know David Lynch Made in 10 Songs",
  "link": "https://consequence.net/2025/01/david-lynch-music-songs-list/",
  "description": "Lynch brought his unique artistic sensibilities to the medium of music, too. The Great Music You Didn’t Know David Lynch Made in 10 Songs Consequence Staff",
  "author": "Consequence Staff",
  "published": "Thu, 16 Jan 2025 23:46:48 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "Features",
    "Film",
    "Lists",
    "art-rock",
    "David Lynch",
    "Dream Pop",
    "Experimental",
    "Jazz"
  ],
  "byline": "Jonah Krueger",
  "length": 1672,
  "excerpt": "Many know David Lynch for his dazzling, innovative work in film and television, but he was equally genius in music, as proven in these 10 songs.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Many know David Lynch for his singular filmmaking — and for good reason. Flicks like Eraserhead, Mulholland Drive, and Blue Velvet rightfully helped etch his name into the greater cinematic canon as a truly idiosyncratic, innovative, dazzling creative force. And that’s all without mentioning the lasting impact of his television series, Twin Peaks. What’s less widely known, however, is that his brilliance wasn’t confined to moving pictures. As those who’ve listened are aware, Lynch’s musical streak is just as adventurous, engaging, and, yes, Lynchian as his filmography. And we’re not just talking about his influence on music, although that list is quite vast as well. Sure, there are plenty of songs that have sampled and interpolated his work (like Acid Bath’s “Cassie Eats Cockroaches,” Modest Mouse’s “Workin’ on Leavin’ the Livin’,” Green Day’s cover of “My Generation,” or even Michael Jackson’s “Morphine”), but Lynch himself also penned his own expansive catalog of tunes. Whether he was writing lyrics, composing instrumentation, or reading spoken word, whenever Lynch touched a track, it was imbued with his indescribable, warped sense of beauty. So, in the wake of his passing, we’ve rounded up 10 songs to showcase just how much of a musical genius David Lynch truly was. Some of these cuts came from his film and television projects, some from high-profile collaborations, and others from his surprisingly plentiful solo recording career. What unites them all, though, through 40-plus years of music, is the vision of a once-in-a-generation artistic mind. Check out the full list, presented chronologically, below. — Jonah Krueger Editorial Coordinator",
  "image": "https://consequence.net/wp-content/uploads/2025/01/David-Lynch-guitar.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1459264\" data-title=\"The Great Music You Didn’t Know David Lynch Made in 10 Songs\" data-url=\"https://consequence.net/2025/01/david-lynch-music-songs-list/\" data-page=\"1\" data-pages=\"3\" data-total-posts=\"3\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1459264\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"The Great Music You Didn’t Know David Lynch Made in 10 Songs\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eMany know \u003ca href=\"https://consequence.net/tag/david-lynch/\" target=\"_blank\" rel=\"noopener\"\u003eDavid Lynch\u003c/a\u003e for his singular filmmaking — and \u003ca href=\"https://consequence.net/2025/01/david-lynch-movies-ranked-list/\" target=\"_blank\" rel=\"noopener\"\u003efor good reason\u003c/a\u003e. Flicks like \u003cem\u003eEraserhead\u003c/em\u003e, \u003cem\u003eMulholland Drive\u003c/em\u003e, and \u003cem\u003eBlue Velvet\u003c/em\u003e rightfully helped etch his name into the greater cinematic canon as a truly idiosyncratic, innovative, dazzling creative force. And that’s all without mentioning the lasting impact of his television series, \u003ca href=\"https://consequence.net/2023/02/twin-peaks-cosmic-horror/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eTwin Peaks\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWhat’s less widely known, however, is that his brilliance wasn’t confined to moving pictures. As those who’ve listened are aware, Lynch’s musical streak is just as adventurous, engaging, and, yes, Lynchian as his filmography.\u003c/p\u003e\n\n\u003cp\u003eAnd we’re not just talking about his \u003cem\u003einfluence\u003c/em\u003e on music, although that list is quite vast as well. Sure, there are plenty of songs that have sampled and interpolated his work (like Acid Bath’s “Cassie Eats Cockroaches,” Modest Mouse’s “Workin’ on Leavin’ the Livin’,” Green Day’s cover of “My Generation,” or even Michael Jackson’s “Morphine”), but Lynch himself also penned his own expansive catalog of tunes. Whether he was writing lyrics, composing instrumentation, or reading spoken word, whenever Lynch touched a track, it was imbued with his indescribable, warped sense of beauty.\u003c/p\u003e\n\u003cp\u003eSo, in the wake of his \u003ca href=\"https://consequence.net/2025/01/david-lynch-dead/\" target=\"_blank\" rel=\"noopener\"\u003epassing\u003c/a\u003e, we’ve rounded up 10 songs to showcase just how much of a musical genius David Lynch truly was. Some of these cuts came from his film and television projects, some from high-profile collaborations, and others from his surprisingly plentiful solo recording career. What unites them all, though, through 40-plus years of music, is the vision of a once-in-a-generation artistic mind. Check out the full list, presented chronologically, below.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e— Jonah Krueger\u003cbr/\u003e\n\u003c/em\u003e\u003cem\u003eEditorial Coordinator\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-16T18:46:48-05:00",
  "modifiedTime": "2025-01-16T19:50:06-05:00"
}
