{
  "id": "8bcd2381-e2c6-4ad4-b3e2-3468a6884a56",
  "title": "Post-Metalcore Band ALIGNED Streams Massive, Moody Single \"Control\"",
  "link": "https://metalinjection.net/video/post-metalcore-band-aligned-streams-massive-moody-single-control",
  "description": "Gothenburg-based post-metalcore band Aligned is back with their second single of 2025 and it's a banger. Aligned is now streaming their new single \"Control\" alongside a captivating and moody music […] The post Post-Metalcore Band ALIGNED Streams Massive, Moody Single \"Control\" appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Sun, 16 Feb 2025 22:08:41 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "Aligned"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 888,
  "excerpt": "Gothenburg-based post-metalcore band Aligned is back with their second single of 2025 and it's a banger. Aligned is now streaming their new single \"Control\" alongside a captivating and moody music video directed by Linda Florin (Dark Tranquillity, The Unguided). On the single itself, Aligned offe",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Gothenburg-based post-metalcore band Aligned is back with their second single of 2025 and it's a banger. Aligned is now streaming their new single \"Control\" alongside a captivating and moody music video directed by Linda Florin (Dark Tranquillity, The Unguided). On the single itself, Aligned offered: \"'Control' further shows the progression Aligned is headed towards a unique take on modern metal, merging the raw intensity of metalcore with subtle touches of melodic metal and a haunting sense of melancholy.\" Check it out above! Once you've stoped humming that chorus to yourself – and it might take a while for that to happen – go ahead and give Aligned a follow on all their socials right here. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/01/Aligned-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eGothenburg-based post-metalcore band \u003cstrong\u003eAligned\u003c/strong\u003e is back with their second single of 2025 and it\u0026#39;s a banger. \u003cstrong\u003eAligned\u003c/strong\u003e is now streaming their new single \u0026#34;Control\u0026#34; alongside a captivating and moody music video directed by \u003cstrong\u003eLinda Florin\u003c/strong\u003e (\u003cstrong\u003eDark Tranquillity\u003c/strong\u003e, \u003cstrong\u003eThe Unguided\u003c/strong\u003e).\u003c/p\u003e\n\n\n\n\u003cp\u003eOn the single itself, \u003cstrong\u003eAligned\u003c/strong\u003e offered: \u0026#34;\u0026#39;Control\u0026#39; further shows the progression Aligned is headed towards a unique take on modern metal, merging the raw intensity of metalcore with subtle touches of melodic metal and a haunting sense of melancholy.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eCheck it out above! Once you\u0026#39;ve stoped humming that chorus to yourself – and it might take a while for that to happen – go ahead and give \u003ca href=\"https://linktr.ee/Alignedband\"\u003e\u003cstrong\u003eAligned\u003c/strong\u003e a follow on all their socials right here\u003c/a\u003e.\n\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\n\t\n\t\n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\n\t\t\t\t\n\t\n\t\n\t\n\t\u003cdiv itemprop=\"publisher\" itemscope=\"\" itemtype=\"https://schema.org/Organization\"\u003e\n\t\t\t\t\u003cdiv itemprop=\"logo\" itemscope=\"\" itemtype=\"https://schema.org/ImageObject\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2020/09/metalinjectionlogo-2020-3.png\"/\u003e\u003c/p\u003e\u003cmeta itemprop=\"url\" content=\"https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2020/09/metalinjectionlogo-2020-3.png\"/\u003e\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003cmeta itemprop=\"name\" content=\"Metal Injection\"/\u003e\n\t\t\t\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
