{
  "id": "ba28ab4b-9e04-493b-bf2b-767116d5f821",
  "title": "DRAGONFORCE's HERMAN LI On How Online Interaction With Fans Shapes His Work: \"They Got Better Memory Than Me\"",
  "link": "https://metalinjection.net/news/dragonforces-herman-li-on-how-online-interaction-with-fans-shapes-his-work-they-got-better-memory-than-me",
  "description": "“So they're helping me archive my life at the same time.\"",
  "author": "Joel Barrios",
  "published": "Mon, 04 Nov 2024 20:22:39 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "dragonforce"
  ],
  "byline": "By Joel Barrios Published 4 hours ago",
  "length": 3050,
  "excerpt": "“So they're helping me archive my life at the same time.\"",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "In a recent chat with São Paulo's 89 FM A Rádio Rock, Dragonforce guitarist Herman Li shared insights on how his connection with fans via social media has shaped his creative process. Li explained that platforms like Twitch allow him to share his music-making in real-time, providing a glimpse into his world as an artist. Reflecting on the creation of the band's previous album, Extreme Power Metal, Li said (via Blabbermouth): \"With Twitch, it's really just to show who I am and open the window to the world of what I do. So not this album, but the previous album, Extreme Power Metal, I recorded a lot of the guitar parts live on Twitch in front of fans to show them what the process is like.\" Li revealed that fan feedback played a key role in helping him assess his work: \"And it was great because, to be honest, sometimes I don't even know if something is good enough when I record and I'll do it like a whole day, and I'm, like, 'Oh, it sounds all the same. It's not that good.' Having the fans that listen to it and say, 'You know what? That's good enough, Herman. You can move on was really helpful. I doubt myself too.\" This ongoing interaction has fostered a unique community of fans who, according to Li, sometimes know more about Dragonforce's music than he does: \"So we really have a really special community on Twitch with the fans where they get, I guess, a preview of everything before. It's kind of cool. Actually, they know better than me about the albums. It's, like, when we released the new album, they said, 'Oh, you guys already played that on Twitch years ago, four years before.' I didn't know we did it, the demo version of it. So they got better memory than me. So they're helping me archive my life at the same time,\" he joked. On the subject of dealing with online negativity, Li admitted that while trolls do show up occasionally, it's something he's learned to handle. He explained that the atmosphere on Twitch is generally more positive than YouTube, stating: \"Oh, we always get a few of those guys, but it's okay. I'm used to it. It's still more pleasant than over on YouTube. You open YouTube, and it's a different kind of level — in the past. Now it's actually much more positive. I think, I hope I'm right, that the general population, at least the younger fans of music, and more accepting of different styles now. They're not so like in the old days, 'I hate everything else. I only like one style. I only like black metal and that's it,' or something.\" Earlier this year, Dragonforce made waves in the gaming world by teaming up with Brawl Stars for a special collaboration, releasing the song \"A Draco Tale\" and its accompanying music video to celebrate a new in-game character. With over a billion downloads, Brawl Stars provided an exciting platform for the band to connect with a massive, diverse audience. Want More Metal? Subscribe To Our Daily Newsletter Enter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2021/01/Dragonforce-herman-li.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eIn a recent chat with São Paulo\u0026#39;s \u003cem\u003e89 FM A Rádio Rock\u003c/em\u003e, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/DragonForce\"\u003eDragonforce\u003c/a\u003e\u003c/strong\u003e guitarist \u003cstrong\u003eHerman Li\u003c/strong\u003e shared insights on how his connection with fans via social media has shaped his creative process. \u003cstrong\u003eLi\u003c/strong\u003e explained that platforms like Twitch allow him to share his music-making in real-time, providing a glimpse into his world as an artist.\u003c/p\u003e\n\n\n\n\u003cp\u003eReflecting on the creation of the band\u0026#39;s previous album, \u003cem\u003eExtreme Power Metal\u003c/em\u003e, \u003cstrong\u003eLi \u003c/strong\u003esaid (via \u003cem\u003e\u003ca href=\"https://blabbermouth.net/news/dragonforces-herman-li-explains-how-his-interaction-with-fans-on-social-media-affects-his-work\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBlabbermouth\u003c/a\u003e\u003c/em\u003e): \u0026#34;With Twitch, it\u0026#39;s really just to show who I am and open the window to the world of what I do. So not this album, but the previous album, \u003cem\u003eExtreme Power Metal\u003c/em\u003e, I recorded a lot of the guitar parts live on Twitch in front of fans to show them what the process is like.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLi\u003c/strong\u003e revealed that fan feedback played a key role in helping him assess his work: \u0026#34;And it was great because, to be honest, sometimes I don\u0026#39;t even know if something is good enough when I record and I\u0026#39;ll do it like a whole day, and I\u0026#39;m, like, \u0026#39;Oh, it sounds all the same. It\u0026#39;s not that good.\u0026#39; Having the fans that listen to it and say, \u0026#39;You know what? That\u0026#39;s good enough, \u003cstrong\u003eHerman\u003c/strong\u003e. You can move on was really helpful. I doubt myself too.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eThis ongoing interaction has fostered a unique community of fans who, according to \u003cstrong\u003eLi\u003c/strong\u003e, sometimes know more about \u003cstrong\u003eDragonforce\u003c/strong\u003e\u0026#39;s music than he does: \u0026#34;So we really have a really special community on Twitch with the fans where they get, I guess, a preview of everything before. It\u0026#39;s kind of cool. Actually, they know better than me about the albums. It\u0026#39;s, like, when we released the new album, they said, \u0026#39;Oh, you guys already played that on Twitch years ago, four years before.\u0026#39; I didn\u0026#39;t know we did it, the demo version of it. So they got better memory than me. So they\u0026#39;re helping me archive my life at the same time,\u0026#34; he joked.\n\n\n\n\u003c/p\u003e\u003cp\u003eOn the subject of dealing with online negativity, \u003cstrong\u003eLi\u003c/strong\u003e admitted that while trolls do show up occasionally, it\u0026#39;s something he\u0026#39;s learned to handle. He explained that the atmosphere on Twitch is generally more positive than YouTube, stating: \u0026#34;Oh, we always get a few of those guys, but it\u0026#39;s okay. I\u0026#39;m used to it. It\u0026#39;s still more pleasant than over on YouTube. You open YouTube, and it\u0026#39;s a different kind of level — in the past. Now it\u0026#39;s actually much more positive. I think, I hope I\u0026#39;m right, that the general population, at least the younger fans of music, and more accepting of different styles now. They\u0026#39;re not so like in the old days, \u0026#39;I hate everything else. I only like one style. I only like black metal and that\u0026#39;s it,\u0026#39; or something.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003eEarlier this year, \u003cstrong\u003eDragonforce\u003c/strong\u003e made waves in the gaming world by teaming up with \u003cem\u003eBrawl Stars\u003c/em\u003e for a special collaboration, releasing the song \u0026#34;A Draco Tale\u0026#34; and its accompanying music video to celebrate a new in-game character. With over a billion downloads, \u003cem\u003eBrawl Stars\u003c/em\u003e provided an exciting platform for the band to connect with a massive, diverse audience.\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"ENTREVISTA 89 - DRAGONFORCE\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/HFPseD3wA1g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003ch5\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/h5\u003e\n\t\t\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-04T15:22:39-05:00",
  "modifiedTime": "2024-11-04T15:22:42-05:00"
}
