{
  "id": "d3bef891-ed69-4426-a856-a9cbea13b9b6",
  "title": "MAYHEM Is Working On A New Album",
  "link": "https://metalinjection.net/upcoming-releases/in-the-studio/mayhem-is-working-on-a-new-album",
  "description": "Their first since 2019. The post MAYHEM Is Working On A New Album appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Wed, 02 Jul 2025 22:51:55 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "In The Studio",
    "Mayhem"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 1477,
  "excerpt": "Their first since 2019.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Norwegian black metal icons Mayhem are officially working on the follow-up to their 2019 album Daemon, and while details are scarce, guitarist Teloch has confirmed that writing and pre-production are well underway. Teloch, who has played a central role in the band’s creative direction over the past decade, recently offered a brief but telling update via social media: \"My excuse for not being active on here for the last months: Working on the new Mayhem. I need to focus. My brain is fried. Guitars, bass, drum beats, vocal guides, effects, synths yadayada.\" Though it's not like Mayhem has been quiet since the release of Daemon.Mayhem released their Atavistic Black Disorder / Kommando EP in 2021, which contained a mix of unreleased Daemon session tracks and punk covers of bands like Discharge, Dead Kennedys, and the Ramones. Mayhem also released Daemonic Rites in 2023, which is a live album compiling performances from their 2019–2022 tours and features material from Daemon as well as classics from their earlier catalog. In the meantime, Mayhem has the following shows coming up in August. 8/2 Vagos, Portugal Vagos Metal Fest8/8 Jaroměř, Czech Republic Brutal Assault8/10 Warsaw, Poland Progresja8/15 Borre, Norway Midgardsblot Metal Festival8/16 Uppsala, Sweden Parksnäckan Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2023/10/3.-Mayhem_IMG_6789.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eNorwegian black metal icons \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/mayhem\"\u003eMayhem\u003c/a\u003e\u003c/strong\u003e are officially working on the follow-up to their 2019 album \u003cem\u003eDaemon\u003c/em\u003e, and while details are scarce, guitarist \u003cstrong\u003eTeloch\u003c/strong\u003e has confirmed that writing and pre-production are well underway.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTeloch\u003c/strong\u003e, who has played a central role in the band’s creative direction over the past decade, recently offered a brief but telling update via social media: \u0026#34;My excuse for not being active on here for the last months: Working on the new \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/mayhem\"\u003eMayhem\u003c/a\u003e\u003c/strong\u003e. I need to focus. My brain is fried. Guitars, bass, drum beats, vocal guides, effects, synths yadayada.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eThough it\u0026#39;s not like \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/mayhem\"\u003eMayhem\u003c/a\u003e\u003c/strong\u003e has been quiet since the release of \u003cem\u003eDaemon\u003c/em\u003e.\u003cbr/\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/mayhem\"\u003eMayhem\u003c/a\u003e\u003c/strong\u003e released their \u003cem\u003eAtavistic Black Disorder / Kommando\u003c/em\u003e EP in 2021, which contained a mix of unreleased Daemon session tracks and punk covers of bands like \u003cstrong\u003eDischarge\u003c/strong\u003e, \u003cstrong\u003eDead Kennedys\u003c/strong\u003e, and the \u003cstrong\u003eRamones\u003c/strong\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/mayhem\"\u003eMayhem\u003c/a\u003e\u003c/strong\u003e also released \u003cem\u003eDaemonic \u003c/em\u003eRites in 2023, which is a live album compiling performances from their 2019–2022 tours and features material from \u003cem\u003eDaemon\u003c/em\u003e as well as classics from their earlier catalog. In the meantime, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/mayhem\"\u003eMayhem\u003c/a\u003e\u003c/strong\u003e has the following shows coming up in August.\n\n\n\n\u003c/p\u003e\u003cp\u003e8/2 Vagos, Portugal Vagos Metal Fest\u003cbr/\u003e8/8 Jaroměř, Czech Republic Brutal Assault\u003cbr/\u003e8/10 Warsaw, Poland Progresja\u003cbr/\u003e8/15 Borre, Norway Midgardsblot Metal Festival\u003cbr/\u003e8/16 Uppsala, Sweden Parksnäckan\u003c/p\u003e\n\n\n\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DLXMruaMzyT/\" data-instgrm-version=\"14\" data-instgrm-captioned=\"\"\u003e\u003c/blockquote\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-02T18:51:55-04:00",
  "modifiedTime": "2025-07-02T18:51:56-04:00"
}
