{
  "id": "db26c61d-7b89-4da4-b43c-cb6dff277160",
  "title": "Apparently MACHINE GUN KELLY Made Guitar Cool Again",
  "link": "https://metalinjection.net/news/apparently-machine-gun-kelly-made-guitar-cool-again",
  "description": "Eh... The post Apparently MACHINE GUN KELLY Made Guitar Cool Again appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Fri, 21 Feb 2025 17:06:30 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "featured2",
    "Machine Gun Kelly"
  ],
  "byline": "By Greg Kennelty Published 7 hours ago",
  "length": 2125,
  "excerpt": "Eh...",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Machine Gun Kelly got his ass kicked in a feud with Eminem so bad in 2018 that he switched from making rap music to pop punk. Kelly has since dipped a toe into country music as well because of course he has, but still – a lot of what Kelly has been doing is very guitar-centric. And according to Polyphia guitarist Tim Henson in an interview with Guitar World, that's made guitar cool again. \"I'd say guitar music got cool! You know, maybe we had a little bit to do with that, maybe we didn't. Around that time, Eminem did the thing with MGK, and kind of made him switch genres. And then MGK got a number one record with a guitar on the cover, which is really cool. So shout out MGK for making guitar cool again! \"Since then too, like, think about all the insane players that have come out, like Marcin, like RJ [Pasin]… there's so many new insane guitar players. So I'd say that it's really cool. [laughs]\" Which one hand, sure – MGK is extremely popular and over the course of the past few years he's put out a lot of guitar-driven music. On the other hand, bands like Blink-182 have been doing exactly that type of music (like, exactly that type) and have been selling out stadiums. And then there's country music, which sucks but man is that genre massive and guitar-focused. As far as guitarists that are impressing Henson at the moment, he's got one in mind: \"Dude, there's that guy, Spiro [Dussias] – you know what I'm talking about. I don't know how to say his last name. I just recognize the Instagram handle, but that guy is fucking crazy. And there's definitely a few others that are escaping me. \"But as we start to book these sessions this year, to bring in all the incredible talent that is out there, to vibe them out on the new music, I'm definitely going to be hitting up Spiro just to see what kind of insanity he can bring. There's lots of incredible stuff coming up talent-wise in the guitar world right now.\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/02/Machine-Gun-Kelly-Acoustic.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eMachine Gun Kelly\u003c/strong\u003e got his ass kicked in a feud with \u003cstrong\u003eEminem\u003c/strong\u003e so bad in 2018 that he switched from making rap music to pop punk. \u003cstrong\u003eKelly\u003c/strong\u003e has since dipped a toe into country music as well because of course he has, but still – a lot of what \u003cstrong\u003eKelly\u003c/strong\u003e has been doing is very guitar-centric. And according to \u003cstrong\u003ePolyphia\u003c/strong\u003e guitarist \u003cstrong\u003eTim Henson\u003c/strong\u003e in an interview with \u003cem\u003e\u003ca href=\"https://www.guitarworld.com/artists/guitarists/tim-henson-heavy-polyphia-solo-album-ernie-ball-signature-strings\"\u003eGuitar World\u003c/a\u003e\u003c/em\u003e, that\u0026#39;s made guitar cool again.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;I\u0026#39;d say guitar music got cool! You know, maybe we had a little bit to do with that, maybe we didn\u0026#39;t. Around that time, \u003cstrong\u003eEminem\u003c/strong\u003e did the thing with \u003cstrong\u003eMGK\u003c/strong\u003e, and kind of made him switch genres. And then \u003cstrong\u003eMGK\u003c/strong\u003e got a number one record with a guitar on the cover, which is really cool. So shout out \u003cstrong\u003eMGK\u003c/strong\u003e for making guitar cool again!\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Since then too, like, think about all the insane players that have come out, like \u003cstrong\u003eMarcin\u003c/strong\u003e, like \u003cstrong\u003eRJ\u003c/strong\u003e [\u003cstrong\u003ePasin\u003c/strong\u003e]… there\u0026#39;s so many new insane guitar players. So I\u0026#39;d say that it\u0026#39;s really cool. [laughs]\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eWhich one hand, sure – \u003cstrong\u003eMGK\u003c/strong\u003e is extremely popular and over the course of the past few years he\u0026#39;s put out a lot of guitar-driven music. On the other hand, bands like \u003cstrong\u003eBlink-182\u003c/strong\u003e have been doing exactly that type of music (like, \u003cem\u003eexactly that type\u003c/em\u003e) and have been selling out stadiums. And then there\u0026#39;s country music, which sucks but man is that genre massive and guitar-focused.\n\n\n\n\u003c/p\u003e\u003cp\u003eAs far as guitarists that are impressing \u003cstrong\u003eHenson\u003c/strong\u003e at the moment, he\u0026#39;s got one in mind: \u0026#34;Dude, there\u0026#39;s that guy, \u003cstrong\u003eSpiro\u003c/strong\u003e [\u003cstrong\u003eDussias\u003c/strong\u003e] – you know what I\u0026#39;m talking about. I don\u0026#39;t know how to say his last name. I just recognize the Instagram handle, but that guy is fucking crazy. And there\u0026#39;s definitely a few others that are escaping me.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;But as we start to book these sessions this year, to bring in all the incredible talent that is out there, to vibe them out on the new music, I\u0026#39;m definitely going to be hitting up \u003cstrong\u003eSpiro\u003c/strong\u003e just to see what kind of insanity he can bring. There\u0026#39;s lots of incredible stuff coming up talent-wise in the guitar world right now.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Spiro - \u0026#34;Negative\u0026#34; | Archetype: Nolly X Playthrough\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/3mzDPF5230M?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-21T12:06:30-05:00",
  "modifiedTime": "2025-02-21T12:55:42-05:00"
}
