{
  "id": "e1f8a681-cbbe-4f68-94a4-fa36a378702e",
  "title": "Google has launched a film and TV production house with Range Media Partners. What does that mean for the future of music rightsholders?",
  "link": "https://www.musicbusinessworldwide.com/google-has-launched-a-film-and-tv-production-house-with-range-media-partners-what-does-that-signal-for-the-future-of-music-rightsholders/",
  "description": "Google becoming an entertainment IP owner might just make the company more conscious of the value of IP Source",
  "author": "Daniel Tencer",
  "published": "Wed, 07 May 2025 18:57:58 +0000",
  "source": "https://www.musicbusinessworldwide.com/feed/",
  "categories": [
    "News",
    "100 Zeros",
    "Google",
    "Range Media Partners"
  ],
  "byline": "Daniel Tencer",
  "length": 5211,
  "excerpt": "Google becoming an entertainment IP owner might just make the company more conscious of the value of IP.",
  "siteName": "Music Business Worldwide",
  "favicon": "https://www.musicbusinessworldwide.com/wp-content/themes/mb/assets/img/icons/favicon-192x192.png",
  "text": "The integration of Big Tech and the entertainment industry has taken another step, this time with news that Google has launched a film and TV production company.Business Insider reported earlier this week that Google has quietly launched 100 Zeros, a film and TV production initiative that won’t be producing content for YouTube (a la YouTube Originals), instead offering it for sale to traditional studios and streaming services like Netflix.(“100 Zeros” is a cryptic way of saying Google. A one with 100 zeros after it is a googol, the quantity for which Google was named). For those in the music industry, one detail about 100 Zeros stands out: It’s part of a multi-year partnership with Range Media Partners, a management and production company known for its involvement in music.Aside from producing movies such as A Complete Unknown, The Monkey and Longlegs, Range Media also launched a music publishing division in 2023, which is proving to be a success.Range-signed songwriter Sean Cook recently scored the hit of a lifetime with Shaboozey’s A Bar Song (Tipsy). Last year, Range Publishing signed a distribution deal with Universal Music Publishing Group.Per Business Insider, a key aim for 100 Zeros is to promote a positive view of Google’s products, and tech in general, by shaping pop culture. BI notes that, while Google’s Android is the global leader in mobile device operating systems, in the US it has lost pole position to Apple. Google product placements in 100 Zeros-produced content could help address that. Google also sees an opportunity to sell filmmakers on its visual technologies, such as its Immersive View feature that enables users to see images in 3D, and, of course, AI-generated imagery.More broadly, Google is interested in shaping a positive view of tech, including AI, among the general public. To that end, Google and Range last month launched “AI on Screen,” a program to commission short films about AI, with an eye to turning two of the short films into feature-length productions.The two companies say they have built a “comprehensive ecosystem that will empower filmmakers at a pivotal moment where AI’s role requires extensive discussion and diverse viewpoints.”“We aim to collaborate with the Hollywood creative community in a thoughtful and productive way, upkeeping our ongoing commitment to responsibly support creative expression and explore the possibilities of technology through storytelling,” a Google spokesperson told the media.”GoogleYet Google’s move into film and TV production – and therefore into being an entertainment IP rightsholder – is likely to raise concerns within the music industry.To be sure, this isn’t the first hint we’ve had that Big Tech is aiming its M\u0026A dollars at the entertainment business. Witness, for instance, Amazon’s acquisition of MGM Studios in 2022, and the persistent rumors that have been circulating for years about a potential sale of Disney to Apple.Yet Google moving into film and TV may ruffle music industry feathers more than those other tie-ups, for the reason that Google owns YouTube, a major streamer of music. If Google were to buy up a major music rights catalog – hardly a far-fetched idea, given its interest some years ago in buying the Michael Jackson estate’s 50% share of music publisher Sony/ATV – streaming royalty negotiations would take place between two divisions of the same company.Inevitably, that would result in a major advantage for YouTube against music streaming competitors, like Spotify, who don’t own the library they stream. (By the same token, that prospect could also draw the interest of competition regulators, who may be reluctant to greenlight a deal that gives YouTube such a significant advantage.) Also significant for the music business is the fact that Google is a prominent AI developer and has even argued for a loosening of copyright laws to make AI development cheaper and simpler. In a recent submission to the UK parliament, Google argued that it shouldn’t have to pay for using copyrighted content to train AI.“We believe training on the open web must be free,” Google declared.That places the tech giant on the opposite side from most of the music industry, and artists, in an ongoing debate about the use of copyrighted content in training AI.Google seems to be aware of all these potential pitfalls of entering the entertainment space, with its public statements about 100 Zeros stressing keywords like “thoughtful” and “responsible.”“Through our continued partnership with Range, we aim to collaborate with the Hollywood creative community in a thoughtful and productive way, upkeeping our ongoing commitment to responsibly support creative expression and explore the possibilities of technology through storytelling,” a Google spokesperson told the media.No doubt rightsholders throughout the entertainment space hope Google sticks to this ethos.And for those who have their doubts, there is a positive scenario to consider here: Once Google owns entertainment IP, it will have a stake in maintaining that IP’s value.Suddenly, the idea that copyrighted content should be “free” for tech companies to use may not seem quite as appealing.Music Business Worldwide",
  "image": "https://www.musicbusinessworldwide.com/files/2025/05/shutterstock_2500325495-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe integration of Big Tech and the entertainment industry has taken another step, this time with news that \u003ca title=\"Companies \u0026gt; Google [993 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/google/\"\u003eGoogle\u003c/a\u003e has launched a film and TV production company.\u003c/p\u003e\u003cp\u003e\u003cem\u003eBusiness Insider\u003c/em\u003e \u003ca href=\"https://www.businessinsider.com/google-tv-movie-hollywood-boost-tech-image-hundred-zeros-2025-5\" target=\"_blank\" rel=\"noopener\"\u003ereported\u003c/a\u003e earlier this week that Google has quietly launched \u003cstrong\u003e100 Zeros\u003c/strong\u003e, a film and TV production initiative that won’t be producing content for \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; YouTube [2,016 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/youtube/\"\u003eYouTube\u003c/a\u003e\u003c/strong\u003e (a la YouTube Originals), instead offering it for sale to traditional studios and streaming services like \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Netflix [407 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/netflix/\"\u003eNetflix\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e(“100 Zeros” is a cryptic way of saying Google. A one with 100 zeros after it is a googol, the quantity for which Google was named).\u003c/p\u003e  \u003cp\u003eFor those in the music industry, one detail about 100 Zeros stands out: It’s part of a multi-year partnership with \u003cstrong\u003eRange Media Partners\u003c/strong\u003e, a management and production company known for its involvement in music.\u003c/p\u003e\u003cp\u003eAside from producing movies such as \u003cem\u003eA Complete Unknown\u003c/em\u003e, \u003cem\u003eThe Monkey\u003c/em\u003e and \u003cem\u003eLonglegs\u003c/em\u003e, Range Media also \u003ca href=\"https://www.musicbusinessworldwide.com/range-media-partners-forms-music-publishing-division-led-by-casey-robison/\" target=\"_blank\" rel=\"noopener\"\u003elaunched a music publishing division\u003c/a\u003e in 2023, which is proving to be a success.\u003c/p\u003e\u003cp\u003eRange-signed songwriter \u003cstrong\u003eSean Cook\u003c/strong\u003e recently scored the hit of a lifetime with \u003cstrong\u003eShaboozey\u003c/strong\u003e’s \u003cem\u003eA Bar Song (Tipsy)\u003c/em\u003e. Last year, Range Publishing \u003ca href=\"https://www.musicbusinessworldwide.com/range-music-publishing-inks-exclusive-global-admin-deal-with-universal-music-publishing/\" target=\"_blank\" rel=\"noopener\"\u003esigned a distribution deal\u003c/a\u003e with \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Universal Music Publishing Group [468 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/universal-music-group/universal-music-publishing-group/\"\u003eUniversal Music Publishing Group\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003ePer \u003cem\u003eBusiness Insider\u003c/em\u003e, a key aim for 100 Zeros is to promote a positive view of Google’s products, and tech in general, by shaping pop culture. \u003cem\u003eBI\u003c/em\u003e notes that, while Google’s Android is the global leader in mobile device operating systems, in the US it has lost pole position to \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Apple [1,335 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/apple/\"\u003eApple\u003c/a\u003e\u003c/strong\u003e. Google product placements in 100 Zeros-produced content could help address that.\u003c/p\u003e  \u003cp\u003eGoogle also sees an opportunity to sell filmmakers on its visual technologies, such as its Immersive View feature that enables users to see images in 3D, and, of course, AI-generated imagery.\u003c/p\u003e\u003cp\u003eMore broadly, Google is interested in shaping a positive view of tech, including AI, among the general public. To that end, Google and Range last month launched “\u003ca href=\"https://variety.com/2025/film/news/google-range-media-launch-ai-on-film-1236364839/\" target=\"_blank\" rel=\"noopener\"\u003eAI on Screen,\u003c/a\u003e” a program to commission short films about AI, with an eye to turning two of the short films into feature-length productions.\u003c/p\u003e\u003cp\u003eThe two companies say they have built a “comprehensive ecosystem that will empower filmmakers at a pivotal moment where AI’s role requires extensive discussion and diverse viewpoints.”\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e“We aim to collaborate with the Hollywood creative community in a thoughtful and productive way, upkeeping our ongoing commitment to responsibly support creative expression and explore the possibilities of technology through storytelling,” a Google spokesperson told the media.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGoogle\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eYet Google’s move into film and TV production – and therefore into being an entertainment IP rightsholder – is likely to raise concerns within the music industry.\u003c/p\u003e\u003cp\u003eTo be sure, this isn’t the first hint we’ve had that Big Tech is aiming its M\u0026amp;A dollars at the entertainment business. Witness, for instance, \u003ca title=\"Companies \u0026gt; Amazon [883 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/amazon/\"\u003eAmazon\u003c/a\u003e’s \u003ca href=\"https://www.forbes.com/sites/alisondurkee/2022/03/17/amazon-closes-85-billion-mgm-deal-adding-blockbusters-to-its-platform/\" target=\"_blank\" rel=\"noopener\"\u003eacquisition\u003c/a\u003e of \u003cstrong\u003eMGM Studios\u003c/strong\u003e in 2022, and the persistent rumors that have been \u003ca href=\"https://www.hollywoodreporter.com/business/business-news/disney-apple-deal-1235559416/\" target=\"_blank\" rel=\"noopener\"\u003ecirculating for years\u003c/a\u003e about a potential sale of \u003cstrong\u003eDisney\u003c/strong\u003e to \u003cstrong\u003eApple\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eYet Google moving into film and TV may ruffle music industry feathers more than those other tie-ups, for the reason that Google owns YouTube, a major streamer of music. If Google were to buy up a major music rights catalog – hardly a far-fetched idea, given its interest some years ago in \u003ca href=\"https://www.rollingstone.com/music/music-features/what-happens-if-google-buys-the-worlds-biggest-music-company-807891/\" target=\"_blank\" rel=\"noopener\"\u003ebuying the \u003cstrong\u003eMichael Jackson\u003c/strong\u003e estate’s \u003cstrong\u003e50%\u003c/strong\u003e share\u003c/a\u003e of music publisher \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Sony Music Publishing [889 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/sony/sony-music-group/sony-music-publishing/\"\u003eSony/ATV\u003c/a\u003e\u003c/strong\u003e – streaming royalty negotiations would take place between two divisions of the same company.\u003c/p\u003e\u003cp\u003eInevitably, that would result in a major advantage for YouTube against music streaming competitors, like \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Spotify [4,265 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/spotify/\"\u003eSpotify\u003c/a\u003e\u003c/strong\u003e, who don’t own the library they stream. (By the same token, that prospect could also draw the interest of competition regulators, who may be reluctant to greenlight a deal that gives YouTube such a significant advantage.)\u003c/p\u003e  \u003cp\u003eAlso significant for the music business is the fact that Google is a prominent AI developer and has even argued for a loosening of copyright laws to make AI development cheaper and simpler. In a recent submission to the UK parliament, \u003ca href=\"https://www.musicbusinessworldwide.com/for-google-and-openai-the-uks-proposed-loosening-of-copyright-laws-for-ai-isnt-enough-they-want-to-be-free-of-copyright/\" target=\"_blank\" rel=\"noopener\"\u003eGoogle argued\u003c/a\u003e that it shouldn’t have to pay for using copyrighted content to train AI.\u003c/p\u003e\u003cp\u003e“We believe training on the open web must be free,” Google declared.\u003c/p\u003e\u003cp\u003eThat places the tech giant on the opposite side from most of the music industry, and artists, in an ongoing debate about the use of copyrighted content in training AI.\u003c/p\u003e\u003cp\u003eGoogle seems to be aware of all these potential pitfalls of entering the entertainment space, with its public statements about 100 Zeros stressing keywords like “thoughtful” and “responsible.”\u003c/p\u003e\u003cp\u003e“Through our continued partnership with Range, we aim to collaborate with the Hollywood creative community in a thoughtful and productive way, upkeeping our ongoing commitment to responsibly support creative expression and explore the possibilities of technology through storytelling,” a Google spokesperson told the media.\u003c/p\u003e\u003cp\u003eNo doubt rightsholders throughout the entertainment space hope Google sticks to this ethos.\u003c/p\u003e\u003cp\u003eAnd for those who have their doubts, there is a positive scenario to consider here: Once Google owns entertainment IP, it will have a stake in maintaining that IP’s value.\u003c/p\u003e\u003cp\u003eSuddenly, the idea that copyrighted content should be “free” for tech companies to use may not seem quite as appealing.\u003cspan\u003eMusic Business Worldwide\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-07T18:57:58Z",
  "modifiedTime": "2025-05-07T20:03:08Z"
}
