{
  "id": "ec909030-4345-4a22-8d6f-2263acbd8ca5",
  "title": "Ben Folds on His Orchestral Album, Leaving the Kennedy Center, and the Mission to Keep Art Alive: Podcast",
  "link": "https://consequence.net/2025/07/ben-folds-orchestral-album-kennedy-center/",
  "description": "The singer-songwriter flipped Trump the bird with a 4th of July release. Ben Folds on His Orchestral Album, Leaving the Kennedy Center, and the Mission to Keep Art Alive: Podcast Kyle Meredith",
  "author": "Kyle Meredith",
  "published": "Mon, 14 Jul 2025 20:49:18 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "Consequence Podcast Network",
    "Kyle Meredith With... Podcast",
    "Alternative Rock",
    "Kennedy Center",
    "Pop",
    "Pop-Rock",
    "Singer-Songwriter"
  ],
  "byline": "Kyle Meredith",
  "length": 2062,
  "excerpt": "Ben Folds joins the Kyle Meredith With podcast to discuss his new live orchestral album, leaving the Kennedy Center, and keeping art alive.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Listen via: Apple Podcasts | Spotify | Amazon Podcasts | More Platforms Ben Folds recently sat down with Kyle Meredith to talk about the complicated year that saw him record a stunning live album with the National Symphony Orchestra just before stepping down as Artistic Advisor for the Kennedy Center. Folds opens up about the importance of the Kennedy Center’s mission, how it connects communities beyond the stage, and why that made his exit during the Trump administration’s takeover so necessary. Listen above or wherever you get your podcasts. Reflecting on the album, Folds calls it “an absolute honor” to record with the NSO, praising the room’s natural magic and the delicate work of mixer David Boucher. “David’s just next level,” Folds says. “It doesn’t sound like a live record until you hear the clapping — that’s how you know you got it right.” The album arrives like an act of resistance, beginning with “But Wait, There’s More,” which Folds says was born out of the absurdity of the Four Seasons Total Landscaping press conference. “It felt so cynical at first, but I do still believe there’s more good than not,” he adds. The conversation also dives deep into the vital role of public funding and arts institutions, and how Folds’ Kennedy Center series aimed to break down barriers and build trust between artists and audiences. “When you bring in people with something to say, the orchestra becomes part of telling that story,” he explains. “That mission — that trust — that’s what makes it special. When the mission’s broken, it all falls apart.” Folds remains hopeful that the simple act of gathering to experience art together is itself a form of resistance. “Maybe this wakes us up,” he says. “We’re all capable of anything — don’t do the bad stuff.” Listen to Ben Folds discuss Live with The National Symphony Orchestra and more above, or watch the interview below. Keep up on all the latest episodes by following Kyle Meredith With… on your favorite podcast platform; plus, check out all the series on the Consequence Podcast Network.",
  "image": "https://consequence.net/wp-content/uploads/2025/07/ben-folds-social.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1498673\" data-title=\"Ben Folds on His Orchestral Album, Leaving the Kennedy Center, and the Mission to Keep Art Alive: Podcast\" data-url=\"https://consequence.net/2025/07/ben-folds-orchestral-album-kennedy-center/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1498673\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Ben Folds on His Orchestral Album, Leaving the Kennedy Center, and the Mission to Keep Art Alive: Podcast\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\n\u003cp\u003e\u003cstrong\u003eListen via: \u003ca href=\"https://podcasts.apple.com/us/podcast/kyle-meredith-with/id1381546475?itsct=podcast_box\u0026amp;itscg=30200\u0026amp;ls=1\u0026amp;at=1001l36gv\" target=\"_blank\" rel=\"noopener noreferrer nofollow\"\u003eApple Podcasts\u003c/a\u003e | \u003ca href=\"https://open.spotify.com/show/4GiQLBlq0j0ZhZBwGL4bZI?si=P64n2TfPSWGUyRyM8EsUmg\" target=\"_blank\" rel=\"noopener noreferrer nofollow\"\u003eSpotify\u003c/a\u003e | \u003ca href=\"https://music.amazon.com/podcasts/200d8c03-cf26-4eb8-a99b-f833c7b2c740/kyle-meredith-with\" target=\"_blank\" rel=\"noopener nofollow\"\u003eAmazon Podcasts\u003c/a\u003e | \u003ca href=\"https://link.chtbl.com/KyleMeredithW\" target=\"_blank\" rel=\"noopener nofollow\"\u003eMore Platforms\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://consequence.net/artist/ben-folds/\" target=\"_blank\" rel=\"noopener\"\u003eBen Folds\u003c/a\u003e recently sat down with \u003ca href=\"https://consequence.net/category/kyle-meredith-with/\" target=\"_blank\" rel=\"noopener\"\u003eKyle Meredith\u003c/a\u003e to talk about the complicated year that saw him record a stunning live album with the National Symphony Orchestra just before stepping down as Artistic Advisor for the Kennedy Center. Folds opens up about the importance of the Kennedy Center’s mission, how it connects communities beyond the stage, and why that made his exit during the Trump administration’s takeover so necessary. Listen above or \u003ca href=\"https://link.chtbl.com/KyleMeredithW\" target=\"_blank\" rel=\"noopener nofollow\"\u003ewherever you get your podcasts\u003c/a\u003e.\n\t\u003c/p\u003e\n\n\n\u003cp\u003eReflecting on the album, Folds calls it “an absolute honor” to record with the NSO, praising the room’s natural magic and the delicate work of mixer David Boucher. “David’s just next level,” Folds says. “It doesn’t sound like a live record until you hear the clapping — that’s how you know you got it right.” The album arrives like an act of resistance, beginning with “But Wait, There’s More,” which Folds says was born out of the absurdity of the Four Seasons Total Landscaping press conference. “It felt so cynical at first, but I do still believe there’s more good than not,” he adds.\u003c/p\u003e\n\u003cp\u003eThe conversation also dives deep into the vital role of public funding and arts institutions, and how Folds’ Kennedy Center series aimed to break down barriers and build trust between artists and audiences. “When you bring in people with something to say, the orchestra becomes part of telling that story,” he explains. “That mission — that trust — that’s what makes it special. When the mission’s broken, it all falls apart.” Folds remains hopeful that the simple act of gathering to experience art together is itself a form of resistance. “Maybe this wakes us up,” he says. “We’re all capable of anything — don’t do the bad stuff.”\u003c/p\u003e\n\u003cp\u003eListen to Ben Folds discuss \u003cem\u003eLive with The National Symphony Orchestra\u003c/em\u003e and more above, or watch the interview below. Keep up on all the latest episodes by following \u003cem\u003eKyle Meredith With…\u003c/em\u003e \u003ca href=\"https://link.chtbl.com/KyleMeredithW\" target=\"_blank\" rel=\"noopener nofollow\"\u003eon your favorite podcast platform\u003c/a\u003e; plus, check out all the series on the \u003ca href=\"https://consequence.net/category/consequence-podcast-network/\" target=\"_blank\" rel=\"noopener\"\u003eConsequence Podcast Network\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Kyle Meredith with... Ben Folds\" width=\"100%\" height=\"240\" src=\"https://www.youtube.com/embed/n8zNDy6lCuE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-14T16:49:18-04:00",
  "modifiedTime": null
}
