[
  {
    "id": "f9d4ec49-ad2d-4c76-8967-49bd479c3cab",
    "title": "A winter’s trail: seasonal UK walks from Devon to Scotland",
    "link": "https://www.theguardian.com/travel/2024/dec/30/a-winters-trail-seasonal-uk-walks-from-devon-to-scotland",
    "description": "The stark landscapes of mid-winter are the best time for enjoying the elements on these routes. Our writers tell us the personal stories behind their favourite hikesYou can concertina this walk into a couple of hours, or else pack a lunch, take all day and let it breathe. Its centrepiece is Derwent Edge, a line in the sky running south to north, the preferred direction of travel, past a series of rocks and outcrops with down-to-earth names, like the Wheel Stones, the Salt Cellar and the Cakes of Bread, that don’t do justice to their sculptural mystery. Continue reading...",
    "author": "Guardian Staff",
    "published": "Mon, 30 Dec 2024 07:00:30 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Walking holidays",
      "United Kingdom holidays",
      "Walking",
      "Travel",
      "Life and style"
    ]
  },
  {
    "id": "24db1474-461b-49ae-941d-33fc27654638",
    "title": "Vive la différence: a long weekend in Strasbourg and Paris",
    "link": "https://www.theguardian.com/travel/2024/dec/29/strasbourg-paris-long-weekend",
    "description": "Two cities just a few hours distant, yet miles apart in terms of culture, crowds, and metropolitan swaggerWould you like to meet Arthur?” asked the well-groomed American tourist in the scalloped booth next to ours. We felt perplexed as the man seemed to be sitting on his own, but then we realised that perched on a soft cushion and gently lapping at a saucer of organic yoghurt, was an elderly poodle. “Arthur loves Strasbourg,” he explained. “This is his 16th visit!” The dog stared unblinkingly at us, his pink tongue licking a spot of white yoghurt from his black whiskers. “Really,” I said. “What does he like so much about the place?” The man looked at us with amazement: “Well, the breakfasts, of course!”I also like breakfasts – and the city of Strasbourg – but this is only my third visit. This time, my wife, Juliet, and I are here for the weekend as surprise guests at a close friend’s 60th birthday (somehow we managed to keep our visit a secret until the moment he and his French wife entered the tiny restaurant we were waiting in). Continue reading...",
    "author": "Martin Love",
    "published": "Sun, 29 Dec 2024 11:00:06 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Travel",
      "Life and style"
    ]
  },
  {
    "id": "d141e934-0e27-49ac-b40e-caa9a6a43bc3",
    "title": "Skiing Palisades Tahoe, California’s ‘Big, Powdery Playground’",
    "link": "https://www.nytimes.com/2024/12/30/travel/ski-california-palisades-tahoe.html",
    "description": "The resort in the Sierra Nevada, known for its challenging terrain, has cool, swagger and a long history. A first-timer is tested by its slopes and its weather.",
    "author": "Elisabeth Vincentelli",
    "published": "Mon, 30 Dec 2024 10:00:40 +0000",
    "image": "https://static01.nyt.com/images/2024/12/25/multimedia/00Palisades-Tahoe-mqkh/00Palisades-Tahoe-mqkh-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Snowboarding",
      "Travel and Vacations",
      "Weather",
      "Skiing",
      "Alpine Skiing",
      "Palisades Tahoe",
      "Sierra Nevada Region (US)",
      "California"
    ]
  },
  {
    "id": "d3ce40e7-cda6-462c-bd3a-4cc5724a204f",
    "title": "How to Pick the Right Safari Trip",
    "link": "https://www.nytimes.com/2024/12/27/travel/safari-tour-vacation.html",
    "description": "Choosing an operator that is conservation-minded, with ties to the local community and well-trained guides can add up to the trip of a lifetime and also nurture nature.",
    "author": "Costas Christ",
    "published": "Fri, 27 Dec 2024 10:00:19 +0000",
    "image": "https://static01.nyt.com/images/2024/12/02/multimedia/00Safari-guide-qfmp/00Safari-guide-qfmp-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Safaris",
      "Travel and Vacations",
      "Ethics and Official Misconduct",
      "African Wildlife Foundation",
      "Africa",
      "Content Type: Service"
    ]
  },
  {
    "id": "68548d8a-e039-4069-a0e6-be9315325492",
    "title": "Our Favorite New Places of 2024",
    "link": "https://www.atlasobscura.com/articles/favorite-new-places-2024",
    "description": "Between asteroid strikes and new species of anaconda, rapidly expanding craters in Siberia and rivers turning orange in Alaska, something about the world and how we understand it is always changing. One of the things that we can count on though, is Atlas Obscura’s community of contributors sharing the stories behind the wondrous, awe-inspiring, and strange places they have encountered. In 2024, we added nearly 2,000 entries to our database of extraordinary places from all over the world. The task of picking favorites from that list is a daunting one, but our editors looked through everything we published this past year and selected 24 of the most fascinating places to cross our desks. Some of those places are brand new to the world, while others are historic, shaped by people from generations past or by nature itself. (And at least one commemorates something that hasn't even happened yet.) The list includes a retirement home for concrete playground animals, a lake in China that may very well be home to a four-ton trout, and a set of basketball courts hidden in the walls of Dubrovnik. There’s a lot more still out there waiting to be discovered—we can’t wait to see what next year holds. Fujimori Tea Houses Chino, Japan Standing in the mountains of central Japan are a collection of structures that look like they came straight out of a fairy tale. A small plaster cabin perched atop two chestnut trees and a round walnut-like structure suspended in midair are just a few of the eccentric teahouses designed by the acclaimed Japanese architect Terunobu Fujimori. 91.9 FM Pirate Radio Station Montclair, New Jersey Looking for a unique listening experience? Look no further than Montclair's very own pirate radio station. For the past 15 years, if you've had your radio tuned to 91.9 FM while traveling on Valley Road between Bellevue and Lorraine Avenues, you’d hear the exact same thing: a one-minute snippet of \"I'll Make Love to You\" by Boyz II Men, on loop. What started as an accidental broadcast is now a beloved local tradition. James Bond's Grave Kalsoy, Faroe Islands A lonely cliffside on the northern end of the Faroe Islands is home to a gravestone marking the spot where a legendary spy met his end. Since Ian Fleming’s first James Bond novel was published in 1953, the debonair secret agent has cheated death in nearly every way imaginable. But in 2021's No Time to Die, something unprecedented happened: Bond died. This historic moment in cinema was filmed in the Faroe Islands, and locals decided to commemorate it by erecting a tombstone at the spot where 007 stood and accepted his fate. Hargeysa Cultural Center's Tape Wall Hargeisa, Somalia Much of Somali history has been preserved through stories, songs, and poems that have never been written down. When a civil war broke out in the late 1980s, that cultural heritage was nearly lost. But it was preserved, thanks to cassette tapes. In the period before the government's collapse, cassette tapes became popular in Somalia, with people recording songs, poems, plays, and messages to loved ones. Tens of thousands of those tapes are now preserved in an archive at the Hargeysa Cultural Center. A portion of the collection is displayed on a wall filled with cassette tapes, each one a testament to the preservation of a long tradition of oral history. Pyramides d'Euseigne Hérémence, Switzerland The small village of Euseigne sits in one of the southern side valleys near Switzerland's Rhône valley. It’s home to a set of tall, thin spires that date back to the last ice age, when glaciers were moving across the European continent. As the ice retreated, it left behind rocks and dirt and soil, which eventually turned into these striking spindly geological formations, each one standing between 30 to 50 feet tall (10–15 meters). Main Gate Park Los Alamos, New Mexico Los Alamos, New Mexico, is a town that knows how to keep its secrets. Once a sleepy homestead and ranch school, today Los Alamos is famous for a top-secret compound that housed the scientists and military figures who worked on the Manhattan Project. Through the war years, the only link between Los Alamos and the outside world was through the security gate, a replica of which stands today in Los Alamos Project Main Gate Park. Home for Retired Playground Animals Queens, New York During his tenure as New York City Parks Commissioner, Henry Stern had a rule: every playground must include an animal sculpture. Hundreds of concrete creatures were put in place in the 80s and 90s, and they became beloved fixtures of local parks. But after decades of delighting New York City residents, the sculptures were starting to show their age. In 2023, the Parks Department unveiled the Home for Retired Playground Animals in a shady corner of Flushing Meadows Corona Park. Some of the first animals put out to pasture here included an aardvark, a camel, a frog, an elephant, and a pair of mismatched dolphins. Pink Muhly Grass Gyeongju, South Korea When fall arrives in South Korea, it brings with it not just fiery reds and russets on tree leaves, but also carpets of an unusual pink grass known as muhly. The delicate flowers of this hardy plant bloom in fluffy clumps when the weather begins to cool, giving the grass its famed pink (and occasionally, purple) hue. Though the grass is actually native to the United States, it is now carefully cultivated across South Korea from public parks to private farmlands. Billy Bob’s Wonderland Barboursville, West Virginia In the 1980s, the animatronic band known as Rock-afire performed in hundreds of locations across America. They were housed in the now-defunct ShowBiz Pizza Place, which has a long, contentious history with the biggest name in animatronic pizza restaurants: Chuck E. Cheese. Now, a West Virginia arcade is one of the last places in the country where you can see a public performance by the Rock-afire Explosion. 'What Is It?’ Takia, Oman The National Museum of Oman houses more than 5,000 items encompassing the country's history, from prehistory to the present day. Among the arrowheads, fishing hooks, and jewelry is one solitary cabinet with an intriguing caption that reads simply, \"What is it?\" This small copper statuette was found in a village in northern Oman. Is it meant to depict an eagle? An angel? A bird-man hybrid? As the museum caption indicates, the answer is a mystery. Sul Ross Desk Alpine, Texas More than 40 years ago, three students at Sul Ross State University decided they needed a spot away from campus to study. So, naturally, they carted a desk up to the top of a hill just north of campus. One left a notebook in the desk drawer and later discovered that someone outside their study group had left a message inside. That was the start of a tradition that now spans four decades. Though the original desk has now been swapped out several times, there’s always been a notebook in the drawer where visitors can leave their marks. Kaman-utek Blue Soil Bontoc, Philippines Also known as the Blue Soil Hills, Kaman-utek is an expanse of blue-green mounds. The unique hue comes from an abundance of copper sulfate in the soil, as copper develops a patina when it is exposed to oxygen and weathering. (The same process is responsible for the Statue of Liberty’s distinctive color.) The copper also reacts to rain and humidity, which means the exact shade of the blue soil can change from day to day. Belly of the Dragon Orderville, Utah Hidden beneath the red rock expanse of Utah lies a tunnel about 100 yards long. The walls have an undulating texture reminiscent of the intricate contours of a digestive tract. The Belly of the Dragon is not a naturally occurring cave system—it was originally dug as a drainage tunnel to allow rainwater to pass underneath the highway above. Over the years, periodic flooding has shaped the tunnel, creating the rippling effect you see today. Majapahit Piggy Bank Oxford, England The history of piggy banks goes back a lot further than you might guess. The earliest piggy banks known were made on the island of Java in the 12th century. Known as cèlèngan, these earthenware piggy banks were common in the Malay world during the Majapahit period, but few of them have survived to the modern day. After all, piggy banks were made to be broken open. One of the places where you can find an intact Majapahit piggy bank is Oxford’s Ashmolean Museum, a centuries-old institution known for its huge collection of antiquities. Ōnawe Peninsula Duvauchelle, New Zealand Three kilometers of land juts into the Akaroa Harbor on the Banks Peninsula. Known as the Ōnawe Peninsula, and it can only be reached at low tide. At high tide, water cuts the peninsula off from the rest of the land and turns it into two islands, shaped like an exclamation point. Ancient Melancholy Man London, England One of the oldest (and saddest) statues in London can be found in Holland Park. Nobody is sure precisely when this limestone statue of a bearded man with a dour expression was created, or who it’s meant to depict, but it’s believed to date back to the 16th century. The Inventor of Time Travel Plaque Leuven, Belgium It’s rare to see a commemorative plaque for an event that hasn’t happened yet, but that’s precisely what you’ll find above the door of a small house near Katholieke Universiteit Leuven. The circular blue plaque claims that John E. Lewis, \"inventor of time travel,\" lived—or will live—in this very house in 2152. Whether there’s any truth to the claim, we'll have to wait 128 years to find out. Kanas Lake Altay Prefecture, China This narrow, crescent-shaped glacial lake in far northwestern China is beautiful, with turquoise waters and a lush surrounding landscape. It may also be home to a monstrous fish. Local legends tell of a massive fish of up to four tons trapped in ice or swimming in the waters of Kanas Lake. Some have speculated that the gargantuan creature is a species of trout, but a specimen has yet to be captured. Bird Calls Phone Takoma Park, Maryland This pay phone is for the birds—literally. In 2016, a local audio producer rewired the old phone to play the sounds of local bird calls at the push of a button. Pick up the bright yellow receiver, and instead of a dial tone, you'll hear the sound of a mourning dove. Each number corresponds with a different local bird, from a yellow-crowned night heron to a red-tailed hawk to a rooster (an homage to Roscoe the Rooster, who roamed Takoma Park in the 1990s). Santa Oslo, Norway Since 2018, an Oslo traffic circle has been home to a provocative, year-round celebration of Christmas—or rather, XXXmas. At its center stands a 20-foot-tall (6-meter) red bronze sculpture of Santa Claus holding a stylized Christmas tree that has earned nicknames like the \"Dildo Gnome\" and \"Santa with Butt Plug.\" Ilulissat Icefjord Center Ilulissat, Greenland Sermeq Kujalleq is one of the fastest and most active glaciers on the planet. After a journey from deep within Greenland's icecap, large icebergs break off from the glacier in a fjord near the village of Ilulissat. At the Ilulissat Icefjord Center, you can learn about the formation of icebergs and the significance of Sermermiut, an archaeological site that proves Inuit have been passing through this region for thousands of years. Underwater 'Waterfall' Le Morne, Mauritius About 700 miles east of Madagascar, the island nation of Mauritius sits on a submarine plateau in the Indian Ocean. Formed by volcanic activity some 8 million years ago, the island is the second-largest of the Mascarene Islands. Along the island’s southwestern coast, the shallow coral reefs appear to give way to an enormous underwater waterfall plunging into the dark blue depths of the ocean. But while the coastal shelf does indeed drop off to a depth of 4,000 meters, this underwater marvel is an optical illusion—sand moving over the shelf creates a streaming effect that looks like water rushing over a cliff’s edge. Old Town Walls Basketball Courts Dubrovnik, Croatia You’d be surprised by the places you can hide a basketball court, from above the United States Supreme Court to inside the centuries-old fortifications that surround the city of Dubrovnik. The limited space and shape of the grounds made a rectangular full court unfeasible, so these are set up for 3x3 basketball, which only needs a half-court. Chicago Rat Hole Chicago, Illinois Normally a place that you can no longer visit wouldn’t appear on one of these lists, but we’re making one exception. This accidental lifecast in a Chicago sidewalk was the subject of a viral tweet in January 2024. In the weeks that followed, it garnered crowds of admirers, many of whom left offerings nearby. The hole was the source of controversy, and subject to at least one vigilante attempt to fill it in before the city removed the sidewalk panel entirely. While the infamous rodent-shaped imprint may no longer adorn this sidewalk, it will live on in our hearts.",
    "author": "Atlas Obscura",
    "published": "Mon, 30 Dec 2024 19:34:00 -0500",
    "image": "https://assets.atlasobscura.com/article_images/104308/image.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": null
  },
  {
    "id": "8b7c78b5-9b0b-46c0-b313-37bb59b3ae49",
    "title": "Mountain Pass Mine in Mountain Pass, California",
    "link": "https://www.atlasobscura.com/places/mountain-pass-mine",
    "description": "Rare earth elements, a series of chemically very similar elements, have been much in the news in recent years because they are critical in many high-tech applications. This deposit at Mountain Pass, California, was discovered in the late 1940s and supplied much of the global demand for decades. However, the uses of rare earths were not nearly as extensive as they are now, and as applications grew so did competition, mostly from China. Meanwhile, production costs at Mountain Pass also soared. By 2002 the mine had shut down. The deposit at Mountain Pass is in an \"igneous limestone,\" a so-called carbonatite (pronounced \"car-BON-uh-tite\"). Carbonate minerals are nearly always found in sedimentary rocks like limestone, and they have either directly precipitated from water, or via living things from water, with the biological debris then incorporated into the limestone. A carbonatite, by contrast, was originally magma and cooled from the molten state. Carbonatite deposits are relatively uncommon, and they often include high concentrations of rare earth elements. Right now, China accounts for the majority of the world's rare earth mining and processing facilities. Because of national defense concerns about dependence on a foreign supplier, efforts to reopen the Mountain Pass Mine began in the 2010s. After several false starts, the mine seems to be operating routinely. The efforts are an echo of the \"strategic minerals programs\" that lasted into the 1960s, where the U.S. government subsidized the production of materials deemed vital to national security. One side note is that the Mountain Pass carbonatite is slightly radioactive due to the presence of thorium, a naturally occurring radioactive element. In fact, this is what originally led to the discovery of the deposit in 1949, when prospecting for uranium with a Geiger counter had become the mid-20th century equivalent of panning for gold. The slight radioactivity also complicates the safe extraction of the rare earth elements, because waste products tend to be radioactive and require special handling.",
    "author": "",
    "published": "Mon, 30 Dec 2024 12:00:00 -0500",
    "image": "https://img.atlasobscura.com/ytGGRr9RTvw1NtXWZXr03dZTUuKZjM25dir3y8lP38E/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy83NjRj/MmIzMC00MzUzLTRh/YzYtYmY4My04MzQw/ODcxNjZlZjQzZmI2/ODIyNmIyZWJhNGJl/ODZfTW91bnRhaW5f/UGFzc19SYXJlX0Vh/cnRoX01pbmVfJl9Q/cm9jZXNzaW5nX0Zh/Y2lsaXR5LmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "radioactive",
      "minerals",
      "mining",
      "mines"
    ]
  },
  {
    "id": "00962ce9-2957-4e8b-9ccc-f5d409f0d2e6",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "38bec07f-aff0-4aa7-a920-16c65c47a3a1",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "d0302cb2-24bd-408c-bdb1-1759121d6d5e",
    "title": "The Best Website for House Swaps? My HomeExchange Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/homeexchange-review/",
    "description": "Accommodation will always be one of your biggest travel expenses…but what if it wasn’t? What if you could reduce the cost of your accommodation to zero while still enjoying the comforts of home? That’s what house swaps promise. House swaps have been around for decades. It was the entire premise of the movie The Holiday... The post The Best Website for House Swaps? My HomeExchange Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 23 Dec 2024 13:57:38 +0000",
    "image": "https://media.nomadicmatt.com/2024/homexchange.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Tips",
      "accommodation",
      "Get Cheap Accommodation",
      "homeexchange"
    ]
  },
  {
    "id": "7f7024fa-0650-4fc7-8c36-3f5df4e9a1ef",
    "title": "The Best eSIMs for Travelers",
    "link": "https://www.nomadicmatt.com/travel-blogs/best-esims-for-travelers/",
    "description": "Having reliable mobile data when you travel is a must these days. It’s helpful not only for finding things to do or the right bus route, but communicating in an emergency and locating your accommodation if you get lost. While I think a lot of travelers spend too much time on their phone, the fact... The post The Best eSIMs for Travelers appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Fri, 01 Nov 2024 13:30:09 +0000",
    "image": "https://media.nomadicmatt.com/2024/bestesimtravelers.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "esims",
      "travel gear"
    ]
  }
]
