[
  {
    "id": "155d4370-bb8f-4717-9675-fb10b8112753",
    "title": "Vive la différence: a long weekend in Strasbourg and Paris",
    "link": "https://www.theguardian.com/travel/2024/dec/29/strasbourg-paris-long-weekend",
    "description": "Two cities just a few hours distant, yet miles apart in terms of culture, crowds, and metropolitan swaggerWould you like to meet Arthur?” asked the well-groomed American tourist in the scalloped booth next to ours. We felt perplexed as the man seemed to be sitting on his own, but then we realised that perched on a soft cushion and gently lapping at a saucer of organic yoghurt, was an elderly poodle. “Arthur loves Strasbourg,” he explained. “This is his 16th visit!” The dog stared unblinkingly at us, his pink tongue licking a spot of white yoghurt from his black whiskers. “Really,” I said. “What does he like so much about the place?” The man looked at us with amazement: “Well, the breakfasts, of course!”I also like breakfasts – and the city of Strasbourg – but this is only my third visit. This time, my wife, Juliet, and I are here for the weekend as surprise guests at a close friend’s 60th birthday (somehow we managed to keep our visit a secret until the moment he and his French wife entered the tiny restaurant we were waiting in). Continue reading...",
    "author": "Martin Love",
    "published": "Sun, 29 Dec 2024 11:00:06 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Travel",
      "Life and style"
    ]
  },
  {
    "id": "a05926d3-9d52-4a84-93d1-74615cb2b569",
    "title": "The gentle magic of walking in Somerset’s Mendip Hills",
    "link": "https://www.theguardian.com/travel/2024/dec/28/somerset-mendip-hills-walking",
    "description": "John Harris and family revisit the first serious hill-walk they made in a landscape that’s more comforting than challenging – just what they’re looking for at this time of yearI moved to Somerset in 2009, from a home in Wales between Bannau Brycheiniog (the Brecon Beacons) and the Black Mountains. The change took me closer to London and rid me of painfully long train journeys, but I really missed the landscape – and, more specifically, walking around it. The little I knew about my new home county was mostly centred on two attractions: the Glastonbury festival and Cheddar Gorge – that deep topographical crack that draws thousands of tourists to caves, overpriced cheese and the kind of shops and cafes that make it feel like a mid-level English coastal resort, without any sea. It didn’t seem to offer much of a substitute.What I didn’t know about was the other 70-odd square miles of the Mendip Hills, all craggy outcrops, dry-stone walls, waterfalls and dizzyingly beautiful views. After I moved, the weekly walks I eventually started doing with my two kids took us to this part of Somerset again and again. And they still do, not least in the winter. The scenery is, of course, not nearly as spectacular as the landscape I’d left behind, but replete with its own charms: faint echoes of the Lakes and Yorkshire Dales, and walks that perfectly suit the cold months. Here, a proper outing can be done without being overly arduous, and if the weather doesn’t turn too hostile, a day outside can deliver a lovely cosiness: the landscape is friendly and comforting, rather than challenging. Continue reading...",
    "author": "John Harris",
    "published": "Sat, 28 Dec 2024 07:00:32 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Somerset holidays",
      "Walking holidays",
      "Day trips",
      "England holidays",
      "Travel"
    ]
  },
  {
    "id": "88fe1e83-2c0c-4518-96c1-6bb572a7fb1e",
    "title": "Brooklyn Seltzer Museum in Brooklyn, New York",
    "link": "https://www.atlasobscura.com/places/brooklyn-seltzer-museum",
    "description": "Tucked into an industrial area of Cypress Hills, Brooklyn, is this gem of a museum offers a glimpse into the history of New York told through one of its favorite drinks.  The museum is located inside the Brooklyn Seltzer Boys Factory, and is a labor of love for Alex Gomberg. The Gomberg family has been in the fizzy water business since 1953, when the original Gomberg Seltzer Works factory opened in Canarsie.  Around the turn of the 20th century, there were hundreds of “seltzer men” lugging 60-pound cases of glass bottles around the streets of Manhattan's Lower East Side. Many of these early entrepreneurs were Eastern European Jewish immigrants, who also sold their wares in soda fountains. Today, carbonated water is a multibillion-dollar business in the United States, but the old-school, small-scale production methods are increasingly rare. After his family factory shuttered during the COVID-19 pandemic, Gomberg reopened in a new location, complete with this appointment-only museum, to keep the traditions alive. As you go around the museum and factory, you get to see how the seltzer water is triple-filtered through sand, charcoal, and paper before being put into original glass seltzer bottles. Conventional plastic bottles are too flimsy to contain the powerful levels of carbonation here. To this day, the Gomberg family relies exclusively on glass bottles handblown in Europe. They're practically impossible to replace, so the staff are constantly repairing the ones they have and searching for more. At the heart of the factory lies a century-old carbonator, an ancient mechanical beast that would look right at home in Jules Verne's extended universe. Only Kenny Gomberg, Alex's father, knows how to repair the machine—a process that grows ever more challenging, since no one manufactures the appropriate parts anymore.  Tours here are especially interactive, peppered with historical anecdotes dating back to ancient times. There is a scavenger hunt, games, and a chance to recreate old vaudeville gags by blasting your fellow visitors with pressurized water at the spritzing station. As a treat, visitors can try an egg cream, a New York soda fountain classic that's increasingly hard to find. Made with seltzer, milk, and chocolate syrup, it's a lighter, effervescent cousin of a milk shake. If you cannot get yourself to Brooklyn, they'll also ship you an egg cream kit to bring a little bit of Brooklyn to you. To get on the regular seltzer delivery list you need to go through an interview process—with bottles in high demand you have to earn your spot.",
    "author": "",
    "published": "Fri, 27 Dec 2024 16:00:00 -0500",
    "image": "https://img.atlasobscura.com/-ZpTsVzh_NrpR2N1jznlT50IkzhbRQQODi5kLDnqrYw/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9hYjRl/ODc3Yy01ODBjLTQ3/MmUtODgwMC0xN2I3/NjI3ZjllMmViNTY5/YjQ2OGM0ODA4ZTI1/YzBfSU1HMjAyNDA5/MjAxMzE2MTEuanBn.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "food museums",
      "factories",
      "jewish",
      "museums and collections",
      "museums"
    ]
  },
  {
    "id": "73951716-91d0-4bcc-84ef-14ae86ae0c80",
    "title": "Grandfather and Grandmother Rocks (Hin Ta Hin Yai) in Tambon Maret, Thailand",
    "link": "https://www.atlasobscura.com/places/grandfather-and-grandmother-rocks-hin-ta-hin-yai",
    "description": "A popular tourist attraction consisting of rocks shaped like male and female genitals surrounded by coconut toffee vendors.",
    "author": "",
    "published": "Fri, 27 Dec 2024 16:00:00 -0500",
    "image": "https://img.atlasobscura.com/YizJTjGWVPfzYTqxcjXF8YtYGIrn-BE8jjumzR8XcEs/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS9h/cHBfdXBsb2Fkcy9w/bGFjZV9pbWFnZXMv/dXNlcl8xMTY4NDRf/MzM1YTQ1YzItY2Q5/Ny00YTA3LWIxYmMt/YWNhNzc0ZmQzNDc1.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "rocks",
      "rock formations"
    ]
  },
  {
    "id": "a6f78fb4-6959-4059-bdb3-2516bf805891",
    "title": "How to Pick the Right Safari Trip",
    "link": "https://www.nytimes.com/2024/12/27/travel/safari-tour-vacation.html",
    "description": "Choosing an operator that is conservation-minded, with ties to the local community and well-trained guides can add up to the trip of a lifetime and also nurture nature.",
    "author": "Costas Christ",
    "published": "Fri, 27 Dec 2024 10:00:19 +0000",
    "image": "https://static01.nyt.com/images/2024/12/02/multimedia/00Safari-guide-qfmp/00Safari-guide-qfmp-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Safaris",
      "Travel and Vacations",
      "Ethics and Official Misconduct",
      "African Wildlife Foundation",
      "Africa",
      "Content Type: Service"
    ]
  },
  {
    "id": "4450fef2-e33a-4856-8007-799906a92b47",
    "title": "The Writer of the Netflix Hit ‘Carry-On’ Talks About the ‘Trolley Problem’ and the T. S.A.",
    "link": "https://www.nytimes.com/2024/12/25/travel/carry-on-netflix-movie-thriller.html",
    "description": "T.J. Fixman on what makes an exciting Christmas thriller, his own interactions with airport security and what you shouldn’t leave in your luggage.",
    "author": "Christine Chung",
    "published": "Fri, 27 Dec 2024 18:27:39 +0000",
    "image": "",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Airport Security",
      "Terrorism",
      "Airlines and Airplanes",
      "Writing and Writers",
      "Christmas",
      "Movies",
      "Airports",
      "Transportation Security Administration",
      "Egerton, Taron (1989- )",
      "Bateman, Jason",
      "Carry-On (Movie)",
      "Fixman, TJ",
      "Content Type: Personal Profile"
    ]
  },
  {
    "id": "ab99103a-6786-44e8-91dd-c40755792434",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "895fc2f4-6c2a-4640-bf62-15a21826fd3a",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "5e1b8d1e-d5bc-4f07-9165-bfef0e9b403e",
    "title": "The Best Website for House Swaps? My HomeExchange Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/homeexchange-review/",
    "description": "Accommodation will always be one of your biggest travel expenses…but what if it wasn’t? What if you could reduce the cost of your accommodation to zero while still enjoying the comforts of home? That’s what house swaps promise. House swaps have been around for decades. It was the entire premise of the movie The Holiday... The post The Best Website for House Swaps? My HomeExchange Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 23 Dec 2024 13:57:38 +0000",
    "image": "https://media.nomadicmatt.com/2024/homexchange.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Tips",
      "accommodation",
      "Get Cheap Accommodation",
      "homeexchange"
    ]
  },
  {
    "id": "bd89b930-35b0-4d10-bd45-78010a10e226",
    "title": "The Best eSIMs for Travelers",
    "link": "https://www.nomadicmatt.com/travel-blogs/best-esims-for-travelers/",
    "description": "Having reliable mobile data when you travel is a must these days. It’s helpful not only for finding things to do or the right bus route, but communicating in an emergency and locating your accommodation if you get lost. While I think a lot of travelers spend too much time on their phone, the fact... The post The Best eSIMs for Travelers appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Fri, 01 Nov 2024 13:30:09 +0000",
    "image": "https://media.nomadicmatt.com/2024/bestesimtravelers.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "esims",
      "travel gear"
    ]
  }
]
