[
  {
    "id": "8af73117-af21-4c9f-93b1-b9ac461bb15f",
    "title": "‘A delightful slice of unhurried life’: readers’ favourite European islands",
    "link": "https://www.theguardian.com/travel/2025/jul/25/a-delightful-slice-of-unhurried-life-readers-favourite-european-islands",
    "description": "Lesser-known isles, from a quieter alternative to Capri, to a gem in the heart of Helsinki and the smallest of Ireland’s Aran Islands• Tell us about your favourite coastal break in northern Europe – the best tip wins a £200 holiday voucherProcida, in the Bay of Naples, is not as famous as nearby Capri and Ischia, but is all the more appealing for it. Not a tourist trap but an island where people actually live, it’s a delightful slice of unhurried Italian life. The island is small enough to be explored on foot or by bicycle, though there is a bus service too. There are many pretty little beaches for swimming, sunbathing and picnicking – our favourite was Il Postino, where scenes from the movie of the same name were filmed. As people still fish for a living, there’s no shortage of wonderfully fresh seafood in the restaurants. A local delicacy is lemon salad, made from the enormous, thick-skinned lemons unique to Procida. Villa Caterina B\u0026B’s orchard of lemon and orange trees provides fresh juice and marmalade for breakfast, and the rooms have wonderful views of the island and the bay, with Vesuvius looming in the distance and Naples only 45 minutes away by ferry. Bernie G Continue reading...",
    "author": "Guardian readers",
    "published": "Fri, 25 Jul 2025 06:00:51 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Europe holidays",
      "Beach holidays",
      "Walking holidays",
      "Travel"
    ]
  },
  {
    "id": "806a9b27-d853-40cc-ad28-77f7745da62d",
    "title": "Crest of a new wave: Cleethorpes is all set for a seaside revival",
    "link": "https://www.theguardian.com/travel/2025/jul/24/cleethorpes-seaside-revival",
    "description": "The resort is extending its bucket-and-spade appeal to a new generation with a raft of investment, a series of new festivals and some original offerings on the food and accommodation frontCleethorpes Pier, circled by the local gull squad, looks at its picture-postcard best. Ahead of the lunch crowd making for Papa’s Fish \u0026 Chips restaurant, I’m taking a seat in the pier’s ballroom to hear seaside historian Kathryn Ferry talk about her latest book, Twentieth Century Seaside Architecture.Ordering a pot of tea, I’m taken back to my student days. Back in the late 1990s, the ballroom hosted Pier 39, a sticky-floored nightclub where getting your heels wedged in the planks after too many vodkas was considered par for the course. Following a shift waitressing at a nearby fish restaurant, our girl gang would douse our hair in Charlie Red body spray to mask the fug of haddock before dancing the night away where the Humber estuary meets the North Sea. Continue reading...",
    "author": "Jessica Johnson",
    "published": "Thu, 24 Jul 2025 06:00:01 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "United Kingdom holidays",
      "England holidays",
      "Beach holidays",
      "Short breaks",
      "Travel",
      "Family holidays"
    ]
  },
  {
    "id": "f2fef3e4-b4e4-4305-875d-fbcd1ac06d58",
    "title": "Tracee Ellis Ross on the Joy and Loneliness of Solo Travel",
    "link": "https://www.nytimes.com/2025/07/25/travel/tracee-ellis-ross-solo-travel-roku.html",
    "description": "The star actress sat down with us to discuss her new travel show: “There’s got to be something between cat ladies and Joan of Arc. You know what I mean?”",
    "author": "Nia Decaille",
    "published": "Fri, 25 Jul 2025 09:00:48 +0000",
    "image": "https://static01.nyt.com/images/2025/07/25/multimedia/25trav-tracee-ellis-ross1-gjzv/25trav-tracee-ellis-ross1-gjzv-mediumSquareAt3X-v2.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Black People",
      "Television",
      "Single Persons",
      "Travel and Vacations",
      "Loneliness",
      "Fashion and Apparel",
      "Women and Girls",
      "Roku",
      "Ross, Tracee Ellis"
    ]
  },
  {
    "id": "814c8443-a5db-4601-b972-64f88cd32baf",
    "title": "Southwest Passenger Says She Was Ejected From Flight Based on Her Race",
    "link": "https://www.nytimes.com/2025/07/24/travel/southwest-airlines-lawsuit-racism.html",
    "description": "On a flight from Chicago to Washington, D.C., last November, the passenger said she was the only Black person seated in an exit row when she was asked to leave.",
    "author": "Claire Fahy",
    "published": "Thu, 24 Jul 2025 14:01:13 +0000",
    "image": "https://static01.nyt.com/images/2025/07/24/multimedia/24trav-southwest-lawsuit-fjmz/24trav-southwest-lawsuit-fjmz-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Southwest Airlines Company",
      "Black People",
      "Discrimination",
      "Suits and Litigation (Civil)",
      "Airlines and Airplanes",
      "Race and Ethnicity",
      "Flight Attendants"
    ]
  },
  {
    "id": "e6b4b8c9-9110-40db-b9c4-3ecdccc8eda2",
    "title": "Gadaladeniya Viharaya in Embilmeegame, Sri Lanka",
    "link": "https://www.atlasobscura.com/places/gadaladeniya-viharaya",
    "description": "An inscription on the rock outcrop it rests on indicates that Gadaladeniya Viharaya (aka Gadaladeniya Rajamaha Viharaya) was built in 1344. As for many temples of this era, it is possible that an even older temple used to be in place, but this is all but impossible to ascertain. What is certain is that at that time Sri Lanka was not a unified entity yet. In fact, the island was fragmented into several kingdoms, and this temple was part of the Kingdom of Gampola, which was based in the homonymous city located about 10 km (about 6 miles) from the temple. The ruler, King Buvanekabahu IV, commissioned the construction of this temple, calling on a South Indian architect by the name of Ganesvarachari.  This explains the blend of Sinhalese and Dravidian architectural features. The main temple is made of carved granite, with the exception of chamber where the main statue of the Buddha is located, which made of bricks.  The large statue of the Buddha is also made of bricks and mortar, but covered with lime and sand, and eventually painted gold. Across a natural pond formed in a dip of the rock is the secondary shrine. Built a few years after the main temple, it consists of a central stupa with four smaller stupas attached to it. Each one of these smaller stupas is home to a statue of the Four Heavenly Kings. Charming as the complex may be, the distinction between Sinhalese and Dravidian elements is not obvious to the untrained eye. A signature trait of South Indian architecture is the stepped pyramidal roof, which is often adorned with a myriad of religious figures. This would be a conspicuous omission at Gadaladeniya Viharaya, but in reality, it still exists, albeit hidden under the Sinhalese-style roof that nowadays covers the temple. Visible evidence of Dravidian design can be found in the alternating octagonal and square cross-sections design of the pillars in the vestibule; furthermore, these pillars are adorned with carvings of deities like Nataraja and Krishna, which clearly suggest South Indian influences. As for Singhalese architectural influences, beside the already mentioned roof of the temple, there is a stupa, a moonstone at the entrance, and the three-sided twin pillars in the hall, all of which point at local sensibilities.      On the northeastern side of the temple are some stone-cut steps leading down to one of the gates onto a side road.  On the left of these steps, a section of the rock is fenced off. Ancient inscriptions are carved into the surface of this protected area. They are in Singhalese, except the first line, which is in Sanskrit.  It is here that the date of construction of the temple is recorded.",
    "author": "",
    "published": "Fri, 25 Jul 2025 17:00:00 -0400",
    "image": "https://img.atlasobscura.com/671dASBZfwZggtazOZ2cImd9xLJmExuTs8C--8IS3ys/rs:fill:300:200:1/g:ce/c:3179:2119:nowe:1006:786/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9iMWZj/ZTc4MC04ZTkxLTQz/NWEtYTk0ZS0zY2Zi/OGRkYmFlNjJlY2M3/N2Y1YTI5ODI1YTJl/ZjlfU3JpIExhbmth/ICg3NCkuSlBH.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "temples",
      "buddhism"
    ]
  },
  {
    "id": "0859b21b-fb5d-4fc3-9411-1ab94fceb27d",
    "title": "McClellan Falls in Northwoods, Washington",
    "link": "https://www.atlasobscura.com/places/mcclellan-falls",
    "description": "McClellan Viewpoint is a favorite stop for travelers in southern Washington State. It offers a commanding view of the famous Mount Saint Helens and its surrounding forests. Most travelers would continue their journey after taking in this vista and perhaps reading the interpretive signs. However, McClellan hides another natural wonder, just a short distance off the main highway. Across the road, unmarked by any sign, is a quarter mile primitive footpath that goes 200 vertical feet down into the canyon. Climbing down this path will require careful navigation and crossing several downed trees. Those who make it to the end of this short but difficult trail will find a massive, roaring waterfall, spilling 25 cubic feet of water per second over a 143 foot drop. Flanked by smaller falls, all feeding a verdant forest pool surrounded by moss and ferns, it is a gorgeous sight to behold. This waterfall, unofficially named McClellan Falls, flows year-round and is a segment of Curly Creek, a tributary of the Lewis River. It remains unknown to most passersby, and goes unmentioned by many maps of the area. It is one of those rare places that still feels undiscovered.",
    "author": "",
    "published": "Fri, 25 Jul 2025 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/vR2Ut5aGyZRzu8yHYxc_eIcrH2ErsYNjmwzV-vcLAsw/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8wY2Y0/MDQ0Yy03ZDRmLTQ1/MWMtODlmZS00MGZl/Njk4ZGQzZmE3OTRh/ZTBmZjJlNTVmYzA5/NmRfTWNDbGVsbGFu/IFZpZXdwb2ludC5q/cGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "waterfalls"
    ]
  },
  {
    "id": "98d9077f-416e-46f6-a1cb-e170f2537d2c",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "aa938922-63df-4764-9628-593014402c6d",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "9fe9688e-cd7c-4253-b623-a497267d1d02",
    "title": "Home and Travel: Why You Can’t Appreciate One Without the Other",
    "link": "https://www.nomadicmatt.com/travel-blogs/home-and-travel/",
    "description": "I used to think “home” was a dirty word. Out there — on the road — was where life happened, full of exciting adventures, fascinating people, and endless possibilities. No dreary commutes, 30-minute lunch breaks, mind-numbing meetings, or endless lists of to-dos squeezed into a rushed weekend. Why would anyone want to be home, the... The post Home and Travel: Why You Can’t Appreciate One Without the Other appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 17 Jun 2025 12:07:58 +0000",
    "image": "https://media.nomadicmatt.com/madagascar9a.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings",
      "backpacking",
      "home",
      "Life on the Road",
      "long term travel",
      "travel"
    ]
  },
  {
    "id": "d33a09e4-0a09-428e-a322-eb6787f98f03",
    "title": "American Express® Business Gold Card Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/american-express-business-gold-card-review/",
    "description": "Terms apply to American Express benefits and offers. Enrollment may be required for select American Express benefits and offers. Visit americanexpress.com to learn more. Eligibility and Benefit level varies by Card. Terms, Conditions, and Limitations Apply. Please visit americanexpress.com/benefitsguide for more details. Underwritten by Amex Assurance Company. When you run a business, every dollar counts.... The post American Express® Business Gold Card Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 11 Jun 2025 15:04:44 +0000",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2025/06/amexgoldbiz.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Points \u0026 Miles",
      "amex",
      "credit cards",
      "points and miles"
    ]
  }
]
