[
  {
    "id": "85db68cb-f5a3-4392-914b-a8c36e5668b7",
    "title": "Why Tibet’s Samye monastery is my wonder of the world",
    "link": "https://www.theguardian.com/travel/2025/jan/21/why-samye-monastery-tibet-is-my-wonder-of-the-world",
    "description": "The region’s first Buddhist monastery is a complex of chapels and stupa towers that form a symbolic and spiritual representation of the whole universeSurrounded by the bright green and gold of barley fields, the braided channels of the Yarlung Tsangpo River, and mountains rising beyond, Samye is Tibet’s first Buddhist monastery. Founded in 775, the complex of chapels and stupa towers form a vast mandala – a symbolic and spiritual representation of the whole universe.In the middle is a hall representing Mount Meru, the sacred mountain, the centre of everything. The ground floor of the hall is Tibetan in design, the first floor Chinese, the uppermost is Khotanese (the Silk Road kingdom on the edge of the Taklamakan desert). Walls are painted bright reds, yellows and whites, echoed in the vivid colours of prayer flags and sacred textiles, and gaudy images of demons – Tibetan Buddhism isn’t soft and quiet, it’s visceral and energetic. Pilgrims walk circuits around Samye, a thrum of muttered prayers and meditations hanging in the air. Continue reading...",
    "author": "Mary-Ann Ochota",
    "published": "Tue, 21 Jan 2025 14:00:33 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Tibet holidays",
      "Asia",
      "Travel",
      "Adventure travel",
      "Cultural trips"
    ]
  },
  {
    "id": "b23b9b3b-51b1-4673-bb33-fca042aa2cdf",
    "title": "A sprawling megacity of multi-level madness: why Chongqing in China is my wonder of the world",
    "link": "https://www.theguardian.com/travel/2025/jan/20/why-chongqing-china-is-my-wonder-of-the-world",
    "description": "This megacity is like Hong Kong on steroids – a vertically sprawling, astonishing urban phenomenon that can only be understood in three dimensionsGoogle Maps can be unreliable at the best of times when you’re travelling in China, but in the southern megacity of Chongqing, a map of any kind turns out to be almost entirely useless. Built across a series of impossibly steep mountainsides and vertiginous valleys at the dramatic confluence of the Yangtze and Jialing Rivers, it is an astonishing urban phenomenon to behold – a vertically sprawling city that can only be understood in three dimensions. It is a place where neighbourhoods cling to cliffs, connected by elevated roads 20 storeys up in the air. Metro lines emerge from tunnels through the mountains, only to plunge straight through the middle of residential skyscrapers, which themselves sprout improbably from the sheer slopes. Something that looks close by on the map can turn out to be tens of storeys above or below you. And getting there usually makes for an exhilarating journey.I first found myself in Chongqing 10 years ago, almost by accident, after my first attempt to enter North Korea was abruptly quashed when Kim Jong Un decided to close the borders overnight, because of his fears that foreigners might bring in Ebola. Stranded in Beijing with time to kill, a photographer friend recommended we head south to Chongqing. “It’s like Hong Kong on steroids,” was enough to convince me.Nothing prepares you for the multi-level madness of this sprawling metropolitan region of 32 million people. Hong Kong might be known for its elevated walkways and urban escalators that zigzag up its steep slopes, but Chongqing takes this 3D cityscape to a whole new level. To get to places that looked like a couple of blocks away, I found myself taking steep staircases that led to underground escalators, then across walkways to lifts that ferried me up the side of a cliff. Cable cars swooshed past outdoor plazas, where what I thought was the ground level turned out to be the roof terrace of an office block, which plunged 30 storeys down into the valley below. Continue reading...",
    "author": "Oliver Wainwright",
    "published": "Mon, 20 Jan 2025 09:00:19 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "China holidays",
      "Asia",
      "Adventure travel",
      "Cultural trips",
      "Travel",
      "Architecture"
    ]
  },
  {
    "id": "c1ddfa58-3a06-4322-a20f-acb106c0c7ab",
    "title": "Bhaja Caves in Malawali N.m., India",
    "link": "https://www.atlasobscura.com/places/bhaja-caves",
    "description": "Just a mile outside Lonavala, a popular hill station between Pune and Mumbai, visitors can explore ancient caves dating back over 2,000 years. Four-hundred feet above the village of Bhaja (or Bhaje), along an ancient trade route, 22 rock-cut caverns make up the Bhaja Buddhist cave complex. The caves are very similar to the Karla Caves in their architectural design. At the center, there is a large prayer hall called the Chaitya Griha. On either side, embedded in the mountain, are the smaller caves with artistic doors and windows carved in the stone. An important feature of this place is a group of 14 stupas, which are relics of resident monks who once lived there. An inscription mentions the names of three of the monks: Ampinika, Dhammagiri, and Sanghdina. Two of the stupas are topped with relic boxes. Some of the caves have runic inscriptions adorning the walls, while others feature artistic sculptures and instruments.",
    "author": "",
    "published": "Tue, 21 Jan 2025 15:00:00 -0500",
    "image": "https://img.atlasobscura.com/iGQEvjJYjG5J3PerGXOi92cujOx2eAffga97kXCI1tw/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9kMTI1/OGQwOS1hOTk3LTRl/NTMtOWJmOC0wNGQ5/YzI3MWIwYWYwMzA5/NTJlYWJkNDI2OTQ1/MzZfMS5qcGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "ancient",
      "hiking",
      "india",
      "caves",
      "buddhism"
    ]
  },
  {
    "id": "5cd8378d-58d2-445e-b218-c71f83cc262d",
    "title": "Canute Chambers Plaque in Southhampton, England",
    "link": "https://www.atlasobscura.com/places/canute-chambers-plaque",
    "description": "In 1912, Southampton was a booming maritime city that was developing into the main ocean liner hub for transatlantic travel. As the largest, newest, and most luxurious ship afloat, it was big news if someone you knew was on the Titanic. The ship set sail with 908 crew, 724 of which were from Southampton. When the news that the Titanic sank reached the shore on April 15, families demanded answers about the fates of their loved ones. They gathered outside the White Star Line office that employed the local crew, but all they could do was wait. Tragically, misinformation about the disaster spread, with some news outlets stating the ship was still afloat but under tow. Some telegrams stated that everyone had survived. This gave flickers of false hope to those in Southampton, which was later torn away. The rescue ship Carpathia docked in New York on April 18, 1912 with the 700 survivors of the wreck, most of whom were upper class passengers. As the lists of who had lived and died made it back to the White Star Line office in Southampton, office manager Philip Curry and his team worked around the clock to reveal the news via massive blackboards for those waiting outside. Only 175 crew from Southampton would survive. Many families of the Titanic crew struggled financially after the disaster. Charities were set up to support the survivors families. For those crew who did return, many had no choice but to immediately return to sea to feed their families.  Today, Canute Chambers is a standard office building. Only a small plaque commemorates the events that unfolded there.",
    "author": "",
    "published": "Tue, 21 Jan 2025 14:00:00 -0500",
    "image": "https://img.atlasobscura.com/YLOg2W5hOr7FUKtj5GohjtqyGlRmLFrsSaTRM7TjivA/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9kOWVj/NDE0NC1kZGFjLTQx/ZjQtYWEwYS1jYjUy/YTIyYjdjNjZhNzVh/ZDM0YmUzZTFhNDIy/MDRfQ0FOVVRFX0NI/QU1CRVJTXzIwMjAw/NzI3XzE0MjA1NS5q/cGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "ships",
      "shipwrecks",
      "titanic"
    ]
  },
  {
    "id": "b4be4eb8-b481-4dbc-8971-adb86e61f3b2",
    "title": "Specialty Coffee Shops and Parisian Cafes",
    "link": "https://www.nytimes.com/2025/01/21/travel/paris-coffee-shops-bistro.html",
    "description": "The city’s traditional cafes and bistros are staking out their cultural territory in an emerging duel against highly caffeinated upstarts serving up latte art.",
    "author": "Vivian Song",
    "published": "Tue, 21 Jan 2025 10:01:15 +0000",
    "image": "https://static01.nyt.com/images/2025/01/20/multimedia/20paris-coffee-shops-01-pkfb/20paris-coffee-shops-01-pkfb-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Paris (France)",
      "Coffeehouses",
      "Caffeine",
      "French Food (Cuisine)",
      "Coffee",
      "Politics and Government"
    ]
  },
  {
    "id": "9ca97cb1-bc7b-4c07-8755-8d155364b78e",
    "title": "Yogyakarta, Indonesia Is Where Javanese Culture Begins",
    "link": "https://www.nytimes.com/2025/01/20/travel/yogyakarta-indonesia.html",
    "description": "The Indonesian city is home to some of the greatest Hindu and Buddhist temples, a thriving food scene and an area known as the Cosmological Axis, a cradle of Javanese culture.",
    "author": "Scott Mowbray and Amrita Chandradas",
    "published": "Mon, 20 Jan 2025 15:00:55 +0000",
    "image": "https://static01.nyt.com/images/2025/01/13/multimedia/00-yogjakarta-indonesia-01-gwqf/00-yogjakarta-indonesia-01-gwqf-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Buddhism",
      "Hinduism",
      "Muslims and Islam",
      "United Nations Educational, Scientific and Cultural Organization",
      "Yogyakarta (Indonesia)",
      "Museums",
      "Art",
      "Restaurants",
      "Historic Buildings and Sites"
    ]
  },
  {
    "id": "2f5afba9-f2c7-43ad-b120-9273ac185a7e",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "d7d0da25-afad-4f75-ace6-706fa31afc38",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "946e613b-c46d-4fdc-942d-b8b379411853",
    "title": "How to Hike the Inca Trail",
    "link": "https://www.nomadicmatt.com/travel-blogs/hiking-the-inca-trail/",
    "description": "Machu Picchu is one of those bucket-list activities people dream about. While most people visit on a day trip, you can also visit via the Inca Trail, a challenging multi-day hike through the jungles of Peru. In this guest post, my friend Gillian divulges the details of her trek while sharing some tips and suggestions... The post How to Hike the Inca Trail appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Sun, 19 Jan 2025 17:59:46 +0000",
    "image": "https://media.nomadicmatt.com/2023/incatrail1.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "South America",
      "machu picchu",
      "peru"
    ]
  },
  {
    "id": "f0aa1e6b-3df6-4e09-b9e0-54834379cf71",
    "title": "The 5 Best Tour Companies in Peru",
    "link": "https://www.nomadicmatt.com/travel-blogs/best-tour-companies-peru/",
    "description": "Peru is one of the most popular destinations in South America, owing to the fact that it’s home to the bucket-list favorite and Wonder of the World Machu Picchu. Around 500,000 people visit the ancient Incan citadel each year — a number that would be much higher if it wasn’t for the mandates put in... The post The 5 Best Tour Companies in Peru appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Sun, 19 Jan 2025 13:06:56 +0000",
    "image": "https://media.nomadicmatt.com/2022/perucompanies.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "South America",
      "group tours",
      "machu picchu",
      "peru"
    ]
  }
]
