[
  {
    "id": "e8277900-f1d4-4430-9c55-98e9290b299c",
    "title": "To Hades and back: my family holiday in Parga, Greece",
    "link": "https://www.theguardian.com/travel/2025/apr/06/to-hades-and-back-my-family-holiday-in-parga-greece",
    "description": "With its white sand, sparkling sea, olive groves and echoes of ancient myths, a holiday in Greece’s beautiful Parga makes you very glad to be in the kingdom of the livingThere is a place in western Greece where, in a single day, you can frolic at an all-inclusive resort at breakfast time and then, after lunch, wade through an entrance to the underworld. This is Parga, built over a double-curve bay where the beaches are studded with tasteful tourist attractions, and inland the Acherontas River (the “river of woe”) weaves through the rocks.It’s a good way to plan a family holiday, I think: glamour, sunburn, feta, little bit of death, beer, swim. I decided not to tell the children about the death. Continue reading...",
    "author": "Eva Wiseman",
    "published": "Sun, 06 Apr 2025 06:30:43 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Travel",
      "Life and style",
      "Greece holidays",
      "Family"
    ]
  },
  {
    "id": "0b5be80d-e919-4d30-8216-5ddfe2e99011",
    "title": "The 50 best museum cafes in the UK",
    "link": "https://www.theguardian.com/culture/2025/apr/05/50-best-museum-cafes-in-the-uk",
    "description": "The pioneering V\u0026A tea rooms were designed to draw people into culture, and today such spaces offer more than just sandwiches. Felicity Cloake introduces some of our favouritesAt museums and galleries, the tourist imperative is often to tick off as much as possible, racing around desperately rather than setting aside the equally important time to take stock of it all over coffee and cake. But as well as being a respite from noisy school groups and other people’s opinions, these spaces serve other functions, too; a well-executed example draws people in in its own right, as Henry Cole, founding director of the V\u0026A, was the first to realise.Cole hoped his refreshment rooms, which opened in 1868, would encourage people to come in and enjoy some culture while they ate. The tradition continues to this day. Build it, add a decent cafe, and they will come … and they may even stay to check out the exhibitions. The best examples, like the Garden Cafe at Hospitalfield in Arbroath or the Open Kitchen Cafe at the People’s History Museum in Manchester, work to give you a sense of place, using local ingredients and recipes. Continue reading...",
    "author": "Guardian Staff",
    "published": "Sat, 05 Apr 2025 10:00:20 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Museums",
      "Food",
      "Restaurants",
      "Food and drink",
      "Culture",
      "V\u0026A",
      "Tate Modern",
      "Art and design",
      "Restaurants",
      "Ashmolean Museum",
      "Museums",
      "Stonehenge holidays",
      "Yorkshire Sculpture Park",
      "Travel",
      "Cultural trips"
    ]
  },
  {
    "id": "3632b34b-ef91-455a-bb7f-c4bd0c4d4933",
    "title": "Queen Trini Lisa in New Orleans, Louisiana",
    "link": "https://www.atlasobscura.com/places/queen-trini-lisa",
    "description": "Sitting snug in a mid-city neighborhood just off Tulane Ave and Carrollton, near the southern terminus of Highway 61, Lisa Nelson, better known as Queen Trini Lisa, is dishing out some of the best Caribbean food in New Orleans. But rewind just a few years back. Lisa was running a small corner store in the Ninth Ward, serving classic New Orleans takeaways like po’boys, fried chicken, and simple plate lunches. In the backroom, she would cook food from her home country of Trinidad and Tobago for her children, the smells wafting through the closed doors into the front of the shop. Soon, her customers began asking to buy her children’s food.  “It was weird and I thought, this is nothing special… Why do they want this?” Nelson says with a laugh. So she started selling curries and jerk chicken a few days a week. “People would pop their head in and ask what I was cooking,” Nelson says. “If it wasn’t something from my home, they would say okay, see you tomorrow and leave. I started to realize that more people came to the shop when I cooked my food.” After leaving the corner store, Nelson did pop-ups around the city, garnering a name for herself amidst a burgeoning interest in the foods that created what we now know as classic New Orleans cuisine—the Caribbean and African influences ignored by chefs and diners alike for so long.  Nelson’s name is now mentioned alongside other local luminaries like Nina Compton and chef Serigne Mbaye, making her part of an important conversation happening around New Orleans cuisines and its deep roots around the world. Now, at her own space in mid-city, she can usually be found in the kitchen, surrounded by rising dough, simmering curries, chopped cabbage, steaming rice, and several family members.  The doubles—creamy chickpeas redolent in warm Indian spices and served on airy, chewy fried flatbreads, two to a serving—are a standout hit alongside her coco bread fish sandwich and award-winning jerk chicken. It’s hard to go wrong here, so have a seat outside, take a recommendation or two, and savor every bite.",
    "author": "",
    "published": "Fri, 04 Apr 2025 15:00:00 -0400",
    "image": "https://img.atlasobscura.com/rQjXwtskhtzY3JatwtUMQRF09oysOGoNVA9bTCUAOTQ/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy81YmRi/YmMzMy01N2U3LTRj/M2QtYmJjNC1hNjQ3/NzcwMTUwMDY3Mjdk/MmQ0MjdlNmE5YmZk/ZGNfMTEyNCBBSlMg/SFdZIDYxIFF1ZWVu/IFRyaW5pIExpc2Et/NSAyLkpQRw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "chefs",
      "restaurants",
      "food",
      "caribbean",
      "diaspora"
    ]
  },
  {
    "id": "1b468343-36d1-49a7-8e8e-d67adc54aa5b",
    "title": "Elsie’s Plate \u0026 Pie in Baton Rouge, Louisiana",
    "link": "https://www.atlasobscura.com/places/elsies-plate-pie",
    "description": "With its location in an unassuming building on a major thoroughfare, Elsie’s looks like an old-school diner and is easy to miss if you’re not paying attention. But turn the corner into their parking lot and you’re met with a bright pie-themed mural and an inviting entrance into their warm, modern-industrial dining room. The fare is classic Southern: boudin melts, fried okra, pimento dip, and red beans and rice with fried chicken. And then there are the pies. The savory selection includes a crawfish hand pie, a Natchitoches meat pie (one of the state’s official foods!), and their Louisiana poulet pot pie, filled with smoked chicken and peppers in a creamy tasso gravy.  The food is decadent and alive. The salt levels are just a bit high, and butter, cream, and other fats are used generously. Pork finds its way into most things. The portions are generous, but let’s face it, you’re not here for a modest meal. Elsie’s sweet pies also shine, including a chocolate pecan, a slight twist on a classic, and other staples like their s’mores, turtle, apple, and coconut cream pies.  If you show up on the day of an LSU football match, you might catch their game-day special “Eye of the Tiger” dessert—a lemon ice box pie with vanilla wafer crust and blueberry whipped cream, vibrant in the colors of their hometown team and a perfect balance of tart lemon and sweet blueberries. Even if there’s no game underway, in-the-know regulars will often special order it in advance.",
    "author": "",
    "published": "Fri, 04 Apr 2025 14:00:00 -0400",
    "image": "https://img.atlasobscura.com/6hXLWxMC2Yn-0zoPqOmZbVNXketcTOutAvypWbsv40w/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9lODcx/YWFmOWI0M2VhNWI2/NTNfMTEyNCBBSlMg/SFdZIDYxIEVsc2ll/cyBQbGF0ZSAmIFBp/ZS01IDIuSlBH.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "sweet and savory",
      "bakery",
      "pie"
    ]
  },
  {
    "id": "e399c8b3-1fcb-4911-96a3-2e3ffc383280",
    "title": "A Sneak Peek Inside Universal’s New Epic Universe Theme Park in Orlando",
    "link": "https://www.nytimes.com/2025/04/05/travel/universal-epic-universe-theme-park-orlando-preview.html",
    "description": "The new $7 billion theme park in Orlando opens in May. With it, Universal aims to challenge Disney by letting visitors explore lands based on movies and games.",
    "author": "Brooks Barnes and Todd Anderson",
    "published": "Sat, 05 Apr 2025 09:03:28 +0000",
    "image": "https://static01.nyt.com/images/2025/04/05/multimedia/05trav-universal-epic-promo-wjph/05trav-universal-epic-promo-wjph-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Movies",
      "Amusement and Theme Parks",
      "Travel and Vacations",
      "Harry Potter (Fictional Character)",
      "Restaurants",
      "Universal Orlando Resort",
      "Orlando (Fla)",
      "How to Train Your Dragon 2 (Movie)",
      "Super Mario Bros (Video Game)"
    ]
  },
  {
    "id": "9a397d5e-5367-4d69-9307-e6eb0485420c",
    "title": "Can I Get a Refund After Booking the Wrong Hotel Dates Online?",
    "link": "https://www.nytimes.com/2025/04/03/travel/hotel-booking-refund-wrong-dates.html",
    "description": "If airlines must refund airfare up to 24 hours after purchase, why not hotels? A traveler finds that even two minutes is too late to cancel a botched reservation at a ski resort.",
    "author": "Seth Kugel",
    "published": "Thu, 03 Apr 2025 09:00:42 +0000",
    "image": "https://static01.nyt.com/images/2025/03/28/travel/28trippedup-wrongdate-illo/28trippedup-wrongdate-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Customer Relations",
      "Reservations (Airlines, Hotels, Etc.)",
      "Computers and the Internet",
      "Credit Cards",
      "Content Type: Service",
      "Hotels and Travel Lodgings",
      "Marriott International Inc",
      "Steamboat Springs (Colo)"
    ]
  },
  {
    "id": "9b473608-d57c-4574-95e3-1fbf720d562d",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "642ea39e-6f4a-4a26-97e8-6eb07e4255ac",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "080e63c5-3bce-499f-b9e7-75202ef60f6d",
    "title": "How to Find Cheap Hotels (And Which Sites to Use!)",
    "link": "https://www.nomadicmatt.com/travel-blogs/find-cheap-hotel-room/",
    "description": "As much as I love staying in hostels, there is something nice about the luxuriousness of a hotel. They are clean and quiet and feature comfy beds, strong showers, and lots of soap I can take for later. The downside is they are expensive. Wondering how to find the best deals? I've got you covered. The post How to Find Cheap Hotels (And Which Sites to Use!) appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 31 Mar 2025 12:00:27 +0000",
    "image": "https://media.nomadicmatt.com/2025/sanjosehotelpool.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Tips",
      "accommodation",
      "Get Cheap Accommodation",
      "points and miles"
    ]
  },
  {
    "id": "13a41dd0-0a2e-4007-8151-b2427c01ca68",
    "title": "Now is the Best Time to Travel",
    "link": "https://www.nomadicmatt.com/travel-blogs/now-is-the-best-time-to-travel/",
    "description": "Travel makes for a great break when you are feeling low. Whether you take a weekend, a week, a month, or a year, just getting out and doing something different can recharge the batteries. The excitement, the fun, and the new places you see give you more energy and bring you back into focus. The post Now is the Best Time to Travel appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Sat, 29 Mar 2025 12:56:38 +0000",
    "image": "https://media.nomadicmatt.com/2022/besttimetotravel.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Advice",
      "backpacking",
      "Get Inspired",
      "travel inspiration"
    ]
  }
]
