[
  {
    "id": "92fd314a-9e40-4472-ba95-f296400e1fa3",
    "title": "‘Sidmouth became our summer place’: Jeremy Vine on why his family love holidaying in Devon",
    "link": "https://www.theguardian.com/travel/2025/jun/04/jeremy-vine-why-his-family-love-devon-holiday-sidmouth",
    "description": "The broadcaster and author can’t get enough of this stretch of England’s south coast, and has even set his first murder mystery thereMy earliest memory of Devon is being lost, and my mum crying. I was at junior school. I had a friend whose mother was described as “vague” – this was the 1970s, so that could have been code for almost anything. The vague mother had given my normally quite organised mother directions to a remote house where my schoolfriend spent his summers. We were “popping in” (70s code: spending the day there). The instructions to find the place were something like, “Turn left after South Zeal, pass the dirt track and follow the direction the sheep are facing.”After an hour of pretending we were still on the right route, my mum suddenly burst into tears and uttered a rare denunciation of a fellow human being. “That SILLY woman!” she shouted. “We don’t know where we are. Nobody does.” Continue reading...",
    "author": "Jeremy Vine",
    "published": "Wed, 04 Jun 2025 06:00:57 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Devon holidays",
      "Beach holidays",
      "Family holidays",
      "Travel",
      "United Kingdom holidays",
      "England holidays",
      "Jeremy Vine",
      "Crime fiction"
    ]
  },
  {
    "id": "9ff94972-4e01-41f7-9c70-7684817ab94e",
    "title": "‘The walk is shot through with melancholy and romance’: a new trail to the north face of the Eiger",
    "link": "https://www.theguardian.com/travel/2025/jun/03/new-hiking-trail-to-the-north-face-eiger-swiss-alps-switzerland",
    "description": "The hike offers dramatic views of the Swiss Alps’ ‘murder wall’ – and poignant insights into the climbers who first braved it. For the son of one of those pioneers, it had a special resonanceA few years ago, my dad told me of a mountain where I could easily sense another world. “There is a special air and light,” he had said, vaguely. “You just have to walk close to it to feel and see it. Stand in one place and just look up.”The mountain on my dad’s mind that day was the Eiger, Switzerland’s 3,970-metre ogre of limestone and ice. Like few others, the peak exerts a gravitational pull on climbers and it remains the chief symbol of the Bernese Oberland; its most notable feature, the 1,800-metre north face, is the largest in the Alps. This gigantic slab looms over the village of Grindelwald, to the south-east of the town of Interlaken, appearing at sunrise as an immense black spectre in a valley of green. Continue reading...",
    "author": "Mike MacEacheran",
    "published": "Tue, 03 Jun 2025 06:00:23 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Switzerland holidays",
      "Alps holidays",
      "Walking holidays",
      "Europe holidays",
      "Travel",
      "Mountaineering",
      "Walking"
    ]
  },
  {
    "id": "3c4ad566-eeb7-4eac-aedd-12c7b57696b0",
    "title": "Hibiya Godzilla Square in Tokyo, Japan",
    "link": "https://www.atlasobscura.com/places/hibiya-godzilla-square",
    "description": "Hibiya Godzilla Square is home to the largest Godzilla statue in the country, a monumental tribute to Japan’s most famous kaiju (“strange beast” or “monster”). The impressive tribute to the iconic character contains the original screenplay for Godzilla's 1954 debut. Despite the area around Hibiya Godzilla Square being destroyed in the original film and many subsequent installments, the square has proudly housed a statue of the treasured titan since 1995. Two statues have occupied the square over this time, the first of which was installed to commemorate Godzilla’s demise in Godzilla vs. Destoroyah. The present statue replaced it in 2018. An unmistakable representation of Godzilla as seen in the 2016 film Shin Godzilla, the centerpiece of Hibiya Godzilla Square rises above a crashing wave at an impressive height of 9.8 feet, making this towering terror the tallest full statue of Godzilla in Japan.",
    "author": "",
    "published": "Wed, 04 Jun 2025 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/CQTwzZCtuNVpxGxRML9ZjrK0WfsF3uwnhXlvC5JTMH0/rs:fill:300:200:1/g:ce/c:1979:1319:nowe:26:310/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8zNTRi/YzFjNi1kNDZmLTQ2/NGMtOGM1Yi00ZDFi/ZDFiMDhjYTc1ODM2/MDVlYTQ3NzM1MGFh/NWZfSU1HXzA1MTgu/anBlZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "japan",
      "film",
      "godzilla"
    ]
  },
  {
    "id": "4ed4c967-2271-4ae5-89ba-09f598d25249",
    "title": "Three Mile Island Historical Marker in Middletown, Pennsylvania",
    "link": "https://www.atlasobscura.com/places/three-mile-island-nuclear-accident-site",
    "description": "Early on the morning of March 28, 1979, a series of failures at the Three Mile Island nuclear power plant led to a partial meltdown that released radioactive gases and radioactive iodine into the atmosphere. The accident began with failures in the non-nuclear secondary system, followed by a pilot-operated relief valve that was stuck in the open position, which resulted in large amounts of water escaping from the pressurized isolated coolant loop. Plant operators failed to recognize the situation as a loss-of-coolant accident, which was later attributed to inadequate operating procedures that left them ill-equipped to respond to the potentially catastrophic situation that unfolded in TMI Unit 2. Design flaws, such as poor control design, the use of multiple similar alarms, and a failure of the equipment to indicate either the coolant-inventory level or the position of the stuck-open PORV, were also discovered during follow-up investigations. While official reports indicate that incident did not cause any serious health concerns, cleanup of the incident took over 14 years and cost roughly $1 billion. TMI Unit 2 was shut down following the accident. TMI Unit 1 was shut down in September 2019, but as of September 2024, a 20-year deal was signed by Constellation Energy with the goal of providing power to support Microsoft’s data centers by 2028.",
    "author": "",
    "published": "Wed, 04 Jun 2025 15:00:00 -0400",
    "image": "https://img.atlasobscura.com/WnTC4IV36DHL8sySlZVuy9x6CfzVnjXj-pKKBJw5mCU/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy82NGQ5/OWI4MS04NGQ5LTQw/MGUtYWM3Mi02MmEy/Mzg5ZmI2YmI2OTNi/YTIwY2NiZGEzYzgy/OGZfUFhMXzIwMjEx/MjMxXzIxMDgxNDI4/MS5qcGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "disasters",
      "nuclear"
    ]
  },
  {
    "id": "550a6587-76ce-4494-92be-f29ee3cbf79d",
    "title": "A Guide to Madrid’s Maritime Treasures",
    "link": "https://www.nytimes.com/2025/06/04/travel/maritime-madrid.html",
    "description": "The capital of Spain may not be on the coast, but that doesn’t keep it from celebrating its ties to the sea with museums, fountains, the occasional massive anchor and even the city’s favorite sandwich.",
    "author": "Andrew Ferren and Gianfranco Tripodo",
    "published": "Wed, 04 Jun 2025 17:06:04 +0000",
    "image": "https://static01.nyt.com/images/2025/05/31/multimedia/00trav-Maritime-Madrid-gbql/00trav-Maritime-Madrid-gbql-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Museums",
      "Art",
      "Travel and Vacations",
      "Seafood",
      "Monuments and Memorials (Structures)",
      "Palaces and Castles",
      "Madrid (Spain)",
      "Oceans and Seas"
    ]
  },
  {
    "id": "06f2efbc-f2dc-4cc9-90ba-531096afd814",
    "title": "Where to Go in Sydney, Australia, According to Nicole Kidman",
    "link": "https://www.nytimes.com/2025/06/04/travel/nicole-kidman-sydney-australia.html",
    "description": "When the Oscar-winning actress needs to recharge, she looks to her hometown, where she finds “comfort and ease” in gardens, art and harbor pools.",
    "author": "Danielle Pergament and Rachel Kara Ashton",
    "published": "Wed, 04 Jun 2025 09:00:53 +0000",
    "image": "https://static01.nyt.com/images/2025/06/03/multimedia/03trav-5places-kidman-05-pvmg/03trav-5places-kidman-05-pvmg-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Content Type: Personal Profile",
      "Kidman, Nicole",
      "Sydney (Australia)"
    ]
  },
  {
    "id": "a3a66e6b-54c0-4b05-b069-d999bfa53241",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "59da316e-75a5-4f3e-bcec-02183c98e333",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "3a7077d4-b42f-46d9-b542-c67df9155215",
    "title": "SafetyWing Travel Insurance Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/safety-wing-review/",
    "description": "Budget travelers love saving money — myself included. But one of the expenses that we shouldn’t be cheap with is travel insurance. After over 17 years of traveling the world, I still never leave home without it. Why? Because I’ve seen firsthand how useful it can be — and how much money it can save.... The post SafetyWing Travel Insurance Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 02 Jun 2025 12:00:30 +0000",
    "image": "https://media.nomadicmatt.com/2021/safetywingmain3.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "gear",
      "Insurance",
      "safety wing",
      "Tech",
      "travel insurance"
    ]
  },
  {
    "id": "769b7f25-e5bb-4bfa-8365-56b53adc2a37",
    "title": "14 Off-the-Beaten-Path Things to See and Do in Paris",
    "link": "https://www.nomadicmatt.com/travel-blogs/off-the-beaten-path-paris/",
    "description": "Paris is filled with famous attractions: the Eiffel Tower, the Louvre, Versailles, the catacombs, the Pantheon, the Arc de Triomphe, Sacre-Coeur. The list goes on. There are so many amazing sites here that you could spend days (heck, even weeks) just seeing the main, most well-known ones. But there’s more to Paris than the sites... The post 14 Off-the-Beaten-Path Things to See and Do in Paris appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Fri, 30 May 2025 12:38:30 +0000",
    "image": "https://media.nomadicmatt.com/2024/offbeatparis.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Europe",
      "europe",
      "france",
      "paris"
    ]
  }
]
