[
  {
    "id": "37c88492-4d09-4a70-be31-14ad2549aea3",
    "title": "Fossils, forests and wild orchids: exploring the white cliffs of Denmark",
    "link": "https://www.theguardian.com/travel/2025/jul/08/fossils-forests-and-wild-orchids-exploring-the-white-cliffs-of-denmark",
    "description": "A short stretch of chalk cliffs on the island of Møn could soon become a world heritage site due to its unique ecology of wild orchids and geology of 30-million-year-old fossilsAs we sauntered along sun-splashed woodland paths, our knowledgable guide Michael started to explain the links between the local geology and flora. The unusually luminous light green leaves of the beech trees? “That’s due to the lack of magnesium in the chalky soil.” The 18 species of wild orchid that grow here? “That’s the high calcium content. You see? Everything is connected.”That’s a phrase my companion and I kept hearing at Møns Klint on the Danish island of Møn. This four-mile (6km) stretch of chalk cliffs and hills topped by a 700-hectare (1,730-acre) forest was fashioned by huge glaciers during the last ice age, creating a unique landscape. In 2026, a Unesco committee will decide whether Møns Klint (“the cliffs of Møn”) should be awarded world heritage site status, safeguarding it for future generations. Continue reading...",
    "author": "Dixe Wills",
    "published": "Tue, 08 Jul 2025 06:00:30 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Travel",
      "Denmark holidays",
      "Europe holidays",
      "Camping holidays",
      "Rail travel",
      "Europe"
    ]
  },
  {
    "id": "94772cb8-c5e7-4f96-8145-bd97d88c1db4",
    "title": "The ‘wow’ factor: island hopping and otter spotting on a family break in Shetland",
    "link": "https://www.theguardian.com/travel/2025/jul/07/the-wow-factor-island-hopping-and-otter-spotting-on-a-family-break-in-shetland",
    "description": "The spectacular Shetland archipelago – with its dive-bombing gannets, ancient settlements and endless horizons – is the perfect spot for a holiday with kidsIt takes us 38 hours – two trains, a tube, the Caledonian Sleeper, a day in Aberdeen, a hire car and the NorthLink ferry – to reach Shetland from our home in Oxfordshire, and yet the immortal words “Are we there yet?” are not uttered once. When the ferry docks at Lerwick, the kids, Lydia (11) and Alex (eight), are uncharacteristically silent as we take in the view: the town huddled on a low hill, the water shimmering in the morning sun, and islands as far as the eye can see.We are spending a week in the archipelago, travelling first around Mainland, the main island, and then north to the less populated islands of Yell and Unst, linked by regular ferries. It turns out to be the perfect location for a family holiday: short journey times (it takes 80 minutes to drive from the southern tip of Mainland to the northern) combined with the sea almost always being in view, and the excitement of a boat or ferry trip every day. Continue reading...",
    "author": "Emma Gibbs",
    "published": "Mon, 07 Jul 2025 06:00:04 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Scotland holidays",
      "Travel",
      "United Kingdom holidays",
      "Family holidays",
      "Birdwatching",
      "Wildlife"
    ]
  },
  {
    "id": "b10ff50c-9a0f-40df-b506-d85e698a2f03",
    "title": "Chasing Solitude, and Dinosaurs, in Comanche National Grassland",
    "link": "https://www.nytimes.com/2025/07/08/travel/colorado-comanche-national-grassland.html",
    "description": "The Comanche National Grassland rewards visitors with the chance to follow dinosaur tracks and feel the spine-tingling thrill of total solitude.",
    "author": "Mya Guarnieri and Nina Riggio",
    "published": "Tue, 08 Jul 2025 09:01:07 +0000",
    "image": "https://static01.nyt.com/images/2025/07/07/multimedia/00trav-co-grasslands1-pmwz/00trav-co-grasslands1-pmwz-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Comanche National Grassland (Colo)",
      "Agriculture and Farming",
      "Travel and Vacations",
      "Native Americans",
      "Grass",
      "Dinosaurs",
      "Hikes and Hiking",
      "Drought",
      "Colorado",
      "Forest Service"
    ]
  },
  {
    "id": "bd844d26-263d-4faf-ad06-5442f7551a2d",
    "title": "Driving Cross Country? Here Are the Apps You Want.",
    "link": "https://www.nytimes.com/2025/07/08/travel/driving-apps.html",
    "description": "On a road trip from New York to Los Angeles (and back), a writer found digital tools that helped her navigate and find a cornucopia of “weird attractions.”",
    "author": "Jennifer A. Kingson",
    "published": "Tue, 08 Jul 2025 22:07:15 +0000",
    "image": "https://static01.nyt.com/images/2025/07/02/travel/00road-trip-apps12/00road-trip-apps12-mediumSquareAt3X-v2.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Mobile Applications",
      "Travel and Vacations",
      "Maps",
      "Road Trips",
      "Atlas Obscura",
      "Airbnb",
      "Google Maps",
      "Scenic America"
    ]
  },
  {
    "id": "d423de1c-e1ed-4a86-aa80-d503dff8f4b1",
    "title": "Glymur in Iceland",
    "link": "https://www.atlasobscura.com/places/glymur-waterfall-iceland",
    "description": "In the moss-draped depths of the Hvalfjörður fjord, just a short detour from Reykjavík, lies a secret that roars. But you won’t find Glymur waterfall from your car window — this towering cascade, once thought to be Iceland’s tallest, makes you earn the encounter. At 198 meters (650 feet), Glymur falls into a narrow canyon carved by the river through the millennia. The name “Glymur” comes from the Icelandic verb glymja (to echo or resound) and fittingly, the waterfall doesn’t just fall. It sings. Unlike other falls like Gullfoss or Seljalandsfoss, Glymur isn’t served up on a tourist-circuit platter. There’s no gift shop, and no coffee stand, only a trailhead off Route 47. The hike is a rugged 3- to 4-hour loop, crossing a log bridge, weaving through a lava cave (called Þvottahellir, or “the Washing Cave”), and scaling rocky slopes with chain ropes as your only support.  As you climb, the canyon yawns open beside you, revealing veils of mist, sea eagles wheeling in the wind, and, if the sun is right, rainbows arcing like blessings over the drop. Glymur’s story doesn’t end with geology. Local legend suggests that the canyon was formed when a man transformed into a whale, cursed by a grieving woman and her baby. The whale swam upriver, thrashing and smashing through the valley, eventually causing the land to split and Glymur to form. Some say you can still hear the echoes of the whale’s final cry in the water’s crash.  The surrounding place names — Hvalklettur (Whale-Rock) and Hvalsgil (Whale-Gorge) —give mythic weight to the tale. This isn’t just a waterfall; it’s a wound in the earth where saga and stone blur. Until 2007, Glymur held the title of Iceland’s highest waterfall. Then Morsárfoss, a glacial fall in Vatnajökull National Park that emerged when the glacier shrank, was discovered to be taller. But Glymur retains something Morsárfoss doesn’t: presence. It’s not just about height — it’s about drama, effort, and intimacy. Glymur demands engagement. You feel it in your legs, your lungs, and your chest when you finally stand at its summit. And perhaps that’s the point. Glymur remains untouched by tour buses, reserved for the curious, the intrepid, and the slightly mud-splattered.",
    "author": "",
    "published": "Tue, 08 Jul 2025 15:32:00 -0400",
    "image": "https://img.atlasobscura.com/McuzRrGUTmhhcuu3-4T_emfgduw1J0YhE4KbNryS0R4/rs:fill:300:200:1/g:ce/c:1698:1132:nowe:249:268/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9mNWM5/ODBmYS1mNTE0LTQ3/NGItYTUzMi1kYjIz/ZThkNzkwYmVmY2Y3/ZjM2MThjNzI5NjAw/NGFfR2x5bXVyLmpw/Zw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "hiking",
      "waterfalls",
      "iceland"
    ]
  },
  {
    "id": "0078b0f5-c22f-4653-bebf-2afbdfebbd2c",
    "title": "RSU Anatomy Museum in Rīga, Latvia",
    "link": "https://www.atlasobscura.com/places/rsu-anatomy-museum-riga",
    "description": "In 1920, the scientists Gaston Backman and Jēkabs Prīmanis at the University of Latvia began assembling a collection of anatomical materials to be used for teaching and research at the university. This collection would grow over two decades and would eventually contain thousands of items. Rīga Stradiņš University made the collection available for public viewing in 2020, and the collection is now displayed within a small building next to its Theatrum Anatomicum (or Institute of Anatomy and Anthropology). Spread over two floors, the collection includes wet specimens (body parts preserved in fluids), bones, casts of body parts including parts with anomalous features, corrosion casts (made by filling the blood vessels of organs with a metal, wax, and paint mixture that showed the locations of blood vessels when the organs were then dissolved away), and even skin samples with tattoos. One of the most notable rooms in the museum contains a giant display case with hundreds of skulls and a vintage photographic camera, all of which were used in anthropology research in the 1920s and 1930s. Although every room of the museum is filled with unusual specimens, one of the highlights is the complete skeleton of Teodors Lukstiņš, who donated it before passing away in 1925. Other specimens in the museum came from people who died with no relations. Lukstiņš’s skeleton is on display in the entrance lobby. Even though a large portion of the anatomy collection is now on public display, the collection is still used for teaching and research purposes. Additionally, the items in the collection are now considered historically important, and provide insights into how anatomy and anthropology research was conducted over a century ago.",
    "author": "",
    "published": "Tue, 08 Jul 2025 14:18:00 -0400",
    "image": "https://img.atlasobscura.com/p1aCYJNOLHgZtEtevnI4mQTiT2QK6tcaprKVJJZiPJc/rs:fill:300:200:1/g:ce/c:600:400:nowe:248:353/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy84ZDFi/ZTYyYS03N2NlLTRi/NGYtYjY3Yy02OTY0/ZGZiMGE2OWExZTVk/MDgxYzk4NWI3ZGQ1/ZDNfbXVzZXVtMy5q/cGc.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "skeletons",
      "bones",
      "anatomy museums",
      "museums"
    ]
  },
  {
    "id": "7853f618-d19d-4093-a703-010879610a4b",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "ce0f85e9-489f-4865-9c2a-5122f56e4a7b",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "48eb33ea-ad7e-411d-ac3a-f763ab766d34",
    "title": "Home and Travel: Why You Can’t Appreciate One Without the Other",
    "link": "https://www.nomadicmatt.com/travel-blogs/home-and-travel/",
    "description": "I used to think “home” was a dirty word. Out there — on the road — was where life happened, full of exciting adventures, fascinating people, and endless possibilities. No dreary commutes, 30-minute lunch breaks, mind-numbing meetings, or endless lists of to-dos squeezed into a rushed weekend. Why would anyone want to be home, the... The post Home and Travel: Why You Can’t Appreciate One Without the Other appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 17 Jun 2025 12:07:58 +0000",
    "image": "https://media.nomadicmatt.com/madagascar9a.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings",
      "backpacking",
      "home",
      "Life on the Road",
      "long term travel",
      "travel"
    ]
  },
  {
    "id": "c8b356f7-b687-41bb-9a72-19782a3779cf",
    "title": "American Express® Business Gold Card Review",
    "link": "https://www.nomadicmatt.com/travel-blogs/american-express-business-gold-card-review/",
    "description": "Terms apply to American Express benefits and offers. Enrollment may be required for select American Express benefits and offers. Visit americanexpress.com to learn more. Eligibility and Benefit level varies by Card. Terms, Conditions, and Limitations Apply. Please visit americanexpress.com/benefitsguide for more details. Underwritten by Amex Assurance Company. When you run a business, every dollar counts.... The post American Express® Business Gold Card Review appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Wed, 11 Jun 2025 15:04:44 +0000",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2025/06/amexgoldbiz.jpg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Points \u0026 Miles",
      "amex",
      "credit cards",
      "points and miles"
    ]
  }
]
