[
  {
    "id": "8c5fd077-f6a0-42c9-a229-a8ebc8dbdc19",
    "title": "Tennyson, Virginia Woolf and Jimi Hendrix – all on a car-free trip to the Isle of Wight",
    "link": "https://www.theguardian.com/travel/2025/mar/20/tennyson-virginia-woolf-and-jimi-hendrix-all-on-a-car-free-trip-to-the-isle-of-wight",
    "description": "The island is easy to reach by ferry and explore by bus, following in the footsteps of everyone from a Victorian poet to a 60s rock starThe green tidal mudflats are noisy with gulls and lapwings as the ferry sails towards Yarmouth. Far out on sparkling water, a white sail stands out against misty downs. The Victorian poet laureate Alfred, Lord Tennyson regularly tramped over those chalky hills, declaring “the air is worth ‘sixpence a pint’”. There is no need to drive for a holiday on the Isle of Wight. Regular ferries connect with mainland trains and the island has a good network of buses.I am travelling as a foot passenger on the 40-minute Wightlink ferry from Lymington Pier, where the train arrives along an embankment with yachts, plovers and redshanks outside the window. Once on the island, the Summer Links bus service, running from April to late September, stops at the entrance to Tapnell Farm, where I’m staying for a couple of nights in a well-equipped cabin with a hot tub that looks out towards Tennyson Down. Continue reading...",
    "author": "Phoebe Taplin",
    "published": "Thu, 20 Mar 2025 07:00:18 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Isle of Wight holidays",
      "Travel",
      "England holidays",
      "United Kingdom holidays",
      "Ferry travel",
      "Culture"
    ]
  },
  {
    "id": "115863ce-619e-4315-84f8-601f7178f385",
    "title": "Fancy a Belgian city break without the crowds of Ghent or Bruges? Mechelen might be the answer",
    "link": "https://www.theguardian.com/travel/2025/mar/19/belgium-city-break-ghent-bruges-mechelen",
    "description": "The majestic Flemish city is dotted with renaissance palaces, great bars and eye-catching contemporary art – yet it’s firmly off the tourist trailArriving in Belgium on the Eurostar, it is always tempting to continue on to a popular weekend destination like Bruges, Ghent or Antwerp. But this time I hop on a local train at the Brussels Gare du Midi for the 30-minute journey to Mechelen, a surprisingly grand and opulent city that in the 16th century was capital of most of the Low Countries – Belgium, Netherlands and Luxembourg.Despite boasting an eclectic mix of medieval churches and renaissance palaces, eye-catching contemporary art and culture venues, great bars, restaurants and the obligatory Belgian brewery, it remains delightfully uncrowded, unspoilt and firmly off the tourist trail. Continue reading...",
    "author": "John Brunton",
    "published": "Wed, 19 Mar 2025 07:00:17 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Belgium holidays",
      "Europe holidays",
      "City breaks",
      "Short breaks",
      "Cultural trips",
      "Travel"
    ]
  },
  {
    "id": "2e30db1d-4cbb-4083-93d7-2a4a6045fc72",
    "title": "La Teca in Oaxaca, Mexico",
    "link": "https://www.atlasobscura.com/places/la-teca",
    "description": "Although La Teca has been around for over three decades, it still feels like a secretive discovery. Take a taxi to a busy street in Oaxaca's residential Reforma neighborhood far from mezcal-swigging tourists, then admire the quaint family vibe of La Teca’s front room hung with artworks by Oaxacan luminaries including the late artist-activist-legend, Francisco Toledo. As you settle down in the overgrown tropical patio worthy of a magical realist novel, chef-owner Deyanira Aquino appears—in her eighties, regal of bearing, and glamorous in her bright lipstick and traje de tehuano, the colorful embroidered dress popularized in Mexico by Frida Kahlo.   The dress as well as the culinary tradition that Aquino nurtures at La Teca belong to Istmo de Tehuantepec, the slender finger of land between the Gulf of Mexico and the Pacific Ocean. There the fiestas are wild, and the cooking is opulent with tropical produce and foreign influences—Arabic, French, Chinese—from the region’s past as an important pre-Panama Canal trade route.   Among Le Teca’s regulars, many are Aquino’s fellow Istemeños. They come here for a taste of sweet-tart molotes—fried plantain torpedoes served with lashing of crema and gratings of Parmesan-like queso Istmeño—and for the intriguing funk of dried shrimp in the ocher-hued mole de camaron. They also come for the homey comfort of tamales de chambray, banana-leaf bundled pillows of masa fashioned from small-grained low-altitude zapalote chico corn and filled with chicken, raisins, and capers. And every table orders garnachas, little fried masa discs filled with shredded pork and served with a puckery cabbage salad.  “Istmeño food is its own curious blend,” Aquino explains. “Sure, we eat iguanas and armadillos—but we also love mustard and mayo!” The latter flavors the Istmeño classic called papas horneadas, a coarsely mashed baked potato puree that tastes oddly Germanic. It accompanies Aquino’s majestic estofado de boda, a baroque-tasting “wedding” mole of pulled beef in a mind-bogglingly rich sauce of chilies, apples, plantains, and pineapples that requires hours of continued stirring.",
    "author": "",
    "published": "Thu, 20 Mar 2025 17:00:00 -0400",
    "image": "https://img.atlasobscura.com/EgRW8By3168iYIKCsmIMLDscO9cBaroKLjJOaD_oTHM/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9iOTAy/YjUzMWM0NGE5MTVi/OGJfTGFUZWNhLTQz/NzY0LmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "corn",
      "chefs",
      "food"
    ]
  },
  {
    "id": "4cf5cb50-b189-4c52-a59f-3d0ed45dba04",
    "title": "Chalet Cheese Cooperative in Monroe, Wisconsin",
    "link": "https://www.atlasobscura.com/places/chalet-cheese-cooperative",
    "description": "Sure, many people think their job stinks, but only a few lucky workers are proud of that fact. They may be found at the Chalet Cheese Cooperative, a dairy factory located in Green County, Wisconsin. While Chalet Cheese makes a variety of dairy products, these days, it is best known as the last Limburger cheese plant in America. Although the origins of Limburger cheese date back to the 15th century in the Wallonia region of Belgium, America’s Limburger obsession is traced back instead to the wave of Swiss immigration into southwest Wisconsin. The first commercial cheese factory in Green County was founded in 1868, and less than 20 years later, in 1885, a group of five dairy farmers formed the Blieler-Gibbons Factory to make Limburger cheese. This plant would eventually become the Chalet Cheese Cooperative. Limburger cheese stood as a contrast to the refined and expensive Emmentaler that had become Wisconsin’s major export. Its unusual earthy tones and creaminess, to say nothing of the lower price, led it to become a popular cheese option for working class immigrants. The dairy farms soon couldn’t ship Limburger fast enough. By the 1930s, Green County produced nearly all of the nation’s Limburger cheese, totaling more than 7 million pounds per year. The local train line through Milwaukee became known as “The Limburger Special.” Of course, this is also when Limburger began to earn its reputation for… pungency. Perhaps due to anti-immigrant bias, and also due to its, well, obvious stinkiness, Limburger cheese began to become maligned. It would be banned in cities, and postal workers would refuse to ship it. As American tastes changed and refrigeration became more common, Limburger sales would continue to dip. Where there were once 11 plants in Green County that produced Limburger cheese, Chalet Cheese would eventually stand alone. The Chalet Cheese Cooperative is a producer-owned dairy co-operative of more than a dozen family farms, who together produce the milk and share in the profits of cheesemaking. The plant was built expressly for Limburger cheese through an arrangement with Kraft, but these days, 85 percent of its sales are for Swiss, brick, and other cheeses.  Nevertheless, the factory still produces nearly half a million pounds of Limburger cheese each year, mostly distributed to wholesalers and sold under a variety of labels. (No matter the brand name, if it is American Limburger cheese, it originates from this co-op.) Every piece of Limburger cheese is rubbed by hand with the same mother culture that has existed since 1885, and then aged in the cellar. Limburger quickly goes from mild to funky to inedible within about six months of aging, so visitors and shoppers can get an array of flavors. If you stop by during operating hours, you’ll likely be greeted by an actual working cheesemaker, who’ll be happy to let you try a sample of the goods. (Have no fear, Limburger has a full and rich taste that belies its reputation, nevertheless, ask for the milder variety first if you are not comfortable.) You can also sample many other award-winning cheeses, purchase Limburger accessories, or continue on your journey to a nearby tavern to order a Limburger sandwich. Either way, you can rest assured that you’ve experienced one of the longest-running, most unusual, and smelliest traditions of America’s working class.",
    "author": "",
    "published": "Thu, 20 Mar 2025 16:00:00 -0400",
    "image": "https://img.atlasobscura.com/HnzoaHQIvmRYxS-J7WRpC0YXCaCAv9rBHomyX4KHSUk/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8yMGIy/MjUyOC02MjhmLTQz/N2MtYTI0ZS0wODlj/Y2Y2M2VkNjFhM2Nk/YTJlMmM3Yzc5Njkz/YzRfMjAyNDA3MjZf/MTMxNzA1LmpwZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "stinky but scrumptious",
      "factories",
      "cheese"
    ]
  },
  {
    "id": "655acd52-b605-42f1-b86f-b5e43c2994f6",
    "title": "The Houston Rodeo Is the Super Bowl of Country Culture",
    "link": "https://www.nytimes.com/2025/03/20/travel/houston-rodeo-livestock-show.html",
    "description": "Spending a few days eating turkey legs, watching piglet races and ‘mutton bustin’ at the world’s largest rodeo and livestock show.",
    "author": "Shannon Sims and Meridith Kohut",
    "published": "Thu, 20 Mar 2025 14:28:43 +0000",
    "image": "https://static01.nyt.com/images/2025/03/17/multimedia/Houston-Rodeo-01-gpbk/Houston-Rodeo-01-gpbk-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Houston (Tex)",
      "Rodeos",
      "Travel and Vacations",
      "Livestock",
      "Contests and Prizes",
      "Cattle"
    ]
  },
  {
    "id": "9c9bbe2d-010d-4674-ad6c-48a34540d8d6",
    "title": "Take This Quiz to Find the Perfect Trip for You and Your Picky Travel Buddy",
    "link": "https://www.nytimes.com/2025/03/19/travel/travel-partner-type-quiz.html",
    "description": "You like long hikes, but your travel partner prefers lounging by the pool. Fear not: There’s a vacation you can enjoy together. Let us help you find one.",
    "author": "Danial Adkison",
    "published": "Wed, 19 Mar 2025 09:00:27 +0000",
    "image": "https://static01.nyt.com/images/2025/03/06/travel/00compalibility-quiz-lead2-illo/00compalibility-quiz-lead2-illo-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Content Type: Service",
      "Restaurants",
      "Museums",
      "Spas",
      "Swimming Pools",
      "Hotels and Travel Lodgings",
      "Hikes and Hiking",
      "Walking",
      "Rock Climbing",
      "Alcoholic Beverages",
      "Leisure"
    ]
  },
  {
    "id": "9c848a72-8fd5-4f67-81f9-89b682533666",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "2ae15f29-12a1-4337-bd79-4d8e5a736503",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "88443743-0d1f-4397-a087-f88a3408feaa",
    "title": "Come See Me on Book Tour!",
    "link": "https://www.nomadicmatt.com/travel-blogs/book-tour-2025/",
    "description": "I’m going on a book tour! My next book, How to Travel the World on $75 a Day, is coming out on March 25th and I’m going on a book tour to talk about it and the current state of travel! This is my first book tour in six years and I’m very excited to... The post Come See Me on Book Tour! appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Thu, 20 Mar 2025 11:59:49 +0000",
    "image": "https://media.nomadicmatt.com/2025/tourposttitle.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings"
    ]
  },
  {
    "id": "53604b48-5f4b-456b-8cd4-a53087055e63",
    "title": "Everyone Says I’m Running Away",
    "link": "https://www.nomadicmatt.com/travel-blogs/everyone-say-im-running-away/",
    "description": "I’m not sure why, but there is this perception out there that anyone who travels long-term and isn’t interested in settling down or getting a conventional job must be running away from something. In this post, I explain what I'm running away from... The post Everyone Says I’m Running Away appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Tue, 18 Mar 2025 08:00:08 +0000",
    "image": "https://media.nomadicmatt.com/2025/runningaway.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Random Musings",
      "backpacking",
      "fear",
      "long term travel",
      "travel inspiration"
    ]
  }
]
