[
  {
    "id": "4f683773-9ec4-4805-a7ad-4524d1ee99c4",
    "title": "A frozen, protected wonderland: slow adventure in the less visited French Alps",
    "link": "https://www.theguardian.com/travel/2025/feb/06/a-frozen-protected-wonderland-slow-adventure-in-the-less-visited-french-alps",
    "description": "At the gateway to the Vanoise national park, new cabins make a great base for a wild winter retreat that’s laid-back but packed with activityThe snow is deep and soft as we pad slowly forward, a muffled crunching the only sound breaking the silence. All around us, the jagged peaks of the Vanoise massif pierce the sky, glinting in the clear morning light. As we walk, Matthieu, my snowshoeing guide, points out fresh tracks – mountain hare, roe deer, fox – and on the mountainside we spy ibex: first a lone male, then a group surveying us from on high.Champagny-le-Haut, a 1,500-metre-high glacial valley in the French Alps close to the Italian border, is the gateway to the Vanoise national park. In summer it offers pristine mountain hikes and waterfalls, while in winter, with snow closing the road beyond the pretty hamlet of Le Bois where I’m staying, it’s a frozen, protected wonderland. A world away from the busy ski resorts elsewhere in La Plagne, it’s perfect for a more low-key, affordable winter holiday in the heart of nature. Continue reading...",
    "author": "Jane Dunford",
    "published": "Thu, 06 Feb 2025 07:00:03 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Winter sports holidays",
      "Skiing holidays",
      "La Plagne holidays",
      "Alps holidays",
      "France holidays",
      "Chalets",
      "Europe holidays",
      "Travel"
    ]
  },
  {
    "id": "f2553bc0-2582-4705-9a24-d3c12b5b8b2f",
    "title": "Winter waterway: a cosy off-season trip on the Leeds \u0026 Liverpool Canal",
    "link": "https://www.theguardian.com/travel/2025/feb/05/waterway-winter-leeds-liverpool-canal-boat-hire-holiday",
    "description": "A centrally heated boat proves perfect for a quiet Pennine cruise but canal maintenance and stormy weather mean plans have to be flexibleThe ice creaked against the boat’s hull, slabs of it spinning out of the way. We weren’t in the Arctic on a cruise ship but steering a narrowboat in northern England, almost the farthest north you can reach on the inland waterways. There was snow on the hills. The Leeds \u0026 Liverpool Canal, which climbs to 148 metres above sea level as it crosses the Pennines between the east and west coasts, had only recently thawed after a cold snap.A canal holiday is usually thought of as a summer pastime: standing at the tiller in T-shirt and shorts, followed by evenings in canalside beer gardens. But the canals are quieter in the off season (from October to May), and it is unlikely you will find queues at locks or water points. The sparsity of boat traffic is also easier on the nerves if you’re new to steering a 30-tonne steel battering ram round bends, through narrow bridges and beside expensive moored boats. For the first time ever, I would be at the tiller of a wide-beam (11ft 5in-wide) boat. Continue reading...",
    "author": "Paul Miles",
    "published": "Wed, 05 Feb 2025 07:00:30 GMT",
    "image": "",
    "source": "https://www.theguardian.com/uk/travel/rss",
    "categories": [
      "Boating holidays",
      "Yorkshire holidays",
      "Lancashire holidays",
      "England holidays",
      "United Kingdom holidays",
      "Short breaks",
      "Travel"
    ]
  },
  {
    "id": "8fc96f29-3c1e-4bbb-938f-0f22c18ca32f",
    "title": "How Can You Spot an Inaccurate Dinosaur? AO Wants to Know.",
    "link": "https://www.atlasobscura.com/articles/paleontology-accurate-dinosaurs",
    "description": "AO Wants to Know is an ongoing interview series where we ask experts in extraordinary subjects to share their knowledge with us. Do you know how to make “dinosaur hands”? Try it now: Position your hands the way a T. rex would. Did you bend your wrists forward with your palms facing down, like the front paws of a kangaroo? If you did, we have some bad news for you. “Overwhelmingly, bipedal dinosaurs had their hands facing one another,” says Steven Bellettini, the host of the paleontology YouTube channel Your Dinosaurs Are Wrong. Early paleontologists assumed that two-legged dinosaurs, like modern mammals, had wrists that were pronated, meaning able to rotate downwards. But evidence discovered in the early 21st century shows that dinosaur wrists actually lacked this range of motion, so their palms faced inwards when their hands were at rest. And yet, inaccurate downwards-pointing hands are still prevalent in pop culture depictions of dinosaurs, leading to a widespread misconception. “It’s the thing that I wind up mentioning practically every episode,” Bellettini adds. Bellettini and his collaborator, Liz Stack, aim to bridge the gap between what we see of dinosaurs in the media and what science actually says about how they looked and behaved. Although dinosaurs are a lifelong passion for Bellettini, “my entire training and education is in film, video, animation,” he says. He and Stack created the series while working together at the National Science Institute in Grand Rapids, Michigan, continuing on their own after the NSI shuttered in 2018. In each video, Bellettini assesses the anatomical accuracy of toys portraying a dinosaur species. As he corrects the toys’ inaccuracies, Bellettini’s animations display how the creature would have looked in life, according to current science. If there’s a lack of consensus on a detail—such as whether a raptor’s eyes had round or slit pupils—Bellettini presents leading theories. The channel also posts updates and revisions when new findings contradict earlier claims. Bellettini is quick to emphasize that uncovering the truth about dinosaurs is rarely straightforward. “The research process basically never ends,” he says. Toys and portrayals in movies and TV can quickly become outdated, as advances in analytic technology or the discovery of new fossil evidence change our understanding. Bellettini points out the example of the Iguanodon, one of the first dinosaurs ever scientifically described. “We had no idea what a dinosaur was when we first found it,” he says. A full-size model Iguanodon unveiled in 1853—and still on display in the ruins of London’s Crystal Palace—was based on incomplete and jumbled fossil remains. It resembles a sluggish, tail-dragging lizard with a horn on its nose. Today, we know that Iguanodon’s tail and belly did not touch the ground when it walked, and that the horn was actually a misplaced “thumb-spike” from one of its hands. Another dramatic example is the feathers, not scales, now known to have covered the bodies of raptors, as seen in another YouTube channel's animated “update” to a scene from Jurassic Park. (Contrary to its depiction in the film, the infamous Velociraptor was also no bigger than a turkey in real life.) And there are dozens more prehistoric animals that turned out to be “so much weirder than we ever thought,” says Bellettini. Atlas Obscura asked Bellettini about our ever-changing understanding of prehistoric life and whether there’s such a thing as an accurate dinosaur toy. When did paleontology become a part of your life? I do not remember a time when I did not love dinosaurs. I have always been reading about them, I've always been watching the new discoveries, I've always been looking at paleo art. There was definitely a learning curve between being an enthusiast and being an educator, but I get to animate dinosaurs for a living! So, that's the dream. How did your YouTube channel get started? At the Science Center, we had little toy dinosaurs just sitting on windowsills or on top of machinery or whatever. And a thing that I would often do would be to pluck one off of the wall and turn to whoever was closest, which was often Liz, and point out that, “Well, this wouldn't have looked like this.” And Liz has good instincts, and she was thinking, We could point a camera at this and educate people. How do you make your videos accessible to people with different levels of dinosaur knowledge? The main thing, of course, is to avoid jargon. And if I am required to use jargon like osteoderms, I will at least say what that is: The osteoderms are the “skin bones.” Sometimes it's that easy, sometimes it's a little more complicated. Because I am a layman, and I don't come from an academic background, I have a sense of what people might know or not know. I also have the benefit of having Liz editing, who will put a marker for me and say, “Nobody knows what that means.” Besides the wrists, what are some of the most common mistakes in dinosaur toys? You will still see animals dragging their tails. You will still see that old-fashioned, lizard-like, sprawled posture on the front limbs. And it is very, very common to still see animals that we know should be feathered, [depicted] without feathers. Because we use toys specifically as a jumping-off point for discussing anatomy, we're kind of setting ourselves up for success. [There’s] a very long lag time between new research coming out, then being disseminated into the popular consciousness, then being picked up by toy manufacturers. So because of that lag time, there are still tropes that emerged at the very beginning of dinosaurs’ popularity, back in the 19th century, that are still with us. Do toys play a role in spreading misinformation about dinosaurs? I personally think they do. My first engagement with dinosaurs was with my [childhood] toys. And I remember being confused when I started reading about dinosaurs, and the dinosaurs in my books didn't look like my toys. I got slightly mad at it. Like, “How dare you tell me that my things aren't right!” And here I am, telling everybody that their things aren't right. But I think that as a gateway, media—including little toys, but also movies, video games, whatever— has some responsibility for portraying the animals as they were. I had Dollar Store dinosaur toys as a kid where they clearly stuck a head from one animal on a body from another animal, and then put spikes all over it, because they thought it would look cool. And I don't think that that kind of fanciful creature design will ever leave us. I have a problem with it when they then give it the label of an actual animal. If you're going to make up a dinosaur, also make up a name. Are there any toy companies that make an effort to represent dinosaurs accurately? PNSO is kind of the gold standard as far as really trying to keep up with current research, with a price point that reflects this [around $40 to $70, depending on size]. Another company that's making toys that are meant to be played with, but are also accurate, is Beasts of the Mesozoic, though those are also expensive. It's always this push and pull…Do you want to have a product that is responsibly representing the animal? Or do you just want to use those [toy] molds that you already have, that were copied from molds from the ’80s, without updating? Overall, is there a big divide between dinosaurs in the popular consciousness, and what scientists actually know about them? The divide is narrowing in some ways. But there's also this cultural segmentation happening, because dinosaurs as media characters—Tyrannosaurus or raptors as a movie monster—are doing their own thing, independent of whatever the scientists are saying about them. Sometimes people who are really attached to those characters or those aesthetics will encounter what the scientists have been saying and react poorly, the way I did when I was very young. But overall, I think that, especially since I was a kid, there is so much more and better coverage of new discoveries in paleontology than what we had back then. It probably helps that new paleontology discoveries are happening more frequently now. If there is some ambiguity about the actual science, dinosaur books that are responsible will find ways to say, “Well, here is the truth as it is understood presently. Some experts believe this, other experts believe this.” Whereas other kinds of books go for more of a tabloidy tone, like “100 Extreme Dinosaurs!” And I think that the confidence and certainty with which that latter category speaks can be very misleading. Because, especially to laymen, if you're hemming and hawing and saying, “Well, there's evidence that suggests this, but not conclusively, so we're just going to have to be patient,” that comes across as weak, compared to “It was 40 feet long, and it tore chunks out of sauropods with its two-and-a-half meter arms!” Do you have a favorite museum or other place to learn about dinosaurs in person? By default, it's the Field Museum in Chicago, because that's the one that I grew up near and the one that I look forward to visiting. But in terms of the amount of educational content that you can get out of it, another one I'd love to plug is the Museum of the Rockies in Bozeman, Montana. It’s a research museum. They prepare the specimens there, and they do this cool thing where on the display for the specimen, they show citations to whatever papers have been published about it. I have never seen that in a museum before. And they always make a point to credit the people that worked on a particular specimen, or the people that worked on the display, and emphasize the amount of work that goes into it. I'd like to see more of that. This interview has been edited and condensed for length and clarity.",
    "author": "Andrew Coletti",
    "published": "Thu, 06 Feb 2025 15:41:00 -0500",
    "image": "https://assets.atlasobscura.com/article_images/104651/image.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": null
  },
  {
    "id": "a7828977-d7b6-4c22-9543-e7b2adbbe36d",
    "title": "Southwold Sailors’ Reading Room in England",
    "link": "https://www.atlasobscura.com/places/southwold-sailors-reading-room",
    "description": "Built in 1864 by Captain Henry Rous, a naval officer who cared about local sailors’ well-being, the Sailors’ Reading Room was created as a safe space for seamen. At a time when many sailors faced struggles with alcohol and idleness between their voyages, Rous imagined a place where they could come together to read, think, and enjoy positive activities. This building quickly became a welcoming spot for mariners, encouraging healthy choices and learning. Walking inside feels like a step back in time, with wooden paneling, simple furniture, and various maritime artifacts like ship models and navigation tools, all creating a charming atmosphere. Its small size and cozy feel reflect the kind-hearted intent behind its creation, providing sailors with a peaceful escape from the temptations of local bars and other distractions. For today’s visitors, it’s a quiet place perfect for connecting with Southwold’s maritime history. One of the most interesting parts of the Sailors’ Reading Room is its collection of historical items that showcase Southwold’s long connection to the sea. You can see photographs of local fishermen, records of shipwrecks, and pieces of salvaged maritime gear, all telling the stories of the dangers and challenges sailors faced in the North Sea.",
    "author": "",
    "published": "Thu, 06 Feb 2025 15:00:00 -0500",
    "image": "https://img.atlasobscura.com/hg7tcpKdDJIE9tJDWwOvPNJVCAvbuDDFK3hsahw9KMs/rs:fill:300:200:1/g:ce/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9kNmQz/MGFjMC1iZmRmLTQ0/Y2YtODljMi0yMGE3/NGVkNDNjMWFhM2Vm/ZWE2YzFhNmNiYWQ1/NTRfSU1HXzY4MDIu/anBlZw.jpg",
    "source": "https://www.atlasobscura.com/feeds/latest",
    "categories": [
      "museums and collections",
      "peace",
      "navy",
      "sailors"
    ]
  },
  {
    "id": "575ea7d0-920f-4530-93fc-4831004794b9",
    "title": "How U.S.A.I.D. Affects National Parks and Conservation Worldwide",
    "link": "https://www.nytimes.com/2025/02/06/travel/national-parks-tourism-usaid.html",
    "description": "Among the programs affected by the possible freeze of American foreign aid are those that establish and support overseas national parks and conservation areas.",
    "author": "Alexander Wooley",
    "published": "Thu, 06 Feb 2025 22:55:42 +0000",
    "image": "https://static01.nyt.com/images/2025/02/06/multimedia/06usaid-parks1-fgzb/06usaid-parks1-fgzb-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Foreign Aid",
      "Conservation of Resources",
      "Endangered and Extinct Species",
      "Fish and Other Marine Life",
      "National Parks, Monuments and Seashores",
      "Reefs",
      "Environment",
      "United States Agency for International Development",
      "Fish and Wildlife Service",
      "Bhutan",
      "Colombia",
      "Gabon",
      "Gorongosa National Park (Mozambique)",
      "Ghana",
      "Mozambique",
      "Nepal",
      "Papua New Guinea"
    ]
  },
  {
    "id": "fa5faaf6-1d96-46dc-9d5d-2721d30bf258",
    "title": "Some Travelers Capture Their Vacation Memories With Sketching",
    "link": "https://www.nytimes.com/2025/02/04/travel/sketching-watercolors-vacation-hobby.html",
    "description": "Some travelers are picking up a creative pastime, sketching, in order to slow down and fully appreciate their destinations.",
    "author": "Shannon Sims",
    "published": "Tue, 04 Feb 2025 10:01:33 +0000",
    "image": "",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Travel.xml",
    "categories": [
      "Travel and Vacations",
      "Pens and Pencils",
      "Organizations, Societies and Clubs",
      "Urban Areas",
      "internal-reader-callout"
    ]
  },
  {
    "id": "147161e7-8285-426a-b4ba-5b0f7dccbc76",
    "title": "New Trends in Wellness",
    "link": "https://www.livelifetravel.world/new-trends-in-wellness/",
    "description": "The post New Trends in Wellness appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Sun, 12 Jul 2020 13:05:57 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/SFamilySpring2020cover-Family-Mother-Daughter-Cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "96925dd4-c2ba-4ab1-ab3d-81f1c1e619fc",
    "title": "Be a Smart Traveler",
    "link": "https://www.livelifetravel.world/be-a-smart-traveler/",
    "description": "The post Be a Smart Traveler appeared first on Live Life Travel.",
    "author": "Anne Gordon",
    "published": "Fri, 10 Jul 2020 00:39:27 +0000",
    "image": "https://www.livelifetravel.world/wp-content/uploads/2020/07/smart-traveler-cover.jpg",
    "source": "https://www.livelifetravel.world/feed/",
    "categories": [
      "Press"
    ]
  },
  {
    "id": "aaaf9ed8-472b-4129-b676-fa2f219526f6",
    "title": "Saily eSIM Review: A Comprehensive eSIM for Travelers",
    "link": "https://www.nomadicmatt.com/travel-blogs/saily-esim-review/",
    "description": "When I started backpacking almost 20 years ago, there were no smartphones. That meant you had to rely on paper maps, physical guidebooks, and (often outdated) information from random web forums. While it made traveling adventurous, it also made planning a trip very difficult. Fortunately, times have changed. It’s never been easier to access information... The post Saily eSIM Review: A Comprehensive eSIM for Travelers appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Sat, 01 Feb 2025 14:18:16 +0000",
    "image": "https://media.nomadicmatt.com/2025/saily_matt.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Gear",
      "data security",
      "esim"
    ]
  },
  {
    "id": "1c362410-ce22-424f-b5ad-e8d789bbbee2",
    "title": "Hiking in the Footsteps of the Incas",
    "link": "https://www.nomadicmatt.com/travel-blogs/machu-picchu-hike/",
    "description": "When I finally decided to visit Peru, I knew one thing: I wanted to hike with the company that Mark Adams, my friend and fellow travel writer, used for his book Turn Right at Machu Picchu. The stories he shared about his treks and what he learned on them convinced me that those were the... The post Hiking in the Footsteps of the Incas appeared first on Nomadic Matt's Travel Site.",
    "author": "Matthew Kepnes",
    "published": "Mon, 27 Jan 2025 18:04:37 +0000",
    "image": "https://media.nomadicmatt.com/2025/incatrailhikematt.jpeg",
    "source": "https://www.nomadicmatt.com/travel-blog/feed/",
    "categories": [
      "Travel Stories",
      "hiking",
      "machu picchu",
      "peru",
      "South America"
    ]
  }
]
