[
  {
    "id": "63703f0c-753a-4182-a82d-503800abe2c7",
    "title": "Marc Maron Tells Bill Maher: ‘You’re a B—-‘ for Agreeing With ‘Some of the Stuff Trump Is Doing’",
    "link": "https://variety.com/2025/digital/news/marc-maron-bill-maher-agrees-donald-trump-1236337070/",
    "description": "Marc Maron called out Bill Maher on the latest episode of the “WTF” podcast, which featured CNN host W. Kamau Bell as a guest (via The Daily Beast). Maron took issue with the “Real Time” host for being partial to “some of the things” Donald Trump is doing in his second administration as U.S. president. […]",
    "author": "Zack Sharf",
    "published": "Fri, 14 Mar 2025 01:01:30 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/03/maronmaher-split.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Bill Maher",
      "Donald Trump",
      "Marc Maron"
    ]
  },
  {
    "id": "ec89c14e-16eb-4326-bc02-e01a712f27ad",
    "title": "‘Mickey 17’ Production Designer Explains How the Human Printer Works: ‘It Can Look a Bit Like an MRI’",
    "link": "https://variety.com/2025/artisans/news/mickey-17-production-designer-human-printer-1236335678/",
    "description": "SPOILER ALERT: This story contains spoilers for “Mickey 17,” currently playing in theaters. In the near-future space travels of the Bong Joon Ho film, “Mickey 17,” Robert Pattinson plays an Expendable – a person designated to be used for often-fatal scientific experiments and revived through a human printer that makes an exact copy of their […]",
    "author": "Abigail Lee",
    "published": "Fri, 14 Mar 2025 00:55:22 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/03/mickey-17-box-office.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Mickey 17"
    ]
  },
  {
    "id": "0c5b5b1e-b642-4d60-887c-026728cb773a",
    "title": "F1 Sounds Like It Had One Of Most Difficult Film Shoots Of All Time",
    "link": "https://www.slashfilm.com/1809971/f1-most-difficult-film-shoots-of-all-time/",
    "description": "Joseph Kosinski's F1, the new racing movie starring Brad Pitt, had some ridiculous constraints when it came time to actually roll the cameras.",
    "author": "Nick Staniforth",
    "published": "Thu, 13 Mar 2025 22:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/f1-sounds-like-it-had-one-of-most-difficult-film-shoots-of-all-time/l-intro-1741814464.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Action \u0026 Adventure Movies",
      "Thriller Movies"
    ]
  },
  {
    "id": "006aafc2-c186-45ae-883e-3611841c56d6",
    "title": "The Invincible Season 3 Finale Shows Why The MCU Is Failing",
    "link": "https://www.slashfilm.com/1809507/invincible-season-3-finale-marvel-mcu-failing/",
    "description": "Invincible is as good as it's ever been at the end of season 3, so much so that certain Marvel Comics adaptations would do well to study it.",
    "author": "Rick Stevenson",
    "published": "Thu, 13 Mar 2025 21:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-invincible-season-3-finale-shows-why-the-mcu-is-failing/l-intro-1741786458.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Cartoon Shows",
      "Superhero Shows"
    ]
  },
  {
    "id": "ef534074-49ee-4c28-bab1-ec8aa5c63b0d",
    "title": "Barbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Jones",
    "link": "https://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "Barbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Jones Read the full article on AICN Hey friends! Barbarella here to chat about feeling bloated. Wait that’s not right. I’m here to chat a bit about Bloat, which will be in Theaters, On Demand and On Digital March 7, 2025. It’s a new horror thriller in which Ben McKenzie (“Gotham,” “The O.C.”) plays Jack, a man stuck working while his family vacations in Japan. As if the FOMO isn’t bad enough, one of his sons starts behaving strangely after almost drowning, and his wife, played by Bojana Novakovic (Edge of Darkness, Drag Me to Hell), must grapple with everything essentially alone, while Jack grows increasingly frustrated with his inability to do anything more than bear witness and offer recommendations and theories.  Bloat proves to be pretty fun, generating some tension from the fact that poor Jack is stuck in front of a screen in another country, balancing work and family drama from afar. His sense of powerlessness and the increasing frustration that develops as he video-chats with his family and hears increasingly more unsettling news makes him relatable and really heightens the unease I feel while watching. While the final act doesn't engage me as much as the setup leading up to it, I enjoy enough of the concepts within the story that overall, I like the movie.  I got the opportunity to chat with the actors who play the two sons, Malcolm Fuller and Sawyer Jones. Check it out! Barbara: Would you guys tell me about the casting process. Did you get sent the script or did you have to audition? What was that like Finish the article on AICN",
    "author": "Barbarella",
    "published": "Fri, 07 Mar 2025 16:22:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "8c0be0f6-fa28-4521-bfe1-fc41526be20a",
    "title": "Director Simon West and Star Lucy Liu Talk OLD GUY",
    "link": "https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Director Simon West and star Lucy Liu talk OLD GUY, starring Christoph Waltz, now streaming everywhere! Read the full article on AICN Director Simon West should be a household name; his first film was a little picture from 1997 called CON AIR. Perhaps you've heard of it? He went on to helm similar big budget action extravaganzas, such as 2001's LARA CROFT: TOMB RAIDER and 2012's THE EXPENDABLES 2. Eventually, however, time and changing tastes caught up with West, and now he's directing smaller budget flicks, from action to drama, that move at a slightly slower pace and appeal to a different audience.  The same could be said for Danny Dolinski, the titular OLD GUY of West's latest feature, played by Academy-Award Winner Christoph Waltz (INGLORIOUS BASTERDS, THE GREEN HORNET). Danny's a wetworks expert in a field saturated with hot young assassins, desperately trying to prove he's still relevant, often to his detriment. After recovering from a wrist injury that found him relegated to a cleaner role at a local bakery, Danny is itching to get back in the field. When he's told the only role available is support for young assassing Wihlborg (Cooper Hoffman), he is understandably unenthused. He invites his longtime friend Anata (Lucy Liu) along for their job since it'll take them to some charming locations around Europe, and once underway, tries to take point on every hit. Things don't go as planned. As you can probably already divine, there are so many parallels between Waltz's OLD GUY and West's career. Danny was once the best, the biggest game in town, and his name still opens doors... but the game has Finish the article on AICN",
    "author": "McEric",
    "published": "Wed, 26 Feb 2025 20:15:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "cc587dce-03bf-4f87-977f-c54b9de81861",
    "title": "Movie Awards Season 2025: Who’s Coming Back For More?",
    "link": "https://deadline.com/2025/03/movie-awards-season-2025-timothee-chalamet-zoe-saldana-1236324192/",
    "description": "With movie awards season over, and rumors that Adrian Brody’s Oscar acceptance speech is finally coming to an end, the year 2025 sees a surprising amount of faces coming straight back into the conversation. For one, Zoe Saldaña will be putting her Supporting Actress Oscar to good use on the publicity trail for one of […]",
    "author": "Damon Wise",
    "published": "Fri, 14 Mar 2025 01:00:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/Awards-Season-2025-Whos-Coming-Back-For-More.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Brady Corbet",
      "comingup",
      "Daniel Craig",
      "Edward Berger",
      "June Squibb",
      "Sean Baker",
      "Timothee Chalamet",
      "Yorgos Lanthimos",
      "Zoe Saldaña"
    ]
  },
  {
    "id": "3fa1a6ef-2cd2-4b02-a359-d6a1394fd62a",
    "title": "‘Ghosts’ Star Rebecca Wisocky On How Hetty’s Power Relates To Her Need To Feel Understood",
    "link": "https://deadline.com/2025/03/ghosts-rebecca-wisocky-interview-hetty-power-1236324614/",
    "description": "SPOILER ALERT! This post contains details from Thursday night’s episode of Ghosts. Yet another ghost in Woodstone Mansion has discovered their power. Thursday night’s episode of CBS’ Ghosts, aptly titled “St. Hetty’s Day,” reveals that the Gilded Age aristocrat’s power is tied directly to her Irish ancestry. As it turns out, Hetty has quite a […]",
    "author": "Katie Campione",
    "published": "Fri, 14 Mar 2025 01:00:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/Ghosts_416_SG_0002bc-1d1eef7aecb1bed7.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "CBS",
      "Ghosts",
      "Rebecca Wisocky",
      "TV News"
    ]
  },
  {
    "id": "81146fce-47b2-4814-a455-9d31c6bc9d2a",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "6100eebc-72da-43cc-8311-56b61451d95f",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "130711e4-2d77-4962-a632-61d31c8ea7fc",
    "title": "Novocaine Post-Credits: Is There a Scene at the End?",
    "link": "https://www.comingsoon.net/guides/news/1935867-novocaine-post-credits-scene-end-mid-after",
    "description": "Does Novocaine (2025) have a post-credits scene? Read on to find out! The post Novocaine Post-Credits: Is There a Scene at the End? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Ayesha Zafar",
    "published": "Fri, 14 Mar 2025 01:00:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/Novocaine-Box-Office-Prediction-How-Much-Is-It-Predicted-to-Make.jpg.webp?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "Entertainment FAQ",
      "Novocaine"
    ]
  },
  {
    "id": "44f2558a-95f5-4dfc-8423-751070f69997",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for March 10-14, 2025",
    "link": "https://www.comingsoon.net/guides/features/1935386-wheel-of-fortune-bonus-puzzle-march-10-14-2025-today-answer-tonight",
    "description": "The WoF answers from March 10 to 14. The post Wheel of Fortune Bonus Puzzle Answer Today for March 10-14, 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Fri, 14 Mar 2025 00:15:20 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/wheel-of-fortune-bonus-puzzle-answer-tonight-today-march-2025-10-14.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "Explainer",
      "Game Show",
      "Ryan Seacrest",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "c0b01b8a-7144-4862-87ee-3ed289af13db",
    "title": "Explaining ‘The Substance’ Academy Awards Dispute Over the Recipients of the Hair and Makeup Oscar",
    "link": "https://www.indiewire.com/features/craft/the-substance-academy-award-hair-makeup-dispute-1235103642/",
    "description": "Two hair artists contributed to the Demi Moore film, but only one of them was nominated for an Oscar.",
    "author": "Sarah Shachat",
    "published": "Fri, 14 Mar 2025 00:59:51 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Craft | Technology, Sound and Set Design",
      "Features",
      "Demi Moore",
      "Oscars",
      "Oscars 2025",
      "The Substance"
    ]
  },
  {
    "id": "6e18c775-deaf-44d9-9247-60e7f47a825a",
    "title": "What Does It Take to Make a CG Shark from Scratch?",
    "link": "https://www.indiewire.com/features/craft/shark-attack-vfx-tv-1235103540/",
    "description": "ABC's \"Doctor Odyssey\" is the latest show to weather a shark – and orca! — attack, so IndieWire hunted down exactly how they summoned the terrors of the briny deep.",
    "author": "Sarah Shachat",
    "published": "Thu, 13 Mar 2025 23:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Craft | Technology, Sound and Set Design",
      "Features",
      "ABC",
      "Doctor Odyssey",
      "Top of the Line",
      "TV",
      "Visual Effects"
    ]
  },
  {
    "id": "3ee8c8e9-7620-4920-a87d-d508753a224b",
    "title": "Paul Walter Hauser Wins Big in 'The Luckiest Man in America' Trailer",
    "link": "https://www.firstshowing.net/2025/paul-walter-hauser-wins-big-in-the-luckiest-man-in-america-trailer/",
    "description": "\"We have a problem... Somebody didn't vet this guy.\" IFC FIlms has unveiled an official trailer for an indie thriller based on a true story from the 1980s called The Luckiest Man In America, the second feature directed by filmmaker Samir Oliveros. This premiered at the 2024 Toronto Film Festival last year and will debut in US theaters this April. Go behind the scenes of the most infamous episode in game show history, as an ice cream truck driver harboring a powerful secret charms his way onto the game show Press Your Luck on CBS. The Luckiest Man In America is set in May of 1984. An unemployed ice cream truck driver steps onto the game show Press Your Luck harboring a secret: the key to endless money. But his winning streak is threatened when the bewildered executives uncover his real motivations. Starring Paul Walter Hauser as Michael Larson, with Walton Goggins, Shamier Anderson, David Strathairn, Maisie Williams, Patti Harrison, Brian Geraghty, Haley Bennett, and Johnny Knoxville. Reminds me of last year's game show thriller Woman of the Hour, but there's something else going on in here... There's a whole long Wikipedia about how he pulled off his tricks if […]",
    "author": "Alex Billington",
    "published": "Thu, 13 Mar 2025 21:42:20 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/pressyourlockbuttonmainmigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "f4f813b1-e5be-436f-8926-5accd57cee13",
    "title": "Beautiful Music Doc 'Mogwai: If the Stars Had a Sound' Official Trailer",
    "link": "https://www.firstshowing.net/2025/beautiful-music-doc-mogwai-if-the-stars-had-a-sound-official-trailer/",
    "description": "\"It's basically the soundtrack of my life.\" Greenwich Ent. has unveiled the official trailer for a vibrant and inspiring music documentary film titled Mogwai: If the Stars Had a Sound, arriving to watch in April. This first premiered at the 2024 SXSW Film Festival last year and it arrives for release in a few weeks. Yep it's about the terrific band Mogwai, but it's not a concert doc, it's about their entire success. Over 25 years and 10 studio albums—using powerful sonic force mixed with subtlety \u0026 grace—Mogwai have defined their own musical genre and built a cult following. The film takes us on a journey from their very beginnings, in the mid 1990s, to creating their 10th studio album (which is titled \"As The Love Continues\") in 2020 in their hometown of Glasgow. While at first seemingly impossible to make, they ultimately made history. Director Antony Crook, acclaimed photographer, director \u0026 long term Mogwai collaborator, takes us on a journey into the inner workings and the community around this cult Scottish band. This looks like it is much more than just a music biopic, showing how their music connects with the community and their home of Scotland. Here's the […]",
    "author": "Alex Billington",
    "published": "Thu, 13 Mar 2025 20:30:22 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/MogwaiDocPostermainimgbigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "6ed81dcb-0d40-4a28-bd90-959969f3b6ab",
    "title": "F1: Official Trailer, Poster, And Images Tease A Clash Of Generations",
    "link": "https://bleedingcool.com/movies/f1-official-trailer-poster-and-images-tease-a-clash-of-generations/",
    "description": "Warner Bros. and Apple Films have released the trailer, poster, image, and a behind-the-scenes image from F1, which will be released on June 27, 2025.",
    "author": "Kaitlyn Booth",
    "published": "Thu, 13 Mar 2025 19:47:06 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Warner Bros",
      "F1"
    ]
  },
  {
    "id": "724cfc18-be39-4bc8-b293-def3f121afb9",
    "title": "Sinners: New Poster For Ryan Coogler's New Film Released",
    "link": "https://bleedingcool.com/movies/sinners-new-poster-for-ryan-cooglers-new-film-released/",
    "description": "Warner Bros. has released a new poster and TV spot for Ryan Coogler's new film Sinners, which will be released on April 18, 2025.",
    "author": "Kaitlyn Booth",
    "published": "Thu, 13 Mar 2025 14:28:06 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Warner Bros",
      "sinners"
    ]
  }
]
