[
  {
    "id": "13569701-ed89-4108-974d-70c4f2fa0ff5",
    "title": "Daniel Craig Says He Couldn’t Have Played ‘Queer’ Role During James Bond Run: ‘It Would Look Reactionary’",
    "link": "https://variety.com/2024/film/news/daniel-craig-could-not-play-queer-role-james-bond-1236242829/",
    "description": "Daniel Craig said in a recent interview with the U.K.’s Sunday Times that he couldn’t have played his character in Luca Guadagnino’s “Queer” while working on James Bond movies. In the film “Queer,” based on the 1985 semi-autobiographical novella of the same name by William S. Burroughs, Craig plays William Lee, an American expat who […]",
    "author": "Michaela Zee",
    "published": "Mon, 09 Dec 2024 00:54:15 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/12/MCDQUEE_EC133-1.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Daniel Craig",
      "James Bond",
      "Queer"
    ]
  },
  {
    "id": "1f34a7df-0ac1-429e-bbde-5f4e4761f987",
    "title": "Jay-Z Named With Sean ‘Diddy’ Combs in Sexual Assault Lawsuit; Jay-Z Calls Claims ‘Idiotic’ in Fiery Response",
    "link": "https://variety.com/2024/music/news/jay-z-named-with-sean-diddy-combs-sexual-assault-lawsuit-1236242857/",
    "description": "Jay-Z, aka Shawn Carter, was accused Sunday in a civil lawsuit of raping a 13-year-old girl in 2000 with Sean “Diddy” Combs. The lawsuit, which was first filed back in October, had originally listed Combs as the defendant. It has since been refiled to name Carter as well. The accusation comes from an anonymous “Jane […]",
    "author": "Jack Dunn",
    "published": "Mon, 09 Dec 2024 00:29:38 +0000",
    "image": "https://variety.com/wp-content/uploads/2023/10/Screenshot-2023-10-23-at-1.39.09-PM-e1698082780359.png",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Jay-Z",
      "Sean Diddy Combs"
    ]
  },
  {
    "id": "c3d473b6-6104-4305-926b-5127c5fb5e0a",
    "title": "From the World of John Wick: Ballerina – CCXP Extended BTS Look",
    "link": "https://bleedingcool.com/movies/from-the-world-of-john-wick-ballerina-ccxp-extended-bts-look/",
    "description": "Lionsgate has released an extended behind-the-scenes look at From The World of John Wick: Ballerina, which will be released on June 6, 2025.",
    "author": "Kaitlyn Booth",
    "published": "Sun, 08 Dec 2024 17:22:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Lionsgate",
      "Movies",
      "Ballerina",
      "From The World of John Wick: Ballerina",
      "john wick"
    ]
  },
  {
    "id": "c255d655-4b68-40b0-9684-dc1dc7ba4464",
    "title": "The People's Joker: Now Streaming on Mubi",
    "link": "https://bleedingcool.com/movies/the-peoples-joker-now-streaming-on-mubi/",
    "description": "The People's Joker, Vera Drew's award-winning transgressive indie satire and highly personal take on pop culture is now streaming on Mubi",
    "author": "Adi Tantimedh",
    "published": "Sun, 08 Dec 2024 16:57:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Streaming",
      "indie movies",
      "LGBTQ",
      "MUBI",
      "streaming",
      "The People's Joker",
      "Vera Drew"
    ]
  },
  {
    "id": "68e37e1b-5753-4d8b-b89b-5dd25c7d9359",
    "title": "Which Jedi Master Trained Yoda? Everything We Know From Star Wars Lore",
    "link": "https://www.slashfilm.com/1725262/yoda-jedi-master-star-wars-lore-explained/",
    "description": "Yoda's backstory has long been one of the biggest mysteries in Star Wars. Here's what we know for certain about the Jedi Master and his past.",
    "author": "Bryan Young",
    "published": "Sun, 08 Dec 2024 23:45:28 +0000",
    "image": "https://www.slashfilm.com/img/gallery/which-jedi-master-trained-yoda-everything-we-know-from-star-wars-lore/l-intro-1732814000.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Fantasy Movies",
      "Science Fiction Movies"
    ]
  },
  {
    "id": "50505a10-ac93-4589-925b-25af24c259cd",
    "title": "Why Al Pacino Thought That Francis Ford Coppola Would Fire Him From The Godfather",
    "link": "https://www.slashfilm.com/1717259/al-pacino-francis-ford-coppola-the-godfather-firing/",
    "description": "When Francis Ford Coppola made it clear Al Pacino was at risk of being fired from The Godfather, the actor did his part to ensure that didn't happen.",
    "author": "Nick Staniforth",
    "published": "Sun, 08 Dec 2024 22:45:12 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-al-pacino-thought-that-francis-ford-coppola-would-fire-him-from-the-godfather/l-intro-1732037332.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Movies"
    ]
  },
  {
    "id": "61dd514a-cefd-4642-ab5d-824576a26e7d",
    "title": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!",
    "link": "https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren! Read the full article on AICN Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death.  Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both! Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Finish the article on AICN",
    "author": "Barbarella",
    "published": "Fri, 06 Dec 2024 12:45:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "ead3c70a-c98f-4e84-a732-c9ac38237945",
    "title": "Tim Sheridan - Creator Interview",
    "link": "https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comics",
    "description": "Tim Sheridan chats about Alan Scott: Green Lantern, Superman: Man of Tomorrow, Batman: The Long Halloween, and adapting legacy stories to small and large screens. Read the full article on AICN When I got into this racket over six years ago, I did so as a fan. In fact, it was a passing text exchange with a friend about the movie A QUIET PLACE that ended with “Hey, do you want to write about movies for a website?” Flash forward, here I am, having interviewed over a hundred creatives in my time with this site and others. Typically, I’ll get an email from a PR firm asking if I want to screen a film and speak with attached talent or read a book and speak with the author. I rarely say no as I firmly believe that everyone is worth talking to and every person you come in contact with can teach you something that you might not learn in your own sphere of social contacts or experiences.   This interview is different. This subject I hunted down. I saw that he was going to be at New York Comic Con this year signing books in Artist Alley, and I’d already interacted with him briefly on Twitter (back when it was Twitter) so I felt I could swing over and say hello. I did, and of course he had some fans in front of him when I arrived so I decided to hang back and let them have their moment. Watching him interact with these fans confirmed everything I believed about this writer - he couldn’t be any nicer, any more accommodating, or any more grateful for the people who celebrate his art. Finish the article on AICN",
    "author": "McEric",
    "published": "Sat, 30 Nov 2024 08:54:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "3e1a27aa-7c68-4e40-b28e-5795bf2c7b38",
    "title": "Zachary Levi Says His Support For Donald Trump Hasn’t Cost Him Jobs In Hollywood",
    "link": "https://deadline.com/2024/12/zachary-levi-says-support-for-donald-trump-hasnt-cost-him-jobs-1236197953/",
    "description": "If Zachary Levi has been canceled in Hollywood for supporting Donald Trump, no one has told him. While appearing on Bill Maher’s Club Random podcast, the host asked the Shazam! actor if he got canceled for leaning right in the election. “No,” Levi told him. “For coming out and voting for Trump? I mean, listen, […]",
    "author": "Lynette Rice",
    "published": "Mon, 09 Dec 2024 00:47:27 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/01/Current-Headshot-by-John-Russo.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Zachary Levi"
    ]
  },
  {
    "id": "a3681d76-21c1-422e-9494-10f9340509e3",
    "title": "Jay-Z Accused Of Rape In Refiling Of Sean Diddy Combs Civil Lawsuit: Report",
    "link": "https://deadline.com/2024/12/jay-z-accused-of-rape-refiling-of-sean-diddy-combs-civil-lawsuit-nbc-news-1236197944/",
    "description": "UPDATED: Jay-Z has issued a statement after his name was added in a civil lawsuit that accuses both the rapper and Sean “Diddy” Combs of allegedly raping a 13-year-old girl in 2000. According to a NBC News report, the lawsuit filed by the Texas-based Tony Buzbee was originally filed in October in the Southern District […]",
    "author": "Lynette Rice",
    "published": "Mon, 09 Dec 2024 00:21:33 +0000",
    "image": "https://deadline.com/wp-content/uploads/2023/07/GettyImages-1346486908.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Legal",
      "Jay-Z"
    ]
  },
  {
    "id": "4cb8c37c-a910-4904-9d6b-4baf807e4237",
    "title": "Netflix’s Mary Ending Explained: What Happens to Mary?",
    "link": "https://www.comingsoon.net/guides/news/1890040-netflix-mary-2024-ending-explained-spoilers-jesus-herod",
    "description": "Mary is an epic biblical movie currently streaming on Netflix, and viewers are curious to know what happens in the film at the end. The story revolves around Mary (Noa Cohen), a young Jewish girl born with a grand destiny. She must overcome incredible adversities to be the harbinger of humanity’s salvation. Meanwhile, the elderly […] The post Netflix’s Mary Ending Explained: What Happens to Mary? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Tamal Kundu",
    "published": "Sun, 08 Dec 2024 20:12:11 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/12/MixCollage-09-Dec-2024-01-36-AM-5807.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "Mary"
    ]
  },
  {
    "id": "e5dd2fab-73c2-4520-ba44-a5e056ed0958",
    "title": "Where is Taylor Swift Today, December 8? When is Her Next Show?",
    "link": "https://www.comingsoon.net/guides/news/1889894-where-is-taylor-swift-today-december-8-concert-playing",
    "description": "As Taylor Swift wraps up the final stretch of her Eras Tour, fans are eagerly awaiting her next performance. After dazzling audiences across different countries, the excitement continues to grow as she prepares for her next show. Today, Swift’s followers are curious about her whereabouts and what’s next in this highly anticipated. In this article, […] The post Where is Taylor Swift Today, December 8? When is Her Next Show? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Disheeta Maheshwari",
    "published": "Sun, 08 Dec 2024 09:00:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/12/Where-is-Taylor-Swift-Today-December-8-When-is-Her-Next-Show.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Pop Culture",
      "Taylor Swift"
    ]
  },
  {
    "id": "a1d997ef-c8cb-410b-a799-ebbe02462fc2",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "b2f722cc-9172-45a3-b485-b18ef6a76454",
    "title": "A Dog Named ‘Fluke’ Talks His Way Into Our Pick of the Week",
    "link": "https://filmschoolrejects.com/fluke-bluray-review/",
    "description": "Plus 12 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 22 Oct 2024 05:54:02 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "3f4a4a15-5c5b-49c9-8756-88928da99eb6",
    "title": "Badass Preview for 'Ballerina' Action Spin-Off Starring Ana de Armas",
    "link": "https://www.firstshowing.net/2024/badass-preview-for-ballerina-action-spin-off-starring-ana-de-armas/",
    "description": "\"You have no idea what you just walked into...\" Lionsgate has launched a new promo trailer for the action spin-off titled Ballerina, the next John Wick movie that's not actually a John Wick movie. This new promo comes direct from CCXP in São Paulo - featuring behind-the-scenes footage in addition to some awesome movie footage. Ana de Armas stars as Eve, an assassin trained in the traditions of the Ruska Roma getting revenge hunting the murderers of her family. The same character was previously portrayed by Unity Phelan in 2019's John Wick: Chapter 3 – Parabellum and this takes place before Chapter 4. The superb supporting cast includes Ian McShane, Anjelica Huston, Keanu Reeves, Gabriel Byrne, Catalina Sandino Moreno, and Norman Reedus. With an appearance by Lance Reddick shot before he passed away. This is much better than the first trailer a few months ago, presenting a better look at what hopefully going to be a properly a kick ass action movie. The flamethrower bit actually looks badass, most of the fights seem legit. Second trailer (+ poster) for Len Wiseman's From the World of John Wick: Ballerina, via YouTube: You can watch the first official trailer for Len Wiseman's […]",
    "author": "Alex Billington",
    "published": "Sun, 08 Dec 2024 23:12:21 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/BallerinaPinkMainbigimgpostTsr2.jpg?quality=96",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "fde811b5-adbf-4f22-89ce-26516f24580e",
    "title": "Second Trailer for 'Culpa Tuya' - Spanish Romantic Thriller 'Your Fault'",
    "link": "https://www.firstshowing.net/2024/second-trailer-for-culpa-tuya-spanish-romantic-thriller-your-fault/",
    "description": "\"You don't trust me, and I don't trust you!\" Prime Video has debuted the second official trailer for the next romantic thriller from Spain called Your Fault, a sequel to My Fault from 2023. Ready to debut steaming streaming later this month - available on Prime Video worldwide. Culpa Tuya (the Spanish title) is a follow-up to My Fault featuring the same cast and same filmmaker, continuing with more romantic turbulence as they try to keep their love strong. The first film is also known by the term Culpables. Despite their parents' efforts to separate them, Noah \u0026 Nick's love seems unbreakable. However, work \u0026 college open their lives to new relationships. \"When so many people are out to destroy a love story, can it really end well?\" Only in the movies is their a good answer - though not always. Culpa Tuya brings back Nicole Wallace and Gabriel Guevara as Noah \u0026 Nick, with Marta Hazas, Iván Sánchez, Victor Varona, and Eva Ruiz. Along with Goya Toledo, Gabriela Andrada, Álex Béjar, Javier Morgade, and Felipe Londoño. This looks like Spain's 50 Shades of Grey mixed with Fast \u0026 Furious this time - adding in some car racing because why […]",
    "author": "Alex Billington",
    "published": "Sun, 08 Dec 2024 18:22:21 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/CulpaTuyaPosterfinalmainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "0c788b72-8190-4bab-beb6-363c87e79fa4",
    "title": "Why and How Luca Guadagnino Shot ‘Queer’ Almost Entirely on a Soundstage",
    "link": "https://www.indiewire.com/features/interviews/queer-behind-the-scenes-shot-on-soundstage-1235073083/",
    "description": "To capture the feel of a Powell and Pressburger fantasy, the director hired a first-time production designer and shot all but one scene at Cinecittà studios in Rome.",
    "author": "Jason Gonzalez",
    "published": "Sun, 08 Dec 2024 23:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Features",
      "Interviews | Celebrity Interviews \u0026 Insider Takes",
      "Daniel Craig",
      "Filmmaker Toolkit Podcast",
      "Luca Guadagnino",
      "Powell and Pressburger",
      "Queer"
    ]
  },
  {
    "id": "bfd31c41-0b3b-4794-9d0f-f258d1cc8963",
    "title": "‘Kneecap’ Smashes 2024 British Independent Film Awards — Winners List",
    "link": "https://www.indiewire.com/awards/results/kneecap-2024-british-independent-film-awards-winners-1235073896/",
    "description": "The Irish hip-hop dramedy led with 14 nominations and 7 wins.",
    "author": "Harrison Richlin",
    "published": "Sun, 08 Dec 2024 22:21:58 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Awards",
      "Results",
      "British Independent Film Awards",
      "Film",
      "Kneecap"
    ]
  }
]
