[
  {
    "id": "256c6dd9-ae19-45de-8bde-3faac25ae696",
    "title": "Joe Locke Says He’s ‘Ready to Go Back to Work’ and Stephen Fry Praises Rising Talent at Newport Beach Film Festival UK and IE Honours",
    "link": "https://variety.com/2025/film/news/newport-beach-film-festival-uk-ie-honours-joe-locke-1236308146/",
    "description": "The best and brightest of the U.K. and Ireland were celebrated last night in a star-studded bash at the Newport Beach Film Festival UK \u0026 IE Honours event in London. Those receiving honors included Icon Award honoree Stephen Fry, “Nosferatu” and Artist of Distinction honorees Emma Corrin, Sharon Horgan and Felicity Jones. Before receiving her […]",
    "author": "Jenelleriley2",
    "published": "Sat, 15 Feb 2025 00:50:53 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/Joe-Locke257-e1739556116286.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Events",
      "News",
      "Joe Alwyn",
      "joe locke",
      "Newport Beach Film Festival U.K. Honors"
    ]
  },
  {
    "id": "8dad5ad6-7046-4b64-9006-4fde63b5458a",
    "title": "Television Publicity Executives Committee Announces 2025 Leadership Team (EXCLUSIVE)",
    "link": "https://variety.com/2025/tv/news/television-publicity-executives-committee-announces-leadership-1236308707/",
    "description": "Executives from Disney Branded Television, Crunchyroll, Hallmark Media and more have been announced as part of the Television Publicity Executives Committee’s 2025 leadership team, Variety has exclusively learned. Wendy Zocks, founder of Wendy Zocks Public Relations, made the announcement and is remaining in her role for another year. The TPEC team includes Beck Media \u0026 […]",
    "author": "Matthew Minton",
    "published": "Sat, 15 Feb 2025 00:30:53 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/MixCollage-14-Feb-2025-03-57-PM-7180.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Crunchyroll",
      "Disney Branded Television",
      "Hallmark Media",
      "Television Publicity Executives Committee"
    ]
  },
  {
    "id": "c2b6fa2a-2f9c-44ea-8ae4-3fd729ed2787",
    "title": "The Seven Euphoria Stars Who Won't Return For Season 3",
    "link": "https://www.slashfilm.com/1790665/euphoria-season-3-stars-not-returning/",
    "description": "Euphoria season 3 is finally underway, but due to a variety of circumstances, here are seven cast members who won't be returning to the HBO drama.",
    "author": "BJ Colangelo",
    "published": "Fri, 14 Feb 2025 23:06:05 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-seven-euphoria-stars-who-wont-return-for-season-3/l-intro-1739574221.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows"
    ]
  },
  {
    "id": "2848feba-edf0-4c16-ac52-09efd1b116d9",
    "title": "Why Jeri Ryan Rejected A Cameo In One Of The Worst Star Trek Films",
    "link": "https://www.slashfilm.com/1783288/why-jeri-ryan-rejected-star-trek-nemesis-cameo/",
    "description": "Jeri Ryan's Seven of Nine could've appeared in Star Trek: Nemesis, but the actor had a few good reasons to turn that offer down.",
    "author": "Witney Seibold",
    "published": "Fri, 14 Feb 2025 23:00:54 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-jeri-ryan-rejected-a-cameo-in-one-of-the-worst-star-trek-films/l-intro-1738941945.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Science Fiction Movies",
      "Science Fiction Shows",
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "45a7c056-4960-4bca-b70c-3486b740c0fc",
    "title": "Berlin Film Festival 2025: All Of Deadline’s Movie Reviews",
    "link": "https://deadline.com/2025/02/berlin-film-festival-2025-movie-reviews-1236287048/",
    "description": "The Berlin Film Festival kicked off its 75th anniversary edition February 13 with the opening-night world premiere screening of The Light, Tom Tykwer’s politically charged film that takes stock of German society in the first quarter of the 21st century. It starts 11 days of debuts including for movies starring Jessica Chastain, Ethan Hawke, Margaret Qualley, […]",
    "author": "Erik Pedersen",
    "published": "Sat, 15 Feb 2025 01:01:27 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/Berlin-Film-Festival-Reviews.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Festivals",
      "News",
      "Reviews",
      "Berlin",
      "Berlin Film Festival"
    ]
  },
  {
    "id": "373a80ed-ca56-471c-a14e-0689f752987e",
    "title": "How To Watch The ‘SNL50’ Anniversary Concert And Three-Hour Special This Weekend",
    "link": "https://deadline.com/feature/how-to-watch-snl-50-anniversary-programming-online-1236290251/",
    "description": "Valentine’s Day and President’s Day weekend marks the official celebration of Saturday Night Live’s landmark 50th season with an anniversary concert taking place Friday evening and a three-hour special episode airing Sunday, Feb 16. Find more details on how to watch the SNL anniversary concert and how to watch the SNL 50th anniversary show below: […]",
    "author": "Dessi Gomez",
    "published": "Sat, 15 Feb 2025 00:41:42 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/12/snl-50-special.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Culture",
      "News",
      "Saturday Night Live",
      "SNL",
      "SNL50: The Anniversary Special",
      "SNL50: The Homecoming Concert"
    ]
  },
  {
    "id": "a53ee8ad-28d8-44ec-a84b-e1b89b7888c8",
    "title": "THE THINKING GAME Stream this Friday",
    "link": "https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME Read the full article on AICN It’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world. Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.   Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents.    During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.   For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat Finish the article on AICN",
    "author": "McEric",
    "published": "Thu, 06 Feb 2025 01:26:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "cea72a2e-7f86-479e-b518-cd738a35d23d",
    "title": "Sundance Midnight Selection TOUCH ME",
    "link": "https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME Read the full article on AICN The Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads: Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world. TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too. I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 21 Jan 2025 04:16:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "49a5cf65-d3fe-4608-a77c-f6fbb406ca7c",
    "title": "Clayface Gets Director Update, Story Details for DCU Movie Revealed",
    "link": "https://www.comingsoon.net/movies/news/1922452-clayface-director-update-first-story-details-for-dcu-movie",
    "description": "A new update on DC’s Clayface movie is out courtesy of The Hollywood Reporter’s Heat Vision newsletter, offering up new information on the search for a director, and what the movie will be about. What’s the latest update on the Clayface movie? In the latest edition of the newsletter, Aaron Couch and Borys Kit note that Jeff […] The post Clayface Gets Director Update, Story Details for DCU Movie Revealed appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Fri, 14 Feb 2025 22:59:57 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/clayface-batman-the-animated-series-still-screenshot.png?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Clayface",
      "DC",
      "DC Studios",
      "DC Universe",
      "J.A. Bayona",
      "James Gunn",
      "James Watkins",
      "Jeff Wadlow",
      "Mike Flanagan",
      "Movie News",
      "Warner Bros.",
      "Warner Bros. Discovery"
    ]
  },
  {
    "id": "560570bc-66a0-495d-b66b-f948b9f82153",
    "title": "Cobra Kai Interview: Co-Creator Jon Hurwitz Discusses Johnny Lawrence’s Big Karate Moment",
    "link": "https://www.comingsoon.net/tv/features/1917370-cobra-kai-interview-johnny-lawrence-jon-hurwitz",
    "description": "ComingSoon Senior Editor Brandon Schreur participated in a roundtable interview with Cobra Kai creators Josh Heald, Jon Hurwitz, and Hayden Schlossberg. They discussed the final batch of Cobra Kai episodes and Johnny Lawrence’s big moment during the final episode. “After a shocking result in the Sekai Taikai, Miyagi-Do, and Cobra Kai must reckon with their pasts while facing […] The post Cobra Kai Interview: Co-Creator Jon Hurwitz Discusses Johnny Lawrence’s Big Karate Moment appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Brandon Schreur",
    "published": "Fri, 14 Feb 2025 22:29:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/download-2025-02-06T135931.314.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "TV",
      "Cobra Kai",
      "Jon Hurwitz",
      "TV Features"
    ]
  },
  {
    "id": "c3060462-85be-4e13-bc87-cb240a9fe8df",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "9db043bf-1988-4fef-ad10-07c9ebc87121",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "412af397-2d72-44a3-a6e3-51927e8ec4f5",
    "title": "The 6 Films That Inspired ‘The Substance’",
    "link": "https://www.indiewire.com/features/podcast/the-substance-films-influenced-coralie-fargeat-1235084591/",
    "description": "Coralie Fargeat tells IndieWire how films by Stanley Kubrick, David Lynch, David Cronenberg, the Coen brothers, John Carpenter, and Darren Aronofsky left their imprint on her and \"The Substance.\"",
    "author": "Chris O'Falt",
    "published": "Sat, 15 Feb 2025 00:10:16 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Features",
      "Podcast",
      "Coralie Fargeat",
      "David Lynch",
      "Film",
      "Filmmaker Toolkit Podcast",
      "Stanley Kubrick",
      "The Substance"
    ]
  },
  {
    "id": "59bbc4a7-78a3-4543-9cb2-1cfcf640ab64",
    "title": "The Marvel Cinematic Universe Is Still Really Struggling with This Multiverse Thing",
    "link": "https://www.indiewire.com/features/commentary/captain-america-brave-new-world-post-credits-scene-multiverse-issue-1235094620/",
    "description": "Spoilers: Twelve films into the supposed \"Multiverse Saga,\" and the superhero franchise seems to be relying on its audience to forget everything that's come before to sell what's next.",
    "author": "Kate Erbland",
    "published": "Fri, 14 Feb 2025 23:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Commentary",
      "Features",
      "Captain America: Brave New World",
      "Film",
      "Marvel Cinematic Universe",
      "MCU"
    ]
  },
  {
    "id": "e0f2a846-14e6-41c9-aeb5-24cea59b22f7",
    "title": "Samara Weaving \u0026 Ray Nicholson in 'Borderline' Home Invasion Trailer",
    "link": "https://www.firstshowing.net/2025/samara-weaving-ray-nicholson-in-borderline-home-invasion-trailer/",
    "description": "\"We're getting married?!\" Uh oh. Magnet Releasing has unveiled an official trailer for a home invasion thriller titled Borderline, marking the feature directorial debut of Cocaine Bear writer Jimmy Warden. Strangely this hasn't played at any film festivals or elsewhere, as far as we know. Magnet is dropping this in theaters in March in a month from now. The premise is a bit like Misery but with an intriguing psychopathic patriarchal twist. Borderline is an edge-of-your-seat thriller that follows a dangerously persistent stalker who invades the home of a '90s pop superstar with grand delusions of a wedding. With her life on the line and help from her loyal bodyguard, she must escape the stalker’s sinister grip before they tie the knot. Paul is desperate to prove his dedication but Sofia's just trying to survive the night... How will she make it out?! Starring Samara Weaving, Ray Nicholson, Jimmie Fails, Alba Baptista, and Eric Dane. This looks totally nuts! Not just a simple home invasion thriller, a lot more strange things going on in here. Get a look. Here's the official trailer (+ poster) for Jimmy Warden's thriller Borderline, direct from YouTube: Cocaine Bear writer Jimmy Warden makes his twisted […]",
    "author": "Alex Billington",
    "published": "Fri, 14 Feb 2025 16:53:40 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/BorderlinePostermaincolorTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "de150d88-8368-4848-b72b-c75d644fc41d",
    "title": "New US Trailer for 'Hood Witch' Thriller Starring Golshifteh Farahani",
    "link": "https://www.firstshowing.net/2025/new-us-trailer-for-hood-witch-thriller-starring-golshifteh-farahani/",
    "description": "\"What's going on? Why is everyone after you?\" Dark Sky Films has revealed a new US trailer for a French thriller film officially titled Hood Witch in English for this US release. Weird title, no? The original French title is Roqya, though that isn't any better. Here's the premise: A woman earns a living by smuggling exotic animals and illegal goods, developing a mobile app that links users with mystical marabout healers, but one of the user's consultations takes a tragic turn facing a violent backlash. Nour makes a living from smuggling exotic animals for her city's marabouts, wishing to get her son out of the city and offer him a better future. But an exorcism turns into a tragedy and Nour has to face a wave of violence that could cost their lives... Starring Golshifteh Farahani as Nour, Amine Zariouhi, Jérémy Ferrari, Denis Lavant, and Issaka Sawadogo. After premiering in 2023 at a few genre film festivals, this is ready for its release (including on VOD) in the US this spring. This looks like it gets totally crazy once they start coming after her! Watch out. Here's the official US trailer (+ poster) for Saïd Belktibia's thriller Hood Witch, […]",
    "author": "Alex Billington",
    "published": "Fri, 14 Feb 2025 16:05:38 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/RoqyaPostermainimagebigsvTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Foreign Films",
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "22da355e-dad6-4294-8bb8-c8a57912b184",
    "title": "The Odyssey: Mia Goth Is The Latest To Join The Impressive Cast",
    "link": "https://bleedingcool.com/movies/the-odyssey-mia-goth-is-the-latest-to-join-the-impressive-cast/",
    "description": "Mia Goth is the latest to join the already massive and impressive cast of Christopher Nolan's big-screen adaptation of The Odyssey.",
    "author": "Kaitlyn Booth",
    "published": "Fri, 14 Feb 2025 18:02:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Universal",
      "christopher nolan",
      "the odyssey"
    ]
  },
  {
    "id": "1827f41b-f2f4-46d4-a818-ac008047e842",
    "title": "Disney Shifts Elio By A Week, Dates Send Help And Ella McCay",
    "link": "https://bleedingcool.com/movies/disney-shifts-elio-by-a-week-dates-send-help-and-ella-mccay/",
    "description": "Disney has shifted Elio's release date by a week so it won't be in direct competition with How To Train Your Dragon and dated two 20th Century films.",
    "author": "Kaitlyn Booth",
    "published": "Fri, 14 Feb 2025 15:22:08 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "20th Century Studios",
      "Disney",
      "Movies",
      "Pixar",
      "Elio",
      "ella mccay",
      "Send Help"
    ]
  }
]
