[
  {
    "id": "7750bbde-9df1-43d9-9420-8e5cfad1f7ea",
    "title": "Cynthia Erivo’s Intricate Golden Globes Nails Took Five Hours to Create",
    "link": "https://variety.com/2025/awards/news/cynthia-erivo-golden-globes-nails-five-hours-1236266018/",
    "description": "“Wicked” star Cynthia Erivo has showcased incredible nail art through the film’s press cycle, and debuted her most intricate look yet at Sunday’s Golden Globes. While speaking about the design during the “Live From E!” preshow, she said the look took her nail artist five hours to complete. When asked what she did during that […]",
    "author": "William Earl",
    "published": "Mon, 06 Jan 2025 01:00:03 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/01/erivo-golden-globes.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Cynthia Erivo",
      "Golden Globes"
    ]
  },
  {
    "id": "752eb6e8-0d19-4af5-8ac1-99ab140ce7c9",
    "title": "Golden Globes 2025: Complete Winners List (Updating Live)",
    "link": "https://variety.com/2025/film/news/golden-globes-2025-winners-1236262416/",
    "description": "The 2025 awards season has officially begun, with the Golden Globes kicking things off Sunday night. Unlike last year, which was dominated by “Oppenheimer,” prognosticators indicate that there is no clear frontrunner for the 2025 season. In recent weeks, Universal’s “Wicked” has dominated social media, with fans attending singalong screenings over Christmas. Netflix’s “Emilia Perez” […]",
    "author": "Jordan Moreau",
    "published": "Mon, 06 Jan 2025 00:59:55 +0000",
    "image": "https://variety.com/wp-content/uploads/2021/03/Golden-Globes-4.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Anora",
      "Wicked"
    ]
  },
  {
    "id": "5c19f559-6f3f-491e-be12-b9fe918888c1",
    "title": "Golden Globes Winners List – Updating Live",
    "link": "https://deadline.com/2025/01/golden-globes-2025-winners-list-1236246217/",
    "description": "It’s been a difficult few years for the Golden Globes, but the ceremony is back in the spotlight tonight as awards season shifts into overdrive. Deadline is updating the winners live as they are announced; see the list below. Notorious Tom Brady roaster Nikki Glaser is hosting the 82nd annual show from the Beverly Hilton, […]",
    "author": "Erik Pedersen",
    "published": "Mon, 06 Jan 2025 00:59:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/01/GettyImages-2191585709.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Awards",
      "Awardsnews",
      "Golden Globe Awards",
      "Golden Globes",
      "Golden Globes 2025"
    ]
  },
  {
    "id": "2e31788a-bb1c-4fcc-b3f9-0a27c894e055",
    "title": "Deadline’s Golden Globes Live Blog",
    "link": "https://deadline.com/2025/01/golden-globes-2025-live-updates-1236247070/",
    "description": "Welcome to Deadline’s live blog for the Golden Globes. Last year’s event, broadcast on CBS, was considered a success, particularly after the organization went through an ownership change and the Hollywood Foreign Press Association was dissolved as a result of a series of controversies including the fact that it had no Black voting members. It […]",
    "author": "Patrick Hipes",
    "published": "Mon, 06 Jan 2025 00:48:25 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/01/Golden-Globes-Live-Blog.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Awardsnews",
      "CBS",
      "Golden Globes",
      "Golden Globes 2025",
      "Nikki Glaser"
    ]
  },
  {
    "id": "1c0a158c-35ad-48f2-a5b9-580faa2ac610",
    "title": "Only One Season Of The Sopranos Is Perfect, According To Rotten Tomatoes",
    "link": "https://www.slashfilm.com/1750759/the-sopranos-perfect-season-according-rotten-tomatoes/",
    "description": "There's only one perfect season of The Sopranos, according to Rotten Tomatoes, and it features some of the series' finest hours.",
    "author": "Nick Staniforth",
    "published": "Sun, 05 Jan 2025 23:45:34 +0000",
    "image": "https://www.slashfilm.com/img/gallery/only-one-season-of-the-sopranos-is-perfect-according-to-rotten-tomatoes/l-intro-1735830010.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows"
    ]
  },
  {
    "id": "42f4ec5a-4f9c-49d5-b0e8-b2e59b490b95",
    "title": "Kurt Russell's Tombstone Had To Follow A Strict Mustache Rule",
    "link": "https://www.slashfilm.com/1750118/kurt-russell-tombstone-mustache-rule/",
    "description": "You'd be hard pressed to find a better assembly of well-manicured mustaches outside of Kurt Russell and co. in Tombstone.",
    "author": "Bill Bria",
    "published": "Sun, 05 Jan 2025 22:45:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/kurt-russells-tombstone-had-to-follow-a-strict-mustache-rule/l-intro-1735694050.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Drama Movies",
      "History Movies"
    ]
  },
  {
    "id": "0526e62e-eee7-465f-af7c-1bb8089c2d5c",
    "title": "NOSFERATU - Succumb to the Darkness",
    "link": "https://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Eric McClanahan reviews Robert Eggers's latest film, NOSFERATU. Read the full article on AICN Wouldst thou like to live immortally? Robert Eggers is back in theaters with his latest vision, NOSFERATU, a remake of the 1922 film of the same name, which was itself an unlicensed retelling of Bram Stoker's DRACULA. For those who don't know, Eggers is the visionary behind such standout films as THE VVITCH, THE LIGHTHOUSE, and THE NORTHMAN. His films have earned him a fiercely dedicated fanbase and heavy auteur status in Hollywood, essentially giving him carte blanche when it comes to making his films. NOSFERATU is the culmination of that legacy and that power, for better or worse. I saw NOSFERATU last night in a packed theater, my second choice theater as the first had already sold out by the time I arrived. It was preceded by trailers for THE WOLF MAN and THE MONKEY, tailored to its audience of artistic horror hounds. The movie begins with simple white text over black backgrounds, and the first thing the audience hears is a woman crying the darkness. From there, the film is two plus hours of atmosphere and mood, stretched to its near breaking point before the final fade out. Eggers is a master of tone, an Edgar Allan Poe of the visual form, and his legacy as a visual storyteller receives no tarnish with this entry into his oeuvre. So much is explored with a muted color palette and expert use of light and shadow. The camera pulls into darkness, pulls the bodies onscreen into rooms into which they cannot see, Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 31 Dec 2024 01:37:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "163b5ff4-1df1-4110-9df4-a16a877d677c",
    "title": "James Fox Discusses His Documentary THE PROGRAM",
    "link": "https://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Filmmaker James Fox discusses his new documentary THE PROGRAM which examines the United States government's pre-existing relationship with UAPs. Read the full article on AICN In a new AND NOW FOR SOMETHING COMPLETELY DIFFERENT SEGMENT, I will do something terrifically similar to what I did the last time I did this segment, and now that I'm reading that out loud I realize how ridiculous it sounds. Regardless, I once again enter the realm of Unidentified Anomalous Phenomena and speak with a specialist about what the United States knows, what it doesn't, and the barriers that are preventing it from disclosing its full knowledge to the public. Let's get one thing established right away: the conversation around alien visitation has changed. When I chatted with Disclosure Activist Stephen Bassett back in 2021, we weren't discussing if these visitations were real but rather why we weren't being told about them. Even the classification has changed - they're no longer Unidentified Flying Objects but Unidentified Anomalous Phenomenon, or UAPs. Our government has come clean about their interest in UAPs, largely due to military concerns, and they take sightings seriously. The Defense Department's All-domain Anomaly Resolution Office was created to investigate unidentified anomalies to determine if they're foreign or domestic, dangerous or innocuous, earthbound or alien. That part is transparent, but THE PROGRAM's findings aren't, and that is the subject of filmmaker James Fox's new documentary, THE PROGRAM. I chatted with James Fox, filmmaker of The Phenomenon, Moment of Contact, and I Know What I Saw, to discuss THE PROGRAM after viewing it, and though we were able to talk for quite a while, I didn't really have that many questions. Not because the Finish the article on AICN",
    "author": "McEric",
    "published": "Fri, 27 Dec 2024 19:50:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "77c382b2-bf88-4c78-932a-491561bc9b4e",
    "title": "The Rig Season 2 Ending Explained: What Happens to Rose \u0026 the Ancestor?",
    "link": "https://www.comingsoon.net/guides/news/1900508-the-rig-season-2-ending-explained-rose-die-ancestor",
    "description": "Explore the thrilling ending of The Rig Season 2, as Rose and the Ancestor shape a bold future for the series. Discover what happens next! The post The Rig Season 2 Ending Explained: What Happens to Rose \u0026 the Ancestor? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Vritti Johar",
    "published": "Mon, 06 Jan 2025 00:21:36 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/SEI_139222604.jpg.webp?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "The Rig"
    ]
  },
  {
    "id": "8b2de348-56d7-429f-a7ee-43be50d15487",
    "title": "What Time Does Will Trent Season 3 Release on ABC \u0026 Hulu?",
    "link": "https://www.comingsoon.net/guides/news/1900497-will-trent-season-3-release-time-date-abc-hulu",
    "description": "Fans are eagerly awaiting the release date and time of Season 3 of Hulu’s hit series Will Trent, which follows Agent Will Trent, a product of Atlanta’s foster care system, as he works to prevent others from suffering similar hardships. With the new season approaching, viewers are anxious to know the release date, episode count, […] The post What Time Does Will Trent Season 3 Release on ABC \u0026 Hulu? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Ayesha Zafar",
    "published": "Sun, 05 Jan 2025 23:52:32 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/will-trent.jpg.webp?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "Will Trent"
    ]
  },
  {
    "id": "182cfcdb-0d68-485f-b0c8-4c8a5952af19",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "2c511878-717d-4380-8375-fb9884f47ea3",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "807f558f-dd07-4782-be36-954ef69738ee",
    "title": "Official Trailer for 1990s AZ Drug Scene 'Sons of Ecstasy' Crime Doc",
    "link": "https://www.firstshowing.net/2025/official-trailer-for-1990s-az-drug-scene-sons-of-ecstasy-crime-doc/",
    "description": "\"They became the biggest threat to the organization.\" Max has revealed the official trailer for a true crime documentary film called Sons of Ecstasy, debuting for streaming starting next week. The doc film takes us back to parties in the 90s and reveals true stories of the MDMA drug scene during the rave era. \"Power is a drug.\" In 1990s Arizona, an English stockbroker clashes with a mobster's son over the ecstasy trade. The Gravano family shares their perspective as two unlikely rivals vie for control amid guns, gangsters, and big raves in the desert. \"For the first time, the Gravanos tell their side of the story. Through first-hand accounts from inside both factions, the film unravels the unexpected showdown between the British business guru and the Mafia heir apparent in the Arizona desert.\" Crazy that they actually got both sides of this to sit down and tell the truth about what really happened and how their rivalries played out. It's yet another true crime doc joining the massive true crime streaming library, but this one seems particularly fascinating. Get a look. Here's the official trailer (+ poster) for Max's true crime doc film Sons of Ecstasy, direct from YouTube: […]",
    "author": "Alex Billington",
    "published": "Sun, 05 Jan 2025 21:04:56 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/SonsofEcstasyPostermainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "f58797a9-7467-4588-bf84-5ab762934157",
    "title": "Onward to 2025 - FirstShowing Remains a Fully Independent Film Site",
    "link": "https://www.firstshowing.net/2025/onward-to-2025-firstshowing-remains-a-fully-independent-film-site/",
    "description": "\"No matter what anybody tells you, words and ideas can change the world.\" Heading into the year 2025, this marks the 19th year of FirstShowing.net – we originally launched this website way back in 2006. It's a miracle that it's still running all these years later – almost two decades. There've been so many times when I've wanted to throw in the towel, shut things down, and move on. But I still love movies. I still love cinema. I'm still happy (for the most part) being able to participate in this world and stay excited about watching new movies (and old movies) and talk about movies and keep everyone informed \u0026 updated about movies. It's harder than ever to remain an independent website in this day-and-age. So many other movie sites have shut down or been sold off recently. It's too hard and too costly, there's too many risks, and the internet has changed in so many bad ways (see: enshittification). I want to continue to keep \"Hollywood connected with its audience\" and will do my best to keep FS running for as long as I can. Even if I don't make much money. It was my original intent to […]",
    "author": "Alex Billington",
    "published": "Fri, 03 Jan 2025 22:30:02 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/FirstShowingCinema25imgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Editorial",
      "General",
      "Movie News"
    ]
  },
  {
    "id": "c3841cfe-33c0-4cc5-be7b-6db13241a496",
    "title": "The Penguin Showrunner on Where Things Stand with Season 2 Chances",
    "link": "https://bleedingcool.com/tv/the-penguin-showrunner-on-where-things-stand-with-season-2-chances/",
    "description": "During the Golden Globes red carpet, The Penguin Showrunner Lauren LeFranc discussed the chances of a second season for \"The Batman\" spinoff.",
    "author": "Ray Flook",
    "published": "Sun, 05 Jan 2025 18:54:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "HBO",
      "Movies",
      "TV",
      "the batman",
      "The Penguin"
    ]
  },
  {
    "id": "a1be4e7f-afa6-4ba3-a865-e7d9b64c02d3",
    "title": "Freediver Director on Chronicling Alexey Molchanov's 2023 World Record",
    "link": "https://bleedingcool.com/movies/freediver-director-on-chronicling-alexey-molchanovs-2023-world-record/",
    "description": "Michael John Warren (Best Shot) spoke to Bleeding Cool about his latest documentary on Alexey Molchanov's life in Paramount's Freediver.",
    "author": "Tom Chang",
    "published": "Sun, 05 Jan 2025 18:17:08 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Documentary",
      "Interview",
      "Movies",
      "Paramount Pictures",
      "Alexey Molchanov",
      "Freediver",
      "Michael John Warren",
      "paramount"
    ]
  },
  {
    "id": "6e40d1c1-7241-4213-aad2-80f68542fb9d",
    "title": "2025 Golden Globes Winners List: Updating Live",
    "link": "https://www.indiewire.com/awards/results/2025-golden-globes-winners-list-1235081981/",
    "description": "Read the full list, updating live throughout the night, as the Golden Globe winners are revealed.",
    "author": "Christian Blauvelt",
    "published": "Mon, 06 Jan 2025 01:01:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Awards",
      "Results",
      "Film",
      "Golden Globes",
      "TV"
    ]
  },
  {
    "id": "0627f16f-f6c3-4df5-ac42-837f2949f714",
    "title": "Coralie Fargeat on Horror Movies at the Oscars: They ‘Should Compete at the Same Level as Everything Else’",
    "link": "https://www.indiewire.com/news/events/the-substance-coralie-fargeat-horror-movies-deserve-oscar-attention-1235082303/",
    "description": "\"The best thing I wish for the Academy is that there is not this barrier, that every movie is considered as cinema,\" \"The Substance\" director told IndieWire on the Golden Globes red carpet.",
    "author": "Ryan Lattanzio",
    "published": "Mon, 06 Jan 2025 00:25:51 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Events | Hollywood and Entertainment",
      "News",
      "Awards",
      "Coralie Fargeat",
      "Film",
      "Golden Globes",
      "Oscars",
      "Red Carpet",
      "The Substance"
    ]
  }
]
