[
  {
    "id": "1ffe3baa-d376-4fdb-af72-bf507f1c6803",
    "title": "‘Pachinko’ Star Kim Minha’s Murder Mystery ‘A Girl With Closed Eyes’ Scores Multi-Territory Deals for Finecut Ahead of EFM",
    "link": "https://variety.com/2025/film/news/pachinko-kim-minha-girl-with-closed-eyes-finecut-efm-1236295135/",
    "description": "Korean sales banner Finecut has locked in a string of international deals for “A Girl With Closed Eyes,” a psychological thriller starring breakout “Pachinko” actor Kim Minha, ahead of its European Film Market (EFM) premiere in Berlin. The feature debut from director Chun Sunyoung has been acquired by Red Castle Group for CIS territories, The […]",
    "author": "Naman Ramachandran",
    "published": "Tue, 04 Feb 2025 01:00:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/A-Girl-With-Closed-Eyes.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Asia",
      "Global",
      "Markets \u0026 Festivals",
      "News",
      "A Girl With Closed Eyes",
      "Berlinale",
      "European Film Market",
      "Finecut"
    ]
  },
  {
    "id": "1500ad30-0106-42df-bb5d-9381b6f80871",
    "title": "Janelle Monáe Calls Nelly a ‘Motherf—ing Fool’ for Performing at Trump Inauguration Ball: ‘You Sold Out’",
    "link": "https://variety.com/2025/music/news/janelle-monae-nelly-trump-inauguration-performance-1236296123/",
    "description": "Janelle Monáe took aim at Nelly on Sunday for his performance at Donald Trump’s inauguration ball. Monáe called out the St. Louis rapper at a Grammys afterparty (via TMZ) while performing a cover of his hit song “Hot In Herre.” “Fuck you Nelly. I used to like Nelly, but then he went to perform for […]",
    "author": "Jack Dunn",
    "published": "Tue, 04 Feb 2025 00:12:07 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/MixCollage-03-Feb-2025-03-55-PM-4501.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Janelle Monae",
      "Nelly"
    ]
  },
  {
    "id": "c3cc2b0b-b3d7-4b4e-8ba9-f2f18bcf986d",
    "title": "Sundance Midnight Selection TOUCH ME",
    "link": "https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME Read the full article on AICN The Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads: Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world. TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too. I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 21 Jan 2025 04:16:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "88ed2ab2-2f95-40dc-97e5-18743928f929",
    "title": "NOSFERATU - Succumb to the Darkness",
    "link": "https://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Eric McClanahan reviews Robert Eggers's latest film, NOSFERATU. Read the full article on AICN Wouldst thou like to live immortally? Robert Eggers is back in theaters with his latest vision, NOSFERATU, a remake of the 1922 film of the same name, which was itself an unlicensed retelling of Bram Stoker's DRACULA. For those who don't know, Eggers is the visionary behind such standout films as THE VVITCH, THE LIGHTHOUSE, and THE NORTHMAN. His films have earned him a fiercely dedicated fanbase and heavy auteur status in Hollywood, essentially giving him carte blanche when it comes to making his films. NOSFERATU is the culmination of that legacy and that power, for better or worse. I saw NOSFERATU last night in a packed theater, my second choice theater as the first had already sold out by the time I arrived. It was preceded by trailers for THE WOLF MAN and THE MONKEY, tailored to its audience of artistic horror hounds. The movie begins with simple white text over black backgrounds, and the first thing the audience hears is a woman crying the darkness. From there, the film is two plus hours of atmosphere and mood, stretched to its near breaking point before the final fade out. Eggers is a master of tone, an Edgar Allan Poe of the visual form, and his legacy as a visual storyteller receives no tarnish with this entry into his oeuvre. So much is explored with a muted color palette and expert use of light and shadow. The camera pulls into darkness, pulls the bodies onscreen into rooms into which they cannot see, Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 31 Dec 2024 01:37:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "2aa4e7f1-7006-4e7a-bb69-e22b8d2b49bc",
    "title": "This Marvel Superhero Has Been Sent To Prison...Twice",
    "link": "https://www.slashfilm.com/1773833/marvel-superhero-daredevil-prison/",
    "description": "One Marvel superhero has been sent to prison two different times – once as his superhero persona, and another as his non-superhero alter ego.",
    "author": "Devin Meenan",
    "published": "Mon, 03 Feb 2025 23:45:56 +0000",
    "image": "https://www.slashfilm.com/img/gallery/this-marvel-superhero-has-been-sent-to-prison-twice/l-intro-1738095827.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Superhero Shows",
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "ef24ce14-9ab5-49e7-b695-4879a80ab45e",
    "title": "Marvel Producer Comments On T'Challa Recasting Rumors For Black Panther 3",
    "link": "https://www.slashfilm.com/1779131/black-panther-3-tchalla-recasting-rumors-marvel-producer-response/",
    "description": "Black Panther 3 producer Nate Moore has commented on those T'Challa recasting rumors, suggesting folks shouldn't believe everything they read.",
    "author": "Bill Bria",
    "published": "Mon, 03 Feb 2025 23:02:10 +0000",
    "image": "https://www.slashfilm.com/img/gallery/marvel-producer-comments-on-tchalla-recasting-rumors-for-black-panther-3/l-intro-1738623595.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Action \u0026 Adventure Movies",
      "Superhero Movies"
    ]
  },
  {
    "id": "ed2e8840-b592-4ccf-aba8-ed56dc51d3ed",
    "title": "Justin Baldoni Updates Lawsuit, Adds Bullying Claims Based on Ryan Reynolds’ Nicepool",
    "link": "https://www.comingsoon.net/movies/news/1915213-justin-baldoni-updated-lawsuit-ryan-reynolds-the-new-york-times-blake-lively",
    "description": "Justin Baldoni has updated his lawsuit against Blake Lively and Ryan Reynolds, alleging that Reynolds used the Deadpool \u0026 Wolverine movie to bully him, while also adding claims that Lively’s team had planned to tarnish his reputation for some time. What’s new in Justin Baldoni’s lawsuit? Baldoni’s amended lawsuit was filed on Friday night (via […] The post Justin Baldoni Updates Lawsuit, Adds Bullying Claims Based on Ryan Reynolds’ Nicepool appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Mon, 03 Feb 2025 23:03:27 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/deadpool-and-wolverine-nicepool-ryan-reynolds.png?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Blake Lively",
      "Justin Baldoni",
      "Ryan Reynolds"
    ]
  },
  {
    "id": "c5751fda-7842-489a-9757-f590fdd606f0",
    "title": "Sony’s The Beatles Movies Reportedly Finds Its Yoko Ono Actress",
    "link": "https://www.comingsoon.net/movies/news/1915192-sony-beatles-movies-yoko-ono-actress-anna-sawai",
    "description": "Sam Mendes’ upcoming The Beatles movie has reportedly found its Yoko Ono, according to a new report from The InSneider’s Jeff Sneider. Who is rumored to be playing Yoko Ono in The Beatles movies? According to Sneider, Anna Sawai (Shogun) is the current “clear frontrunner” to play the role of the Japanese multimedia artist and […] The post Sony’s The Beatles Movies Reportedly Finds Its Yoko Ono Actress appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Mon, 03 Feb 2025 22:29:38 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/yoko-ono-john-lennon-header.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Anna Sawai",
      "Movie News",
      "Sam Mendes",
      "Sony",
      "Sony Pictures",
      "The Beatles"
    ]
  },
  {
    "id": "ffacdfc8-a58e-47cd-9dfe-8d6a624e1d91",
    "title": "Cooper Kupp Says LA Rams Seeking Trade: “I Don’t Agree With The Decision”",
    "link": "https://deadline.com/2025/02/cooper-kupp-los-angeles-rams-seeking-trade-1236277466/",
    "description": "Los Angeles Rams star Cooper Kupp is being traded during the NFL off-season, the wide receiver said on social media. The Rams will miss one of its key players when the 2025 season begins later this year, despite Kupp not wanting to leave the team. “I was informed that the team will be seeking a […]",
    "author": "Armando Tinoco",
    "published": "Tue, 04 Feb 2025 00:55:06 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/cooper-kupp-los-angeles-rams.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Sports",
      "Cooper Kupp",
      "Los Angeles Rams",
      "NFL",
      "Rams"
    ]
  },
  {
    "id": "0d0c8181-51bb-4227-b975-e4ad555423df",
    "title": "Doug Wald Exits Anonymous Content; Is Brillstein Next For Emma Stone \u0026 Austin Butler’s Manager?",
    "link": "https://deadline.com/2025/02/doug-wald-exits-anonymous-content-manager-emma-stone-austin-butler-1236276957/",
    "description": "EXCLUSIVE: Doug Wald is exiting Anonymous Content, Deadline hears. Wald, whose clients include Emma Stone, Austin Butler and others, has been there for 13 years and just informed the company of his move. Rumor on the street is he might land at Brillstein Entertainment Group, the management concern that was acquired by Casey Wasserman‘s music […]",
    "author": "Mike Fleming",
    "published": "Tue, 04 Feb 2025 00:30:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/Doug-wald.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Anonymous Content",
      "Austin Butler",
      "Brillstein Entertainment Partners",
      "Doug Wald",
      "Emma Stone"
    ]
  },
  {
    "id": "a33e5c81-10dc-4176-bf21-d0f130853024",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "a718fe03-b0a2-4ec3-8f4b-9625dfb3f104",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "a09f738d-76b4-4f1b-a0b1-a02f0f2eb71a",
    "title": "Blue Beetle Animated Series Eyed for 2026 Premiere: Xolo Maridueña",
    "link": "https://bleedingcool.com/tv/blue-beetle-animated-series-eyed-for-2026-premiere-xolo-mariduena/",
    "description": "Blue Beetle star Xolo Maridueña offered a quick update on the DC Studios animated series, noting that the studio is eyeing a 2026 premiere.",
    "author": "Ray Flook",
    "published": "Mon, 03 Feb 2025 15:41:08 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "HBO",
      "Max",
      "Movies",
      "TV",
      "blue beetle",
      "dc studios",
      "Xolo Maridueña"
    ]
  },
  {
    "id": "3cc7716e-9a3f-44c7-a0b1-f89906044929",
    "title": "The Fantastic Four: First Steps – Marvel Starts A Countdown To Launch",
    "link": "https://bleedingcool.com/movies/the-fantastic-four-first-steps-marvel-starts-a-countdown-to-launch/",
    "description": "Marvel Studios has started a countdown to the launch of the first trailer of The Fantastic Four: First Steps, which will debut early tomorrow.",
    "author": "Kaitlyn Booth",
    "published": "Mon, 03 Feb 2025 14:47:08 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "20th Century Studios",
      "Marvel Studios",
      "Movies",
      "the fantastic four: first steps"
    ]
  },
  {
    "id": "41d6d601-1630-4fb7-b7a8-cfc19f459a30",
    "title": "Watch: Enchanting Animated Short 'The Lost Tower' Made in Blender",
    "link": "https://www.firstshowing.net/2025/watch-enchanting-animated-short-the-lost-tower-made-in-blender/",
    "description": "Time for beautiful quick journey to a whole other world. This animated short film titled The Lost Tower is a 2-min creation from Montreal-based animation filmmaker Florent Lebrun. It started as a small project and turned into this magnificent animated short. The film follows a pilot in a yellow bi-plane. \"Flying over uncharted waters, a pilot searches for one of the Lost Towers.\" It reminds me of Porco Rosso of course, very similar vibes (also with Castle in the Sky), but still feels like something unique. I would love to watch more - it's this is just the intro. For anyone concerned that it's created with A.I., Lebrun puts those rumors and concerns to rest right away. He explains on his IG post: \"Got some people wondering if it was AI... Sorry just good old Blender / Photoshop / compositing process.\" Amazing work! This is so evocative and immersive, allowing anyone to feel like they're ready to join this pilot on his mission to discover even more Lost Towers. Wow. Thanks to Twitter for the tip on this short film debuting online. Brief intro via YouTube: \"Flying over uncharted waters, a pilot searches for one of the Lost Towers.\" The […]",
    "author": "Alex Billington",
    "published": "Tue, 04 Feb 2025 00:33:52 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/ThelosttowerAnimshortmainTsr2.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Animation",
      "Short Film",
      "To Watch"
    ]
  },
  {
    "id": "d12fff19-f7d2-4f76-a233-36cec33c7707",
    "title": "Sundance 2025: 'Deaf President Now!' Doc is Remarkably Inspiring",
    "link": "https://www.firstshowing.net/2025/sundance-2025-deaf-president-now-doc-is-remarkably-inspiring/",
    "description": "There are not many documentaries these days that end with real hope and optimism. Way too many of them are extremely depressing and sad, showing how bad things have become all over the world. I'm relieved that this outstanding doc at the 2025 Sundance Film Festival shares an fascinating story that is truly inspiring. Watching this film it makes me feel like we actually can achieve change. It is possible. As long as you never give up, as long as you stick to word, stay the course, never let anyone or anything dissuade you, and fight on until they finally back down. That's such a refreshing feeling in the face of so many other \"look how awful things are\" docs being made (from true crime to politics to societal problems and so on). Deaf President Now! recalls how the students at Gallaudet University in 1988 protested for one week until they finally elected the first Deaf president to run the university after 125 years of never having a Deaf president. It's an awesome, empowering, riveting story that most people don't know - and this doc does such a superb job of retelling it and confirming its importance as one of […]",
    "author": "Alex Billington",
    "published": "Mon, 03 Feb 2025 19:59:42 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/DeafPresidentNowdocposterTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "Review",
      "Sundance 25"
    ]
  },
  {
    "id": "3f38cf0d-ea20-4018-bc13-b68fc73c8f5e",
    "title": "The 15 Best Thrillers Streaming on Netflix in January, from ‘Fair Play’ to ‘Emily the Criminal’",
    "link": "https://www.indiewire.com/feature/best-thrillers-netflix-1234703006/",
    "description": "There are many bad thrillers on the streamer, but you can dig into the best of the genre if you know where to look.",
    "author": "",
    "published": "Tue, 04 Feb 2025 00:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Best Of",
      "Features",
      "Film",
      "Netflix",
      "Thriller"
    ]
  },
  {
    "id": "7d28a526-cdb2-4618-a3b7-5d86c6b51078",
    "title": "New VOD Releases ‘Moana 2,’ ‘Den of Thieves 2,’ ‘Babygirl’ Lead Charts at Home",
    "link": "https://www.indiewire.com/news/box-office/moana-2-den-of-thieves-2-babygirl-streaming-charts-1235091558/",
    "description": "Meanwhile, Searchlight's 2022 \"The Menu\" bests the Netflix original \"Back in Action\" to take the #1 spot at the streamer.",
    "author": "Tom Brueggemann",
    "published": "Mon, 03 Feb 2025 23:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Box Office",
      "News",
      "Babygirl",
      "Den of Thieves 2: Pantera",
      "Film",
      "Moana 2",
      "Netflix",
      "The Menu",
      "VOD"
    ]
  }
]
