[
  {
    "id": "4e8e2fa3-140e-448f-ade6-3fce7d9bcdee",
    "title": "Hollywood Foreign Press Association Members Seek to Restore Organization Amid Disputes with New Owners of Golden Globes",
    "link": "https://variety.com/2025/tv/news/hfpa-revive-disputes-golden-globe-awards-dick-clark-boehly-1236446656/",
    "description": "Veteran board members of the Hollywood Foreign Press Association are seeking to re-establish the organization, two years after the Golden Globe Awards and other assets of the HFPA were acquired by Dick Clark Productions and investor Todd Boehly’s Eldridge holding company. The move stems from a dispute between some HFPA members and the new stewards […]",
    "author": "Cynthia Littleton",
    "published": "Thu, 03 Jul 2025 01:09:09 +0000",
    "image": "https://variety.com/wp-content/uploads/2021/12/BCK_8037.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Golden Globe Awards",
      "hfpa"
    ]
  },
  {
    "id": "df347588-0300-4a89-afc3-b4297835d14c",
    "title": "Julie Bowen Thought ‘Happy Gilmore 2’ Would Replace Her With a ‘Younger Woman’: ‘I Didn’t Think They’d Bring Me Back at All’",
    "link": "https://variety.com/2025/film/news/julie-bowen-happy-gilmore-2-younger-woman-netflix-1236446648/",
    "description": "Julie Bowen was surprised when Netflix asked her to return for “Happy Gilmore 2.” During a recent interview on the “Inside of You” podcast, Bowen explained she was certain she’d be replaced as the love interest for Adam Sandler’s titular golfer by a younger actress for the highly anticipated “Happy Gilmore” sequel. “I didn’t think […]",
    "author": "Jack Dunn",
    "published": "Thu, 03 Jul 2025 00:33:18 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/07/MSDHAGI_UV005.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Happy Gilmore 2",
      "Julie Bowen",
      "Netflix"
    ]
  },
  {
    "id": "4373a1a2-02a9-43eb-b02d-9ff754892d5d",
    "title": "What's Up With Jurassic World Rebirth's New Island? Ile Saint-Hubert Explained",
    "link": "https://www.slashfilm.com/1901296/jurassic-world-rebirth-new-island-isle-saint-hubert-explained/",
    "description": "Jurassic World Rebirth introduces a new island of dinos for all of us to be terrified of visiting. Here's how it fits within the franchise's canon.",
    "author": "Ryan Scott",
    "published": "Wed, 02 Jul 2025 22:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/whats-up-with-jurassic-world-rebirths-new-island-ile-saint-hubert-explained/l-intro-1751404607.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Action \u0026 Adventure Movies",
      "Science Fiction Movies"
    ]
  },
  {
    "id": "dea94323-d941-49d5-9c7f-07c3be91260f",
    "title": "One Of The Most Disgusting Documentaries Ever Is Crushing It On Netflix's Top Charts",
    "link": "https://www.slashfilm.com/1902041/trainwreck-poop-cruse-most-disgusting-documentary-ever-netflix-top-charts/",
    "description": "This Netflix documentary, which is currently ruling the streamer's top charts, is an interesting way to spend an hour... as long as you have the stomach for it.",
    "author": "Danielle Ryan",
    "published": "Wed, 02 Jul 2025 20:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/one-of-the-most-disgusting-documentaries-ever-is-crushing-it-on-netflixs-top-charts/l-intro-1751478568.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Documentaries"
    ]
  },
  {
    "id": "76cade50-4f14-472b-9977-a74734acd3d9",
    "title": "Pedro Pascal \u0026 Sarah Paulson Friendship Explained",
    "link": "https://www.comingsoon.net/guides/news/1997784-pedro-pascal-sarah-paulson-friendship-explained",
    "description": "Fans are eager to learn about Pedro Pascal and Sarah Paulson’s longstanding friendship. The duo recently posed together at the press night performance of Evita at the London Palladium. Now, their effortless chemistry on the red carpet sparked discourse regarding their cherished camaraderie among netizens. So, here’s everything fans need to know about Pascal and […] The post Pedro Pascal \u0026 Sarah Paulson Friendship Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Arpita Adhya",
    "published": "Wed, 02 Jul 2025 23:39:14 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/07/MixCollage-03-Jul-2025-05-04-AM-5657.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Pedro Pascal",
      "Pop Culture",
      "Pop Culture FAQ",
      "Sarah Paulson"
    ]
  },
  {
    "id": "6a6f1b3e-2c1f-413d-9113-ba213c37f228",
    "title": "Sydney Sweeney Crime Thriller Americana Release Date Changed",
    "link": "https://www.comingsoon.net/movies/news/1997987-sydney-sweeney-crime-thriller-americana-release-date-changed",
    "description": "The Sydney Sweeney-led crime thriller Americana is getting a release date shift, with Lionsgate announcing a new date for the upcoming movie. When is the Americana release date? According to Lionsgate, Americana’s release date will move up a week, now releasing on August 15, 2025. The film was previously dated for August 22, 2025, but fans […] The post Sydney Sweeney Crime Thriller Americana Release Date Changed appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Wed, 02 Jul 2025 22:07:57 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/07/americana-sydney-sweeney.png?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Americana",
      "Eric Dane",
      "Lionsgate",
      "Movie News",
      "Sydney Sweeney"
    ]
  },
  {
    "id": "a5ccdb96-e8cb-47e2-ae6d-b33deb358a22",
    "title": "Barbarella Finds MATERIALISTS Pointless",
    "link": "https://www.aintitcool.com/materialistsreview2025-83618/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Barbarella Finds MATERIALISTS Pointless Read the full article on AICN Hey friends, Barbarella here to tell you how completely disappointing Materialists is. How can a movie where Pedro Pascal and Chris Evans vie for the affections of a matchmaker fail so badly? Well, let me tell you.  For starters, the chemistry between Dakota Johnson and either romantic rival doesn't quite feel like it's intense enough, so perhaps the casting has some impact, but I don't think that's the issue. I think the script deserves the blame. Don't get me wrong. The story includes lots of laughable moments around dating expectations and so forth. However, one expects characters to evolve throughout a story, to learn lessons, gain deeper understanding or just grow into better people through interactions with others or situations in which they find themselves. None of this happens. So much of the story just makes no sense.   For instance, we are led to believe that Lucy, who’s been a top matchmaker for quite some time, never knew that people in real life are sometimes different than they appear on paper. She only learns this when an incident occurs with one of the couples she matches. I mean, anyone who’s ever been on a dating site or watched a True Crime story should know that people can portray themselves as something that they’re not. Technically, she apparently does already know people lie on the questionnaire because she comments about guys lying about their height.  For her to apparently have this “revelation” that makes her reevaluate her priorities simply doesn’t track. While that bothers me Finish the article on AICN",
    "author": "Barbarella",
    "published": "Sat, 21 Jun 2025 15:18:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "5aefa5b1-071e-4194-8326-3d43a0a3bf1d",
    "title": "Barbarella Adores THE LIFE OF CHUCK",
    "link": "https://www.aintitcool.com/lifeofchuckreview2025-83617/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Barbarella Adores THE LIFE OF CHUCK Read the full article on AICN Hey friends, Barbarella here. Have I ever told you what a huge Stephen King fan I am? It started when a teenage me read Pet Sematary and became so enthralled with the author’s work that my mom’s Christmas shopping became immensely easier. She started gifting me Stephen King books for every Christmas and birthday thereafter, knowing I would eagerly devour every page. I did, with relish. Eventually, I began working my way through movies based on his works. Some ventured from the source material in ways I didn’t appreciate, but when I heard Mike Flanagan would be tackling one of King’s short stories, The Life of Chuck, I knew I’d love it. And I did. Mike Flanagan, who’s responsible for my favorite horror miniseries, The Haunting of Hill House, and who was the mastermind who brought Doctor Sleep to screens, remains incredibly faithful to the source material, including how it’s told in three acts using reverse chronology. It’s a film that offers a feast of reflection on life, but I suspect some will dig in more ravenously than others. This is a story about those magical moments in life, the influence others have on our lives, and the decisions we make day to day that steer us one way or another.  Narrated by Nick Offerman, the film begins ominously enough, with the world seemingly coming to an end. Natural and unnatural disasters plague the planet, and as if that’s not bad enough, the internet also appears to be out, possibly for good this time. Uncertainty and fear weigh Finish the article on AICN",
    "author": "Barbarella",
    "published": "Sat, 21 Jun 2025 13:27:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "fc166e64-583e-4144-b2f3-067da87b30f8",
    "title": "Fresh New Trailer for Spielberg's 'Jaws' 50th Anniversary Re-Release",
    "link": "https://www.firstshowing.net/2025/fresh-new-trailer-for-spielbergs-jaws-50th-anniversary-re-release/",
    "description": "\"What we are dealing with here is a perfect engine. An eating machine.\" Universal is celebrating the 50th Anniversary of the all-timer classic Jaws with a nationwide re-release at the end of the summer this year. 🦈 Steven Spielberg's beloved shark movie Jaws has been re-released many times before and screens often in many places all over the world. Still just as thrilling as ever to watch it up on the big screen! Starting on August 29th, the movie returns to theaters nationwide in stunning 4K, with select screenings in IMAX, RealD 3D, 4DX and D-BOX (all the crazy formats!), offering audiences the chance to experience the original summer blockbuster \"as never before\" (ugh, why). When a massive killer shark unleashes chaos on a beach community off Long Island, it's up to the local police chief, a marine biologist, and an old seafarer to hunt the beast down. Starring Roy Scheider, Robert Shaw, Richard Dreyfuss, Lorraine Gary, Murray Hamilton. Originally released in June 1975, back again in the summer of 2025. Much has changed, much hasn't changed. Everyone's still afraid of sharks (me included). Don't forget it's rated PG – bring the family. Here's the brand new 50th Anniv. trailer (+ […]",
    "author": "Alex Billington",
    "published": "Wed, 02 Jul 2025 21:04:59 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/Jaws50thNewtrailerbigpostTsr3.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Hype",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "24a42342-22b1-4b03-939b-19f6dd8b2c6d",
    "title": "Must Watch: 'The Replicant' Hand-Drawn Animated Promo for LGN",
    "link": "https://www.firstshowing.net/2025/must-watch-the-replicant-hand-drawn-animated-promo-for-lgn/",
    "description": "\"Do androids dream of wet desires?\" Does anyone need fancy new clothes? A French fashion brand called LGN (short for the designer Louis-Gabriel Nouchi) has revealed their new promo titled The Replicant and it's a must watch. It's a 2-min, hand-drawn animated short film featuring metallic humanoids posing \u0026 interacting – in celebration of and announcing the LGN Spring/Summer '26 collection. It's very obviously inspired by Blade Runner, literally even the name The Replicant like Deckard, but also feels distinct in its own way with these robotic models doing their thing. The short is created by an animation shop called Wizz Studio based near Paris, animated by a French animation duo known as Milli. I'm usually not into fashion, but this is legit dope. Slick style, stunning animation, a clever concept and fresh way to promote clothing. It also reminds me of French electronica duo Daft Punk's iconic 2003 anime music video, aka Interstella 5555, since these 'bots remind me of those, too. I'm always excited about any new hand-drawn animation. Enjoy. Thanks to Catsuka for the tip. Quick intro from YouTube: \"The Replicant is a ballet of metallic humanoids, their shadows brushing \u0026 merging. Endlessly repeating. Bodies multiply in […]",
    "author": "Alex Billington",
    "published": "Wed, 02 Jul 2025 20:28:44 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/LGNReplicantVideomainimgTsr1.jpg?quality=98",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Animation",
      "Sci-Fi",
      "Short Film",
      "To Watch"
    ]
  },
  {
    "id": "f973e718-cdcb-443b-bae8-b87cbaf7ed91",
    "title": "You Can Now Buy Tickets for Angel Studios’ Founding Father Biopic ‘Young Washington’ Before It’s Even Shot",
    "link": "https://www.indiewire.com/news/general-news/angel-studios-young-washington-movie-tickets-on-sale-1235136621/",
    "description": "Getting a head start on next year's Fourth of July weekend planning just might win you a free pickup truck.",
    "author": "Christian Zilko",
    "published": "Wed, 02 Jul 2025 23:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Angel Studios",
      "Film",
      "Young Washington"
    ]
  },
  {
    "id": "7b46d49b-7259-427c-9bf9-04fc85953602",
    "title": "The Exit of ‘The Last of Us’ Writers Hints Hollywood Might Be Done Playing Nice with Gamers",
    "link": "https://www.indiewire.com/features/commentary/video-game-auteurs-decline-last-of-us-neil-druckmann-hbo-1235136579/",
    "description": "Is Hollywood effectively shutting out the creative input of top gamers, after looting their greatest hits?",
    "author": "Alison Foreman",
    "published": "Wed, 02 Jul 2025 22:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Commentary",
      "Features",
      "Halley Gross",
      "HBO",
      "Neil Druckmann",
      "The Last of Us",
      "Video Games"
    ]
  },
  {
    "id": "f64bf860-bc9f-4337-8036-5e91408ad0b6",
    "title": "Jurassic World Rebirth Review: A Few Roaring Moments, A Rehashed Plot",
    "link": "https://bleedingcool.com/movies/jurassic-world-rebirth-review-a-few-roaring-moments-a-rehashed-plot/",
    "description": "Jurassic World Rebirth is ultimately one of the better entries in the modern Jurassic World series of films, but that bar is so low we could stub our toes on it, so it's not saying much.",
    "author": "Kaitlyn Booth",
    "published": "Wed, 02 Jul 2025 19:02:03 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Kaitlyn Booth",
      "Movies",
      "Review",
      "Universal",
      "jurassic world rebirth"
    ]
  },
  {
    "id": "e0eafee6-0496-4926-9f43-551463e535f3",
    "title": "The Fantastic Four: First Steps – New BTS Featurette Released",
    "link": "https://bleedingcool.com/movies/the-fantastic-four-first-steps-new-bts-featurette-released/",
    "description": "Marvel released a new behind-the-scenes featurette for The Fantastic Four: First Steps, spotlighting some of the production's practical elements.",
    "author": "Kaitlyn Booth",
    "published": "Wed, 02 Jul 2025 16:46:03 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "20th Century Studios",
      "Marvel Studios",
      "Movies",
      "the fantastic four: first steps"
    ]
  },
  {
    "id": "94a600fb-d916-4891-a19b-65c8df773820",
    "title": "‘Nine Perfect Strangers’ Season 2 Ending Explained: It’s All About Connections",
    "link": "https://deadline.com/2025/07/nine-perfect-strangers-season-2-ending-explained-1236448620/",
    "description": "SPOILER ALERT: This post spoils the finale episode of Nine Perfect Strangers Season 2. Season 2 of Nine Perfect Strangers has come to an end on Hulu. The show’s first season arrivd in 2021, based on Liane Moriarty’s novel and the nine characters within it that visited Nicole Kidman’s Masha Dmitrichenko in fictional Cabrillo, California […]",
    "author": "Dessi Gomez",
    "published": "Thu, 03 Jul 2025 01:02:10 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/07/172441_0171R.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Hulu",
      "Nicole Kidman",
      "Nine Perfect Strangers"
    ]
  },
  {
    "id": "b32f3877-ef17-4bfe-9d67-769d8bdbcb13",
    "title": "Eric Kripke Bids Farewell To ‘The Boys’ Set As He Wraps Final Season",
    "link": "https://deadline.com/2025/07/eric-kripke-the-boys-wraps-final-season-1236448603/",
    "description": "That’s a wrap on Homelander, Hughie and Billy Butcher as The Boys completes production on its fifth and final season. Series creator Eric Kripke bid farewell to the set for the Prime Video series adaptation of the comic book, sharing a tribute Tuesday on Instagram with a photo of himself in The Seven’s conference room […]",
    "author": "Glenn Garner",
    "published": "Thu, 03 Jul 2025 00:28:01 +0000",
    "image": "https://deadline.com/wp-content/uploads/2023/11/The-Boys-Homelander-e1751501134928.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Amazon",
      "Amazon Prime Video",
      "Eric Kripke",
      "Prime Video",
      "The Boys"
    ]
  }
]
