[
  {
    "id": "a41f1222-d7fd-4db6-b37c-b328da12665d",
    "title": "‘Boop!’ Review: This Cartoon of a Broadway Musical is Stuck in Two Dimensions",
    "link": "https://variety.com/2025/legit/reviews/boop-review-broadway-musical-1236361705/",
    "description": "Following on the high heels of the 2023 hit film “Barbie,” “Boop! The Musical” likewise aims to remake and rebrand another dated pop character for contemporary times and audiences. Unlike Barbie, who has had a ubiquitous cultural presence for decades, Betty Boop is a Depression-era cartoon character of a jazz-age flapper, and in looks, attitude […]",
    "author": "Gordon Cox",
    "published": "Tue, 08 Apr 2025 01:00:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/04/BOOP_BROADWAY_SETUPS_0702_PJZEDIT_v001-1.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Reviews",
      "Betty Boop",
      "Boop!",
      "Jasmine Amy Rogers"
    ]
  },
  {
    "id": "1e0ad0b2-e96e-4720-8f49-c76a51d1fd36",
    "title": "Jon Gries on Greg’s Sexual Fantasies and His ‘White Lotus’ Season 3 Ending: ‘I Don’t Know if There’s Ever Going to Be a Resolution’",
    "link": "https://variety.com/2025/tv/news/jon-gries-white-lotus-ending-greg-sexual-fantasies-1236362581/",
    "description": "SPOILER ALERT: This story contains spoilers for Season 3 finale of “The White Lotus,” now streaming on Max. When Mike White called him, asking if he’d return to “The White Lotus” for a third season in Thailand, Jon Gries said, “I’m available anytime, anywhere. You name it, I’m there.” But unlike his trips to Hawaii and […]",
    "author": "Ethan Shanfeld",
    "published": "Tue, 08 Apr 2025 01:00:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/04/jon-gries-1.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Jon Gries",
      "The White Lotus"
    ]
  },
  {
    "id": "78b20300-d4d0-498c-974b-0e0efa92cac6",
    "title": "Gina Gershon talks HIGH ROLLERS",
    "link": "https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Actress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE. Read the full article on AICN When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience: This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper.    The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience. They are contacted by Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 18 Mar 2025 19:24:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "55add01c-8be2-435a-b401-f8cd2cc3ae5b",
    "title": "New Releases - RAGING MIDLIFE and AMERICAN DREAMER",
    "link": "https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric reviews (new) releases RAGING MIDLIFE and AMERICAN DREAMER. Read the full article on AICN Hello all! McEric here with a quick review of two (new) releases hitting the market this St. Patrick's Day Weekend, both of which I actually enjoyed. RAGING MIDLIFE First was RAGING MIDLIFE, a movie that was pitched to me as starring Paula Abdul (I'm a massive fan), Eddie Griffin (DOUBLE TAKE), Walter Koenig (STAR TREK), and Motch O. Mann, the world's foremost Macho Man Randy Savage impersonator. Yeah, I hear it, too. Luckily, I didn't read any further. I saw Paula Abdul's name and shouted \"I'm in!\" Going in to this film blind is the best way to see it. As I'm furnishing you with a review, however, I must speak further to the film. If you want to skip down to AMERICAN DREAMER and go in blind, I do suggest it. Otherwise, here we go. The film, written by Nic Costa and Rob Taylor, and directed by the latter, follows childhood friends Alex and Mark, now in their midlives (see that?) who are chasing their dragon - a purple tanktop once worn by their favorite wrestler, Raging Abe. Raging Abe is a Macho Man Randy Savage-type character who wears a stove pipe hat and chin beard and lives by five \"proclamations,\" all meant to help his young fans navigate life and walk as better people. The film opens with grainy footage of a talk show appearance (think Arsenio Hall) from Raging Abe and his handler, Mary Todd, played by Abdul. The action opens in the eighties with young Alex and Mark ringside Finish the article on AICN",
    "author": "McEric",
    "published": "Sat, 15 Mar 2025 16:35:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "e2bc172a-ab97-4fb0-8902-1a6c1965a915",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for April 2025",
    "link": "https://www.comingsoon.net/guides/features/1948327-wheel-of-fortune-bonus-puzzle-april-2025-today-answer-tonight",
    "description": "The bonus round solutions for April. The post Wheel of Fortune Bonus Puzzle Answer Today for April 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Tue, 08 Apr 2025 00:07:08 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/04/wheel-of-fortune-bonus-puzzle-answer-tonight-today-april-2025.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "Evergreen",
      "exclude_from_yahoo",
      "Game Show",
      "Ryan Seacrest",
      "Sony Pictures",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "5778bba1-8a74-478f-853d-4c3c0c2fe2c1",
    "title": "Jackie Martling Net Worth 2025: How Much Money Does He Make?",
    "link": "https://www.comingsoon.net/guides/news/1951456-jackie-martling-net-worth-2025-money-make-have-earnings",
    "description": "Netizens have expressed curiosity to know Jackie Martling’s net worth in 2025. A comedian and radio personality with decades of experience in comedy, radio, and writing, he has built a steady career in entertainment. Now, many are wondering how much wealth he has accumulated and the diverse streams contributing to it. Without more delay, let’s […] The post Jackie Martling Net Worth 2025: How Much Money Does He Make? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Disheeta Maheshwari",
    "published": "Mon, 07 Apr 2025 22:52:07 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/04/MixCollage-08-Apr-2025-04-20-AM-7173.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "exclude_from_yahoo",
      "Jay Martling",
      "Net Worth",
      "Net Worth 2025",
      "Pop Culture"
    ]
  },
  {
    "id": "aa8a726b-4d1f-425d-8549-fbe2d7db0f14",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "b64ce024-0433-4321-a463-5d7ec4f98bfa",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "5b0573dd-242b-429c-9834-437800415892",
    "title": "Drew Barrymore Fondly Remembers Val Kilmer: “So Nurturing And Kind And Safe”",
    "link": "https://deadline.com/2025/04/drew-barrymore-val-kilmer-batman-forever-1236362857/",
    "description": "While chatting with guest Kevin Bacon on her eponymous daytime program, Drew Barrymore fondly reminisced about working with Val Kilmer, who along with director Joel Schumacher, convinced her to star in Batman Forever. The tender moment came up as The Bondsman star reflected on various old projects of his, including 1990’s Flatliners, which the late […]",
    "author": "Natalie Oganesyan",
    "published": "Tue, 08 Apr 2025 00:42:28 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/04/batman-forever.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Drew Barrymore",
      "Kevin Bacon",
      "The Drew Barrymore Show",
      "Val Kilmer"
    ]
  },
  {
    "id": "2e78a07b-789c-4f1b-890c-47fbfc7db6cf",
    "title": "‘White Lotus’ Creator Mike White Addresses Season 3 Criticism \u0026 Scene Between Piper \u0026 Belinda’s Son Zion He Cut From Finale",
    "link": "https://deadline.com/2025/04/white-lotus-mike-white-season-3-criticism-1236362804/",
    "description": "Mike White is giving insight into The White Lotus following the Season 3 finale on HBO. The creator, writer, and executive producer of the hit series addressed the criticism the show received throughout its third season, with viewers saying it was too slow. “The pacing and the vibe… it definitely gets under their skin,” White […]",
    "author": "Armando Tinoco",
    "published": "Tue, 08 Apr 2025 00:15:17 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/04/mike-white-the-white-lotus.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "HBO",
      "Mike White",
      "The White Lotus"
    ]
  },
  {
    "id": "88ce20fe-aa26-40d7-b78a-28aaece68d0e",
    "title": "This Cancelled Minecraft Movie Concept Art Looks Better Than What We Got",
    "link": "https://www.slashfilm.com/1828965/minecraft-cancelled-movie-concept-art/",
    "description": "The Minecraft Movie took a long time to make it to the big screen. Now, some concept art from a cancelled version of the film has leaked online.",
    "author": "Witney Seibold",
    "published": "Mon, 07 Apr 2025 22:45:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/this-cancelled-minecraft-movie-concept-art-looks-better-than-what-we-got/l-intro-1744051942.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Comedy Movies",
      "Fantasy Movies"
    ]
  },
  {
    "id": "5ccafe3a-e0f1-4905-9a4e-88ac059812d9",
    "title": "MTV's Underrated Scream TV Series Features A Beloved Reacher Star",
    "link": "https://www.slashfilm.com/1825242/mtv-underrated-scream-horror-tv-series-reacher-star-willa-fitzgerald/",
    "description": "A star of Prime Video's Reacher previously played a key role on MTV's Scream TV show, which took the classic horror film franchise to the small screen.",
    "author": "Quinn Bilodeau",
    "published": "Mon, 07 Apr 2025 22:20:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/mtvs-underrated-scream-tv-series-features-a-beloved-reacher-star/l-intro-1743607659.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Horror Shows",
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "f2f1e4dd-5853-44be-9e95-77ab44a36cb0",
    "title": "Rami Malek Decided to Produce After Paul Thomas Anderson Cut His Monologue in ‘The Master’",
    "link": "https://www.indiewire.com/news/general-news/rami-malek-the-master-monologue-cut-1235113822/",
    "description": "\"I labored over it for so long,\" Malek, who now stars in and executive produces \"The Amateur,\" said.",
    "author": "Samantha Bergeson",
    "published": "Mon, 07 Apr 2025 23:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Film",
      "Paul Thomas Anderson",
      "Rami Malek",
      "The Master"
    ]
  },
  {
    "id": "0701f6c5-f88f-42f9-9cb8-7fcc1c86d290",
    "title": "Carrie Coon: People Would Be ‘Surprised’ by MCU Salaries",
    "link": "https://www.indiewire.com/news/general-news/carrie-coon-marvel-salaries-surprising-1235113843/",
    "description": "\"The White Lotus\" star previously turned down reprising her \"Infinity War\" role for \"Avengers: Endgame\" amid a pay dispute.",
    "author": "Samantha Bergeson",
    "published": "Mon, 07 Apr 2025 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Carrie Coon",
      "Film",
      "Marvel"
    ]
  },
  {
    "id": "df7cda5c-331c-4faa-94da-a76b884d6ef7",
    "title": "TRON: Ares Director Says ARES Just Wants To Be A Real Boy",
    "link": "https://bleedingcool.com/movies/tron-ares-director-says-ares-just-wants-to-be-a-real-boy/",
    "description": "TRON: Ares director Joachim Rønning explains that ARES, played by Jared Leto, is \"a bit like Pinocchio\" and wants to be a real boy.",
    "author": "Kaitlyn Booth",
    "published": "Mon, 07 Apr 2025 18:47:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Disney",
      "Movies",
      "Tron: Ares"
    ]
  },
  {
    "id": "e8ca7463-e4a2-43a3-9818-113e0f3a2d30",
    "title": "The Fantastic Four: First Steps Exists In In \"Our Own Little Corner\"",
    "link": "https://bleedingcool.com/movies/the-fantastic-four-first-steps-exists-in-in-our-own-little-corner/",
    "description": "Director Matt Shakman has revealed that The Fantastic Four: First Steps exists in its own universe, which was \"wonderful and liberating.\" Plus, a new poster.",
    "author": "Kaitlyn Booth",
    "published": "Mon, 07 Apr 2025 16:03:06 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Marvel Studios",
      "Movies",
      "the fantastic four: first steps"
    ]
  },
  {
    "id": "df084ce7-02e9-4232-a111-c4ab66faaa72",
    "title": "One More Trailer for 'Home Sweet Home: Rebirth' Thai Action Horror",
    "link": "https://www.firstshowing.net/2025/one-more-trailer-for-home-sweet-home-rebirth-thai-action-horror/",
    "description": "\"By closing the Gates of Hell, you'll be saving them, too!\" Hopefully. 💀 Vertical just revealed another new official trailer for the movie Home Sweet Home: Rebirth, also written the opposite as Rebirth: Home Sweet Home. It's made by two VFX supervisors directing together, adapted directly from the video game called Home Sweet Home - a single-player, first-person survival/horror/puzzle video game from Thailand. They turned a big, crazy, supernatural horror video game into live-action movie set in Thailand. When a city is overrun with a demonically-possessed crowd of violent people, a cop must uncover the source of evil to save his family (and sure everyone else). Starring Michele Morrone, William Moseley, and Urassaya Sperbund. To save the city, and his trapped family, Jake must ally himself with a mysterious Novice Monk and embark on a journey through the supernatural world of \"The Hindrance\" to shut the Gates of Hell. I am surprised to see that this US trailer does not show the giant skeleton monster in it at all. Even though it's on the poster and in the UK trailer many times, yet in this trailer they don't even hint at it. Huh. Very strange... Here's the official US trailer […]",
    "author": "Alex Billington",
    "published": "Mon, 07 Apr 2025 18:43:30 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/RebirthHomesweetVfxbigmainTsr2.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Foreign Films",
      "Horror",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "d29ae594-ac32-408b-9167-7b20ecc7cbd1",
    "title": "Musicician Doc 'Swamp Dogg Gets His Pool Painted' Official Trailer",
    "link": "https://www.firstshowing.net/2025/musicician-doc-swamp-dogg-gets-his-pool-painted-official-trailer/",
    "description": "\"This is just a dream, but again, it could be reality.\" Magnolia Pictures has revealed an official trailer for a peculiar documentary film titled Swamp Dogg Gets His Pool Painted, arriving to watch in theaters this May. Yes indeed it's about \"the soul genius time forgot\" aka Swamp Dogg and his home in Los Angeles. This premiered at last year's SXSW Film Festival with reviews saying it's as vibey all the music he has produced over the years. Cult musician Swamp Dogg and his housemates Moogstar \u0026 Guitar Shorty turned their Los Angeles home into an artistic haven. Together they travel through the music biz, forming a friendship transcending eras. Hidden away, deep in the suburbs, the legendary Swamp Dogg, alongside his two friends, have transformed their home into an artistic playground. They discuss the music industry and their lives dwelling in this suburban sanctuary. Featuring Swamp Dogg (aka Jerry Williams Jr.), with Alonzo Williams, Moogstar, Tom Kenny, Mike Judge, Dr. Jeri Williams, Johnny Knoxville, Naeem Juwan, \u0026 John Prine. This looks most fascinating as a time capsule doc featuring stories about music \u0026 how its changed over the years. Here's the official trailer for Gale \u0026 Olson's doc Swamp […]",
    "author": "Alex Billington",
    "published": "Mon, 07 Apr 2025 18:04:04 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/SwampDoggPoolpostermainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Comedy",
      "Documentaries",
      "To Watch",
      "Trailer"
    ]
  }
]
