[
  {
    "id": "0cea1137-99ed-4073-9632-8f2515ec5622",
    "title": "Marvel Adds Possible Fourth Movie to 2028 Slate",
    "link": "https://variety.com/2025/film/news/marvel-possible-fourth-movie-2028-1236435873/",
    "description": "Disney announced on Wednesday that Marvel Studios is scheduled to release an untitled movie on Dec. 15, 2028. It would be the fourth feature from the division set for that calendar year, with previously announced films scheduled for release in February, May and November of 2028. Should all four films hold onto those dates — […]",
    "author": "Adam B. Vary",
    "published": "Thu, 19 Jun 2025 01:00:19 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/06/2163996735.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Marvel Studios"
    ]
  },
  {
    "id": "5fc50c2a-43b7-4b47-b7eb-1ac72b0f8d25",
    "title": "Justin Baldoni Can Seek Messages Between Taylor Swift and Blake Lively, Judge Rules",
    "link": "https://variety.com/2025/film/news/justin-baldoni-seek-taylor-swift-blake-lively-judge-rules-1236435847/",
    "description": "A judge ruled Wednesday that Justin Baldoni can obtain messages between Blake Lively and Taylor Swift that pertain to “It Ends With Us” and the legal melee between the film’s co-stars. Lively had asked Judge Lewis Liman to prevent Baldoni from obtaining such messages, arguing that Baldoni was dragging Swift into the conflict as part […]",
    "author": "Gmaddaus",
    "published": "Thu, 19 Jun 2025 00:05:03 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/01/swift-baldoni-lively-split.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Blake Lively",
      "Justin Baldoni",
      "Taylor Swift"
    ]
  },
  {
    "id": "04c2a105-e619-4dee-a59c-0744fc71dd38",
    "title": "One Of Netflix's Best Shows May Return, But Not In The Form You'd Expect",
    "link": "https://www.slashfilm.com/1890170/netflix-best-show-mindhunter-movies/",
    "description": "Fans of Netflix's Mindhunter have been desperate for closure following the series' cancellation, and there are rumblings that it might finally happen.",
    "author": "Jeremy Mathai",
    "published": "Wed, 18 Jun 2025 22:11:47 +0000",
    "image": "https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/l-intro-1750284486.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "TV News",
      "Drama Movies",
      "Thriller Movies",
      "Drama Shows",
      "Thriller Shows"
    ]
  },
  {
    "id": "58221c34-25af-49ef-8a88-c7bc9838eae4",
    "title": "28 Years Later Review: A Scary, Gruesome, And Surprisingly Emotional Horror Saga",
    "link": "https://www.slashfilm.com/1889645/28-years-later-review/",
    "description": "28 Days Later is both very scary and surprisingly emotional, although a baffling ending robs the film of some of its power.",
    "author": "Chris Evangelista",
    "published": "Wed, 18 Jun 2025 21:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/28-years-later-review-a-scary-gruesome-and-surprisingly-emotional-horror-saga/l-intro-1750259905.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Movie Reviews",
      "Horror Movies"
    ]
  },
  {
    "id": "a1851b0b-0834-47b6-b67a-7ef5e20ddfa9",
    "title": "THE DAILY SHOW writer Daniel Radosh and editor Lauren Beckett Jackson Interview",
    "link": "https://www.aintitcool.com/interview-the-daily-show-writer-editor-83616/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coaxial",
    "description": "McEric sits down with THE DAILY SHOW writer Daniel Radosh and editor Lauren Beckett Jackson for an interview Read the full article on AICN Comedy Central’s “The Daily Show” has been on-air for almost thirty years, garnering 26 PrimeTime Emmy Awards and several Peabody Awards for its writing and execution. Many are familiar with the show’s blend of current news commentary and informational journalism from comedians like Jon Stewart, Stephen Colbert, Steve Carrell, John Oliver, Samatha Bee, Roy Wood, Jr, Rob Riggle, Jordan Klepper, Wyatt Cenac, Hasan Minhaj, Larry Whitmore, Lewis Black, Desi Lydic, Ronny Chieng, Michael Kosta, and a bevy of others. “The Daily Show’s” audience has grown up alongside the show, with viewership now skewing in higher age demographics than the coveted 18-34 bracket it dominated during its inception. That maturity is reflected in the current iteration of the show, with Stewart hosting on Monday’s while the rest of “The Best F**king News Team” fill in the remainder of the week. “The Daily Show” is a bit of a misnomer as the show broadcasts nightly on Comedy Central (or Paramount+ for those living in the streaming age) from Monday to Thursday. I suppose “The Intermittent Show” just doesn’t have the same ring to it. “The Daily Show” is not unique in its position as a satirical news program, however it remains the definitive iteration of the format. Everyone knows about “The Daily Show,” love it or hate it. A foundational pillar of the show’s ubiquity and popularity is in the writing and execution of the show, which stands head and shoulders above its contemporaries.   I was honored to speak with senior writer Daniel Radosh Finish the article on AICN",
    "author": "McEric",
    "published": "Fri, 13 Jun 2025 16:57:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "4658848d-1359-498b-bc26-cc5c700742f4",
    "title": "Scott Adkins Talks DIABLO",
    "link": "https://www.aintitcool.com/scott-adkins-interview-diablo-mceric-83615/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Scott Adkins talks with McEric about his new action film, DIABLO Read the full article on AICN If you’re a fan of current action films then you likely know the name Scott Adkins. He’s either kicked the ass of or had his ass kicked by every action star of the last five decades: Dolph Lundgren, Jackie Chan, Sylvester Stallone, Jean Claude Van Damme, Jet Li, and even Keanu Reeves. That’s right - he was the big guy with the grill in JOHN WICK CHAPTER 4.  Scott’s newest film is DIABLO, which hits theaters and on demand this Friday, June 13th. Conceived alongside action compatriot Marko Zaror, the film takes place in Colombia following Adkins as Kris, a former convict, who seeks to make good on a promise to a fallen friend, which runs him afoul of Zaror’s mercenary, El Corvo. This film isn’t just another straight-to-streaming no-budget piece of content - DIABLO delivers on every front. The fight scenes, choreographed by Zaror, are intense and deftly photographed, thanks to director Ernesto Diaz Espinoza. The gunplay is intense, the acting is top tier, and the film never lags.    Marko Zaror steals his scenes as El Corvo, a mercenary with an iron fist, literally. The six-foot-two Chilean action star has a chilling villain introduction, followed by a massive action scene in a sketchy hideout that plays out like a scene from TERMINATOR. He mows through assailants and bystanders alike with no emotion, only showing a hint of fear when Adkins’s Kris shows up to give him a real fight. El Corvo is fucking terrifying. Their final confrontation is a throwback to Finish the article on AICN",
    "author": "McEric",
    "published": "Wed, 11 Jun 2025 05:48:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "40844d92-524b-4370-a4fd-1178a6abe725",
    "title": "‘28 Years Later’ Director Danny Boyle On Return To Horror Series \u0026 Whether 007 Is In His Future – Crew Call Podcast",
    "link": "https://deadline.com/2025/06/28-years-later-danny-boyle-1236437249/",
    "description": "Yes, there’s a lot of horror movies out right now, and there’s a lot of zombie everywhere from TV to film, but when they’re great, they’ll definitely find an audience. Enter the next installment of Danny Boyle’s 28 infected feature series, 28 Years Later, which truly elevates the undead genre to sophisticated storytelling (a helluva […]",
    "author": "anthonypauldalessandro",
    "published": "Thu, 19 Jun 2025 00:59:34 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/06/Crew-Call-28-Years-Later.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "28 Years Later",
      "Crew Call",
      "Crew Call Podcast",
      "Danny Boyle"
    ]
  },
  {
    "id": "380e4275-7d4e-4cef-9650-0b40336c5da7",
    "title": "‘Nobody Wants This’ Creator Erin Foster Talks Season 2 Timeline, Leighton Meester And Adam Brody Together On Screen",
    "link": "https://deadline.com/2025/06/nobody-wants-this-season-2-news-1236437373/",
    "description": "Erin Foster’s runaway hit comedy series Nobody Wants This had Netflix viewers falling head over heels in love with the IRL meet-cute romance between agnostic podcaster Joanne (Kristen Bell) and Rabbi Noah Roklov (Adam Brody). For Foster, who loosely based the show on the story of meeting her own husband, heading into Season 2 meant […]",
    "author": "Antonia Blyth",
    "published": "Wed, 18 Jun 2025 23:58:39 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/06/GettyImages-2218291525.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Adam Brody",
      "Alex Karpovsky",
      "Bruce Eric Kaplan",
      "Erin Foster",
      "Girls",
      "jenni konner",
      "Kristen Bell",
      "Leighton Meester",
      "Netflix",
      "Nobody Wants This"
    ]
  },
  {
    "id": "accdf16f-5408-4c4c-97c9-6c3aef211250",
    "title": "Why Has Ju Haknyeon Left The BOYZ? Group Exit Explained",
    "link": "https://www.comingsoon.net/guides/news/1990989-ju-haknyeon-the-boyz-exit-explained-reason",
    "description": "K-pop star Ju Haknyeon has left the music group The Boyz. The K-pop act’s managing agency, One Hundred, released an official statement regarding the 26-year-old artist’s sudden exit from the group. The music agency revealed personal issues as the cause of Ju Haknyeon’s departure from The Boyz. So, why exactly did Haknyeon leave The Boyz? […] The post Why Has Ju Haknyeon Left The BOYZ? Group Exit Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Arpita Adhya",
    "published": "Thu, 19 Jun 2025 01:14:54 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/06/MixCollage-19-Jun-2025-06-41-AM-8812.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Ju Haknyeon",
      "K-Pop",
      "Pop Culture",
      "Pop Culture FAQ",
      "the boyz"
    ]
  },
  {
    "id": "39de2945-d76f-4fe2-b27c-9abf126c7a50",
    "title": "Chris Evans Teases Possible Future Collab With Wife Alba Baptista",
    "link": "https://www.comingsoon.net/pop-culture/news/1991034-chris-evans-wife-alba-baptista-work-in-future",
    "description": "Chris Evans is ready to take his partnership with wife Alba Baptista from the audition reads to the big screen. The actor revealed he would “love to” work with the Portuguese actress professionally in a recent interview. The Captain America star also disclosed that he already helps Baptista, 27, prepare for auditions. So, what more […] The post Chris Evans Teases Possible Future Collab With Wife Alba Baptista appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Arpita Adhya",
    "published": "Thu, 19 Jun 2025 00:51:32 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/06/MixCollage-19-Jun-2025-06-18-AM-6622.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Pop Culture",
      "alba baptista",
      "Chris Evans",
      "Pop Culture News"
    ]
  },
  {
    "id": "49a41788-61a4-4bf8-9c92-b7a94cccd49c",
    "title": "Review: Boyle's '28 Years Later' Reinvents the Zombie Genre (Again)",
    "link": "https://www.firstshowing.net/2025/review-boyles-28-years-later-reinvents-the-zombie-genre-again/",
    "description": "\"There are many kinds of death... and some are better than others.\" 💀 This is what happens when you get Danny Boyle \u0026 Alex Garland back together again! They will make more mad genius movies that push the boundaries of horror cinema and reinvent entire genres! Reunited after 18 years (they last made Sunshine together back in 2007), director Danny Boyle and screenwriter Alex Garland are ready to unleash 28 Years Later upon the world. This legacy sequel is a follow-up to their indie zombie movie classic 28 Days Later, wondering where things would be roughly 28 years after the rage virus wiped out the UK and how people, and zombies, would've evolved since then. I'm just going to say it – this is the best of the 28 movies. Yes it's even better than 28 Days Later, and a much better sequel than 28 Weeks Later. What I was not ready for is how Boyle once again reinvents the zombie genre by trying out new ideas. They even finally drop \"zombie\" into the dialogue at one point, as this unkillable rage virus has turned humans into something else entirely. In many ways, 28 Years Later is an homage to […]",
    "author": "Alex Billington",
    "published": "Wed, 18 Jun 2025 21:55:36 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/28YearsLaterposter1mainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Horror",
      "Review"
    ]
  },
  {
    "id": "f2816b6e-011b-4105-89b9-cb4db6078c85",
    "title": "Remember This in 2009? 'Trainwreck: Balloon Boy' Netflix Doc Trailer",
    "link": "https://www.firstshowing.net/2025/remember-this-trainwreck-balloon-boy-netflix-doc-trailer/",
    "description": "\"What if my stupid experiment kills my son?\" Who remembers this story? Of course we all do... How could anyone forget?! Netflix has revealed an official trailer for the doc Trainwreck: Balloon Boy, the next in their Trainwreck series of unforgettable moments from history. A homemade flying saucer lifts off, and a 6-year-old boy might be inside. National panic ensues when the media begins to cover it non-stop — but what truly happened? This documentary investigates the real story of the Heene Family. It is made by filmmaker Gillian Pachter and delves into this breaking news story in October 2009. A dad claims his son is trapped in a runaway helium balloon - a \"flying saucer\" from his backyard. News helicopters follow the chase live once they spot the silver UFO. However, the balloon lands safely and there's no one inside, sparking outrage at the family as the story becomes one of America's most infamous hoaxes. The boy was just hiding in the attic all along. It makes me sad they had go to through this – especially when everyone really was safe and sound. Here's the official trailer (+ poster) for Gillian Pachter's doc Trainwreck: Balloon Boy, from YouTube: […]",
    "author": "Alex Billington",
    "published": "Wed, 18 Jun 2025 20:06:20 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/BalloonBoydocpostermainTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "305da5b8-6b9e-459c-ac8b-8f420298f74b",
    "title": "Everything to Remember from ‘Squid Game’ Season 1 and 2",
    "link": "https://www.indiewire.com/features/general/squid-game-everything-to-remember-before-season-3-1235079680/",
    "description": "The Netflix phenomenon returns on June 27 for its third and final season.",
    "author": "Proma Khosla",
    "published": "Wed, 18 Jun 2025 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Features",
      "General",
      "Netflix",
      "Squid Game",
      "TV"
    ]
  },
  {
    "id": "be9d8666-6af3-46c0-9c54-251e39ad8bf1",
    "title": "‘Matlock’ Production Designer Adam Rowe on How Two Canceled Shows Gave the CBS Hit Its Scale",
    "link": "https://www.indiewire.com/features/craft/matlock-production-design-interview-shot-in-la-1235133453/",
    "description": "Rowe tells IndieWire how a set he built for one show — then developed further on a second — eventually became the massive law office on the Kathy Bates legal drama.",
    "author": "Jim Hemphill",
    "published": "Wed, 18 Jun 2025 21:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Craft | Technology, Sound and Set Design",
      "Features",
      "Adam Rowe",
      "CBS",
      "Matlock",
      "Top of the Line",
      "TV"
    ]
  },
  {
    "id": "bed05281-d875-4ca6-8882-a359746dc3ea",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "24193326-1c9a-4b26-867d-b358a4884027",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "c7ad176a-63ad-4ac1-aff5-9e8335797764",
    "title": "SAW Franchise Sale To Blumhouse Is Now Official",
    "link": "https://bleedingcool.com/movies/saw-franchise-sale-to-blumhouse-is-now-official/",
    "description": "Lionsgate and Blumhouse have officially taken co-control over the rights to the SAW franchise. How fast will SAW 11 come out now?",
    "author": "Jeremy Konrad",
    "published": "Wed, 18 Jun 2025 20:01:03 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Lionsgate",
      "Movies",
      "atomic monster",
      "blumhouse",
      "lionsgate",
      "saw"
    ]
  },
  {
    "id": "434d28dd-bef2-447e-a575-022d4d0829b6",
    "title": "Emily Blunt Says The Devil Wears Prada Sequel Will Film in July",
    "link": "https://bleedingcool.com/movies/emily-blunt-says-the-devil-wears-prada-sequel-will-film-in-july/",
    "description": "After years of waiting, Emily Blunt confirms that the sequel to The Devil Wears Prada is expected to head into production this July.",
    "author": "Aedan Juvet",
    "published": "Wed, 18 Jun 2025 16:57:03 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Disney",
      "Movies",
      "disney",
      "emily blunt",
      "film",
      "the devil wears prada"
    ]
  }
]
