[
  {
    "id": "332aa1c2-df71-47c0-bd33-029a259f7db3",
    "title": "Carl Dean, Dolly Parton’s Husband, Dies at 82",
    "link": "https://variety.com/2025/music/news/carl-dean-dead-dolly-parton-husband-1236326795/",
    "description": "Carl Dean, Dolly Parton’s little-seen but often talked-about husband of six decades, has died, the singer announced Monday on social media. He was 82. “Carl and I spent many wonderful years together,” Parton wrote in an Instagram post. “Words can’t do justice to the love we shared for over 60 years. Thank you for your […]",
    "author": "Chris Willman",
    "published": "Tue, 04 Mar 2025 00:34:05 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/06/Dolly-Parton.-Photo-courtesy-of-Dolly-Parton.-Photo-by-Jim-Wright-e1717640932850.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Obituaries",
      "People News",
      "Dolly Parton"
    ]
  },
  {
    "id": "a2f6cf43-ab67-4d96-b44d-5c4275b452af",
    "title": "Paul McCartney Asks Rock Hall of Fame to Induct Joe Cocker: ‘He Would Be Extremely Happy’ to ‘Find Himself Where He Deserves to Be’",
    "link": "https://variety.com/2025/music/news/paul-mccartney-joe-cocker-rock-hall-fame-induct-letter-1236326727/",
    "description": "Paul McCartney is petitioning for late English blues-rock singer Joe Cocker to be inducted into the Rock Hall of Fame this year. In a letter dated Feb. 25, and addressed to “rock and rollers,” McCartney described Cocker, who died in 2014 at age 70, as a “great man and a fine singer” with a unique […]",
    "author": "Thania Garcia",
    "published": "Tue, 04 Mar 2025 00:15:35 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/03/2-Split-3x2-4.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Joe Cocker",
      "Paul Mccartney",
      "Rock and Roll Hall of Fame"
    ]
  },
  {
    "id": "b976bbba-0541-4f83-8067-a591e6d1334b",
    "title": "How Tall Is Alan Ritchson's Jack Reacher In The Series Vs. The Books?",
    "link": "https://www.slashfilm.com/1799712/alan-ritchson-jack-reacher-height-series-books/",
    "description": "When it came time to find an actor to play Jack Reacher on Prime Video's Reacher series, physical accuracy for the character proved to be a big deal.",
    "author": "Joe Roberts",
    "published": "Mon, 03 Mar 2025 23:45:23 +0000",
    "image": "https://www.slashfilm.com/img/gallery/how-tall-is-alan-ritchsons-jack-reacher-in-the-series-vs-the-books/l-intro-1740514557.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "8ed429ca-1c7a-4081-b8bf-dd1f7bd96cb9",
    "title": "Why Michael Richards Refused To Meet The Real-Life Inspiration For Seinfeld's Kramer",
    "link": "https://www.slashfilm.com/1801597/why-michael-richards-refused-meet-real-life-kramer-seinfeld/",
    "description": "Cosmo Kramer's inspiration, Kenny Kramer, is as eccentric as his counterpart on Seinfeld, even though Michael Richard deliberately avoided meeting him.",
    "author": "Jeremy Smith",
    "published": "Mon, 03 Mar 2025 23:20:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-michael-richards-refused-to-meet-the-real-life-inspiration-for-seinfelds-kramer/l-intro-1740772567.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Comedy Shows"
    ]
  },
  {
    "id": "ed04a3a6-6297-4923-80b1-697a45747ece",
    "title": "Director Simon West and Star Lucy Liu Talk OLD GUY",
    "link": "https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Director Simon West and star Lucy Liu talk OLD GUY, starring Christoph Waltz, now streaming everywhere! Read the full article on AICN Director Simon West should be a household name; his first film was a little picture from 1997 called CON AIR. Perhaps you've heard of it? He went on to helm similar big budget action extravaganzas, such as 2001's LARA CROFT: TOMB RAIDER and 2012's THE EXPENDABLES 2. Eventually, however, time and changing tastes caught up with West, and now he's directing smaller budget flicks, from action to drama, that move at a slightly slower pace and appeal to a different audience.  The same could be said for Danny Dolinski, the titular OLD GUY of West's latest feature, played by Academy-Award Winner Christoph Waltz (INGLORIOUS BASTERDS, THE GREEN HORNET). Danny's a wetworks expert in a field saturated with hot young assassins, desperately trying to prove he's still relevant, often to his detriment. After recovering from a wrist injury that found him relegated to a cleaner role at a local bakery, Danny is itching to get back in the field. When he's told the only role available is support for young assassing Wihlborg (Cooper Hoffman), he is understandably unenthused. He invites his longtime friend Anata (Lucy Liu) along for their job since it'll take them to some charming locations around Europe, and once underway, tries to take point on every hit. Things don't go as planned. As you can probably already divine, there are so many parallels between Waltz's OLD GUY and West's career. Danny was once the best, the biggest game in town, and his name still opens doors... but the game has Finish the article on AICN",
    "author": "McEric",
    "published": "Wed, 26 Feb 2025 20:15:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "bd365aa1-68e6-4349-b939-5906f3c57717",
    "title": "Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE",
    "link": "https://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE, Edward Burns' latest with Eric McClanahan Read the full article on AICN Edward Burns made quite the impression after winning the Best Picture prize at the Sundance Film Festival with his 1995 masterpiece THE BROTHERS MCMULLEN, signifying the emergence of a new and singular voice. The plot synopsis for the film was \"Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.\" Now, thirty years later, Burns has returned with a new vision, MILLERS IN MARRIAGE, with the plot synopsis sounding vaguely familiar - \"Three Irish Catholic siblings from New York struggle to deal with love, marriage, and infidelity.\" What can I say? Dude's got range. However, I'm not here to say that Edward Burns is a one-trick pony or that MILLERS IN MARRIAGE is recycled and tired. Truth is, I really liked this movie. The cast is impeccable and the narrative kept me interested, even when I thought some plot points were a bit contrived or predictable. Burns crafts characters that we want to care about, even if they're narcissistic, self-destructive, manipulative, or just plain wrong. Burns' gift of character and dialogue is that we are drawn into the maw of the devouring devils of his narratives.  This film is no different. Following the Miller siblings, Andy (Burns), Maggie (Julianna Margulies), and Eve (Gretchen Mol), and their orbiting cadre of lovers. Andy is a painter, fresh off a separation from his wife Tina (Morena Baccarin) and now dating one of her former colleagues Renee (Minnie Driver). Maggie is an active novelist married to inert novelist Nick (Campbell Scott), Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 25 Feb 2025 01:43:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "62a98b0e-4a62-4673-b8dc-427c9f025097",
    "title": "Key Rupert Murdoch Ally Robert Thomson, CEO Of News Corp, Sees “Early Trump 2 Turmoil” Easing Up Soon: “This Is Not A Permanent Revolution”",
    "link": "https://deadline.com/2025/03/rupert-murdoch-donald-trump-robert-thomson-news-corp-ceo-1236309988/",
    "description": "Robert Thomson, a close ally of Rupert Murdoch and CEO of the media titan’s News Corp, said the initial “turmoil” of Donald Trump’s time in the White House is certain to calm down in the coming months. Speaking at the Morgan Stanley Technology, Media \u0026 Telecom Conference, Thomson said the whirlwind early weeks of Trump’s […]",
    "author": "Dade Hayes",
    "published": "Tue, 04 Mar 2025 01:04:10 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/Robert-Thomson.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Donald Trump",
      "News Corp",
      "Robert Thomson",
      "Rupert Murdoch"
    ]
  },
  {
    "id": "7770a13a-86dd-4d2c-9477-53e1d7a22993",
    "title": "Oscars: From Colman Domingo’s Toast To Lap Dogs To Selfies, What TV Cameras Didn’t Catch",
    "link": "https://deadline.com/2025/03/oscars-behind-the-scenes-unseen-moments-1236309939/",
    "description": "Live awards telecasts like the Oscars air with commercials that take up about 15 minutes every hour, which means that we see those attending for about three quarters of the ceremony. During the remaining quarter when the cameras are not rolling, they tend to mingle and have fun. During the 2025 Oscars Sunday, nominee Colman […]",
    "author": "Nellie Andreeva",
    "published": "Tue, 04 Mar 2025 00:28:27 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/ColmanDomingoOscars.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Colman Domingo",
      "Demi Moore",
      "Oscars",
      "Oscars 2025",
      "Timothee Chalamet"
    ]
  },
  {
    "id": "a8bfa9fb-ffc8-4018-a00e-9b9b0d5de32c",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "a53c5f9d-092f-41d3-b98f-658a039393de",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "63e5a662-d818-47cc-a340-849fe468b3e4",
    "title": "Tom Green Net Worth 2025: How Much Money Does He Make?",
    "link": "https://www.comingsoon.net/guides/news/1897567-tom-green-net-worth-2025-money-make-have-earnings",
    "description": "Tom Green is a well-known figure in the entertainment industry and fans are curious to learn what his net worth is in 2025. An outstanding comedian and actor, he has appeared in several popular movies and shows as well as many other projects. Here is everything we know about Green’s net worth in 2025 and […] The post Tom Green Net Worth 2025: How Much Money Does He Make? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Namrata Ghosh",
    "published": "Tue, 04 Mar 2025 01:00:21 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/MixCollage-04-Mar-2025-06-27-AM-8880.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "exclude_from_yahoo",
      "Net Worth",
      "Net Worth 2025",
      "Tom Green"
    ]
  },
  {
    "id": "5218eca5-8b47-40e8-8d7f-22798a52851e",
    "title": "Mario Lopez Net Worth 2025: How Much Money Does He Make?",
    "link": "https://www.comingsoon.net/guides/news/1899273-mario-lopez-net-worth-2025-money-make-have-earnings",
    "description": "Fans are eager to learn Mario Lopez’s net worth in 2025 and how he has accumulated his wealth throughout his career. Over the years, he has not only made his mark as an accomplished and versatile actor but, has also established himself as a beloved TV host. So, here is everything to know about Lopez’s […] The post Mario Lopez Net Worth 2025: How Much Money Does He Make? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Namrata Ghosh",
    "published": "Tue, 04 Mar 2025 00:28:51 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/MixCollage-04-Mar-2025-05-57-AM-7240.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "exclude_from_yahoo",
      "Mario Lopez",
      "Net Worth",
      "Net Worth 2025"
    ]
  },
  {
    "id": "d7c761dd-faa3-4996-b538-e1817fc8b292",
    "title": "The Oscars Are Starting to Represent Anyone, Anywhere, All at Once",
    "link": "https://www.indiewire.com/features/commentary/2025-oscars-diversity-im-still-here-zoe-saldana-1235100820/",
    "description": "Despite mild claims that the Oscars were back to their old ways, the 2025 Academy Awards spotlighted filmmakers from different backgrounds worldwide.",
    "author": "Marcus Jones",
    "published": "Tue, 04 Mar 2025 01:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Commentary",
      "Features",
      "Awards",
      "Film",
      "I'm Still Here",
      "No Other Land",
      "Oscars"
    ]
  },
  {
    "id": "9e401fed-4f71-4b16-a126-ee1f620d0377",
    "title": "Disney+ Shelves ‘Princess and the Frog’ Series — and Its Long-Form Animated Content for Streaming",
    "link": "https://www.indiewire.com/news/business/disney-shelves-princess-frog-series-long-form-animated-content-streaming-analysis-1235100810/",
    "description": "The new path? Short form stuff like \"Bluey\" and prioritizing movies that can go into theaters like \"Moana 2.\"",
    "author": "Brian Welk",
    "published": "Tue, 04 Mar 2025 00:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Business",
      "News",
      "Animation",
      "Bluey",
      "Disney+",
      "The Princess and the Frog",
      "TV"
    ]
  },
  {
    "id": "59c09d10-0af4-462d-8a9f-2a8e28091bc4",
    "title": "Watch: Sean Baker's Rousing Oscars Speech Tribute to Movie Theaters",
    "link": "https://www.firstshowing.net/2025/watch-sean-bakers-rousing-oscars-speech-tribute-to-movie-theaters/",
    "description": "\"Where did we fall in love with the movies? At the movie theater.\" Yep! This is an important speech for movie lovers. You may have heard it already during the Academy Awards presentation, or you may have already watched the video of his speech, but we're sharing it again (view below) - just because it deserves to be shared and heard and repeated. For 20 years, FirstShowing has been a destination operating in support of, reinforcing, encouraging, and celebrating the theatrical experience and all the magic and glory that comes with watching movies in movie theaters. It's still as exhilarating as ever. Everything may have been disrupted during the pandemic, but movie theaters have re-opened, they're showing great movies again all the time, and the theatrical experience is still as moving as it has always been. Anora director Sean Baker won four (!!) Academy Awards last night – during his third win, for Best Director, he took the time to give a speech about movie theaters and why they still matter. It is a rousing, uplifting, vital speech and one of my favorite speeches of the night (along with Kieran, No Other Land, Brody, Flow). Bravo for saying all of […]",
    "author": "Alex Billington",
    "published": "Mon, 03 Mar 2025 21:14:37 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/OscarsSeanBakerwinnermainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Awards",
      "Discuss",
      "Feat",
      "To Watch"
    ]
  },
  {
    "id": "753c1ce0-a0b8-4e8b-a943-340c0ab2396f",
    "title": "Another Murder Mystery Series - BBC's 'Towards Zero' Official Trailer",
    "link": "https://www.firstshowing.net/2025/another-murder-mystery-series-bbcs-towards-zero-official-trailer/",
    "description": "\"Someone, somewhere, unbeknownst to us, laying a trap...\" \"What have you done?!\" BBC \u0026 BritBox have revealed official trailers for the new murder mystery mini-series titled Towards Zero, created by BBC for streaming on BBC's iPlayer. It just launched this week and is available to watch now online if you're curious to find out what is going on in this family. An explosive love triangle, a formidable matriarch, and a house party of enemies. Based on the classic mystery by the best-selling author, Agatha Christie, adapted from her novel also titled \"Towards Zero\". After a scandalous celebrity divorce, a British tennis star - Nevile Strange - and his ex-wife make the unthinkable decision to spend a summer together. This three-part whodunit series involves a recently divorced British tennis player holidaying at his aristocratic aunt's house on the south coast of England in the 1930s, where a widow suddenly ends up dead. The grandiose ensemble cast features Anjelica Huston, Oliver Jackson-Cohen, Ella Lily Hyland, Mimi Keene, Jackie Clune, Grace Doherty, Jack Farthing, Clarke Peters, Matthew Rhys, Anjana Vasan, and Alexander Cobb. This looks like another twisted mystery from Christie's mind. It starts out all calm then gets extra wild at the […]",
    "author": "Alex Billington",
    "published": "Mon, 03 Mar 2025 19:12:13 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/TowardsZeroseriesmainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "36173840-a436-4490-a1d3-ecfced6803af",
    "title": "Will Daredevil: Born Again Debut Benefit From Trump Bump on Tuesday?",
    "link": "https://bleedingcool.com/tv/will-daredevil-born-again-debut-benefit-from-trump-bump-on-tuesday/",
    "description": "It will be interesting to see if Trump speaking to Congress on Tuesday night is a big boost to Marvel's Daredevil: Born Again debut.",
    "author": "Ray Flook",
    "published": "Mon, 03 Mar 2025 18:37:08 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Disney+",
      "Marvel",
      "Movies",
      "Opinion",
      "TV",
      "TV",
      "daredevil",
      "daredevil: born again"
    ]
  },
  {
    "id": "12d30756-4582-4285-897a-e6ea17ddc576",
    "title": "Avengers: Doomsday And Secret Wars Will Be Shot Back-To-Back",
    "link": "https://bleedingcool.com/movies/avengers-doomsday-and-secret-wars-will-be-shot-back-to-back/",
    "description": "The Russo Brothers say that Avengers: Doomsday and Avengers: Secret Wars have stories that will \"be challenging for audiences.\"",
    "author": "Kaitlyn Booth",
    "published": "Mon, 03 Mar 2025 17:07:06 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Marvel Studios",
      "Movies",
      "avengers: doomsday",
      "Avengers: Secret Wars"
    ]
  }
]
