[
  {
    "id": "5caa67fe-6e26-41bf-99e4-e4da02f2897c",
    "title": "‘Étoile’ Canceled After One Season at Amazon Prime Video, Despite Two-Season Order",
    "link": "https://variety.com/2025/tv/news/etoile-canceled-amazon-ballet-1236421858/",
    "description": "The first bow of “Étoile” is also its last. Prime Video has canceled the ballet series from “Marvelous Mrs. Maisel” creators Amy Sherman-Palladino and Daniel Palladino, despite the streamer initially greenlighting the production with a two-season commitment. The final pirouette comes roughly six weeks after the series first debuted in late April and earned generally […]",
    "author": "J. Kim Murphy",
    "published": "Sat, 07 Jun 2025 00:50:35 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/04/Etoile_First_Look_3_3000.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Amy Sherman-palladino",
      "Daniel Palladino",
      "Étoile",
      "Prime Video"
    ]
  },
  {
    "id": "ea33731a-22c8-4cf1-bfd5-c348dcee00e1",
    "title": "‘Resident Evil Requiem’ Sets February 2026 Release From Capcom",
    "link": "https://variety.com/2025/gaming/news/resident-evil-9-requiem-trailer-release-date-1236421778/",
    "description": "The ninth installment in the “Resident Evil” video game franchise, titled “Resident Evil Requiem,” is set to release in February 2026. The new game was announced during Summer Game Fest in Los Angeles on Friday, complete with a trailer drop, which came as a surprise after developer Capcom teased the “Resident Evil” franchise’s upcoming 30th […]",
    "author": "Jennifer Maas",
    "published": "Fri, 06 Jun 2025 23:00:29 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/03/resident-evil-e1741372615246.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Resident Evil",
      "Resident Evil 9",
      "Resident Evil Requiem"
    ]
  },
  {
    "id": "74995407-242b-44f1-bcad-295e08e9fc2f",
    "title": "The Phoenician Scheme Is Wes Anderson's Most Violent Movie To Date (And It Works)",
    "link": "https://www.slashfilm.com/1877099/the-phoenician-scheme-wes-anderson-most-violent-movie/",
    "description": "Violence isn't the first word you probably think of when you hear 'Wes Anderson,' but he brilliantly employs it in The Phoenician Scheme.",
    "author": "Bill Bria",
    "published": "Fri, 06 Jun 2025 22:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-phoenician-scheme-is-wes-andersons-most-violent-movie-to-date-and-it-works/l-intro-1748982753.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Comedy Movies"
    ]
  },
  {
    "id": "bd4738c0-a252-4f73-a6ad-9704e6076d7b",
    "title": "Thanks To Predator: Killer Of Killers, Another Actor Now Has Faced A Predator, Alien, And Terminator",
    "link": "https://www.slashfilm.com/1876149/second-actor-predator-alien-terminator-killer-of-killers-michael-biehn/",
    "description": "Another actor has joined the ranks of having faced off with a Predator, Alien, and Terminator thanks to Predator: Killer of Killers.",
    "author": "Bill Bria",
    "published": "Fri, 06 Jun 2025 19:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/thanks-to-predator-killer-of-killers-another-actor-now-has-faced-a-predator-alien-and-terminator/l-intro-1749236858.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Science Fiction Movies",
      "Horror Movies",
      "Thriller Movies"
    ]
  },
  {
    "id": "06ecafe2-2d86-47f4-953a-3097abb5f8a0",
    "title": "Barbarella Declares BRING HER BACK is an Intense Depiction of the Effects of Grief",
    "link": "https://www.aintitcool.com/bringherbackreview2025-83614/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Barbarella Declares BRING HER BACK is an Intense Depiction of the Effects of Grief Read the full article on AICN Hey, friends. Barbarella here still reeling from the incredibly intense Australian horror flick Bring Her Back, which comes out on May 30th. Not for the weak of heart, this follow-up from the minds behind Talk to Me grips one’s innards early on and doesn’t let go for the entire duration.  While themes of grief and the different ways individuals cope with loss may not be uncommon in cinema, Bring Her Back approaches the concept in a truly unique fashion through the individuals involved and the manner in which their stories are told.  Sora Wong debuts as the young Piper. Giving a powerhouse performance, she proves that a face doesn’t have to be recognizable to bring the awesomeness. While Piper may be the nucleus of the story, it’s not just her, but also those around her, who drive the points, like nails, into your soul.  I’ll start with Sally Hawkins, whom you may recognize from The Shape of Water. Her portrayal of the adoptive parent is nothing short of exceptional. Nuanced when necessary, flat out psycho when required, she navigates the extremes and subtleties like a master.  While I could ramble about Sally Hawkins more, let’s move on to Jonah Wren Phillips. He’s incredible as the creepy kid, but it’s in those moments where we glimpse his humanity that this young talent shines. I should warn you, though, if he’s onscreen, the odds of you feeling uncomfortable increase 85%. Owning the most disturbing scenes, he can be hard to watch at times. In fact, when Finish the article on AICN",
    "author": "Barbarella",
    "published": "Fri, 30 May 2025 01:49:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "0b9e5a2d-8db0-442c-a93d-1c89c604ac42",
    "title": "Tribeca Film Festival 2025 Preview",
    "link": "https://www.aintitcool.com/tribeca-2025-curtain-raiser-eric-mcclanahan-83613/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=event",
    "description": "McEric takes a look at some of the films screening at this year's Tribeca Film Festival in NYC from June 4th - 15th. Read the full article on AICN The Tribeca Film Festival is set to descend once again upon New York City this June 4th through 15th. Begun in 2002 by Robert DeNiro, Jane Rosenthal, and Craig Hatkoff, the festival sought to revitalize Lower Manhattan after the 9/11 attacks and has since become one of the premiere film festivals of North America. This year, alone, the programmers narrowed down their selections from over 13,000 submissions. This year's line-up boasts 95 world premieres from filmmakers across 36 countries, collecting everything from feature films to shorts, episodic content, audio storytelling, interactive games, and more.  I'll be on site for several days of the festival to screen films and speak with attending talent, so let's take a look at some of the selections that made my shortlist of interest: First off, the big trend this year is music documentaries - the festival has programmed at least fifteen music-based films, beginning with the opening night gala selection BILLY JOEL: AND SO IT GOES. The festivities will likely be more of a eulogy than a celebration due to recent developments, but it's still nice to kick off a definitively New York festival with one of the City's own beloved sons as the subject of its inaugural film. Other documentaries that feature prominently are METALLICA SAVED MY LIFE, BILLY IDOL SHOULD BE DEAD, BOY GEORGE 7 CULTURE CLUB, DEPECHE MODE: M, I WAS BORN THIS WAY: CARL BEAN, MOVE YA BODY: THE BIRTH OF HOUSE, and THE SIXTH BOROUGH. This final film made my shortlist as Finish the article on AICN",
    "author": "McEric",
    "published": "Wed, 28 May 2025 20:59:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "ca725337-7483-4c8c-9027-f797d2367552",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for June 2025",
    "link": "https://www.comingsoon.net/guides/features/1982861-wheel-of-fortune-bonus-puzzle-june-2025-today-answer-tonight",
    "description": "The bonus round solutions for June 2025. The post Wheel of Fortune Bonus Puzzle Answer Today for June 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Sat, 07 Jun 2025 00:02:42 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/06/wheel-of-fortune-bonus-puzzle-may-2025-today-answer-tonight.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "exclude_from_yahoo",
      "Explainer",
      "Game Show",
      "Ryan Seacrest",
      "Sony Pictures",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "aa55d874-3af5-4bf5-95bf-444998ee17f8",
    "title": "Scott Pilgrim Returns to Video Games In New Trailer",
    "link": "https://www.comingsoon.net/games/news/1985842-scott-pilgrim-video-game-reveal-trailer-summer-game-fest",
    "description": "During the Summer Game Fest live showcase, Tribute Games revealed that its next side-scrolling beat ‘em up will be based on the popular Bryan Lee O’Malley Scott Pilgrim. A brand new trailer was shown, giving players a glimpse of the upcoming game. What is the new Scott Pilgrim video game? From the makers of the […] The post Scott Pilgrim Returns to Video Games In New Trailer appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Michael Ruiz",
    "published": "Fri, 06 Jun 2025 22:26:34 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/06/scottpilgrim.png?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Games",
      "Scott Pilgrim",
      "Tribute Games",
      "Video Game News"
    ]
  },
  {
    "id": "43d9f5cc-a5a6-4739-8a6a-263e7f90b15e",
    "title": "‘Étoile’ Canceled By Prime Video After Season 1 Of Two-Season Order",
    "link": "https://deadline.com/2025/06/etoile-canceled-prime-video-amy-sherman-palladino-1236426454/",
    "description": "EXCLUSIVE: Adieu, Étoile. Prime Video is not proceeding with a second season of Amy Sherman-Palladino and Daniel Palladino’s ballet drama series, Deadline has learned. The streamer and Amazon MGM Studios will continue to support the series’ Emmy campaign in the comedy categories. In the Palladinos’ followup to their critical and commercial hit for Prime Video, […]",
    "author": "Nellie Andreeva",
    "published": "Sat, 07 Jun 2025 00:21:06 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/etoile-2-cropped.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Cancellations and Renewals",
      "News",
      "Amy Sherman-Palladino",
      "Étoile",
      "Prime Video"
    ]
  },
  {
    "id": "222ee161-6554-49bc-8687-7d0ae774f400",
    "title": "‘Ballerina’ Targeting $26M-$30M As ‘Lilo \u0026 Stitch’ Laughs To No. 1 With $32M-$34M – Friday PM Box Office Update",
    "link": "https://deadline.com/2025/06/box-office-ballerina-lilo-stitch-1236425576/",
    "description": "FRIDAY EARLY EVENING: Currently, many have Ballerina in the mid-$20M range, but Lionsgate believes there’s a potential path to $30M at 3,409 theaters. Nobody in distribution land wants to a see a movie with great exits underperform. We need all the wins we can get. Ballerina is a R-rated movie, and the audiences for those […]",
    "author": "anthonypauldalessandro",
    "published": "Sat, 07 Jun 2025 00:07:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/06/MCDBALL_LG032-e1749184401614.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Ballerina",
      "Lionsgate"
    ]
  },
  {
    "id": "7b247a64-4ebb-4c4e-9226-ae9c539f4bc3",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "d9a1ca93-68ad-4fde-af65-6de6fb54e1ca",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "5a211c51-4abb-4de5-b194-4eaa92424c58",
    "title": "Trailer for 'Blue Scuti: Tetris Crasher' Doc - The Kid Who Beat Tetris",
    "link": "https://www.firstshowing.net/2025/trailer-for-blue-scuti-tetris-crasher-doc-the-kid-who-beat-tetris/",
    "description": "\"You don't know the pieces you are going to get... One day you will get that piece you need, you will find that success.\" IGN has revealed the first official trailer for a documentary film titled Blue Scuti: Tetris Crasher, which is premiering in the next few weeks at the 2025 Tribeca Film Festival. This is the story of the kid who beat Tetris! For real! Willis Gibson, who was only 13 when he pulled this off, known online as \"Blue Scuti\", is an American classic Tetris player from Stillwater, OK. He is best known for becoming the first person to \"beat the game\" of Tetris in December 2023, after he triggered a game crash on the previously unreached level 157. This doc from director Chris Moukarbel takes a look at his story and more about the legacy behind video game achievements. \"Thirteen-year-old Willis Gibson's life changes overnight when he becomes the first to beat Tetris. It explores grief, community, and the rise of an unexpected internet icon.\" I love a good doc that takes a simple (nerdy) story and turns into so much more, something exciting and life-affirming to watch, with extra context that makes it a great revelatory […]",
    "author": "Alex Billington",
    "published": "Fri, 06 Jun 2025 21:34:53 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/BlueScutiTetrisPostermainimTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "b29ea9a7-1c4f-4cd6-8ca0-c6face65bfd8",
    "title": "Full Trailer for Curtis \u0026 Lohan's 'Freakier Friday' Fun Legacy Sequel",
    "link": "https://www.firstshowing.net/2025/full-trailer-for-curtis-lohans-freakier-friday-fun-legacy-sequel/",
    "description": "\"I didn't want to be a part of this family, and now I'm part of some dodgy family curse?!\" Well, yep... Disney has unveiled the main official trailer for Freakier Friday, another long-awaited legacy sequel out in theaters soon. This is a follow-up to the hit comedy classic Freaky Friday from 2003, now 22 years later they're picking up where things left off with mother and daughter. This summer is about to get Freakier. Ready to crash into theaters this August! Years after Tess \u0026 Anna's identity crisis, Anna now has a daughter and soon-to-be stepdaughter. As they navigate the challenges that come when two families merge, Tess and Anna discover that lightning might strike twice. Jamie Lee Curtis and Lindsay Lohan return as Tess and Anna once again, along with Mark Harmon, Chad Michael Murray, Ryan Malgarini, Christina Vidal Mitchell, Haley Hudson, Stephen Tobolowsky, Lucille Soong, Rosalind Chao back in their respective roles from the original. With Julia Butters, Manny Jacinto, Vanessa Bayer, and Sophia Hammons joining in this cast. The big twist in this new one is it's now a four-way body swap between the other grandkids, too? This looks ridiculous, and not in a good way - […]",
    "author": "Alex Billington",
    "published": "Fri, 06 Jun 2025 16:31:34 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/FreakierFridayPostermainimgTsr2.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "c88d3422-d623-414a-90b4-fc21dc3178f5",
    "title": "‘Titan: The OceanGate Disaster’ Review: A Surface-Level Netflix Documentary About the Submersible Implosion Heard Around the World",
    "link": "https://www.indiewire.com/criticism/movies/titan-the-oceangate-disaster-review-netflix-documentary-1235129850/",
    "description": "Mark Monroe's documentary never feels exploitative, but it never feels particularly insightful either.",
    "author": "David Ehrlich",
    "published": "Fri, 06 Jun 2025 23:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Criticism",
      "Movies",
      "Film",
      "Reviews",
      "Titan: The OceanGate Disaster",
      "Tribeca"
    ]
  },
  {
    "id": "d4e07a09-30f3-461c-9cce-06b14183eea9",
    "title": "From a Mini ‘Girlfriends’ Reunion to ‘Matlock’ Rolling Deep, IndieWire Honors 2025 Was About Support",
    "link": "https://www.indiewire.com/awards/industry/matlock-cast-girlfriends-reunion-indiewire-honors-2025-1235130378/",
    "description": "IndieWire Honors 2025 became more than just a celebration of the honorees, as Kathy Bates, Mara Brock Akil, Julianne Nicholson, Colin Farrell, and more were joined by past and present collaborators.",
    "author": "Marcus Jones",
    "published": "Fri, 06 Jun 2025 22:05:35 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Awards",
      "Industry",
      "IndieWire Honors",
      "IndieWire Honors 2025",
      "TV"
    ]
  },
  {
    "id": "4d636f65-8e2c-4212-b63e-5917cc687e16",
    "title": "Superman Teaser: Lex Explains His \"Rivalry\" with The Man of Steel",
    "link": "https://bleedingcool.com/movies/superman-teaser-lex-explains-his-rivalry-with-the-man-of-steel/",
    "description": "Lex Luthor makes his \"Rivalry\" with The Man of Steel known in a new teaser for DC Studios and writer/director James Gunn's Superman.",
    "author": "Ray Flook",
    "published": "Fri, 06 Jun 2025 16:13:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "HBO",
      "Max",
      "Movies",
      "TV",
      "Warner Bros",
      "superman"
    ]
  },
  {
    "id": "cb8e1b78-e04c-4959-9f79-f530689122ce",
    "title": "Star Wars: Starfighter – Mia Goth Joins The Cast As The Villain",
    "link": "https://bleedingcool.com/movies/star-wars-starfighter-mia-goth-joins-the-cast-as-the-villain/",
    "description": "Mia Goth has reportedly joined the Star Wars: Starfighter cast as the villain. Shawn Levy will direct the stand-alone film, which will star Ryan Gosling.",
    "author": "Kaitlyn Booth",
    "published": "Fri, 06 Jun 2025 13:42:08 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Lucasfilm",
      "Movies",
      "star wars: starfighter"
    ]
  }
]
