{
  "id": "05344a0b-3da9-44d1-868e-afd7231e7a0f",
  "title": "US workers with remote-friendly jobs still work from home nearly half the time, five years after the pandemic began",
  "link": "https://phys.org/news/2025-03-workers-remote-friendly-jobs-home.html",
  "description": "Five years after the COVID-19 pandemic disrupted office life, American workplaces are settling into a new rhythm. Employees in remote-friendly jobs now spend an average of 2.3 days each week working from home, a research team that tracks remote employment has found. And when you look at all workers—and not just those in remote-friendly positions—they're working remotely 1.4 days a week, or 28% of the time.",
  "author": "",
  "published": "Wed, 12 Mar 2025 20:50:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Economics \u0026 Business"
  ],
  "byline": "Radostina Purvanova, Alanah Mitchell",
  "length": 6348,
  "excerpt": "Five years after the COVID-19 pandemic disrupted office life, American workplaces are settling into a new rhythm. Employees in remote-friendly jobs now spend an average of 2.3 days each week working from home, a research team that tracks remote employment has found. And when you look at all workers—and not just those in remote-friendly positions—they're working remotely 1.4 days a week, or 28% of the time.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: KATRIN BOLOVTSOVA from Pexels Five years after the COVID-19 pandemic disrupted office life, American workplaces are settling into a new rhythm. Employees in remote-friendly jobs now spend an average of 2.3 days each week working from home, a research team that tracks remote employment has found. And when you look at all workers—and not just those in remote-friendly positions—they're working remotely 1.4 days a week, or 28% of the time. That's a huge change from 2019, when remote work accounted for only 7% of the nation's paid workdays, even if it's down from the height of the pandemic in 2020, when 61.5% of all work was remote. And it's a giant leap from 1965, the dawn of telework. At that time, fewer than 0.5% of all paid workdays were out of the office, according to the Bureau of Labor Statistics. As management professors who study remote work and collaboration, we've learned a lot about remote work's challenges and its often underappreciated advantages. In analyzing the latest data, we've observed that employers and employees are still trying to strike the balance between working from home and at the office. That's why employers' requirements for in-person work don't always align with their employees' preferences. Hybrid work is on the rise Employers swiftly made the jump to remote work in 2020. Zoom, along with other previously unfamiliar collaboration software companies, became commonplace overnight. Five years later, many employers, including JPMorgan, TikTok, Amazon and the federal government, are rejecting remote work, demanding that employees return to the office full time. But these examples are not the norm. According to Flex Index, which tracks the workplace strategies of over 10,000 U.S. companies quarterly, fully in-office work is on the decline. At the start of 2023, 49% of employers insisted that their staff report to the office daily. That percentage fell to 32% at the end of 2024. Companies are also retreating from remote-only work. While 31% of employers were fully remote in 2023, only 25% had remained fully remote at the end of 2024. Instead, companies are increasingly turning to hybrid arrangements, in which employees spend a part of their week at the office. About 20% of professional workplaces were hybrid at the start of 2023. Just two years later, hybrid's share had risen to 43%. Some industries are more remote than others The story of remote work is more complicated than general trends indicate. Its prevalence varies widely by industry, location and employer size. The technology, insurance, telecommunications, professional services, and media and entertainment industries are among the biggest adopters of long-term remote and hybrid arrangements. The states where remote and hybrid work are the most popular are Massachusetts, Washington, Oregon, Colorado and California. The states where it's the least popular are Kentucky, Louisiana, Nevada, Nebraska and Alaska. In part, some of these regional differences are due to where remote-friendly industries like technology and insurance are concentrated. Businesses with 500 or fewer employees are the most likely to embrace remote work. Staying connected and coordinating with your colleagues is easiest with smaller teams, we've observed. Midsize employers, with 500 to 25,000 employees, are equally split across fully in-office, remote and hybrid strategies. Very large employers, which have 25,000 employees or more, are the most likely to adopt hybrid work. These patterns show that remote work tends to be more popular among small employers, and in remote-friendly industries and states, whereas hybrid work has found a home in large companies. What employees prefer The remote work story is complicated also because employees have developed different preferences for in-office work, hybrid work and remote work over the course of the pandemic and since it subsided. In 2024, roughly 25% of professional employees preferred office work, 35% preferred remote work, and 40% preferred hybrid work, according to research by Zoom. Even recent college graduates express a range of preferences: 15% prefer to work at an office, 20% prefer remote work, and 65% would rather have a hybrid schedule. However, the ideal balance of office and remote work remains a point of contention. While employees favor three days at home and two in the office, employers prefer the opposite: three days in the office and two working remotely, the Zoom survey found. Generally, the future of work looks hybrid. But the remote work of the lockdown days—what's now known as \"fully remote\"—is also here to stay. This is good news for those who prefer fully remote work. These employees are often parents or are caring for adults in need of assistance. They may live in rural communities or reside too far from their offices to regularly commute. Many LGBTQ+ employees and people of color have expressed a preference for remote work as a way to limit the microaggressions they experience on the job. On the fifth anniversary of the COVID-19 lockdown, there's no one-size-fits-all workplace. And we believe that's a good thing. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: US workers with remote-friendly jobs still work from home nearly half the time, five years after the pandemic began (2025, March 12) retrieved 12 March 2025 from https://phys.org/news/2025-03-workers-remote-friendly-jobs-home.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/work-from-home-6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/work-from-home-6.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/work-from-home-6.jpg\" data-sub-html=\"Credit: KATRIN BOLOVTSOVA from Pexels\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/work-from-home-6.jpg\" alt=\"work from home\" title=\"Credit: KATRIN BOLOVTSOVA from Pexels\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: KATRIN BOLOVTSOVA from Pexels\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eFive years after the COVID-19 pandemic disrupted office life, American workplaces are settling into a new rhythm. Employees in remote-friendly jobs now spend an average of 2.3 days each week working from home, \u003ca href=\"https://wfhresearch.com/data/\" target=\"_blank\"\u003ea research team that tracks remote employment\u003c/a\u003e has found. And when you look at all workers—and not just those in remote-friendly positions—they\u0026#39;re working remotely 1.4 days a week, or 28% of the time.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThat\u0026#39;s a huge change from 2019, when \u003ca href=\"https://phys.org/tags/remote+work/\" rel=\"tag\"\u003eremote work\u003c/a\u003e accounted for only 7% of the nation\u0026#39;s paid workdays, even if it\u0026#39;s down from the height of the pandemic in 2020, when 61.5% of all work was remote. And it\u0026#39;s a \u003ca href=\"https://www.bls.gov/opub/mlr/2024/beyond-bls/high-work-from-home-rates-persist-in-2023.htm\" target=\"_blank\"\u003egiant leap from 1965\u003c/a\u003e, the dawn of telework. At that time, fewer than 0.5% of all paid workdays were out of the office, according to the Bureau of Labor Statistics.\u003c/p\u003e\n\u003cp\u003eAs management professors who study \u003ca href=\"https://scholar.google.com/citations?hl=en\u0026amp;user=moyLZ-4AAAAJ\" target=\"_blank\"\u003eremote work\u003c/a\u003e and \u003ca href=\"https://scholar.google.com/citations?user=hUNaHqAAAAAJ\u0026amp;hl=en\u0026amp;authuser=2\" target=\"_blank\"\u003ecollaboration\u003c/a\u003e, we\u0026#39;ve \u003ca href=\"https://doi.org/10.1177/1059601118794102\" target=\"_blank\"\u003elearned a lot about remote work\u0026#39;s challenges\u003c/a\u003e and its often underappreciated advantages. In analyzing the latest data, we\u0026#39;ve observed that employers and employees are still trying to strike the balance between working from home and at the office. That\u0026#39;s why employers\u0026#39; \u003ca href=\"https://hbr.org/2023/11/where-companies-want-employees-to-work-and-where-people-actually-want-to-work\" target=\"_blank\"\u003erequirements for in-person work don\u0026#39;t always align\u003c/a\u003e with their employees\u0026#39; preferences.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eHybrid work is on the rise\u003c/h2\u003e\n\u003cp\u003eEmployers swiftly made the jump to remote work in 2020. Zoom, along with other previously unfamiliar collaboration software companies, became commonplace overnight.\u003c/p\u003e\n\u003cp\u003eFive years later, many employers, \u003ca href=\"https://www.businessinsider.com/companies-requiring-return-to-office-rto-mandate\" target=\"_blank\"\u003eincluding JPMorgan, TikTok, Amazon\u003c/a\u003e and \u003ca href=\"https://www.whitehouse.gov/presidential-actions/2025/01/return-to-in-person-work/\" target=\"_blank\"\u003ethe federal government\u003c/a\u003e, are rejecting remote work, demanding that employees return to the office full time.\u003c/p\u003e\n\u003cp\u003eBut these examples are not the norm.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://www.flexindex.com/reports\" target=\"_blank\"\u003eFlex Index\u003c/a\u003e, which tracks the workplace strategies of over 10,000 U.S. companies quarterly, fully in-office work is on the decline. At the start of 2023, 49% of employers insisted that their staff report to the office daily. That percentage fell to 32% at the end of 2024.\u003c/p\u003e\n\u003cp\u003eCompanies are also retreating from remote-only work. While 31% of employers were fully remote in 2023, only 25% had remained fully remote at the end of 2024.\u003c/p\u003e\n\u003cp\u003eInstead, companies are increasingly turning to hybrid arrangements, in which employees spend a part of their week at the office. About 20% of professional workplaces were hybrid at the start of 2023. Just two years later, hybrid\u0026#39;s share had risen to 43%.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eSome industries are more remote than others\u003c/h2\u003e\n\u003cp\u003eThe story of remote work is more complicated than general trends indicate. Its prevalence varies widely by industry, location and \u003ca href=\"https://phys.org/tags/employer/\" rel=\"tag\"\u003eemployer\u003c/a\u003e size.\u003c/p\u003e\n\u003cp\u003eThe technology, insurance, telecommunications, professional services, and media and entertainment industries are among the biggest \u003ca href=\"https://www.flexindex.com/reports\" target=\"_blank\"\u003eadopters of long-term remote and hybrid arrangements\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe states where remote and hybrid work are the most popular are Massachusetts, Washington, Oregon, Colorado and California. The states where it\u0026#39;s the least popular are Kentucky, Louisiana, Nevada, Nebraska and Alaska. In part, some of these \u003ca href=\"https://phys.org/tags/regional+differences/\" rel=\"tag\"\u003eregional differences\u003c/a\u003e are due to where remote-friendly industries like technology and insurance are concentrated.\u003c/p\u003e\n\u003cp\u003eBusinesses with 500 or fewer employees are the most likely to embrace remote work. Staying connected and coordinating with your colleagues is easiest with smaller teams, we\u0026#39;ve observed. Midsize employers, with 500 to 25,000 employees, are equally split across fully in-office, remote and hybrid strategies. Very large employers, which have 25,000 employees or more, are the most likely to adopt hybrid work.\u003c/p\u003e\n\u003cp\u003eThese patterns show that remote work tends to be more popular among small employers, and in remote-friendly industries and states, whereas hybrid work has found a home in large companies.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eWhat employees prefer\u003c/h2\u003e\n\u003cp\u003eThe remote work story is complicated also because employees have developed different preferences for in-office work, hybrid work and remote work over the course of the pandemic and since it subsided.\u003c/p\u003e\n\u003cp\u003eIn 2024, roughly 25% of professional employees preferred office work, 35% preferred remote work, and 40% preferred hybrid work, according to \u003ca href=\"https://click.zoom.com/navigating-the-future-of-work\" target=\"_blank\"\u003eresearch by Zoom\u003c/a\u003e. Even recent \u003ca href=\"https://joinhandshake.com/docs/network-trends/class-of-2024-graduation.pdf\" target=\"_blank\"\u003ecollege graduates express a range of preferences\u003c/a\u003e: 15% prefer to work at an office, 20% prefer remote work, and 65% would rather have a hybrid schedule.\u003c/p\u003e\n\u003cp\u003eHowever, the ideal balance of office and remote work remains a point of contention. While employees favor three days at home and two in the office, employers prefer the opposite: three days in the \u003ca href=\"https://phys.org/tags/office/\" rel=\"tag\"\u003eoffice\u003c/a\u003e and two working remotely, the Zoom survey found.\u003c/p\u003e\n\u003cp\u003eGenerally, the future of work looks hybrid. But the remote work of the lockdown days—what\u0026#39;s now known as \u0026#34;fully remote\u0026#34;—is also here to stay.\u003c/p\u003e\n\u003cp\u003eThis is good news for those who prefer fully remote work. These employees are often \u003ca href=\"https://www.brookings.edu/wp-content/uploads/2022/03/SP22_BPEA_Goldin_conf-draft.pdf\" target=\"_blank\"\u003eparents or are caring for adults\u003c/a\u003e in need of assistance. They may live in \u003ca href=\"https://ruralinnovation.us/wp-content/uploads/2022/01/Remote-Work_122721.pdf\" target=\"_blank\"\u003erural communities\u003c/a\u003e or \u003ca href=\"https://www.businessinsider.com/millennials-high-earners-moved-office-work-from-home-remote-work-2024-3\" target=\"_blank\"\u003ereside too far\u003c/a\u003e from their offices to regularly commute. Many LGBTQ+ employees and people of color have expressed a preference for remote work as a \u003ca href=\"https://doi.org/10.1002/job.2779\" target=\"_blank\"\u003eway to limit the microaggressions\u003c/a\u003e they experience on the job.\u003c/p\u003e\n\u003cp\u003eOn the fifth anniversary of the COVID-19 lockdown, there\u0026#39;s no one-size-fits-all workplace. And we believe that\u0026#39;s a good thing.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from \u003ca href=\"https://theconversation.com\" target=\"_blank\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/us-workers-with-remote-friendly-jobs-are-still-working-from-home-nearly-half-the-time-5-years-after-the-pandemic-began-251758\" target=\"_blank\"\u003eoriginal article\u003c/a\u003e.\u003cimg src=\"https://counter.theconversation.com/content/251758/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tUS workers with remote-friendly jobs still work from home nearly half the time, five years after the pandemic began (2025, March 12)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 12 March 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-03-workers-remote-friendly-jobs-home.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-12T20:50:01-04:00",
  "modifiedTime": null
}
