{
  "id": "05c3bdc1-7b72-4f08-b89f-443bed716549",
  "title": "Sleep-in science: How 2 extra weekend hours can calm teen anxiety",
  "link": "https://www.sciencedaily.com/releases/2025/06/250613013854.htm",
  "description": "Teens might finally have a good reason to sleep in on weekends within limits. A new study reveals that teenagers who get up to two extra hours of sleep on weekends show fewer anxiety symptoms than those who don t. But go beyond that sweet spot, and symptoms can actually increase.",
  "author": "",
  "published": "Fri, 13 Jun 2025 01:38:54 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2775,
  "excerpt": "Teens might finally have a good reason to sleep in on weekends within limits. A new study reveals that teenagers who get up to two extra hours of sleep on weekends show fewer anxiety symptoms than those who don t. But go beyond that sweet spot, and symptoms can actually increase.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A new study to be presented at the SLEEP 2025 annual meeting found that teens who get moderate -- but not excessive -- catch-up sleep on weekends have fewer symptoms of anxiety. Results show that teens who got up to two more hours of sleep on weekends than on weekdays exhibited fewer anxiety symptoms compared with those who did not sleep longer on weekends. However, longer durations of catch-up sleep on weekends were associated with slightly more internalizing symptoms. \"The results show that both sleeping less on weekends than weekdays and sleeping substantially more on weekends were associated with higher anxiety symptoms,\" said lead author Sojeong Kim, a doctoral candidate in the department of clinical psychology and psychology graduate advisor at the University of Oregon in Eugene. \"In contrast, moderate catch-up sleep -- defined as less than two hours -- was associated with lower anxiety symptoms, suggesting that some weekend recovery sleep may be beneficial.\" The American Academy of Sleep Medicine recommends that teenagers 13 to 18 years of age should sleep 8 to 10 hours on a regular basis to promote optimal health. However, CDC data show that only 23% of high school students get sufficient sleep on an average school night. \"Many teens try to make up for lost sleep by sleeping in on weekends,\" Kim said. Consistently getting sufficient sleep is associated with better health outcomes including improved attention, behavior, learning, memory, emotional regulation, quality of life, and mental and physical health. In contrast, insufficient sleep in teenagers is associated with increased risks of problems such as depression and suicidal thoughts. The study involved 1,877 adolescents with a mean age of 13.5 years. Sleep duration was estimated using Fitbit devices, while internalizing symptoms were assessed using the Child Behavior Checklist survey. Weekend catch-up sleep was calculated as the difference between weekend and weekday sleep duration. Kim noted that it is important to identify the right amount of catch-up sleep that is beneficial to teens who restrict their sleep during the week. \"Too little or too much sleep variability from weekday to weekend may contribute to the symptoms someone is trying to combat, like physical or mental fatigue and feelings of anxiety,\" she said. The research abstract was published recently in an online supplement of the journal Sleep and will be presented Wednesday, June 11, during SLEEP 2025 in Seattle. SLEEP is the annual meeting of the Associated Professional Sleep Societies, a joint venture of the American Academy of Sleep Medicine and the Sleep Research Society. Abstract Title: The Sweet Spot of Weekend Catch-Up Sleep: A Protective Factor Against Depressive Symptoms? Abstract ID: 0263",
  "image": "https://www.sciencedaily.com/images/1920/Young-Woman-Wake-Up-Happy.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA new study to be presented at the SLEEP 2025 annual meeting found that teens who get moderate -- but not excessive -- catch-up sleep on weekends have fewer symptoms of anxiety.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eResults show that teens who got up to two more hours of sleep on weekends than on weekdays exhibited fewer anxiety symptoms compared with those who did not sleep longer on weekends. However, longer durations of catch-up sleep on weekends were associated with slightly more internalizing symptoms.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The results show that both sleeping less on weekends than weekdays and sleeping substantially more on weekends were associated with higher anxiety symptoms,\u0026#34; said lead author Sojeong Kim, a doctoral candidate in the department of clinical psychology and psychology graduate advisor at the University of Oregon in Eugene. \u0026#34;In contrast, moderate catch-up sleep -- defined as less than two hours -- was associated with lower anxiety symptoms, suggesting that some weekend recovery sleep may be beneficial.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe American Academy of Sleep Medicine recommends that teenagers 13 to 18 years of age should sleep 8 to 10 hours on a regular basis to promote optimal health. However, CDC data show that only 23% of high school students get sufficient sleep on an average school night.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Many teens try to make up for lost sleep by sleeping in on weekends,\u0026#34; Kim said.\u003c/p\u003e\n\u003cp\u003eConsistently getting sufficient sleep is associated with better health outcomes including improved attention, behavior, learning, memory, emotional regulation, quality of life, and mental and physical health. In contrast, insufficient sleep in teenagers is associated with increased risks of problems such as depression and suicidal thoughts.\u003c/p\u003e\n\u003cp\u003eThe study involved 1,877 adolescents with a mean age of 13.5 years. Sleep duration was estimated using Fitbit devices, while internalizing symptoms were assessed using the Child Behavior Checklist survey. Weekend catch-up sleep was calculated as the difference between weekend and weekday sleep duration.\u003c/p\u003e\n\n\n\u003cp\u003eKim noted that it is important to identify the right amount of catch-up sleep that is beneficial to teens who restrict their sleep during the week.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Too little or too much sleep variability from weekday to weekend may contribute to the symptoms someone is trying to combat, like physical or mental fatigue and feelings of anxiety,\u0026#34; she said.\u003c/p\u003e\n\u003cp\u003eThe research abstract was published recently in an online supplement of the journal Sleep and will be presented Wednesday, June 11, during SLEEP 2025 in Seattle. SLEEP is the annual meeting of the Associated Professional Sleep Societies, a joint venture of the American Academy of Sleep Medicine and the Sleep Research Society.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbstract Title\u003c/strong\u003e: The Sweet Spot of Weekend Catch-Up Sleep: A Protective Factor Against Depressive Symptoms?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbstract ID\u003c/strong\u003e: 0263\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
