{
  "id": "099bed9f-b060-4f22-bc58-9c8a791fde54",
  "title": "Rocky Mountain snow is contaminated, study shows",
  "link": "https://www.sciencedaily.com/releases/2025/04/250401174907.htm",
  "description": "Mountain snowpacks accumulate snow throughout the winter, building up stores of water that will supply communities across the American West throughout the long dry season. Now, a new study shows that as storms carry snow to the Rocky Mountains, they are also bringing mercury and other contaminants from mines in the region. The research helps scientists understand how contaminants are spread by atmospheric circulation and has implications for snowpack preservation and illuminating the lasting environmental impact of mining activities.",
  "author": "",
  "published": "Tue, 01 Apr 2025 17:49:07 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4452,
  "excerpt": "Mountain snowpacks accumulate snow throughout the winter, building up stores of water that will supply communities across the American West throughout the long dry season. Now, a new study shows that as storms carry snow to the Rocky Mountains, they are also bringing mercury and other contaminants from mines in the region. The research helps scientists understand how contaminants are spread by atmospheric circulation and has implications for snowpack preservation and illuminating the lasting environmental impact of mining activities.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Mountain snowpacks accumulate snow throughout the winter, building up stores of water that will supply communities across the American West throughout the long dry season. Now, a new study shows that as storms carry snow to the Rocky Mountains, they are also bringing mercury and other contaminants from mines in the region. The research helps scientists understand how contaminants are spread by atmospheric circulation and has implications for snowpack preservation and illuminating the lasting environmental impact of mining activities. The study, published in the May issue of the journal Environmental Pollution, examined contamination levels for Mercury, Zinc, Cadmium and Antimony from nearly 50 sites in the Rocky Mountains. DRI's Monica Arienzo, Associate Research Professor of Hydrology, led the research, along with colleagues from the U.S. Geological Survey (USGS), the University of Nevada, Reno, and Portland State University. They found higher levels of metal contaminants in the northern Rockies and identified mines in the Pacific Northwest, Idaho, and Montana as the likely source by following winter storms back in time. It is one of the first studies to look at metal contamination across the greater Rocky Mountains. \"Metal pollution in the Rockies is relatively understudied,\" Arienzo said. \"Other studies have focused on certain parts, so the fact that we have this transect from Montana to New Mexico makes this study unique.\" Although contamination levels were found to be within guidelines set by the EPA for both drinking water and aquatic life, dust can accelerate snowmelt by decreasing the reflectivity of the snowpack. The data can also provide critical information about how environmental contaminants and dust are distributed by the atmosphere. The study combined a number of data sets to capture a comprehensive understanding of the amount of metal contamination making its way to the region. First, snow samples were collected from 48 sites throughout the Rocky Mountains during the spring of 2018. The researchers then measured metal concentrations in each sample, including metals like calcium that come from natural dust rather than human activities. By comparing the amounts of purely dust-sourced metals to those that result from both dust and industrial activities like mining, the scientists determined how much metal contamination stemmed from human activities. To strengthen their findings, they then examined data from the National Atmospheric Deposition Program that measured mercury and calcium in precipitation from 2009 through 2018. Again, the scientists saw higher amounts of metal contamination in the northern Rockies, across Montana, Idaho, and Northern Wyoming. \"I was surprised by the amount of agreement we saw between all these different data sets we brought together,\" Arienzo said. \"The snow samples showed us that contamination is higher in the northern Rockies, and that was really interesting. Looking at mercury contamination over time helped us say that 2018 is not just a fluke. When you start to see these trends that are consistent between different records, it makes you feel more confident that something's really happening here.\" To determine the likely source of the contaminants, Arienzo and her colleagues tracked the winter's storms back through time. For the northern Rockies, many of the storms had moved in from the Pacific Northwest region, whereas in the southern stretch of the mountains, storms came from across the Mojave Desert. By referencing a USGS dataset that tracks mining and smelting locations, the scientists identified active sites near the northern Rockies. An examination of EPA Superfund locations uncovered historical sites that could also be sources of contamination. \"Our idea is that the dust from current and historical mining sites gets carried up into the mountains and deposited across our study sites,\" Arienzo said. \"This study shows the importance of continued scientific monitoring efforts, like the long-term USGS datasets we used here, as well as mitigation of current and historical mining sites.\" The research is part of a larger study, supported by the National Science Foundation (NSF), using tree rings to examine historical mercury contamination. Arienzo and her team will compare the mercury record found in tree rings to that found in the snowpack to better understand how mercury is deposited and spread throughout the environment.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eMountain snowpacks accumulate snow throughout the winter, building up stores of water that will supply communities across the American West throughout the long dry season. Now, a new study shows that as storms carry snow to the Rocky Mountains, they are also bringing mercury and other contaminants from mines in the region. The research helps scientists understand how contaminants are spread by atmospheric circulation and has implications for snowpack preservation and illuminating the lasting environmental impact of mining activities.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe study, published in the May issue of the journal \u003cem\u003eEnvironmental Pollution\u003c/em\u003e, examined contamination levels for Mercury, Zinc, Cadmium and Antimony from nearly 50 sites in the Rocky Mountains. DRI\u0026#39;s Monica Arienzo, Associate Research Professor of Hydrology, led the research, along with colleagues from the U.S. Geological Survey (USGS), the University of Nevada, Reno, and Portland State University. They found higher levels of metal contaminants in the northern Rockies and identified mines in the Pacific Northwest, Idaho, and Montana as the likely source by following winter storms back in time. It is one of the first studies to look at metal contamination across the greater Rocky Mountains.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Metal pollution in the Rockies is relatively understudied,\u0026#34; Arienzo said. \u0026#34;Other studies have focused on certain parts, so the fact that we have this transect from Montana to New Mexico makes this study unique.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAlthough contamination levels were found to be within guidelines set by the EPA for both drinking water and aquatic life, dust can accelerate snowmelt by decreasing the reflectivity of the snowpack. The data can also provide critical information about how environmental contaminants and dust are distributed by the atmosphere.\u003c/p\u003e\n\u003cp\u003eThe study combined a number of data sets to capture a comprehensive understanding of the amount of metal contamination making its way to the region. First, snow samples were collected from 48 sites throughout the Rocky Mountains during the spring of 2018. The researchers then measured metal concentrations in each sample, including metals like calcium that come from natural dust rather than human activities. By comparing the amounts of purely dust-sourced metals to those that result from both dust and industrial activities like mining, the scientists determined how much metal contamination stemmed from human activities.\u003c/p\u003e\n\u003cp\u003eTo strengthen their findings, they then examined data from the National Atmospheric Deposition Program that measured mercury and calcium in precipitation from 2009 through 2018. Again, the scientists saw higher amounts of metal contamination in the northern Rockies, across Montana, Idaho, and Northern Wyoming.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I was surprised by the amount of agreement we saw between all these different data sets we brought together,\u0026#34; Arienzo said. \u0026#34;The snow samples showed us that contamination is higher in the northern Rockies, and that was really interesting. Looking at mercury contamination over time helped us say that 2018 is not just a fluke. When you start to see these trends that are consistent between different records, it makes you feel more confident that something\u0026#39;s really happening here.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTo determine the likely source of the contaminants, Arienzo and her colleagues tracked the winter\u0026#39;s storms back through time. For the northern Rockies, many of the storms had moved in from the Pacific Northwest region, whereas in the southern stretch of the mountains, storms came from across the Mojave Desert.\u003c/p\u003e\n\n\n\u003cp\u003eBy referencing a USGS dataset that tracks mining and smelting locations, the scientists identified active sites near the northern Rockies. An examination of EPA Superfund locations uncovered historical sites that could also be sources of contamination.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our idea is that the dust from current and historical mining sites gets carried up into the mountains and deposited across our study sites,\u0026#34; Arienzo said. \u0026#34;This study shows the importance of continued scientific monitoring efforts, like the long-term USGS datasets we used here, as well as mitigation of current and historical mining sites.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe research is part of a larger study, supported by the National Science Foundation (NSF), using tree rings to examine historical mercury contamination. Arienzo and her team will compare the mercury record found in tree rings to that found in the snowpack to better understand how mercury is deposited and spread throughout the environment.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
