{
  "id": "0ac67828-a04a-4a97-8c70-cae46bfe1a5b",
  "title": "MAHA: Echoes of The Secret",
  "link": "https://sciencebasedmedicine.org/maha-echoes-of-the-secret/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=maha-echoes-of-the-secret",
  "description": "When you look at Robert F. Kennedy, Jr.'s \"Make America Healthy Again\" movement, there is a notable echo of an idea once promoted by Oprah Winfrey, namely The Secret, combined with antivax and alt-med tropes. The post MAHA: Echoes of The Secret first appeared on Science-Based Medicine.",
  "author": "David Gorski",
  "published": "Mon, 03 Feb 2025 08:00:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Politics and Regulation",
    "Public Health",
    "Vaccines",
    "antivaccine",
    "Donald Trump",
    "MAGA",
    "MAHA",
    "make America great again",
    "make America healthy again",
    "make quackery great again",
    "Oprah Winfrey",
    "Robert F. Kennedy Jr.",
    "The Secret",
    "vaccines"
  ],
  "byline": "David Gorski",
  "length": 37240,
  "excerpt": "There is an echo of an idea once promoted by Oprah Winfrey, namely The Secret, in Robert F. Kennedy, Jr.'s \"Make America Healthy Again\" (MAHA) movement,",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Last Wednesday, antivax conspiracy theorist and crank Robert F. Kennedy, Jr. testified before the Senate Finance Committee as nominee to become President Donald Trump’s Secretary of the Department of Health and Human Services. It just so happened that Wednesday is a day when I have no scheduled clinical responsibilities other than to round on patients in the hospital when I have any (which isn’t that often given my specialty). Fortunately (or unfortunately, I’m not sure), that meant that I was doing charts in my office and writing a grant proposal, meaning that I was able to fire up my iPad and have the Senate confirmation hearing going in the background. As someone who has been debunking the antivax misinformation, pseudoscience, conspiracy theories, and outright lies that RFK Jr. has been promoting for close to 20 years, even I found it painful to listen, and I recognized a lot of old tropes that RFK Jr. has been repeating for two decades (e.g., “Ralph Nader was pro-safety for cars, but no one called him anti-car; I was anti-mercury in fish, but no one called me anti-fish”). Then I came to an exchange between RFK Jr. and Senator Bernie Sanders. After I saw this exchange, everything about MAHA started to come into perspective in a way that, frankly, I’m embarrassed that it hadn’t before, given how often I had written about the idea that undergirds alternative medicine, an idea that I called the central dogma of alternative health, namely a variant of “The Secret,” or, as I like to call it, “wishing makes it so,” or, more recently, the idea that a virtuous lifestyle with respect to health will ward off all disease. Let me explain by going over some testimony, although first I have to point out one part of the proceedings that led me to laugh out loud. Although I do like some of what he has to say, in general I haven’t usually been a big fan of Bernie Sanders, and, indeed, had feared that he might be one non-Republican who might vote to confirm RFK Jr., based on his disdain shared with RFK Jr. for big pharma and his belief (also shared with RFK Jr.) that not enough is devoted to promoting healthy living. However, I do have to give Sen. Sanders credit for hammering RFK Jr. on his antivax views. The best example was what became a viral moment, when Sen. Sanders hammered RFK Jr. about onesies with antivax slogans sold by Children’s Health Defense, the antivax organization founded by RFK Jr. Sen. Sanders kept asking RFK Jr. if he would stop the sale of these onesies, sarcastically adding “now that you’re provaccine.” Predictably RFK Jr. dodged by saying that he was no longer associated with the organization and had resigned from its board of directors after being nominated for HHS Secretary. Sen. Sanders was ready for that dodge and asked RFK Jr. repeatedly whether he supported the message on the onesies, “now that you’re pro-vaccine.” Before I go on, I just have to show you this clip, because it’s very revealing: Basically, this ambush by Sen. Sanders was a thing of beauty that, sadly, will probably have little bearing on whether RFK Jr. is confirmed or not. I show it, though, just to emphasize how dishonest RFK Jr. is. Yes, he might no longer be affiliated—officially—with CHD, but if he called them up and told them to stop selling these onesies, I’m sure they would comply. MAHA: Health as a result of virtue? The most important part of the exchange between Sen. Sanders and RFK Jr., the part that inspired the idea for this post and got me to thinking about The Secret and MAHA, came here: The key part of the exchange that caught my ear was this part of RFK Jr.’s answer to the question, which occurred after he had dodged and weaved in order not to give a definite yes/no answer: Free speech doesn’t cost anybody anything, but in health care, if you smoke cigarettes for 20 years and you get cancer you are now taking from the pool. Are you guaranteed the same right? Does this sound familiar? It’s a recurring theme that we hear from believers in alternative and “natural” medicine, namely the victim-blaming idea of lifestyle über alles in medicine, the judgmental mindset that if you are ill it is your fault. (Never mind, for instance, that nicotine is a highly addictive substance that makes it incredibly difficult to quit smoking once you start. Never mind that whole industries exist to promote and sell tobacco.) If I were to sum up the idea succinctly, it is the concept that virtue equals health and that, if you are not healthy, you must not be virtuous. In this context, “virtue” means leading a “virtuous” lifestyle with respect to health; i.e., eating a healthy diet, exercising, not indulging in habits that contribute to chronic disease, etc. Consequently, if you develop lung cancer or heart disease as a result of your having smoked cigarettes for 20 or 30 years, somehow you are less deserving of healthcare. It’s a concept that suffuses the antivax movement too, with claims that diet and healthy living can prevent disease better than any vaccine. The prototypical example of this attitude that I like to cite is one that I first wrote about quite a long time ago. It comes from Bill Maher, the formerly seemingly “liberal” comedian and pundit who has always leaned antivax and pro-quackery but during COVID-19 really let his contrarian freak flag fly high and also “come out”—if you will—as anti-trans. The exchange occurred way back in 2009 when Bob Costas was a guest on his show. Somehow the subject of the influenza vaccine came up. Maher claimed that, because he lived the “right” lifestyle—never mind all that marijuana, right?—his immune system was superior and he would not catch flu on an airplane, leading him to say, “I would never get the flu on an airplane,” presumably because his immune system is so healthy and there is no “swamp” there for the virus to breed in. An exasperated Bob Costas retorted brilliantly, “Oh, come on, Superman!” It turns out that this same attitude underlies much of the “Make America Healthy Again” (MAHA) movement, namely that health virtue equals health. Now, far be it from me to say that you shouldn’t live a healthy lifestyle (based on science), eat a healthy diet (based on science), exercise, maintain a healthy weight, or to claim that doing so doesn’t maximize your chances of being (and remaining) healthy. That’s not the problem. The problem is the dark underbelly of this belief, namely that if you aren’t healthy you must not be sufficiently “virtuous,” which leads to a punitive idea, such as the one insinuated by RFK Jr. in his testimony, that you don’t deserve the healthcare necessary to treat the disease, be it chronic or not, resulting from your lifestyle. It leads to RFK Jr. having a very hard time agreeing with the concept that basic healthcare should be a human right, because he sees some humans less deserving than others, to the point that he couldn’t answer yes but knew that answering no would look very, very bad. Now, let’s consider RFK Jr.’s testimony in light of something that his current communications director, TV producer turned antivax activist Del Bigtree, said early in the pandemic, around June 2020, six months before COVID-19 vaccines became available. I was pointing out his hostility to public health, shared among antivaxxers, in which public health is portrayed not as a collective enterprise but as individual responsibility. At the time, it had become clear that the biggest risk factors for severe disease and death from COVID-19 were old age and various chronic health conditions, such as diabetes, heart disease, chronic obstructive pulmonary disease, and the like. This led him to a rant that I have cited and repeated a number of times because it illustrates the attitude that I’m talking about far better than I ever could by just describing. Here is the episode, and here is the relevant segment (starting at about 2:23:28) which I long ago transcribed. I’m quoting a lengthy excerpt because it is so perfect a distillation of the MAHA ideal, with Bigtree claiming that for most of us COVID-19 was “just a cold” and that those of us without chronic diseases should “catch that cold” in order to get to herd immunity faster. If you’ve read this before in previous posts, feel free to skip past it, but I actually do think it’s worth reading again in order to see how much this sounds like MAHA: What is the group that is really at risk? Let’s be honest about this and say something that might get me some trouble here, but let’s be honest. That group is very well known. It’s people over the age of 65—not just because you’re over the age of 65, but you’re sick with other diseases. You have heart disease. You have COPD. You have diabetes. You have issues, many of those issues coming from the fact that you didn’t treat your body very well while you were on this planet. And I want to talk about this for one minute as we close this down. That 0.26% are the most sick among us, and I have nothing against you. Go ahead and bubble wrap your house. Lock yourself in your basement. Go and do what’s necessary. But here’s the problem. When you were my age, you were most likely eating food and fast food and Doritos and drinking Coca-Cola, which you’ll never find in my home. You were eating that all the time. You probably were drinking a lot of alcoholic beverages and really liked to party and enjoyed your cigarettes and said to yourself, “You know what? It’s more about the quality of my life right now. I don’t care if I live to be 100 years old. I want to enjoy my life right now. I like the finer things in life. I like good rich food. I like smoking a cigarette once in a while. I like to drink my drinks.” And you know what? Good on you! That’s the United States of America. No problem, that, some of my best friends think like that. It’s great, and they’re fun to hang out with. That’s perfectly OK. But here’s what’s not OK. When you reach that point in your life where now your arteries are starting to clog up, your body is shutting down, and the alcohol is eating up your liver, and you have diabetes, or you have COPD, you have asthma, you can’t breathe, all the cigarette smoking has finally caught up with you, you have heart disease because of the way you decided to live your life in the moment, here’s what you are now. You are pharmaceutical-dependent. You did that to yourself, not me. You decided that the moment mattered, and now you find yourself pharmaceutical-dependent, which is really what that 0.26% is, and that’s OK too. Thank God there’s drugs out there! There’s drugs that allow you to eat the Philly cheesesteak even though your body knows it hates it, but, go ahead, take the Prilosec. What difference does it make? Drug yourself! Drug yourself! Get through the day! Don’t exercise! Maybe just attach an electrode and see if a little electricity to the stomach will give you the abs you want. Come on! Grow up! You made choices! And now that you’re pharmaceutically-dependent, here’s what you don’t get to do. You don’t get to say I have to take a drug to protect you. That’s what this is. You don’t get to say I have to wear a mask and suck in my own CO2 to protect you. You don’t get to say I have to lock myself in a basement and destroy my career and take away my own ability to feed children because you are pharmaceutical-dependent. You lived your life. You made your choice. And thank God we live in the United States of America so you don’t have to worry about grocery police standing outside a grocery store saying, “Really? You really need four liters of Coca-Cola? You really need four bags of Doritos or Chitos or Fritos or whatever the heck it is, little cupcakes with synthetic icing on them? You really need all that?” Because we could go there. We could go there. If we’re really going to get into each other’s schiznit, that’s what we could do. Or could we live and let live? Eat all the Twinkies you want! Drink all the bourbon you want, and smoke as many cigarettes as you want, and when you find yourself pharmaceutical-dependent I will go ahead and say thank God the drug companies are there for you, but you do not get to make me pharmaceutical-dependent. You do not get to put me in the way of Heidi Larson, who wants to eradicate natural health and natural immunity and make us all pharmaceutical dependent. And when you find yourself pharmaceutical-dependent, I will go ahead and say thank God the drug companies are there for you. But you do not get to make me pharmaceutical-dependent. You do not get to put me in the way of Heidi Larson, who wants to eradicate natural health and natural herd immunity and make us all pharmaceutical-dependent. No, she only gets to rule your life because you lived in a way that you are going to need drugs to survive. And by the way, if you’re wearing a mask right now, if you’re locked in your basement, if you’re at a grocery store and you’re scowling at me and you aren’t pharmaceutical-dependent, and you are living a decent life, you may want to think about taking that mask off. You may want to think about coming out in the sunshine and getting some vitamin D. Because you know what? I do care about my pharmaceutical-dependent friends. And the only thing I can do for them, you know, beyond wishing for a vaccine unicorn, is to actually catch what is just a common cold. Oh my God I got you, right. You’re going nuts right now, you’re saying, wait. He said common cold. I thought people would compare this to the flu. No, let me be perfectly clear. This is not even a flu. For 99.74% of us, you won’t probably even have a fever or a cough, because as it’s described, this is one of the most mild illnesses there is. So mild, you are probably what is called an asymptomatic carrier, you don’t even know you have it. That’s how mild this is. It’s a common cold for 99.74% of us. The non-pharmaceutical-dependent people. So here’s what we do. Let’s go outside. Let’s take off our mask. We’re not on drugs, and we don’t need to be on drugs. Let’s catch this cold. Whether or not it’s just the 20% of us or maybe we’re not even in that category, let’s give it a college try to catch this cold, so that we can protect the pharmaceutical-dependent amongst us. That though they lived our lives, we still love them, and they need us to establish herd immunity, quick, before we destroy the world we live in and can’t do anything for anybody. So join me. Let’s save the world, shall we? I’m up for a cold. Grab your vitamin C, tour vitamin D, your magnesium, your zinc. Notice two strains of “thought” here. First, there is the self-righteousness, the victim-blaming, which led Bigtree to rant about how all these people with chronic diseases brought it on themselves and the faux “thanks” to the pharmaceutical companies for bailing them out with drugs to keep them going by keeping their heart disease, diabetes, lung disease, etc. under control. (Bigtree uses the term “pharmaceutical-dependent” in the same way that a fundamentalist preacher uses the word “sinner.”) Second is the hostility to any concept of public health, to collective action to protect the vulnerable. (“Go ahead and bubble wrap your house. Lock yourself in your basement. Go and do what’s necessary.”) Notice Bigtree’s attitude, which I’ll paraphrase: “Just because you’re chronically ill and “pharmaceutical-dependent” (due to your lifestyle choices) doesn’t give you the right to make me ‘pharmaceutical-dependent.'” Of course, by “pharmaceutical-dependent,” what Bigtree meant was his being required to take a hypothetical COVID-19 vaccine, which didn’t even exist yet at the time. This focus is particularly striking because, even though the first safe and effective COVID-19 vaccine did roll out a mere six months after this podcast, at the time neither Bigtree nor anyone else could have known that the vaccine would be developed that fast. In June 2020 we all assumed that a vaccine would probably be years away; that is, if one was successfully developed at all. After all, that’s what the experts were telling us at the time. Yet, here Bigtree was, worrying about being made “pharmaceutical-dependent” on a vaccine that, for all he knew, might never be successfully developed. Of course, one can’t help but contrast the “catch that cold” narrative above with RFK Jr.’s frequent claim that 60% of Americans have at least one chronic disease. If that claim is true, then Bigtree’s tirade makes no sense, because RFK Jr.’s estimate of 60% of us with chronic disease would have implied that most people were (and are) at for severe disease from COVID, not the tiny number that Bigtree claims. Similarly, the stance of anti-mask activists has generally been the false narrative masks don’t work at all to prevent transmission of COVID-19 but do cause all sorts of horrible problems. Here, at least, Bigtree seemed to be acknowledging that masks actually do work to prevent transmission, given that he told his listeners to take their masks off and “catch this cold,” all in order to promote “natural herd immunity.” Of course, no one ever claimed that Bigtree was big on consistency, at least not if mutually contradictory arguments can seem to bolster his misinformation-packed narratives. He is, after all, first and foremost, a propagandist. One other thing that I like to point out whenever I see this übermensch concept bubble up in alternative health, particularly with respect to COVID-19, is that there’s one risk factor for serious disease and death from the coronavirus that no one can control, and that’s getting older. You don’t have any control whatsoever when you were born and therefore how old you were when COVID-19 hit. It wasn’t your fault if you were over 70, which is one of the high risk groups. Oddly enough, neither RFK Jr. nor Del Bigtree has ever seemed to care much about that particular major risk factor—or even to acknowledge it much, other than in passing—because age is a non-modifiable risk factor. It’s not just COVID-19 where this judgmental idea that virtue equals health and poor health must imply a lack of virtue is prominent among MAHA. For example, what is HIV/AIDS denial, which RFK Jr. has promoted, but the idea that it isn’t a virus that causes AIDS, but lifestyle choices of which the denialist disapproves, mainly homosexual sex and use of poppers? Notably in his book The Real Anthony Fauci: Bill Gates, Big Pharma and the Global War on Democracy and Public Health, RFK Jr. proclaimed himself “neutral” regarding whether HIV is the cause of AIDS, stating that he takes “no position on the relationship between HIV and AIDS” and later declaring that HIV could be “one cause” of AIDS but that there are many others, in particular: Duesberg and many who have followed him offered evidence that heavy recreational drug use in gay men and drug addicts was the real cause of immune deficiency among the first generation of AIDS sufferers. They argued that the initial signs of AIDS, Kaposi’s sarcoma and Pneumocystis carinii pneumonia (PCP), were both strongly linked to amyl nitrate—poppers—a popular drug among promiscuous gays. RFK Jr. published this book in 2021, not the 1980s, by the way, and the idea that amyl nitrate had anything to do with the immunodeficiency observed in AIDS patients was debunked nearly 40 years ago. RFK Jr. also flirts with germ theory denial. Like many antivaxxers, he very much likes the ideas of 19th century scientist Antoine Béchamp, who posited that it wasn’t microbes that caused disease but, rather, that the microbes were a manifestation of an unhealthy or disordered “terrain,” which is the real cause of illness. Béchamps was a contemporary of Louis Pasteur, and his ideas Germ theory aficionados, in contrast, blame disease on microscopic pathogens. Their approach to health is to identify the culpable germ and tailor a poison to kill it. Miasmists complain that those patented poisons may themselves further weaken the immune system, or simply open damaged terrain to a competitive germ or cause chronic disease…When a starving African child succumbs to measles, the miasmist attributes the death to malnutrition; germ theory proponents (a.k.a. virologists) blame the virus. See what I mean? It’s of a piece with RFK Jr.’s activities during a deadly measles outbreak in Samoa in 2019 that killed over 80 children. While the outbreak was due to decreased uptake of the MMR vaccine that was the result of a tragic medication mishap in which two nurses mixed up a vial of MMR with a muscle relaxant than the correct diluent that led to plunging trust in vaccines, RFK Jr. did his best to throw gasoline on the existing fire of vaccine hesitancy, attempts to gaslight you about the true history in order to absolve RFK Jr. notwithstanding. But what does this all have to do with The Secret? MAHA, alternative health, and The Secret Does anyone remember The Secret? Back in the day, I used to write about it fairly often, because Oprah Winfrey had promoted this New Age concept on her then-immensely popular daytime television show. You might even remember that around 18 years ago, Oprah’s promotion of The Secret made the news. Around the same time, I noted that Oprah’s “Secret” had enticed a woman with breast cancer named Kim Tinkham to abandon science-based treatment and embrace the “pH miracle living” quackery of Robert O. Young. Oprah even invited Tinkham to appear on her show and seemed genuinely appalled to learn that Tinkham had decided to reject conventional medicine and surgery in order to “heal herself.” As a result, Tinkham died of metastatic breast cancer in 2010. One notes that it is probably not entirely a coincidence that Donald Trump also nominated Oprah’s protégé “America’s Quack,” Dr. Mehmet Oz, to be Administrator for the Centers for Medicare \u0026 Medicaid Services (CMS), the government agency that administers the federal government’s largest healthcare programs, including Medicare, Medicaid, and the insurance programs under the Affordable Care Act. But what is The Secret? As peddled by Oprah Winfrey, The Secret is: The secret of The Secret was something called the Law of Attraction. As Oprah put it on the show, “It says that the energy, that the thoughts and feelings that you put out into the world, both good and bad, are exactly what is always coming back to you, so you have the life that you have created.” Oprah and the teachers of The Secret, as they call themselves, did not mean this metaphorically. They explained that the universe and everything in it are made of vibrating energy, and by thinking positively we can actually “attract” the positive vibrations of the universe and bend them to our will. “You’re a field of energy in a larger field of energy,” one of The Secret’s teachers said. “And like attracts like, and that’s very, very scientific.” By harnessing this powerful science, they said, we can have anything we want—happiness, love, fabulous wealth. This was so inspiring to Oprah that she devoted three shows to the product and appeared on Larry King to talk it up more. She said it encapsulated everything she believes. “I’ve been talking about this for years on my show,” she said. “I just never called it The Secret.” The similarity between this concept and much of alt-med should be obvious and embodied in the idea, which I’ve seen so many times on so many alt-med websites, that you – yes, you! – are completely responsible for your own health by your own lifestyle choices. All it takes is living the right way, doing the right things, and you can be not just healthy, but virtually immune to serious diseases up to and including cancer. This sort of concept is inherent in the antivaccine world in which RFK Jr. has been a highly influential voice for two decades, in which it is frequently stated that vaccines are unnecessary because healthy people don’t get sick. It’s also inherent in the germ theory denialism so common in alt-med systems such as naturopathy and homeopathy. This denialism most often takes the form of the 21st century embrace by antivaccinationists and alternative medicine mavens of Antoine Béchamp‘s idea that it is the “terrain,” not the microbes, that make us sick. Never mind that in the influenza pandemic of 1918 it was the younger people who tended to die at a higher rate and the pandemic got its start in the U.S. in a military barracks. The basic concept is that the terrain is all, and, of course, you control the “terrain” with your thoughts. As with The Secret, there is a germ of truth in the concept that your thoughts can make you healthy, just not in the way implied by RFK Jr., his MAHA followers, and the conspirituality writers who have embraced right wing politics over the last several years. Again, if you have a genuine desire to be healthy, it is more likely that you will exercise, lay off unhealthy habits such as drinking to excess or smoking, and eat a healthy diet. However, as reasonable people know, it’s a matter of probabilities; diet and a healthy lifestyle are no panacea. Worse, as I’ve already written above, the corollary of the central dogma appears to be that if you are chronically ill it is your fault for not having the right “intent,” attitude, and thoughts and therefore not doing the right things and/or not believing hard enough. Whenever I encounter this idea, I like to point to my parents, neither of whom drank to excess, consumed unhealthy diets, or led what even RFK Jr. would consider an unhealthy lifestyle, aside from my mother not exercising much. (My dad was a sports fanatic and played basketball and softball, continuing to golf until he was in his 80s and his back no longer allowed him to do it.) Yet both of them developed chronic diseases, my father hypertension and heart disease and my mother suffering a major stroke two years ago. My grandmother was a highly accomplished amateur athlete, statewide tennis star who continued to play until well into her 70s. Yet she still developed heart disease and suffered a stroke. The implication behind MAHA and the alternative medicine “Secret”-like mindset behind it is that they brought these fates on themselves. The key idea behind RFK Jr.’s MAHA is that Americans are unhealthier than ever, with most adults suffering from chronic diseases, nearly all a result of a combination of lifestyle, vaccines, pharmaceuticals, and “poisonous” processed food. Similarly, he is known for having proclaimed the current generation of children to be the “sickest generation,” due to—you guessed it!—vaccines, processed food, pesticides, and lack of exercise. As I’ve pointed out before, RFK Jr. used the most inclusive possible definition of “chronic disease” to come up with a figure of more than half of children suffering from chronic disease and ignores changes in screening and diagnostic criteria that tend to increase the number of diagnoses of many of these conditions, but that’s par for the course for him. Indeed, I like to cite Vaxopedia for an estimate the real situation, where Dr. Vincent Iannelli brings the data to show that “not only are 54% of children not in poor health, with chronic health problems, 90% of today’s parents describe their children’s health as excellent or very good!” He also brings the pain to RFK Jr.’s claim by pointing out that while, yes, prevalence of some conditions are increasing, including ADHD, type 1 diabetes, obesity, and most autoimmune diseases, overall the health of today’s children compares favorably with children in the 1990s. Moreover, the largest threats to children’s health is gun violence, something that neither RFK Jr., MAHA, nor Donald Trump say anything about. Like any New Age guru or alternative medicine quack, he has the cure, which is to make people live virtuous lifestyles, whether they really want to or not. I do have to admit to being amused that even RFK Jr.’s fans saw right through this and (partially) correctly characterized it. For example, antivaxxer Sasha Latypova, who wrote: Make Chronic Illness Your Own Fault Again! At a minimum, it’s the fault of those bad farmers that need to be regulated harder into low-yield/high price food making practices. It’s not because you and your child have been injected gazillion times with non-self proteins, and now have an allergy to your normal environment, no. NO. You are not allowed to discuss THAT reason.  Any reason but THAT ONE.  Drop it, and put your digital choke collar back on! You are supposed to shut up about that, and get on board with the Uniparty pushing for more government regulation in agriculture and food, i.e., making the food scarcer and less affordable, just like the Agenda 2030 all-inclusive package envisions -Pestilence, War and Famine. Where Latypova is correct is that, at its heart, MAHA is mostly “make chronic illness your own fault again.” Where she is obviously incorrect is that vaccines are the real reason Americans are so unhealthy. Moreover, it’s not about healthcare as a “right,” as RFK Jr. made very clear in his response to Sen. Sanders. It’s very much an Orwellian Animal Farm construct, in which, “All animals are equal, but some animals are more equal than others.” Alternatively, you could view this as all humans being equal, but some are less equal than others, those less equal ones being the ones whose lifestyle choices contributed to their chronic disease(s) and who are therefore deemed less “worthy” of healthcare; that is, unless they are sufficiently affluent to pay for healthcare themselves, given RFK Jr.’s reference to smokers with cancer “taking from the pool.” Basically, health equals virtue, and lack of health equals a lack of virtue, never mind genetics. However, in this worldview, wealth also equals virtue. Basically, MAHA flows from a viewpoint that equates health with virtue, leading to hostility to the very concept of public health, as evidenced by RFK Jr.’s frequent claim that he “won’t take vaccines away” from those who want them and his shoulder shrug that says, in essence, go ahead and get vaccinated (and vaccinate your children) if you want to. Moreover, other than addressing (sort of) food and diet, I see little in the MAHA agenda that would actually address the four main drivers of the most common preventable chronic diseases (diabetes, heart disease, and respiratory diseases), specifically physical inactivity, poor nutrition, tobacco use, and excessive alcohol consumption. (Seriously, other than food and dubious science about food dictating what to do as far as our food supply goes, can anyone tell me how MAHA addresses tobacco use, physical inactivity, and alcohol use?) The whole MAHA agenda is a clever bait-and-switch that denies government responsibility or any collective action and, other than food, dumps responsibility for health entirely on the individual. Indeed, Amanda Marcotte summed it up well: …Kennedy stuck to his shtick of reframing health as a matter of private virtue rather than public concern. Over the course of the hearing, it became clear why this lifelong Democrat has switched to the GOP. His view that sick people did it to themselves and deserve what’s coming to them offers a nifty justification for Republicans‘ long-standing desire to deny health care to millions of Americans. Kennedy may dress this up as “prevention” or concern for children, but the message came through loud and clear: Medical patients are parasites who suck up resources from better, more responsible people.  Coming back to the example of smoking and cancer: Instead, Kennedy blamed “chronic disease,” a vague category that encompasses a cornucopia of ailments like “autoimmune diseases, neurodevelopmental disorders, asthma, Alzheimer’s, ADHD, depression, addiction” and, with special emphasis, diabetes. I’ll leave it to the experts and fact-checkers to explain how badly he misrepresented the diverse causes of these conditions. What matters here is the rhetorical purpose “chronic disease” plays: Blaming the victims, and creating the pretext for taking their health care away.  And: When asked how he would implement “prevention” for Medicare and Medicaid patients, Kennedy replied that it was about “making them accountable for their own health care, so they understand the relationship between eating and getting sick.” He argued that people on food assistance should have their options reduced so they can’t buy processed foods. That’s designed to sound vaguely positive while doing nothing to help people. No living person believes that Oreos are better for you than apples. Lecturing them about it and restricting their food budget will do nothing to reduce their medical costs, but it does creates an excuse to deny health care by claiming that they made themselves sick. Marcotte is correct, but I would quibble mildly. I would rephrase her assessment to say that what RFK Jr. wants to do also includes promoting access to healthcare that is not science-based but is rather the sort of quackery that alternative medicine practitioners believe in. After all, remember that part of the MAHA agenda is to Make Quackery Great Again, with RFK Jr. declaring war on the FDA: As an aside, speaking of hyperbaric oxygen therapy (HBOT), in my neck of the woods, a five-year-old boy was recently killed at a quack clinic when an HBOT chamber he was in exploded. No information was provided about what it was that he was being “treated” for, but I bet that it wasn’t any of the handful of indications for which there is good evidence that HBOT is effective. Look for a lot more tragedies like this dead five-year-old, and not just from HBOT quackery, if RFK Jr. is confirmed. As for the rest, as I said before, the FDA doesn’t “suppress” exercise, “clean foods,” sunshine, or nutraceuticals. It does regulate the rest because there is no good evidence base for any of them, especially hydroxychloroquine and ivermectin, neither of which treat or prevent COVID-19. Raw milk, in particular, is a particularly nasty public health threat given that it can carry all manner of diseases, including H5N1 bird flu. There’s a reason Pasteurization was invented. Moreover, stem cell clinics have become quite the profit center at quack clinics that use stem cells (and charge large amounts of money for them) to treat all manner of diseases for which there is yet no good evidence for their efficacy. (Remember Gordie Howe and his stroke?) It’s a MAHA world now, unfortunately As I was writing this post, I realized that it’s a bit too simplistic to describe MAHA as just another manifestation of The Secret as the central dogma of alternative medicine, but that doing so does touch on a simple truth. MAHA is a “manifestation” of alternative medicine and health applied to government policy, and there will be disastrous results if RFK Jr. is confirmed. It’s not for nothing that I referred to RFK Jr. at HHS as an “extinction-level” threat to public health. Specifically, MAHA embodies the idea of health being due, above all, to personal will, virtue, and efforts, rather than public health efforts, but it also embodies the idea that science-based medicine and nutrition are not just ineffective but actively harmful. In that way, it is also manifestation of what I like to call the cult of purity that is behind so much of alternative medicine and so many antivaccine beliefs, namely that anything “unnatural” will contaminate you and lead to a degradation in your health, especially vaccines and pharmaceuticals. Although MAHA pays lip service to lack of physical activity and exercise as one major driver of chronic disease, while proposing basically nothing to reverse that tendency in the population to physical inactivity, it mixes science-based ideas with quackery when it comes to food and diet as drivers of chronic disease. In parallel, MAHA says little or nothing about alcohol or tobacco, two other major drivers of chronic disease, other than RFK Jr. implying that someone who gets cancer as a result of smoking “draws from the pool” and doesn’t deserve taxpayer-funded healthcare. MAHA is a con designed to distract from what will undoubtedly be RFK Jr.’s war on vaccines and science-based regulation of food and drugs. What makes it so appealing is what makes The Secret and the central dogma of alternative medicine so appealing, the idea that you, and you alone, control your destiny when it comes to health. Would that were the case, but no one can escape their genetics, and many can’t escape their environment, both of which, science-based medicine tells us, have enormous effects on overall health. I don’t know if RFK Jr. will be confirmed or not—sadly, I suspect that he probably will—but I do know that if he is, public health and science-based regulation as we currently understand the concepts will be under a threat unlike any faced before. I also know that, even if RFK Jr. fails to win confirmation as HHS Secretary, President Trump will likely nominate someone almost as bad, but just not as obviously a conspiracy-mongering antivax crank.",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2024/10/MAHAHA.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003cp\u003eLast Wednesday, antivax conspiracy theorist and crank Robert F. Kennedy, Jr. testified before the Senate Finance Committee as nominee to become President Donald Trump’s Secretary of the Department of Health and Human Services. It just so happened that Wednesday is a day when I have no scheduled clinical responsibilities other than to round on patients in the hospital when I have any (which isn’t that often given my specialty). Fortunately (or unfortunately, I’m not sure), that meant that I was doing charts in my office and writing a grant proposal, meaning that I was able to fire up my iPad and have the Senate confirmation hearing going in the background. As someone who has been debunking the antivax misinformation, pseudoscience, conspiracy theories, and outright lies that RFK Jr. has been promoting for close to 20 years, even I found it painful to listen, and I recognized a lot of old tropes that RFK Jr. has been repeating for two decades (e.g., “Ralph Nader was pro-safety for cars, but no one called him anti-car; I was anti-mercury in fish, but no one called me anti-fish”). Then I came to an exchange between RFK Jr. and Senator Bernie Sanders. After I saw this exchange, everything about MAHA started to come into perspective in a way that, frankly, I’m embarrassed that it hadn’t before, given how often I had written about the idea that undergirds alternative medicine, an idea that I called the \u003ca href=\"https://sciencebasedmedicine.org/the-central-dogma-of-alternativecomplementaryintegrative-medicine/\" title=\"\"\u003ecentral dogma of alternative health\u003c/a\u003e, namely a variant of “The Secret,” or, as I like to call it, “wishing makes it so,” or, more recently, the idea that a virtuous lifestyle with respect to health will ward off all disease.\u003c/p\u003e\n\n\n\n\u003cp\u003eLet me explain by going over some testimony, although first I have to point out one part of the proceedings that led me to laugh out loud.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlthough I do like some of what he has to say, in general I haven’t usually been a big fan of Bernie Sanders, and, indeed, had feared that he might be one non-Republican who might vote to confirm RFK Jr., based on his disdain shared with RFK Jr. for big pharma and his belief (also shared with RFK Jr.) that not enough is devoted to promoting healthy living. However, I do have to give Sen. Sanders credit for hammering RFK Jr. on his antivax views. The best example was what became a viral moment, when Sen. Sanders hammered RFK Jr. about onesies with antivax slogans sold by Children’s Health Defense, the antivax organization founded by RFK Jr. Sen. Sanders kept asking RFK Jr. if he would stop the sale of these onesies, sarcastically adding “now that you’re provaccine.” Predictably RFK Jr. dodged by saying that he was no longer associated with the organization and had resigned from its board of directors after being nominated for HHS Secretary. Sen. Sanders was ready for that dodge and asked RFK Jr. repeatedly whether he supported the message on the onesies, “now that you’re pro-vaccine.” Before I go on, I just have to show you this clip, because it’s very revealing:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Bernie Sanders grills RFK Jr. over former organization\u0026#39;s anti-vaccine onesies\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/lYXH9TRFGOQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBasically, this ambush by Sen. Sanders was a thing of beauty that, sadly, will probably have little bearing on whether RFK Jr. is confirmed or not. I show it, though, just to emphasize how dishonest RFK Jr. is. Yes, he might no longer be affiliated—\u003cem\u003e\u003cstrong\u003eofficially\u003c/strong\u003e\u003c/em\u003e—with CHD, but if he called them up and told them to stop selling these onesies, I’m sure they would comply.\u003c/p\u003e\n\n\n\n\u003ch2\u003eMAHA: Health as a result of virtue?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe most important part of the exchange between Sen. Sanders and RFK Jr., the part that inspired the idea for this post and got me to thinking about The Secret and MAHA, came here: \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe key part of the exchange that caught my ear was this part of RFK Jr.’s answer to the question, which occurred after he had dodged and weaved in order not to give a definite yes/no answer:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eFree speech doesn’t cost anybody anything, but in health care, if you smoke cigarettes for 20 years and you get cancer you are now taking from the pool. Are you guaranteed the same right?\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eDoes this sound familiar? It’s a recurring theme that we hear from believers in alternative and “natural” medicine, namely the victim-blaming idea of lifestyle \u003cem\u003eüber alles\u003c/em\u003e in medicine, the judgmental mindset that if you are ill it is your fault. (Never mind, for instance, that nicotine is a highly addictive substance that makes it incredibly difficult to quit smoking once you start. Never mind that whole industries exist to promote and sell tobacco.)\u003c/p\u003e\n\n\n\n\u003cp\u003eIf I were to sum up the idea succinctly, it is the concept that virtue equals health and that, if you are not healthy, you must not be virtuous. In this context, “virtue” means leading a “virtuous” lifestyle with respect to health; i.e., eating a healthy diet, exercising, not indulging in habits that contribute to chronic disease, etc. Consequently, if you develop lung cancer or heart disease as a result of your having smoked cigarettes for 20 or 30 years, somehow you are less deserving of healthcare. It’s a concept that suffuses the antivax movement too, with claims that diet and healthy living can prevent disease better than any vaccine.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe prototypical example of this attitude that I like to cite is one that I first wrote about quite a long time ago. It comes from Bill Maher, the formerly seemingly “liberal” comedian and pundit who has always leaned antivax and pro-quackery but during COVID-19 really let his contrarian freak flag fly high and also “come out”—if you will—\u003ca href=\"https://www.respectfulinsolence.com/2022/05/25/bill-maher-antivax-transphobe/\" title=\"\"\u003eas anti-trans\u003c/a\u003e. The exchange occurred way back in 2009 when \u003ca href=\"https://sciencebasedmedicine.org/oh-come-on-superman-bill-maher-and-western-medicine/\" title=\"\"\u003eBob Costas was a guest on his show\u003c/a\u003e. Somehow the subject of the influenza vaccine came up. Maher claimed that, because he lived the “right” lifestyle—never mind all that marijuana, right?—his immune system was superior and he would not catch flu on an airplane, leading him to say, “I would never get the flu on an airplane,” presumably because his immune system is so healthy and there is no “swamp” there for the virus to breed in.\u003c/p\u003e\n\n\n\n\u003cp\u003eAn exasperated Bob Costas retorted brilliantly, “Oh, come on, Superman!” \u003c/p\u003e\n\n\n\n\u003cp\u003eIt turns out that this same attitude underlies much of the “Make America Healthy Again” (MAHA) movement, namely that health virtue equals health. Now, far be it from me to say that you shouldn’t live a healthy lifestyle (based on science), eat a healthy diet (based on science), exercise, maintain a healthy weight, or to claim that doing so doesn’t maximize your chances of being (and remaining) healthy. That’s not the problem. The problem is the dark underbelly of this belief, namely that if you aren’t healthy you must not be sufficiently “virtuous,” which leads to a punitive idea, such as the one insinuated by RFK Jr. in his testimony, that you don’t deserve the healthcare necessary to treat the disease, be it chronic or not, resulting from your lifestyle. It leads to RFK Jr. having a very hard time agreeing with the concept that basic healthcare should be a human right, because he sees some humans less deserving than others, to the point that he couldn’t answer yes but knew that answering no would look very, very bad.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, let’s consider RFK Jr.’s testimony in light of something that his \u003ca href=\"https://www.nbcnews.com/politics/2024-election/rfk-jr-hires-del-bigtree-anti-vaccine-activist-communications-director-rcna131859\" title=\"\"\u003ecurrent communications director\u003c/a\u003e, TV producer turned antivax activist \u003ca href=\"https://sciencebasedmedicine.org/tag/del-bigtree/\" title=\"\"\u003eDel Bigtree\u003c/a\u003e, said early in the pandemic, around June 2020, six months before COVID-19 vaccines became available. I was pointing out his hostility to public health, shared among antivaxxers, in which public health is portrayed not as a collective enterprise but as individual responsibility. At the time, it had become clear that the biggest risk factors for severe disease and death from COVID-19 were old age and various chronic health conditions, such as diabetes, heart disease, chronic obstructive pulmonary disease, and the like. This led him to a rant that I have cited and repeated a number of times because it illustrates the attitude that I’m talking about far better than I ever could by just describing. Here is the \u003ca href=\"https://thehighwire.com/ark-videos/deadly-doses/\" rel=\"nofollow\" title=\"\"\u003eepisode\u003c/a\u003e, and here is the relevant segment (starting at about 2:23:28) which I long ago transcribed. I’m quoting a lengthy excerpt because it is so perfect a distillation of the MAHA ideal, with Bigtree claiming that for most of us COVID-19 was “just a cold” and that those of us without chronic diseases should “catch that cold” in order to get to herd immunity faster. If you’ve read this before in previous posts, feel free to skip past it, but I actually do think it’s worth reading again in order to see how much this sounds like MAHA:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eWhat is the group that is really at risk? Let’s be honest about this and say something that might get me some trouble here, but let’s be honest. That group is very well known. It’s people over the age of 65—not just because you’re over the age of 65, but you’re sick with other diseases. You have heart disease. You have COPD. You have diabetes. You have issues, many of those issues coming from the fact that you didn’t treat your body very well while you were on this planet. And I want to talk about this for one minute as we close this down. That 0.26% are the most sick among us, and I have nothing against you. Go ahead and bubble wrap your house. Lock yourself in your basement. Go and do what’s necessary.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut here’s the problem. When you were my age, you were most likely eating food and fast food and Doritos and drinking Coca-Cola, which you’ll never find in my home. You were eating that all the time. You probably were drinking a lot of alcoholic beverages and really liked to party and enjoyed your cigarettes and said to yourself, “You know what? It’s more about the quality of my life right now. I don’t care if I live to be 100 years old. I want to enjoy my life right now. I like the finer things in life. I like good rich food. I like smoking a cigarette once in a while. I like to drink my drinks.” And you know what? Good on you! That’s the United States of America. No problem, that, some of my best friends think like that. It’s great, and they’re fun to hang out with. That’s perfectly OK.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut here’s what’s not OK. When you reach that point in your life where now your arteries are starting to clog up, your body is shutting down, and the alcohol is eating up your liver, and you have diabetes, or you have COPD, you have asthma, you can’t breathe, all the cigarette smoking has finally caught up with you, you have heart disease because of the way you decided to live your life in the moment, here’s what you are now. You are pharmaceutical-dependent. You did that to yourself, not me. You decided that the moment mattered, and now you find yourself pharmaceutical-dependent, which is really what that 0.26% is, and that’s OK too. Thank God there’s drugs out there! There’s drugs that allow you to eat the Philly cheesesteak even though your body knows it hates it, but, go ahead, take the Prilosec. What difference does it make? Drug yourself! Drug yourself! Get through the day! Don’t exercise! Maybe just attach an electrode and see if a little electricity to the stomach will give you the abs you want.\u003c/p\u003e\n\n\n\n\u003cp\u003eCome on! Grow up! You made choices! And now that you’re pharmaceutically-dependent, here’s what you don’t get to do. You don’t get to say I have to take a drug to protect you. That’s what this is. You don’t get to say I have to wear a mask and suck in my own CO2 to protect you. You don’t get to say I have to lock myself in a basement and destroy my career and take away my own ability to feed children because you are pharmaceutical-dependent. You lived your life. You made your choice. And thank God we live in the United States of America so you don’t have to worry about grocery police standing outside a grocery store saying, “Really? You really need four liters of Coca-Cola? You really need four bags of Doritos or Chitos or Fritos or whatever the heck it is, little cupcakes with synthetic icing on them? You really need all that?” Because we could go there. We could go there. If we’re really going to get into each other’s \u003ca href=\"https://www.urbandictionary.com/define.php?term=Schiznit\"\u003eschiznit\u003c/a\u003e, that’s what we could do.\u003c/p\u003e\n\n\n\n\u003cp\u003eOr could we live and let live? Eat all the Twinkies you want! Drink all the bourbon you want, and smoke as many cigarettes as you want, and when you find yourself pharmaceutical-dependent I will go ahead and say thank God the drug companies are there for you, but you do not get to make me pharmaceutical-dependent. You do not get to put me in the way of Heidi Larson, who wants to eradicate natural health and natural immunity and make us all pharmaceutical dependent.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd when you find yourself pharmaceutical-dependent, I will go ahead and say thank God the drug companies are there for you. But you do not get to make me pharmaceutical-dependent. You do not get to put me in the way of Heidi Larson, who wants to eradicate natural health and natural herd immunity and make us all pharmaceutical-dependent. No, she only gets to rule your life because you lived in a way that you are going to need drugs to survive. And by the way, if you’re wearing a mask right now, if you’re locked in your basement, if you’re at a grocery store and you’re scowling at me and you aren’t pharmaceutical-dependent, and you are living a decent life, you may want to think about taking that mask off. You may want to think about coming out in the sunshine and getting some vitamin D. Because you know what? I do care about my pharmaceutical-dependent friends. And the only thing I can do for them, you know, beyond wishing for a vaccine unicorn, is to actually catch what is just a common cold. Oh my God I got you, right. You’re going nuts right now, you’re saying, wait. He said common cold. I thought people would compare this to the flu. No, let me be perfectly clear. This is not even a flu.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor 99.74% of us, you won’t probably even have a fever or a cough, because as it’s described, this is one of the most mild illnesses there is. So mild, you are probably what is called an asymptomatic carrier, you don’t even know you have it. That’s how mild this is. It’s a common cold for 99.74% of us. The non-pharmaceutical-dependent people. So here’s what we do. Let’s go outside. Let’s take off our mask. We’re not on drugs, and we don’t need to be on drugs. Let’s catch this cold. Whether or not it’s just the 20% of us or maybe we’re not even in that category, let’s give it a college try to catch this cold, so that we can protect the pharmaceutical-dependent amongst us. That though they lived our lives, we still love them, and they need us to establish herd immunity, quick, before we destroy the world we live in and can’t do anything for anybody. So join me. Let’s save the world, shall we? I’m up for a cold. Grab your vitamin C, tour vitamin D, your magnesium, your zinc.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eNotice two strains of “thought” here. First, there is the self-righteousness, the victim-blaming, which led Bigtree to rant about how all these people with chronic diseases brought it on themselves and the faux “thanks” to the pharmaceutical companies for bailing them out with drugs to keep them going by keeping their heart disease, diabetes, lung disease, etc. under control. (Bigtree uses the term “pharmaceutical-dependent” in the same way that a fundamentalist preacher uses the word “sinner.”) Second is the hostility to any concept of public health, to collective action to protect the vulnerable. (“Go ahead and bubble wrap your house. Lock yourself in your basement. Go and do what’s necessary.”) Notice Bigtree’s attitude, which I’ll paraphrase: “Just because \u003cstrong\u003e\u003cem\u003eyou’re\u003c/em\u003e\u003c/strong\u003e chronically ill and “pharmaceutical-dependent” (due to your lifestyle choices) doesn’t give \u003cem\u003e\u003cstrong\u003eyou\u003c/strong\u003e\u003c/em\u003e the right to make \u003cstrong\u003e\u003cem\u003eme\u003c/em\u003e\u003c/strong\u003e ‘pharmaceutical-dependent.\u0026#39;” Of course, by “pharmaceutical-dependent,” what Bigtree meant was his being required to take a hypothetical COVID-19 vaccine, which \u003cem\u003edidn’t even exist yet at the time\u003c/em\u003e. This focus is particularly striking because, even though the first safe and effective COVID-19 vaccine did roll out a mere six months after this podcast, at the time neither Bigtree nor anyone else could have known that the vaccine would be developed that fast. In June 2020 we all assumed that a vaccine would probably be years away; that is, if one was successfully developed at all. After all, that’s what the experts were telling us at the time. Yet, here Bigtree was, worrying about being made “pharmaceutical-dependent” on a vaccine that, for all he knew, might never be successfully developed.\u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, one can’t help but contrast the “catch that cold” narrative above with RFK Jr.’s frequent claim that 60% of Americans have at least one chronic disease. If that claim is true, then Bigtree’s tirade makes no sense, because RFK Jr.’s estimate of 60% of us with chronic disease would have implied that \u003cem\u003e\u003cstrong\u003emost\u003c/strong\u003e\u003c/em\u003e people were (and are) at for severe disease from COVID, not the tiny number that Bigtree claims. Similarly, the stance of anti-mask activists has generally been the false narrative masks don’t work at all to prevent transmission of COVID-19 but do cause all sorts of horrible problems. Here, at least, Bigtree seemed to be acknowledging that masks actually do work to prevent transmission, given that he told his listeners to take their masks off and “catch this cold,” all in order to promote “natural herd immunity.” Of course, no one ever claimed that Bigtree was big on consistency, at least not if mutually contradictory arguments can seem to bolster his misinformation-packed narratives. He is, after all, first and foremost, a propagandist.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne other thing that I like to point out whenever I see this \u003cem\u003e\u003ca href=\"https://www.vocabulary.com/dictionary/Ubermensch#:~:text=A%20person%20who%20seems%20superhuman,an%20ultimate%20goal%20for%20humanity.\" title=\"\"\u003eübermensch\u003c/a\u003e\u003c/em\u003e concept bubble up in alternative health, particularly with respect to COVID-19, is that there’s one risk factor for serious disease and death from the coronavirus that no one can control, and that’s getting older. You don’t have any control whatsoever when you were born and therefore how old you were when COVID-19 hit. It wasn’t your fault if you were over 70, which is one of the high risk groups. Oddly enough, neither RFK Jr. nor Del Bigtree has ever seemed to care much about that particular major risk factor—or even to acknowledge it much, other than in passing—because age is a non-modifiable risk factor.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s not just COVID-19 where this judgmental idea that virtue equals health and poor health must imply a lack of virtue is prominent among MAHA. For example, what is HIV/AIDS denial, which RFK Jr. has promoted, but the idea that it isn’t a virus that causes AIDS, but lifestyle choices of which the denialist disapproves, mainly homosexual sex and use of poppers? Notably in his book \u003ca href=\"https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Real Anthony Fauci: Bill Gates, Big Pharma and the Global War on Democracy and Public Health\u003c/a\u003e, RFK Jr. proclaimed himself “\u003ca href=\"https://www.managedhealthcareexecutive.com/view/rfk-jr-and-hiv-denial-he-says-he-is-neutral-but-\" title=\"\"\u003eneutral\u003c/a\u003e” regarding whether HIV is the cause of AIDS, stating that he takes “no position on the relationship between HIV and AIDS” and later declaring that HIV could be “one cause” of AIDS but that there are many others, in particular:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eDuesberg and many who have followed him offered evidence that heavy recreational drug use in gay men and drug addicts was the real cause of immune deficiency among the first generation of AIDS sufferers. They argued that the initial signs of AIDS, Kaposi’s sarcoma and \u003cem\u003ePneumocystis carinii \u003c/em\u003epneumonia (PCP), were both strongly linked to amyl nitrate—poppers—a popular drug among promiscuous gays.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eRFK Jr. published this book in 2021, not the 1980s, by the way, and the idea that amyl nitrate had anything to do with the immunodeficiency observed in AIDS patients was debunked nearly 40 years ago.\u003c/p\u003e\n\n\n\n\u003cp\u003eRFK Jr. also flirts with germ theory denial. Like many antivaxxers, he very much likes the ideas of 19th century scientist Antoine Béchamp, who posited that it wasn’t microbes that caused disease but, rather, that the microbes were a manifestation of an unhealthy or disordered “terrain,” which is the real cause of illness. Béchamps was a contemporary of Louis Pasteur, and his ideas\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eGerm theory aficionados, in contrast, blame disease on microscopic pathogens. Their approach to health is to identify the culpable germ and tailor a poison to kill it. Miasmists complain that those patented poisons may themselves further weaken the immune system, or simply open damaged terrain to a competitive germ or cause chronic disease…When a starving African child succumbs to measles, the miasmist attributes the death to malnutrition; germ theory proponents (a.k.a. virologists) blame the virus.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eSee what I mean? It’s of a piece with RFK Jr.’s activities during a deadly measles outbreak in Samoa in 2019 that killed over 80 children. While the outbreak was due to decreased uptake of the MMR vaccine that was the result of a tragic medication mishap in which two nurses mixed up a vial of MMR with a muscle relaxant than the correct diluent that led to plunging trust in vaccines, RFK Jr. did his best to throw gasoline on the existing fire of vaccine hesitancy, \u003ca href=\"https://sciencebasedmedicine.org/gaslighting-rfk-jr-s-role-in-the-deadly-samoan-measles-outbreak/\" title=\"\"\u003eattempts to gaslight you about the true history\u003c/a\u003e in order to absolve RFK Jr. notwithstanding.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut what does this all have to do with The Secret?\u003c/p\u003e\n\n\n\n\u003ch2\u003eMAHA, alternative health, and The Secret\u003c/h2\u003e\n\n\n\n\u003cp\u003eDoes anyone remember The Secret? Back in the day, I used to write about it fairly often, because \u003ca href=\"https://sciencebasedmedicine.org/tag/oprah-winfrey/\" title=\"\"\u003eOprah Winfrey\u003c/a\u003e had \u003ca href=\"https://sciencebasedmedicine.org/the-oprah-fication-of-medicine/\" title=\"\"\u003epromoted this New Age concept\u003c/a\u003e on her then-immensely popular daytime television show. You might even remember that around 18 years ago, Oprah’s promotion of The Secret \u003ca href=\"https://www.salon.com/2007/03/05/the_secret/\" title=\"\"\u003emade the news\u003c/a\u003e. Around the same time, I noted that Oprah’s “Secret” had enticed a woman with breast cancer named \u003ca href=\"https://sciencebasedmedicine.org/tag/kim-tinkham/\" title=\"\"\u003eKim Tinkham\u003c/a\u003e to abandon science-based treatment and embrace the “pH miracle living” quackery of \u003ca href=\"https://sciencebasedmedicine.org/tag/robert-o-young/\" title=\"\"\u003eRobert O. Young\u003c/a\u003e. Oprah even \u003ca href=\"https://www.newsweek.com/why-health-advice-oprah-could-make-you-sick-80201\" title=\"\"\u003einvited Tinkham to appear on her show\u003c/a\u003e and seemed genuinely appalled to learn that Tinkham had decided to reject conventional medicine and surgery in order to “heal herself.” As a result, Tinkham \u003ca href=\"https://sciencebasedmedicine.org/the-impending-end-of-a-horrifying-testimonial-for-an-alternative-medicine-breast-cancer-cure/\" title=\"\"\u003edied of metastatic breast cancer in 2010\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne notes that it is probably not entirely a coincidence that Donald Trump also nominated Oprah’s protégé “\u003ca href=\"https://www.respectfulinsolence.com/2022/11/08/americas-quack-dr-oz-and-the-failure-of-medical-academia-revisited/\" title=\"\"\u003eAmerica’s Quack\u003c/a\u003e,”\u003ca href=\"https://sciencebasedmedicine.org/tag/mehmet-oz/\" title=\"\"\u003e Dr. Mehmet Oz\u003c/a\u003e, to be \u003ca href=\"https://sciencebasedmedicine.org/antivaxxers-grifters-and-quacks-rfk-jr-s-maha-takes-over-federal-health-agencies/\" title=\"\"\u003eAdministrator for the Centers for Medicare \u0026amp; Medicaid Services\u003c/a\u003e (CMS), the government agency that administers the federal government’s largest healthcare programs, including Medicare, Medicaid, and the insurance programs under the Affordable Care Act. But what is The Secret? \u003ca href=\"https://www.newsweek.com/why-health-advice-oprah-could-make-you-sick-80201\" title=\"\"\u003eAs peddled by Oprah Winfrey\u003c/a\u003e, The Secret is:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe secret of The Secret was something called the Law of Attraction. As Oprah put it on the show, “It says that the energy, that the thoughts and feelings that you put out into the world, both good and bad, are exactly what is always coming back to you, so you have the life that you have created.” Oprah and the teachers of The Secret, as they call themselves, did not mean this metaphorically. They explained that the universe and everything in it are made of vibrating energy, and by thinking positively we can actually “attract” the positive vibrations of the universe and bend them to our will. “You’re a field of energy in a larger field of energy,” one of The Secret’s teachers said. “And like attracts like, and that’s very, very scientific.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBy harnessing this powerful science, they said, we can have anything we want—happiness, love, fabulous wealth. This was so inspiring to Oprah that she devoted three shows to the product and appeared on \u003cem\u003eLarry King\u003c/em\u003e to talk it up more. She said it encapsulated everything she believes. “I’ve been talking about this for years on my show,” she said. “I just never called it The Secret.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThe similarity between this concept and much of alt-med should be obvious and embodied in the idea, which I’ve seen so many times on so many alt-med websites, that you – yes, you! – are \u003cem\u003e\u003cstrong\u003ecompletely\u003c/strong\u003e\u003c/em\u003e responsible for \u003cem\u003e\u003cstrong\u003eyour\u003c/strong\u003e\u003c/em\u003e own health by \u003cem\u003e\u003cstrong\u003eyour\u003c/strong\u003e\u003c/em\u003e own lifestyle choices. All it takes is living the right way, doing the right things, and you can be not just healthy, but virtually immune to serious diseases up to and including cancer. This sort of concept is inherent in the antivaccine world in which RFK Jr. has been a highly influential voice for two decades, in which it is frequently stated that vaccines are unnecessary because healthy people don’t get sick. It’s also inherent in the germ theory denialism so common in alt-med systems such as \u003ca href=\"https://sciencebasedmedicine.org/index.php/naturopathy-and-science/\"\u003enaturopathy\u003c/a\u003e and homeopathy. This denialism most often takes the form of the \u003ca href=\"https://sciencebasedmedicine.org/index.php/germ-theory-denialism-a-major-strain-in-alt-med-thought/\"\u003e21st century embrace by antivaccinationists\u003c/a\u003e and alternative medicine mavens of \u003ca href=\"http://en.wikipedia.org/wiki/Antoine_Béchamp\"\u003eAntoine Béchamp\u003c/a\u003e‘s idea that it is the “terrain,” not the microbes, that make us sick. Never mind that in the influenza pandemic of 1918 it was the younger people who tended to die at a higher rate and the pandemic got its start in the U.S. in a military barracks. The basic concept is that the terrain is all, and, of course, you control the “terrain” with your thoughts.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs with The Secret, there is a germ of truth in the concept that your thoughts can make you healthy, just not in the way implied by RFK Jr., his MAHA followers, and the \u003ca href=\"https://en.wikipedia.org/wiki/Conspirituality\" title=\"\"\u003econspirituality\u003c/a\u003e writers who have embraced right wing politics over the last several years. Again, if you have a genuine desire to be healthy, it is more likely that you will exercise, lay off unhealthy habits such as drinking to excess or smoking, and eat a healthy diet. However, as reasonable people know, it’s a matter of probabilities; diet and a healthy lifestyle are no panacea. Worse, as I’ve already written above, the corollary of the central dogma appears to be that if you are chronically ill it is your fault for not having the right “intent,” attitude, and thoughts and therefore not doing the right things and/or not believing hard enough.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhenever I encounter this idea, I like to point to my parents, neither of whom drank to excess, consumed unhealthy diets, or led what even RFK Jr. would consider an unhealthy lifestyle, aside from my mother not exercising much. (My dad was a sports fanatic and played basketball and softball, continuing to golf until he was in his 80s and his back no longer allowed him to do it.) Yet both of them developed chronic diseases, my father hypertension and heart disease and my mother suffering a major stroke two years ago. My grandmother was a highly accomplished amateur athlete, statewide tennis star who continued to play until well into her 70s. Yet she still developed heart disease and suffered a stroke. The implication behind MAHA and the alternative medicine “Secret”-like mindset behind it is that they brought these fates on themselves.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe key idea behind RFK Jr.’s MAHA is that Americans are unhealthier than ever, with most adults suffering from chronic diseases, nearly all a result of a combination of lifestyle, vaccines, pharmaceuticals, and “poisonous” processed food. Similarly, he is known for having proclaimed the current generation of children to be the “\u003ca href=\"https://sciencebasedmedicine.org/is-marianne-williamson-correct-that-todays-generation-of-children-is-the-sickest-generation/\" title=\"\"\u003esickest generation\u003c/a\u003e,” due to—you guessed it!—vaccines, processed food, pesticides, and lack of exercise. \u003ca href=\"https://sciencebasedmedicine.org/is-marianne-williamson-correct-that-todays-generation-of-children-is-the-sickest-generation/\" title=\"\"\u003eAs I’ve pointed out before\u003c/a\u003e, RFK Jr. used the most inclusive possible definition of “chronic disease” to come up with a figure of more than half of children suffering from chronic disease and ignores changes in screening and diagnostic criteria that tend to increase the number of diagnoses of many of these conditions, but that’s par for the course for him. Indeed, I like to cite Vaxopedia for an estimate the real situation, where Dr. Vincent Iannelli \u003ca href=\"https://vaxopedia.org/2019/09/15/do-54-of-children-have-a-chronic-health-condition/\" title=\"\"\u003ebrings the data\u003c/a\u003e to show that “not only are 54% of children not in poor health, with chronic health problems, 90% of today’s parents describe their children’s health as excellent or very good!” He also brings the pain to RFK Jr.’s claim by pointing out that while, yes, prevalence of some conditions are increasing, including ADHD, type 1 diabetes, obesity, and most autoimmune diseases, overall the health of today’s children \u003ca href=\"https://vaxopedia.org/2018/04/18/americas-new-normal-propaganda-about-the-unhealthiest-generation/\" title=\"\"\u003ecompares favorably with children in the 1990s\u003c/a\u003e. Moreover, the largest threats to children’s health is gun violence, something that neither RFK Jr., MAHA, nor Donald Trump say anything about.\u003c/p\u003e\n\n\n\n\u003cp\u003eLike any New Age guru or alternative medicine quack, he has the cure, which is to make people live virtuous lifestyles, whether they really want to or not. I do have to admit to being amused that even RFK Jr.’s fans saw right through this and (partially) \u003ca href=\"https://sciencebasedmedicine.org/antivaxxers-easily-see-through-the-misdirection-of-rfk-jr-s-maha/\" title=\"\"\u003ecorrectly characterized it\u003c/a\u003e. For example, antivaxxer Sasha Latypova, who \u003ca href=\"https://sashalatypova.substack.com/p/let-them-eat-organic-sustainably\" rel=\"nofollow\" title=\"\"\u003ewrote\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eMake Chronic Illness Your Own Fault Again! At a minimum, it’s the fault of those bad farmers that need to be regulated harder into low-yield/high price food making practices. It’s not because you and your child have been injected gazillion times with non-self proteins, and now have an allergy to your normal environment, no. NO. You are not allowed to discuss THAT reason. \u003c/p\u003e\n\n\n\n\u003cp\u003eAny reason but THAT ONE. \u003c/p\u003e\n\n\n\n\u003cp\u003eDrop it, and put your digital choke collar back on! You are supposed to shut up about that, and get on board with the Uniparty pushing for more government regulation in agriculture and food, i.e., making the food scarcer and less affordable, just like the Agenda 2030 all-inclusive package envisions -Pestilence, War \u003cstrong\u003eand Famine\u003c/strong\u003e.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWhere Latypova is correct is that, at its heart, MAHA is mostly “make chronic illness your own fault again.” Where she is obviously incorrect is that vaccines are the real reason Americans are so unhealthy. Moreover, it’s not about healthcare as a “right,” as RFK Jr. made very clear in his response to Sen. Sanders. It’s very much an Orwellian \u003ca href=\"https://en.wikipedia.org/wiki/Animal_Farm\" title=\"\"\u003eAnimal Farm\u003c/a\u003e construct, in which, “All animals are equal, but some animals are more equal than others.” Alternatively, you could view this as all humans being equal, but some are less equal than others, those less equal ones being the ones whose lifestyle choices contributed to their chronic disease(s) and who are therefore deemed less “worthy” of healthcare; that is, unless they are sufficiently affluent to pay for healthcare themselves, given RFK Jr.’s reference to smokers with cancer “taking from the pool.” Basically, health equals virtue, and lack of health equals a lack of virtue, never mind genetics. However, in this worldview, wealth also equals virtue.\u003c/p\u003e\n\n\n\n\u003cp\u003eBasically, MAHA flows from a viewpoint that equates health with virtue, leading to hostility to the very concept of public health, as evidenced by RFK Jr.’s frequent claim that he “won’t take vaccines away” from those who want them and his shoulder shrug that says, in essence, go ahead and get vaccinated (and vaccinate your children) if you want to. Moreover, other than addressing (sort of) food and diet, I see little in the MAHA agenda that would actually \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC10830426/\" title=\"\"\u003eaddress the four main drivers\u003c/a\u003e of the most common preventable chronic diseases (diabetes, heart disease, and respiratory diseases), specifically physical inactivity, poor nutrition, tobacco use, and excessive alcohol consumption. (Seriously, other than food and dubious science about food dictating what to do as far as our food supply goes, can anyone tell me how MAHA addresses tobacco use, physical inactivity, and alcohol use?) The whole MAHA agenda is a clever bait-and-switch that denies government responsibility or any collective action and, other than food, dumps responsibility for health entirely on the individual.\u003c/p\u003e\n\n\n\n\u003cp\u003eIndeed, \u003ca href=\"https://www.salon.com/2025/01/30/ai-nurses-as-good-as-any-doctor-rfk-jr-confirms-he-wants-to-take-away-peoples-health-care/\" title=\"\"\u003eAmanda Marcotte summed it up well\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e…Kennedy stuck to his shtick of reframing health as a matter of private virtue rather than public concern. Over the course of the hearing, it became clear why this lifelong Democrat has switched to the GOP. His view that sick people did it to themselves and deserve what’s coming to them offers a nifty justification for \u003ca href=\"https://www.salon.com/topic/republicans\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRepublicans\u003c/a\u003e‘ long-standing desire to deny \u003ca href=\"https://www.salon.com/topic/health_care\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehealth care\u003c/a\u003e to millions of Americans. Kennedy may dress this up as “prevention” or concern for children, but the message came through loud and clear: Medical patients are parasites who suck up resources from better, more responsible people. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eComing back to the example of smoking and cancer:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eInstead, Kennedy blamed “chronic disease,” a vague category that encompasses a cornucopia of ailments like “autoimmune diseases, neurodevelopmental disorders, asthma, Alzheimer’s, ADHD, depression, addiction” and, with special emphasis, diabetes. I’ll leave it to the experts and fact-checkers to explain how badly he misrepresented the diverse causes of these conditions. What matters here is the rhetorical purpose “chronic disease” plays: Blaming the victims, and creating the pretext for taking their health care away. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eAnd:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eWhen asked how he would implement “prevention” for Medicare and Medicaid patients, Kennedy replied that it was about “making them accountable for their own health care, so they understand the relationship between eating and getting sick.” He argued that people on food assistance should have their options reduced so they can’t buy processed foods. That’s designed to sound vaguely positive while doing nothing to help people. No living person believes that Oreos are better for you than apples. Lecturing them about it and restricting their food budget will do nothing to reduce their medical costs, but it does creates an excuse to deny health care by claiming that they made themselves sick.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eMarcotte is correct, but I would quibble mildly. I would rephrase her assessment to say that what RFK Jr. wants to do also includes promoting access to healthcare that is not science-based but is rather the sort of quackery that alternative medicine practitioners believe in. After all, remember that part of the MAHA agenda is to Make Quackery Great Again, with RFK Jr. \u003ca href=\"https://sciencebasedmedicine.org/rfk-jr-declares-maha-war-against-the-fda/\" title=\"\"\u003edeclaring war on the FDA\u003c/a\u003e:\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"589\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA-1024x589.png\" alt=\"RFK Jr. War on FDA\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA-1024x589.png 1024w, https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA-480x276.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA-200x115.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA-768x442.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA-650x374.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2024/10/RFKJrwaronFDA.png 1184w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eAs an aside, speaking of hyperbaric oxygen therapy (HBOT), in my neck of the woods, a five-year-old boy was \u003ca href=\"https://www.respectfulinsolence.com/2025/02/02/hyperbaric-oxygen-treatment-can-kill/\" title=\"\"\u003erecently killed at a quack clinic\u003c/a\u003e when an HBOT chamber he was in exploded. No information was provided about what it was that he was being “treated” for, but I bet that it wasn’t any of the handful of indications for which there is good evidence that HBOT is effective. Look for a lot more tragedies like this dead five-year-old, and not just from HBOT quackery, if RFK Jr. is confirmed.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs for the rest, as I said before, the FDA doesn’t “suppress” exercise, “clean foods,” sunshine, or nutraceuticals. It does regulate the rest because there is no good evidence base for any of them, especially hydroxychloroquine and ivermectin, neither of which treat or prevent COVID-19. Raw milk, in particular, is a particularly nasty public health threat given that it can carry all manner of diseases, including H5N1 bird flu. There’s a reason Pasteurization was invented. Moreover, stem cell clinics have become quite the profit center at quack clinics that use stem cells (and charge large amounts of money for them) to treat all manner of diseases for which there is yet no good evidence for their efficacy. (Remember \u003ca href=\"https://sciencebasedmedicine.org/tag/gordie-howe/\" title=\"\"\u003eGordie Howe and his stroke\u003c/a\u003e?)\u003c/p\u003e\n\n\n\n\u003ch2\u003eIt’s a MAHA world now, unfortunately\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs I was writing this post, I realized that it’s a bit too simplistic to describe MAHA as just another manifestation of The Secret as the central dogma of alternative medicine, but that doing so does touch on a simple truth. MAHA is a “manifestation” of alternative medicine and health applied to government policy, and there will be disastrous results if RFK Jr. is confirmed. It’s not for nothing that I referred to RFK Jr. at HHS as \u003ca href=\"https://sciencebasedmedicine.org/rfk-jr-is-now-an-extinction-level-threat-to-federal-public-health-programs-and-science-based-health-policy/\" title=\"\"\u003ean “extinction-level” threat to public health\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eSpecifically, MAHA embodies the idea of health being due, above all, to personal will, virtue, and efforts, rather than public health efforts, but it also embodies the idea that science-based medicine and nutrition are not just ineffective but actively harmful. In that way, it is also manifestation of what I like to call the cult of purity that is behind so much of alternative medicine and so many antivaccine beliefs, namely that anything “unnatural” will contaminate you and lead to a degradation in your health, especially vaccines and pharmaceuticals. Although MAHA pays lip service to lack of physical activity and exercise as one major driver of chronic disease, while proposing basically nothing to reverse that tendency in the population to physical inactivity, it mixes science-based ideas with quackery when it comes to food and diet as drivers of chronic disease. In parallel, MAHA says little or nothing about alcohol or tobacco, two other major drivers of chronic disease, other than RFK Jr. implying that someone who gets cancer as a result of smoking “draws from the pool” and doesn’t deserve taxpayer-funded healthcare.\u003c/p\u003e\n\n\n\n\u003cp\u003eMAHA is a con designed to distract from what will undoubtedly be RFK Jr.’s war on vaccines and science-based regulation of food and drugs. What makes it so appealing is what makes The Secret and the central dogma of alternative medicine so appealing, the idea that you, and you alone, control your destiny when it comes to health. Would that were the case, but no one can escape their genetics, and many can’t escape their environment, both of which, science-based medicine tells us, have enormous effects on overall health. I don’t know if RFK Jr. will be confirmed or not—sadly, I suspect that he probably will—but I do know that if he is, public health and science-based regulation as we currently understand the concepts will be under a threat unlike any faced before. I also know that, even if RFK Jr. fails to win confirmation as HHS Secretary, President Trump will likely nominate someone almost as bad, but just not as obviously a conspiracy-mongering antivax crank.\u003c/p\u003e\n                \n                    \n\n                    \n                    \n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "39 min read",
  "publishedTime": "2025-02-03T03:00:00-05:00",
  "modifiedTime": "2025-02-03T15:34:20Z"
}
