{
  "id": "16b1b947-ba9f-47ce-a288-2a30c40462fd",
  "title": "Rethinking Medications: Truth, Power, and the Drugs You Take",
  "link": "https://sciencebasedmedicine.org/rethinking-medications-truth-power-and-the-drugs-you-take/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=rethinking-medications-truth-power-and-the-drugs-you-take",
  "description": "A critical appraisal of the state of the prescription medications in the United States The post Rethinking Medications: Truth, Power, and the Drugs You Take first appeared on Science-Based Medicine.",
  "author": "David Weinberg",
  "published": "Wed, 28 May 2025 07:30:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Book \u0026 movie reviews",
    "Medications",
    "drug regulation",
    "Prescription drugs"
  ],
  "byline": "David Weinberg",
  "length": 12115,
  "excerpt": "A critical appraisal of the state of the prescription medications in the United States",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Rethinking Medications: Truth, Power, and the Drugs You Take by Jerry Avorn presents a critical appraisal of the state of the prescription medications in the United States. It explores the complex relationships among drug companies, regulators, prescribers, academics, and patients. The book is part history of US drug regulation, part critique of the status quo, and finally, a roadmap for a better path forward. There is a thread of a memoir through the book, tracing the author’s history as an academic physician with a passion for understanding processes and outcomes related to use of Medications. The autobiographical components reinforce the credentials and credibility of the author. About the author Jerry Avorn is a professor of Medicine at Harvard Medical School. Early in his career, Avorn cultivated an unconventional research obsession. He describes the origins thusly: …following my internship and residency in Harvard’s teaching hospitals, I began to assemble a team of physicians, epidemiologists, policy experts, statisticians, lawyers, and ethicists. Our research would focus on everything that needs to go right, but sometimes goes wrong after a new molecule is discovered, before it finds its way into routine use in patients: how its clinical trials are designed, how it’s evaluated by the Food and Drug Administration (FDA) for approval, how we track its side effects before and after it enters the market, how the finished product is paid for, how we develop and transmit information about its benefits and risks to each other and to our patients… His research team grew in size and stature, eventually earning recognition as a clinical division in the Department of Medicine at the Brigham and Women’s Hospital. He named it the Division of Pharmacoepidemiology and Pharmacoeconomics (DoPE).  Members of DoPE are prohibited from receiving any personal renumeration from the pharmaceutical industry. Despite less than universal embrace by colleagues and leaders in the Harvard family, Dr. Avorn and his DoPE colleagues have been incredibly productive, innovative, and influential leaders in their fields. Dr. Avorn is one of the most highly cited investigators in the US. Morbidity and Mortality Morbidity and mortality (M\u0026M) conferences are a staple of academic medicine. These meetings focus on unexpected, bad outcomes in medical practice. Providers and their peers critically analyze the circumstances and decisions which led to the unfortunate results. The aim is to better understand events, so as to avoid similar outcomes in the future.  Avorn likens the structure of his book to a series of M\u0026M rounds. He recounts case-studies of bad outcomes in approval, safety, pricing, and communications of medications in the USA. He puts these events into historical context, describes the circumstances surrounding the unfortunate cases, and makes suggestions for avoiding these results in the future.  This case-based approach combined with the author’s expertise and clear prose makes for a an engaging, quite readable book. The book is divided into six “parts”, with each part comprising up to several chapters. Part One: Does It Work? The Food and Drug Administration (FDA) has a difficult job. They have been criticized in the past for being too cautious in approving important medications. On the other hand, they are criticized if they approve a medication that is later shown to be unsafe or ineffective. The pendulum of caution vs. access to new medication swings both ways. There are good arguments for being more permissive for diseases with unmet medical needs, but some standards still need to be upheld. Avorn points out erosion of standards, conflicts of interest, and other biases contributing to dubious FDA decisions. The most egregious example was a drug for Alzheimer’s disease. Aduhelm was approved by the FDA despite a failed clinical trial and a unanimous “no” vote from an expert advisory panel. Eventually the drug was pulled from the market because payors refused to pay for an expensive, ineffective drug.  Several other regrettable FDA decisions are discussed.   Part Two: Is It Safe? This section focuses on drug safety and highlights examples of times when safety signals were missed, downplayed, and suppressed. The most famous example is Vioxx.  Merck’s blockbuster product Vioxx, an anti-inflammatory drug that was the best-selling medicine in the world before it turned into one of the biggest drug safety problems ever, taught us a lot about how to rethink the risks of medications, why we sometimes get that wrong, and what we can do to manage things better. It became a veritable textbook of lessons on what can go awry in assessing side effects and brought about major changes in the way we approach prescription drug risks and policies to this day. Vioxx was a huge commercial success with sales peaking at over $2 billion/year.  Data from multiple sources, including Dr. Avorn’s pharmacoepidemiology unit, demonstrated that Vioxx users experience an increased risk of heart attack. Vioxx was eventually removed from the market and Merck paid billions of dollars in lawsuits. It turned out that there were safety signals as early as the first large clinical trials. Merck obfuscated, distracted, and denied these findings until the data were irrefutable. Part Three: What Should It Cost? Patients and payors in the USA pay much more for drugs than in any other country. Current laws prohibit the government from negotiating drug prices. Middlemen in the supply chain impose and manipulate additional charges in service to their own profits.  A less-known factor is drug companies’ skill in manipulating the patent system by extending exclusivity (and premium prices) long past usual patent protection.  American tax payers support the development of numerous drugs through the National Institutes of Health research. Still, taxpayers continue to pay premium prices and are not financially rewarded as early investors when a drug becomes a blockbuster.  Part Four: Spreading the Word Here, Avorn analyzes how physicians and patients are informed about medications. Pharmaceutical companies control the message regarding their drugs in many ways. They have discretion over what articles are published about their products as well as the content of those articles. They have enormous budgets for advertising to physicians and directly to patients. Numerous physician “opinion leaders” in medicine are on pharma payrolls in a variety of capacities. A team of polished “detail” men and women visit physicians and promote medications in the most positive light. In response, Dr. Avorn founded the practice of Academic Drug Detailing, a system for providing working physicians with spin-free, evidence-based drug assessments. Part Five: Mind-Altering Examples The first chapter of this section discusses the challenges in investigating hallucinogens and other “mind altering” drugs as promising therapeutic agents. The second chapter is an insightful post-mortem of the opioid crisis. Part Six: Empowering the Patient This section is a critique of US healthcare. A system in which lifesaving drugs are inaccessible or unaffordable to many. Avorn recaps his own activism.  In the year 2000 he and a group of similarly-motivated allies tried to pass a ballot measure to ensure access to healthcare in Massachusetts. Pitted against an opposition heavily funded by the commercial healthcare industry, the initiative failed. Their efforts may have been a catalyst to “Romneycare,” the first US system of universal healthcare access under Massachusetts governor Mitt Romney. An important book Dr. Avorn is uniquely qualified to write this book. He writes with the authority of seasoned scholar and the clarity of a skilled communicator. High profile examples are documented to illustrate his insights. The content is extraordinarily up to date. There are discussions of implications the 2024 election, in general, and the appointment of Robert F. Kennedy Jr. as Secretary of Health and Human Services, in particular.  “Big Pharma” is a popular target for invective these days. Avorn has plenty to criticize about the industry, but this book is not a “gotcha” attack on an unpopular target. It is a thoughtful dissection of a complex system; with careful consideration of each of the component parts: drug companies, law makers, regulators, insurance companies, and physicians. He calls members of those institutions by name. Members of his own Harvard family are not spared. This is an important book for our time. Dr. Avorn builds his case skillfully and litigates his recommendations for reform persuasively. It is appropriate reading for medical professionals, policy makers, pharmaceutical professionals, and healthcare consumers. Highly recommended! Rethinking Medications: Truth, Power, and the Drugs You Take, Jerry Avorn, MDApril 22nd, 2025Simon \u0026 SchusterISBN: 9781668052846Pages: 512 This is Dr. Avorn’s second book aimed at helping consumers understand prescription medications. The first: Powerful Medicines: The Benefits, Risks, and Costs of Prescription Drugs was published in 2005. David Weinberg is a full-time academic vitreoretinal surgeon, and professor of ophthalmology at the Medical College of Wisconsin, Milwaukee. His interest in the less-than-science-based aspects of medicine was sparked by inquiries from his patients. Investigation their questions led to his discovery of numerous grandiose claims for implausible, unproven treatments of potentially blinding eye diseases. All opinions expressed by Dr. Weinberg are his alone, and do not represent those of his employer or any other organization with which he is affiliated. View all posts",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2025/05/Rethinking-Medications-book-image-1-e1748367266684.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003cp\u003e\u003cem\u003eRethinking Medications: Truth, Power, and the Drugs You Take\u003c/em\u003e by Jerry Avorn presents a critical appraisal of the state of the prescription medications in the United States. It explores the complex relationships among drug companies, regulators, prescribers, academics, and patients. The book is part history of US drug regulation, part critique of the \u003cem\u003estatus quo\u003c/em\u003e, and finally, a roadmap for a better path forward. There is a thread of a memoir through the book, tracing the author’s history as an academic physician with a passion for understanding processes and outcomes related to use of Medications. The autobiographical components reinforce the credentials and credibility of the author.\u003c/p\u003e\n\n\n\n\u003ch2\u003eAbout the author\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://connects.catalyst.harvard.edu/Profiles/display/Person/56961\" title=\"\"\u003eJerry Avorn\u003c/a\u003e is a professor of Medicine at Harvard Medical School. Early in his career, Avorn cultivated an unconventional research obsession. He describes the origins thusly:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e…following my internship and residency in Harvard’s teaching hospitals, I began to assemble a team of physicians, epidemiologists, policy experts, statisticians, lawyers, and ethicists. Our research would focus on everything that needs to go right, but sometimes goes wrong after a new molecule is discovered, before it finds its way into routine use in patients: how its clinical trials are designed, how it’s evaluated by the Food and Drug Administration (FDA) for approval, how we track its side effects before and after it enters the market, how the finished product is paid for, how we develop and transmit information about its benefits and risks to each other and to our patients…\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eHis research team grew in size and stature, eventually earning recognition as a clinical division in the Department of Medicine at the Brigham and Women’s Hospital. He named it the \u003ca href=\"https://drugepi.org\" title=\"\"\u003eDivision of Pharmacoepidemiology and Pharmacoeconomics\u003c/a\u003e (DoPE).  Members of DoPE are prohibited from receiving any personal renumeration from the pharmaceutical industry. Despite less than universal embrace by colleagues and leaders in the Harvard family, Dr. Avorn and his DoPE colleagues have been incredibly productive, innovative, and influential leaders in their fields. Dr. Avorn is one of the most highly cited investigators in the US.\u003c/p\u003e\n\n\n\n\u003ch2\u003eMorbidity and Mortality\u003c/h2\u003e\n\n\n\n\u003cp\u003eMorbidity and mortality (M\u0026amp;M) conferences are a staple of academic medicine. These meetings focus on unexpected, bad outcomes in medical practice. Providers and their peers critically analyze the circumstances and decisions which led to the unfortunate results. The aim is to better understand events, so as to avoid similar outcomes in the future.  Avorn likens the structure of his book to a series of M\u0026amp;M rounds. He recounts case-studies of bad outcomes in approval, safety, pricing, and communications of medications in the USA. He puts these events into historical context, describes the circumstances surrounding the unfortunate cases, and makes suggestions for avoiding these results in the future.  This case-based approach combined with the author’s expertise and clear prose makes for a an engaging, quite readable book.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe book is divided into six “parts”, with each part comprising up to several chapters.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003ePart One: Does It Work?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe Food and Drug Administration (FDA) has a difficult job. They have been criticized in the past for being too cautious in approving important medications. On the other hand, they are criticized if they approve a medication that is later shown to be unsafe or ineffective. The pendulum of caution vs. access to new medication swings both ways. There are good arguments for being more permissive for diseases with unmet medical needs, but some standards still need to be upheld.\u003c/p\u003e\n\n\n\n\u003cp\u003eAvorn points out erosion of standards, conflicts of interest, and other biases contributing to dubious FDA decisions. The most egregious example was a drug for Alzheimer’s disease. Aduhelm was approved by the FDA despite a failed clinical trial and a unanimous “no” vote from an expert advisory panel. Eventually the drug was pulled from the market because payors refused to pay for an expensive, ineffective drug.  Several other regrettable FDA decisions are discussed.  \u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003ePart Two: Is It Safe?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThis section focuses on drug safety and highlights examples of times when safety signals were missed, downplayed, and suppressed. The most famous example is Vioxx. \u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eMerck’s blockbuster product Vioxx, an anti-inflammatory drug that was the best-selling medicine in the world before it turned into one of the biggest drug safety problems ever, taught us a lot about how to rethink the risks of medications, why we sometimes get that wrong, and what we can do to manage things better. It became a veritable textbook of lessons on what can go awry in assessing side effects and brought about major changes in the way we approach prescription drug risks and policies to this day.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eVioxx was a huge commercial success with sales peaking at over $2 billion/year. \u003c/p\u003e\n\n\n\n\u003cp\u003eData from multiple sources, including Dr. Avorn’s pharmacoepidemiology unit, demonstrated that Vioxx users experience an increased risk of heart attack. Vioxx was eventually removed from the market and Merck paid billions of dollars in lawsuits. It turned out that there were safety signals as early as the first large clinical trials. Merck obfuscated, distracted, and denied these findings until the data were irrefutable.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003ePart Three: What Should It Cost?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003ePatients and payors in the USA pay much more for drugs than in any other country. Current laws prohibit the government from negotiating drug prices. Middlemen in the supply chain impose and manipulate additional charges in service to their own profits.  A less-known factor is drug companies’ skill in manipulating the patent system by extending exclusivity (and premium prices) long past usual patent protection. \u003c/p\u003e\n\n\n\n\u003cp\u003eAmerican tax payers support the development of numerous drugs through the National Institutes of Health research. Still, taxpayers continue to pay premium prices and are not financially rewarded as early investors when a drug becomes a blockbuster. \u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003ePart Four: Spreading the Word\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eHere, Avorn analyzes how physicians and patients are informed about medications. Pharmaceutical companies control the message regarding their drugs in many ways. They have discretion over what articles are published about their products as well as the content of those articles. They have enormous budgets for advertising to physicians and directly to patients. Numerous physician “opinion leaders” in medicine are on pharma payrolls in a variety of capacities. A team of polished “detail” men and women visit physicians and promote medications in the most positive light. In response, Dr. Avorn founded the practice of \u003ca href=\"https://alosahealth.org/academic-detailing/academic-detailing-programs/\" title=\"\"\u003eAcademic Drug Detailing\u003c/a\u003e, a system for providing working physicians with spin-free, evidence-based drug assessments.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003ePart Five: Mind-Altering Examples\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe first chapter of this section discusses the challenges in investigating hallucinogens and other “mind altering” drugs as promising therapeutic agents. The second chapter is an insightful post-mortem of the opioid crisis.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003ePart Six: Empowering the Patient\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThis section is a critique of US healthcare. A system in which lifesaving drugs are inaccessible or unaffordable to many. Avorn recaps his own activism.  In the year 2000 he and a group of similarly-motivated allies tried to pass a ballot measure to ensure access to healthcare in Massachusetts. Pitted against an opposition heavily funded by the commercial healthcare industry, the initiative failed.  Their efforts may have been a catalyst to “Romneycare,” the first US system of universal healthcare access under Massachusetts governor Mitt Romney.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eAn important book\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eDr. Avorn is uniquely qualified to write this book. He writes with the authority of seasoned scholar and the clarity of a skilled communicator. High profile examples are documented to illustrate his insights. The content is extraordinarily up to date. There are discussions of implications the 2024 election, in general, and the appointment of Robert F. Kennedy Jr. as Secretary of Health and Human Services, in particular. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Big Pharma” is a popular target for invective these days. Avorn has plenty to criticize about the industry, but this book is not a “gotcha” attack on an unpopular target. It is a thoughtful dissection of a complex system; with careful consideration of each of the component parts: drug companies, law makers, regulators, insurance companies, and physicians. He calls members of those institutions by name. Members of his own Harvard family are not spared.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is an important book for our time. Dr. Avorn builds his case skillfully and litigates his recommendations for reform persuasively.  It is appropriate reading for medical professionals, policy makers, pharmaceutical professionals, and healthcare consumers. Highly recommended!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.amazon.com/Rethinking-Medications-Truth-Power-Drugs/dp/1668052849\" target=\"_blank\" rel=\"noopener nofollow\" title=\"Rethinking Medications: Truth, Power, and the Drugs You Take\"\u003eRethinking Medications: Truth, Power, and the Drugs You Take\u003c/a\u003e\u003c/em\u003e, Jerry Avorn, MD\u003cbr/\u003eApril 22nd, 2025\u003cbr/\u003eSimon \u0026amp; Schuster\u003cbr/\u003eISBN: 9781668052846\u003cbr/\u003ePages: 512\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is Dr. Avorn’s second book aimed at helping consumers understand prescription medications. The first: \u003cem\u003e\u003ca href=\"https://www.amazon.com/Powerful-Medicines-Benefits-Risks-Prescription/dp/1400030781\" title=\"\"\u003ePowerful Medicines: The Benefits, Risks, and Costs of Prescription Drugs\u003c/a\u003e\u003c/em\u003e was published in 2005.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                                                                                                    David Weinberg is a full-time academic vitreoretinal surgeon, and professor of ophthalmology at the Medical College of Wisconsin, Milwaukee. \nHis interest in the less-than-science-based aspects of medicine was sparked by inquiries from his patients. Investigation their questions led to his discovery of numerous grandiose claims for implausible, unproven treatments of potentially blinding eye diseases.\n\nAll opinions expressed by Dr. Weinberg are his alone, and do not represent those of his employer or any other organization with which he is affiliated.                                                                                                                                                \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/david-weinberg/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#a7c3d0c2cec9c5c2d5e7cac4d089c2c3d2\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                            \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-05-28T03:30:00-04:00",
  "modifiedTime": "2025-05-27T22:39:31Z"
}
