{
  "id": "25f3a925-28fc-4638-9028-0655d909eb1d",
  "title": "Hey Siri, fix my spacecraft! A virtual assistant could help astronauts handle unexpected space mission issues",
  "link": "https://phys.org/news/2025-06-hey-siri-spacecraft-virtual-astronauts.html",
  "description": "When astronauts make the long journey to Mars in the not-so-distant future, communication with mission control will be impossible for days to weeks at a time. Enter Daphne-AT: a virtual assistant (VA) designed to help astronauts safely and efficiently solve problems that arise on their spacecraft.",
  "author": "",
  "published": "Fri, 27 Jun 2025 14:40:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Space Exploration"
  ],
  "byline": "Alyssa Schaechinger",
  "length": 4863,
  "excerpt": "When astronauts make the long journey to Mars in the not-so-distant future, communication with mission control will be impossible for days to weeks at a time. Enter Daphne-AT: a virtual assistant (VA) designed to help astronauts safely and efficiently solve problems that arise on their spacecraft.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: Rachel Barton/Texas A\u0026M Engineering When astronauts make the long journey to Mars in the not-so-distant future, communication with mission control will be impossible for days to weeks at a time. Enter Daphne-AT: a virtual assistant (VA) designed to help astronauts safely and efficiently solve problems that arise on their spacecraft. While Daphne-AT might not be ready to help our astronauts on the way to Mars just yet, researchers from Texas A\u0026M University—led by Dr. Daniel Selva—have published a paper in The Journal of Aerospace Information Systems outlining Daphne's ability to help solve spacecraft anomalies. \"Daphne-AT uses a mix of logic and data-driven decision-making to help astronauts make informed decisions when a problem arises on a spacecraft,\" said Selva, an associate professor of aerospace engineering. \"The VA uses spacecraft data in real time to detect anomalies, hypothesize what is causing the issue, and give astronauts information on how to solve the problem.\" The VA processes a real-time data stream of a spacecraft's environmental controls and life support systems, like oxygen, carbon dioxide, and trace contaminant concentrations, and tracks whether these data values are within normal range. If the values fall out of normal range—say the oxygen concentration drops—Daphne-AT will alert the astronauts and provide them with information to solve the problem. Daphne-AT uses a variety of data sources to diagnose problems when they occur and provides astronauts with operational procedures to solve problems quickly and calmly. To test the effectiveness of Daphne-AT, researchers first used a virtual reality simulation to emulate the Human Exploration Research Analog (HERA) facility at NASA's Johnson Space Center. All participants in the study were graduate students at Texas A\u0026M University with varying levels of aerospace engineering knowledge and flight experience. Researchers tested the amount of time it took participants to resolve five anomalies with Daphne-AT, and five anomalies without the help of Daphne-AT. Researchers also tested participants' mental workload and situational awareness during the simulations. Results showed that participants resolved more anomalies in less time when using the VA, and that overall mental workload was decreased. Situational awareness did not change significantly with the use of the VA. Additional testing was performed at the HERA facility. Participants included NASA engineers, pilots and other professionals. Eight crews of four participants stayed in HERA for 45 days each, conducting various scientific studies. The results of this experiment differed from the laboratory results, showing that using Daphne-AT did not significantly affect the participants' timing in resolving anomalies. \"Part of the difference is likely due to the differences in training and experience levels of participants,\" said Selva. \"There are only so many anomalies we can present to participants, and the trained professionals had more time with the VA and more opportunities to resolve different anomalies.\" In addition to helping astronauts, Daphne-AT and similar VAs have the potential to benefit workers in other fields, such as firefighters and emergency responders, by providing information to help make decisions and solve unexpected problems. A future with Daphne-AT helping astronauts and others may not be so far away. Co-authors include Dr. Bonnie J. Dunbar, aerospace engineering professor and NASA astronaut, Dr. Ana Diaz-Artiles, aerospace engineering associate professor, and Dr. Raymond Wong, an associate professor of statistics. More information: Poonampreet Kaur Josan et al, Virtual Assistant for Spacecraft Anomaly Resolution: Effects on Human Performance Metrics, Journal of Aerospace Information Systems (2025). DOI: 10.2514/1.I011449 Citation: Hey Siri, fix my spacecraft! A virtual assistant could help astronauts handle unexpected space mission issues (2025, June 27) retrieved 27 June 2025 from https://phys.org/news/2025-06-hey-siri-spacecraft-virtual-astronauts.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/-hey-siri-fix-my-space.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/-hey-siri-fix-my-space.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/-hey-siri-fix-my-space.jpg\" data-sub-html=\"Credit: Rachel Barton/Texas A\u0026amp;amp;M Engineering\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/-hey-siri-fix-my-space.jpg\" alt=\"Hey Siri, Fix My Spacecraft!\" title=\"Credit: Rachel Barton/Texas A\u0026amp;amp;M Engineering\" width=\"800\" height=\"450\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: Rachel Barton/Texas A\u0026amp;M Engineering\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eWhen astronauts make the long journey to Mars in the not-so-distant future, communication with mission control will be impossible for days to weeks at a time. Enter Daphne-AT: a virtual assistant (VA) designed to help astronauts safely and efficiently solve problems that arise on their spacecraft.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eWhile Daphne-AT might not be ready to help our astronauts on the way to Mars just yet, researchers from Texas A\u0026amp;M University—led by Dr. Daniel Selva—have published a \u003ca href=\"https://arc.aiaa.org/doi/epdf/10.2514/1.I011449\" target=\"_blank\"\u003epaper\u003c/a\u003e in \u003ci\u003eThe Journal of Aerospace Information Systems\u003c/i\u003e outlining Daphne\u0026#39;s ability to help solve spacecraft anomalies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Daphne-AT uses a mix of logic and data-driven decision-making to help astronauts make informed decisions when a problem arises on a spacecraft,\u0026#34; said Selva, an associate professor of aerospace engineering. \u0026#34;The VA uses spacecraft data in real time to detect anomalies, hypothesize what is causing the issue, and give astronauts information on how to solve the problem.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe VA processes a real-time data stream of a spacecraft\u0026#39;s environmental controls and \u003ca href=\"https://phys.org/tags/life+support+systems/\" rel=\"tag\"\u003elife support systems\u003c/a\u003e, like oxygen, \u003ca href=\"https://phys.org/tags/carbon+dioxide/\" rel=\"tag\"\u003ecarbon dioxide\u003c/a\u003e, and trace contaminant concentrations, and tracks whether these data values are within normal range. If the values fall out of normal range—say the \u003ca href=\"https://phys.org/tags/oxygen+concentration/\" rel=\"tag\"\u003eoxygen concentration\u003c/a\u003e drops—Daphne-AT will alert the astronauts and provide them with information to solve the problem.\u003c/p\u003e\n\u003cp\u003eDaphne-AT uses a variety of data sources to diagnose problems when they occur and provides astronauts with operational procedures to solve problems quickly and calmly.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTo test the effectiveness of Daphne-AT, researchers first used a virtual reality simulation to emulate the Human Exploration Research Analog (HERA) facility at NASA\u0026#39;s Johnson Space Center. All participants in the study were graduate students at Texas A\u0026amp;M University with varying levels of aerospace engineering knowledge and flight experience.\u003c/p\u003e\n\u003cp\u003eResearchers tested the amount of time it took participants to resolve five anomalies with Daphne-AT, and five anomalies without the help of Daphne-AT. Researchers also tested participants\u0026#39; mental workload and \u003ca href=\"https://phys.org/tags/situational+awareness/\" rel=\"tag\"\u003esituational awareness\u003c/a\u003e during the simulations.\u003c/p\u003e\n\u003cp\u003eResults showed that participants resolved more anomalies in less time when using the VA, and that overall mental workload was decreased. Situational awareness did not change significantly with the use of the VA.\u003c/p\u003e\n\u003cp\u003eAdditional testing was performed at the HERA facility. Participants included NASA engineers, pilots and other professionals. Eight crews of four participants stayed in HERA for 45 days each, conducting various scientific studies. The results of this experiment differed from the laboratory results, showing that using Daphne-AT did not significantly affect the participants\u0026#39; timing in resolving anomalies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Part of the difference is likely due to the differences in training and experience levels of participants,\u0026#34; said Selva. \u0026#34;There are only so many anomalies we can present to participants, and the trained professionals had more time with the VA and more opportunities to resolve different anomalies.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn addition to helping astronauts, Daphne-AT and similar VAs have the potential to benefit workers in other fields, such as firefighters and emergency responders, by providing information to help make decisions and solve unexpected problems.\u003c/p\u003e\n\u003cp\u003eA future with Daphne-AT helping \u003ca href=\"https://phys.org/tags/astronauts/\" rel=\"tag\"\u003eastronauts\u003c/a\u003e and others may not be so far away.\u003c/p\u003e\n\u003cp\u003eCo-authors include Dr. Bonnie J. Dunbar, aerospace engineering professor and NASA astronaut, Dr. Ana Diaz-Artiles, aerospace engineering associate professor, and Dr. Raymond Wong, an associate professor of statistics.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tPoonampreet Kaur Josan et al, Virtual Assistant for Spacecraft Anomaly Resolution: Effects on Human Performance Metrics, \u003ci\u003eJournal of Aerospace Information Systems\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.2514/1.I011449\" target=\"_blank\"\u003eDOI: 10.2514/1.I011449\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tHey Siri, fix my spacecraft! A virtual assistant could help astronauts handle unexpected space mission issues (2025, June 27)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 27 June 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-06-hey-siri-spacecraft-virtual-astronauts.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-27T14:40:01-04:00",
  "modifiedTime": null
}
