{
  "id": "28ce8664-35c1-44e9-a78f-aef80cd44511",
  "title": "Ancient immune defense system plays an unexpected role in cancer",
  "link": "https://www.sciencedaily.com/releases/2024/11/241105174741.htm",
  "description": "Along with defending against pathogens, the body's innate immune system helps to protect the stability of our genomes in unexpected ways -- ways that have important implications for the development of cancer, researchers are discovering.",
  "author": "",
  "published": "Tue, 05 Nov 2024 17:47:41 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4927,
  "excerpt": "Along with defending against pathogens, the body's innate immune system helps to protect the stability of our genomes in unexpected ways -- ways that have important implications for the development of cancer, researchers are discovering.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Along with defending against pathogens, the body's innate immune system helps to protect the stability of our genomes in unexpected ways -- ways that have important implications for the development of cancer, researchers at Memorial Sloan Kettering Cancer Center (MSK) are discovering. In a pair of recent papers, scientists in the lab of molecular biologist John Petrini, PhD, showed that innate immune signaling plays a key role in maintaining genome stability during DNA replication. Furthermore, the researchers showed that chronic activation of these immune pathways can contribute to tumor development in a mouse model of breast cancer. Not only do the findings add vital insights to our understanding of fundamental human biology, says Dr. Petrini, they may also shed new light on tumor initiation and present potential opportunities for new therapies. \"Living organisms have evolved complex pathways to sense, signal, and repair damaged DNA,\" he says. \"Here we're learning new things about the role of the innate immune system in responding to that damage -- both in the context of cancer and also in human health more generally.\" How Chronic Activation of the Innate Immune System Can Lead to Cancer The newest paper, led by first author Hexiao Wang, PhD, a postdoctoral fellow in the Petrini Lab, and published in Genes \u0026 Development, reveals a connection between innate immune signaling and tumor development in breast tissue. And, Dr. Petrini says, the data suggest that when instability arises in the genome, chronic activation of the innate immune system can greatly increase the chances of developing cancer. The study focused on a protein complex called the Mre11 complex, which plays a pivotal role in maintaining the stability of the genome by sensing and repairing double-strand breaks in DNA. To study how problems with the Mre11 complex can lead to cancer, the team manipulated copies of the protein in mammary tissue organoids (miniature lab-grown model organs) and then implanted them into laboratory animals. When oncogenes (genes known to drive cancer) were activated in these mice, tumors arose about 40% of the time, compared with about 5% in their normal counterparts. And the tumors in the mice with mutant Mre11 organoids were highly aggressive. The research further showed that the mutant Mre11 led to higher activation of interferon-stimulated genes (ISGs). Interferons are signaling molecules that are released by cells in response to viral infections, immune responses, and other cellular stressors. They also found that the normally tightly controlled packaging of DNA was improperly accessible in these organoids -- making it more likely that genes will get expressed, when they otherwise would be inaccessible for transcription. \"We actually saw differences in the expression of more than 5,600 genes between the two different groups of mice,\" Dr. Petrini says. And strikingly, these profound effects depended on an immune sensor called IFI205. When the organoids were further manipulated so they would lack IFI205, the packaging of DNA returned almost to normal, and the mice developed cancer at essentially the same rate as normal mice. \"So what we learned is that problems with Mre11 -- which can be inherited or develop during life like other mutations -- can create an environment where the activation of an oncogene is much more likely to lead to cancer,\" Dr. Petrini says. \"And that the real lynch pin of this cascade is this innate immune sensor, IFI205, which detects that there's a problem and starts sending out alarm signals. In other words, when problems with Mre11 occur, chronic activation of this innate immune signaling can significantly contribute to the development of cancer.\" New Understandings Could Pave the Way for Future Treatments The work builds on a previous study, led by Christopher Wardlaw, PhD, a former senior scientist in the Petrini Lab, that appeared in Nature Communications. That study focused on the role of the Mre11 complex in maintaining genomic integrity. It found that when the Mre11 complex is inactive or deficient, it results in the accumulation of DNA in the cytoplasm of cells and in the activation of innate immune signaling. This research primarily looked at the involvement of ISG15, a protein made by an interferon-stimulating gene, in protecting against replication stress and promoting genomic stability. \"Together, these studies shed new light on how the Mre11 complex works to protect the genome when cells replicate, and how, when it's not working properly, it can trigger the innate immune system in ways that can promote cancer,\" Dr. Petrini says. By shedding light on the interrelationships between these complex systems and processes, the researchers hope to identify new strategies to prevent or treat cancer, he adds, such as finding ways to short-circuit the increased DNA accessibility when Mre11 isn't working properly.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eAlong with defending against pathogens, the body\u0026#39;s innate immune system helps to protect the stability of our genomes in unexpected ways -- ways that have important implications for the development of cancer, researchers at Memorial Sloan Kettering Cancer Center (MSK) are discovering.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eIn a pair of recent papers, scientists in the lab of molecular biologist John Petrini, PhD, showed that innate immune signaling plays a key role in maintaining genome stability during DNA replication. Furthermore, the researchers showed that chronic activation of these immune pathways can contribute to tumor development in a mouse model of breast cancer.\u003c/p\u003e\n\u003cp\u003eNot only do the findings add vital insights to our understanding of fundamental human biology, says Dr. Petrini, they may also shed new light on tumor initiation and present potential opportunities for new therapies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Living organisms have evolved complex pathways to sense, signal, and repair damaged DNA,\u0026#34; he says. \u0026#34;Here we\u0026#39;re learning new things about the role of the innate immune system in responding to that damage -- both in the context of cancer and also in human health more generally.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow Chronic Activation of the Innate Immune System Can Lead to Cancer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe newest paper, led by first author Hexiao Wang, PhD, a postdoctoral fellow in the Petrini Lab, and published in \u003cem\u003eGenes \u0026amp; Development\u003c/em\u003e, reveals a connection between innate immune signaling and tumor development in breast tissue. And, Dr. Petrini says, the data suggest that when instability arises in the genome, chronic activation of the innate immune system can greatly increase the chances of developing cancer.\u003c/p\u003e\n\u003cp\u003eThe study focused on a protein complex called the Mre11 complex, which plays a pivotal role in maintaining the stability of the genome by sensing and repairing double-strand breaks in DNA.\u003c/p\u003e\n\n\n\u003cp\u003eTo study how problems with the Mre11 complex can lead to cancer, the team manipulated copies of the protein in mammary tissue organoids (miniature lab-grown model organs) and then implanted them into laboratory animals.\u003c/p\u003e\n\u003cp\u003eWhen oncogenes (genes known to drive cancer) were activated in these mice, tumors arose about 40% of the time, compared with about 5% in their normal counterparts. And the tumors in the mice with mutant Mre11 organoids were highly aggressive.\u003c/p\u003e\n\u003cp\u003eThe research further showed that the mutant Mre11 led to higher activation of interferon-stimulated genes (ISGs). Interferons are signaling molecules that are released by cells in response to viral infections, immune responses, and other cellular stressors.\u003c/p\u003e\n\u003cp\u003eThey also found that the normally tightly controlled packaging of DNA was improperly accessible in these organoids -- making it more likely that genes will get expressed, when they otherwise would be inaccessible for transcription.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We actually saw differences in the expression of more than 5,600 genes between the two different groups of mice,\u0026#34; Dr. Petrini says.\u003c/p\u003e\n\u003cp\u003eAnd strikingly, these profound effects depended on an immune sensor called IFI205.\u003c/p\u003e\n\n\n\u003cp\u003eWhen the organoids were further manipulated so they would lack IFI205, the packaging of DNA returned almost to normal, and the mice developed cancer at essentially the same rate as normal mice.\u003c/p\u003e\n\u003cp\u003e\u0026#34;So what we learned is that problems with Mre11 -- which can be inherited or develop during life like other mutations -- can create an environment where the activation of an oncogene is much more likely to lead to cancer,\u0026#34; Dr. Petrini says. \u0026#34;And that the real lynch pin of this cascade is this innate immune sensor, IFI205, which detects that there\u0026#39;s a problem and starts sending out alarm signals. In other words, when problems with Mre11 occur, chronic activation of this innate immune signaling can significantly contribute to the development of cancer.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNew Understandings Could Pave the Way for Future Treatments\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe work builds on a previous study, led by Christopher Wardlaw, PhD, a former senior scientist in the Petrini Lab, that appeared in \u003cem\u003eNature Communications\u003c/em\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThat study focused on the role of the Mre11 complex in maintaining genomic integrity. It found that when the Mre11 complex is inactive or deficient, it results in the accumulation of DNA in the cytoplasm of cells and in the activation of innate immune signaling. This research primarily looked at the involvement of ISG15, a protein made by an interferon-stimulating gene, in protecting against replication stress and promoting genomic stability.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Together, these studies shed new light on how the Mre11 complex works to protect the genome when cells replicate, and how, when it\u0026#39;s not working properly, it can trigger the innate immune system in ways that can promote cancer,\u0026#34; Dr. Petrini says.\u003c/p\u003e\n\u003cp\u003eBy shedding light on the interrelationships between these complex systems and processes, the researchers hope to identify new strategies to prevent or treat cancer, he adds, such as finding ways to short-circuit the increased DNA accessibility when Mre11 isn\u0026#39;t working properly.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
