{
  "id": "43633f35-abb0-483b-9b4b-e35160c599a0",
  "title": "Scientists collect 'microbial fingerprints' found in household plumbing",
  "link": "https://www.sciencedaily.com/releases/2024/12/241212163205.htm",
  "description": "Household plumbing is alive with microbes; environmental engineers are working to study those ecosystems to ensure clean water flows in homes.",
  "author": "",
  "published": "Thu, 12 Dec 2024 16:32:05 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 5473,
  "excerpt": "Household plumbing is alive with microbes; environmental engineers are working to study those ecosystems to ensure clean water flows in homes.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "The plumbing systems in households can teem with generally harmless microbial life, but scientists have not had an opportunity to fully document the bacterial communities within people's homes. The Safe Drinking Water Act requires monitoring by public water utilities, but those samples are taken outside property lines of individual households. Once inside a home, microbial communities can change and evolve in ways that are generally not monitored or even understood. Fangqiong Ling, an assistant professor of energy, environmental and chemical engineering in the McKelvey School of Engineering at Washington University in St. Louis, is working to change that, along with her colleagues and students within the school's cluster of water quality researchers. For a paper published Dec. 10 in Nature Water, Ling and colleagues shared results from sampling the bathroom faucets of eight households in the St. Louis metro area. They sampled the homes for seven days to see the flow and change of different bacteria populations. They found that, though houses generally shared major categories of bacteria, down to the species level, there was wide variation from house to house. \"The houses have their own unique signature compared to the rest,\" Ling said. All public tap water is subject to stringent treatment and disinfectants, so the number of microbial cells they detected was very small -- another challenge for monitoring. But the survivors they find are tough. The researchers anticipated seeing antibiotic resistance genes in tap water microbiomes, and they did find that pattern. Using the same common disinfectant means that a recognizable group of microbes can potentially pick up resistance to that disinfectant. The researchers found a pattern of that \"resistome\" across households. But what accounts for the huge variety in species? Computer modeling suggests that microbes initially establish their communities through both deterministic and stochastic processes, meaning random events, which could account for why there is huge variation at the species level, household to household. For household water, these processes could involve the random timing for microbes' arrival at the house, their growth dynamics and a variety of factors that aren't yet understood. The research aims to be able to monitor, anticipate and prevent outbreaks of opportunistic pathogens and bacteria that spread disease. This kind of monitoring is under development for large buildings and institutions such as hospitals, but it's scarce for individual households. \"Houses are still the place where the majority of our interactions with water take place, so we want to study households,\" Ling said. While researchers found illness-causing pathogens or bacteria (in small quantities) in houses, it doesn't necessarily mean that household water is unsafe -- but public health regulators should keep a closer watch, she said. Ling's PhD student Lin Zhang, lead author on the Nature Water paper, has set up a way to crowd-source the sampling by recruiting high school students to serve as \"community scientists.\" Those students collected samples from about 100 households in the St. Louis metro area, data Zhang is analyzing for her final PhD project. While plumbing-associated bacteria are generally harmless, the resistance genes they carry can be transferred to pathogens when individuals are undergoing antibiotic treatments. Because people have frequent contact with these bacteria through activities like showering and using water, there is a strong incentive to better understand the microbiome and \"resistome\" in plumbing systems, as well as how they interact with humans. In the meantime, Zhang is gratified that she gets to do research that can have a local benefit and to work with students. \"I like that we were able to give high school students a glimpse into real-world research and the scientific method,\" she said. \"Hopefully, this might motivate them to pursue a future in environmental engineering.\" Fixing the pipes This fall, the Environmental Protection Agency instituted a rule that all municipalities that provide water will be required to replace lead pipes within the next decade. With the changeover in infrastructure, there also may be opportunities to improve monitoring beyond metals and institute mitigation measures for microplastics and the microbiome. It's all \"on tap\" for Dan Giammar, the Walter E. Browne Professor of Environmental Engineering, who is heading up a number of projects to monitor and improve drinking water sources over the next few years. \"Aspects of drinking water quality that can change between the treatment plant and the customer's tap have been frustratingly difficult to monitor,\" Giammar said. \"This innovative work provides new insights into how microbes grow and what microbes are present in premise plumbing.\" As Ling and Zhang delve into better testing of household plumbing, more questions will likely arise because when it comes to microbial life, nothing is as it seems. \"The more houses we sample, the more diversity we're seeing,\" Ling said. This work was supported by a McKelvey School of Engineering Startup Fund and a Ralph E. Powe Junior Faculty Enhancement Award by the Oak Ridge Associated Universities to F.L. This research was also partially supported by the Division of Chemical, Bioengineering, Environmental and Transport Systems (CBET) of the National Science Foundation under award 2047470 to F.L.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eThe plumbing systems in households can teem with generally harmless microbial life, but scientists have not had an opportunity to fully document the bacterial communities within people\u0026#39;s homes.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe Safe Drinking Water Act requires monitoring by public water utilities, but those samples are taken outside property lines of individual households. Once inside a home, microbial communities can change and evolve in ways that are generally not monitored or even understood.\u003c/p\u003e\n\u003cp\u003eFangqiong Ling, an assistant professor of energy, environmental and chemical engineering in the McKelvey School of Engineering at Washington University in St. Louis, is working to change that, along with her colleagues and students within the school\u0026#39;s cluster of water quality researchers.\u003c/p\u003e\n\u003cp\u003eFor a paper published Dec. 10 in \u003cem\u003eNature Water, \u003c/em\u003eLing and colleagues shared results from sampling the bathroom faucets of eight households in the St. Louis metro area. They sampled the homes for seven days to see the flow and change of different bacteria populations. They found that, though houses generally shared major categories of bacteria, down to the species level, there was wide variation from house to house.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The houses have their own unique signature compared to the rest,\u0026#34; Ling said.\u003c/p\u003e\n\u003cp\u003eAll public tap water is subject to stringent treatment and disinfectants, so the number of microbial cells they detected was very small -- another challenge for monitoring.\u003c/p\u003e\n\u003cp\u003eBut the survivors they find are tough. The researchers anticipated seeing antibiotic resistance genes in tap water microbiomes, and they did find that pattern.\u003c/p\u003e\n\n\n\u003cp\u003eUsing the same common disinfectant means that a recognizable group of microbes can potentially pick up resistance to that disinfectant. The researchers found a pattern of that \u0026#34;resistome\u0026#34; across households. But what accounts for the huge variety in species?\u003c/p\u003e\n\u003cp\u003eComputer modeling suggests that microbes initially establish their communities through both deterministic and stochastic processes, meaning random events, which could account for why there is huge variation at the species level, household to household.\u003c/p\u003e\n\u003cp\u003eFor household water, these processes could involve the random timing for microbes\u0026#39; arrival at the house, their growth dynamics and a variety of factors that aren\u0026#39;t yet understood.\u003c/p\u003e\n\u003cp\u003eThe research aims to be able to monitor, anticipate and prevent outbreaks of opportunistic pathogens and bacteria that spread disease. This kind of monitoring is under development for large buildings and institutions such as hospitals, but it\u0026#39;s scarce for individual households.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Houses are still the place where the majority of our interactions with water take place, so we want to study households,\u0026#34; Ling said.\u003c/p\u003e\n\u003cp\u003eWhile researchers found illness-causing pathogens or bacteria (in small quantities) in houses, it doesn\u0026#39;t necessarily mean that household water is unsafe -- but public health regulators should keep a closer watch, she said.\u003c/p\u003e\n\n\n\u003cp\u003eLing\u0026#39;s PhD student Lin Zhang, lead author on the Nature Water paper, has set up a way to crowd-source the sampling by recruiting high school students to serve as \u0026#34;community scientists.\u0026#34; Those students collected samples from about 100 households in the St. Louis metro area, data Zhang is analyzing for her final PhD project.\u003c/p\u003e\n\u003cp\u003eWhile plumbing-associated bacteria are generally harmless, the resistance genes they carry can be transferred to pathogens when individuals are undergoing antibiotic treatments. Because people have frequent contact with these bacteria through activities like showering and using water, there is a strong incentive to better understand the microbiome and \u0026#34;resistome\u0026#34; in plumbing systems, as well as how they interact with humans.\u003c/p\u003e\n\u003cp\u003eIn the meantime, Zhang is gratified that she gets to do research that can have a local benefit and to work with students.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I like that we were able to give high school students a glimpse into real-world research and the scientific method,\u0026#34; she said. \u0026#34;Hopefully, this might motivate them to pursue a future in environmental engineering.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFixing the pipes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis fall, the Environmental Protection Agency instituted a rule that all municipalities that provide water will be required to replace lead pipes within the next decade. With the changeover in infrastructure, there also may be opportunities to improve monitoring beyond metals and institute mitigation measures for microplastics and the microbiome.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s all \u0026#34;on tap\u0026#34; for Dan Giammar, the Walter E. Browne Professor of Environmental Engineering, who is heading up a number of projects to monitor and improve drinking water sources over the next few years.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Aspects of drinking water quality that can change between the treatment plant and the customer\u0026#39;s tap have been frustratingly difficult to monitor,\u0026#34; Giammar said. \u0026#34;This innovative work provides new insights into how microbes grow and what microbes are present in premise plumbing.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAs Ling and Zhang delve into better testing of household plumbing, more questions will likely arise because when it comes to microbial life, nothing is as it seems.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The more houses we sample, the more diversity we\u0026#39;re seeing,\u0026#34; Ling said. This work was supported by a McKelvey School of Engineering Startup Fund and a Ralph E. Powe Junior Faculty Enhancement Award by the Oak Ridge Associated Universities to F.L. This research was also partially supported by the Division of Chemical, Bioengineering, Environmental and Transport Systems (CBET) of the National Science Foundation under award 2047470 to F.L.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
