{
  "id": "43ff9d58-0857-4cfb-9a84-071d9e7ad9ec",
  "title": "5,700-year storm archive shows rise in tropical storms and hurricanes in the Caribbean",
  "link": "https://www.sciencedaily.com/releases/2025/03/250324152445.htm",
  "description": "A storm, even once it has passed, can leave traces in the ocean that last for thousands of years. These consist of sediment layers composed of coarse particles, which are different from the finer sediments associated with good weather. In the Caribbean, an international research team has now examined such sediments using a 30 m long core from a 'blue hole' offshore Belize. The analysis shows that over the past 5,700 years, the frequency of tropical storms and hurricanes in the region has steadily increased. For the 21st century, the research team predicts a significant rise in regional storm frequency as a result of climate change.",
  "author": "",
  "published": "Mon, 24 Mar 2025 15:24:45 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 5046,
  "excerpt": "A storm, even once it has passed, can leave traces in the ocean that last for thousands of years. These consist of sediment layers composed of coarse particles, which are different from the finer sediments associated with good weather. In the Caribbean, an international research team has now examined such sediments using a 30 m long core from a 'blue hole' offshore Belize. The analysis shows that over the past 5,700 years, the frequency of tropical storms and hurricanes in the region has steadily increased. For the 21st century, the research team predicts a significant rise in regional storm frequency as a result of climate change.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A storm, even once it has passed, can leave traces in the ocean that last for thousands of years. These consist of sediment layers composed of coarse particles, which are different from the finer sediments associated with good weather. In the Caribbean, an international research team led by Goethe University Frankfurt has now examined such sediments using a 30 m long core from a \"blue hole\" offshore Belize. The analysis shows that over the past 5,700 years, the frequency of tropical storms and hurricanes in the region has steadily increased. For the 21st century, the research team predicts a significant rise in regional storm frequency as a result of climate change. In the shallow waters of the Lighthouse Reef Atoll, located 80 kilometers off the coast of the small Central American country of Belize, the seabed suddenly drops steeply. Resembling a dark blue eye surrounded by coral reefs, the \"Great Blue Hole\" is a 125-meter-deep underwater cave with a diameter of 300 meters, which originated thousands of years ago from a karst cave located on a limestone island. During the last ice age, the cave's roof collapsed. As ice sheets melted and global sea level started to rise, the cave was subsequently flooded. In the summer of 2022, a team of scientists -- led by Prof. Eberhard Gischler, head of the Biosedimentology Research Group at Goethe University Frankfurt, and funded by the German Research Foundation (Deutsche Forschungsgemeinschaft, DFG) -- transported a drilling platform over the open sea to the \"Great Blue Hole.\" They then proceeded to extract a 30-meter sediment core from the underwater cave, which has been accumulating sediment for approximately 20,000 years. The core was subsequently analyzed by a research team from the universities of Frankfurt, Cologne, Göttingen, Hamburg, and Bern. Coarse layers are a testimony to tropical storms Some 7,200 years ago, the former limestone island of what is now Lighthouse Reef was inundated by the sea. The layered sediments at the bottom of the \"Great Blue Hole\" serve as archive for extreme weather events of the past 5,700 years, including tropical storms and hurricanes. Dr. Dominik Schmitt, a researcher in the Biosedimentology Research Group and the study's lead author, explains: \"Due to the unique environmental conditions -- including oxygen-free bottom water and several stratified water layers -- fine marine sediments could settle largely undisturbed in the 'Great Blue Hole.' Inside the sediment core, they look a bit like tree rings, with the annual layers alternating in color between gray-green and light green depending on organic content.\" Storm waves and storm surges transported coarse particles from the atoll's eastern reef edge into the \"Great Blue Hole,\" forming distinct sedimentary event layers (tempestites) at the bottom. \"The tempestites stand out from the fair-weather gray-green sediments in terms of grain size, composition, and color, which ranges from beige to white,\" says Schmitt. The research team identified and precisely dated a total of 574 storm events over the past 5,700 years, offering unprecedented insights into climate fluctuations and hurricane cycles in the southwestern Caribbean. Instrumental data and human records available to date had only covered the past 175 years. Rising incidence of storms in the southwestern Caribbean The distribution of storm event layers in the sediment core reveals that the frequency of tropical storms and hurricanes in the southwestern Caribbean has steadily increased over the past six millennia. Schmitt explains: \"A key factor has been the southward shift of the equatorial low-pressure zone. Known as the Intertropical Convergence Zone, this zone influences the location of major storm formation areas in the Atlantic and determines how tropical storms and hurricanes move and where they make landfall in the Caribbean.\" The research team was also able to correlate higher sea-surface temperatures with increased storm activity. Schmitt states: \"These shorter-term fluctuations align with five distinct warm and cold climate periods, which also impacted water temperatures in the tropical Atlantic.\" Climate change results in greater storm activity Over the past six millennia, between four and sixteen tropical storms and hurricanes passed over the \"Great Blue Hole\" per century. However, the nine storm layers from the past 20 years indicate that extreme weather events will be significantly more frequent in this region in the 21st century. Gischler warns: \"Our results suggest that some 45 tropical storms and hurricanes could pass over this region in our century alone. This would far exceed the natural variability of the past millennia.\" Natural climate fluctuations cannot account for this increase, the researchers emphasize, pointing instead to the ongoing warming during the Industrial Age, which results in rising ocean temperatures and stronger global La Niña events, thereby creating optimal conditions for frequent storm formation and their rapid intensification.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA storm, even once it has passed, can leave traces in the ocean that last for thousands of years. These consist of sediment layers composed of coarse particles, which are different from the finer sediments associated with good weather. In the Caribbean, an international research team led by Goethe University Frankfurt has now examined such sediments using a 30 m long core from a \u0026#34;blue hole\u0026#34; offshore Belize. The analysis shows that over the past 5,700 years, the frequency of tropical storms and hurricanes in the region has steadily increased. For the 21st century, the research team predicts a significant rise in regional storm frequency as a result of climate change.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eIn the shallow waters of the Lighthouse Reef Atoll, located 80 kilometers off the coast of the small Central American country of Belize, the seabed suddenly drops steeply. Resembling a dark blue eye surrounded by coral reefs, the \u0026#34;Great Blue Hole\u0026#34; is a 125-meter-deep underwater cave with a diameter of 300 meters, which originated thousands of years ago from a karst cave located on a limestone island. During the last ice age, the cave\u0026#39;s roof collapsed. As ice sheets melted and global sea level started to rise, the cave was subsequently flooded.\u003c/p\u003e\n\u003cp\u003eIn the summer of 2022, a team of scientists -- led by Prof. Eberhard Gischler, head of the Biosedimentology Research Group at Goethe University Frankfurt, and funded by the German Research Foundation (Deutsche Forschungsgemeinschaft, DFG) -- transported a drilling platform over the open sea to the \u0026#34;Great Blue Hole.\u0026#34; They then proceeded to extract a 30-meter sediment core from the underwater cave, which has been accumulating sediment for approximately 20,000 years. The core was subsequently analyzed by a research team from the universities of Frankfurt, Cologne, Göttingen, Hamburg, and Bern.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCoarse layers are a testimony to tropical storms\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSome 7,200 years ago, the former limestone island of what is now Lighthouse Reef was inundated by the sea. The layered sediments at the bottom of the \u0026#34;Great Blue Hole\u0026#34; serve as archive for extreme weather events of the past 5,700 years, including tropical storms and hurricanes. Dr. Dominik Schmitt, a researcher in the Biosedimentology Research Group and the study\u0026#39;s lead author, explains: \u0026#34;Due to the unique environmental conditions -- including oxygen-free bottom water and several stratified water layers -- fine marine sediments could settle largely undisturbed in the \u0026#39;Great Blue Hole.\u0026#39; Inside the sediment core, they look a bit like tree rings, with the annual layers alternating in color between gray-green and light green depending on organic content.\u0026#34; Storm waves and storm surges transported coarse particles from the atoll\u0026#39;s eastern reef edge into the \u0026#34;Great Blue Hole,\u0026#34; forming distinct sedimentary event layers (tempestites) at the bottom. \u0026#34;The tempestites stand out from the fair-weather gray-green sediments in terms of grain size, composition, and color, which ranges from beige to white,\u0026#34; says Schmitt.\u003c/p\u003e\n\u003cp\u003eThe research team identified and precisely dated a total of 574 storm events over the past 5,700 years, offering unprecedented insights into climate fluctuations and hurricane cycles in the southwestern Caribbean. Instrumental data and human records available to date had only covered the past 175 years.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRising incidence of storms in the southwestern Caribbean \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe distribution of storm event layers in the sediment core reveals that the frequency of tropical storms and hurricanes in the southwestern Caribbean has steadily increased over the past six millennia. Schmitt explains: \u0026#34;A key factor has been the southward shift of the equatorial low-pressure zone. Known as the Intertropical Convergence Zone, this zone influences the location of major storm formation areas in the Atlantic and determines how tropical storms and hurricanes move and where they make landfall in the Caribbean.\u0026#34;\u003c/p\u003e\n\n\n\u003cp\u003eThe research team was also able to correlate higher sea-surface temperatures with increased storm activity. Schmitt states: \u0026#34;These shorter-term fluctuations align with five distinct warm and cold climate periods, which also impacted water temperatures in the tropical Atlantic.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eClimate change results in greater storm activity \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOver the past six millennia, between four and sixteen tropical storms and hurricanes passed over the \u0026#34;Great Blue Hole\u0026#34; per century. However, the nine storm layers from the past 20 years indicate that extreme weather events will be significantly more frequent in this region in the 21\u003csup\u003est \u003c/sup\u003ecentury. Gischler warns: \u0026#34;Our results suggest that some 45 tropical storms and hurricanes could pass over this region in our century alone. This would far exceed the natural variability of the past millennia.\u0026#34; Natural climate fluctuations cannot account for this increase, the researchers emphasize, pointing instead to the ongoing warming during the Industrial Age, which results in rising ocean temperatures and stronger global La Niña events, thereby creating optimal conditions for frequent storm formation and their rapid intensification.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
