{
  "id": "4cd1e770-33cb-4abb-a545-15bb7b35e07c",
  "title": "The Ecstasy of an Open Brain",
  "link": "https://www.wnycstudios.org/podcasts/radiolab/projects/podcasts",
  "description": "As we grow up, there are little windows of time when we can learn very, very fast, and very, very deeply. Scientists call these moments, critical periods. Real, neurological, biological states when our brain can soak up information like a sponge. Then, these windows of learning close. Locking us in to certain behaviors and skills for the rest of our lives. But … what if we could reopen them? Today, we consider a series of discoveries that are reshaping our understanding of when and how we can learn. And what that could mean for things like PTSD, brain disease, or strokes. And cuddle puddles. It’s a mind-bending discussion. Literally and figuratively.This is the second episode in an ongoing series hosted by Molly Webster, in conversation with scientists and science-y people, doing work at the furthest edges of what we know. You can find the first episode here. More to come! Special thanks to Gül Dölen, at the University of California, Berkeley, along with researcher Romain Nardou. Plus, Charles Philipp and David Herman.We have some exciting news! In the “Zoozve” episode, Radiolab named its first-ever quasi-moon, and now it's your turn! Radiolab has teamed up with The International Astronomical Union to launch a global naming contest for one of Earth’s quasi-moons. This is your chance to make your mark on the heavens. Vote on your favorites starting in November: https://radiolab.org/moonEPISODE CREDITS: Hosted by - Molly WebsterReported by - Molly WebsterProduced by -Sindhu Gnanasambandan with help from - Timmy Broderick and Molly WebsterOriginal music and sound design contributed by - Dylan Keefewith mixing help from - Jeremy BloomFact-checking by - Emily Kriegerand Edited by  - Soren WheelerEPISODE CITATIONS:Science Articles -Gul’s 2019 paper: Oxytocin-dependent reopening of a social reward learning critical period with MDMA  (https://zpr.io/wfQjeA6PGCBv) on the feel-good brain chemical oxytocin, and how it reopens social reward learning when combined with MDMA.Gul’s 2023 paper: Psychedelics reopen the social reward learning critical period (https://zpr.io/TKDKEwiLwGRN) on the role of psychedelics in social reward learning. Sign-up for our newsletter. It includes short essays, recommendations, and details about other ways to interact with the show. Sign up (https://radiolab.org/newsletter)!Radiolab is supported by listeners like you. Support Radiolab by becoming a member of The Lab (https://members.radiolab.org/) today.Follow our show on Instagram, Twitter and Facebook @radiolab, and share your thoughts with us by emailing radiolab@wnyc.org.Leadership support for Radiolab’s science programming is provided by the Gordon and Betty Moore Foundation, Science Sandbox, a Simons Foundation Initiative, and the John Templeton Foundation. Foundational support for Radiolab was provided by the Alfred P. Sloan Foundation.",
  "author": "WNYC Studios",
  "published": "Fri, 8 Nov 2024 15:00:00 +0000",
  "source": "http://feeds.wnyc.org/radiolab",
  "categories": [
    "puberty",
    " brain",
    " psychology",
    " psychedelics",
    " teen",
    " biology",
    " learning",
    " mdma",
    " ptsd",
    " behaviour",
    " mushrooms",
    " mice",
    " peer pressure",
    " depression",
    " science",
    " storytelling",
    " neurology"
  ],
  "byline": "",
  "length": 145,
  "excerpt": "Investigating a strange world.",
  "siteName": "Radiolab Podcasts | WNYC Studios",
  "favicon": "https://www.wnycstudios.org/apple-touch-icon.png",
  "text": "Unlock exclusives in The LabSign up for the newsletterTest the outer edges of what you think you knowProduced by WNYC Studios© 2024 WNYC Studios",
  "image": "https://radiolab.org/og-default-image.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-style-mode=\"blue\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch2\u003e Unlock exclusives \u003cspan\u003e in \u003ca href=\"https://www.wnycstudios.org/the-lab\"\u003eThe Lab\u003c/a\u003e\u003cspan\u003e\u003cimg alt=\"icon\" src=\"https://www.wnycstudios.org/rl-icon-stripes.svg\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/h2\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eSign up for the newsletter\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"small white Radiolab logo icon\" src=\"https://www.wnycstudios.org/rl-icon-solid-white.svg\"/\u003e\u003c/p\u003e\u003cp\u003eTest the outer edges of what you think you know\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eProduced by WNYC Studios\u003c/p\u003e\u003cp\u003e© 2024 WNYC Studios\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
