{
  "id": "5ca4f1eb-5a5f-44b5-af0e-785299cf27fe",
  "title": "SpaceX Catches a Falling Starship—a First in Spaceflight History",
  "link": "https://www.scientificamerican.com/article/spacex-catches-a-falling-starship-a-first-in-spaceflight-history/",
  "description": "SpaceX’s fifth Starship flight test concluded with mechanical arms snatching the descending rocket booster out of the air",
  "author": "",
  "published": "Tue, 15 Oct 2024 20:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Mike Wall",
  "length": 6827,
  "excerpt": "SpaceX’s fifth Starship flight test concluded with mechanical arms snatching the descending rocket booster out of the air",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "The biggest and most powerful rocket ever built took to the skies again. And this time, it came back.SpaceX launched its 400-foot-tall (122 meters) Starship vehicle for the fifth time ever today (Oct. 13), sending the giant rocket aloft from its Starbase site in South Texas at 8:25 am. EDT (1225 GMT; 7:25 a.m. local Texas time).The mission aimed to break new ground for Starship, and for spaceflight in general: SpaceX planned to return Starship's huge first-stage booster, known as Super Heavy, directly to its launch mount, catching it with the \"chopstick\" arms of the launch tower in a bold and unprecedented maneuver.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.And that's exactly what happened. About seven minutes after liftoff, SpaceX's Super Heavy executed what appeared to be a bull's-eye landing, hovering near the Mechazilla launch tower as the tower captured it with its metal arms.\"This is a day for the engineering history books,\" Kate Tice, SpaceX manager of Quality Systems Engineering, said during live commentary as SpaceX employees screamed and cheered at the company's Hawthorne, California headquarters behind her. \"This is absolutely insane! On the first-ever attempt, we have successfully caught the Super Heavy booster back at the launch tower.\"\"Are you kidding me?\" SpaceX spokesperson Dan Huot added from the launch site. \"Even in this day and age, what we just saw — that looked like magic.\"The booster catch was not the only goal for Flight 5. SpaceX also aimed to send Starship's 165-foot-tall (50 m) upper stage — known as Starship, or simply Ship — to space and bring it back to Earth with a splashdown in the Indian Ocean. That occurred about 65 minutes after liftoff, with the Ship firing three of its six engines to hover over the ocean before tipping over and exploding.\"That was amazing,\" Tice said. \"We were not intending to recover any of Starship, so that was the best ending that we could have hoped for.\"Elon Musk, SpaceX's founder and CEO, agreed.\"Big step towards making life multiplanetary was made today,\" he wrote on X (formerly Twitter) after the landing.A giant moon and Mars rocketSpaceX is developing Starship to help humanity settle the moon and Mars, among other exploration feats. The vehicle is designed to be fully and rapidly reusable (as evidenced by the Super Heavy launch-mount landing plan, which will slash the time needed between flights). This characteristic, combined with Starship's unprecedented power, could revolutionize spaceflight, according to the company and Musk.NASA is a believer in the vehicle, selecting it to be the first crewed lander for its Artemis program of moon exploration. If all goes to plan, Starship will land NASA astronauts on Earth's nearest neighbor for the first time on the Artemis 3 mission, which is targeted to launch in September 2026.SpaceX aims to get Starship up and running in time to meet such deadlines via its usual development strategy — tweaking the vehicle and testing those tweaks on test flights, then repeating the process. Indeed, the Flight 5 Starship featured some significant modifications compared to its predecessors.\"One of the key upgrades on Starship ahead of flight was a complete rework of its heat shield, with SpaceX technicians spending more than 12,000 hours replacing the entire thermal protection system with newer-generation tiles, a backup ablative layer and additional protections between the flap structures,\" SpaceX wrote in a Flight 5 mission description.Starship's previous four test flights occurred in April and November of 2023 and March and June of this year.The rocket has performed better on each successive flight. The debut mission lasted just four minutes, for example; SpaceX ordered a detonation high in the Texas sky after Starship's two stages failed to separate. But Flight 4, which launched on June 6, was a complete success; Ship reached orbital velocity, and both it and Super Heavy survived their return to Earth, landing in their designated splashdown zones. And Starship took another leap today.The waiting gameIf it were up to SpaceX, Flight 5 likely would've been in the books two months ago; the company said that Starship was ready to go from a technical standpoint in early August.Launches require approval from the U.S. Federal Aviation Administration (FAA), however, and the agency needed more time before greenlighting this one. Indeed, last month, the FAA said that it didn't expect approval for Flight 5 to come before late November.The FAA explained its reasoning in an emailed statement to Space.com on Sept. 11.\"SpaceX's current license authorizing the Starship Flight 4 launch also allows for multiple flights of the same vehicle configuration and mission profile. SpaceX chose to modify both for its proposed Starship Flight 5 launch, which triggered a more in-depth review,\" agency officials wrote.\"In addition, SpaceX submitted new information in mid-August detailing how the environmental impact of Flight 5 will cover a larger area than previously reviewed,\" they added. \"This requires the FAA to consult with other agencies.\"SpaceX was not happy with the news. On Sept. 10, the company published a blog post titled \"Starships Are Meant to Fly,\" which claimed that the FAA had previously given SpaceX a mid-September estimate for Flight 5's approval. The document also expressed frustration with the FAA's pace and process and with launch-industry regulations in general.The Flight 5 \"delay was not based on a new safety concern, but instead driven by superfluous environmental analysis,\" SpaceX wrote in the post.\"We find ourselves delayed for unreasonable and exasperating reasons,\" the company added. \"Unfortunately, we continue to be stuck in a reality where it takes longer to do the government paperwork to license a rocket launch than it does to design and build the actual hardware,\" the company added. \"This should never happen and directly threatens America's position as the leader in space.\"In the end, the late-November estimate for Flight 5 proved pessimistic.And it's safe to assume that SpaceX wants to launch another Starship mission relatively soon. Last month, SpaceX conducted a static fire — a common prelaunch test in which a rocket's engines are fired while it remains anchored to the ground — with the Flight 6 Ship vehicle.And there will be more test missions coming after that; SpaceX always has a few Starships in the queue, and it's always itching to fly.Copyright 2024 Space.com, a Future company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
  "image": "https://static.scientificamerican.com/dam/m/49b1dacb2e51c27c/original/GettyImages-2177494351_WEB.jpg?w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe biggest and most powerful rocket ever built took to the skies again. And this time, it came back.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.space.com/18853-spacex.html\"\u003eSpaceX\u003c/a\u003e launched its 400-foot-tall (122 meters) \u003ca href=\"https://www.space.com/spacex-starship-super-heavy.html\"\u003eStarship\u003c/a\u003e vehicle for the fifth time ever today (Oct. 13), sending the giant rocket aloft from its Starbase site in South Texas at 8:25 am. EDT (1225 GMT; 7:25 a.m. local Texas time).\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe mission aimed to break new ground for Starship, and for spaceflight in general: SpaceX planned to return Starship\u0026#39;s huge first-stage booster, known as Super Heavy, directly to its launch mount, catching it with the \u0026#34;chopstick\u0026#34; arms of the launch tower in a bold and unprecedented maneuver.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd that\u0026#39;s exactly what happened. About seven minutes after liftoff, SpaceX\u0026#39;s Super Heavy executed what appeared to be a bull\u0026#39;s-eye landing, hovering near the Mechazilla launch tower as the tower captured it with its metal arms.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;This is a day for the engineering history books,\u0026#34; Kate Tice, SpaceX manager of Quality Systems Engineering, said during live commentary as SpaceX employees screamed and cheered at the company\u0026#39;s Hawthorne, California headquarters behind her. \u0026#34;This is absolutely insane! On the first-ever attempt, we have successfully caught the Super Heavy booster back at the launch tower.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Are you kidding me?\u0026#34; SpaceX spokesperson Dan Huot added from the launch site. \u0026#34;Even in this day and age, what we just saw — that looked like magic.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe booster catch was not the only goal for Flight 5. SpaceX also aimed to send Starship\u0026#39;s 165-foot-tall (50 m) upper stage — known as Starship, or simply Ship — to space and bring it back to \u003ca href=\"https://www.space.com/54-earth-history-composition-and-atmosphere.html\"\u003eEarth\u003c/a\u003e with a splashdown in the Indian Ocean. That occurred about 65 minutes after liftoff, with the Ship firing three of its six engines to hover over the ocean before tipping over and exploding.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;That was amazing,\u0026#34; Tice said. \u0026#34;We were not intending to recover any of Starship, so that was the best ending that we could have hoped for.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.space.com/18849-elon-musk.html\"\u003eElon Musk\u003c/a\u003e, SpaceX\u0026#39;s founder and CEO, agreed.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Big step towards making life multiplanetary was made today,\u0026#34; \u003ca href=\"https://x.com/elonmusk/status/1845463518671466934\"\u003ehe wrote on X\u003c/a\u003e (formerly Twitter) after the landing.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eA giant moon and Mars rocket\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSpaceX is developing Starship to help humanity settle the moon and \u003ca href=\"https://www.space.com/47-mars-the-red-planet-fourth-planet-from-the-sun.html\"\u003eMars\u003c/a\u003e, among other exploration feats. The vehicle is designed to be fully and rapidly reusable (as evidenced by the Super Heavy launch-mount landing plan, which will slash the time needed between flights). This characteristic, combined with Starship\u0026#39;s unprecedented power, could revolutionize spaceflight, according to the company and Musk.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNASA is a believer in the vehicle, selecting it to be the first crewed lander for its \u003ca href=\"https://www.space.com/artemis-program.html\"\u003eArtemis program\u003c/a\u003e of moon exploration. If all goes to plan, Starship will land NASA astronauts on Earth\u0026#39;s nearest neighbor for the first time on the \u003ca href=\"https://www.space.com/artemis-3-moon-landing-mission\"\u003eArtemis 3\u003c/a\u003e mission, which is targeted to launch in September 2026.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSpaceX aims to get Starship up and running in time to meet such deadlines via its usual development strategy — tweaking the vehicle and testing those tweaks on test flights, then repeating the process. Indeed, the Flight 5 Starship featured some significant modifications compared to its predecessors.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;One of the key upgrades on Starship ahead of flight was a complete rework of its heat shield, with SpaceX technicians spending more than 12,000 hours replacing the entire thermal protection system with newer-generation tiles, a backup ablative layer and additional protections between the flap structures,\u0026#34; SpaceX wrote in a \u003ca href=\"https://www.spacex.com/launches/mission/?missionId=starship-flight-5\"\u003eFlight 5 mission description\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eStarship\u0026#39;s previous four test flights occurred in April and November of 2023 and March and June of this year.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe rocket has performed better on each successive flight. The debut mission lasted just four minutes, for example; SpaceX ordered a detonation high in the Texas sky after Starship\u0026#39;s two stages failed to separate. But \u003ca href=\"https://www.space.com/spacex-starship-flight-4-test-launch-success\"\u003eFlight 4\u003c/a\u003e, which launched on June 6, was a complete success; Ship reached orbital velocity, and both it and Super Heavy survived their return to Earth, landing in their designated splashdown zones. And Starship took another leap today.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eThe waiting game\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf it were up to SpaceX, Flight 5 likely would\u0026#39;ve been in the books two months ago; the company said that Starship was ready to go from a technical standpoint in early August.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eLaunches require approval from the U.S. Federal Aviation Administration (FAA), however, and the agency needed more time before greenlighting this one. Indeed, last month, the FAA said that it didn\u0026#39;t expect approval for Flight 5 to come before late November.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe FAA explained its reasoning in an emailed statement to Space.com on Sept. 11.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;SpaceX\u0026#39;s current \u003ca href=\"https://drs.faa.gov/browse/excelExternalWindow/DRSDOCID173891218620231102140506.0001?modalOpened=true\"\u003elicense\u003c/a\u003e authorizing the Starship Flight 4 launch also allows for multiple flights of the same vehicle configuration and mission profile. SpaceX chose to modify both for its proposed Starship Flight 5 launch, which triggered a more in-depth review,\u0026#34; agency officials wrote.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;In addition, SpaceX submitted new information in mid-August detailing how the environmental impact of Flight 5 will cover a larger area than previously reviewed,\u0026#34; they added. \u0026#34;This requires the FAA to consult with other agencies.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSpaceX was not happy with the news. On Sept. 10, the company published a blog post titled \u0026#34;\u003ca href=\"https://www.spacex.com/updates/#starships-fly\"\u003eStarships Are Meant to Fly\u003c/a\u003e,\u0026#34; which claimed that the FAA had previously given SpaceX a mid-September estimate for Flight 5\u0026#39;s approval. The document also expressed frustration with the FAA\u0026#39;s pace and process and with launch-industry regulations in general.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Flight 5 \u0026#34;delay was not based on a new safety concern, but instead driven by superfluous environmental analysis,\u0026#34; SpaceX wrote in the post.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;We find ourselves delayed for unreasonable and exasperating reasons,\u0026#34; the company added. \u0026#34;Unfortunately, we continue to be stuck in a reality where it takes longer to do the government paperwork to license a \u003ca href=\"https://www.space.com/29295-rocket-history.html\"\u003erocket\u003c/a\u003e launch than it does to design and build the actual hardware,\u0026#34; the company added. \u0026#34;This should never happen and directly threatens America\u0026#39;s position as the leader in space.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn the end, the late-November estimate for Flight 5 proved pessimistic.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd it\u0026#39;s safe to assume that SpaceX wants to launch another Starship mission relatively soon. Last month, SpaceX conducted a static fire — a common prelaunch test in which a rocket\u0026#39;s engines are fired while it remains anchored to the ground — \u003ca href=\"https://www.space.com/spacex-starship-number-six-static-fire-photo-video\"\u003ewith the Flight 6 Ship vehicle\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd there will be more test missions coming after that; SpaceX always has a few Starships in the queue, and it\u0026#39;s always itching to fly.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eCopyright 2024 \u003c/i\u003e\u003ca href=\"https://www.space.com/\"\u003e\u003ci\u003eSpace.com\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, a Future company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed\u003c/i\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-15T20:00:00Z",
  "modifiedTime": null
}
