{
  "id": "5cd4046e-6250-4543-bbb5-05ab9cc193ce",
  "title": "RFK Jr: Recruit Dr. Vinay Prasad to Run an RCT of the Routine Vaccine Schedule",
  "link": "https://sciencebasedmedicine.org/recruitprasad/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=recruitprasad",
  "description": "I only feel comfortable suggesting an RCT of routine vaccines because I am confident it wouldn't get off the ground. The post RFK Jr: Recruit Dr. Vinay Prasad to Run an RCT of the Routine Vaccine Schedule first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Fri, 14 Mar 2025 07:02:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 11803,
  "excerpt": "I only feel comfortable suggesting an RCT of routine vaccines because I am confident it wouldn't get off the ground.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "There are adverse events from the vaccine. It does cause deaths every year. Dear Mr. Kennedy, Congratulations on your confirmation to head the HHS. Your legacy will be cemented over the next 4 years. After railing against the “medical establishment” for decades, you are now the definition of the medical establishment. It’s our job to hold you accountable, and it’s your job to Make America Healthy Again. I hope you do, though you’re off to a horrible start. As measles is spreading, killing and hospitalizing children again, you’re going hiking and trying to stop it with vitamin A and cod liver oil. You said doctors had obtained “almost miraculous and instantaneous” recoveries with such quackery (discussed Wednesday by Dr. Steven Novella). You blamed the outbreak on poor nutrition and claimed measles protects against cancer and heart disease. You asked that we acknowledge “vaccine-injured kids and look them in the eye” and said: It used to be that everybody got measles. And the measles gave you lifetime protection against measles infection. The vaccine doesn’t do that … it used to be that very young kids were protected by breast milk. Women who get vaccinated do not provide that level of immunity… There are adverse events from the vaccine. It does cause deaths every year. It causes all the illnesses that measles itself cause.  Beyond mismanaging this outbreak, you’ve cast doubt about the independence of vaccine advisers and canceled key meetings and clinical trials about vaccines. You’ve terminated grants aimed at reducing vaccine hesitancy and and unsurprisingly, competent HHS officials have resigned in protest. All this in just one month. HHS Said To Have Asked CDC To Study Vaccines And Autism There are also reports that you plan to “investigate” whether or not vaccines cause autism. According to the article HHS Said To Have Asked CDC To Study Vaccines And Autism, Despite Robust Evidence Showing No Link: The US Department of Health and Human Services asked the US Centers for Disease Control and Prevention to study vaccines and autism, a person familiar with the situation told CNN, despite strong evidence that vaccines do not cause autism. The agency will conduct the study using the Vaccine Safety Datalink, which monitors safety of vaccines and investigates rare and serious adverse events, The Washington Post reported, citing two people familiar with the plan. Reuters earlier reported the planned study. The CDC has previously published several studies looking at a possible link between vaccines and vaccine ingredients and autism. None has found any evidence to suggest that vaccines increase the risk of autism or other neurodevelopmental disorders. Indeed multiple studies from around the world show that vaccines don’t cause autism and the myth that they did was based on fraudulent research. Observational data has been used to support vaccines, but is plagued by confounding. Aside from the fact that we already know vaccines don’t cause autism, there’s an obvious problem here. As you know, any study using the Vaccine Safety Datalink (VSD) will be an observational study, and your supporters have been taught not to trust this study design. Dr. Vinay Prasad, a big fan of yours, has said the kind of data you plan to collect is “plagued by confounding”. He said: Observational data has been used to support vaccines, but is plagued by confounding. That is because parents who vaccinate their kids are different from those who don’t. The same studies could show that driving a baby home from hospital in a Mercedes is better than a Ford. He’s also has told people that monitoring systems like that VSD are “abysmal” and corrupted by the pharmaceutical industry. He said: I and others have repeatedly provided compromised positions where we can improve safety detection of current vaccines. The current system can be honest and admit that our vaccine surveillance is abysmal. Companies don’t want safety discovered. Dr. Prasad said all this specifically to encourage repeat COVID infections in unvaccinated children, and while it’s obviously absurd, it’s just one reason people won’t trust your proposed study. Indeed, no matter what you find, many people won’t believe it. If you “discover” that vaccines cause autism, I won’t trust the result, and neither will most people. We know your track record of dishonesty. After all, not long ago you were promoting the movie Vaxxed III: Authorized to Kill. Conversely, if a miracle occurs and you have the integrity to publish a study showing vaccines don’t cause autism, your anti-vaccine friends will turn on you and claim that you too have been corrupted. You taught them to do this, and experienced it yourself the one time you shared accurate information on vaccines. The only path to vaccine trust is to create randomized trials Fortunately, Dr. Prasad has the solution to your predicament. He agrees that we need more studies of routine vaccines and believes that you are the perfect person to increase confidence in them. He has very high expectations of you, saying the “only path to vaccine trust is to create randomized trials.” In his article Sabotaging RFK Jr’s Confirmation Will Increase Vaccine Hesitancy he said: Rfk’s energies should be directed towards creating neutral systems that adjudicate the safety of vaccines. And running cluster randomized trials of different vaccine schedules. Because the US is different than other nations! This is the key to restoring vaccine trust… The only path to vaccine trust is to create randomized trials and neutral systems and to acknowledge the core concerns about vaccine safety. At this point, the best way to curb vaccine hesitancy is to approve RFK Jr, and redirect his energies to generating more data. More data will answer the key questions that remain unanswered: which childhood immunization program is optimal. The worse thing we can do is tank his nomination. Then vaccine hesitancy will explode. Though Dr. Prasad expects you to do many difficult things, fortunately, there is a meeting of the minds. You have voiced similar sentiments, saying: They’ve never done a placebo controlled study on any vaccine prior to approving. Not one. That is totally dishonest, but you now have the power and resources to run the placebo controlled study you’ve demanded of others, and I hope you’ll recruit Dr. Prasad lead it. You are a fan of Dr. Prasad’s and have favorably shared his material several times over the past few years. He was recently quoted by the White House and has been a big supporter of President Trump, approving of his purges and censorship of scientists. He is colleagues with Drs. Marty Makary and Jay Bhattacharya. He’s even voiced his thoughts on what the placebo should be in his YouTube video Do vaccine trials use a real “placebo” or do the include preservative and adjuvant? He’s the ideal scientist to run the cluster RCTs he’s demanding of you. Let me lay my cards on the table. An RCT of routine vaccines is both absurd and amoral. Almost no topic in medicine has been more thoroughly studied than vaccines, and it would be wildly unethical to leave children unvaccinated as part of unnecessary research. As such, I would oppose this trial in every way possible and so would every other responsible doctor. I don’t think any ethical researcher would work on it, nor would any IRB approve it. If by some miracle these barriers were overcome, myself and many others would actively discourage parents from enrolling their children in it. But I don’t think parents would need convincing. Those of us who see through you and those who have been tricked by you don’t agree on much, but there’s no way we would let our children enter a trial where there’s a 50% chance they would be vaccinated. I don’t think a single parent would enroll their child in this RCT, especially if the informed consent process (discussed Monday by Dr. David Gorski) was done correctly. You’d have to tell parents their child was going to be intentionally left vulnerable to dangerous pathogens even as those pathogens are spreading. I have previously said that it’s much easier to write the words “do an RCT” than to actually do an RCT, and I only feel comfortable suggesting an RCT of routine vaccines is because I am confident it wouldn’t get off the ground. I also don’t think anyone, including Dr. Prasad, actually wants to do this RCT. I have also written that he casually creates long lists of undone RCTs not to advance research, but rather to spread doubt and mistrust. But both of you can prove me wrong. Maybe Dr. Prasad’s proposed cluster RCT of routine vaccines is sincere and genuine. Maybe he’s right that this RCT is the best way to determine which childhood immunization program is optimal and to restore confidence in vaccines. Maybe he’s willing to stop making monetized YouTube videos and to start converting his words into actions. Dr. Prasad has clearly put a lot of thought into this RCT and you both feel it needs to be done. You’re the boss now. Give him the chance to show us what he can do. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2025/03/image-32.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003ch2\u003e There are adverse events from the vaccine. It does cause deaths every year. \u003c/h2\u003e\n\n\n\n\u003cp\u003eDear Mr. Kennedy,\u003c/p\u003e\n\n\n\n\u003cp\u003eCongratulations on your confirmation to head the HHS. Your legacy will be cemented over the next 4 years. After railing against the “medical establishment” for decades, you are now the definition of the medical establishment. It’s our job to hold you accountable, and it’s your job to Make America Healthy Again.\u003c/p\u003e\n\n\n\n\u003cp\u003eI hope you do, though you’re off to a horrible start. As \u003ca href=\"https://www.theguardian.com/us-news/2025/mar/12/texas-measles-outbreak-spread\"\u003emeasles is spreading\u003c/a\u003e, killing and hospitalizing children again, you’re \u003ca href=\"https://www.msn.com/en-us/news/us/rfk-jr-slammed-for-hiking-in-coachella-during-deadly-texas-measles-outbreak/ar-AA1AocTp?ocid=BingNewsSerp\" title=\"\"\u003egoing hiking\u003c/a\u003e and trying to stop it with \u003ca href=\"https://www.nytimes.com/2025/03/04/health/texas-measles-outbreak-kennedy.html\" title=\"\"\u003evitamin A and cod liver oil\u003c/a\u003e. You said doctors had obtained “\u003ca href=\"https://www.nytimes.com/2025/03/10/health/measles-texas-kennedy-fox.html\"\u003ealmost miraculous and instantaneous\u003c/a\u003e” recoveries with such quackery (discussed \u003ca href=\"https://sciencebasedmedicine.org/vitamin-a-does-not-treat-or-prevent-measles/\"\u003eWednesday\u003c/a\u003e by Dr. Steven Novella). You blamed the outbreak on poor nutrition and claimed measles protects against cancer and heart disease. You asked that we acknowledge “\u003ca href=\"https://www.nytimes.com/2025/03/10/health/measles-texas-kennedy-fox.html\"\u003evaccine-injured kids and look them in the eye\u003c/a\u003e” and \u003ca href=\"https://x.com/atrupar/status/1899637162817036510\"\u003esaid\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eIt used to be that everybody got measles. And the measles gave you lifetime protection against measles infection. The vaccine doesn’t do that … it used to be that very young kids were protected by breast milk. Women who get vaccinated do not provide that level of immunity… There are adverse events from the vaccine. It does cause deaths every year. It causes all the illnesses that measles itself cause. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eBeyond mismanaging this outbreak, you’ve cast doubt about the independence of\u003ca href=\"https://www.science.org/content/article/rfk-jr-says-federal-vaccine-advisers-are-beholden-industry-evidence-does-not-support#:~:text=Since%20then%2C%20reports%20have%20surfaced,people%20in%20the%20United%20States\"\u003e vaccine advisers\u003c/a\u003e and \u003ca href=\"https://www.yahoo.com/news/rfk-jr-takes-sledgehammer-two-142741731.html\"\u003ecanceled\u003c/a\u003e key meetings and clinical trials about vaccines. You’ve \u003ca href=\"https://www.washingtonpost.com/health/2025/03/10/vaccines-nih-rfk-research-canceled/\"\u003eterminated grants\u003c/a\u003e aimed at reducing vaccine hesitancy and and unsurprisingly, competent HHS officials have resigned\u003ca href=\"https://www.msn.com/en-us/news/politics/top-hhs-spokesman-resigns-amid-clashes-with-key-rfk-jr-aide/ar-AA1AaKHR?ocid=BingNewsSerp\"\u003e in protest.\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eAll this in just one month.\u003c/p\u003e\n\n\n\n\u003ch2\u003eHHS Said To Have Asked CDC To Study Vaccines And Autism\u003c/h2\u003e\n\n\n\n\u003cp\u003eThere are also reports that you plan to “investigate” whether or not vaccines cause autism. According to the article \u003ca href=\"https://www.cnn.com/2025/03/07/health/hhs-cdc-vaccines-autism/index.html\"\u003eHHS Said To Have Asked CDC To Study Vaccines And Autism, Despite Robust Evidence Showing No Link\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe US Department of Health and Human Services asked the US Centers for Disease Control and Prevention to study vaccines and autism, a person familiar with the situation told CNN, despite strong evidence that vaccines do not cause autism.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe agency will conduct the study using the Vaccine Safety Datalink, which monitors safety of vaccines and investigates\u003cstrong\u003e \u003c/strong\u003erare and serious adverse events, The Washington Post reported, citing two people familiar with the plan. Reuters earlier reported the planned study.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe CDC has previously published \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/17898097/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eseveral studies\u003c/a\u003e \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/20837594/#full-view-affiliation-1\" target=\"_blank\" rel=\"noreferrer noopener\"\u003elooking at a possible link\u003c/a\u003e between vaccines and vaccine ingredients and autism. None has found any evidence to suggest that vaccines increase the risk of autism or other neurodevelopmental disorders.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eIndeed \u003ca href=\"https://www.skepticalraptor.com/skepticalraptorblog.php/autism-and-vaccines-150-peer-reviewed-articles-no-link/\" title=\"\"\u003emultiple studies\u003c/a\u003e from around the world show that vaccines don’t cause autism and the myth that they did was based on fraudulent research.\u003c/p\u003e\n\n\n\n\u003ch2\u003eObservational data has been used to support vaccines, but is plagued by confounding.\u003c/h2\u003e\n\n\n\n\u003cp\u003eAside from the fact that we already know vaccines don’t cause autism, there’s an obvious problem here. As you know, any study using the \u003ca href=\"https://www.cdc.gov/vaccine-safety-systems/vsd/index.html\"\u003eVaccine Safety Datalink\u003c/a\u003e (VSD) will be an observational study, and your supporters have been taught not to trust this study design. Dr. Vinay Prasad, a big fan of yours, has said the kind of data you plan to collect is “plagued by confounding”. He \u003ca href=\"https://www.sensible-med.com/p/a-pro-con-debate-should-doctors-encourage\"\u003esaid\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eObservational data has been used to support vaccines, but is plagued by confounding. That is because parents who vaccinate their kids are different from those who don’t. The same studies could show that driving a baby home from hospital in a Mercedes is better than a Ford.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eHe’s also has told people that monitoring systems like that VSD are “abysmal” and corrupted by the pharmaceutical industry. He \u003ca href=\"https://www.drvinayprasad.com/p/sabotaging-rfk-jrs-confirmation-will\"\u003esaid\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eI and others have repeatedly provided compromised positions where we can improve safety detection of current vaccines. The current system can be honest and admit that our vaccine surveillance is abysmal. Companies don’t want safety discovered. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eDr. Prasad said all this specifically to encourage repeat COVID infections in unvaccinated children, and while it’s obviously absurd, it’s just one reason people won’t trust your proposed study. \u003c/p\u003e\n\n\n\n\u003cp\u003eIndeed, no matter what you find, many people won’t believe it. If you “discover” that vaccines cause autism, I won’t trust the result, and neither will most people. We know your track record of dishonesty. After all, not long ago you were promoting the movie \u003ca href=\"https://www.khq.com/news/vaccine-conspiracy-theory-documentary-headed-to-spokane/article_abe5b870-5c16-11ef-8f3b-47225300c6f3.html\"\u003eVaxxed III: Authorized to Kill\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eConversely, if a miracle occurs and you have the integrity to publish a study showing vaccines don’t cause autism, your anti-vaccine friends will turn on you and claim that you too have been corrupted. You taught them to do this, and \u003ca href=\"https://www.motherjones.com/politics/2025/03/rfks-flip-flop-on-the-measles-shot-is-ripping-the-anti-vax-world-apart/\"\u003eexperienced\u003c/a\u003e it yourself the one time you shared accurate information on vaccines.\u003c/p\u003e\n\n\n\n\u003ch2\u003eThe only path to vaccine trust is to create randomized trials\u003c/h2\u003e\n\n\n\n\u003cp\u003eFortunately, Dr. Prasad has the solution to your predicament. He agrees that we need more studies of routine vaccines and believes that you are the perfect person to increase confidence in them. He has very high expectations of you, saying the “\u003cem\u003eonly path to vaccine trust is to create randomized trials\u003c/em\u003e.” In his article \u003ca href=\"https://www.drvinayprasad.com/p/sabotaging-rfk-jrs-confirmation-will\"\u003eSabotaging RFK Jr’s Confirmation Will Increase Vaccine Hesitancy\u003c/a\u003e he said:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eRfk’s energies should be directed towards creating neutral systems that adjudicate the safety of vaccines. And running cluster randomized trials of different vaccine schedules. Because the US is different than other nations! This is the key to restoring vaccine trust… The only path to vaccine trust is to create randomized trials and neutral systems and to acknowledge the core concerns about vaccine safety.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt this point, the best way to curb vaccine hesitancy is to approve RFK Jr, and redirect his energies to generating more data. More data will answer the key questions that remain unanswered: which childhood immunization program is optimal. The worse thing we can do is tank his nomination. Then vaccine hesitancy will explode.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThough Dr. Prasad expects you to do many difficult things, fortunately, there is a meeting of the minds. You have voiced similar sentiments, \u003ca href=\"https://x.com/newstart_2024/status/1895946245866147964\"\u003esaying\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThey’ve never done a placebo controlled study on any vaccine prior to approving. Not one. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThat is \u003ca href=\"https://pauloffit.substack.com/p/the-casual-cruelty-of-placebo-controlled\"\u003etotally dishonest\u003c/a\u003e, but you now have the power and resources to run the placebo controlled study you’ve demanded of others, and I hope you’ll recruit Dr. Prasad lead it. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou are a fan of Dr. Prasad’s and have \u003ca href=\"https://childrenshealthdefense.org/authors/vinay-prasad-m-d-mph/\"\u003efavorably shared \u003c/a\u003ehis material several times over the past few years. He was \u003ca href=\"https://www.importantcontext.news/p/trump-white-house-cites-fringe-doctor\"\u003erecently quoted\u003c/a\u003e by the White House and has been a big supporter of President Trump, approving of his \u003ca href=\"https://x.com/VPrasadMDMPH/status/1888080368697528816\"\u003epurges\u003c/a\u003e and censorship of scientists. He is colleagues with Drs. Marty Makary and Jay Bhattacharya. He’s even voiced his thoughts on what the placebo should be in his YouTube video \u003ca href=\"https://www.youtube.com/watch?v=UqYhnWpYG7Q\"\u003eDo vaccine trials use a real “placebo” or do the include preservative and adjuvant?\u003c/a\u003e  He’s the ideal scientist to run the cluster RCTs he’s demanding of you. \u003c/p\u003e\n\n\n\n\u003cp\u003eLet me lay my cards on the table. An RCT of routine vaccines is both absurd and amoral. Almost no topic in medicine has been more thoroughly studied than vaccines, and it would be wildly unethical to leave children unvaccinated as part of unnecessary research. As such, I would oppose this trial in every way possible and so would every other responsible doctor. I don’t think any ethical researcher would work on it, nor would any IRB approve it. If by some miracle these barriers were overcome, myself and many others would actively discourage parents from enrolling their children in it.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut I don’t think parents would need convincing. Those of us who see through you and those who have been tricked by you don’t agree on much, but there’s no way we would let our children enter a trial where there’s a 50% chance they would be vaccinated. I don’t think a single parent would enroll their child in this RCT, especially if the informed consent process (discussed \u003ca href=\"https://sciencebasedmedicine.org/misinformed-refusal-what-antivaxxers-really-mean-when-they-invoke-informed-consent/\" title=\"\"\u003eMonday\u003c/a\u003e by Dr. David Gorski) was done correctly. You’d have to tell parents their child was going to be intentionally left vulnerable to dangerous pathogens even as those pathogens are spreading.\u003c/p\u003e\n\n\n\n\u003cp\u003eI have previously said that it’s much easier to write the words “\u003cem\u003edo an RCT\u003c/em\u003e” than to actually do an RCT, and I only feel comfortable suggesting an RCT of routine vaccines is because I am confident it wouldn’t get off the ground. I also don’t think anyone, including Dr. Prasad, \u003cem\u003eactually \u003c/em\u003ewants to do this RCT. I have also written that he casually creates \u003ca href=\"https://x.com/VPrasadMDMPH/status/1496281475561500673\"\u003elong lists of undone RCTs\u003c/a\u003e not to advance research, but rather to spread doubt and mistrust.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut both of you can prove me wrong. Maybe Dr. Prasad’s proposed cluster RCT of routine vaccines is sincere and genuine. Maybe he’s right that this RCT is the best way to determine which childhood immunization program is optimal and to restore confidence in vaccines. Maybe he’s willing to stop making monetized YouTube videos and to start converting his words into actions.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Prasad has clearly put a lot of thought into this RCT and you both feel it needs to be done. You’re the boss now. Give him the chance to show us what he can do.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                                                                                                    Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                                                                                                \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#99f3f6f7f8edf1f8f7b7f1f6eef8ebfdd9f7e0ecf5f8f7fef6f7fcb7f6ebfe\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                            \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-03-14T03:02:00-04:00",
  "modifiedTime": "2025-03-13T17:24:52Z"
}
