{
  "id": "65fd1587-4f4d-4118-a2c6-dec231c9f468",
  "title": "One trillion species, 3 billion years: How we used AI to trace the evolution of bacteria on Earth",
  "link": "https://phys.org/news/2025-04-trillion-species-billion-years-ai.html",
  "description": "There are roughly a trillion species of microorganisms on Earth—the vast majority of which are bacteria.",
  "author": "",
  "published": "Sat, 05 Apr 2025 12:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Evolution Cell \u0026 Microbiology"
  ],
  "byline": "Ben Woodcroft, Adrián A. Davín",
  "length": 6276,
  "excerpt": "There are roughly a trillion species of microorganisms on Earth—the vast majority of which are bacteria.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: CC0 Public Domain There are roughly a trillion species of microorganisms on Earth—the vast majority of which are bacteria. Bacteria consist of a single cell. They do not have bones and are not like big animals that leave clear signs in the geological record, which thankful paleontologists can study many millions of years later. This has made it very hard for scientists to establish a timeline of their early evolution. But with the help of machine learning, we have been able to fill in many of the details. Our new research, published today in Science, also reveals some bacteria developed the ability to use oxygen long before the Earth became saturated with it roughly 2.4 billion years ago. A monumental event in Earth's history About 4.5 billion years ago, the moon formed. Violently. A Mars-size object collided with Earth, turning its surface into molten rock. If life existed before this cataclysm, it was probably destroyed. After that, the current ancestors of all living beings appeared: single-celled microbes. For the first 80% of life's history, the Earth was inhabited solely by these microbes. Nothing in biology makes sense except in the light of evolution, as evolutionary biologist Theodosius Dobzhansky famously said in 1973. But how did the evolution of life proceed through the early history of the Earth? Comparing DNA sequences from the wonderful diversity of life we see today can tell us how different groups relate to each other. For ibnstance, we humans are more closely related to mushrooms than we are to apple trees. Likewise, such comparisons can tell us how different groups of bacteria are related to each other. But comparison of DNA sequences can only take us so far. DNA comparisons do not say when in Earth's history evolutionary events took place. At one point in time, an organism reproduced two offspring. One of them gave rise to mushrooms, the other to humans (and lots of other species too). But when exactly did that organism live? How many years ago? One thing geology teaches us about is the existence of another monumental event in the history of Earth, 2.4 billion years ago. At that time, the atmosphere of Earth changed dramatically. A group of bacteria called the cyanobacteria invented a trick that would alter the story of life forever: photosynthesis. Harvesting energy from the sun powered their cells. But it also generated an inconvenient waste product, oxygen gas. Over the course of millions of years, oxygen in the atmosphere slowly accumulated. Before this \"Great Oxidation Event,\" the Earth contained almost no oxygen, so life was not ready for it. In fact, to uninitiated bacteria, oxygen is a poisonous gas, and so its release into the atmosphere probably caused a mass extinction. The surviving bacteria either evolved to use oxygen, or retreated into the recesses of the planet where it doesn't penetrate. The bacterial tree of life The Great Oxidation Event is especially interesting for us not only because of its impact on the history of life, but also because it can be given a clear date. We know it happened around 2.4 billion years ago—and we also know most bacteria that adapted to oxygen had to live after this event. We used this information to layer on dates to the bacterial tree of life. We started by training an artificial intelligence (AI) model to predict whether a bacteria lives with oxygen or not from the genes it has. Many bacteria we see today use oxygen, such as cyanobacteria and others that live in the ocean. But many do not, such as the bacteria that live in our gut. As far as machine learning tasks go, this one was quite straightforward. The chemical power of oxygen markedly changes a bacteria's genome because a cell's metabolism becomes organized around oxygen use, and so there are many clues in the data. We then applied our machine-learning models to predict which bacteria used oxygen in the past. This was possible because modern techniques allow us to estimate not only how the species we see today are related, but also which genes each ancestor carried in its genome. A surprising twist By using the planet-wide geological event of the Great Oxidation Event effectively as a \"fossil\" calibration point, our approach produced a detailed timeline of bacterial evolution. Combining results from geology, paleontology, phylogenetics and machine learning, we were able to refine the timing of bacterial evolution significantly. Our results also revealed a surprising twist: some bacterial lineages capable of using oxygen existed roughly 900 million years before the Great Oxidation Event. This suggests these bacteria evolved the ability to use oxygen even when atmospheric oxygen was scarce. Remarkably, our findings indicated that cyanobacteria actually evolved the ability to use oxygen before they developed photosynthesis. This framework not only reshapes our understanding of bacterial evolutionary history but also illustrates how life's capabilities evolved in response to Earth's changing environments. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: One trillion species, 3 billion years: How we used AI to trace the evolution of bacteria on Earth (2025, April 5) retrieved 5 April 2025 from https://phys.org/news/2025-04-trillion-species-billion-years-ai.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2019/7-bacteria.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2019/7-bacteria.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2019/7-bacteria.jpg\" data-sub-html=\"Credit: CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2019/7-bacteria.jpg\" alt=\"bacteria\" title=\"Credit: CC0 Public Domain\" width=\"800\" height=\"480\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eThere are roughly \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9986037/\" target=\"_blank\"\u003ea trillion species\u003c/a\u003e of microorganisms on Earth—the vast majority of which are bacteria.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBacteria consist of a single cell. They do not have bones and are not like big animals that leave clear signs in the \u003ca href=\"https://phys.org/tags/geological+record/\" rel=\"tag\"\u003egeological record\u003c/a\u003e, which thankful paleontologists can study many millions of years later.\u003c/p\u003e\n\u003cp\u003eThis has made it very hard for scientists to establish a timeline of their early evolution. But with the help of machine learning, we have been able to fill in many of the details. Our new research, \u003ca href=\"https://doi.org/10.1126/science.adp1853\" target=\"_blank\"\u003epublished today in \u003ci\u003eScience\u003c/i\u003e\u003c/a\u003e, also reveals some \u003ca href=\"https://phys.org/tags/bacteria/\" rel=\"tag\"\u003ebacteria\u003c/a\u003e developed the ability to use oxygen long before the Earth became saturated with it roughly 2.4 billion years ago.\u003c/p\u003e\n\u003ch2\u003eA monumental event in Earth\u0026#39;s history\u003c/h2\u003e\n\u003cp\u003eAbout 4.5 billion years ago, the moon formed. Violently. A Mars-size object collided with Earth, turning its surface into molten rock. If life existed before this cataclysm, it was probably destroyed.\u003c/p\u003e\n\u003cp\u003eAfter that, the current ancestors of all living beings appeared: single-celled microbes. For the first 80% of life\u0026#39;s history, the Earth was inhabited solely by these microbes.\u003c/p\u003e\n\u003cp\u003eNothing in biology makes sense except in the light of evolution, as evolutionary biologist Theodosius Dobzhansky \u003ca href=\"https://online.ucpress.edu/abt/article-abstract/35/3/125/9833/Nothing-in-Biology-Makes-Sense-except-in-the-Light\" target=\"_blank\"\u003efamously said\u003c/a\u003e in 1973. But how did the evolution of life proceed through the early history of the Earth?\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eComparing DNA sequences from the wonderful diversity of life we see today can tell us how different groups relate to each other. For ibnstance, we humans are more closely related to mushrooms than we are to apple trees. Likewise, such comparisons can tell us how different groups of bacteria are related to each other.\u003c/p\u003e\n\u003cp\u003eBut comparison of DNA sequences can only take us so far. DNA comparisons do not say when in Earth\u0026#39;s history evolutionary events took place. At one point in time, an organism reproduced two offspring. One of them gave rise to mushrooms, the other to humans (and lots of other species too). But when exactly did that organism live? How many years ago?\u003c/p\u003e\n\u003cp\u003eOne thing geology teaches us about is the existence of another monumental event in the history of Earth, 2.4 billion years ago. At that time, the atmosphere of Earth changed dramatically. A group of bacteria called the cyanobacteria invented a trick that would alter the story of life forever: photosynthesis.\u003c/p\u003e\n\u003cp\u003eHarvesting energy from the sun powered their cells. But it also generated an inconvenient waste product, oxygen gas.\u003c/p\u003e\n\n\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/VideoObject\"\u003e\n    \u003cmeta itemprop=\"name\" content=\"1 trillion species, 3 billion years: How we used AI to trace the evolution of bacteria on Earth\"/\u003e\n    \u003cmeta itemprop=\"url\" content=\"https://www.youtube.com/watch/?v=dO2xx-aeZ4w\"/\u003e\n    \u003cmeta itemprop=\"description\" content=\"1 trillion species, 3 billion years: How we used AI to trace the evolution of bacteria on Earth\"/\u003e\n    \u003cmeta itemprop=\"uploadDate\" content=\"2025-04-04T06:42:49-04:00\"/\u003e    \n        \u003cmeta itemprop=\"embedUrl\" content=\"https://www.youtube.com/embed/dO2xx-aeZ4w\"/\u003e\n    \u003cmeta itemprop=\"thumbnailUrl\" content=\"https://img.youtube.com/vi/dO2xx-aeZ4w/maxresdefault.jpg\"/\u003e\n         \u003cp\u003e\n             \u003ciframe src=\"https://www.youtube.com/embed/dO2xx-aeZ4w?color=white\" loading=\"lazy\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n         \u003c/p\u003e\n          \n\u003c/figure\u003e\u003cp\u003eOver the course of millions of years, oxygen in the atmosphere slowly accumulated. Before this \u0026#34;Great Oxidation Event,\u0026#34; the Earth contained almost no oxygen, so life was not ready for it. In fact, to uninitiated bacteria, oxygen is a poisonous gas, and so its release into the atmosphere probably caused a mass extinction. The surviving bacteria either evolved to use oxygen, or retreated into the recesses of the planet where it doesn\u0026#39;t penetrate.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eThe bacterial tree of life\u003c/h2\u003e\n\u003cp\u003eThe Great Oxidation Event is especially interesting for us not only because of its impact on the history of life, but also because it can be given a clear date. We know it happened around 2.4 billion years ago—and we also know most bacteria that adapted to oxygen had to live after this event. We used this information to layer on dates to the bacterial tree of life.\u003c/p\u003e\n\u003cp\u003eWe started by training an \u003ca href=\"https://phys.org/tags/artificial+intelligence/\" rel=\"tag\"\u003eartificial intelligence\u003c/a\u003e (AI) model to predict whether a bacteria lives with oxygen or not from the genes it has. Many bacteria we see today use oxygen, such as cyanobacteria and others that live in the ocean. But many do not, such as the bacteria that live in our gut.\u003c/p\u003e\n\u003cp\u003eAs far as machine learning tasks go, this one was quite straightforward. The chemical power of oxygen markedly changes a bacteria\u0026#39;s genome because a cell\u0026#39;s metabolism becomes organized around oxygen use, and so there are many clues in the data.\u003c/p\u003e\n\u003cp\u003eWe then applied our machine-learning models to predict which bacteria used oxygen in the past. This was possible because modern techniques allow us to estimate not only how the species we see today are related, but also which genes each ancestor carried in its genome.\u003c/p\u003e\n\u003ch2\u003eA surprising twist\u003c/h2\u003e\n\u003cp\u003eBy using the planet-wide geological event of the Great Oxidation Event effectively as a \u0026#34;fossil\u0026#34; calibration point, our approach produced a detailed timeline of bacterial evolution.\u003c/p\u003e\n\u003cp\u003eCombining results from geology, paleontology, phylogenetics and \u003ca href=\"https://phys.org/tags/machine+learning/\" rel=\"tag\"\u003emachine learning\u003c/a\u003e, we were able to refine the timing of bacterial evolution significantly.\u003c/p\u003e\n\u003cp\u003eOur results also revealed a surprising twist: some bacterial lineages capable of using oxygen existed roughly 900 million years before the Great Oxidation Event. This suggests these bacteria evolved the ability to use oxygen even when atmospheric oxygen was scarce.\u003c/p\u003e\n\u003cp\u003eRemarkably, our findings indicated that cyanobacteria actually evolved the ability to use oxygen before they developed photosynthesis.\u003c/p\u003e\n\u003cp\u003eThis framework not only reshapes our understanding of bacterial evolutionary history but also illustrates how life\u0026#39;s capabilities evolved in response to Earth\u0026#39;s changing environments.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from \u003ca href=\"https://theconversation.com\" target=\"_blank\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/1-trillion-species-3-billion-years-how-we-used-ai-to-trace-the-evolution-of-bacteria-on-earth-253720\" target=\"_blank\"\u003eoriginal article\u003c/a\u003e.\u003cimg src=\"https://counter.theconversation.com/content/253720/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tOne trillion species, 3 billion years: How we used AI to trace the evolution of bacteria on Earth (2025, April 5)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 5 April 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-04-trillion-species-billion-years-ai.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-05T12:00:01-04:00",
  "modifiedTime": null
}
