{
  "id": "7262cd5b-d058-4a6b-bbe1-5e799c6e4baa",
  "title": "The Virus That Causes Mpox Keeps Getting Better at Spreading in People",
  "link": "https://www.scientificamerican.com/article/the-virus-that-causes-mpox-keeps-getting-better-at-spreading-in-people/",
  "description": "Analysis of a strain of the virus circulating in Central Africa shows genetic mutations indicative of sustained human-to-human spread",
  "author": "",
  "published": "Fri, 01 Nov 2024 17:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Max Kozlov",
  "length": 7208,
  "excerpt": "Analysis of a strain of the virus circulating in Central Africa shows genetic mutations indicative of sustained human-to-human spread",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "November 1, 20245 min readAnalysis of a strain of the virus circulating in Central Africa shows genetic mutations indicative of sustained human-to-human spreadColorized transmission electron micrograph of monkeypox virus particles (pink and yellow) found within an infected cell, cultured in the laboratory. NIH-NIAID/IMAGE POINT FR/BSIP/Universal Images Group via Getty ImagesYet another strain of the virus that causes mpox might be readily spreading from person to person, according to an analysis of the pathogen’s genome. This development could further complicate efforts to halt the spread of the disease in Central Africa, which has seen a surge in infections over the past year. And it has left researchers scratching their heads over what is currently driving this surge.The findings hint that the strain, called clade Ia, is spreading in a sustained fashion between people — possibly through sexual contact — in an outbreak in Kinshasa, the capital of the Democratic Republic of the Congo (DRC). Previously, the viral variant was known to transmit predominantly from animals to humans in Central Africa.“We know that viruses evolve — we have seen it with Ebola, we have seen it with COVID and we expected to see it with mpox as well,” says Placide Mbala, head of epidemiology and global health at the National Institute of Biomedical Research in Kinshasa, who co-led the analysis. “We don’t know how far these adaptations can go, and we are gathering data to understand how this evolution is occurring.”On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.The preliminary results, which have not yet been peer-reviewed, were posted on 22 October to the genomic-epidemiology discussion forum Virological.Mpox diversifiesThere are four known variants of the monkeypox virus: clades Ia, Ib, IIa and IIb (see ‘Quick guide to the strains of monkeypox virus’). Historically, clade I viruses have appeared mostly in Central Africa, and clade II viruses have cropped up in West Africa.This all changed in the mid-2010s, when a clade II strain sparked an outbreak in Nigeria. At the time, some researchers suggested that the variant might be capable of transmission through sexual contact. Their insights proved prescient: a similar clade II strain, called IIb, sparked a global outbreak of mpox in 2022 that has infected more than 90,000 people and continues today.Meanwhile, clade I viruses have caused sporadic infections in people for more than 50 years — largely in rural regions of Central Africa. But in late 2023, researchers identified a rapidly growing outbreak in more densely populated, urban areas in eastern regions of the DRC that disproportionately affected sex workers, suggesting that this strain of the virus could, like IIb, spread readily between people.Genomic sequencing confirmed that the variant causing this outbreak contained several key differences from other clade I viruses, leading researchers to name it Ib. This strain has been detected in the United Kingdom, Sweden, Thailand, India, Germany and six African countries that had never reported mpox infections before. The DRC has been hit particularly hard: the country has reported nearly 36,000 suspected infections and more than 1,000 deaths from mpox in 2024.But now — about one year after researchers detected an outbreak of clade Ib in eastern DRC — clade Ia is worrying health officials, too. The strain has also been on the rise in western regions of the DRC and in Kinshasa. In particular, having both Ia and Ib circulating in the capital city threatens the 17 million people living there and raises the possibility of clade I spreading internationally, given that Kinshasa is a travel hub.Quick guide to the strains of monkeypox virusClade Ia: a strain that has been spreading in Central Africa since the virus was first discovered to infect humans in 1970. Most infections have been in children, and it was known to mainly transmit from animal to human — until recently.Clade Ib: the strain that has caused a surge of cases in Central Africa since its discovery in late 2023. Known to spread from person to person, including through sexual contact.Clade IIa: the least-studied mpox strain. It has mainly spread in Guinea, Liberia and Côte d’Ivoire. Modes of transmission are not fully understood; there is no documented evidence of sexual transmission, but it is likely that all forms of close contact contribute to its spread.Clade IIb: the strain responsible for the still-simmering 2022 global outbreak. Known to spread from person to person, including through sexual contact. Most affected population has been men who have sex with men.Signs of evolutionHealth officials have been using genomic-sequencing tools to track the outbreak. As part of the effort, Mbala and his colleagues sequenced virus samples from infections in Kinshasa. In samples of both the clade Ia and Ib virus, they found a specific pattern of single-letter genetic mutations indicative of the ongoing battle between the human immune system and the virus — a pattern that would be unlikely to appear unless there was sustained human-to-human spread.However, the pattern did not show up in a report posted to a preprint server in August. In that study, a team sequenced clade Ia virus samples collected between 2018 and 2024. That the researchers didn’t spot the pattern suggests that it might be a recent development. “We didn’t pick up on strong signs of evolution” in the more rural and endemic regions of the DRC, says Jason Kindrachuk, a virologist at the University of Manitoba in Winnipeg, Canada, who collaborates with Mbala and co-authored the August preprint as well as the Virological one. “But in Kinshasa, it seems that there is something unique going on.”Clade Ia might also have the ability to spread through sexual contact: researchers reported the first probable case of sexually transmitted clade I mpox last year, and another such publication is forthcoming, Kindrachuk says.Given that clade I has been circulating between animals and people in the DRC since 1970, Kindrachuk adds that it will be important to investigate why clade Ib suddenly emerged in 2023, and why Ia has caused a surge in the number of detected infections in the past two years. “Is it because we’re better at surveillance, or because we’re more conscious of mpox at the community level? Is it because people have been moving around more after the [COVID-19] pandemic, or because there’s been a greater reliance on contact with wildlife?” he asks.For now, plans to roll out the continent’s first doses of mpox vaccines are unlikely to change in light of these findings, says Nicaise Ndembi, a virologist at the Africa Centres for Disease Control and Prevention in Addis Ababa. Health officials have already been allocating doses to regions that have a higher number of infections, regardless of the specific strain found in the area, he says.This article is reproduced with permission and was first published on October 30, 2024.",
  "image": "https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eNovember 1, 2024\u003c/p\u003e\u003cp\u003e5 min read\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAnalysis of a strain of the virus circulating in Central Africa shows genetic mutations indicative of sustained human-to-human spread\u003c/p\u003e\u003cfigure\u003e\u003cimg src=\"https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026amp;w=600\" alt=\"Colorized transmission electron micrograph of monkeypox virus particles\" srcset=\"https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026amp;w=900 900w, https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/452f34b90b13a2a4/original/Monkeypox_colorized_transmission_electron_micrograph.jpg?m=1730478559.528\u0026amp;w=1350 1350w\" sizes=\"(min-width: 900px) 900px, (min-resolution: 2dppx) 75vw, (min-resolution: 2.1dppx) 50vw, 100vw\" fetchpriority=\"high\"/\u003e\u003cfigcaption\u003e\u003cp\u003eColorized transmission electron micrograph of monkeypox virus particles (\u003ci\u003epink and yellow\u003c/i\u003e) found within an infected cell, cultured in the laboratory.\u003c/p\u003e \u003cp\u003eNIH-NIAID/IMAGE POINT FR/BSIP/Universal Images Group via Getty Images\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eYet another strain of the virus that causes mpox might be readily spreading from person to person, according to an analysis of the pathogen’s genome. This development could further complicate \u003ca href=\"https://www.nature.com/articles/d41586-024-03243-2\"\u003eefforts to halt the spread of the disease\u003c/a\u003e in Central Africa, which has seen a surge in infections over the past year. And it has left researchers scratching their heads over what is currently driving this surge.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe findings hint that the strain, called clade Ia, is spreading in a sustained fashion between people — possibly through sexual contact — in an outbreak in Kinshasa, the capital of the Democratic Republic of the Congo (DRC). Previously, the viral variant was known to transmit predominantly from animals to humans in Central Africa.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“We know that viruses evolve — we have seen it with Ebola, we have seen it with COVID and we expected to see it with mpox as well,” says Placide Mbala, head of epidemiology and global health at the National Institute of Biomedical Research in Kinshasa, who co-led the analysis. “We don’t know how far these adaptations can go, and we are gathering data to understand how this evolution is occurring.”\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe preliminary results, which have not yet been peer-reviewed, were \u003ca href=\"https://virological.org/t/apobec3-deaminase-editing-supports-human-to-human-transmission-in-escalating-mpox-outbreaks-of-both-clade-ia-and-ib-in-kinshasa-democratic-republic-of-the-congo-july-september-2024/982\"\u003eposted on 22 October\u003c/a\u003e to the genomic-epidemiology discussion forum Virological.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eMpox diversifies\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThere are four known variants of the monkeypox virus: clades Ia, Ib, IIa and IIb (see ‘Quick guide to the strains of monkeypox virus’). Historically, clade I viruses have appeared mostly in Central Africa, and clade II viruses have cropped up in West Africa.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis all changed in the mid-2010s, when a clade II strain sparked an outbreak in Nigeria. At the time, some researchers suggested \u003ca href=\"https://www.nature.com/articles/d41586-022-01686-z\"\u003ethat\u003c/a\u003e\u003ca href=\"https://www.nature.com/articles/d41586-022-01686-z\"\u003e the variant might be capable of transmission through sexual contact\u003c/a\u003e. Their insights proved prescient: a similar clade II strain, called IIb, \u003ca href=\"https://www.nature.com/articles/d41586-022-01421-8\"\u003esparked a global outbreak of mpox in 2022\u003c/a\u003e that has infected more than 90,000 people and continues today.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMeanwhile, clade I viruses have caused sporadic infections in people for more than 50 years — largely in rural regions of Central Africa. But in late 2023, researchers \u003ca href=\"https://www.nature.com/articles/d41586-024-01167-5\"\u003eidentified a rapidly growing outbreak\u003c/a\u003e in more densely populated, urban areas in eastern regions of the DRC that disproportionately affected sex workers, suggesting that this strain of the virus could, like IIb, spread readily between people.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eGenomic sequencing confirmed that the variant causing this outbreak contained several key differences from other clade I viruses, leading researchers to name it Ib. \u003ca href=\"https://www.nature.com/articles/d41586-024-02793-9\"\u003eThis strain\u003c/a\u003e has been detected in the United Kingdom, Sweden, Thailand, India, Germany and six African countries that had never reported mpox infections before. The DRC has been hit particularly hard: the country has reported nearly 36,000 suspected infections and more than 1,000 deaths from mpox in 2024.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut now — about one year after researchers detected an outbreak of clade Ib in eastern DRC — clade Ia is worrying health officials, too. The strain has also been on the rise in western regions of the DRC and in Kinshasa. In particular, having both Ia and Ib circulating in the capital city threatens the 17 million people living there and raises the possibility of clade I spreading internationally, given that Kinshasa is a travel hub.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eQuick guide to the strains of monkeypox virus\u003c/h2\u003e\u003cul data-block=\"sciam/list\"\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eClade Ia:\u003c/b\u003e a strain that has been spreading in Central Africa since the virus was first discovered to infect humans in 1970. Most infections have been in children, and it was known to mainly transmit from animal to human — until recently.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eClade Ib:\u003c/b\u003e the strain that has caused a surge of cases in Central Africa since its discovery in late 2023. Known to spread from person to person, including through sexual contact.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eClade IIa:\u003c/b\u003e the least-studied mpox strain. It has mainly spread in Guinea, Liberia and Côte d’Ivoire. Modes of transmission are not fully understood; there is no documented evidence of sexual transmission, but it is likely that all forms of close contact contribute to its spread.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eClade IIb:\u003c/b\u003e the strain responsible for the still-simmering 2022 global outbreak. Known to spread from person to person, including through sexual contact. Most affected population has been men who have sex with men.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch2 data-block=\"sciam/heading\"\u003eSigns of evolution\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHealth officials have been using genomic-sequencing tools to track the outbreak. As part of the effort, Mbala and his colleagues sequenced virus samples from infections in Kinshasa. In samples of both the clade Ia and Ib virus, they found a specific pattern of single-letter genetic mutations indicative of the ongoing battle between the human immune system and the virus — a pattern that would be unlikely to appear unless there was sustained human-to-human spread.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHowever, the pattern did not show up in a report posted to a preprint server in August. In that study, a team sequenced clade Ia virus samples collected between 2018 and 2024. That the researchers didn’t spot the pattern suggests that it might be a recent development. “We didn’t pick up on strong signs of evolution” in the more rural and endemic regions of the DRC, says Jason Kindrachuk, a virologist at the University of Manitoba in Winnipeg, Canada, who collaborates with Mbala and co-authored the August preprint as well as the Virological one. “But in Kinshasa, it seems that there is something unique going on.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eClade Ia might also have the ability to spread through sexual contact: researchers reported the first probable case of sexually transmitted clade I mpox last year, and another such publication is forthcoming, Kindrachuk says.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eGiven that clade I has been circulating between animals and people in the DRC since 1970, Kindrachuk adds that it will be important to investigate why clade Ib suddenly emerged in 2023, and why Ia has caused a surge in the number of detected infections in the past two years. “Is it because we’re better at surveillance, or because we’re more conscious of mpox at the community level? Is it because people have been moving around more after the [COVID-19] pandemic, or because there’s been a greater reliance on contact with wildlife?” he asks.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eFor now, plans to roll out the continent’s first doses of mpox vaccines are unlikely to change in light of these findings, says Nicaise Ndembi, a virologist at the Africa Centres for Disease Control and Prevention in Addis Ababa. Health officials have already been allocating doses to regions that have a higher number of infections, regardless of the specific strain found in the area, he says.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eThis article is reproduced with permission and was \u003c/i\u003e\u003ca href=\"https://www.nature.com/articles/d41586-024-03531-x\"\u003e\u003ci\u003efirst published\u003c/i\u003e\u003c/a\u003e\u003ci\u003e on October 30, 2024\u003c/i\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-01T17:00:00Z",
  "modifiedTime": null
}
