{
  "id": "7273efa3-6610-4ce6-af1c-d3ab5856c1d2",
  "title": "Weight-loss wonder drug Mounjaro/Zepbound shrinks breast cancer tumors",
  "link": "https://www.sciencedaily.com/releases/2025/07/250715043353.htm",
  "description": "A cutting-edge mouse study reveals that tirzepatide, the dual GLP-1/GIP drug already hailed for impressive weight loss, does more than trim fat: it slashes the growth of obesity-linked breast tumors. University of Michigan researchers found mice lost about 20 % body weight and adipose tissue while their tumors shrank in tandem, hinting that the blockbuster medication could one day double as a cancer-fighting ally for patients with obesity.",
  "author": "",
  "published": "Tue, 15 Jul 2025 04:33:53 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2499,
  "excerpt": "A cutting-edge mouse study reveals that tirzepatide, the dual GLP-1/GIP drug already hailed for impressive weight loss, does more than trim fat: it slashes the growth of obesity-linked breast tumors. University of Michigan researchers found mice lost about 20 % body weight and adipose tissue while their tumors shrank in tandem, hinting that the blockbuster medication could one day double as a cancer-fighting ally for patients with obesity.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "The anti-obesity medication tirzepatide, marketed as Mounjaro for diabetes and Zepbound for obesity, reduced obesity-associated breast cancer growth in a mouse model, according to a study presented at ENDO 2025, the Endocrine Society's annual meeting in San Francisco, California. \"Obesity is a significant risk factor for breast cancer, and while it is very preliminary data, our studies in mice suggest that these new anti-obesity drugs may be a way to reduce obesity-associated breast cancer risk or improve outcomes,\" said study author Amanda Kucinskas, B.S., a Ph.D. candidate in the labs of Drs. Erin Giles and Kanakadurga Singer at the University of Michigan in Ann Arbor, Mich. Existing research has shown that having obesity can lead to worse breast cancer outcomes compared to those who do not have obesity, and weight loss can improve outcomes. However, there are many challenges with traditional weight loss methods. Kucinskas and colleagues leveraged tirzepatide, one of a new class of effective anti-obesity medications that target GLP-1 (glucagon-like peptide 1) and GIP (glucose-dependent insulinotropic polypeptide) receptors. The researchers sought to learn whether or not tirzepatide would reduce obesity-associated breast cancer growth. This mouse study included 16 mice. The 9-week-old C57BL/6 mice were fed a 40% high-fat diet and housed in a warm environment to induce obesity. At 32 weeks of age, the mice with obesity were randomly assigned injections of tirzepatide or a placebo every other day for 16 weeks. Tumor volumes were measured twice weekly. The researchers found that the anti-obesity drug reduced body weight and body fat by approximately 20% in mice, similar to the amount of weight loss achieved by women on this drug. They found this was primarily due to a loss of adipose mass, with a reduction in adipose depot weights compared to controls. The anti-obesity drug also reduced tumor volume compared to the controls. At the end of the study, the researchers found that tumor volume was significantly correlated with body weight, total adipose mass and the amount of fat stored in the liver. \"While these are very preliminary results, they suggest that this new anti-obesity drug may also have a beneficial impact on breast cancer outcomes,\" Kucinskas said. Ongoing studies are underway in collaboration with Dr. Steve Hursting's lab at the University of North Carolina at Chapel Hill to separate the weight loss from the tumor-specific effects of tirzepatide.",
  "image": "https://www.sciencedaily.com/images/1920/zepbound-tirzepatide-injection-pen.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eThe anti-obesity medication tirzepatide, marketed as Mounjaro for diabetes and Zepbound for obesity, reduced obesity-associated breast cancer growth in a mouse model, according to a study presented at ENDO 2025, the Endocrine Society\u0026#39;s annual meeting in San Francisco, California.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;Obesity is a significant risk factor for breast cancer, and while it is very preliminary data, our studies in mice suggest that these new anti-obesity drugs may be a way to reduce obesity-associated breast cancer risk or improve outcomes,\u0026#34; said study author Amanda Kucinskas, B.S., a Ph.D. candidate in the labs of Drs. Erin Giles and Kanakadurga Singer at the University of Michigan in Ann Arbor, Mich.\u003c/p\u003e\n\u003cp\u003eExisting research has shown that having obesity can lead to worse breast cancer outcomes compared to those who do not have obesity, and weight loss can improve outcomes. However, there are many challenges with traditional weight loss methods.\u003c/p\u003e\n\u003cp\u003eKucinskas and colleagues leveraged tirzepatide, one of a new class of effective anti-obesity medications that target GLP-1 (glucagon-like peptide 1) and GIP (glucose-dependent insulinotropic polypeptide) receptors. The researchers sought to learn whether or not tirzepatide would reduce obesity-associated breast cancer growth.\u003c/p\u003e\n\u003cp\u003eThis mouse study included 16 mice. The 9-week-old C57BL/6 mice were fed a 40% high-fat diet and housed in a warm environment to induce obesity. At 32 weeks of age, the mice with obesity were randomly assigned injections of tirzepatide or a placebo every other day for 16 weeks. Tumor volumes were measured twice weekly.\u003c/p\u003e\n\u003cp\u003eThe researchers found that the anti-obesity drug reduced body weight and body fat by approximately 20% in mice, similar to the amount of weight loss achieved by women on this drug. They found this was primarily due to a loss of adipose mass, with a reduction in adipose depot weights compared to controls.\u003c/p\u003e\n\u003cp\u003eThe anti-obesity drug also reduced tumor volume compared to the controls. At the end of the study, the researchers found that tumor volume was significantly correlated with body weight, total adipose mass and the amount of fat stored in the liver.\u003c/p\u003e\n\u003cp\u003e\u0026#34;While these are very preliminary results, they suggest that this new anti-obesity drug may also have a beneficial impact on breast cancer outcomes,\u0026#34; Kucinskas said.\u003c/p\u003e\n\u003cp\u003eOngoing studies are underway in collaboration with Dr. Steve Hursting\u0026#39;s lab at the University of North Carolina at Chapel Hill to separate the weight loss from the tumor-specific effects of tirzepatide.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
