{
  "id": "8248ec6b-ea93-4daa-8086-6412b93ec829",
  "title": "Why Is It So Tricky to Show the Sun, Earth, and Moon in a Diagram?",
  "link": "https://www.wired.com/story/why-is-it-so-tricky-to-show-the-sun-earth-and-moon-in-a-diagram/",
  "description": "In a nutshell, you can get the distances or the sizes right, but not both. Space is hard!",
  "author": "Rhett Allain",
  "published": "Fri, 22 Nov 2024 14:00:00 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Science / Physics and Math",
    "Dot Physics"
  ],
  "byline": "Rhett Allain",
  "length": 8577,
  "excerpt": "In a nutshell, you can get the distances or the sizes right, but not both. Space is hard!",
  "siteName": "WIRED",
  "favicon": "",
  "text": "Earth, sun, moon: three objects in space whose interactions have a pretty big impact on our lives. Earth orbits the sun once a year, and it rotates on its axis about once a day (depending on your definition of “rotate”). This gives us the night-day sequence and the yearly cycle of the seasons.The moon's gravitational tug influences the tides. On a monthly cycle, we can also see the phases of the moon, which are caused by the relative positions of these three orbs. A full moon makes it possible to see at night. Before electric lights, this was a big deal.You can see how these interactions structure our whole idea of time. So if you were writing a science textbook, you'd want to include an illustration of the Earth-sun-moon system, right? But guess what, you can't. The distances and differences in size make it practically impossible.Let's say we want to build a model of the sun and Earth alone. Earth has a radius of about 6,371 kilometers (3,959 miles), but let's represent this with a marble 1 centimeter in diameter. To keep things in scale, I'd have to use a giant beach ball for the sun—the kind people knock around at rock concerts—more than a meter in diameter. You could fit 1.3 million marbles into it.But wait! It gets worse. That beach ball would also have to be 117 meters away. That's longer than a football field. Now try to take a picture of the ball and the marble. Good luck with that.Modeling the Earth and moon would be easier. If we use that marble for the moon, Earth would be a tennis ball, with a diameter of 6.7 centimeters. Now for the fun part. How far apart do you think we should put them? Take a guess. You'll probably be wrong because we never see the Earth and moon together. The answer is 2 meters. Here's what that would look like:Illustration: Rhett AllainThat marble moon is so small I had to put an arrow over it for you. So here's what it comes down to: If you want to show the Earth-sun-moon system, you'd seem to have two options. You could show them at their correct size, but not in their correct locations. Here's what that looks like.Illustration: Rhett AllainOr you could try putting everything in the right place but enlarge the small ones so they're visible. Alas, that's impossible. If you make Earth big enough to see in that 117-meter-wide photo, it will overlap the position of the moon. This means the moon at the right location would be inside the oversize Earth. That's why you won't find an accurate illustration of the Earth-sun-moon system in any textbook.Does the Moon Orbit the Earth or the Sun? Or Both?This is a fun question to pop on your family at the dinner table. It's confusing, right? If the moon is going around Earth while Earth is going around the sun, does this mean the moon is making circles in circles? Seems reasonable. In fact, you might see a diagram that looks something like this:Gif: Rhett AllainPlease don't put this in your textbook! First, it's wrong—and second, how would you put a GIF in a paper-based book? I guess you could make one of those books that animate an image as you flip the pages.That would be cool, but it's just not correct. The problem again is the size of things. In my animation, not only are the objects too big but the orbital radius of the moon around Earth is way too big. I had to supermagnify the trajectories so you could see everything.In order to really understand what's going on, we need to look at the physics of a circular orbit.Circular OrbitsLet's start with the definition of acceleration. As shown in the equation below, we can say that the acceleration (a) tells us how quickly the velocity (v) changes with time.See those arrows over a and v? They indicate that these are vectors, not just simple numbers. Vectors have a specific direction. So two balls moving at the same speed in different directions have different velocities.Got that? Now, if you have an object moving in a circular path, then the direction—and thus the velocity—is constantly changing. We call that centripetal acceleration. The direction of this acceleration points toward the center, and its magnitude depends on the radius of the circle (r) and the speed (v):But what causes an object to accelerate? Answer: a force. From Newton's second law, the total force on an object equals mass times acceleration. If you think about Earth moving around the sun, there is an attractive gravitational interaction between the two objects. This gravitational force (FG) depends on the mass of the Earth (mE) and the sun (MS), as well as the distance between them (r). Oh, G is the universal gravitational constant:Putting the gravitational force together with the centripetal acceleration (using Newton's second law), we get the following relationship:This means that if we know the distance from Earth to the sun, we can calculate the velocity of the Earth that will give it a circular orbit. (OK, Earth's orbit is not a perfect circle, but it's close enough for our purposes here.)But what about the moon? There is a gravitational interaction between the moon and Earth, but there's also one between the moon and the sun. Which is stronger?Let's calculate the acceleration the moon would have if it only interacted with the sun. For distance we can just use the distance from Earth to the sun—it's essentially the same. (Have you not been paying attention?) Using the known values, I get an acceleration due to the sun with a value of 5.9 millimeters per second squared.Now let's imagine the moon only interacts with Earth. Recalculating, I get an acceleration of the moon of 2.7 millimeters per second squared. So when the moon interacts with both the Earth and the sun, the solar interaction is stronger. Of course, the motion of the moon depends on the sum of these forces. Look at this diagram of the moon on opposite sides of the Earth:Illustration: Rhett AllainOn the far side of Earth, the gravitational force from both Earth and the sun are in the same direction. This net force will make the moon move in a circular-ish path around the sun. On the sunny side of Earth, the forces are in opposite directions. However, the solar force is greater, so the net force is still toward the sun. So the moon is moving in a circular path with the center being the sun.OK, let's go back to that wrong (but common) diagram showing the path of the moon as it orbits the sun. Notice that at some points the moon is curving toward the sun and sometimes it's curving away. Well, in order to curve away from the sun, the net force would also have to be away from the sun. Guess what? I just showed that never happens. Because the gravitational interaction between the sun and moon is greater than that between the moon and Earth, the net force always points toward the sun. That means the moon is always moving in some type of path that always curves toward the sun.Is that really true? Yup. Look, I can prove it. Here's a plot of the trajectories of the Earth and moon as they orbit the sun over the course of half a month. The blue curve is the path of the Earth going from left to right, and the red represents the moon.Graph: Rhett AllainHere, position is measured in astronomical units (AU), which was originally defined as the average distance from the sun to Earth. The trajectories look flattened because I had to use different scales on the two axes, for reasons we already talked about. Trust me, it's a circular orbit.Now let's look at the path of the moon. First, notice that in this half-month the moon starts on the far side of the Earth and ends up closer to the sun (that's half an orbit around Earth). Second, at no point does the moon's path bend away from the sun. In fact, it's always accelerating toward the sun. And that's because the sun's gravitational force is stronger than the Earth's.So, again: Does the moon orbit the sun or the Earth? The answer is yes—it orbits both. While the moon moves around the sun, it also moves around the Earth. And it circles the Earth without curving away from the sun! That's sort of hard to picture in your head, and the bad news is that we can't draw an accurate diagram as an aid to understanding.The whole problem is that, on the scale of the solar system, the Earth and moon are so close together that you can't see their relative motion. But I'm sure textbook authors will keep trying.Finally, for those who still think Earth and humanity are the center of the cosmos, chew on this: If our planet were to suddenly vanish from existence, the moon would just keep going, circling the sun once a year. It wouldn't even miss us.",
  "image": "https://media.wired.com/photos/673f0885af5b1e55ad3e074f/191:100/w_1280,c_limit/GettyImages-669345978.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eEarth, sun, moon: three objects in space whose interactions have a pretty big impact on our lives. Earth orbits the sun once a year, and it rotates on its axis about once a day (depending on your definition of “rotate”). This gives us the night-day sequence and the yearly cycle of the seasons.\u003c/p\u003e\u003cp\u003eThe moon\u0026#39;s gravitational tug influences the tides. On a monthly cycle, we can also see the phases of the moon, which are caused by the relative positions of these three orbs. A full moon makes it possible to see at night. Before electric lights, this was a big deal.\u003c/p\u003e\u003cp\u003eYou can see how these interactions structure our whole idea of time. So if you were writing a science textbook, you\u0026#39;d want to include an illustration of the Earth-sun-moon system, right? But guess what, you can\u0026#39;t. The distances and differences in size make it practically impossible.\u003c/p\u003e\u003cp\u003eLet\u0026#39;s say we want to build a model of the sun and Earth alone. Earth has a radius of about 6,371 kilometers (3,959 miles), but let\u0026#39;s represent this with a marble 1 centimeter in diameter. To keep things in scale, I\u0026#39;d have to use a giant beach ball for the sun—the kind people knock around at rock concerts—more than a meter in diameter. You could fit 1.3 million marbles into it.\u003c/p\u003e\u003cp\u003eBut wait! It gets worse. That beach ball would also have to be 117 meters away. That\u0026#39;s longer than a football field. Now try to take a picture of the ball and the marble. Good luck with that.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eModeling the Earth and moon would be easier. If we use that marble for the moon, Earth would be a tennis ball, with a diameter of 6.7 centimeters. Now for the fun part. How far apart do you think we should put them? Take a guess. You\u0026#39;ll probably be wrong because we never see the Earth and moon together. The answer is 2 meters. Here\u0026#39;s what that would look like:\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eIllustration: Rhett Allain\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThat marble moon is so small I had to put an arrow over it for you. So here\u0026#39;s what it comes down to: If you want to show the Earth-sun-moon system, you\u0026#39;d seem to have two options. You could show them at their correct size, but not in their correct locations. Here\u0026#39;s what that looks like.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eIllustration: Rhett Allain\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOr you could try putting everything in the right place but enlarge the small ones so they\u0026#39;re visible. Alas, that\u0026#39;s impossible. If you make Earth big enough to see in that 117-meter-wide photo, it will overlap the position of the moon. This means the moon at the right location would be inside the oversize Earth. That\u0026#39;s why you won\u0026#39;t find an accurate illustration of the Earth-sun-moon system in any textbook.\u003c/p\u003e\u003ch2\u003eDoes the Moon Orbit the Earth or the Sun? Or Both?\u003c/h2\u003e\u003cp\u003eThis is a fun question to pop on your family at the dinner table. It\u0026#39;s confusing, right? If the moon is going around Earth while Earth is going around the sun, does this mean the moon is making circles in circles? Seems reasonable. In fact, you might see a diagram that looks something like this:\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eGif: Rhett Allain\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003ePlease don\u0026#39;t put this in your textbook! First, it\u0026#39;s wrong—and second, how would you put a GIF in a paper-based book? I guess you could make one of those books that animate an image as you flip the pages.\u003c/p\u003e\u003cp\u003eThat would be cool, but it\u0026#39;s just not correct. The problem again is the size of things. In my animation, not only are the objects too big but the orbital radius of the moon around Earth is \u003cem\u003eway\u003c/em\u003e too big. I had to supermagnify the trajectories so you could see everything.\u003c/p\u003e\u003cp\u003eIn order to really understand what\u0026#39;s going on, we need to look at the physics of a circular orbit.\u003c/p\u003e\u003ch2\u003eCircular Orbits\u003c/h2\u003e\u003cp\u003eLet\u0026#39;s start with the definition of acceleration. As shown in the equation below, we can say that the acceleration (\u003cstrong\u003ea\u003c/strong\u003e) tells us how quickly the velocity (\u003cstrong\u003ev\u003c/strong\u003e) changes with time.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eSee those arrows over \u003cstrong\u003ea\u003c/strong\u003e and \u003cstrong\u003ev\u003c/strong\u003e? They indicate that these are vectors, not just simple numbers. Vectors have a specific direction. So two balls moving at the same speed in different directions have different velocities.\u003c/p\u003e\u003cp\u003eGot that? Now, if you have an object moving in a circular path, then the direction—and thus the velocity—is constantly changing. We call that \u003cem\u003ecentripetal acceleration\u003c/em\u003e. The direction of this acceleration points toward the center, and its magnitude depends on the radius of the circle (\u003cstrong\u003er\u003c/strong\u003e) and the speed (\u003cstrong\u003ev\u003c/strong\u003e):\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eBut what causes an object to accelerate? Answer: a force. From Newton\u0026#39;s second law, the total force on an object equals mass times acceleration. If you think about Earth moving around the sun, there is an attractive gravitational interaction between the two objects. This gravitational force (\u003cstrong\u003eF\u003csub\u003eG\u003c/sub\u003e\u003c/strong\u003e) depends on the mass of the Earth (\u003cstrong\u003em\u003csub\u003eE\u003c/sub\u003e\u003c/strong\u003e) and the sun (\u003cstrong\u003eM\u003csub\u003eS\u003c/sub\u003e\u003c/strong\u003e), as well as the distance between them (\u003cstrong\u003er\u003c/strong\u003e). Oh, \u003cstrong\u003eG\u003c/strong\u003e is the universal gravitational constant:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003ePutting the gravitational force together with the centripetal acceleration (using Newton\u0026#39;s second law), we get the following relationship:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThis means that if we know the distance from Earth to the sun, we can calculate the velocity of the Earth that will give it a circular orbit. (OK, Earth\u0026#39;s orbit is not a perfect circle, but it\u0026#39;s close enough for our purposes here.)\u003c/p\u003e\u003cp\u003eBut what about the moon? There is a gravitational interaction between the moon and Earth, but there\u0026#39;s also one between the moon and the sun. Which is stronger?\u003c/p\u003e\u003cp\u003eLet\u0026#39;s calculate the acceleration the moon would have if it only interacted with the sun. For distance we can just use the distance from Earth to the sun—it\u0026#39;s essentially the same. (Have you not been paying attention?) Using the known values, I get an acceleration due to the sun with a value of 5.9 millimeters per second squared.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eNow let\u0026#39;s imagine the moon only interacts with Earth. Recalculating, I get an acceleration of the moon of 2.7 millimeters per second squared. So when the moon interacts with \u003cem\u003eboth\u003c/em\u003e the Earth and the sun, the solar interaction is stronger. Of course, the motion of the moon depends on the sum of these forces. Look at this diagram of the moon on opposite sides of the Earth:\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eIllustration: Rhett Allain\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOn the far side of Earth, the gravitational force from both Earth and the sun are in the same direction. This net force will make the moon move in a circular-ish path around the sun. On the sunny side of Earth, the forces are in opposite directions. However, the solar force is greater, so the net force is still toward the sun. So the moon is moving in a circular path with the center being the sun.\u003c/p\u003e\u003cp\u003eOK, let\u0026#39;s go back to that wrong (but common) diagram showing the path of the moon as it orbits the sun. Notice that at some points the moon is curving toward the sun and sometimes it\u0026#39;s curving away. Well, in order to curve \u003cem\u003eaway\u003c/em\u003e from the sun, the net force would also have to be away from the sun. Guess what? I just showed that \u003cem\u003enever happens\u003c/em\u003e. Because the gravitational interaction between the sun and moon is greater than that between the moon and Earth, the net force \u003cem\u003ealways\u003c/em\u003e points toward the sun. That means the moon is always moving in some type of path that always curves toward the sun.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIs that really true? Yup. Look, I can prove it. Here\u0026#39;s a plot of the trajectories of the Earth and moon as they orbit the sun over the course of half a month. The blue curve is the path of the Earth going from left to right, and the red represents the moon.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eGraph: Rhett Allain\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eHere, position is measured in astronomical units (AU), which was originally defined as the average distance from the sun to Earth. The trajectories look flattened because I had to use different scales on the two axes, for reasons we already talked about. Trust me, it\u0026#39;s a circular orbit.\u003c/p\u003e\u003cp\u003eNow let\u0026#39;s look at the path of the moon. First, notice that in this half-month the moon starts on the far side of the Earth and ends up closer to the sun (that\u0026#39;s half an orbit around Earth). Second, at no point does the moon\u0026#39;s path bend away from the sun. In fact, it\u0026#39;s always accelerating \u003cem\u003etoward\u003c/em\u003e the sun. And that\u0026#39;s because the sun\u0026#39;s gravitational force is stronger than the Earth\u0026#39;s.\u003c/p\u003e\u003cp\u003eSo, again: Does the moon orbit the sun or the Earth? The answer is yes—it orbits both. While the moon moves around the sun, it also moves around the Earth. And it circles the Earth without curving away from the sun! That\u0026#39;s sort of hard to picture in your head, and the bad news is that we can\u0026#39;t draw an accurate diagram as an aid to understanding.\u003c/p\u003e\u003cp\u003eThe whole problem is that, on the scale of the solar system, the Earth and moon are so close together that you can\u0026#39;t see their relative motion. But I\u0026#39;m sure textbook authors will keep trying.\u003c/p\u003e\u003cp\u003eFinally, for those who still think Earth and humanity are the center of the cosmos, chew on this: If our planet were to suddenly vanish from existence, the moon would just keep going, circling the sun once a year. It wouldn\u0026#39;t even miss us.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-22T09:00:00-05:00",
  "modifiedTime": "2024-11-22T14:00:00Z"
}
