{
  "id": "9212f531-d7b1-494c-8280-8378da8903d6",
  "title": "Optical biosensor rapidly detects mpox virus",
  "link": "https://www.sciencedaily.com/releases/2024/11/241114161042.htm",
  "description": "Researchers have developed an optical biosensor that detects the virus that causes mpox. The technology could make diagnosis much faster and cost-effective as the disease continues to spread worldwide.",
  "author": "",
  "published": "Thu, 14 Nov 2024 16:10:42 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 5799,
  "excerpt": "Researchers have developed an optical biosensor that detects the virus that causes mpox. The technology could make diagnosis much faster and cost-effective as the disease continues to spread worldwide.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A new variant of human mpox has claimed the lives of approximately 5% of people with reported infections in the Democratic Republic of the Congo since 2023, many of them children. Since then, it has spread to several other countries. The World Health Organization declared the outbreak a Public Health Emergency of International Concern on August 14. In addition, a different but rarely fatal mpox variant was responsible for an outbreak that has spread to more than 100 countries since 2022. There is an urgent need for faster and more cost-effective diagnostic tools to curb the spread of mpox and to prepare for the possibility of a future global pandemic. Researchers from University of California School of Medicine, Boston University, and their colleagues have now developed an optical biosensor that can rapidly detect monkeypox, the virus that causes mpox. The technology could allow clinicians to diagnose the disease at the point of care rather than wait for lab results. The study was published on November 14, 2024 in Biosensors and Bioelectronics. In the clinic, mpox symptoms such as fever, pain, rashes and lesions resemble those of many other viral infections, says Partha Ray, an associate project scientist at UC San Diego School of Medicine and co-principal investigator on the study. \"So just by looking at the patient, it is not easy for clinicians to distinguish monkeypox from these other diseases.\" What's more, polymerase chain reaction (PCR) is currently the only approved method of diagnosing mpox. It is expensive, requires a laboratory, and can take days or weeks to get results. \"A deadly combination when there is a fast-spreading epidemic or pandemic,\" said Ray. The search for a better molecular diagnostic for mpox draws on more than 10 years of research in the lab of Selim Ünlü, a distinguished professor of engineering at Boston University (BU) and co-principal investigator on the study. The lab has developed optical biosensors for detecting the viruses that cause Ebola hemorrhagic fever and COVID-19, among others. Ray's team at UC San Diego collaborated with Ünlü's lab, providing biological expertise and authenticated samples to Ünlü's engineering team. The study, led by first author Mete Aslan, a Ph.D. student in electrical and electronics engineering at BU, used a digital detection platform called Pixel-Diversity interferometric reflectance imaging sensor, or PD-IRIS, to detect the virus. The researchers used samples collected from the lesions of a patient at UC San Diego Health with laboratory-confirmed mpox. They briefly incubated the samples with monoclonal monkeypox antibodies provided by Ray's lab that bind to proteins on the surface of the virus. The virus-antibody complex was then transferred into tiny chambers on the surface of silicon chips on the sensor that were treated to fix these nanoparticles. Shining precise wavelengths of red and blue light simultaneously on the chips caused interference, which resulted in slightly different responses when the virus-antibody nanoparticles were present. A color camera was used to detect this small signal and count individual particles with high sensitivity. \"You're not trying to see the scattered light from the virus particle itself, but you're looking at the interferometric signature of the field of scattered light mixed with the field that is reflected from the surface of the chip,\" said Ünlü. He likens the process to FM radio, which mixes a weak signal containing information with a more powerful carrier signal at the same frequency, which, in turn, amplifies the weak signal. The scientists also analyzed herpes simplex virus and cowpox virus samples, which have similar clinical presentations to mpox. The biosensor assay easily discriminated mpox samples from these other viruses, demonstrating that the specificity of the assay is essential for distinguishing mpox from these common viral diseases. \"Within two minutes, we can tell whether someone has monkeypox or not,\" said Ray. \"From collecting the virus samples to getting the real-time data takes around 20 minutes.\" In the clinic, the rapidity of the test would allow healthcare providers to diagnose mpox cases much more quickly than sending samples out to a lab. This is especially important for slowing community spread in countries where healthcare resources are sparse. Clinicians could also start treatment, if available, more quickly. Ray envisions the tests being mass-produced as kits and sold to clinics, further reducing costs. A single boxed kit could be used to test for a variety of viruses, such as syphilis or HIV. \"The chip would be the same,\" said Ray. \"The only thing that would be different here is the binding antibody that would be specific for a particular virus.\" Ray and Ünlü are working together toward the goal of commercialization, not only to address the urgent need for rapid mpox tests in the Democratic Republic of the Congo but also to keep outbreaks from turning into pandemics. However, the researchers say this effort will require government support because there is little market for diagnostics addressing future threats. \"If we don't take care of this particular epidemic right now, it is not going to be limited within Africa,\" said Ray. Additional co-authors on the study include: Howard Brickner, Alex E. Clark, Aaron F. Carlin, UC San Diego; Elif Seymour, iRiS Kinetics, Boston University Business Incubation Center; Michael B. Townsend, Panayampalli S. Satheshkumar, Centers for Disease Control and Prevention; Iris Celebi, Boston University; Megan Riley, axiVEND. The study was funded, in part, by the National Institute of Allergy and Infectious Diseases at the National Institutes of Health (P30 AI036214), and the National Science Foundation (NSF-TT PFI 2329817).",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA new variant of human mpox has claimed the lives of approximately 5% of people with reported infections in the Democratic Republic of the Congo since 2023, many of them children. Since then, it has spread to several other countries. The World Health Organization declared the outbreak a Public Health Emergency of International Concern on August 14. In addition, a different but rarely fatal mpox variant was responsible for an outbreak that has spread to more than 100 countries since 2022.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThere is an urgent need for faster and more cost-effective diagnostic tools to curb the spread of mpox and to prepare for the possibility of a future global pandemic. Researchers from University of California School of Medicine, Boston University, and their colleagues have now developed an optical biosensor that can rapidly detect monkeypox, the virus that causes mpox. The technology could allow clinicians to diagnose the disease at the point of care rather than wait for lab results. The study was published on November 14, 2024 in \u003cem\u003eBiosensors and Bioelectronics\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eIn the clinic, mpox symptoms such as fever, pain, rashes and lesions resemble those of many other viral infections, says Partha Ray, an associate project scientist at UC San Diego School of Medicine and co-principal investigator on the study. \u0026#34;So just by looking at the patient, it is not easy for clinicians to distinguish monkeypox from these other diseases.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s more, polymerase chain reaction (PCR) is currently the only approved method of diagnosing mpox. It is expensive, requires a laboratory, and can take days or weeks to get results. \u0026#34;A deadly combination when there is a fast-spreading epidemic or pandemic,\u0026#34; said Ray.\u003c/p\u003e\n\u003cp\u003eThe search for a better molecular diagnostic for mpox draws on more than 10 years of research in the lab of Selim Ünlü, a distinguished professor of engineering at Boston University (BU) and co-principal investigator on the study. The lab has developed optical biosensors for detecting the viruses that cause Ebola hemorrhagic fever and COVID-19, among others. Ray\u0026#39;s team at UC San Diego collaborated with Ünlü\u0026#39;s lab, providing biological expertise and authenticated samples to Ünlü\u0026#39;s engineering team.\u003c/p\u003e\n\u003cp\u003eThe study, led by first author Mete Aslan, a Ph.D. student in electrical and electronics engineering at BU, used a digital detection platform called Pixel-Diversity interferometric reflectance imaging sensor, or PD-IRIS, to detect the virus.\u003c/p\u003e\n\u003cp\u003eThe researchers used samples collected from the lesions of a patient at UC San Diego Health with laboratory-confirmed mpox. They briefly incubated the samples with monoclonal monkeypox antibodies provided by Ray\u0026#39;s lab that bind to proteins on the surface of the virus. The virus-antibody complex was then transferred into tiny chambers on the surface of silicon chips on the sensor that were treated to fix these nanoparticles.\u003c/p\u003e\n\n\n\u003cp\u003eShining precise wavelengths of red and blue light simultaneously on the chips caused interference, which resulted in slightly different responses when the virus-antibody nanoparticles were present. A color camera was used to detect this small signal and count individual particles with high sensitivity.\u003c/p\u003e\n\u003cp\u003e\u0026#34;You\u0026#39;re not trying to see the scattered light from the virus particle itself, but you\u0026#39;re looking at the interferometric signature of the field of scattered light mixed with the field that is reflected from the surface of the chip,\u0026#34; said Ünlü. He likens the process to FM radio, which mixes a weak signal containing information with a more powerful carrier signal at the same frequency, which, in turn, amplifies the weak signal.\u003c/p\u003e\n\u003cp\u003eThe scientists also analyzed herpes simplex virus and cowpox virus samples, which have similar clinical presentations to mpox. The biosensor assay easily discriminated mpox samples from these other viruses, demonstrating that the specificity of the assay is essential for distinguishing mpox from these common viral diseases.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Within two minutes, we can tell whether someone has monkeypox or not,\u0026#34; said Ray. \u0026#34;From collecting the virus samples to getting the real-time data takes around 20 minutes.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn the clinic, the rapidity of the test would allow healthcare providers to diagnose mpox cases much more quickly than sending samples out to a lab. This is especially important for slowing community spread in countries where healthcare resources are sparse. Clinicians could also start treatment, if available, more quickly.\u003c/p\u003e\n\u003cp\u003eRay envisions the tests being mass-produced as kits and sold to clinics, further reducing costs. A single boxed kit could be used to test for a variety of viruses, such as syphilis or HIV.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;The chip would be the same,\u0026#34; said Ray. \u0026#34;The only thing that would be different here is the binding antibody that would be specific for a particular virus.\u0026#34;\u003c/p\u003e\n\u003cp\u003eRay and Ünlü are working together toward the goal of commercialization, not only to address the urgent need for rapid mpox tests in the Democratic Republic of the Congo but also to keep outbreaks from turning into pandemics. However, the researchers say this effort will require government support because there is little market for diagnostics addressing future threats.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If we don\u0026#39;t take care of this particular epidemic right now, it is not going to be limited within Africa,\u0026#34; said Ray.\u003c/p\u003e\n\u003cp\u003eAdditional co-authors on the study include: Howard Brickner, Alex E. Clark, Aaron F. Carlin, UC San Diego; Elif Seymour, iRiS Kinetics, Boston University Business Incubation Center; Michael B. Townsend, Panayampalli S. Satheshkumar, Centers for Disease Control and Prevention; Iris Celebi, Boston University; Megan Riley, axiVEND.\u003c/p\u003e\n\u003cp\u003eThe study was funded, in part, by the National Institute of Allergy and Infectious Diseases at the National Institutes of Health (P30 AI036214), and the National Science Foundation (NSF-TT PFI 2329817).\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
