{
  "id": "974dc68d-9c09-45e7-a4f3-569177a0f855",
  "title": "US students 'race' sperm in reproductive health stunt",
  "link": "https://phys.org/news/2025-04-students-sperm-reproductive-health-stunt.html",
  "description": "A commentator yells excitedly as hundreds of spectators stand glued to a video of a racecourse—but the athletes they are rooting for are actually tiny sperm cells.",
  "author": "",
  "published": "Sat, 26 Apr 2025 14:39:33 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Other"
  ],
  "byline": "Science X",
  "length": 3527,
  "excerpt": "A commentator yells excitedly as hundreds of spectators stand glued to a video of a racecourse—but the athletes they are rooting for are actually tiny sperm cells.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: CC0 Public Domain A commentator yells excitedly as hundreds of spectators stand glued to a video of a racecourse—but the athletes they are rooting for are actually tiny sperm cells. The unusual sport was invented by 17-year-old high schooler Eric Zhu, who raised over a million dollars to organize the event to call attention to male infertility. Zhu said he was inspired by social media posts that claim average sperm counts had halved over the past 50 years. Fearing that \"there could be this dystopian future where no one will be able to make babies,\" Zhu said he wanted to use the competition to highlight the importance of reproductive health. Scientists have not reached a consensus on whether humanity has experienced a dramatic drop in sperm count, with studies showing conflicting results. At the Los Angeles event on Friday night, a man in a lab coat used pipettes to place samples of semen—collected from contestants ahead of time—onto tiny two-millimeter-long \"tracks.\" The race track was magnified 100 times by a microscope, then filmed by a camera that transferred the image to a 3D animation software before the final video was broadcast to the audience. \"There's no way to really tell if this is real, but I want to believe it is,\" Felix Escobar, a 20-year-old spectator, told AFP. At the end of the brief race, the loser, 19-year-old University of California student Asher Proeger, was sprayed with a liquid resembling semen. 'Not Elon Musk' Zhu's fears about fertility echo the talking points of many in the burgeoning pro-natalist movement, which include conservative and far-right political figures. But Zhu distanced himself from the movement. \"I have nothing to do with this, I'm not like an Elon Musk, who wants to repopulate Earth,\" the young entrepreneur told AFP. Musk, a close ally of US President Donald Trump, has been vocal about his belief that population decline threatens the West and has fathered over a dozen children with multiple women. Zhu insisted he simply wanted to raise awareness of how sperm quality goes hand in hand with overall health. \"It's your choice to sleep earlier. It's your choice to stop doing drugs. It's your choice to eat healthier, and all these different things have a significant kind of impact on your motility,\" Zhu said. Shanna Swan, a reproductive epidemiologist at Mount Sinai's Icahn School of Medicine, co-authored a study that found the sperm count decline cited by Zhu. She said the proliferation of \"hormonally active chemicals\" in recent years has had a negative impact on human fertility. But beneath the scientific veneer, the sperm race may seem more like an opportunity for college students to display their adolescent humor and participate in a viral stunt. Some attendees dressed in costumes, including one resembling male genitals, while the hosts made lewd jokes and roasted the competitors. A YouTube livestream of the event attracted over 100,000 views. \"I can't say I learned stuff I didn't know before,\" 22-year-old student and audience member Alberto Avila-Baca told AFP. © 2025 AFP",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2018/spermcells.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i769585\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2018/spermcells.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2018/spermcells.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2018/spermcells.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2018/spermcells.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2018/spermcells.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2018/spermcells.jpg\" width=\"800\" height=\"530\" alt=\"sperm cells\" title=\"Credit: CC0 Public Domain\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eA commentator yells excitedly as hundreds of spectators stand glued to a video of a racecourse—but the athletes they are rooting for are actually tiny sperm cells.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eThe unusual sport was invented by 17-year-old high schooler Eric Zhu, who raised over a million dollars to organize the event to call attention to male infertility.\u003c/p\u003e\n\u003cp\u003eZhu said he was inspired by social media posts that claim average \u003ca href=\"https://phys.org/tags/sperm/\" rel=\"tag\"\u003esperm\u003c/a\u003e counts had halved over the past 50 years.\u003c/p\u003e\n\u003cp\u003eFearing that \u0026#34;there could be this dystopian future where no one will be able to make babies,\u0026#34; Zhu said he wanted to use the competition to highlight the importance of reproductive health.\u003c/p\u003e\n\u003cp\u003eScientists have not reached a consensus on whether humanity has experienced a dramatic drop in sperm count, with studies showing conflicting results.\u003c/p\u003e\n\u003cp\u003eAt the Los Angeles event on Friday night, a man in a lab coat used pipettes to place samples of semen—collected from contestants ahead of time—onto tiny two-millimeter-long \u0026#34;tracks.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe race track was magnified 100 times by a microscope, then filmed by a camera that transferred the image to a 3D animation software before the final video was broadcast to the audience.\u003c/p\u003e\n\u003cp\u003e\u0026#34;There\u0026#39;s no way to really tell if this is real, but I want to believe it is,\u0026#34; Felix Escobar, a 20-year-old spectator, told AFP.\u003c/p\u003e\n\u003cp\u003eAt the end of the brief race, the loser, 19-year-old University of California student Asher Proeger, was sprayed with a liquid resembling semen.\u003c/p\u003e\n\u003ch2\u003e\u0026#39;Not Elon Musk\u0026#39;\u003c/h2\u003e\n\u003cp\u003eZhu\u0026#39;s fears about fertility echo the talking points of many in the burgeoning pro-natalist movement, which include conservative and far-right political figures.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eBut Zhu distanced himself from the movement.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I have nothing to do with this, I\u0026#39;m not like an Elon Musk, who wants to repopulate Earth,\u0026#34; the young entrepreneur told AFP.\u003c/p\u003e\n\u003cp\u003eMusk, a close ally of US President Donald Trump, has been vocal about his belief that \u003ca href=\"https://phys.org/tags/population+decline/\" rel=\"tag\"\u003epopulation decline\u003c/a\u003e threatens the West and has fathered over a dozen children with multiple women.\u003c/p\u003e\n\u003cp\u003eZhu insisted he simply wanted to raise awareness of how sperm quality goes hand in hand with overall health.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s your choice to sleep earlier. It\u0026#39;s your choice to stop doing drugs. It\u0026#39;s your choice to eat healthier, and all these different things have a significant kind of impact on your motility,\u0026#34; Zhu said.\u003c/p\u003e\n\u003cp\u003eShanna Swan, a reproductive epidemiologist at Mount Sinai\u0026#39;s Icahn School of Medicine, co-authored a study that found the sperm count decline cited by Zhu.\u003c/p\u003e\n\u003cp\u003eShe said the proliferation of \u0026#34;hormonally active chemicals\u0026#34; in recent years has had a negative impact on human fertility.\u003c/p\u003e\n\u003cp\u003eBut beneath the scientific veneer, the sperm race may seem more like an opportunity for \u003ca href=\"https://phys.org/tags/college+students/\" rel=\"tag\"\u003ecollege students\u003c/a\u003e to display their adolescent humor and participate in a viral stunt.\u003c/p\u003e\n\u003cp\u003eSome attendees dressed in costumes, including one resembling male genitals, while the hosts made lewd jokes and roasted the competitors.\u003c/p\u003e\n\u003cp\u003eA YouTube livestream of the event attracted over 100,000 views.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I can\u0026#39;t say I learned stuff I didn\u0026#39;t know before,\u0026#34; 22-year-old student and audience member Alberto Avila-Baca told AFP.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                \n\n                                    \u003cp\u003e© 2025 AFP\u003c/p\u003e\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-26T14:39:33-04:00",
  "modifiedTime": null
}
