{
  "id": "9b00ddac-e2ff-4f49-9bbf-88746a98a80b",
  "title": "Quantum Birds",
  "link": "https://www.wnycstudios.org/podcasts/radiolab/projects/podcasts",
  "description": "Annie McEwen went to a mountain in Pennsylvania to help catch some migratory owls. Then Scott Weidensaul peeled back the owl’s feathery face disc, so that she could look at the back of its eyeball. No owls were harmed in the process, but this brief glimpse into the inner workings of a bird sent her off on a journey to a place where fleshy animal business bumps into the mathematics of subatomic particles. With help from Henrik Mouristen, we hear how one of the biggest mysteries in biology might finally find an answer in the weird world of quantum mechanics, where the classical rules of space and time are upended, and electrons dance to the beat of an enormous invisible force field that surrounds our planet.A very special thanks to Rosy Tucker, Eric Snyder, Holly Merker, and Seth Benz at the Hog Island Audubon Camp. Thank you to the owl-tagging volunteers Chris Bortz, Cassie Bortz, and Cheryl Faust at Hawk Mountain Sanctuary. Thank you to Jeremy Bloom and Jim McEwen for helping with the owls. Thank you to Isabelle Andreesen at the University of Oldenburg and thank you to Andrew Farnsworth at the Cornell Lab of Ornithology, as well as Nick Halmagyi and Andrew Otto. Thank you everyone!EPISODE CREDITS: Reported by -  Annie McEwenProduced by -  Annie McEwenOriginal music and sound design contributed by -  Annie McEwenwith field recording and reporting help by - Jeremy S. BloomFact-checking by -  Natalie Middletonand Edited by  -  Becca BresslerEPISODE CITATIONS:Places -  Check out Hog Island Audubon Camp at https://hogisland.audubon.org/. If you like birds, this is the place for you. The people, the food (my god the food), the views, the hiking, and especially the BIRDS are incredible. And if it’s raptors you’re specifically interested in, I highly recommend visiting Hawk Mountain Sanctuary www.hawkmountain.org. You can watch these amazing birds wheeling high above a stunning forested valley, if you’re into that sort of thing… and maybe if you’re lucky you’ll even catch sight of some teeny weeny owls.Books  Scott Weidensaul will make you love birds if you don’t already. Check out his books and go see him talk! http://www.scottweidensaul.com/Website If you want to learn more about the fascinating and wildly interdisciplinary field of magnetoreception in birds, you can dig into the work of Henrick Mouritsen at the University of Oldenburg and his colleagues at the University of Oxford here: https://www.quantumbirds.eu/  Signup for our newsletter! It includes short essays, recommendations, and details about other ways to interact with the show. Sign up (https://radiolab.org/newsletter)!Radiolab is supported by listeners like you. Support Radiolab by becoming a member of The Lab (https://members.radiolab.org/) today.Follow our show on Instagram, Twitter and Facebook @radiolab, and share your thoughts with us by emailing radiolab@wnyc.org.Leadership support for Radiolab’s science programming is provided by the Gordon and Betty Moore Foundation, Science Sandbox, a Simons Foundation Initiative, and the John Templeton Foundation. Foundational support for Radiolab was provided by the Alfred P. Sloan Foundation.",
  "author": "WNYC Studios",
  "published": "Fri, 14 Feb 2025 15:00:00 +0000",
  "source": "http://feeds.wnyc.org/radiolab",
  "categories": [
    "magnetic fields",
    " owls",
    " quantum",
    " birds",
    " entanglement",
    " eyeballs",
    " migration",
    " storytelling",
    " navigation"
  ],
  "byline": "",
  "length": 145,
  "excerpt": "Investigating a strange world.",
  "siteName": "Radiolab Podcasts | WNYC Studios",
  "favicon": "https://www.wnycstudios.org/apple-touch-icon.png",
  "text": "Unlock exclusives in The LabSign up for the newsletterTest the outer edges of what you think you knowProduced by WNYC Studios© 2025 WNYC Studios",
  "image": "https://radiolab.org/og-default-image.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-style-mode=\"blue\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch2\u003e Unlock exclusives \u003cspan\u003e in \u003ca href=\"https://www.wnycstudios.org/the-lab\"\u003eThe Lab\u003c/a\u003e\u003cspan\u003e\u003cimg alt=\"icon\" src=\"https://www.wnycstudios.org/rl-icon-stripes.svg\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/h2\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eSign up for the newsletter\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"small white Radiolab logo icon\" src=\"https://www.wnycstudios.org/rl-icon-solid-white.svg\"/\u003e\u003c/p\u003e\u003cp\u003eTest the outer edges of what you think you know\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eProduced by WNYC Studios\u003c/p\u003e\u003cp\u003e© 2025 WNYC Studios\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
