{
  "id": "a40fed73-13b5-4137-974d-50cdee48e7ec",
  "title": "Recognition from colleagues can help employees cope with bad work experiences",
  "link": "https://phys.org/news/2025-05-recognition-colleagues-employees-cope-bad.html",
  "description": "Being appreciated by colleagues can help employees cope with negative experiences at work, according to a new study involving the University of East Anglia (UEA).",
  "author": "",
  "published": "Tue, 13 May 2025 19:10:04 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Social Sciences Economics \u0026 Business"
  ],
  "byline": "University of East Anglia",
  "length": 5174,
  "excerpt": "Being appreciated by colleagues can help employees cope with negative experiences at work, according to a new study involving the University of East Anglia (UEA).",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: Unsplash/CC0 Public Domain Being appreciated by colleagues can help employees cope with negative experiences at work, according to a new study involving the University of East Anglia (UEA). Researchers found that employees experience \"embitterment\"—an emotional response to perceived workplace injustice—on days when they are assigned more unreasonable tasks than usual. This negative emotion not only affects their work but also spills over into their personal lives, leading to an increase in rumination, the repetitive dwelling on negative feelings and their causes. This can result in difficulty detaching from work, ultimately preventing recovery from job-related stress. The findings also reveal that this harmful cycle takes place mainly on days when employees receive less appreciation from their colleagues than usual. Published in the journal Work \u0026 Stress, the study involved researchers from UEA, in the UK, the University of Cyprus, and Aristotle University of Thessaloniki, in Greece. The authors say it emphasizes the importance of workplace recognition in mitigating the emotional toll of perceived 'illegitimate' tasks that are considered unnecessary and/or unreasonable, and how this can help protect employees' well-being. Co-author George Michaelides, Professor of Work Psychology at UEA's Norwich Business School, said, \"Our findings underscore how assigning unreasonable tasks can violate employees' sense of fairness and harm their emotional well-being. It also emphasizes the crucial role of supervisors in minimizing such tasks and prioritizing core responsibilities. \"Additionally, fostering a culture of appreciation among colleagues can serve as a protective factor, helping employees cope with workplace stress. Organizations can support this by equipping employees with the skills to express gratitude effectively, creating a more positive and resilient work environment.\" Lead author Dr. Evie Michailidis, from the University of Cyprus, added, \"The importance of appreciation for mitigating feelings of embitterment cannot be overstated. Without appreciation, unreasonable tasks foster feelings of embitterment that spill over into private lives, making it harder to mentally disconnect and recover after work.\" The study highlights the dynamic nature of embitterment and suggests that unnecessary and unreasonable tasks are potential predictors of this emotion, which in turn can interfere with employees' ability to recover from work during their time off. Most importantly, it allowed the team to test the boundary conditions under which these relationships are stronger or weaker. Unnecessary tasks could be those employees perceive as pointless and lacking relevance to their role—for example, writing a report that no one will read—undermining their sense of purpose and value in the workplace. Unreasonable tasks are often those employees consider exceed their role, capabilities, or responsibilities—such as asking a senior employee to perform a novice's work—generating a sense of injustice because they might violate expectations of fairness and respect in the workplace. Appreciation has been recognized as an important buffer to the effect of illegitimate tasks and the threat to professional identity an employee experiences when exposed to them. It refers to getting recognition for achievements and qualities by significant others at work, such as supervisors or colleagues. The team collected data from 71 employees using daily surveys over five working days. These surveys helped the researchers track individuals' feelings of embitterment, the degree to which they had to engage in illegitimate tasks, how much appreciation they felt from their colleagues and supervisors, and how much they thought about work during their time off. Participants worked in different industry sectors, with most in accounting and finance. More information: Evie Michailidis, et al. Daily workplace embitterment and work-related rumination during off-job time: Illegitimate tasks as antecedents and the buffering role of appreciation, Work \u0026 Stress (2025). DOI: 10.1080/02678373.2025.2484761 Citation: Recognition from colleagues can help employees cope with bad work experiences (2025, May 13) retrieved 13 May 2025 from https://phys.org/news/2025-05-recognition-colleagues-employees-cope-bad.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/colleagues.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/colleagues.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/colleagues.jpg\" data-sub-html=\"Credit: Unsplash/CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/colleagues.jpg\" alt=\"colleagues\" title=\"Credit: Unsplash/CC0 Public Domain\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: Unsplash/CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eBeing appreciated by colleagues can help employees cope with negative experiences at work, according to a new study involving the University of East Anglia (UEA).\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eResearchers found that employees experience \u0026#34;embitterment\u0026#34;—an \u003ca href=\"https://phys.org/tags/emotional+response/\" rel=\"tag\"\u003eemotional response\u003c/a\u003e to perceived workplace injustice—on days when they are assigned more unreasonable tasks than usual.\u003c/p\u003e\n\u003cp\u003eThis negative emotion not only affects their work but also spills over into their personal lives, leading to an increase in rumination, the repetitive dwelling on \u003ca href=\"https://phys.org/tags/negative+feelings/\" rel=\"tag\"\u003enegative feelings\u003c/a\u003e and their causes. This can result in difficulty detaching from work, ultimately preventing recovery from job-related stress.\u003c/p\u003e\n\u003cp\u003eThe findings also reveal that this harmful cycle takes place mainly on days when employees receive less appreciation from their colleagues than usual.\u003c/p\u003e\n\u003cp\u003ePublished in the journal \u003ci\u003eWork \u0026amp; Stress\u003c/i\u003e, the \u003ca href=\"https://tandfonline.com/doi/full/10.1080/02678373.2025.2484761\" target=\"_blank\"\u003estudy\u003c/a\u003e involved researchers from UEA, in the UK, the University of Cyprus, and Aristotle University of Thessaloniki, in Greece.\u003c/p\u003e\n\u003cp\u003eThe authors say it emphasizes the importance of workplace recognition in mitigating the emotional toll of perceived \u0026#39;illegitimate\u0026#39; tasks that are considered unnecessary and/or unreasonable, and how this can help protect employees\u0026#39; well-being.\u003c/p\u003e\n\u003cp\u003eCo-author George Michaelides, Professor of Work Psychology at UEA\u0026#39;s Norwich Business School, said, \u0026#34;Our findings underscore how assigning unreasonable tasks can violate employees\u0026#39; sense of fairness and harm their emotional well-being. It also emphasizes the crucial role of supervisors in minimizing such tasks and prioritizing core responsibilities.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u0026#34;Additionally, fostering a culture of appreciation among colleagues can serve as a protective factor, helping employees cope with workplace stress. Organizations can support this by equipping employees with the skills to express gratitude effectively, creating a more positive and resilient work environment.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLead author Dr. Evie Michailidis, from the University of Cyprus, added, \u0026#34;The importance of appreciation for mitigating feelings of embitterment cannot be overstated. Without appreciation, unreasonable tasks foster feelings of embitterment that spill over into \u003ca href=\"https://phys.org/tags/private+lives/\" rel=\"tag\"\u003eprivate lives\u003c/a\u003e, making it harder to mentally disconnect and recover after work.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe study highlights the dynamic nature of embitterment and suggests that unnecessary and unreasonable tasks are potential predictors of this emotion, which in turn can interfere with employees\u0026#39; ability to recover from work during their time off.\u003c/p\u003e\n\u003cp\u003eMost importantly, it allowed the team to test the boundary conditions under which these relationships are stronger or weaker.\u003c/p\u003e\n\u003cp\u003eUnnecessary tasks could be those employees perceive as pointless and lacking relevance to their role—for example, writing a report that no one will read—undermining their sense of purpose and value in the workplace.\u003c/p\u003e\n\u003cp\u003eUnreasonable tasks are often those employees consider exceed their role, capabilities, or responsibilities—such as asking a senior employee to perform a novice\u0026#39;s work—generating a sense of injustice because they might violate expectations of fairness and respect in the workplace.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eAppreciation has been recognized as an important buffer to the effect of illegitimate tasks and the threat to professional identity an employee experiences when exposed to them. It refers to getting recognition for achievements and qualities by significant others at work, such as supervisors or colleagues.\u003c/p\u003e\n\u003cp\u003eThe team collected data from 71 employees using daily surveys over five working days. These surveys helped the researchers track individuals\u0026#39; feelings of embitterment, the degree to which they had to engage in illegitimate tasks, how much appreciation they felt from their colleagues and supervisors, and how much they thought about work during their time off.\u003c/p\u003e\n\u003cp\u003eParticipants worked in different industry sectors, with most in accounting and finance.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tEvie Michailidis, et al. Daily workplace embitterment and work-related rumination during off-job time: Illegitimate tasks as antecedents and the buffering role of appreciation, \u003ci\u003eWork \u0026amp; Stress\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1080/02678373.2025.2484761\" target=\"_blank\"\u003eDOI: 10.1080/02678373.2025.2484761\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tRecognition from colleagues can help employees cope with bad work experiences (2025, May 13)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 13 May 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-05-recognition-colleagues-employees-cope-bad.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-13T19:10:04-04:00",
  "modifiedTime": null
}
