{
  "id": "b35777ac-959d-450f-ab72-967bddeed222",
  "title": "The Real Problem With Banning Masks at Protests",
  "link": "https://www.wired.com/story/the-real-problem-with-banning-masks-at-protests/",
  "description": "Privacy advocates worry banning masks at protests will encourage harassment, while cops’ high-tech tools render the rules unnecessary.",
  "author": "Ilica Mahajan",
  "published": "Tue, 12 Nov 2024 11:00:00 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Security",
    "Security / Privacy",
    "Security / Security News",
    "Science / Health",
    "Cover Ups"
  ],
  "byline": "Ilica Mahajan",
  "length": 15351,
  "excerpt": "Privacy advocates worry banning masks at protests will encourage harassment, while cops’ high-tech tools render the rules unnecessary.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "On December 16, 1773, a group of protesters in Boston donned handkerchiefs and smeared their faces with soot, disguising themselves as Native Americans, as they hurled tea into the sea. Some of these Boston Tea Partiers were apprentices who worked for pro-government masters and worried about losing their jobs. Others feared retribution from the British crown. Most of the protesters who dumped tea into Boston Harbor still remain unknown, but the conditions making that kind of anonymity possible may be gone forever.Protesting anonymously is as old as America itself, but Americans’ ability to do so appears to be in jeopardy as government officials across the country push mask bans to hold protesters accountable to law enforcement.While today’s activists have more reliable communication tools than did Revolutionary War–era agitators, the Boston Tea Party’s ringleaders didn’t have to contend with surveillance technology, like Stingrays that impersonate cell phone towers to track nearby cell phones en masse, geofence warrants that let law enforcement request location data from companies about all the devices in a certain area (often without a warrant), professional social media monitoring firms that maintain scores of clandestine accounts to surveil activists, networks of automated license plate reading cameras that can track protesters’ vehicles, and even gait analysis technologies that can identify someone based on how they walk.All this tech at law enforcement’s fingertips complicates claims by politicians, in the wake of a nationwide wave of protests, that banning face coverings in public is essential for punishing protesters when they engage in violence or property damage. Instead, privacy experts and activists warn, mask bans could chill free speech and open protesters up to identification and harassment by political opponents.Demonstrators gathered in New York City in October to condemn Israel’s attacks on Gaza. Photograph: Fatih Aktas/Anadolu; Getty ImagesCheck out a full breakdown of the surveillance technology that can be used to monitor protesters here.The earliest mask bans date back to the 1840s, when New York prohibited face coverings after roving bands of protesters terrorized landlords in the Hudson Valley. That same law was used to arrest Occupy Wall Street protesters in 2011, and those protesting the Shah of Iran in California in 1978. Many other states followed suit in the first half of the 20th century, enacting bans in response to the Ku Klux Klan’s white-hooded campaigns of violence and intimidation.At least 18 states have had some form of mask ban laws on the books at some point. Some weren’t enforced during the Covid-19 pandemic, with New York repealing its statewide ban entirely. However, jurisdictions like Nassau County and the town of Ballston Spa subsequently implemented their own local bans. North Carolina also passed severe restrictions on masking earlier this year.Statewide mask ban bills have been introduced in New York and New Jersey, though New Jersey’s bill was revised following public pressure to only penalize masking while committing a crime. The mayors of Los Angeles and New York have expressed interest in bans, and one was proposed in Chicago, but has yet to pass. The University of California system recently banned masks on campus, following a nationwide wave of student demonstrations over Israel’s invasion and bombardment of Gaza.While many of these bills don’t explicitly mention protests, their backers have directly invoked the desire to broadly limit anonymity.“We will not tolerate individuals using masks to evade responsibility for criminal or threatening behavior,” said New York Governor Kathy Hochul, who floated the idea of banning masks on New York City subways. “People should not be able to hide behind a mask to commit crimes.”“Take your mask off. Don't be a coward,” said Nassau County Executive Bruce Blakeman as he signed the county’s ban into law.“Cowards hide their faces,” agreed New York Mayor Eric Adams.Arrests for violating the new laws started almost immediately. Weeks after its ban passed, police in Nassau County arrested a 26-year-old man for using a keffiyeh, a scarf associated with Palestinian advocacy, to cover his face while protesting Israel’s large-scale killings and destruction in Gaza in response to Hamas’ attack in October 2023. A misdemeanor offense, it was the only crime he was charged with.These new mask bans have also triggered a swift backlash.Disability Rights New York, a legal and advocacy nonprofit for people with disabilities, filed a class action lawsuit against Nassau County earlier this year, arguing its mask ban “discriminates against people with disabilities by depriving them of equal access to public life.” The law exempts people with medical justifications for masking, but the plaintiffs argued it would force people masking for medical reasons to constantly have to explain themselves to police, sometimes being arrested anyway.A New York judge dismissed that lawsuit last month, saying exemption was sufficient to answer their concerns.While steering clear of weighing in on the mask ban controversy, the Centers For Disease Control and Prevention (CDC) recommends masking as a way to avoid the spread of Covid-19 and other respiratory diseases. “Wearing a mask is a prevention strategy you can choose to further protect yourself and others that can help lower the risk of respiratory virus transmission, especially if you are at higher risk for severe disease,” CDC spokesperson Dave Daigle said in a statement.Health concerns are not the only source of anxiety for mask ban opponents. Many activists also worry about “doxxing,” publishing someone’s personal information online with malicious intent.Liv Kunins-Berkowitz, a media coordinator at Jewish Voice for Peace, an anti-Zionist Jewish advocacy group, said members have repeatedly been doxxed due to their participation in protests criticizing Israel’s military occupation of Palestinian land and killing more than 40,000 Palestinians during its recent military campaign.“Due to doxxing, those who advocate for Palestinian freedom have been fired from their jobs and even received threats to their safety,” Kunins-Berkowitz said. “People should have the right to cover their faces, be it for religious purposes or to protect themselves from illness.”Thirteen states have some law on the books permitting lawsuits over doxxing.The Council on American-Islamic Relations (CAIR), an advocacy organization for Muslim civil liberties in America, says that doxxing is on the rise. “For decades now, American Muslims have been a testing ground for intrusive surveillance and other policies that I think many Americans would object to, were they the initial target of it,” said Corey Saylor, CAIR’s research and advocacy director. “These things are tested against disliked populations, but then applied to the general population as a whole.”This year, CAIR filed one of the first doxxing lawsuits in Illinois against Canary Mission, a pro-Israel organization that operates an online database and trucks with large screens on college campuses like Yale and Columbia, featuring pictures of pro-Palestinian protesters and others they accuse of antisemitism and links to their social media accounts. The lawsuit accuses Canary Mission of doxxing a Pakistani woman. Soon after her profile appeared on its site, she began receiving death threats.Concerns about doxxing exist across the political spectrum. A conservative student at Auburn University was doxxed after engaging in pro-life activities on campus, as were employees at voting machine companies following president-elect Donald Trump’s fraudulent attempts to overturn the results of the 2020 election, as were the far-right attendees of the white nationalist Unite The Right rally in Charlottesville, Virginia.But for mask ban proponents, this type of identification is precisely the point.“It's really hard to identify people when their faces are covered, and people intent on breaking the law are obviously very aware of that,” said Hannah Meyers, director of policing at the Manhattan Institute, a conservative think tank, who argues mask bans help law enforcement quickly identify suspects and prosecutors to charge them.Meyers argued that masking at protests makes it harder for police to identify people engaging in criminal behavior at otherwise legal demonstrations. Prohibiting masks, she noted, would also have the added benefit of dissuading police from using more invasive surveillance methods.Masking, Meyers said, can “embolden people to behavior that they wouldn't otherwise engage in, you know, push them toward criminality, push them toward riskier, more disorderly behavior.”In some cases, it's possible for protesters to evade law enforcement surveillance.For technologies like Stingray and geofence warrants, protesters can leave their phones at home or switch to airplane mode, preventing the devices from connecting to the cellular network, which has the side effect of inhibiting crucial communications. Automated license plate readers can be circumvented by walking or taking public transit to the protest—in situations where that’s feasible, though public transit payments produce data on people’s movements too.A person taps in with a mobile phone on an OMNY touchpad to enter the Columbus Circle–59th Street subway station on September 5, 2023, in New York City. Photograph: Gary Hershorn; Getty ImagesHowever, even when a protester's threat model is doxxing from political opponents without law enforcement’s high-tech tools, the problem is that tracking someone through social media isn’t difficult.TikTokker Kristen Sotakoun, who goes by “notkahnjunior,” uses publicly available information to find personal information about people who challenge her to—a practice she calls “consensual doxxing.” Sotakoun’s goal is to get people to realize the actual size of their digital footprint and, in the process, become a little more careful about what they post online.In a recent video, Sotakoun found someone’s real name and birthday starting with only their TikTok handle, despite their being masked in their profile picture.Even while wearing a mask in public, there’s so much information people leave on the internet making them identifiable. “You don't need their face. You just need a really unreliable relative who loves posting all the time,” Sotakoun said. “I think people think the end-all-be-all is if people cover their face, they'll never be found, but they don't realize … [that if they] said, ‘Hey, I'm celebrating at the Cheesecake Factory. Here we are on December 3, 2019.’ You willingly gave that up.”Identifying an unmasked person is fairly trivial, even for someone without Sotakoun’s sleuthing skills. All that’s necessary is a picture of their face.Online tools like PimEyes, a facial recognition search engine, is open for anyone to use by paying a small fee. A blog post on PimEyes’ website suggests its algorithm struggles when someone’s face is obscured, like when wearing a mask.PimEyes was almost instantly able to identify the author of this article without a mask on, retrieving high school yearbook photos and pictures from conference talks. With a mask on, however, PimEyes found other masked faces with similar skin tones, but none of them were the author’s.In contrast, police have access to controversial tools like Clearview AI, which can identify people through a picture of their face “even in situations where their facial features are partially obscured, such as in low-light or when they are wearing masks.” Clearview’s facial recognition is only made available to law enforcement officials or governments, not the general public.While universally available, off-the-shelf tools like PimEyes may eventually catch up with the law enforcement’s state-of-the-art software. In the meantime, mask bans seemingly make it easier for political opponents to identify and dox people while adding little value for police.“There are lots of different tools that are available to law enforcement. Facial recognition is one of those tools that it's about expediency,” said Nicole Napolitano, director of research at the Center for Policing Equity. But it’s not without its pitfalls. Like PimEyes, tools like Clearview AI can make mistakes and incorrectly identify people, leading to erroneous arrests. “Police have become increasingly reliant on and then biased by what the model tells them,” said Napolitano.“There's no constitutional right to cover your face in public,” charged Meyers, the Manhattan Institute’s policing director.Indeed, the legal landscape surrounding how law enforcement can use surveillance technologies has been hazy, explained Beth Haroules, a staff attorney for the New York branch of the American Civil Liberties Union, largely because the law hasn’t kept up with the pace with technological development.For Haroules, the potential for omnipresent surveillance means people never really have a reasonable expectation of privacy—an important historic legal standard. “[Surveillance] cameras aren't just the eyes of a police officer,” she said. “They are being monitored, perhaps 24/7, in real time. They're feeding images into artificial intelligence, aided by algorithms that then kick out and match you to a number of faces and places that you've been.”That legal haze, though, may finally be starting to clear.This summer, a federal appeals court judge declared that geofence warrants were violations of the Constitution’s protections against unreasonable searches and seizures, though this decision only holds in Texas, Mississippi, and Louisiana. Similarly, a New York judge ruled warrantless phone searches at border crossings are unconstitutional. While the ruling only applies to a portion of New York, it does cover John F. Kennedy International Airport, one of the country’s busiest airports.Phone manufacturers have also been making strides with regard to technological solutions to subvert surveillance methods. Google announced changes to how it stores users’ location data, making it unable to comply with future geofence warrants.Even so, determining when police use surveillance technology can be difficult. Tushar Jois, a City College of New York professor studying the intersection of privacy, technology, and censorship, said that police departments “would routinely drop evidence in their cases rather than share data” about their surveillance technology use.Beryl Lipton, a senior investigative researcher at the Electronic Frontier Foundation, a tech-focused civil liberties nonprofit, said that many of the things law enforcement officials used to only dream of are now increasingly possible.“I think there's been a big shift in how we need to think about what it means to have an expectation of privacy in a public space,” Lipton said.Half a century ago, Lipton explained, you'd potentially be able to see someone following you down the street, listening to your conversation. Now, that type of surveillance isn't so obvious.“That's something we, as a country, really need to reevaluate,” she added. “We don't want to be in a position, either as protesters, or just as regular individuals, trying to live a life where we're essentially being followed and listened to all the time.”",
  "image": "https://media.wired.com/photos/67327ae9536cee9dc7a758cd/191:100/w_1280,c_limit/Security_TMP_PRTSTR_MASKS_AShrestha.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOn December 16, 1773, a group of protesters in Boston donned handkerchiefs and smeared their faces with soot, disguising themselves as Native Americans, as they hurled tea into the sea. Some of these Boston Tea Partiers were apprentices who worked for pro-government masters and worried about losing their jobs. Others feared retribution from the British crown. Most of the protesters who dumped tea into Boston Harbor still remain unknown, but the conditions making that kind of anonymity possible may be gone forever.\u003c/p\u003e\u003cp\u003eProtesting anonymously is as old as America itself, but Americans’ ability to do so appears to be in jeopardy as government officials across the country push mask bans to hold protesters accountable to law enforcement.\u003c/p\u003e\u003cp\u003eWhile today’s activists have more reliable communication tools than did Revolutionary War–era agitators, the Boston Tea Party’s ringleaders didn’t have to contend with surveillance technology, like Stingrays that impersonate cell phone towers to track nearby cell phones en masse, geofence warrants that let law enforcement request location data from companies about all the devices in a certain area (often without a warrant), professional social media monitoring firms that maintain scores of clandestine accounts to surveil activists, networks of automated license plate reading cameras that can track protesters’ vehicles, and even gait analysis technologies that can identify someone based on how they walk.\u003c/p\u003e\u003cp\u003eAll this tech at law enforcement’s fingertips complicates claims by politicians, in the wake of a nationwide wave of protests, that banning face coverings in public is essential for punishing protesters when they engage in violence or property damage. Instead, privacy experts and activists warn, mask bans could chill free speech and open protesters up to identification and harassment by political opponents.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eDemonstrators gathered in New York City in October to condemn Israel’s attacks on Gaza.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Fatih Aktas/Anadolu; Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cem\u003eCheck out a full breakdown of the surveillance technology that can be used to monitor protesters \u003ca data-offer-url=\"https://www.themarshallproject.org/2024/11/12/protest-surveillance-technologies\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.themarshallproject.org/2024/11/12/protest-surveillance-technologies\u0026#34;}\" href=\"https://www.themarshallproject.org/2024/11/12/protest-surveillance-technologies\" rel=\"nofollow noopener\" target=\"_blank\"\u003ehere\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe earliest mask\u003c/span\u003e bans date back to the 1840s, when New York prohibited face coverings after roving bands of protesters \u003ca data-offer-url=\"https://www.chronogram.com/river-newsroom/in-mask-law-reform-new-york-grapples-with-the-weight-of-protest-history-18194374\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.chronogram.com/river-newsroom/in-mask-law-reform-new-york-grapples-with-the-weight-of-protest-history-18194374\u0026#34;}\" href=\"https://www.chronogram.com/river-newsroom/in-mask-law-reform-new-york-grapples-with-the-weight-of-protest-history-18194374\" rel=\"nofollow noopener\" target=\"_blank\"\u003eterrorized\u003c/a\u003e landlords in the Hudson Valley. That same law was used to \u003ca data-offer-url=\"https://www.theatlantic.com/national/archive/2011/09/nypd-arresting-wall-street-protesters-wearing-masks/337706/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.theatlantic.com/national/archive/2011/09/nypd-arresting-wall-street-protesters-wearing-masks/337706/\u0026#34;}\" href=\"https://www.theatlantic.com/national/archive/2011/09/nypd-arresting-wall-street-protesters-wearing-masks/337706/\" rel=\"nofollow noopener\" target=\"_blank\"\u003earrest\u003c/a\u003e Occupy Wall Street protesters in 2011, and those protesting the \u003ca data-offer-url=\"https://caselaw.findlaw.com/court/ca-court-of-appeal/1832636.html\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://caselaw.findlaw.com/court/ca-court-of-appeal/1832636.html\u0026#34;}\" href=\"https://caselaw.findlaw.com/court/ca-court-of-appeal/1832636.html\" rel=\"nofollow noopener\" target=\"_blank\"\u003eShah of Iran in California\u003c/a\u003e in 1978. Many other states followed suit in the first half of the 20th century, enacting bans in response to the Ku Klux Klan’s white-hooded campaigns of violence and intimidation.\u003c/p\u003e\u003cp\u003eAt least 18 states have had some form of mask ban laws on the books at some point. Some \u003ca data-offer-url=\"https://www.al.com/news/2020/04/alabama-authorities-urge-people-to-ignore-kkk-era-anti-masking-law.html\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.al.com/news/2020/04/alabama-authorities-urge-people-to-ignore-kkk-era-anti-masking-law.html\u0026#34;}\" href=\"https://www.al.com/news/2020/04/alabama-authorities-urge-people-to-ignore-kkk-era-anti-masking-law.html\" rel=\"nofollow noopener\" target=\"_blank\"\u003eweren’t enforced\u003c/a\u003e during the Covid-19 pandemic, with New York repealing its statewide ban entirely. However, jurisdictions like \u003ca data-offer-url=\"https://www.usatoday.com/story/news/nation/2024/08/14/new-york-nassau-county-mask-ban-civil-rights/74804763007/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.usatoday.com/story/news/nation/2024/08/14/new-york-nassau-county-mask-ban-civil-rights/74804763007/\u0026#34;}\" href=\"https://www.usatoday.com/story/news/nation/2024/08/14/new-york-nassau-county-mask-ban-civil-rights/74804763007/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eNassau County\u003c/a\u003e and the town of \u003ca data-offer-url=\"https://www.dailygazette.com/news/ballston-spa-parade/article_57ca7e00-59ba-11ef-9a32-0f35623a5004.html\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.dailygazette.com/news/ballston-spa-parade/article_57ca7e00-59ba-11ef-9a32-0f35623a5004.html\u0026#34;}\" href=\"https://www.dailygazette.com/news/ballston-spa-parade/article_57ca7e00-59ba-11ef-9a32-0f35623a5004.html\" rel=\"nofollow noopener\" target=\"_blank\"\u003eBallston Spa\u003c/a\u003e subsequently implemented their own local bans. North Carolina also passed \u003ca href=\"https://apnews.com/article/masks-ban-north-carolina-campus-protests-128a6aa32a4c832faa83befb2e7dd77e\"\u003esevere restrictions\u003c/a\u003e on masking earlier this year.\u003c/p\u003e\u003cp\u003eStatewide mask ban bills have been introduced in New York and New Jersey, though New Jersey’s bill was revised following public pressure to only penalize masking while committing a crime. The mayors of Los Angeles and New York have expressed interest in bans, and one was \u003ca data-offer-url=\"https://occprodstoragev1.blob.core.usgovcloudapi.net/matterattachmentspublic/e978b0b2-0fad-44dd-9ced-ed645b0d45dd.pdf\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://occprodstoragev1.blob.core.usgovcloudapi.net/matterattachmentspublic/e978b0b2-0fad-44dd-9ced-ed645b0d45dd.pdf\u0026#34;}\" href=\"https://occprodstoragev1.blob.core.usgovcloudapi.net/matterattachmentspublic/e978b0b2-0fad-44dd-9ced-ed645b0d45dd.pdf\" rel=\"nofollow noopener\" target=\"_blank\"\u003eproposed\u003c/a\u003e in Chicago, but has \u003ca data-offer-url=\"https://chicago.councilmatic.org/legislation/o2024-0009463/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://chicago.councilmatic.org/legislation/o2024-0009463/\u0026#34;}\" href=\"https://chicago.councilmatic.org/legislation/o2024-0009463/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eyet to pass\u003c/a\u003e. The University of California system recently \u003ca data-offer-url=\"https://www.theguardian.com/us-news/article/2024/aug/19/university-california-gaza-protests-encampment-face-mask-bans\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.theguardian.com/us-news/article/2024/aug/19/university-california-gaza-protests-encampment-face-mask-bans\u0026#34;}\" href=\"https://www.theguardian.com/us-news/article/2024/aug/19/university-california-gaza-protests-encampment-face-mask-bans\" rel=\"nofollow noopener\" target=\"_blank\"\u003ebanned\u003c/a\u003e masks on campus, following a nationwide wave of student demonstrations over Israel’s invasion and bombardment of Gaza.\u003c/p\u003e\u003cp\u003eWhile many of these bills don’t explicitly mention protests, their backers have directly invoked the desire to broadly limit anonymity.\u003c/p\u003e\u003cp\u003e“We will not tolerate individuals using masks to evade responsibility for criminal or threatening behavior,” \u003ca href=\"https://www.governor.ny.gov/news/video-audio-photos-rush-transcript-governor-hochul-announces-28-percent-decline-shootings-and\"\u003esaid New York Governor Kathy Hochul\u003c/a\u003e, who \u003ca href=\"https://apnews.com/article/mask-ban-new-york-city-subway-7c83637a00c816407d1174145fc64339\"\u003efloated\u003c/a\u003e the idea of banning masks on New York City subways. “People should not be able to hide behind a mask to commit crimes.”\u003c/p\u003e\u003cp\u003e“Take your mask off. Don\u0026#39;t be a coward,” \u003ca data-offer-url=\"https://www.cbsnews.com/newyork/news/nyc-mayor-supports-face-mask-ban/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.cbsnews.com/newyork/news/nyc-mayor-supports-face-mask-ban/\u0026#34;}\" href=\"https://www.cbsnews.com/newyork/news/nyc-mayor-supports-face-mask-ban/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esaid\u003c/a\u003e Nassau County Executive Bruce Blakeman as he signed the county’s ban into law.\u003c/p\u003e\u003cp\u003e“Cowards hide their faces,” \u003ca data-offer-url=\"https://www.cbsnews.com/newyork/news/anas-saleh-subway-incident/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.cbsnews.com/newyork/news/anas-saleh-subway-incident/\u0026#34;}\" href=\"https://www.cbsnews.com/newyork/news/anas-saleh-subway-incident/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eagreed\u003c/a\u003e New York Mayor Eric Adams.\u003c/p\u003e\u003cp\u003eArrests for violating the new laws started almost immediately. Weeks after its ban passed, police in Nassau County arrested \u003ca href=\"https://apnews.com/article/mask-ban-new-york-arrest-keffiyeh-protest-6c2ed98c3cb79047c35249dcc416d6ec\"\u003ea 26-year-old man for using a keffiyeh\u003c/a\u003e, a scarf associated with Palestinian advocacy, to cover his face while protesting Israel’s large-scale killings and destruction in Gaza in response to Hamas’ attack in October 2023. A misdemeanor offense, it was the only crime he was charged with.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cspan\u003eThese new mask\u003c/span\u003e bans have also triggered a swift backlash.\u003c/p\u003e\u003cp\u003eDisability Rights New York, a legal and advocacy nonprofit for people with disabilities, filed a class action lawsuit against Nassau County earlier this year, arguing its mask ban “discriminates against people with disabilities by depriving them of equal access to public life.” The law exempts people with medical justifications for masking, but the plaintiffs argued it would force people masking for medical reasons to constantly have to explain themselves to police, sometimes being arrested anyway.\u003c/p\u003e\u003cp\u003eA New York judge dismissed that lawsuit last month, saying exemption was sufficient to answer their concerns.\u003c/p\u003e\u003cp\u003eWhile steering clear of weighing in on the mask ban controversy, the Centers For Disease Control and Prevention (CDC) recommends masking as a way to avoid the spread of Covid-19 and other respiratory diseases. “\u003ca href=\"https://www.cdc.gov/respiratory-viruses/prevention/masks.html\"\u003eWearing a mask\u003c/a\u003e is a prevention strategy you can choose to further protect yourself and others that can help lower the risk of respiratory virus transmission, especially if you are at higher risk for severe disease,” CDC spokesperson Dave Daigle said in a statement.\u003c/p\u003e\u003cp\u003eHealth concerns are not the only source of anxiety for mask ban opponents. Many activists also worry about “doxxing,” publishing someone’s personal information online with malicious intent.\u003c/p\u003e\u003cp\u003eLiv Kunins-Berkowitz, a media coordinator at Jewish Voice for Peace, an anti-Zionist Jewish advocacy group, said members have repeatedly been doxxed due to their participation in protests criticizing Israel’s military occupation of Palestinian land and killing \u003ca href=\"https://apnews.com/article/gaza-death-toll-hamas-war-israel-40000-32a79e03c8eb62669412dab23d03219e\"\u003emore than 40,000 Palestinians\u003c/a\u003e during its recent military campaign.\u003c/p\u003e\u003cp\u003e“Due to doxxing, those who advocate for Palestinian freedom have been fired from their jobs and even received threats to their safety,” Kunins-Berkowitz said. “People should have the right to cover their faces, be it for religious purposes or to protect themselves from illness.”\u003c/p\u003e\u003cp\u003eThirteen states have some law on the books permitting lawsuits over doxxing.\u003c/p\u003e\u003cp\u003eThe Council on American-Islamic Relations (CAIR), an advocacy organization for Muslim civil liberties in America, says that doxxing is on the rise. “For decades now, American Muslims have been a testing ground for intrusive surveillance and other policies that I think many Americans would object to, were they the initial target of it,” said Corey Saylor, CAIR’s research and advocacy director. “These things are tested against disliked populations, but then applied to the general population as a whole.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThis year, CAIR filed one of the first doxxing \u003ca data-offer-url=\"https://mondoweiss.net/2024/08/new-lawsuit-takes-canary-mission-to-court-under-anti-doxxing-law/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://mondoweiss.net/2024/08/new-lawsuit-takes-canary-mission-to-court-under-anti-doxxing-law/\u0026#34;}\" href=\"https://mondoweiss.net/2024/08/new-lawsuit-takes-canary-mission-to-court-under-anti-doxxing-law/\" rel=\"nofollow noopener\" target=\"_blank\"\u003elawsuits\u003c/a\u003e in Illinois against Canary Mission, a pro-Israel organization that operates an online database and trucks with large screens on college campuses like \u003ca data-offer-url=\"https://yaledailynews.com/blog/2023/11/17/doxxing-truck-appears-on-yales-campus-displays-student-names-and-photos/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://yaledailynews.com/blog/2023/11/17/doxxing-truck-appears-on-yales-campus-displays-student-names-and-photos/\u0026#34;}\" href=\"https://yaledailynews.com/blog/2023/11/17/doxxing-truck-appears-on-yales-campus-displays-student-names-and-photos/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eYale\u003c/a\u003e and \u003ca data-offer-url=\"https://www.columbiaspectator.com/news/2023/10/25/doxxing-truck-displaying-names-and-faces-of-affiliates-it-calls-antisemites-comes-to-columbia/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.columbiaspectator.com/news/2023/10/25/doxxing-truck-displaying-names-and-faces-of-affiliates-it-calls-antisemites-comes-to-columbia/\u0026#34;}\" href=\"https://www.columbiaspectator.com/news/2023/10/25/doxxing-truck-displaying-names-and-faces-of-affiliates-it-calls-antisemites-comes-to-columbia/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eColumbia\u003c/a\u003e, featuring pictures of pro-Palestinian protesters and others they accuse of antisemitism and links to their social media accounts. The lawsuit accuses Canary Mission of doxxing a Pakistani woman. Soon after her profile appeared on its site, she began receiving death threats.\u003c/p\u003e\u003cp\u003eConcerns about doxxing exist across the political spectrum. A conservative \u003ca data-offer-url=\"https://yaf.org/news/conservative-student-doxxed-by-auburn-university-for-hosting-pro-life-display/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://yaf.org/news/conservative-student-doxxed-by-auburn-university-for-hosting-pro-life-display/\u0026#34;}\" href=\"https://yaf.org/news/conservative-student-doxxed-by-auburn-university-for-hosting-pro-life-display/\" rel=\"nofollow noopener\" target=\"_blank\"\u003estudent\u003c/a\u003e at Auburn University was doxxed after engaging in pro-life activities on campus, as were \u003ca href=\"https://www.reuters.com/world/us/staff-us-voting-machine-firms-prep-doxxing-misinformation-swatting-2024-11-01/\"\u003eemployees\u003c/a\u003e at voting machine companies following president-elect Donald Trump’s fraudulent attempts to overturn the results of the 2020 election, as were the \u003ca href=\"https://www.pbs.org/newshour/nation/white-supremacists-wore-hoods-now-internet-mob-wont-let-stay-anonymous\"\u003efar-right attendees\u003c/a\u003e of the white nationalist Unite The Right rally in Charlottesville, Virginia.\u003c/p\u003e\u003cp\u003eBut for mask ban proponents, this type of identification is precisely the point.\u003c/p\u003e\u003cp\u003e“It\u0026#39;s really hard to identify people when their faces are covered, and people intent on breaking the law are obviously very aware of that,” said Hannah Meyers, director of policing at the Manhattan Institute, a conservative think tank, who argues mask bans help law enforcement quickly identify suspects and prosecutors to charge them.\u003c/p\u003e\u003cp\u003eMeyers argued that masking at protests makes it harder for police to identify people engaging in criminal behavior at otherwise legal demonstrations. Prohibiting masks, she noted, would also have the added benefit of dissuading police from using more invasive surveillance methods.\u003c/p\u003e\u003cp\u003eMasking, Meyers said, can “embolden people to behavior that they wouldn\u0026#39;t otherwise engage in, you know, push them toward criminality, push them toward riskier, more disorderly behavior.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn some cases,\u003c/span\u003e it\u0026#39;s possible for protesters to evade law enforcement surveillance.\u003c/p\u003e\u003cp\u003eFor technologies like Stingray and geofence warrants, protesters can leave their phones at home or switch to airplane mode, preventing the devices from connecting to the cellular network, which has the side effect of inhibiting crucial communications. Automated license plate readers can be circumvented by walking or taking public transit to the protest—in situations where that’s feasible, though public transit \u003ca data-offer-url=\"https://www.theverge.com/2020/3/16/21175699/mta-omny-privacy-security-smartphone-identifier-location-nyc\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.theverge.com/2020/3/16/21175699/mta-omny-privacy-security-smartphone-identifier-location-nyc\u0026#34;}\" href=\"https://www.theverge.com/2020/3/16/21175699/mta-omny-privacy-security-smartphone-identifier-location-nyc\" rel=\"nofollow noopener\" target=\"_blank\"\u003epayments produce data\u003c/a\u003e on people’s movements too.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA person taps in with a mobile phone on an OMNY touchpad to enter the Columbus Circle–59th Street subway station on September 5, 2023, in New York City.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Gary Hershorn; Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eHowever, even when a protester\u0026#39;s threat model is doxxing from political opponents without law enforcement’s high-tech tools, the problem is that tracking someone through social media isn’t difficult.\u003c/p\u003e\u003cp\u003eTikTokker Kristen Sotakoun, who goes by “\u003ca data-offer-url=\"https://www.tiktok.com/@notkahnjunior\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.tiktok.com/@notkahnjunior\u0026#34;}\" href=\"https://www.tiktok.com/@notkahnjunior\" rel=\"nofollow noopener\" target=\"_blank\"\u003enotkahnjunior\u003c/a\u003e,” uses publicly available information to find personal information about people who challenge her to—a practice she calls “consensual doxxing.” Sotakoun’s goal is to get people to realize the actual size of their digital footprint and, in the process, become a little more careful about what they post online.\u003c/p\u003e\u003cp\u003eIn a recent \u003ca data-offer-url=\"https://www.tiktok.com/@notkahnjunior/video/7418765185877282090?_r=1\u0026amp;_t=8quZOAyNtCJ\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.tiktok.com/@notkahnjunior/video/7418765185877282090?_r=1\u0026amp;_t=8quZOAyNtCJ\u0026#34;}\" href=\"https://www.tiktok.com/@notkahnjunior/video/7418765185877282090?_r=1\u0026amp;_t=8quZOAyNtCJ\" rel=\"nofollow noopener\" target=\"_blank\"\u003evideo\u003c/a\u003e, Sotakoun found someone’s real name and birthday starting with only their TikTok handle, despite their being masked in their profile picture.\u003c/p\u003e\u003cp\u003eEven while wearing a mask in public, there’s so much information people leave on the internet making them identifiable. “You don\u0026#39;t need their face. You just need a really unreliable relative who loves posting all the time,” Sotakoun said. “I think people think the end-all-be-all is if people cover their face, they\u0026#39;ll never be found, but they don\u0026#39;t realize … [that if they] said, ‘Hey, I\u0026#39;m celebrating at the Cheesecake Factory. Here we are on December 3, 2019.’ You willingly gave that up.”\u003c/p\u003e\u003cp\u003eIdentifying an unmasked person is fairly trivial, even for someone without Sotakoun’s sleuthing skills. All that’s necessary is a picture of their face.\u003c/p\u003e\u003cp\u003eOnline tools like PimEyes, a facial recognition search engine, is open for anyone to use by paying a small fee. A \u003ca data-offer-url=\"https://pimeyes.com/en/blog/how-to-improve-the-facial-recognition-search-results\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://pimeyes.com/en/blog/how-to-improve-the-facial-recognition-search-results\u0026#34;}\" href=\"https://pimeyes.com/en/blog/how-to-improve-the-facial-recognition-search-results\" rel=\"nofollow noopener\" target=\"_blank\"\u003eblog post\u003c/a\u003e on PimEyes’ website suggests its algorithm struggles when someone’s face is obscured, like when wearing a mask.\u003c/p\u003e\u003cp\u003ePimEyes was almost instantly able to identify the author of this article without a mask on, retrieving high school yearbook photos and pictures from conference talks. With a mask on, however, PimEyes found other masked faces with similar skin tones, but none of them were the author’s.\u003c/p\u003e\u003cp\u003eIn contrast, police have access to controversial tools like \u003ca data-offer-url=\"https://www.clearview.ai/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.clearview.ai/\u0026#34;}\" href=\"https://www.clearview.ai/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eClearview AI\u003c/a\u003e, which can identify people through a picture of their face “even in situations where their facial features are partially obscured, such as in low-light or \u003ca data-offer-url=\"https://www.clearview.ai/post/facial-identification-innovations-that-are-revolutionizing-public-safety-for-investigators\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.clearview.ai/post/facial-identification-innovations-that-are-revolutionizing-public-safety-for-investigators\u0026#34;}\" href=\"https://www.clearview.ai/post/facial-identification-innovations-that-are-revolutionizing-public-safety-for-investigators\" rel=\"nofollow noopener\" target=\"_blank\"\u003ewhen they are wearing masks\u003c/a\u003e.” Clearview’s facial recognition is \u003ca data-offer-url=\"https://www.clearview.ai/faq\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.clearview.ai/faq\u0026#34;}\" href=\"https://www.clearview.ai/faq\" rel=\"nofollow noopener\" target=\"_blank\"\u003eonly made available\u003c/a\u003e to law enforcement officials or governments, not the general public.\u003c/p\u003e\u003cp\u003eWhile universally available, off-the-shelf tools like PimEyes may eventually catch up with the law enforcement’s state-of-the-art software. In the meantime, mask bans seemingly make it easier for political opponents to identify and dox people while adding little value for police.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“There are lots of different tools that are available to law enforcement. Facial recognition is one of those tools that it\u0026#39;s about expediency,” said Nicole Napolitano, director of research at the Center for Policing Equity. But it’s not without its pitfalls. Like PimEyes, tools like Clearview AI can make mistakes and incorrectly identify people, leading to \u003ca data-offer-url=\"https://www.nytimes.com/2023/08/06/business/facial-recognition-false-arrest.html\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.nytimes.com/2023/08/06/business/facial-recognition-false-arrest.html\u0026#34;}\" href=\"https://www.nytimes.com/2023/08/06/business/facial-recognition-false-arrest.html\" rel=\"nofollow noopener\" target=\"_blank\"\u003eerroneous arrests\u003c/a\u003e. “Police have become increasingly reliant on and then biased by what the model tells them,” said Napolitano.\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“There\u0026#39;s no constitutional\u003c/span\u003e right to cover your face in public,” charged Meyers, the Manhattan Institute’s policing director.\u003c/p\u003e\u003cp\u003eIndeed, the legal landscape surrounding how law enforcement can use surveillance technologies has been hazy, explained Beth Haroules, a staff attorney for the New York branch of the American Civil Liberties Union, largely because the law hasn’t kept up with the pace with technological development.\u003c/p\u003e\u003cp\u003eFor Haroules, the potential for omnipresent surveillance means people never really have a reasonable expectation of privacy—an important historic legal standard. “[Surveillance] cameras aren\u0026#39;t just the eyes of a police officer,” she said. “They are being monitored, perhaps 24/7, in real time. They\u0026#39;re feeding images into artificial intelligence, aided by algorithms that then kick out and match you to a number of faces and places that you\u0026#39;ve been.”\u003c/p\u003e\u003cp\u003eThat legal haze, though, may finally be starting to clear.\u003c/p\u003e\u003cp\u003eThis summer, a federal appeals court judge declared that geofence warrants were violations of the Constitution’s protections against unreasonable searches and seizures, though this decision only holds in Texas, Mississippi, and Louisiana. Similarly, a New York judge \u003ca data-offer-url=\"https://www.theverge.com/2024/7/29/24209130/customs-border-protection-unlock-phone-warrant-new-york-jfk\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.theverge.com/2024/7/29/24209130/customs-border-protection-unlock-phone-warrant-new-york-jfk\u0026#34;}\" href=\"https://www.theverge.com/2024/7/29/24209130/customs-border-protection-unlock-phone-warrant-new-york-jfk\" rel=\"nofollow noopener\" target=\"_blank\"\u003eruled\u003c/a\u003e warrantless phone searches at border crossings are unconstitutional. While the ruling only applies to a portion of New York, it does cover John F. Kennedy International Airport, one of the country’s busiest airports.\u003c/p\u003e\u003cp\u003ePhone manufacturers have also been making strides with regard to technological solutions to subvert surveillance methods. Google \u003ca data-offer-url=\"https://www.forbes.com/sites/cyrusfarivar/2023/12/14/google-just-killed-geofence-warrants-police-location-data/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.forbes.com/sites/cyrusfarivar/2023/12/14/google-just-killed-geofence-warrants-police-location-data/\u0026#34;}\" href=\"https://www.forbes.com/sites/cyrusfarivar/2023/12/14/google-just-killed-geofence-warrants-police-location-data/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eannounced changes\u003c/a\u003e to how it stores users’ location data, making it unable to comply with future geofence warrants.\u003c/p\u003e\u003cp\u003eEven so, determining when police use surveillance technology can be difficult. Tushar Jois, a City College of New York professor studying the intersection of privacy, technology, and censorship, said that police departments “would routinely drop evidence in their cases rather than share data” about their surveillance technology use.\u003c/p\u003e\u003cp\u003eBeryl Lipton, a senior investigative researcher at the Electronic Frontier Foundation, a tech-focused civil liberties nonprofit, said that many of the things law enforcement officials used to only dream of are now increasingly possible.\u003c/p\u003e\u003cp\u003e“I think there\u0026#39;s been a big shift in how we need to think about what it means to have an expectation of privacy in a public space,” Lipton said.\u003c/p\u003e\u003cp\u003eHalf a century ago, Lipton explained, you\u0026#39;d potentially be able to see someone following you down the street, listening to your conversation. Now, that type of surveillance isn\u0026#39;t so obvious.\u003c/p\u003e\u003cp\u003e“That\u0026#39;s something we, as a country, really need to reevaluate,” she added. “We don\u0026#39;t want to be in a position, either as protesters, or just as regular individuals, trying to live a life where we\u0026#39;re essentially being followed and listened to all the time.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2024-11-12T06:00:00-05:00",
  "modifiedTime": "2024-11-12T11:00:00Z"
}
