{
  "id": "bcdd534c-4a02-4686-8c28-27a28ce13a4b",
  "title": "Why Is There So Much Off-Brand Oral Ozempic for Sale Online?",
  "link": "https://www.wired.com/story/telehealth-companies-compounded-glp-1-pills-ozempic-wegovy-novo-nordisk-zepbound-mounjaro-eli-lilly/",
  "description": "GLP-1 drugs like Ozempic are injectable medications—but a strange new market has emerged selling oral “compounded” versions online, despite a lack of evidence that they work.",
  "author": "Kate Knibbs, Emily Mullin",
  "published": "Wed, 20 Nov 2024 11:30:00 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Mouthing Off"
  ],
  "byline": "Kate Knibbs, Emily Mullin",
  "length": 10877,
  "excerpt": "GLP-1 drugs like Ozempic are injectable medications—but a strange new market has emerged selling oral “compounded” versions online, despite a lack of evidence that they work.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "Since they debuted, injectable GLP-1 drugs like Ozempic have been in high demand. In addition to treating diabetes and obesity, these medications have cardiovascular benefits, and there’s evidence they may curb addiction and possibly even protect against some types of cancer, which has only further broadened their appeal. But for people who hate needles, these medications hold a glaring, obvious drawback: They require taking a weekly shot.Now, though, on platforms like Instagram and Facebook, ads for oral knock-off versions of GLP-1 drugs are proliferating. After the brand-name GLP-1 drugs went into shortage in 2022, a booming industry of “compounding” pharmacies and telehealth clinics arose to offer copies of the medications, as they are legally permitted to do when shortages exist. But unlike the pharma giants that produce the originals, these virtual clinics and specialty pharmacies are offering versions of semaglutide and tirzepatide for weight loss that are taken by mouth. They offer lozenges, tablets, pills, cheek gels, drops, and dissolving strips, promising to deliver the same active ingredients as the trademark medications without the injections.It’s an appealing prospect—especially since these drugs are offered at a fraction of the price of their name-brand counterparts and are often shipped overnight after a prospective patient fills out a quick online questionnaire. A month’s supply of semaglutide lozenges with vitamin B6 added from the telehealth startup Strut, for example, costs $149 without insurance, versus Wegovy’s $1,000-plus price tag.“As a pharmacist, I can appreciate the excitement in the rise in oral semaglutide, since it is an easier route than injectables,” says Melinda Lee, a pharmacist who runs the pharmaceutical packaging company Parcel Health as well as a GLP-1 drug availability database. Oral versions also don’t need to be refrigerated like injectables, which makes them easier to ship and store. But although she understands the enthusiasm, Lee remains skeptical. While taking a drug by mouth might be more appealing than a needle, when it comes to GLP-1s, the evidence that they’re as effective just isn’t there yet, she says.Unlike the brand-name drugs Ozempic, Wegovy, Mounjaro, and Zepbound, compounded versions haven’t been rigorously tested in clinical trials, and they’re not approved by the Food and Drug Administration. And although by law they must contain the same active ingredient as the drug they mimic, these orally formulated medications may not work nearly as well as the injectable drugs.Maria Daniela Hurtado Andrade, an obesity specialist at the Mayo Clinic in Jacksonville, Florida, says she doesn’t recommend oral compounded GLP-1 medications to her patients. “I do not consider them, I do not prescribe them, and I do not endorse them,” she says.The only approved oral GLP-1 drug is Rybelsus, a pill for type 2 diabetes from Novo Nordisk, the same company that makes semaglutide and sells it as Ozempic and Wegovy. A lower-dose version of this drug, Rybelsus didn’t take off in the same way that Ozempic did, despite the obvious appeal of a pill option. Research suggests it is less effective for weight loss, and it has never been approved for that purpose.With the explosion in popularity of injectable GLP-1s, pharmaceutical companies are now in a heated race to develop weight-loss pills that are just as effective. Novo Nordisk is working on a new obesity pill, amycretin. Eli Lilly, the company that makes Mounjaro and Zepbound (its brand names for tirzepatide), is developing one called orforglipron. While the pharmaceutical companies plod along the long drug development and regulatory process required of new medications, some pharmacies have already leapt into the oral market by categorizing their products as duplicates of the injectable meds.Gut CheckWhile most compounded versions are injectables like the drugs they’re replicating, oral versions are increasingly visible in the market. LegitScript, a company that provides health care industry certifications for telehealth providers and pharmacies, estimates that between 20 and 30 percent of merchants selling GLP-1s offer oral versions.Robert MacArthur, director of pharmacy at the Rockefeller University Hospital in New York, says there’s a long precedent in the US of compounding custom-made drugs to meet the needs of patients—whether due to shortages or because a specific patient’s needs aren’t being met by what’s available. “Historically, a physician could decide that he or she wanted to treat a patient with a certain drug and give it in a certain route of administration. They can write the prescription and give that to the pharmacist, and then the pharmacist makes it,” he says. Compounding pharmacies have to follow certain rules on the purity and quality of the active ingredients they use, but can otherwise compound drugs in different forms, even if an FDA-approved version of it doesn’t exist.However, that doesn’t mean compounders can always create new delivery methods easily. Daniel Drucker, a professor of medicine at the University of Toronto who made important discoveries in the 1980s about the GLP-1 hormone—which these drugs mimic—says reformulating an injectable drug into an oral version isn’t that simple.Unlike most drugs, which are small molecules that are chemically synthesized into pill form, GLP-1 medications are large molecules that are not easily taken up by the gastrointestinal tract. Large molecules tend to degrade significantly during digestion, reducing the amount of drug that enters circulation—what’s known as bioavailability.“The gut is a harsh environment,” Drucker says. It helps rid the body of toxins, chemicals, heavy metals, and microbes that could be harmful. That makes oral drug delivery a challenge. “It’s extraordinarily difficult to bypass those mechanisms to allow enough drug to be absorbed in an efficient manner,” he says.Ozempic’s maker, Novo Nordisk, managed to make an oral version of semaglutide by adding an ingredient called SNAC, which acts as an absorption enhancer. The resulting drug, Rybelsus, was approved by the FDA in 2019. A study by Novo’s own scientists found that the drug’s bioavailability is less than 1 percent—meaning even with SNAC, just 1 percent of oral semaglutide ends up being absorbed.“The question is, could other pharmacies make an absorption enhancer, coformulate it with semaglutide or tirzepatide, and have meaningful levels of drug absorbed to be able to deliver a useful pharmacological effect?” Drucker says. “I would be surprised if that could be achieved.”Sarah Gibson, the founder and CEO of Vitality Health Matrix, which is focused on women’s metabolic health, says her medical practice tried offering compounded GLP-1 pills to patients for about six months. “The results were not as good,” she says, adding that it’s harder for people to remember to take a pill every day than the weekly shot.Oral FixationSome compounders acknowledge this limitation with GLP-1 pills and are making sublingual products instead—including drops that are placed under the tongue.Phipps Pharmacy, a compounder based in Tennessee, posted videos on Instagram and TikTok earlier this year announcing the availability of sublingual semaglutide drops. In the videos, the pharmacy’s founder and CEO Jay Phipps says the drops should be held for 90 seconds to allow them to be absorbed by the blood vessels under the tongue. He says the pharmacy has been working with a partner in Texas, which has developed a base to allow large molecules like semaglutide to be absorbed under the tongue.InHealth Specialty Pharmacy, a compounder in North Dakota, advertises caramel-flavored semaglutide drops. According to the compounder’s website, the drops include an oil-based substance called SubMagna designed to enhance the delivery of large molecules through the mucosal lining of the mouth, into the bloodstream.SubMagna is sold by the Professional Compounding Centers of America (PCCA), which conducted proof-of-concept studies showing that, when added to semaglutide, it was absorbed by human oral tissues in a lab dish and was detectable in the blood plasma of mice after administration. There are no published studies showing its efficacy for weight loss in animals or people. PCCA did not respond to a request for comment.One telehealth company called CheekyMD advertises its “innovative delivery method” of a gel meant to dissolve on the inside of the cheek for delivering compounded semaglutide. The company’s website claims that this route of administration has “better bioavailability and a quicker onset of action” than “traditional oral pills.” It is unclear what scientific evidence these claims are based on. CheekyMD declined to comment for this story; the company did not respond when WIRED asked for the names of compounding pharmacies it uses as suppliers.WIRED also reached out to a number of other telehealth companies offering oral semaglutide and tirzepatide, looking for more information about how they source these medications and what clinical evidence they use to back up assertions of efficacy, including Strut, Henry Meds, Willow, Zealthy, and Ivy RX, none of which responded to repeated requests for comment. The virtual clinic Eden’s spokespersons initially responded, but then stopped answering emails.When WIRED had a telehealth appointment with a medical professional associated with Henry Meds this summer (in the course of reporting a different story on the compounding industry), the practitioner advised against Henry’s oral drops, noting that there was not as much evidence of efficacy compared to the injectable option. Henry Meds nonetheless advertises oral tirzepatide as the “brand doctors recommend.”Some compounders are deliberately avoiding the oral market because they feel the evidence isn’t there. “Our research and development team of pharmacists don’t really believe in the efficacy of oral GLP-1 meds,” says Josh Fritzler, sales and finance director of the Florida-based compounder Olympia Pharmaceuticals. “We don’t believe that it works.”For those who still want to give compounded oral GLP-1s a try, Lemrey “Al” Carter, executive director and secretary of the National Association of Boards of Pharmacy (NABP), recommends only buying from accredited online pharmacies. The nonprofit organization maintains the website safe.pharmacy, where users can find out if a pharmacy’s website is accredited by NABP or is on NABP's Not Recommended List.Caroline Apovian, codirector of the Center for Weight Management and Wellness at Brigham and Women’s Hospital in Boston, says that because compounded drugs are not reviewed for safety, quality, and effectiveness, there is potential for variation across compounded medications. “I am against all of these products,” she says. “We have no idea what’s in them.”",
  "image": "https://media.wired.com/photos/673381fee260e268456daf93/191:100/w_1280,c_limit/111224_GLP-1%20Series%20-%20Compound%20Oral%20Form.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp\u003e\u003cspan\u003eSince they debuted,\u003c/span\u003e injectable GLP-1 drugs like Ozempic have been in high demand. In addition to treating \u003ca href=\"https://www.wired.com/tag/diabetes/\"\u003ediabetes\u003c/a\u003e and obesity, these medications have cardiovascular benefits, and there’s evidence they may curb addiction and possibly even protect against some types of \u003ca href=\"https://www.wired.com/tag/cancer/\"\u003ecancer\u003c/a\u003e, which has only further broadened their appeal. But for people who hate needles, these medications hold a glaring, obvious drawback: They require taking a weekly shot.\u003c/p\u003e\u003cp\u003eNow, though, on platforms like Instagram and Facebook, ads for oral knock-off versions of GLP-1 drugs are proliferating. After the brand-name GLP-1 drugs went into shortage in 2022, a booming industry of “compounding” pharmacies and telehealth clinics arose to offer copies of the medications, as they are legally permitted to do when shortages exist. But unlike the pharma giants that produce the originals, these virtual clinics and specialty pharmacies are offering versions of semaglutide and tirzepatide for weight loss that are taken by mouth. They offer lozenges, tablets, pills, cheek gels, drops, and dissolving strips, promising to deliver the same active ingredients as the trademark medications without the injections.\u003c/p\u003e\u003cp\u003eIt’s an appealing prospect—especially since these drugs are offered at a fraction of the price of their name-brand counterparts and are often shipped overnight after a prospective patient fills out a \u003ca href=\"https://www.wired.com/story/glp1-ozempic-wegovy-semaglutide-compounding-pharmacies-hims-reflexmd-alan-meds-henry-ro-getthinmd/\"\u003equick online questionnaire.\u003c/a\u003e A month’s supply of semaglutide lozenges with vitamin B6 added from the \u003ca data-offer-url=\"https://www.struthealth.com/womens-weight-loss/semaglutide\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.struthealth.com/womens-weight-loss/semaglutide\u0026#34;}\" href=\"https://www.struthealth.com/womens-weight-loss/semaglutide\" rel=\"nofollow noopener\" target=\"_blank\"\u003etelehealth startup Strut\u003c/a\u003e, for example, costs $149 without insurance, versus Wegovy’s $1,000-plus price tag.\u003c/p\u003e\u003cp\u003e“As a pharmacist, I can appreciate the excitement in the rise in oral semaglutide, since it is an easier route than injectables,” says Melinda Lee, a pharmacist who runs the pharmaceutical packaging company Parcel Health as well as a GLP-1 drug availability database. Oral versions also don’t need to be refrigerated like injectables, which makes them easier to ship and store. But although she understands the enthusiasm, Lee remains skeptical. While taking a drug by mouth might be more appealing than a needle, when it comes to GLP-1s, the evidence that they’re as effective just isn’t there yet, she says.\u003c/p\u003e\u003cp\u003eUnlike the brand-name drugs Ozempic, Wegovy, Mounjaro, and Zepbound, compounded versions haven’t been rigorously tested in clinical trials, and they’re not approved by the Food and Drug Administration. And although by law they must contain the same active ingredient as the drug they mimic, these orally formulated medications may not work nearly as well as the injectable drugs.\u003c/p\u003e\u003cp\u003eMaria Daniela Hurtado Andrade, an obesity specialist at the Mayo Clinic in Jacksonville, Florida, says she doesn’t recommend oral compounded GLP-1 medications to her patients. “I do not consider them, I do not prescribe them, and I do not endorse them,” she says.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe only approved oral GLP-1 drug is Rybelsus, a pill for type 2 diabetes from Novo Nordisk, the same company that makes semaglutide and sells it as Ozempic and Wegovy. A lower-dose version of this drug, Rybelsus didn’t take off in the same way that Ozempic did, despite the obvious appeal of a pill option. Research \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC8269445/pdf/fendo-12-645617.pdf\"\u003esuggests\u003c/a\u003e it is less effective for weight loss, and it has never been approved for that purpose.\u003c/p\u003e\u003cp\u003eWith the explosion in popularity of injectable GLP-1s, pharmaceutical companies are \u003ca href=\"https://www.wired.com/story/age-of-ozempic-next-generation-new-weight-loss-drugs-ozempic-wegovy-zepbound-mounjaro/\"\u003enow in a heated race to develop weight-loss pills that are just as effective\u003c/a\u003e. Novo Nordisk is working on a new obesity pill, amycretin. Eli Lilly, the company that makes Mounjaro and Zepbound (its brand names for tirzepatide), is developing one called orforglipron. While the pharmaceutical companies plod along the long drug development and regulatory process required of new medications, some pharmacies have already leapt into the oral market by categorizing their products as duplicates of the injectable meds.\u003c/p\u003e\u003ch2\u003eGut Check\u003c/h2\u003e\u003cp\u003eWhile most compounded versions are injectables like the drugs they’re replicating, oral versions are increasingly visible in the market. LegitScript, a company that provides health care industry certifications for telehealth providers and pharmacies, estimates that between 20 and 30 percent of merchants selling GLP-1s offer oral versions.\u003c/p\u003e\u003cp\u003eRobert MacArthur, director of pharmacy at the Rockefeller University Hospital in New York, says there’s a long precedent in the US of compounding custom-made drugs to meet the needs of patients—whether due to shortages or because a specific patient’s needs aren’t being met by what’s available. “Historically, a physician could decide that he or she wanted to treat a patient with a certain drug and give it in a certain route of administration. They can write the prescription and give that to the pharmacist, and then the pharmacist makes it,” he says. Compounding pharmacies have to follow certain rules on the purity and quality of the active ingredients they use, but can otherwise compound drugs in different forms, even if an FDA-approved version of it doesn’t exist.\u003c/p\u003e\u003cp\u003eHowever, that doesn’t mean compounders can always create new delivery methods easily. Daniel Drucker, a professor of medicine at the University of Toronto who made important discoveries in the 1980s about the GLP-1 hormone—which these drugs mimic—says reformulating an injectable drug into an oral version isn’t that simple.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eUnlike most drugs, which are small molecules that are chemically synthesized into pill form, GLP-1 medications are large molecules that are not easily taken up by the gastrointestinal tract. Large molecules tend to degrade significantly during digestion, reducing the amount of drug that enters circulation—what’s known as bioavailability.\u003c/p\u003e\u003cp\u003e“The gut is a harsh environment,” Drucker says. It helps rid the body of toxins, chemicals, heavy metals, and microbes that could be harmful. That makes oral drug delivery a challenge. “It’s extraordinarily difficult to bypass those mechanisms to allow enough drug to be absorbed in an efficient manner,” he says.\u003c/p\u003e\u003cp\u003eOzempic’s maker, Novo Nordisk, managed to make an oral version of semaglutide by \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9515042/\"\u003eadding an ingredient called SNAC\u003c/a\u003e, which acts as an absorption enhancer. The resulting drug, Rybelsus, was approved by the FDA in 2019. A \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC8505367/\"\u003estudy by Novo’s own scientists\u003c/a\u003e found that the drug’s bioavailability is less than 1 percent—meaning even with SNAC, just 1 percent of oral semaglutide ends up being absorbed.\u003c/p\u003e\u003cp\u003e“The question is, could other pharmacies make an absorption enhancer, coformulate it with semaglutide or tirzepatide, and have meaningful levels of drug absorbed to be able to deliver a useful pharmacological effect?” Drucker says. “I would be surprised if that could be achieved.”\u003c/p\u003e\u003cp\u003eSarah Gibson, the founder and CEO of Vitality Health Matrix, which is focused on women’s metabolic health, says her medical practice tried offering compounded GLP-1 pills to patients for about six months. “The results were not as good,” she says, adding that it’s harder for people to remember to take a pill every day than the weekly shot.\u003c/p\u003e\u003ch2\u003eOral Fixation\u003c/h2\u003e\u003cp\u003eSome compounders acknowledge this limitation with GLP-1 pills and are making sublingual products instead—including drops that are placed under the tongue.\u003c/p\u003e\u003cp\u003ePhipps Pharmacy, a compounder based in Tennessee, \u003ca data-offer-url=\"https://www.instagram.com/phippspharmacy/reel/C4JGbYKxh9U/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.instagram.com/phippspharmacy/reel/C4JGbYKxh9U/\u0026#34;}\" href=\"https://www.instagram.com/phippspharmacy/reel/C4JGbYKxh9U/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eposted videos on Instagram\u003c/a\u003e \u003ca data-offer-url=\"https://www.tiktok.com/@phipps.pharmacy/video/7342957284479388974\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.tiktok.com/@phipps.pharmacy/video/7342957284479388974\u0026#34;}\" href=\"https://www.tiktok.com/@phipps.pharmacy/video/7342957284479388974\" rel=\"nofollow noopener\" target=\"_blank\"\u003eand TikTok earlier this year\u003c/a\u003e announcing the availability of sublingual semaglutide drops. In the videos, the pharmacy’s founder and CEO Jay Phipps says the drops should be held for 90 seconds to allow them to be absorbed by the blood vessels under the tongue. He says the pharmacy has been working with a partner in Texas, which has developed a base to allow large molecules like semaglutide to be absorbed under the tongue.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eInHealth Specialty Pharmacy, a compounder in North Dakota, \u003ca data-offer-url=\"https://www.inhealthcompounding.com/semaglutide\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.inhealthcompounding.com/semaglutide\u0026#34;}\" href=\"https://www.inhealthcompounding.com/semaglutide\" rel=\"nofollow noopener\" target=\"_blank\"\u003eadvertises caramel-flavored semaglutide drops\u003c/a\u003e. According to the compounder’s website, the drops include an oil-based substance called SubMagna designed to enhance the delivery of large molecules through the mucosal lining of the mouth, into the bloodstream.\u003c/p\u003e\u003cp\u003eSubMagna is sold by the Professional Compounding Centers of America (PCCA), which \u003ca data-offer-url=\"https://grangerrx.com/wp-content/uploads/2024/08/Technical-Reports-Compounded-Semaglutide-in-SubMagna%E2%84%A2-HMW.pdf\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://grangerrx.com/wp-content/uploads/2024/08/Technical-Reports-Compounded-Semaglutide-in-SubMagna%E2%84%A2-HMW.pdf\u0026#34;}\" href=\"https://grangerrx.com/wp-content/uploads/2024/08/Technical-Reports-Compounded-Semaglutide-in-SubMagna%E2%84%A2-HMW.pdf\" rel=\"nofollow noopener\" target=\"_blank\"\u003econducted proof-of-concept studies\u003c/a\u003e showing that, when added to semaglutide, it was absorbed by human oral tissues in a lab dish and was detectable in the blood plasma of mice after administration. There are no published studies showing its efficacy for weight loss in animals or people. PCCA did not respond to a request for comment.\u003c/p\u003e\u003cp\u003eOne telehealth company called CheekyMD advertises its “innovative delivery method” of a gel meant to dissolve on the inside of the cheek for delivering compounded semaglutide. The company’s website claims that this route of administration has “better bioavailability and a quicker onset of action” than “traditional oral pills.” It is unclear what scientific evidence these claims are based on. CheekyMD declined to comment for this story; the company did not respond when WIRED asked for the names of compounding pharmacies it uses as suppliers.\u003c/p\u003e\u003cp\u003eWIRED also reached out to a number of other telehealth companies offering oral semaglutide and tirzepatide, looking for more information about how they source these medications and what clinical evidence they use to back up assertions of efficacy, including Strut, Henry Meds, Willow, Zealthy, and Ivy RX, none of which responded to repeated requests for comment. The virtual clinic Eden’s spokespersons initially responded, but then stopped answering emails.\u003c/p\u003e\u003cp\u003eWhen WIRED had a telehealth appointment with a medical professional associated with Henry Meds this summer (in the course of reporting a different story on the compounding industry), the practitioner advised against Henry’s oral drops, \u003ca href=\"https://www.wired.com/story/glp1-ozempic-wegovy-semaglutide-compounding-pharmacies-hims-reflexmd-alan-meds-henry-ro-getthinmd/\"\u003enoting\u003c/a\u003e that there was not as much evidence of efficacy compared to the injectable option. Henry Meds nonetheless advertises oral tirzepatide as the “brand doctors recommend.”\u003c/p\u003e\u003cp\u003eSome compounders are deliberately avoiding the oral market because they feel the evidence isn’t there. “Our research and development team of pharmacists don’t really believe in the efficacy of oral GLP-1 meds,” says Josh Fritzler, sales and finance director of the Florida-based compounder Olympia Pharmaceuticals. “We don’t believe that it works.”\u003c/p\u003e\u003cp\u003eFor those who still want to give compounded oral GLP-1s a try, Lemrey “Al” Carter, executive director and secretary of the National Association of Boards of Pharmacy (NABP), recommends only buying from accredited online pharmacies. The nonprofit organization maintains the website \u003ca data-offer-url=\"https://safe.pharmacy/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://safe.pharmacy/\u0026#34;}\" href=\"https://safe.pharmacy/\" rel=\"nofollow noopener\" target=\"_blank\"\u003esafe.pharmacy\u003c/a\u003e, where users can find out if a pharmacy’s website is accredited by NABP or is on NABP\u0026#39;s Not Recommended List.\u003c/p\u003e\u003cp\u003eCaroline Apovian, codirector of the Center for Weight Management and Wellness at Brigham and Women’s Hospital in Boston, says that because compounded drugs are not reviewed for safety, quality, and effectiveness, there is potential for variation across compounded medications. “I am against all of these products,” she says. “We have no idea what’s in them.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-11-20T06:30:00-05:00",
  "modifiedTime": "2024-11-20T11:30:00Z"
}
