{
  "id": "bd0fb6e9-0684-42ed-be28-e92f51432c08",
  "title": "As Measles Continues to Rise, CDC Muffles Vaccine Messaging",
  "link": "https://www.scientificamerican.com/article/as-measles-continues-to-rise-cdc-muffles-vaccine-messaging/",
  "description": "By burying an assessment with updates and recommendations about the U.S.’s current measles outbreaks, the CDC has signaled an alarming shift in its public messaging",
  "author": "",
  "published": "Mon, 31 Mar 2025 20:15:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Jen Schwartz",
  "length": 4114,
  "excerpt": "By burying an assessment with updates and recommendations about the U.S.’s current measles outbreaks, the CDC has signaled an alarming shift in its public messaging",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "By burying an assessment with updates and recommendations about the U.S.’s current measles outbreaks, the CDC has signaled an alarming shift in its public messagingA health worker prepares a dose of the measles vaccine at a health center in Lubbock, Texas, on February 27, 2025. Ronaldo Schemidt/AFP via Getty ImagesAs measles outbreaks have continued to spread in 19 U.S. states, leaders at the Centers for Disease Control and Prevention have buried a new assessment by their own experts that found there is a high risk of catching measles in areas where vaccination rates are low, according to an article published by ProPublica on March 28. The assessment had also called for a messaging strategy to encourage vaccination against the potentially deadly disease. But that plan was aborted, signaling a shift in how the agency may be responding to pressure from vaccine critic Robert F. Kennedy, Jr., who is now secretary of health and human services.Why It MattersMeasles, caused by a highly contagious and dangerous virus, is very effectively prevented by the measles-mumps-rubella (MMR) vaccine. But rates of vaccination in the U.S. have been declining in recent years. Historically, the CDC’s messaging strategy for encouraging vaccination emphasized the importance of protecting both oneself and the community at large, especially vulnerable people who cannot yet get vaccinated such as young babies. What’s alarming about the CDC’s recent inaction is not just its decision to bury the news, health experts say, but also the agency’s justification for doing so: in a statement to ProPublica, a CDC spokesperson wrote, “The decision to vaccinate is a personal one,” a message that does not reflect long-standing scientific consensus but rather echoes the sentiment of vaccine critics such as Kennedy.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.Why Vaccine Skepticism Remains a Big ProblemVaccines, especially the MMR vaccine, have been a target of rampant misinformation in recent years. A single fraudulent study had claimed a connection between the MMR vaccine and autism, but that link was debunked years ago. Many other studies have searched for a connection and failed to find one. But lack of trust in vaccine safety remains a big public health issue: A recent survey conducted by the University of Pennsylvania found that the percentage of people who believed that already-approved vaccines were unsafe jumped from 9 percent all the way up to 16 percent between 2021 and 2023. Measles was declared eliminated from the U.S. in 2000, which means it does not circulate on its own. But outbreaks are becoming more common. The total number of people who have tested positive for measles so far this year is already higher than any full year since 2019.What This means for the CDC and Public Health MessagingPublic health officials learned a lot from the COVID pandemic. Chief among those lessons was that frequent and transparent communication is key to establishing and maintaining trust with the public, say public health educators. Withholding essential updates and best practices undermines those goals. It can also prevent data and guidance from reaching local public health services in a timely manner.What You Can Do to Protect YourselfIf you’re an adult who was vaccinated against MMR as a child, you can check to see if you’re still protected with a simple blood test. If you were born between 1957 and 1975, you likely only got one dose of the vaccine instead of the standard two doses that are given today. The second dose boosts the efficacy of the vaccine’s protection against measles from 93 percent to 97 percent. If you had only received one dose and live in an area where an outbreak is occurring or work in certain environments such as health care facilities, you might want to talk to your health care provider about your risk and consider an additional dose.",
  "image": "https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eBy burying an assessment with updates and recommendations about the U.S.’s current measles outbreaks, the CDC has signaled an alarming shift in its public messaging\u003c/p\u003e\u003cfigure\u003e\u003cimg src=\"https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026amp;w=600\" alt=\"Blue plastic tray containing vaccine supplies\" srcset=\"https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026amp;w=900 900w, https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/4b33f01c5902c0ac/original/measles-vaccine.jpg?m=1743451458.101\u0026amp;w=1350 1350w\" sizes=\"(min-width: 900px) 900px, (min-resolution: 2dppx) 75vw, (min-resolution: 2.1dppx) 50vw, 100vw\" fetchpriority=\"high\"/\u003e\u003cfigcaption\u003e\u003cp\u003eA health worker prepares a dose of the measles vaccine at a health center in Lubbock, Texas, on February 27, 2025.\u003c/p\u003e \u003cp\u003eRonaldo Schemidt/AFP via Getty Images\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAs measles outbreaks have continued to spread in 19 U.S. states, leaders at the Centers for Disease Control and Prevention have buried a new assessment by their own experts that found there is a high risk of catching measles in areas where vaccination rates are low, \u003ca href=\"https://www.propublica.org/article/measles-vaccine-rfk-cdc-report\"\u003eaccording to an article published by ProPublica on March 28\u003c/a\u003e. The assessment had also called for a messaging strategy to encourage vaccination against the potentially deadly disease. But that plan was aborted, signaling a shift in how the agency may be responding to pressure from vaccine critic Robert F. Kennedy, Jr., who is now secretary of health and human services.\u003c/p\u003e\u003ch2 id=\"why-it-matters\" data-block=\"sciam/heading\"\u003e\u003cb\u003eWhy It Matters\u003c/b\u003e\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.scientificamerican.com/article/as-measles-cases-surge-scientists-explain-why-vaccination-is-critical/\"\u003eMeasles, caused by a highly contagious and dangerous virus\u003c/a\u003e, is very effectively prevented by the measles-mumps-rubella (MMR) vaccine. But rates of vaccination in the U.S. \u003ca href=\"https://www.scientificamerican.com/article/see-how-measles-outbreaks-flourish-where-vaccination-rates-fall/\"\u003ehave been declining in recent years\u003c/a\u003e. Historically, the CDC’s messaging strategy for encouraging vaccination emphasized the importance of protecting both oneself and the community at large, especially vulnerable people who cannot yet get vaccinated such as young babies. What’s alarming about the CDC’s recent inaction is not just its decision to bury the news, health experts say, but also the agency’s justification for doing so: in a statement to ProPublica, a CDC spokesperson wrote, “The decision to vaccinate is a personal one,” a message that does not reflect long-standing scientific consensus but rather echoes the sentiment of vaccine critics such as Kennedy.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003ch2 id=\"why-vaccine-skepticism-remains-a-big-problem\" data-block=\"sciam/heading\"\u003e\u003cb\u003eWhy Vaccine Skepticism Remains a Big Problem\u003c/b\u003e\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eVaccines, especially the MMR vaccine, have been a target of rampant misinformation in recent years. A single fraudulent study had claimed a connection between the MMR vaccine and autism, but that link was debunked years ago. Many other studies have searched for a connection and \u003ca href=\"https://www.cdc.gov/vaccine-safety/vaccines/mmr.html\"\u003efailed to find one\u003c/a\u003e. But lack of trust in vaccine safety remains a big public health issue: A recent survey conducted by the University of Pennsylvania found that the percentage of people who believed that already-approved vaccines were unsafe \u003ca href=\"https://www.cidrap.umn.edu/anti-science/us-survey-reveals-growing-distrust-vaccines-embrace-untruths#:~:text=The%20center%20fielded%20its%2013th,to%2071%25%20in%20fall%202023.\"\u003ejumped from 9 percent all the way up to 16 percent\u003c/a\u003e between 2021 and 2023. Measles was declared eliminated from the U.S. in 2000, which means it does not circulate on its own. But outbreaks are becoming more common. The total number of people who have tested positive for measles so far this year is already higher than any full year since 2019.\u003c/p\u003e\u003ch2 id=\"what-this-means-for-the-cdc-and-public-health-messaging\" data-block=\"sciam/heading\"\u003e\u003cb\u003eWhat This means for the CDC and Public Health Messaging\u003c/b\u003e\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003ePublic health officials learned a lot from the COVID pandemic. Chief among those lessons was that \u003ca href=\"https://www.scientificamerican.com/article/why-so-many-americans-are-skeptical-of-a-coronavirus-vaccine/\"\u003efrequent and transparent communication is key to establishing and maintaining trust with the public\u003c/a\u003e, say public health educators. Withholding essential updates and best practices undermines those goals. It can also prevent data and guidance from reaching local public health services in a timely manner.\u003c/p\u003e\u003ch2 id=\"what-you-can-do-to-protect-yourself\" data-block=\"sciam/heading\"\u003e\u003cb\u003eWhat You Can Do to Protect Yourself\u003c/b\u003e\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf you’re an adult who was vaccinated against MMR as a child, \u003ca href=\"https://www.scientificamerican.com/article/how-to-check-if-you-have-immunity-to-measles-or-need-another-dose/\"\u003eyou can check to see if you’re still protected\u003c/a\u003e with a simple blood test. If you were born between 1957 and 1975, you likely only got one dose of the vaccine instead of the standard two doses that are given today. The second dose boosts the efficacy of the vaccine’s protection against measles from 93 percent to 97 percent. If you had only received one dose and live in an area where an outbreak is occurring or work in certain environments such as health care facilities, you might want to talk to your health care provider about your risk and consider an additional dose.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-31T16:15:00-04:00",
  "modifiedTime": null
}
