{
  "id": "bfc47304-ef1a-49e7-87fa-6a2c9b9f6866",
  "title": "Emotions 2.0: When I Feel What You Feel",
  "link": "https://www.stitcher.com",
  "description": "This week, we kick off our new series, Emotions 2.0, with a special double episode about the emotions we experience with other people. We often think that emotions like happiness or sadness live inside our individual minds. But if you’ve ever gone to a music concert in a big stadium or attended a political rally with like-minded voters, you know that emotions can move through crowds in powerful ways. We begin with psychologist Amit Goldenberg, who studies how emotions spread and ratchet up in intensity as more people experience them. Then, we bring you a favorite 2022 conversation with anthropologist Dimitris Xygalatas, who takes us inside the world of fire walking to explore the emotional power of rituals. If you love Hidden Brain, you can help support our work by becoming a member of Hidden Brain+! Your subscription includes bonus episodes you won't hear anywhere else, plus you'll be helping us to continue bringing you ideas and insights for years to come. You can sign up via Apple Podcasts or our Patreon page. Thanks for your support!",
  "author": "Hidden Brain Media",
  "published": "Mon, 21 Oct 2024 19:00:00 +0000",
  "source": "https://feeds.npr.org/510308/podcast.xml",
  "categories": null,
  "byline": "",
  "length": 384,
  "excerpt": "Stitcher is the easiest way to listen, download, and discover podcasts for free across iOS, Android, Web, and more. Access exclusive podcasts from your favorite hosts with Stitcher Premium.",
  "siteName": "Stitcher",
  "favicon": "https://www.stitcher.com/favicons/apple-touch-icon.png",
  "text": "We’re proud to be home to some of the best production talent around -- a team of people who make incredible podcasts for our Stitcher Studios original network. And, we not only help our internal creators drive revenue for their shows but also support the larger creator community by helping them monetize their work through the SiriusXM Podcast Network, PodSwag, and Stitcher Premium.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-v-15421cbf=\"\" data-v-15421cbf=\"\"\u003e\u003cp data-v-15421cbf=\"\"\u003e\n          We’re proud to be home to some of the best production talent around -- a team of people who make incredible podcasts for our Stitcher Studios original network. And, we not only help our internal creators drive revenue for their shows but also support the larger creator community by helping them monetize their work through the SiriusXM Podcast Network, PodSwag, and Stitcher Premium.\n        \u003c/p\u003e  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
