{
  "id": "c85441a8-6b60-4f91-8922-ba99e4bf136f",
  "title": "DNA of 1,000 year-old maize sheds light on origins of globally important food crop",
  "link": "https://www.sciencedaily.com/releases/2024/12/241205145540.htm",
  "description": "Researchers have tested ancient DNA from corn found at archaeological sites in Arkansas, shedding new light on the dispersal of one of the world's most important food crops.",
  "author": "",
  "published": "Thu, 05 Dec 2024 14:55:40 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2712,
  "excerpt": "Researchers have tested ancient DNA from corn found at archaeological sites in Arkansas, shedding new light on the dispersal of one of the world's most important food crops.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Researchers have tested ancient DNA from corn found at archaeological sites in Arkansas, shedding new light on the dispersal of one of the world’s most important food crops. By reconstructing the genomes of archaeological maize cobs and kernels, the study, by researchers at the University of York and the University of Copenhagen, revealed that 1,000-year-old maize from rockshelters in the Ozark region of Arkansas, US, shares a close genetic link with modern Northern Flint varieties. These hardy varieties are cold-adapted and are the ancestors for commercially important maize grown around the world. Researchers say that understanding its origins and journey through different geographical regions could help find new ways of sustaining and improving crops today, as pressures on global food supply increases and crop health is challenged by climate change.  Researchers showed that maize underwent selection as it was transported from the US Southwest across the Great Plains, particularly through a gene, known as waxy1. Genetic variants in the waxy1 gene affect the stickiness and chewiness of maize, traits that are still valued in some traditional cuisines today. This suggests that farmers 1,000 years ago were not just engaged in planting and harvesting, but in selecting traits that could help in breeding and producing the best quality yield for food, not too dissimilar to farmers today. Dr Nathan Wales, from the University of York’s Department of Archaeology, said: “We know that maize was domesticated in Mexico, but it has long been debated what route it took to regions of the US to become what it is today - one of the most globally important food crops. “We now have a clearer idea of the journey it took from Mexico, and we better appreciate how regional varieties can become more globally significant than varieties grown near the domestication centre. It is valuable information for crop breeders because they can chart the evolution of the crop, reintroduce any lost genetic diversity or develop new varieties, which could be vital to helping food shortages in the future.” Ancient maize genomes from the Ozark rockshelters indicated that maize entered eastern North America at least twice, tracing ancestry to both the upland US Southwest and southern Texas. Dr Jazmín Ramos-Madrigal, from the Globe Institute at the University of Copenhagen in Denmark, said: “We also showed that maize could only be introduced into eastern North America once humans bred local varieties with the genetic tools to cope with the challenging environment of the region, which goes someway to demonstrating the skills and knowledge of farmers 1,000 years ago.” The study is published in the journal Cell.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eResearchers have tested ancient DNA from corn found at archaeological sites in Arkansas, shedding new light on the dispersal of one of the world’s most important food crops.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eBy reconstructing the genomes of archaeological maize cobs and kernels, the study, by researchers at the University of York and the University of Copenhagen, revealed that 1,000-year-old maize from rockshelters in the Ozark region of Arkansas, US, shares a close genetic link with modern Northern Flint varieties.\u003c/p\u003e\n\u003cp\u003eThese hardy varieties are cold-adapted and are the ancestors for commercially important maize grown around the world. Researchers say that understanding its origins and journey through different geographical regions could help find new ways of sustaining and improving crops today, as pressures on global food supply increases and crop health is challenged by climate change. \u003c/p\u003e\n\u003cp\u003eResearchers showed that maize underwent selection as it was transported from the US Southwest across the Great Plains, particularly through a gene, known as waxy1. Genetic variants in the waxy1 gene affect the stickiness and chewiness of maize, traits that are still valued in some traditional cuisines today.\u003c/p\u003e\n\u003cp\u003eThis suggests that farmers 1,000 years ago were not just engaged in planting and harvesting, but in selecting traits that could help in breeding and producing the best quality yield for food, not too dissimilar to farmers today.\u003c/p\u003e\n\u003cp\u003eDr Nathan Wales, from the University of York’s Department of Archaeology, said: “We know that maize was domesticated in Mexico, but it has long been debated what route it took to regions of the US to become what it is today - one of the most globally important food crops.\u003c/p\u003e\n\u003cp\u003e“We now have a clearer idea of the journey it took from Mexico, and we better appreciate how regional varieties can become more globally significant than varieties grown near the domestication centre. It is valuable information for crop breeders because they can chart the evolution of the crop, reintroduce any lost genetic diversity or develop new varieties, which could be vital to helping food shortages in the future.”\u003c/p\u003e\n\u003cp\u003eAncient maize genomes from the Ozark rockshelters indicated that maize entered eastern North America at least twice, tracing ancestry to both the upland US Southwest and southern Texas.\u003c/p\u003e\n\u003cp\u003eDr Jazmín Ramos-Madrigal, from the Globe Institute at the University of Copenhagen in Denmark, said: “We also showed that maize could only be introduced into eastern North America once humans bred local varieties with the genetic tools to cope with the challenging environment of the region, which goes someway to demonstrating the skills and knowledge of farmers 1,000 years ago.”\u003c/p\u003e\n\u003cp\u003eThe study is published in the journal \u003cem\u003eCell.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
