{
  "id": "e9966816-7d76-4051-9c9c-76b8309a8ee6",
  "title": "Advancement in 3D-printed concrete promises strength, durability and lower carbon emissions",
  "link": "https://www.sciencedaily.com/releases/2024/10/241025194520.htm",
  "description": "Researchers have created a graphene-enhanced, 3D-printable concrete that improves strength and reduces carbon emissions by 31%, advancing sustainable construction.",
  "author": "",
  "published": "Fri, 25 Oct 2024 19:45:20 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3590,
  "excerpt": "Researchers have created a graphene-enhanced, 3D-printable concrete that improves strength and reduces carbon emissions by 31%, advancing sustainable construction.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Researchers from the University of Virginia have made significant strides in the rapidly advancing field of 3D-printed concrete by developing a more sustainable, printable cementitious composite. This new material, which combines graphene with limestone and calcined clay cement (LC2), offers enhanced strength and durability while significantly reducing carbon emissions, making it a powerful solution for addressing the environmental challenges in 3D printed construction. \"Our goal was to design a printable concrete that performs better and is more eco-friendly,\" said Osman Ozbulut, a professor at UVA's Department of Civil and Environmental Engineering. \"The addition of graphene to LC2 cement offers a unique opportunity to lower carbon emissions while maintaining the strength and flexibility required for 3D printed construction.\" The study, which explored the flow properties, mechanical performance and environmental impacts of this material, was led by visiting scholar Tugba Baytak and UVA's Tawfeeq Gdeh, doctoral researchers at Resilient and Advanced Infrastructure Laboratory at University of Virginia. Collaborating with researchers at Virginia Transportation Research Council (VTRC), Baytak and Gdeh applied graphene -- known for its outstanding mechanical properties -- to LC2 cement, significantly improving its performance for 3D printing applications. \"This kind of innovation is essential for the future of construction, and I'm proud to be part of the team driving this forward,\" said Baytak. A key aspect of the research was a Life Cycle Assessment (LCA), conducted by Zhangfan Jiang, a postdoctoral researcher the Department of Civil and Environmental Engineering, in collaboration with Lisa Colosi Peterson, an environmental engineering professor at the University of Virginia. The LCA revealed that this graphene-enhanced LC2 concrete could reduce greenhouse gas emissions by approximately 31% compared to traditional printable concrete mixtures. \"Being able to see the full environmental footprint of this new concrete was important,\" explained Jiang. \"It not only exhibits better mechanical performance but also has a lower environmental impact, making 3D concrete construction technology more sustainable compared to traditional 3D printing methods with higher carbon emissions.\" \"It's rewarding to see science push us toward greener building practices,\" said Colosi Peterson. The partnership with VTRC allowed the UVA team to assess the material's potential applications in transportation infrastructure, further showcasing its real-world potential. \"The VTRC collaboration was essential in uncovering the fundamental properties of this new concrete,\" added Ozbulut. \"It's exciting to be part of a project that addresses both the technical demands of modern construction and the urgent need for more eco-friendly materials,\" said Gdeh. The research team included Tugba Baytak, a doctoral researcher from Istanbul Technical University and a visiting scholar at University of Virginia, Tawfeeq Gdeh, Zhangfan Jiang, Lisa Colosi, and Osman E. Ozbulut from the University of Virginia, and Gabriel Arce, a research scientist from the Virginia Transportation Research Council. The article was entitled \"Rheological, Mechanical, and Environmental Performance of Printable Graphene-Enhanced Cementitious Composites with Limestone and Calcined Clay\" published in the Journal of Building Engineering, 2024. This research was funded in part by the University of Virginia's 3 Cavaliers Program and The Scientific and Technological Research Council of Turkey (TUBITAK).",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eResearchers from the University of Virginia have made significant strides in the rapidly advancing field of 3D-printed concrete by developing a more sustainable, printable cementitious composite. This new material, which combines graphene with limestone and calcined clay cement (LC2), offers enhanced strength and durability while significantly reducing carbon emissions, making it a powerful solution for addressing the environmental challenges in 3D printed construction.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;Our goal was to design a printable concrete that performs better and is more eco-friendly,\u0026#34; said Osman Ozbulut, a professor at UVA\u0026#39;s Department of Civil and Environmental Engineering. \u0026#34;The addition of graphene to LC2 cement offers a unique opportunity to lower carbon emissions while maintaining the strength and flexibility required for 3D printed construction.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe study, which explored the flow properties, mechanical performance and environmental impacts of this material, was led by visiting scholar Tugba Baytak and UVA\u0026#39;s Tawfeeq Gdeh, doctoral researchers at Resilient and Advanced Infrastructure Laboratory at University of Virginia. Collaborating with researchers at Virginia Transportation Research Council (VTRC), Baytak and Gdeh applied graphene -- known for its outstanding mechanical properties -- to LC2 cement, significantly improving its performance for 3D printing applications.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This kind of innovation is essential for the future of construction, and I\u0026#39;m proud to be part of the team driving this forward,\u0026#34; said Baytak.\u003c/p\u003e\n\u003cp\u003eA key aspect of the research was a Life Cycle Assessment (LCA), conducted by Zhangfan Jiang, a postdoctoral researcher the Department of Civil and Environmental Engineering, in collaboration with Lisa Colosi Peterson, an environmental engineering professor at the University of Virginia. The LCA revealed that this graphene-enhanced LC2 concrete could reduce greenhouse gas emissions by approximately 31% compared to traditional printable concrete mixtures.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Being able to see the full environmental footprint of this new concrete was important,\u0026#34; explained Jiang. \u0026#34;It not only exhibits better mechanical performance but also has a lower environmental impact, making 3D concrete construction technology more sustainable compared to traditional 3D printing methods with higher carbon emissions.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s rewarding to see science push us toward greener building practices,\u0026#34; said Colosi Peterson.\u003c/p\u003e\n\n\n\u003cp\u003eThe partnership with VTRC allowed the UVA team to assess the material\u0026#39;s potential applications in transportation infrastructure, further showcasing its real-world potential. \u0026#34;The VTRC collaboration was essential in uncovering the fundamental properties of this new concrete,\u0026#34; added Ozbulut.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s exciting to be part of a project that addresses both the technical demands of modern construction and the urgent need for more eco-friendly materials,\u0026#34; said Gdeh.\u003c/p\u003e\n\u003cp\u003eThe research team included Tugba Baytak, a doctoral researcher from Istanbul Technical University and a visiting scholar at University of Virginia, Tawfeeq Gdeh, Zhangfan Jiang, Lisa Colosi, and Osman E. Ozbulut from the University of Virginia, and Gabriel Arce, a research scientist from the Virginia Transportation Research Council.\u003c/p\u003e\n\u003cp\u003eThe article was entitled \u0026#34;Rheological, Mechanical, and Environmental Performance of Printable Graphene-Enhanced Cementitious Composites with Limestone and Calcined Clay\u0026#34; published in the Journal of Building Engineering, 2024.\u003c/p\u003e\n\u003cp\u003eThis research was funded in part by the University of Virginia\u0026#39;s 3 Cavaliers Program and The Scientific and Technological Research Council of Turkey (TUBITAK).\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
