{
  "id": "f6b72d2b-62c9-4124-a18d-f614693251ec",
  "title": "NOAA's 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching",
  "link": "https://phys.org/news/2025-05-noaa-hurricane-busy-season-scientist.html",
  "description": "U.S. forecasters are expecting an above-normal 2025 Atlantic hurricane season, with 13 to 19 named storms, and 6 to 10 of those becoming hurricanes.",
  "author": "",
  "published": "Sun, 25 May 2025 16:40:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Environment"
  ],
  "byline": "Colin Zarzycki",
  "length": 9314,
  "excerpt": "U.S. forecasters are expecting an above-normal 2025 Atlantic hurricane season, with 13 to 19 named storms, and 6 to 10 of those becoming hurricanes.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: CC0 Public Domain U.S. forecasters are expecting an above-normal 2025 Atlantic hurricane season, with 13 to 19 named storms, and 6 to 10 of those becoming hurricanes. Every year, the National Oceanic and Atmospheric Administration and other forecasters release preseason outlooks for the Atlantic's hurricane season, which runs June 1 through Nov. 30. So, how do they know what's likely to happen months in the future? I'm an atmospheric scientist who studies extreme weather. Let's take a look at what Atlantic hurricane forecasts are based on and why those forecasts can shift during the season. What goes into a seasonal forecast Think of the preseason hurricane forecast as the 30,000-foot view: It can't predict if or when a storm will hit a particular location, but it can offer insight into how many storms are likely to form throughout the entire Atlantic, and how active the season overall might be. These outlooks rely heavily on two large-scale climate factors. The first is the sea surface temperature in areas where tropical cyclones tend to form and grow. Hurricanes draw their energy from warm ocean water. So when the Atlantic is unusually warm, as it has been in recent years, it provides more fuel for storms to form and intensify. Once water temperatures are 79°F (26°C), hurricanes can form. Most of the Gulf was above that by late May 2025. Credit: NOAA/NESDIS The second key ingredient that meteorologists have their eye on is the El Niño–Southern Oscillation, which forecasters refer to as ENSO. ENSO is a climate cycle that shifts every few years between three main phases: El Niño, La Niña, and a neutral space that lives somewhere in between. During El Niño, winds over the Atlantic high up in the troposphere—roughly 25,000 to 40,000 feet—strengthen and can disrupt storms and hurricanes. La Niña, on the other hand, tends to reduce these winds, making it easier for storms to form and grow. When you look over the historical hurricane record, La Niña years have tended to be busier than their El Niño counterparts, as we saw from 2020 through 2023. We're in the neutral phase as the 2025 hurricane season begins, and probably will be for at least a few more months. That means upper-level winds aren't particularly hostile to hurricanes, but they're not exactly rolling out the red carpet either. At the same time, sea surface temperatures are running warmer than the 30-year average, but not quite at the record-breaking levels seen in some recent seasons. Taken together, these conditions point to a moderately above-average hurricane season. It's important to emphasize that these factors merely load the dice, tilting the odds toward more or fewer storms, but not guaranteeing an outcome. A host of other variables influence whether a storm actually forms, how strong it becomes, and whether it ever threatens land. The smaller influences forecasters can't see yet Once hurricane season is underway, forecasters start paying close attention to shorter-term influences. These subseasonal factors evolve quickly enough that they don't shape the entire season. However, they can noticeably raise or lower the chances for storms developing in the coming two to four weeks. One factor is dust lofted from the Sahara Desert by strong winds and carried from east to west across the Atlantic. These dust plumes tend to suppress hurricanes by drying out the atmosphere and reducing sunlight that reaches the ocean surface. Dust outbreaks are next-to-impossible to predict months in advance, but satellite observations of growing plumes can give forecasters a heads-up a couple weeks before the dust reaches the primary hurricane development region off the coast of Africa. Dust blowing in from the Sahara Desert can tamp down hurricane activities by shading the ocean over the main development region for hurricanes and drying out the atmosphere, just off the African coast. This plume spread over 2,000 miles in June 2020. Credit: NASA Another key ingredient that doesn't go into seasonal forecasts but becomes important during the season are African easterly waves. These \"waves\" are clusters of thunderstorms that roll off the West African coast, tracking from east to west across the ocean. Most major storms in the Atlantic basin, especially in the peak months of August and September, can trace their origins back to one of these waves. Forecasters monitor strong waves as they begin their westward journey across the Atlantic, knowing they can provide some insight about potential risks to U.S. interests one to two weeks in advance. Also in this subseasonal mix is the Madden–Julian Oscillation. The MJO is a wave-like pulse of atmospheric activity that moves slowly around the tropics every 30 to 60 days. When the MJO is active over the Atlantic, it enhances the formation of thunderstorms associated with hurricanes. In its suppressed phase, storm activity tends to die down. The MJO doesn't guarantee storms—or a lack of them—but it turns up or down the odds. Its phase and position can be tracked two or three weeks in advance. Lastly, forecasters will talk about the Loop Current, a deep river of warm water that flows from the Caribbean into the Gulf of Mexico. When storms pass over the Loop Current or its warm eddies, they can rapidly intensify because they are drawing energy from not just the warm surface water but from warm water that's tens of meters deep. The Loop Current has helped power several historic Gulf storms, including Hurricanes Katrina in 2005 and Ida in 2021. The Loop Current stretched well into the Gulf in May 2022. The scale, in meters, shows the maximum depth at which temperatures were 78°F (26°C) or greater. Credit: Nick Shay/University of Miami, CC BY-ND But the Loop Current is always shifting. Its strength and location in early summer may look very different by late August or September. Combined, these subseasonal signals help forecasters fine-tune their outlooks as the season unfolds. Where hurricanes form shifts over the months Where storms are most likely to form and make landfall also changes as the pages of the calendar turn. In early summer, the Gulf of Mexico warms up faster than the open Atlantic, making it a notable hotspot for early-season tropical storm development, especially in June and July. The Texas coast, Louisiana, and the Florida Panhandle often face a higher early-season risk than locations along the Eastern seaboard. These are generally the busiest areas during each month of hurricane season, but that doesn’t mean hurricanes won’t make landfall elsewhere. Credit: NOAA By August and September, the season reaches its peak. This is when those waves moving off the coast of Africa become a primary source of storm activity. These long-track storms are sometimes called \"Cape Verde hurricanes\" because they originate near the Cape Verde Islands off the African coast. While many stay over open water, others can gather steam and track toward the Caribbean, Florida or the Carolinas. Later in the hurricane season, storms are more likely to form in the western Atlantic or Caribbean, where waters are still warm and upper-level winds remain favorable. These late-season systems have a higher probability of following atypical paths, as Sandy did in 2012 when it struck the New York City region and Milton did in 2024 before making landfall in Florida. At the end of the day, the safest way to think about hurricane season is this: If you live along the coast, don't let your guard down. Areas susceptible to hurricanes are never totally immune from hurricanes, and it only takes one to make it a dangerous—and unforgettable—season. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: NOAA's 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching (2025, May 25) retrieved 25 May 2025 from https://phys.org/news/2025-05-noaa-hurricane-busy-season-scientist.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2019/2-hurricane.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2019/2-hurricane.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2019/2-hurricane.jpg\" data-sub-html=\"Credit: CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2019/2-hurricane.jpg\" alt=\"hurricane\" title=\"Credit: CC0 Public Domain\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eU.S. forecasters are expecting an \u003ca href=\"https://www.noaa.gov/news-release/noaa-predicts-above-normal-2025-atlantic-hurricane-season\" target=\"_blank\"\u003eabove-normal 2025 Atlantic hurricane season\u003c/a\u003e, with 13 to 19 named storms, and 6 to 10 of those becoming hurricanes.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eEvery year, the \u003ca href=\"https://www.noaa.gov/topic-tags/hurricanes\" target=\"_blank\"\u003eNational Oceanic and Atmospheric Administration\u003c/a\u003e and \u003ca href=\"https://seasonalhurricanepredictions.bsc.es/\" target=\"_blank\"\u003eother forecasters\u003c/a\u003e release preseason outlooks for the Atlantic\u0026#39;s hurricane season, which runs June 1 through Nov. 30.\u003c/p\u003e\n\u003cp\u003eSo, how do they know what\u0026#39;s likely to happen months in the future?\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/noaas-2025-hurricane-f.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/noaas-2025-hurricane-f.jpg\" data-sub-html=\"\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/noaas-2025-hurricane-f.jpg\" alt=\"NOAA’s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching\"/\u003e\n                    \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eI\u0026#39;m an \u003ca href=\"https://www.colinzarzycki.com\" target=\"_blank\"\u003eatmospheric scientist\u003c/a\u003e who studies extreme weather. Let\u0026#39;s take a look at what Atlantic hurricane forecasts are based on and why those forecasts can shift during the season.\u003c/p\u003e\n\u003ch2\u003eWhat goes into a seasonal forecast\u003c/h2\u003e\n\u003cp\u003eThink of the preseason hurricane forecast as the 30,000-foot view: It can\u0026#39;t predict if or when a storm will hit a particular location, but it can offer insight into how many storms are likely to form throughout the entire Atlantic, and how active the season overall might be.\u003c/p\u003e\n\u003cp\u003eThese outlooks rely heavily on two large-scale climate factors.\u003c/p\u003e\n\u003cp\u003eThe first is the \u003ca href=\"https://oceanexplorer.noaa.gov/facts/hurricanes.html\" target=\"_blank\"\u003esea surface temperature\u003c/a\u003e in areas where tropical cyclones tend to form and grow. Hurricanes draw their energy from warm ocean water. So when the Atlantic is unusually warm, as it has been in recent years, it provides more fuel for storms to form and intensify.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/noaas-2025-hurricane-f-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/noaas-2025-hurricane-f-1.jpg\" data-sub-html=\"Once water temperatures are 79°F (26°C), hurricanes can form. Most of the Gulf was above that by late May 2025. Credit: NOAA/NESDIS\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/noaas-2025-hurricane-f-1.jpg\" alt=\"NOAA’s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching\" title=\"Once water temperatures are 79°F (26°C), hurricanes can form. Most of the Gulf was above that by late May 2025. Credit: NOAA/NESDIS\"/\u003e\n             \u003cfigcaption\u003e\n                Once water temperatures are 79°F (26°C), hurricanes can form. Most of the Gulf was above that by late May 2025. Credit: NOAA/NESDIS\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eThe second key ingredient that meteorologists have their eye on is the \u003ca href=\"https://www.climate.gov/enso\" target=\"_blank\"\u003eEl Niño–Southern Oscillation\u003c/a\u003e, which forecasters refer to as ENSO. ENSO is a climate cycle that shifts every few years between three main phases: El Niño, La Niña, and a neutral space that lives somewhere in between.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eDuring El Niño, winds over the Atlantic high up in the troposphere—roughly 25,000 to 40,000 feet—strengthen and can disrupt storms and hurricanes. La Niña, on the other hand, tends to reduce these winds, making it easier for storms to form and grow. When you look over the historical hurricane record, La Niña years have tended to be busier than their El Niño counterparts, as we \u003ca href=\"https://research.noaa.gov/recent-triple-dip-la-nina-upends-current-understanding-of-enso/\" target=\"_blank\"\u003esaw from 2020 through 2023\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe\u0026#39;re \u003ca href=\"https://iri.columbia.edu/our-expertise/climate/forecasts/enso/current/\" target=\"_blank\"\u003ein the neutral phase\u003c/a\u003e as the 2025 hurricane season begins, and probably will be for at least a few more months. That means upper-level winds aren\u0026#39;t particularly hostile to hurricanes, but they\u0026#39;re not exactly rolling out the red carpet either.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/noaas-2025-hurricane-f-2.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/noaas-2025-hurricane-f-2.jpg\" data-sub-html=\"\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/noaas-2025-hurricane-f-2.jpg\" alt=\"NOAA’s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching\"/\u003e\n                    \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eAt the same time, sea surface temperatures are \u003ca href=\"https://climatereanalyzer.org/clim/sst_daily/?dm_id=world2\" target=\"_blank\"\u003erunning warmer than the 30-year average\u003c/a\u003e, but not quite at the record-breaking levels seen in some recent seasons.\u003c/p\u003e\n\u003cp\u003eTaken together, these conditions point to a moderately \u003ca href=\"https://www.nhc.noaa.gov/climo/\" target=\"_blank\"\u003eabove-average hurricane season\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s important to emphasize that these factors merely load the dice, tilting the odds toward more or fewer storms, but not guaranteeing an outcome. A host of other variables influence whether a storm actually forms, how strong it becomes, and whether it ever threatens land.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eThe smaller influences forecasters can\u0026#39;t see yet\u003c/h2\u003e\n\u003cp\u003eOnce hurricane season is underway, forecasters start paying close attention to shorter-term influences.\u003c/p\u003e\n\u003cp\u003eThese subseasonal factors evolve quickly enough that they don\u0026#39;t shape the entire season. However, they can noticeably raise or lower the chances for storms developing in the coming two to four weeks.\u003c/p\u003e\n\u003cp\u003eOne factor is \u003ca href=\"https://doi.org/10.1175/BAMS-85-3-353\" target=\"_blank\"\u003edust lofted from the Sahara Desert\u003c/a\u003e by \u003ca href=\"https://phys.org/tags/strong+winds/\" rel=\"tag\"\u003estrong winds\u003c/a\u003e and carried from east to west across the Atlantic.\u003c/p\u003e\n\u003cp\u003eThese dust plumes tend to suppress hurricanes by \u003ca href=\"https://www.wunderground.com/hurricane/articles/saharan-dust-explainer\" target=\"_blank\"\u003edrying out the atmosphere and reducing sunlight\u003c/a\u003e that reaches the ocean surface. Dust outbreaks are next-to-impossible to predict months in advance, but \u003ca href=\"https://www.nesdis.noaa.gov/news/todays-satellite-image-dust-western-saharas-sandy-shores\" target=\"_blank\"\u003esatellite observations\u003c/a\u003e of growing plumes can give forecasters a heads-up a couple weeks before the dust reaches the primary hurricane development region off the coast of Africa.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/noaas-2025-hurricane-f-3.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/noaas-2025-hurricane-f-3.jpg\" data-sub-html=\"Dust blowing in from the Sahara Desert can tamp down hurricane activities by shading the ocean over the main development region for hurricanes and drying out the atmosphere, just off the African coast. This plume spread over 2,000 miles in June 2020. Credit: NASA\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/noaas-2025-hurricane-f-3.jpg\" alt=\"NOAA’s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching\" title=\"Dust blowing in from the Sahara Desert can tamp down hurricane activities by shading the ocean over the main development region for hurricanes and drying out the atmosphere, just off the African coast. This plume spread over 2,000 miles in June 2020. Credit: NASA\"/\u003e\n             \u003cfigcaption\u003e\n                Dust blowing in from the Sahara Desert can tamp down hurricane activities by shading the ocean over the main development region for hurricanes and drying out the atmosphere, just off the African coast. This plume spread over 2,000 miles in June 2020. Credit: NASA\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eAnother key ingredient that doesn\u0026#39;t go into seasonal forecasts but becomes important during the season are \u003ca href=\"https://cpo.noaa.gov/projections-of-tropical-cyclones-and-rainfall-in-the-african-sahel-could-be-improved-with-better-understanding-and-representation-of-african-easterly-waves-in-models/\" target=\"_blank\"\u003eAfrican easterly waves\u003c/a\u003e. These \u0026#34;waves\u0026#34; are clusters of thunderstorms that roll off the West African coast, tracking from east to west across the ocean. Most major storms in the Atlantic basin, especially in the peak months of August and September, can trace their origins back to one of these waves.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eForecasters monitor strong waves as they begin their westward journey across the Atlantic, knowing they can provide some \u003ca href=\"https://doi.org/10.1029/2024JD040858\" target=\"_blank\"\u003einsight about potential risks\u003c/a\u003e to U.S. interests one to two weeks in advance.\u003c/p\u003e\n\u003cp\u003eAlso in this subseasonal mix is the \u003ca href=\"https://www.cpc.ncep.noaa.gov/products/precip/CWlink/MJO/mjoupdate.pdf\" target=\"_blank\"\u003eMadden–Julian Oscillation\u003c/a\u003e. The MJO is a wave-like pulse of atmospheric activity that moves slowly around the tropics every 30 to 60 days. When the MJO is active over the Atlantic, it \u003ca href=\"https://doi.org/10.1175/2009JCLI2978.1\" target=\"_blank\"\u003eenhances the formation of thunderstorms\u003c/a\u003e associated with hurricanes. In its suppressed phase, storm activity tends to die down. The MJO doesn\u0026#39;t guarantee storms—or a lack of them—but it turns up or down the odds. Its phase and position can be tracked two or three weeks in advance.\u003c/p\u003e\n\u003cp\u003eLastly, forecasters will talk about the \u003ca href=\"https://oceanservice.noaa.gov/facts/loopcurrent.html\" target=\"_blank\"\u003eLoop Current\u003c/a\u003e, a deep river of warm water that flows from the Caribbean into the Gulf of Mexico.\u003c/p\u003e\n\u003cp\u003eWhen storms pass over the Loop Current or its warm eddies, \u003ca href=\"https://theconversation.com/hurricane-ida-turned-into-a-monster-thanks-to-a-giant-warm-patch-in-the-gulf-of-mexico-heres-what-happened-167029\" target=\"_blank\"\u003ethey can rapidly intensify\u003c/a\u003e because they are drawing energy from not just the warm surface water but from warm water that\u0026#39;s tens of meters deep. The Loop Current has helped power several historic Gulf storms, including Hurricanes Katrina in 2005 and Ida in 2021.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/noaas-2025-hurricane-f-4.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/noaas-2025-hurricane-f-4.jpg\" data-sub-html=\"The Loop Current stretched well into the Gulf in May 2022. The scale, in meters, shows the maximum depth at which temperatures were 78°F (26°C) or greater. Credit: Nick Shay/University of Miami, CC BY-ND\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/noaas-2025-hurricane-f-4.jpg\" alt=\"NOAA’s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching\" title=\"The Loop Current stretched well into the Gulf in May 2022. The scale, in meters, shows the maximum depth at which temperatures were 78°F (26°C) or greater. Credit: Nick Shay/University of Miami, CC BY-ND\"/\u003e\n             \u003cfigcaption\u003e\n                The Loop Current stretched well into the Gulf in May 2022. The scale, in meters, shows the maximum depth at which temperatures were 78°F (26°C) or greater. Credit: Nick Shay/University of Miami, CC BY-ND\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eBut the Loop Current is always shifting. Its strength and location in \u003ca href=\"https://phys.org/tags/early+summer/\" rel=\"tag\"\u003eearly summer\u003c/a\u003e may look very different by late August or September.\u003c/p\u003e\n\u003cp\u003eCombined, these subseasonal signals help forecasters fine-tune their outlooks as the season unfolds.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eWhere hurricanes form shifts over the months\u003c/h2\u003e\n\u003cp\u003eWhere storms are most \u003ca href=\"https://www.aoml.noaa.gov/hrd-faq/#landfalls-by-state\" target=\"_blank\"\u003elikely to form and make landfall\u003c/a\u003e also changes as the pages of the calendar turn.\u003c/p\u003e\n\u003cp\u003eIn early summer, the Gulf of Mexico warms up faster than the open Atlantic, making it a \u003ca href=\"https://www.nhc.noaa.gov/climo/\" target=\"_blank\"\u003enotable hotspot\u003c/a\u003e for early-season tropical storm development, especially in June and July. The Texas coast, Louisiana, and the Florida Panhandle often face a higher early-season risk than locations along the Eastern seaboard.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/noaas-2025-hurricane-f-5.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/noaas-2025-hurricane-f-5.jpg\" data-sub-html=\"These are generally the busiest areas during each month of hurricane season, but that doesn’t mean hurricanes won’t make landfall elsewhere. Credit: NOAA\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/noaas-2025-hurricane-f-5.jpg\" alt=\"NOAA’s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching\" title=\"These are generally the busiest areas during each month of hurricane season, but that doesn’t mean hurricanes won’t make landfall elsewhere. Credit: NOAA\"/\u003e\n             \u003cfigcaption\u003e\n                These are generally the busiest areas during each month of hurricane season, but that doesn’t mean hurricanes won’t make landfall elsewhere. Credit: NOAA\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eBy August and September, the season reaches its peak. This is when those waves moving off the coast of Africa become a primary source of storm activity. These long-track storms are sometimes called \u0026#34;\u003ca href=\"https://weather.com/storms/hurricane/news/2023-09-05-what-are-cape-verde-hurricanes-cabo-verde\" target=\"_blank\"\u003eCape Verde hurricanes\u003c/a\u003e\u0026#34; because they originate near the Cape Verde Islands off the African coast. While many stay over open water, others can gather steam and track toward the Caribbean, Florida or the Carolinas.\u003c/p\u003e\n\u003cp\u003eLater in the hurricane season, storms are more likely to form in the western Atlantic or Caribbean, where waters are still warm and upper-level winds remain favorable. These late-season systems have a higher probability of following atypical paths, as \u003ca href=\"https://www.nyc.gov/site/sirr/about/what-happened-during-sandy-and-why.page\" target=\"_blank\"\u003eSandy did in 2012 when it struck the New York City region\u003c/a\u003e and Milton did in 2024 before making landfall in Florida.\u003c/p\u003e\n\u003cp\u003eAt the end of the day, the safest way to think about hurricane season is this: If you live along the coast, don\u0026#39;t let your guard down. Areas susceptible to hurricanes are never totally immune from hurricanes, and it only takes one to make it a dangerous—and unforgettable—season.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from The Conversation under a Creative Commons license. Read the original article.\u003cimg src=\"https://counter.theconversation.com/content/257223/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tNOAA\u0026#39;s 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching (2025, May 25)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 25 May 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-05-noaa-hurricane-busy-season-scientist.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-25T16:40:01-04:00",
  "modifiedTime": null
}
