{
  "id": "fc5f98a9-01fd-434f-a50c-0efbd841c095",
  "title": "Megastudy finds a simple way to boost math progress",
  "link": "https://phys.org/news/2025-03-megastudy-simple-boost-math.html",
  "description": "American students have been falling behind in math for decades—with test scores that consistently rank in the bottom 25% globally compared to students in other developed countries—and the COVID-19 pandemic made the situation worse.",
  "author": "",
  "published": "Mon, 24 Mar 2025 17:44:04 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Mathematics Education"
  ],
  "byline": "Deborah Stull",
  "length": 6294,
  "excerpt": "American students have been falling behind in math for decades—with test scores that consistently rank in the bottom 25% globally compared to students in other developed countries—and the COVID-19 pandemic made the situation worse.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Pexels American students have been falling behind in math for decades—with test scores that consistently rank in the bottom 25% globally compared to students in other developed countries—and the COVID-19 pandemic made the situation worse. Previous research has shown that interventions grounded in behavioral science that target student motivation have been effective at increasing math scores, suggesting that taking a similar \"behaviorally informed\" approach with teachers might have a comparable effect. Now, a collaborative study published in the Proceedings of the National Academy of Sciences, and led by researchers at the Behavior Change for Good Initiative (BCFG) at the University of Pennsylvania, has found that behaviorally informed email messages slightly improved students' math progress compared to control messages. \"Our results showed that simple, low-cost nudges can help teachers support student progress in math,\" says Angela Duckworth, Rosa Lee and Egbert Chang Professor in Penn's School of Arts \u0026 Sciences and the Wharton School, who led the study and co-directs BCFG. \"These nudges worked across different school contexts, with effects persisting eight weeks after teachers stopped receiving the nudges.\" The key to this megastudy was the partnership with Zearn Math, a nonprofit educational platform. \"Large-scale studies on teacher-focused interventions have been rare due to the high cost and logistical challenges involved. Thanks to our partnership with Zearn Math, we were able to overcome these challenges,\" says co-author Dena Gromet, executive director of BCFG. A megastudy is \"a large-scale experiment in which multiple interventions are tested simultaneously on the same outcome, a tournament approach, if you will,\" says co-author Katy Milkman, James G. Dinan Endowed Professor and professor of operations, information and decisions at the Wharton School and co-director of BCFG. \"Because all interventions run concurrently and are compared to a common control group, this method allows for direct comparisons of their effectiveness.\" In one of the largest studies of its kind—involving more than 140,000 teachers and nearly 3 million elementary students—the researchers compared the impact of 15 different interventions to a reminder-only message. A sample email message from the Nudging Weekly Logins intervention. Credit: Proceedings of the National Academy of Sciences (2025). DOI: 10.1073/pnas.2418616122 \"These messages were behaviorally informed, meaning they were based on prior insights from behavioral science. For instance, one intervention asked teachers to make a specific plan for how they would use Zearn Math that week, an approach backed by research showing that people are more likely to follow through when they make detailed plans. Another intervention appealed to teachers' empathy for their students, which previous research has demonstrated is supportive of student success,\" Duckworth says. Specifically, the research team found that, compared to standard email reminders, behaviorally informed email messages improved students' math progress during the four-week intervention period by 1.89%. The most effective intervention, which increased student math progress by about 5.06%, encouraged teachers to log into Zearn Math weekly for an updated, personalized report on their students' progress. \"One especially promising takeaway is that personalized nudges—those that referenced progress updates about a teacher's own students—were more effective than nonpersonalized ones,\" Duckworth says. The researchers note that though they are promising, the effects were small. \"These results suggest the need for more intensive support than the light-touch email nudges we tested,\" Milkman says. \"And they underscore how hard it is to change human behavior.\" These findings, Milkman says, suggest several additional valuable avenues for future research, including \"more random-assignment field experiments to confirm the causal benefits of teacher-targeted nudges and studies to probe the longer-term effects of behaviorally-informed interventions.\" Additional research is also needed, Duckworth says, \"to confirm and explain the benefits of referencing personalized data when nudging teachers. It may be that capitalizing on teachers' intrinsic motivation to help their students is a distinct and potentially cost-effective approach that can complement other interventions, such as offering performance bonuses and other extrinsic incentives.\" Next steps for researchers are to dig deeper into what makes these kinds of interventions work and how to make them even more effective over time. Future studies are needed to look into the long-term effects of nudges and explore why some interventions are more effective than others. \"The better we understand why something works, the more powerfully we can use it to create positive change,\" Duckworth says. \"Ultimately, this line of research could help shape smarter, more effective education policies.\" More information: Angela L. Duckworth et al, A national megastudy shows that email nudges to elementary school teachers boost student math achievement, particularly when personalized, Proceedings of the National Academy of Sciences (2025). DOI: 10.1073/pnas.2418616122 Journal information: Proceedings of the National Academy of Sciences",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/megastudy-finds-a-simp-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1206992\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/megastudy-finds-a-simp-1.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/megastudy-finds-a-simp-1.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/megastudy-finds-a-simp-1.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/megastudy-finds-a-simp-1.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/megastudy-finds-a-simp-1.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/megastudy-finds-a-simp-1.jpg\" width=\"800\" height=\"530\" alt=\"Megastudy finds a simple way to boost math progress\" title=\"Credit: Pexels\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Pexels\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eAmerican students have been falling behind in math for decades—with test scores that consistently rank in the bottom 25% globally compared to students in other developed countries—and the COVID-19 pandemic made the situation worse.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003ePrevious research has shown that interventions grounded in behavioral science that target student motivation have been effective at increasing math scores, suggesting that taking a similar \u0026#34;behaviorally informed\u0026#34; approach with teachers might have a comparable effect.\u003c/p\u003e\n\u003cp\u003eNow, a collaborative study published in the \u003ca href=\"https://www.pnas.org/doi/10.1073/pnas.2418616122\" target=\"_blank\"\u003e\u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e\u003c/a\u003e, and led by researchers at the Behavior Change for Good Initiative (BCFG) at the University of Pennsylvania, has found that behaviorally informed email messages slightly improved students\u0026#39; math progress compared to control messages.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our results showed that simple, low-cost nudges can help teachers support student progress in math,\u0026#34; says Angela Duckworth, Rosa Lee and Egbert Chang Professor in Penn\u0026#39;s School of Arts \u0026amp; Sciences and the Wharton School, who led the study and co-directs BCFG. \u0026#34;These nudges worked across different school contexts, with effects persisting eight weeks after teachers stopped receiving the nudges.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe key to this megastudy was the partnership with Zearn Math, a nonprofit educational platform. \u0026#34;Large-scale studies on teacher-focused interventions have been rare due to the high cost and logistical challenges involved. Thanks to our partnership with Zearn Math, we were able to overcome these challenges,\u0026#34; says co-author Dena Gromet, executive director of BCFG.\u003c/p\u003e\n\u003cp\u003eA megastudy is \u0026#34;a large-scale experiment in which multiple interventions are tested simultaneously on the same outcome, a tournament approach, if you will,\u0026#34; says co-author Katy Milkman, James G. Dinan Endowed Professor and professor of operations, information and decisions at the Wharton School and co-director of BCFG. \u0026#34;Because all interventions run concurrently and are compared to a common control group, this method allows for direct comparisons of their effectiveness.\u0026#34;\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eIn one of the largest studies of its kind—involving more than 140,000 teachers and nearly 3 million \u003ca href=\"https://phys.org/tags/elementary+students/\" rel=\"tag\"\u003eelementary students\u003c/a\u003e—the researchers compared the impact of 15 different interventions to a reminder-only message.\u003c/p\u003e\n\n\n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1206991\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/megastudy-finds-a-simp.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/megastudy-finds-a-simp.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/megastudy-finds-a-simp.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/megastudy-finds-a-simp.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/megastudy-finds-a-simp.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/megastudy-finds-a-simp.jpg\" width=\"800\" height=\"530\" alt=\"Megastudy finds a simple way to boost math progress\" title=\"A sample email message from the Nudging Weekly Logins intervention. Credit: Proceedings of the National Academy of Sciences (2025). DOI: 10.1073/pnas.2418616122\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eA sample email message from the Nudging Weekly Logins intervention. Credit: \u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e (2025). DOI: 10.1073/pnas.2418616122\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cp\u003e\u0026#34;These messages were behaviorally informed, meaning they were based on prior insights from \u003ca href=\"https://phys.org/tags/behavioral+science/\" rel=\"tag\"\u003ebehavioral science\u003c/a\u003e. For instance, one \u003ca href=\"https://phys.org/tags/intervention/\" rel=\"tag\"\u003eintervention\u003c/a\u003e asked teachers to make a specific plan for how they would use Zearn Math that week, an approach backed by research showing that people are more likely to follow through when they make detailed plans. Another intervention appealed to teachers\u0026#39; empathy for their students, which previous research has demonstrated is supportive of student success,\u0026#34; Duckworth says.\u003c/p\u003e\n\u003cp\u003eSpecifically, the research team found that, compared to standard email reminders, behaviorally informed email messages improved students\u0026#39; math progress during the four-week intervention period by 1.89%. The most effective intervention, which increased student \u003ca href=\"https://phys.org/tags/math/\" rel=\"tag\"\u003emath\u003c/a\u003e progress by about 5.06%, encouraged teachers to log into Zearn Math weekly for an updated, personalized report on their students\u0026#39; progress.\u003c/p\u003e\n\u003cp\u003e\u0026#34;One especially promising takeaway is that personalized nudges—those that referenced progress updates about a teacher\u0026#39;s own students—were more effective than nonpersonalized ones,\u0026#34; Duckworth says.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eThe researchers note that though they are promising, the effects were small. \u0026#34;These results suggest the need for more intensive support than the light-touch email nudges we tested,\u0026#34; Milkman says. \u0026#34;And they underscore how hard it is to change human behavior.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThese findings, Milkman says, suggest several additional valuable avenues for future research, including \u0026#34;more random-assignment field experiments to confirm the causal benefits of teacher-targeted nudges and studies to probe the longer-term effects of behaviorally-informed interventions.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdditional research is also needed, Duckworth says, \u0026#34;to confirm and explain the benefits of referencing personalized data when nudging teachers. It may be that capitalizing on \u003ca href=\"https://phys.org/tags/teachers/\" rel=\"tag\"\u003eteachers\u003c/a\u003e\u0026#39; intrinsic motivation to help their students is a distinct and potentially cost-effective approach that can complement other interventions, such as offering performance bonuses and other extrinsic incentives.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNext steps for researchers are to dig deeper into what makes these kinds of interventions work and how to make them even more effective over time. Future studies are needed to look into the long-term effects of nudges and explore why some interventions are more effective than others.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The better we understand why something works, the more powerfully we can use it to create positive change,\u0026#34; Duckworth says. \u0026#34;Ultimately, this line of research could help shape smarter, more effective education policies.\u0026#34;\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Angela L. Duckworth et al, A national megastudy shows that email nudges to elementary school teachers boost student math achievement, particularly when personalized, \u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1073/pnas.2418616122\" target=\"_blank\"\u003eDOI: 10.1073/pnas.2418616122\u003c/a\u003e\n                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                \t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/proceedings-of-the-national-academy-of-sciences/\"\u003eProceedings of the National Academy of Sciences\u003c/a\u003e\n                                                                                    \u003ca href=\"http://www.pnas.org/\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003ci\u003e\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n                                                                                 \n\t\t\t\t\t\t\t\t                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-24T17:44:04-04:00",
  "modifiedTime": null
}
