[
  {
    "id": "1f1be527-062a-478a-b812-5642133eecec",
    "title": "Actor and Disability Rights Activist Liz Carr Speaks Out Against Legalizing Assisted Death in the US, ‘They Think It’s Better to Be Dead Than to Be Disabled’",
    "link": "https://variety.com/2024/politics/news/liz-carr-assisted-death-in-the-us-1236176544/",
    "description": "Liz Carr, known for starring in the third season of the fantasy comedy “Good Omens” and playing a forensic scientist in the crime drama “Silent Witness,” supports the U.S. government’s refusal to outright legalize euthanasia in the nation. The actress and disability rights activist argued how these programs may have cultural implications on the lives […]",
    "author": "Emiliana Betancourt",
    "published": "Sun, 13 Oct 2024 22:53:06 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/liz-carr.webp",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Politics",
      "Assisted Death",
      "Euthanasia",
      "Liz Carr"
    ]
  },
  {
    "id": "b6b608e1-fc7a-4f6b-87bd-abde16ada9dc",
    "title": "Jack White Keeps It Intimate, Clamorous and Classic as His ‘No Name’ Tour Pops In to L.A.’s Lodge Room and Mayan: Concert Review",
    "link": "https://variety.com/2024/music/concert-reviews/jack-white-mayan-lodge-room-tour-los-concert-review-1236176549/",
    "description": "Following virtually every Jack White show, his website posts a selection of concert pictures taken that night by his in-house photographer, David James Swanson, and occasionally they’ll throw in a crowd shot. After Friday night’s gig at the Mayan in downtown Los Angeles, the pictures posted online included one of a fan toward the front […]",
    "author": "Chris Willman",
    "published": "Sun, 13 Oct 2024 22:05:35 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/241010_JW_HighlandPark_1371-scaled-1.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Concert Reviews",
      "News",
      "Reviews",
      "Jack White",
      "The White Stripes"
    ]
  },
  {
    "id": "c1bd59af-9bda-4f7c-992e-bd0a45799ce9",
    "title": "Clint Eastwood Wasn't Sergio Leone's First Choice For The Dollars Trilogy",
    "link": "https://www.slashfilm.com/1687284/clint-eastwood-not-sergio-leone-first-choice-dollars-trilogy-james-coburn/",
    "description": "When he was casting the Man With No Name for A Fistful of Dollars, director Sergio Leone had another actor in mind before Clint Eastwood.",
    "author": "Valerie Ettenhofer",
    "published": "Sun, 13 Oct 2024 22:45:55 +0000",
    "image": "https://www.slashfilm.com/img/gallery/clint-eastwood-wasnt-sergio-leones-first-choice-for-the-dollars-trilogy/l-intro-1728852131.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "History Movies",
      "Thriller Movies"
    ]
  },
  {
    "id": "411e5a2e-a1ec-4f04-9aa7-9906aebb8061",
    "title": "What Happened To Kelly Rohrbach's Cassidy Reid On Yellowstone?",
    "link": "https://www.slashfilm.com/1684205/kelly-rohrbach-yellowstone-what-happened-female-attorney-general-cassidy-reid/",
    "description": "Cassidy Reid (Kelly Rohrbach), the prosecutor who ran for state Attorney General on Yellowstone, vanished after just a few episodes. Here's what became of her.",
    "author": "Valerie Ettenhofer",
    "published": "Sun, 13 Oct 2024 21:45:27 +0000",
    "image": "https://www.slashfilm.com/img/gallery/what-happened-to-kelly-rohrbachs-cassidy-reid-on-yellowstone/l-intro-1728493038.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows"
    ]
  },
  {
    "id": "240d93ae-1fd8-4689-b320-a9271454b173",
    "title": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE",
    "link": "https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE Read the full article on AICN Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing.  If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015). Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor Finish the article on AICN",
    "author": "staff",
    "published": "Sat, 05 Oct 2024 14:56:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "f7571457-8325-48bb-93c5-5f3e0b2c764c",
    "title": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!",
    "link": "https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024! Read the full article on AICN Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie.  It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out! Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff. Peter: Bless You.  Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that.  Stuart: Thank you.   Barbara: Why do this in a true crime format? What were you going for?  Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I Finish the article on AICN",
    "author": "Barbarella",
    "published": "Sat, 05 Oct 2024 02:02:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "faee3b8b-2d52-491d-a93d-872b0104889d",
    "title": "Where is Taylor Swift Today, October 13? When is Her Next Show?",
    "link": "https://www.comingsoon.net/guides/news/1862240-where-is-taylor-swift-today-october-13-concert-playing",
    "description": "With Taylor Swift‘s Eras Tour taking Europe by storm, fans are eager for what’s coming next. The dazzling shows, unforgettable performances, and stunning visuals have captured the hearts of audiences worldwide. Now, fans are waiting in anticipation for the next stop on this extraordinary tour. So, where is Taylor Swift performing tonight? Here is everything […] The post Where is Taylor Swift Today, October 13? When is Her Next Show? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Disheeta Maheshwari",
    "published": "Sun, 13 Oct 2024 07:01:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/Where-is-Taylor-Swift-Today-October-13-When-is-Her-Next-Show.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "FAQ",
      "FAQ Pop Culture",
      "Taylor Swift"
    ]
  },
  {
    "id": "3acedbbf-ea8e-4dbf-933e-dc0f52d5373c",
    "title": "Watch NFL Arizona Cardinals vs Green Bay Packers Today Free: Time, Stream \u0026 Channel",
    "link": "https://www.comingsoon.net/guides/news/1862787-watch-nfl-arizona-cardinals-vs-green-bay-packers-today-free-time-stream-channel",
    "description": "The 2024 NFL season has already produced many sensational matchups, and fans are eager to stream Arizona Cardinals vs Green Bay Packers in what promises to be another thrilling fixture. Five match weeks have concluded, and the final NFL table is beginning to take shape. One of the most exciting clashes lined up for the […] The post Watch NFL Arizona Cardinals vs Green Bay Packers Today Free: Time, Stream \u0026 Channel appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Apoorv Rastogi",
    "published": "Sun, 13 Oct 2024 07:00:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-13-Oct-2024-10-52-AM-6008.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Arizona Cardinals",
      "exclude_from_yahoo",
      "Green Bay Packers",
      "Sport Today"
    ]
  },
  {
    "id": "8f96a5c5-32f0-44ff-bb63-33b4f0594418",
    "title": "‘Tracker’: How Season 2 Premiere Explains Teddi’s Absence After Robin Weigert’s Exit",
    "link": "https://deadline.com/2024/10/tracker-season-2-what-happened-to-teddi-robin-weigert-exit-1236113836/",
    "description": "SPOILER ALERT! This post contains details from the Season 2 premiere of CBS’ Tracker. The Season 2 premiere of Tracker gives audiences an answer as to why Teddi Bruin won’t be around much to help Colter Shaw on his cases of the week. Robin Weigert, who played Teddi in the first season, exited as a […]",
    "author": "Katie Campione",
    "published": "Mon, 14 Oct 2024 01:00:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/08/tracker-Teddi.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "CBS",
      "Tracker",
      "TV News"
    ]
  },
  {
    "id": "1aaa06b3-120a-4395-a5d5-aa5304f1f55c",
    "title": "Andrew Garfield Unpacks ‘We Live In Time’s Chaotic \u0026 Intimate Birth Sequence With Weeks-Old Baby: “Mostly Acting With Florence’s Bum”",
    "link": "https://deadline.com/2024/10/andrew-garfield-we-live-in-time-florence-pugh-birth-scene-1236114737/",
    "description": "We Live in Time star Andrew Garfield unpacked the chaotic birth sequence from his nonlinear romantic dramedy, which featured a weeks-old baby who pooped on his hand and an action movie-feel where his self-described scene partner was colleague Florence Pugh’s butt. In a new interview with The New York Times that zeroes in on the […]",
    "author": "Natalie Oganesyan",
    "published": "Mon, 14 Oct 2024 00:48:22 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/07/WLIT_00098-e1728249944196.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "A24 films",
      "Andrew Garfield",
      "Florence Pugh",
      "John Crowley",
      "We Live in Time"
    ]
  },
  {
    "id": "8252cdc9-9fa4-4474-a9cf-3447fd9f8484",
    "title": "‘Caddo Lake’ Twists Mystery, Loss, and Emotion Into an Affecting Thriller",
    "link": "https://filmschoolrejects.com/caddo-lake-review/",
    "description": "Give this film your complete attention (phones off!), and you won't be disappointed.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 12:06:45 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Caddo Lake",
      "Dylan O'Brien"
    ]
  },
  {
    "id": "0fb0a69c-b891-4393-90a7-b128468c9039",
    "title": "‘Terrifier 3’ Is More of Exactly What You Think It Is, For Better and Worse",
    "link": "https://filmschoolrejects.com/terrifier-3-review/",
    "description": "And it's also the bloodiest, goriest, gnarliest entry in the Christmas horror subgenre, yet.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 00:32:04 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Christmas horror",
      "Horror",
      "terrifier"
    ]
  },
  {
    "id": "76589b9d-6be3-4bc9-8a11-e3d2add3e8c9",
    "title": "Star Trek TOS/TNG Films Exit Paramount+ for New Streaming Homes",
    "link": "https://bleedingcool.com/tv/star-trek-tos-tng-films-exit-paramount-for-new-streaming-homes/",
    "description": "It was nice while it lasted. Paramount+ has said goodbye to a number of Star Trek TOS/TNG-era films that now have new streaming homes.",
    "author": "Tom Chang",
    "published": "Sun, 13 Oct 2024 14:37:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Paramount+",
      "TV",
      "paramount",
      "star trek"
    ]
  },
  {
    "id": "3b5d55af-2dd9-40de-a55a-4877d2454176",
    "title": "Voltron: Henry Cavill Has Reportedly Joined The Cast",
    "link": "https://bleedingcool.com/movies/voltron-henry-cavill-has-reportedly-joined-the-cast/",
    "description": "Henry Cavill has reportedly joined the cast of the live-action Voltron film. Daniel Quinn-Toye is also starring, and Rawson Marshall Thurber is directing.",
    "author": "Kaitlyn Booth",
    "published": "Sun, 13 Oct 2024 14:32:08 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Amazon",
      "MGM",
      "Movies",
      "henry cavill",
      "voltron"
    ]
  },
  {
    "id": "14ebd56f-7ea7-46bb-9a80-e4ac15c314e0",
    "title": "Doc Film 'No One Asked You' Trailer Showcasing Humor and Activism",
    "link": "https://www.firstshowing.net/2024/doc-film-no-one-asked-you-trailer-showcasing-humor-and-activism/",
    "description": "\"Here I can laugh about it, but in the courtroom I can't.\" The official trailer is out for a documentary film called No One Asked You, exploring the connection comedy and activism with a focus on abortion rights. From filmmaker Ruth Leitman, this premiered at the 2023 DOC NYC Film Festival last year and is opening next week just before the upcoming election. The film is \"a bold call to action driven by the power of humor in social change, where joy prevails.\" No One Asked You follows the comedian and disruptor-extraordinaire Lizz Winstead (co-creator of The Daily Show), and her organization Abortion Access Front (website), as they crisscross the U.S. to support abortion clinic staff and bust stigma with comedy shows. Pop culture icons \u0026 next-gen comics fuel this 6-year road film activating small-town folks to rebuild vandalized clinics, expose all the wrongdoer politicians, anti-abortion extremists, and media neglect as the race to the bottom ensues and our rights burn down. Yep, this is the kind of fresh new take on activism we really do need right now. \"This ...",
    "author": "Alex Billington",
    "published": "Sun, 13 Oct 2024 15:24:04 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/NoOneASkedYouDocposterbigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "8f73a1bd-088a-4849-826e-6a42bec486be",
    "title": "Official Trailer for 'Feather Christmas' Comedy Featuring a Pet Chicken",
    "link": "https://www.firstshowing.net/2024/official-trailer-for-feather-christmas-comedy-featuring-a-pet-chicken/",
    "description": "\"Life's too short to not chase the things you love.\" Gravitas \u0026 Kaleidoscope Film have revealed the official trailer for a sweet Christmas romantic comedy called Feather Christmas, from filmmaker Lucy Turner. When an ailing pet chicken arrives at Martin's animal sanctuary over the holidays, his family's festive plans are turned upside down. A charming holiday comedy from the UK about how one little chicken (a live one!) can change everything. \"Love spreads its wings.\" Starring Tom Machell, Ocean M. Harris, Sarah Jane Duncan, Jacob B. Butler, and Lexi-Rae Billington. The director on IG: \"I had the absolute pleasure of directing my first feature film. What an honour it was to work alongside an insanely talented cast and crew. Each person on this set brought incomprehensible amounts of joy and laughter, and honestly I cannot thank you all enough.\" Have a look at a tiny bit of amusing footage below – before the film hits VOD later this fall. Here's the official trailer (+ poster) for Lucy Turner's film Feather Christmas, direct from YouTube: For the single dad, and veterinarian, Martin (Ocean ...",
    "author": "Alex Billington",
    "published": "Sun, 13 Oct 2024 14:45:45 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/FeatherChristmasPostermainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "85392f82-62eb-47ca-b3bc-b8c7ac6aded5",
    "title": "‘Nickel Boys’ Writer/Director RaMell Ross Wants the Film’s Visuals to ‘Force the Audience to Participate’",
    "link": "https://www.indiewire.com/news/general-news/nickel-boys-ramell-ross-films-visuals-1235056379/",
    "description": "Shot almost entirely from first-person point-of-view, \"Nickel Boys\" places audiences inside the terror of attending a segregated boys reformatory school in Florida during the 1960s.",
    "author": "Harrison Richlin",
    "published": "Mon, 14 Oct 2024 01:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Film",
      "Nickel Boys",
      "RaMell Ross"
    ]
  },
  {
    "id": "2e258b55-dc06-4119-b4dc-15f79c1024ec",
    "title": "‘The Babadook’ Writer/Director Jennifer Kent Lurks Inside the Criterion Closet",
    "link": "https://www.indiewire.com/news/general-news/the-babadook-jennifer-kent-criterion-closet-1235056378/",
    "description": "Some of Kent's selections include \"Haxän,\" David Lynch's \"Mulholland Drive,\" and the highly influential Yasujirō Ozu film, \"Tokyo Story.\"",
    "author": "Harrison Richlin",
    "published": "Sun, 13 Oct 2024 23:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Criterion",
      "Film",
      "Jennifer Kent",
      "The Babadook"
    ]
  }
]
