[
  {
    "id": "d123928d-9b27-429e-8a1c-6d7ff5256a05",
    "title": "Julia Roberts, Luca Guadagnino Thriller ‘After the Hunt’ Sets October Release Date (EXCLUSIVE)",
    "link": "https://variety.com/2025/film/news/julia-roberts-luca-guadagnino-after-the-hunt-release-date-1236307166/",
    "description": "“After the Hunt,” a thriller directed by Luca Guadagnino and starring Julia Roberts, Ayo Edebiri and Andrew Garfield, will land in theaters this fall. Amazon MGM is granting the film a prime awards season release date, with a limited rollout on Oct. 10 before expanding on Oct. 17. “After the Hunt” will open nationwide on […]",
    "author": "Rebecca Rubin",
    "published": "Fri, 14 Feb 2025 01:00:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/roberts-guadagnino-split.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "After the Hunt",
      "Amazon MGM Studios",
      "Julia Roberts",
      "Luca Guadagnino"
    ]
  },
  {
    "id": "5776afda-e014-4a8b-a13c-1ec53422a3a2",
    "title": "‘The Substance’ Director Coralie Fargeat Remembers the Worst Studio Notes She Got: ‘Come on, Calm Down With the Shrimp’",
    "link": "https://variety.com/2025/film/news/coralie-fargeat-the-substance-dennis-quaid-shrimp-1236305935/",
    "description": "Coralie Fargeat has never been one to play by the rules. The writer, director, and producer behind “The Substance,” the bold, visceral body horror film that took Cannes by storm and was nominated for five Academy Awards, has carved a path in cinema entirely on her own terms. From making “Star Wars”-inspired short films as […]",
    "author": "Clayton Davis",
    "published": "Fri, 14 Feb 2025 00:57:23 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/GettyImages-2198812238.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Podcasts",
      "Awards Circuit Podcast",
      "Coralie Fargeat",
      "Oscars",
      "The Substance"
    ]
  },
  {
    "id": "f30eeb28-3094-46e6-ab01-2a28b8b0edbe",
    "title": "THE THINKING GAME Stream this Friday",
    "link": "https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME Read the full article on AICN It’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world. Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.   Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents.    During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.   For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat Finish the article on AICN",
    "author": "McEric",
    "published": "Thu, 06 Feb 2025 01:26:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "92cc08d9-7fe3-42cf-93d0-6f8e1ac6b749",
    "title": "Sundance Midnight Selection TOUCH ME",
    "link": "https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME Read the full article on AICN The Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads: Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world. TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too. I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 21 Jan 2025 04:16:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "a76bdb06-ec06-4c54-8651-892adcc94b40",
    "title": "Captain America: Brave New World Post-Credits Scene Explained",
    "link": "https://www.slashfilm.com/1788976/captain-america-brave-new-world-post-credits-scene-explained/",
    "description": "Another entry in the Marvel Cinematic Universe means another post-credits scene to dissect. Here's what Captain America: Brave New World sets up for the future.",
    "author": "Jeremy Mathai",
    "published": "Thu, 13 Feb 2025 23:30:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/captain-america-brave-new-world-post-credits-scene-explained/l-intro-1739466601.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Superhero Movies"
    ]
  },
  {
    "id": "d06eeeac-b320-4cf4-96ad-3e59150031e7",
    "title": "Star Trek: What Does LCARS Stand For?",
    "link": "https://www.slashfilm.com/1773283/star-trek-lcars-meaning/",
    "description": "The LCARS computer graphical interface is one of the more noteworthy nerdy details in the sci-fi franchise. Here's the meaning behind its acronym.",
    "author": "Witney Seibold",
    "published": "Thu, 13 Feb 2025 23:00:57 +0000",
    "image": "https://www.slashfilm.com/img/gallery/star-trek-what-does-lcars-stand-for/l-intro-1738079117.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows",
      "Science Fiction Shows",
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "22b46880-4972-44d4-83b8-7a35ac84ec3d",
    "title": "Leslie Charleson Cause Of Death Revealed",
    "link": "https://deadline.com/2025/02/leslie-charleson-cause-of-death-1236288914/",
    "description": "A cause of death has been revealed for Leslie Charleson, who played cardiologist Monica Quartermaine on the ABC daytime drama General Hospital for nearly 50 years. Charleson died of sequelae of blunt head trauma, a consequence of a previous head injury she had suffered, according to documents obtained by TMZ. Charleson died January 12 at a […]",
    "author": "Denise Petski",
    "published": "Fri, 14 Feb 2025 01:01:15 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/01/leslie-charleson.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Obituaries",
      "General Hospital",
      "Leslie Charleson"
    ]
  },
  {
    "id": "5b19097b-356c-404a-bdda-baf3a2d7844b",
    "title": "The Craft Of ‘Wallace \u0026 Gromit: Vengeance Most Fowl’: How The Stop Motion Team Brought A “Hollywood Feel” To The Handcrafted World",
    "link": "https://deadline.com/2025/02/wallace-and-gromit-vengeance-most-fowl-nick-park-merlin-crossingham-craft-feature-1236288852/",
    "description": "Not only is stop motion one of the most complicated forms of animation, it’s also reliant on having some of the most talented, and patient, craftspeople in the business. That’s something Aardman Animations, the studio behind Oscar-nominated film Wallace \u0026 Gromit: Vengeance Most Fowl, is certainly known for. Deadline spoke with six key craftspeople – editor […]",
    "author": "Ryan Fleming",
    "published": "Fri, 14 Feb 2025 00:51:26 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/WG_BTS_RD_4S7A9451.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Below The Line",
      "News",
      "Aardman Animations",
      "Merlin Crossingham",
      "Netflix",
      "Nick Park",
      "Wallace \u0026 Gromit: Vengeance Most Fowl"
    ]
  },
  {
    "id": "37ef46d0-84cc-4058-a2ef-4711aad0243f",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "3fe23c79-1d47-4103-aa66-bc0a438fb358",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "cd203386-6239-4b21-b150-a1533022d285",
    "title": "Daisy Edgar-Jones \u0026 Jacob Elordi in 'On Swift Horses' Official Trailer",
    "link": "https://www.firstshowing.net/2025/daisy-edgar-jones-jacob-elordi-in-on-swift-horses-official-trailer/",
    "description": "\"Your new at this, aren't you? It's all luck. We're all just a hair's breadth away from losing everything.\" Sony Pictures Classics has debuted an official trailer for the indie drama On Swift Horses, an enigmatic sweeping romantic proper movie set in the past in America. Not to be confused with the Apple TV series Slow Horses. Made by director Daniel Minahan, this first premiered at the 2024 Toronto Film Festival last year, and is next playing at the 2025 SXSW Film Festival coming up in March. Another chance to catch it before it opens. Muriel and her husband Lee are about to begin a bright new life in California, which is upended by the arrival of Lee's brother. Muriel embarks on a secret life of her own, gambling on racehorses and discovering a love that she never thought possible. Starring Daisy Edgar-Jones, Jacob Elordi, Will Poulter, Diego Calva, and Sasha Calle. That's an impressive powerhouse cast giving what look like are excellent, emotional performances in this. The whole dang film looks better than expected - worth a watch. Here's the first official trailer for Daniel Minahan's film On Swift Horses, direct from YouTube: Muriel (Daisy Edgar Jones) and her […]",
    "author": "Alex Billington",
    "published": "Thu, 13 Feb 2025 22:16:58 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/onslowhorsesmainimAmerbigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "0dc7bc4e-308c-44fa-9dd0-7e08dc3d371e",
    "title": "Berlinale 2025: Shut It Off! Tom Tykwer's 'The Light' is Strangely Dim",
    "link": "https://www.firstshowing.net/2025/berlinale-2025-shut-it-off-tom-tykwers-the-light-is-strangely-dim/",
    "description": "Someone needs to check the bulb - this light isn't working right. The Berlin Film Festival continues its long-running streak of choosing really bad films as the Opening Night selection at the festival. For nearly 10 years running (so far), Berlinale makes a big show of its opening film being an exciting premiere, and yet they continue to be forgettable, excruciating, mediocre films no matter what. It's a depressing way to start a film festival. Tom Tykwer's new film Das Licht (aka The Light) maintains this pattern of mediocrity - taking us on a 2 hour, 42 minute journey around Berlin following an annoying German family. I wish it was better. I wish I could be raving about Tykwer's return to cinema. But this is one giant mess. The classic cliche of \"he bit off more than he could chew\" works for this film, as it's trying to address so many different topics about modern day German society and barely any of it works. It's a story about a family, but no it's a story about Germany, but no it's a story about refugees, but no it's a story about a Syrian woman living in Germany, but no it's a […]",
    "author": "Alex Billington",
    "published": "Thu, 13 Feb 2025 18:30:08 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/TheLightLichtReviewmainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Berlinale",
      "Review"
    ]
  },
  {
    "id": "c349419c-cc20-4f63-a702-149b93d63c7e",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for February 2025",
    "link": "https://www.comingsoon.net/guides/features/1915240-wheel-of-fortune-bonus-puzzle-february-2025-today-answer-tonight",
    "description": "The puzzle solutions for February 2025. The post Wheel of Fortune Bonus Puzzle Answer Today for February 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Fri, 14 Feb 2025 01:00:55 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/wheel-of-fortune-bonus-puzzle-answer-tonight-today-february-2025-round.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "Evergreen",
      "Explainer",
      "Game Show",
      "Ryan Seacrest",
      "Sony Pictures",
      "TV Guides",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "e94df001-9ffc-49a5-a295-a88424c2510b",
    "title": "Clayface: Jeff Wadlow, James Watkins 2 of Several Directors in the Mix for DCU Movie",
    "link": "https://www.comingsoon.net/guides/news/1921626-dc-clayface-director-jeff-wadlow-james-watkins-dcu-movie",
    "description": "DC’s planned Clayface movie has officially begun hearing pitches from directors, with Deadline reporting that Jeff Wadlow and James Watkins are in the mix to helm the project. The latest report notes that DC Studios is beginning to hear pitches from potential directors in the coming week, with both Wadlow and Watkins being names that […] The post Clayface: Jeff Wadlow, James Watkins 2 of Several Directors in the Mix for DCU Movie appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Thu, 13 Feb 2025 23:35:10 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/03/clayface-header.png?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Clayface",
      "DC",
      "DC Studios",
      "DC Universe",
      "James Gunn",
      "James Watkins",
      "Jeff Wadlow",
      "Mike Flanagan",
      "Movie News",
      "Warner Bros.",
      "Warner Bros. Discovery"
    ]
  },
  {
    "id": "c4b28c65-b13a-48ad-b5c4-6f80cb7283d4",
    "title": "Clayface: Jeff Wadlow, James Watkins Among Candidates To Direct",
    "link": "https://bleedingcool.com/movies/clayface-is-narrowing-its-director-search-down-to-two-possibilities/",
    "description": "Jeff Wadlow and Jeff Watkins are reportedly among the possible candidates to direct the upcoming Clayface film.",
    "author": "Kaitlyn Booth",
    "published": "Thu, 13 Feb 2025 18:02:08 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Warner Bros",
      "Clayface",
      "dc studios",
      "james gunn",
      "Mike Flanagan"
    ]
  },
  {
    "id": "40e0eb5b-d0e0-479c-8f12-9c52dd53afe8",
    "title": "Constantine 2 Director Says The Film Is \"Closer Than Ever\"",
    "link": "https://bleedingcool.com/movies/constantine-2-director-says-the-film-is-closer-than-ever/",
    "description": "Constantine 2 director Francis Lawrence confirms that the sequel is closer to happening than ever, and everyone involved is \"super, super excited about it.\"",
    "author": "Kaitlyn Booth",
    "published": "Thu, 13 Feb 2025 14:18:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Warner Bros",
      "constantine 2",
      "francis lawrence"
    ]
  },
  {
    "id": "325a0512-161f-4c9f-a701-66e39cfac21e",
    "title": "‘No Other Land’ Is Nominated for an Oscar, but in Masafer Yatta, We’re Still Being Erased — Opinion",
    "link": "https://www.indiewire.com/features/commentary/no-other-land-nominated-oscar-life-changed-1235095210/",
    "description": "Oscar-nominated filmmaker and journalist Basel Adra shares how life has changed (and, worryingly, stayed the same) after the historic Best Documentary Feature nomination for the film he co-directed with Yuval Abraham, Rachel Szor, and Hamdan Ballal.",
    "author": "Kate Erbland",
    "published": "Thu, 13 Feb 2025 22:36:24 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Commentary",
      "Features",
      "Film",
      "No Other Land",
      "Opinion"
    ]
  },
  {
    "id": "309838fb-3f1d-49ab-97c5-549a1c8611b3",
    "title": "How the Editing of ‘Conclave’ Gives Its Cardinal All the Clues",
    "link": "https://www.indiewire.com/features/craft/conclave-editing-clues-interview-1235094737/",
    "description": "Editor Nick Emerson tells IndieWire about centering Cardinal Lawrence's (Ralph Fiennes) perspective through the Edward Berger film's papal election.",
    "author": "Sarah Shachat",
    "published": "Thu, 13 Feb 2025 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Craft | Technology, Sound and Set Design",
      "Features",
      "Conclave",
      "Edward Berger",
      "Film",
      "Ralph Fiennes",
      "Top of the Line"
    ]
  }
]
