[
  {
    "id": "06218006-5aa1-4352-a009-ba1be1a8eff7",
    "title": "Carlos Watson Says Trump Has Commuted His Prison Sentence for Ozy Media Fraud",
    "link": "https://variety.com/2025/tv/news/carlos-watson-trump-commute-prison-sentence-ozy-media-fraud-1236351619/",
    "description": "Carlos Watson and his supporters are asserting that President Donald Trump has commuted the nearly 10-year prison sentence that he received after being convicted of extensive fraud in operating his digital media startup Ozy Media. Watson was sentenced to 116 months in prison in December following his conviction on charges of securities fraud, conspiracy to […]",
    "author": "Cynthia Littleton",
    "published": "Fri, 28 Mar 2025 23:06:36 +0000",
    "image": "https://variety.com/wp-content/uploads/2023/03/Carlos-Watson-Ozy-Media.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Carlos Watson",
      "Ozy Media"
    ]
  },
  {
    "id": "f831672a-ff80-419f-b2b8-1111018fe293",
    "title": "Katherine Heigl Says ‘Grey’s Anatomy’ Ghost Sex Was ‘Confusing,’ Reunites With Jeffrey Dean Morgan to Discuss ‘Awkward’ Storyline: ‘She’s F—ing a Dead Guy?’",
    "link": "https://variety.com/2025/tv/news/katherine-heigl-jeffrey-dean-morgan-greys-anatomy-ghost-sex-1236351015/",
    "description": "Katherine Heigl and Jeffrey Dean Morgan reunited for the first time in years as part of Entertainment Weekly’s 20th anniversary of Shondaland and got brutally honest about one of “Grey’s Anatomy’s” worst storylines: Ghost sex. The romance between Heigl’s Izzie and Morgan’s Denny in Season 2 bolstered the show’s popularity and powered Heigl to an […]",
    "author": "Zack Sharf",
    "published": "Fri, 28 Mar 2025 22:54:49 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/03/TCDGRAN_EC113.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Grey's Anatomy",
      "Jeffrey Dean Morgan",
      "Katherine Heigl"
    ]
  },
  {
    "id": "0fe49dcc-5bf1-4587-b3ff-279a0bc16a07",
    "title": "Gina Gershon talks HIGH ROLLERS",
    "link": "https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Actress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE. Read the full article on AICN When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience: This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper.    The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience. They are contacted by Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 18 Mar 2025 19:24:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "0547fb6b-b33d-4e44-94b9-9fb46d7c93ca",
    "title": "New Releases - RAGING MIDLIFE and AMERICAN DREAMER",
    "link": "https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric reviews (new) releases RAGING MIDLIFE and AMERICAN DREAMER. Read the full article on AICN Hello all! McEric here with a quick review of two (new) releases hitting the market this St. Patrick's Day Weekend, both of which I actually enjoyed. RAGING MIDLIFE First was RAGING MIDLIFE, a movie that was pitched to me as starring Paula Abdul (I'm a massive fan), Eddie Griffin (DOUBLE TAKE), Walter Koenig (STAR TREK), and Motch O. Mann, the world's foremost Macho Man Randy Savage impersonator. Yeah, I hear it, too. Luckily, I didn't read any further. I saw Paula Abdul's name and shouted \"I'm in!\" Going in to this film blind is the best way to see it. As I'm furnishing you with a review, however, I must speak further to the film. If you want to skip down to AMERICAN DREAMER and go in blind, I do suggest it. Otherwise, here we go. The film, written by Nic Costa and Rob Taylor, and directed by the latter, follows childhood friends Alex and Mark, now in their midlives (see that?) who are chasing their dragon - a purple tanktop once worn by their favorite wrestler, Raging Abe. Raging Abe is a Macho Man Randy Savage-type character who wears a stove pipe hat and chin beard and lives by five \"proclamations,\" all meant to help his young fans navigate life and walk as better people. The film opens with grainy footage of a talk show appearance (think Arsenio Hall) from Raging Abe and his handler, Mary Todd, played by Abdul. The action opens in the eighties with young Alex and Mark ringside Finish the article on AICN",
    "author": "McEric",
    "published": "Sat, 15 Mar 2025 16:35:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "c23156a2-713e-440b-bf26-18e959adf74f",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "9b01c8b5-ee75-4166-bfc7-6ab2ea803bda",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "a1680365-264b-4b5e-8812-d0fb31e993e8",
    "title": "‘Pod Save The UK’s Nish Kumar On Invading Canada, Breaking America, Trump, Elon Musk, \u0026 Comedy Traversing The Globe",
    "link": "https://deadline.com/2025/03/nish-kumar-trump-pod-save-the-uk-interview-1236352745/",
    "description": "“We live in the stupidest possible version of human history,” said Nish Kumar to a roaring packed Largo at the Coronet in LA last week, perfectly summing up 2025 so far. Cited as one of the 50 best comedians of the 21st century by the UK’s The Guardian and the subject of a recent New […]",
    "author": "Dominic Patten",
    "published": "Sat, 29 Mar 2025 00:08:01 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/nish-kumar-cbs-getty-feb-2024.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Politics",
      "After Midnight",
      "CAA",
      "Comedy",
      "Crooked Media",
      "Donald Trump",
      "Elon Musk",
      "Quibi"
    ]
  },
  {
    "id": "e9a6874e-fbd9-459c-bb42-61d5a9588a73",
    "title": "‘Citadel’ Franchise Faces Uncertain Future At Amazon Following Jennifer Salke’s Exit",
    "link": "https://deadline.com/2025/03/citadel-season-2-spinoffs-future-amazon-1236353735/",
    "description": "The surprise departure Thursday of Jennifer Salke, Head of Amazon MGM Studios, inevitably is drawing attention to one of her pet projects, global spy thriller Citadel. Based on an idea by Salke, Citadel was probably the biggest gamble of her tenure atop Amazon MGM Studios — an ambitious, expansive and expensive multi-series, multi-country endeavor for […]",
    "author": "Denise Petski",
    "published": "Fri, 28 Mar 2025 23:44:01 +0000",
    "image": "https://deadline.com/wp-content/uploads/2023/05/Citadel.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Citadel",
      "Prime Video",
      "Priyanka Chopra Jonas",
      "Richard Madden",
      "Russo Brothers"
    ]
  },
  {
    "id": "04738942-39a5-47e4-ae55-661fd0cd6614",
    "title": "Superman’s Jor-El Actor Revealed for DCU Movie",
    "link": "https://www.comingsoon.net/movies/news/1947130-superman-jor-el-actor-revealed-for-dcu-movie",
    "description": "A new report from a noted leaker has opened up about a major cameo in James Gunn’s upcoming Superman movie, the actor playing Jor-El. Who is playing Jor-El in Superman? According to noted insider and leaker ViewerAnon, Bradley Cooper is playing the role of Jor-El in the upcoming movie. The leaker notes that the actor […] The post Superman’s Jor-El Actor Revealed for DCU Movie appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Sat, 29 Mar 2025 00:33:13 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/jor-el-superman.png?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Bradley Cooper",
      "DC",
      "DC Studios",
      "DCU",
      "James Gunn",
      "Movie News",
      "Superman",
      "Warner Bros.",
      "Warner Bros. Discovery"
    ]
  },
  {
    "id": "a24326fe-e0ae-4e08-8478-410a327248a8",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for March 24-31, 2025",
    "link": "https://www.comingsoon.net/guides/features/1943412-wheel-of-fortune-bonus-puzzle-march-24-31-2025-today-answer-tonight",
    "description": "The WoF answers from March 24 to 31. The post Wheel of Fortune Bonus Puzzle Answer Today for March 24-31, 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Sat, 29 Mar 2025 00:02:31 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/wheel-of-fortune-bonus-puzzle-answer-tonight-today-march-24-31-2025.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "Evergreen",
      "exclude_from_yahoo",
      "Game Show",
      "Ryan Seacrest",
      "Sony Pictures",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "9f889b90-118b-4d3e-bfc7-f30e60b5fd44",
    "title": "Yellowjackets Season 3 Finally Confirms The Identity Of Hilary Swank's Character",
    "link": "https://www.slashfilm.com/1819537/yellowjackets-season-3-hilary-swank-character-identity-melissa/",
    "description": "The Yellowjackets hive can finally put an end to the theorizing, because season 3 has finally revealed who Hilary Swank is playing on the horror show.",
    "author": "Devin Meenan",
    "published": "Fri, 28 Mar 2025 22:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/yellowjackets-season-3-finally-confirms-the-identity-of-hilary-swanks-character/l-intro-1742949973.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Horror Shows",
      "Thriller Shows"
    ]
  },
  {
    "id": "7b76c7bf-8035-47a8-bee2-43fd0ffc524d",
    "title": "Doctor Strange Director Scott Derrickson Is Sticking With Horror For His Next Movie",
    "link": "https://www.slashfilm.com/1821566/doctor-strange-director-scott-derrickson-sticking-with-horror-road-of-bones/",
    "description": "Scott Derrickson, the director of Sinister, The Black Phone, The Gorge, and the upcoming The Black Phone 2, is sticking with horror for his newest movie.",
    "author": "Ryan Scott",
    "published": "Fri, 28 Mar 2025 21:50:06 +0000",
    "image": "https://www.slashfilm.com/img/gallery/doctor-strange-director-scott-derrickson-is-sticking-with-horror-for-his-next-movie/l-intro-1743198488.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Horror Movies"
    ]
  },
  {
    "id": "b3b09581-b72a-49fa-a14e-8cb38a14f87d",
    "title": "Watch: Insomniac Animated Short 'Snooze Quest' About Mental Health",
    "link": "https://www.firstshowing.net/2025/watch-funky-animated-short-snooze-quest-about-mental-health/",
    "description": "\"I can't sleep! What do I do?\" Take a voyage into the strange, chaotic, clever mind of an insomniac named PJ. This animated short titled Snooze Quest is presented in the \"Adult Swim Smalls\" collection of short films. (They're helping fund \u0026 produce any kind of wacky, weird, crazy short creations - watch more here.) Snooze Quest is a 9-minute short film created by the LA-based animation filmmaker Victoria Vincent aka \"vewn\" online, who's already known for making many other animated shorts. With additional animation by Lewis Tarver, featuring glitch FX by Trevor Mac. This is the only intro you need before clicking play: PJ goes on a sleepless quest to stop a sniper attack. The film is a wild dive into a peculiar plot involving a mysterious sniper and a girl who just can't get any sleep. But it's also about mental health and how hard it is to keep your mind healthy in this overloaded, digital-noise-filled world we're in. Enjoy your time with PJ \u0026 friends. Thanks to Vimeo Staff Picks for the tip on this short. Here's the brief intro via Vimeo: \"PJ spends a sleepless night getting roped into a sniper revenge plot.\" Snooze Quest is […]",
    "author": "Alex Billington",
    "published": "Fri, 28 Mar 2025 22:03:46 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/SnoozeQuestShortfilmanimTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Animation",
      "Short Film",
      "To Watch"
    ]
  },
  {
    "id": "98fcc49f-722a-4826-8735-4629705a887b",
    "title": "It's Official: Sundance Film Festival is Moving to Boulder, CO in 2027",
    "link": "https://www.firstshowing.net/2025/its-official-sundance-film-festival-is-moving-to-boulder-co-in-2027/",
    "description": "They've finally made an official announcement: the world famous Sundance Film Festival is moving to Boulder, Colorado starting in 2027. I have been attending the Sundance Film Festival longer than any other festival – next year it will be the 20th year in a row that FirstShowing has covered Sundance. It was the first festival I attended as a member of the press, and I've been going non-stop ever since 2007. I feel a deep connection to Sundance, not only because of the mountains \u0026 snow, but I sort of grew up going to this festival every year since I was 20 years old. I originally grew up in Colorado Springs, CO before moving away to Los Angeles and New York and Berlin – but I still fly back to Utah year after year. For the last 44 years, Sundance has been based in Park City, Utah, a ski resort town outside of Salt Lake City. The fest started out as the US Film Festival in SLC in 1978, moved to Park City in 1981, only becoming known as \"Sundance\" in 1984. The rest is history, as they say – Kevin Smith, Quentin Tarantino, Steven Soderbergh, Kelly Reichardt all launched their […]",
    "author": "Alex Billington",
    "published": "Fri, 28 Mar 2025 18:06:11 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/SundanceBouldersignMaintsr2.jpg?quality=96",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Editorial",
      "Movie News",
      "Sundance 25"
    ]
  },
  {
    "id": "5aeec993-267e-42a3-9d3c-5642e1baf5a2",
    "title": "CPH:DOX Winners Led by ‘Always,’ ‘2000 Meters to Andriivka,’ and More",
    "link": "https://www.indiewire.com/news/festivals/cph-dox-2025-film-festival-winners-1235112032/",
    "description": "The Copenhagen documentary film festival is among the world's premier destinations of nonfiction filmmaking.",
    "author": "Ryan Lattanzio",
    "published": "Fri, 28 Mar 2025 23:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Festivals",
      "News",
      "CPH:DOX",
      "Film"
    ]
  },
  {
    "id": "1ddd2a53-3ef2-4bcd-a812-944532d92b0e",
    "title": "Academy Apologizes for Omitting Hamdan Ballal’s Name After 600 Academy Members Criticize Its Initial Response to Attack on Filmmaker",
    "link": "https://www.indiewire.com/news/breaking-news/academy-members-criticize-response-to-hamdan-ballal-arrest-1235111964/",
    "description": "Oscar winners like Alfonso Cuarón and Olivia Colman had signed an open statement criticizing the Academy's response to the brutal attack and arrest of the \"No Other Land\" co-director.",
    "author": "Marcus Jones",
    "published": "Fri, 28 Mar 2025 23:01:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Breaking News",
      "News",
      "Academy Of Motion Picture Arts and Sciences",
      "Film",
      "Hamdan Ballal",
      "No Other Land",
      "Oscars"
    ]
  },
  {
    "id": "0e584e5d-afe7-48b4-b08a-b2973d34ed43",
    "title": "How To Train Your Dragon: Character Posters Spotlight The Dragons",
    "link": "https://bleedingcool.com/movies/how-to-train-your-dragon-character-posters-spotlight-the-dragons/",
    "description": "Universal Pictures has released 6 new character posters for the live-action remake of How To Train Your Dragon, which will be released on June 13th.",
    "author": "Kaitlyn Booth",
    "published": "Fri, 28 Mar 2025 15:48:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Universal",
      "how to train your dragon"
    ]
  },
  {
    "id": "f0886005-b010-49ac-8f5b-5293c936241c",
    "title": "Trump's FCC Investigating Disney, ABC for Not Whitewashing Enough?",
    "link": "https://bleedingcool.com/tv/trumps-fcc-investigating-disney-abc-for-not-whitewashing-enough/",
    "description": "Trump fan Brendan Carr announced that the FCC is investigating Disney and ABC over its diversity, equity, and inclusions policies.",
    "author": "Ray Flook",
    "published": "Fri, 28 Mar 2025 15:36:08 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Opinion",
      "TV",
      "TV",
      "disney",
      "fcc",
      "opinion",
      "trump"
    ]
  }
]
