[
  {
    "id": "65d34468-7c88-46d1-a7df-911b0336348e",
    "title": "Bose’s Bestselling SoundLink Portable Speaker Is $70 Off Online",
    "link": "https://variety.com/2025/shopping/tech/best-bose-speaker-deal-1235667877/",
    "description": "The Sonos Move speaker has long been a favorite among audiophiles for its clean, crisp sound, easy connectivity and sleek design. But at $449, the Move doesn’t come cheap, and Sonos almost never puts its products up for sale. What’s more: the Move is often backordered on the Sonos website, and availability on Amazon comes […]",
    "author": "Tim Chan",
    "published": "Tue, 13 May 2025 01:02:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/05/bose-soundlink-deal.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Tech",
      "Bose",
      "NOADS",
      "speakers",
      "wireless speakers"
    ]
  },
  {
    "id": "3e70f99b-1da5-4d92-8c14-663ff4ba6a0d",
    "title": "Amazon 2025 Upfront: Michael B. Jordan, Arnold Schwarzenegger, Jamie Lee Curtis Light Up Stage as Streamer Makes Strong Return",
    "link": "https://variety.com/2025/tv/news/amazons-2025-upfront-michael-b-jordan-arnold-schwarzenegger-1236395112/",
    "description": "Amazon made their second formal appearance at the upfronts in New York on Monday night, and they definitely pulled out all the stops once again. Like their 2024 presentation, Amazon made a number of splashy announcements with major star power to rev up excitement in the normally sedate crowd of advertising executives at the storied […]",
    "author": "Joseph Otterson",
    "published": "Tue, 13 May 2025 00:48:04 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/05/Amazon-Upfront-Arnold-Jamie-Lee-Curtis.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Amazon",
      "Upfronts"
    ]
  },
  {
    "id": "41588c51-913f-4fb0-a079-ddfd2d97262f",
    "title": "New (and Old) Releases This Week, with McEric!",
    "link": "https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric cleans up his inbox by dumping reviews for NEIGHBORHOOD WATCH, RENNER, MOB COPS, and YOUNG WERTHER. Read the full article on AICN Hello all!  I've got some reviews of two films releasing this Friday, April 25th - but thought I'd also take this opportunity to highlight two other films that are already out there but I haven't yet found the time to cover. Hopefully there's something here for everyone, so let's get right to it: First up is NEIGHBORHOOD WATCH, starring Jack Quaid (NOVOCAINE, THE COMPANION, \"The Boys\"), Jeffrey Dean Morgan (\"The Boys,\" \"The Walking Dead\"), and Malin Ackerman (WATCHMEN, SLAYERS), directed by Duncan Skiles (THE CLOVEHITCH KILLER) and written by Sean Farley. The film features troubled young man Simon McNally (Quaid), who is trying to find his feet after spending a decade in a facility for mental health treatment, and his paranoid ex-security guard neighbor Ed Deerman. The two form an unlikely partnership when Simon believes he's seen a woman kidnapped but is deemed an unreliable witness by police due to his history and behavior. The two men take it upon themselves to investigate the crime and rescue the woman, revealing a deeper web of villainy in their quiet town. Quaid and Morgan have great chemistry, and Quaid, specifically, does some great work in this film. Whereas the majority of his characters have been able to rely and charm and humor, Simon is stripped of these tools due to the abuse he received at a young age, so the tricks that Quaid would normally utilize to endear himself to audiences are out of reach. Quaid does a great job of humanizing McNally as a Finish the article on AICN",
    "author": "McEric",
    "published": "Thu, 24 Apr 2025 20:33:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "b3c88992-655c-48fc-a22d-6f989eaea9df",
    "title": "Gina Gershon talks HIGH ROLLERS",
    "link": "https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Actress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE. Read the full article on AICN When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience: This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper.    The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience. They are contacted by Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 18 Mar 2025 19:24:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "a89214c7-585c-43e9-b05d-1b7b8f749beb",
    "title": "Hacks Season 4 Episode 7\u00268 Release Date, Time, Where to Watch",
    "link": "https://www.comingsoon.net/guides/news/1969302-hacks-season-4-episode-7-8-release-date-time-where-to-watch",
    "description": "The Hacks Season 4 Episode 7\u00268 release date and time are right around the corner, and many are eager to know the streaming details. In the previous episode, the focus group informed that the show isn’t performing well with women on it. However, Deborah doesn’t give up and tries her best to impress them. On […] The post Hacks Season 4 Episode 7\u00268 Release Date, Time, Where to Watch appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Shazmeen Navrange",
    "published": "Tue, 13 May 2025 01:05:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/05/Hacks-Season-4-Episode.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "Episode Release Date",
      "exclude_from_yahoo",
      "Hacks"
    ]
  },
  {
    "id": "afcfbc68-2825-4e2d-88c8-31695d546706",
    "title": "What Happened to Amouranth \u0026 Husband Nick? Conflict Explained",
    "link": "https://www.comingsoon.net/guides/news/1971318-amouranth-husband-nick-lee-conflict-explained",
    "description": "Popular online streamer Amouranth has recently gone viral on social media after an argument with her husband, Nick Lee, turned ugly during a live broadcast. Two video clips from the infamous live stream surfaced on May 11, 2025, showcasing the couple getting into a heated altercation filled with verbal abuse. Moreover, even the law became […] The post What Happened to Amouranth \u0026 Husband Nick? Conflict Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Namrata Ghosh",
    "published": "Tue, 13 May 2025 00:31:08 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/05/MixCollage-13-May-2025-05-59-AM-8323.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Amouranth",
      "Nick Lee",
      "Pop Culture",
      "Pop Culture FAQ"
    ]
  },
  {
    "id": "b89b674f-e01f-4ab4-993d-136d7ed2f844",
    "title": "Jamie Lee Curtis Rescues Arnold Schwarzenegger In ‘True Lies’ Reunion At Amazon Upfront",
    "link": "https://deadline.com/2025/05/jamie-lee-curtis-rescues-arnold-schwarzenegger-true-lies-reunion-amazon-1236394719/",
    "description": "After Arnold Schwarzenegger’s self-described “speech” about Christmas movie The Man with the Bag ran on a bit at the Amazon upfront Monday, Jamie Lee Curtis came to the rescue. Schwarzenegger plugged the movie (repeatedly misidentifying it as The Man in the Bag) in his customary machine-like fashion. After initially wowing the crowd and earning the […]",
    "author": "Dade Hayes",
    "published": "Tue, 13 May 2025 01:07:33 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/05/Jamie-Lee-Curtis.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Amazon",
      "Arnold Schwarzenegger",
      "Jamie Lee Curtis",
      "Prime Video",
      "The Man With The Bag",
      "Upfronts"
    ]
  },
  {
    "id": "647b9b2d-54e5-482e-9f46-cf6baac488ac",
    "title": "Everything We Know About Ari Aster’s ‘Eddington’ So Far",
    "link": "https://deadline.com/feature/eddington-ari-aster-news-updates-1236394725/",
    "description": "Ari Aster’s fourth film, Eddington is on the horizon. The Western thriller and black comedy film follows Aster’s Beau Is Afraid (2023) starring Joaquin Phoenix, who has reteamed with the director on his latest project. Aster was also behind films like the Florence Pugh-starring Midsommar (2019) and Hereditary (2018) and C’est La Vie (2016). For […]",
    "author": "Dessi Gomez",
    "published": "Tue, 13 May 2025 00:56:15 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/04/https___cdn.sanity.io_images_xq1bjtf4_production_ff861f8b6fc5ffddeb65074da53296f909c1368a-4688x2508-1.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Ari Aster",
      "Eddington",
      "Emma Stone",
      "Joaquin Phoenix",
      "Pedro Pascal"
    ]
  },
  {
    "id": "e868cd2b-4c87-46c2-8291-b9ba5499fa4b",
    "title": "Dina's Shocking The Last Of Us Season 2, Episode 5 Monologue, Explained By Isabela Merced",
    "link": "https://www.slashfilm.com/1858065/isabela-merced-dina-the-last-of-us-season-2-episode-2-monologue-explained/",
    "description": "Dina had a big moment on the latest episode of The Last of Us season 2, and actor Isabela Merced has thoughts on the scene.",
    "author": "Nina Starner",
    "published": "Tue, 13 May 2025 00:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/dinas-shocking-the-last-of-us-season-2-episode-5-monologue-explained-by-isabela-merced/l-intro-1747079196.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "TV News",
      "Horror Shows"
    ]
  },
  {
    "id": "b4f9ec82-014d-482d-b752-fe0dee3a9495",
    "title": "The Seinfeld Episode That Actually Changed People's Lives, According To Jason Alexander",
    "link": "https://www.slashfilm.com/1855456/jason-alexander-seinfeld-episode-changed-lives-the-opposite/",
    "description": "Seinfeld might be the 'show about nothing,' but Jason Alexander discovered one particular episode actually had a profound effect on people in real life.",
    "author": "Rusteen Honardoost",
    "published": "Mon, 12 May 2025 22:45:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-seinfeld-episode-that-actually-changed-peoples-lives-according-to-jason-alexander/l-intro-1746797805.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Comedy Shows"
    ]
  },
  {
    "id": "197ee699-bb6f-4c78-b3e4-c24c096b4b4f",
    "title": "Nicolas Cage Is a 1930s Private Investigator in ‘Spider-Verse’ Spinoff ‘Spider-Noir’ First Look",
    "link": "https://www.indiewire.com/news/breaking-news/spider-noir-first-look-nicolas-cage-1235122523/",
    "description": "The live action series will be available in both color and black and white as an ode to the iconic 100-year-old genre film aesthetic.",
    "author": "Samantha Bergeson",
    "published": "Mon, 12 May 2025 23:05:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Breaking News",
      "News",
      "Nicolas Cage",
      "Spider-Noir",
      "TV"
    ]
  },
  {
    "id": "8eda7c67-7669-43bd-921c-39688b854f30",
    "title": "Bella Ramsey Wants to Know: Is Ellie the Real Villain on ‘The Last of Us’ Season 2?",
    "link": "https://www.indiewire.com/features/interviews/bella-ramsey-ellie-villain-last-of-us-interview-video-1235122513/",
    "description": "The actor and co-star Kaitlyn Dever unpacked the meaning of apocalyptic revenge for IndieWire.",
    "author": "Alison Foreman",
    "published": "Mon, 12 May 2025 22:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Features",
      "Interviews | Celebrity Interviews \u0026 Insider Takes",
      "Bella Ramsey",
      "Kaitlyn Dever",
      "The Last of Us",
      "TV",
      "Video"
    ]
  },
  {
    "id": "10f423a7-de58-40bc-884e-28c615beee6f",
    "title": "Watch: Hilarious 'Heroic Dose' Short - That One Time on Too Much LSD",
    "link": "https://www.firstshowing.net/2025/watch-hilarious-heroic-dose-short-too-much-lsd/",
    "description": "\"And then what happened?\" \"It was a moment of true liberation from the ego mind.\" Don't you want to find out more? Will you be forever changed by this story? Dive in and find out. Heroic Dose is a hilarious new comedy short film created and directed by a filmmaker known as Dugan Gundelfinger (not his real last name). This his \"opus\", an autobiographical tale of the time he tripped on way too much acid. \"A genre bending comedic retelling of the time I had a psychedelic-induced mystical journey exploring the ego mind, 'reality' and the cosmic joke of the human experience...\" During a dinner gathering discussing trying drugs, Gundelfinger tells his story of the time he was given a \"heroic dose\" LSD and went hard on psychedelics. It's not exactly meant to be a philosophical film (though I do like his idea about the \"ahh\" sound). But it might actually make a few people want to try this? Please be safe. The dinner cast includes Leighton Lovejoy, Jena Malone, Nick Rutherford, Rachael Leigh Cook, Demorge Brown, Max Baumgarten, and April Lee. This wacky short is only 13 mins long and will definitely have you laughing out loud many times. […]",
    "author": "Alex Billington",
    "published": "Mon, 12 May 2025 20:11:11 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/HeroicDoseShortmainimgTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Comedy",
      "Short Film",
      "To Watch"
    ]
  },
  {
    "id": "0c9c17b6-5c1a-4ae9-b661-d7c0814979a2",
    "title": "Full Trailer for 'Adults' Comedy Series Following 20-Somethings in NYC",
    "link": "https://www.firstshowing.net/2025/full-trailer-for-adults-comedy-series-following-20-somethings-in-nyc/",
    "description": "\"This is very irresponsible guys... You guys are completely out of control.\" FX on Hulu has revealed their full official trailer for a new ensemble comedy series called Adults, streaming at the end of May. It seems like it's a contemporary riff on the classic series Friends, while also having tons of fun like Lena Dunham's Girls series on HBO as well. A twenty-something ensemble comedy centering on co-dependent housemates navigating adulthood together despite their flaws. They live in New York and are trying to be good people, despite being neither \"good\" nor \"people\" yet. Ha. Starring Malik Elassal, Lucy Freyer, Jack Innanen, Amita Rao, Owen Thiele. Guest stars in this include Julia Fox, Charlie Cox, Ray Nicholson, plus D'Arcy Carden, Grace Kuhlenschmidt, and John Reynolds. \"Whether they’re trying to get ahead at work, navigating the healthcare system, hosting a dinner party or dating in the age of Find My Friends, the group is finding that nothing about the real world is simple, and all their best intentions tend to make things worse.\" This looks like good fun - really trying to accurately represent the 20-something crazy lifestyle nowadays. Enjoy. Here's the main official trailer (+ poster) for FX's comedy […]",
    "author": "Alex Billington",
    "published": "Mon, 12 May 2025 17:48:26 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img17/AdultsSeriesPostermainbigFXTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "a3b2c626-5ff8-4558-a914-f9355e14ee6e",
    "title": "Spider-Noir: Prime Video Previews Nicolas Cage-Starring Series",
    "link": "https://bleedingcool.com/tv/spider-noir-prime-video-previews-nicolas-cage-starring-series/",
    "description": "Check out an official look at Nicolas Cage from Sony Pictures Television and Amazon MGM Studios' upcoming Spider-Noir, set for 2026.",
    "author": "Ray Flook",
    "published": "Mon, 12 May 2025 18:23:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Amazon Studios",
      "Movies",
      "TV",
      "spider-noir"
    ]
  },
  {
    "id": "e066eb3e-f584-4dd6-870b-d53013718a47",
    "title": "Ballerina: Eve Meets The Baba Yaga In A New Clip",
    "link": "https://bleedingcool.com/movies/ballerina-eve-meets-the-baba-yaga-in-a-new-clip/",
    "description": "In a new clip from Ballerina, Eve meets the Baba Yaga, aka John Wick, for the first time and asks for some professional and life advice.",
    "author": "Kaitlyn Booth",
    "published": "Mon, 12 May 2025 14:57:06 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Lionsgate",
      "Movies",
      "Ballerina"
    ]
  }
]
