[
  {
    "id": "6e2cff6f-7121-4f05-a8d1-b5c90d126eba",
    "title": "Rebecca Ferguson Was Terrified Filming An Important Dune Scene",
    "link": "https://www.slashfilm.com/1763559/rebecca-ferguson-terrified-filming-dune-scene/",
    "description": "During an important scene in Denis Villeneuve's first Dune movie, Lady Jessica actress Rebecca Ferguson was genuinely terrified.",
    "author": "Witney Seibold",
    "published": "Sat, 08 Feb 2025 22:45:46 +0000",
    "image": "https://www.slashfilm.com/img/gallery/rebecca-ferguson-was-terrified-filming-an-important-dune-scene/l-intro-1737043362.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Science Fiction Movies"
    ]
  },
  {
    "id": "c21cc6d1-f37c-49fd-abc0-9667bde228d9",
    "title": "Why Ryan Gosling Replaced George Clooney In The Notebook",
    "link": "https://www.slashfilm.com/1768483/why-ryan-gosling-replaced-george-clooney-the-notebook/",
    "description": "Years before Ryan Gosling entered the picture, George Clooney was attached to play Noah in an earlier version of The Notebook.",
    "author": "Nick Staniforth",
    "published": "Sat, 08 Feb 2025 22:00:39 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-ryan-gosling-replaced-george-clooney-in-the-notebook/l-intro-1737562232.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Romance Movies"
    ]
  },
  {
    "id": "de754871-66e6-4949-857d-818b55d33260",
    "title": "‘The 47,’ ‘Undercover’ Share Best Picture Honors at Spain’s Goya Awards in Historic First",
    "link": "https://variety.com/2025/awards/global/goya-award-winners-the-47-undercover-1236301543/",
    "description": "In a historic first, Marcel Barrera’s heroic bus driver heart warmer “The 47” and Arantxa Echeverría terrorist org infiltrator thriller “Undercover” became the first films ever to share the best picture Spanish Academy Goya on Saturday night at a ceremony where Richard Gere lashed out at Donald Trump. “We are in a very dark place in […]",
    "author": "Jamie Lang",
    "published": "Sun, 09 Feb 2025 00:51:42 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/Undercover-The-47.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Global",
      "News",
      "Goya Awards",
      "Spain",
      "The 47",
      "Undercover"
    ]
  },
  {
    "id": "4f6feb4f-2a98-4305-b34b-46e83091dc43",
    "title": "Denzel Washington Says He’s ‘Been Around Too Long’ to Care About ‘Gladiator II’ Oscar Snub: ‘Aww. Oh, I’m So Upset’",
    "link": "https://variety.com/2025/film/people-news/denzel-washington-jokes-about-gladiator-ii-oscar-snub-1236301571/",
    "description": "Some may have been surprised by Denzel Washington’s exclusion from the best supporting actor race at the 2025 Academy Awards, but he’s not losing sleep over it. Amid a chaotic Oscar season, Washington spoke to the New York Times about his reaction to being snubbed by the Academy for his performance in Ridley Scott’s “Gladiator […]",
    "author": "Lauren Coates",
    "published": "Sun, 09 Feb 2025 00:39:40 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/11/Denzel-Washington.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "People News",
      "Denzel Washington",
      "Gladiator II",
      "Oscars 2025"
    ]
  },
  {
    "id": "37e5203c-a5c1-4cbf-a69b-cdb026527c7a",
    "title": "Natalie Portman To Star In Rom-Com ‘Good Sex’ With Lena Dunham Writing \u0026 Directing; FilmNation \u0026 CAA Media Finance Launching For EFM",
    "link": "https://deadline.com/2025/02/natalie-portman-good-sex-lena-dunham-rom-com-movie-1236282855/",
    "description": "EXCLUSIVE: Oscar winner Natalie Portman is set to star in rom-com Good Sex, written and to be directed by Golden Globe winner Lena Dunham (Girls). CAA Media Finance represents domestic rights while Film Nation Entertainment is handling international and will introduce the buzzy project at next week’s EFM.  After Babygirl and Bridget Jones: Mad About […]",
    "author": "Andreas Wiseman",
    "published": "Sun, 09 Feb 2025 00:08:17 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/Good-Sex-Natalie-Portman.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "EFM",
      "Good Sex",
      "Lena Dunham",
      "Natalie Portman"
    ]
  },
  {
    "id": "6a228b0a-8ec5-4515-8b2c-caed08017481",
    "title": "Tom Cruise Says He Passed Out While Doing Stunts For ‘Mission: Impossible – The Final Reckoning’",
    "link": "https://deadline.com/2025/02/tom-cruise-mission-impossible-the-final-reckoning-passed-out-stunts-1236282844/",
    "description": "Leave it to Tom Cruise to commit to the bit. The veteran movie star and action hero, famously known for his dedication to leading his own stunts, told Empire in a recent interview previewing the forthcoming Mission: Impossible — The Final Reckoning that one action sequence in particular led him to pass out on a […]",
    "author": "Natalie Oganesyan",
    "published": "Sat, 08 Feb 2025 23:04:44 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-08-at-2.41.49 PM.png",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Christopher McQuarrie",
      "Mission Impossible",
      "Mission Impossible: The Final Reckoning",
      "Tom Cruise"
    ]
  },
  {
    "id": "f3a59a9d-9401-4290-a028-2d21d51d86fd",
    "title": "THE THINKING GAME Stream this Friday",
    "link": "https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME Read the full article on AICN It’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world. Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.   Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents.    During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.   For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat Finish the article on AICN",
    "author": "McEric",
    "published": "Thu, 06 Feb 2025 01:26:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "221e2e20-569b-4e51-acfc-86aa664e2112",
    "title": "Sundance Midnight Selection TOUCH ME",
    "link": "https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME Read the full article on AICN The Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads: Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world. TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too. I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 21 Jan 2025 04:16:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "385cc736-78a9-48ef-a7e9-4b68d1221dc5",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "3c6d5b4c-b6f3-4fd5-b16c-8cf4370d61da",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "1a83cf87-1f49-4d32-af1a-59948a818d92",
    "title": "Peacock Schedule February 10-16 2025: New TV Shows \u0026 Movies Being Added",
    "link": "https://www.comingsoon.net/guides/news/1916438-peacock-schedule-february-10-16-2025-tv-shows-movies",
    "description": "Peacock‘s new TV and movie releases for February 10-16 2025 include Bridget Jones: Mad About the Boy and a new episode of The Traitors Season 3. February 13 sees the release of a new episode of The Traitors Season 3. Alan Cumming hosts the latest season, reprising his hosting duties from previous chapters. This new […] The post Peacock Schedule February 10-16 2025: New TV Shows \u0026 Movies Being Added appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Abdul Azim Naushad",
    "published": "Sat, 08 Feb 2025 20:05:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/Peacock-Feb-16-Schedule.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "Peacock",
      "Release Schedule"
    ]
  },
  {
    "id": "354495e9-9f93-41bc-9d17-19d323be8fca",
    "title": "Who Is Jay Glazer’s Wife? Rosie Tenison’s Job \u0026 Relationship History",
    "link": "https://www.comingsoon.net/guides/news/1917372-jay-glazer-wife-rosie-tenison-job-relationship-history",
    "description": "Many fans are curious to discover more about the relationship history between Jay Glazer and his wife. Glazer is a popular sports reporter and television personality, who is best known for being the NFL insider for Fox’s pregame show FOX NFL Sunday. He has also hosted several other sports shows and has also guest starred […] The post Who Is Jay Glazer’s Wife? Rosie Tenison’s Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Namrata Ghosh",
    "published": "Sat, 08 Feb 2025 20:00:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/Jay-Glazer-wife-Rosie-Tenison.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Jay Glazer",
      "Pop Culture"
    ]
  },
  {
    "id": "040b630e-56ac-418c-acb3-89c09372b825",
    "title": "‘Severance’ Team Loved Taking the Fight Outside with Ep. 4: ‘You Realize Why People Worship the Sun’",
    "link": "https://www.indiewire.com/features/interviews/severance-ben-stiller-talks-going-outside-episode-204-1235092662/",
    "description": "Spoilers: Ben Stiller and the cast tell IndieWire about a pivotal Season 2 episode.",
    "author": "Proma Khosla",
    "published": "Sat, 08 Feb 2025 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Features",
      "Interviews | Celebrity Interviews \u0026 Insider Takes",
      "Apple TV+",
      "Interviews",
      "Severance",
      "TV"
    ]
  },
  {
    "id": "7a763e07-3942-466e-93a3-0d0c30fc1f01",
    "title": "A New Film Festival in Long Island Is Devoted to the Art of Music Documentaries",
    "link": "https://www.indiewire.com/news/festivals/music-documentary-film-festival-announced-limehof-1235093112/",
    "description": "The founders of the LIMEHOF Music Documentary Film Festival tell IndieWire why they think the genre was overdue for its own festival.",
    "author": "Christian Zilko",
    "published": "Sat, 08 Feb 2025 18:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Festivals",
      "News",
      "Film",
      "LIMEHOF Music Documentary Film Festival"
    ]
  },
  {
    "id": "ec20e33b-606c-4295-8ccc-8058c9a8a673",
    "title": "Official Trailer for 'Berlin ER' Series - Set in a Chaotic Berlin Hospital",
    "link": "https://www.firstshowing.net/2025/official-trailer-for-berlin-er-series-set-in-a-chaotic-berlin-hospital/",
    "description": "\"Under paid. Under staffed. Over worked. Welcome to the KRANK.\" 🇩🇪 Apple TV has unveiled an official trailer for a new hospital series called Berlin ER, set at an overcrowded hospital in the bustling German city of Berlin. The original title is Krank Berlin, since the word \"krank\" in German means sick (making the series name technically Sick Berlin in German). Dr. Parker, a medic, moves from Munich to Berlin after a personal crisis. She works in the chaotic ER inside Berlin's most overcrowded hospital, seeking a fresh start amidst the intense medical environment. But the increasingly merciless health system forces the strained team to put aside all their differences \u0026 save lives together. \"The waiting room is overcrowded. The staff is overtired. The equipment is outdated. And it's her first day at work.\" The series stars Haley Louise Jones as Dr. Parker, with Slavko Popadić, Şafak Şengül, Aram Tafreshian, Samirah Breuer, Bernhard Schütz, Peter Lohmeyer, and Benjamin Radjaipour. This looks hip and spunky and definitely not like any of the American hospital shows - much more wild and edgy. Just like Berlin! Jump into the \"sick\" below. Here's the official trailer (+ poster) for Apple TV's series Berlin ER, […]",
    "author": "Alex Billington",
    "published": "Fri, 07 Feb 2025 17:01:22 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/BerlinERSeriesPostermainbigTsr2.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "54be9b49-761f-4437-bbaa-20f463fa5f57",
    "title": "Watch: Filmmaker Sean Baker's Journey to Making 'Anora' Featurette",
    "link": "https://www.firstshowing.net/2025/watch-filmmaker-sean-bakers-journey-to-making-anora-featurette/",
    "description": "\"I think the biggest challenge is simply – sticking with it.\" Neon has revealed a lovely featurette celebrating filmmaker Sean Baker. We're into the final month of the awards season, ending with the Academy Awards on March 2, and Baker's film Anora has a grand total of six nominations. It's still my frontrunner for Best Picture - and maybe a few others. Ani, a young sex worker from Brooklyn, gets her chance at a Cinderella story when she meets and then impulsively marries the son of a Russian oligarch named Vanya (aka Ivan). Once the news reaches Russia, their little fairytale is threatened as the parents set out for New York to get the marriage annulled. So begins 24 hours of stressful NYC mayhem as hired goons pick her up and try to find Ivan. Mikey Madison stars as Ani as one of this year's big breakouts, with Mark Eydelshteyn, Yura Borisov, Karren Karagulian, \u0026 Vache Tovmasyan. Anora opened in US theaters last year. It's Baker's eighth feature film so far in his career (all 8 of them are worth watching), and he won the Palme d'Or at last year's Cannes Film Festival. Will he go all the way and win […]",
    "author": "Alex Billington",
    "published": "Fri, 07 Feb 2025 16:09:43 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/SeanbakerJourneyvideomainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Featurette",
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "6cf43939-0136-4148-bb38-886ac14debc1",
    "title": "Invincible Swordsman: A Pointless, Mediocre Remake of a Wuxia Classic",
    "link": "https://bleedingcool.com/movies/invincible-swordsman-a-pointless-mediocre-remake-of-a-wuxia-classic/",
    "description": "Invincible Swordsman pointlessly remakes Tsui Hark's classic Swordsman 2 which also erases a major part of the original movie that it a hit.",
    "author": "Adi Tantimedh",
    "published": "Sat, 08 Feb 2025 17:02:10 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "News",
      "action",
      "Brigitte Lin",
      "chinese film",
      "Invincible Swordsman",
      "Jin Yong",
      "smiling wander",
      "Swordsman 2",
      "the proud",
      "tsui hark",
      "Wong Jong",
      "wuxia"
    ]
  },
  {
    "id": "bc3541d1-eb69-43c5-ae49-39c99cc357cb",
    "title": "Mission: Impossible 8: Just Tom Cruise Casually Hanging Off A Plane",
    "link": "https://bleedingcool.com/movies/mission-impossible-8-just-tom-cruise-casually-hanging-off-a-plane/",
    "description": "Just some Mission: Impossible - The Final Reckoning behind-the-scenes footage of Tom Cruise hanging off a plane.",
    "author": "Kaitlyn Booth",
    "published": "Sat, 08 Feb 2025 16:48:06 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Paramount Pictures",
      "Mission: Impossible - The Final Reckoning",
      "mission: impossible 8",
      "tom cruise"
    ]
  }
]
