[
  {
    "id": "2421663a-a3cd-42ab-a3e5-060e9dd18c0d",
    "title": "Al Pacino Acted in Movies He Didn’t ‘Relate’ to at 70 Years Old Just for the Money: ‘I Was Broke. I Had $50 Million and Then I Had Nothing’",
    "link": "https://variety.com/2024/film/news/al-pacino-broke-act-bad-films-money-1236179115/",
    "description": "Al Pacino writes in his recently-published memoir “Sonny Boy” that he was forced to make dramatic career changes after losing all of his money due to a corrupt accountant who eventually served seven and a half years in prison for running a Ponzi scheme. The accountant mismanaged the Oscar winner’s funds, bringing Pacino’s savings from […]",
    "author": "Zack Sharf",
    "published": "Wed, 16 Oct 2024 00:16:09 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/GettyImages-2076364755-1.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Al Pacino"
    ]
  },
  {
    "id": "09b115a9-6217-4700-8453-0f717c1effe1",
    "title": "Ruby Cruz Signs With Gersh (EXCLUSIVE)",
    "link": "https://variety.com/2024/biz/news/ruby-cruz-gersh-agency-1236179319/",
    "description": "Gersh has signed actor Ruby Cruz for representation. Cruz is best known for her performance as the timid outsider Hazel in Emma Seligman’s acclaimed comedy “Bottoms,” also starring Rachel Sennott, Emmy winner Ayo Edebiri, Havana Rose Liu, Kaia Gerber and Nicholas Galitzine. The film follows two unpopular students who start a fight club as a […]",
    "author": "Katcy Stephan",
    "published": "Tue, 15 Oct 2024 23:20:42 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/ruby-e1729030372720.png",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Gersh",
      "Ruby Cruz"
    ]
  },
  {
    "id": "65c747fc-b37c-4496-a16f-aa68abafef69",
    "title": "Where You've Seen The Cast Of Georgie \u0026 Mandy's First Marriage Before",
    "link": "https://www.slashfilm.com/1689273/georgie-and-mandys-first-marriage-cast-previous-roles/",
    "description": "The Young Sheldon spinoff Georgie \u0026 Mandy's First Marriage boasts a cast of longtime industry greats and fresh faces. Here's where you've seen them before.",
    "author": "Nina Starner",
    "published": "Tue, 15 Oct 2024 22:08:20 +0000",
    "image": "https://www.slashfilm.com/img/gallery/where-youve-seen-the-cast-of-georgie-mandys-first-marriage-before/l-intro-1729029502.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Comedy Shows"
    ]
  },
  {
    "id": "e145649c-b30a-4410-8d86-96a756b3fcc0",
    "title": "Clint Eastwood \u0026 Sergio Leone Connected Through Two Words On The Dollars Trilogy",
    "link": "https://www.slashfilm.com/1687700/clint-eastwood-sergio-leone-dollars-trilogy-two-words-connection/",
    "description": "Sergio Leone and Clint Eastwood forever changed the Western with their Dollars trilogy despite having an extremely limited rapport.",
    "author": "Jeremy Smith",
    "published": "Tue, 15 Oct 2024 22:00:22 +0000",
    "image": "https://www.slashfilm.com/img/gallery/clint-eastwood-sergio-leone-connected-through-two-words-on-the-dollars-trilogy/l-intro-1728922453.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies"
    ]
  },
  {
    "id": "40e41461-3d80-4d08-89c5-f81338cb4a3b",
    "title": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE",
    "link": "https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE Read the full article on AICN Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing.  If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015). Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor Finish the article on AICN",
    "author": "staff",
    "published": "Sat, 05 Oct 2024 14:56:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "23837ff9-b1fc-4cce-8d1e-ac1e50abe711",
    "title": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!",
    "link": "https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024! Read the full article on AICN Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie.  It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out! Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff. Peter: Bless You.  Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that.  Stuart: Thank you.   Barbara: Why do this in a true crime format? What were you going for?  Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I Finish the article on AICN",
    "author": "Barbarella",
    "published": "Sat, 05 Oct 2024 02:02:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "2238c8c6-9cf6-4483-ac30-367d7bd49688",
    "title": "‘Caddo Lake’ Twists Mystery, Loss, and Emotion Into an Affecting Thriller",
    "link": "https://filmschoolrejects.com/caddo-lake-review/",
    "description": "Give this film your complete attention (phones off!), and you won't be disappointed.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 12:06:45 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Caddo Lake",
      "Dylan O'Brien"
    ]
  },
  {
    "id": "1c09058d-2ecb-4780-861b-08bd1b87d291",
    "title": "‘Terrifier 3’ Is More of Exactly What You Think It Is, For Better and Worse",
    "link": "https://filmschoolrejects.com/terrifier-3-review/",
    "description": "And it's also the bloodiest, goriest, gnarliest entry in the Christmas horror subgenre, yet.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 00:32:04 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Christmas horror",
      "Horror",
      "terrifier"
    ]
  },
  {
    "id": "34a32dab-11c6-485b-a1b7-acd6cd98c944",
    "title": "Who Is Paige DeSorbo’s Boyfriend? Craig Conover’s Job \u0026 Relationship History",
    "link": "https://www.comingsoon.net/guides/news/1864165-paige-desorbo-boyfriend-craig-conover-job-relationship-history",
    "description": "Paige DeSorbo has found love again and fans are eager to know all about her new boyfriend. The popular Summer House star is one of the most beloved cast members of the Bravo show. Naturally, her personal life became a point of interest for fans who are curious about her romantic relationship. So, here’s everything […] The post Who Is Paige DeSorbo’s Boyfriend? Craig Conover’s Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Namrata Ghosh",
    "published": "Wed, 16 Oct 2024 00:40:44 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-16-Oct-2024-06-05-AM-6052.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "FAQ",
      "FAQ Pop Culture",
      "Paige DeSorbo"
    ]
  },
  {
    "id": "0827b30a-1e6b-447a-ad8c-f54c0cc26d2b",
    "title": "PewDiePie \u0026 KSI Copyrighting Song Controversy Explained",
    "link": "https://www.comingsoon.net/guides/news/1863877-pewdiepie-ksi-song-thick-of-it-copyright-controversy-explained",
    "description": "Popular Youtuber Felix Kjellberg, popularly known as PewDiePie sparked a controversy by calling out KSI, AKA Olajide J.J. over copyright issues. He accused the latter of taking down his famous YouTube video and also reacted to his latest song, Thick of It. As a result, PewDiePie’s remarks over KSI have gone viral, making everyone curious […] The post PewDiePie \u0026 KSI Copyrighting Song Controversy Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Shazmeen Navrange",
    "published": "Tue, 15 Oct 2024 22:03:17 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-16-Oct-2024-03-20-AM-1292.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "FAQ",
      "FAQ Pop Culture",
      "KSI",
      "PewDiePie",
      "YouTube"
    ]
  },
  {
    "id": "bdacdd21-8b6d-4243-be1a-c6c0aa3bd62f",
    "title": "The Dolby Theater, Home of the Oscars, Is Now Owned by the Producer of ‘Battlefield Earth’",
    "link": "https://www.indiewire.com/news/business/oscars-venue-dolby-theater-sells-battlefield-earth-producer-1235057194/",
    "description": "The theater was bought by an investment group led by Elie Samaha, who also produced \"The Boondock Saints\" and owns the TCL Chinese Theater.",
    "author": "Brian Welk",
    "published": "Tue, 15 Oct 2024 22:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Business",
      "News",
      "Dolby Theatre",
      "Oscars"
    ]
  },
  {
    "id": "c0486482-cfca-4fc2-898d-418dc406aea9",
    "title": "Josh Gad Says Trey Parker and Matt Stone’s ‘Book of Mormon’ Was Originally Going to Be an Animated Film",
    "link": "https://www.indiewire.com/news/general-news/josh-gad-book-of-mormon-planned-as-animated-film-1235057116/",
    "description": "\"It was going to be their follow-up to 'Team America.'\"",
    "author": "Samantha Bergeson",
    "published": "Tue, 15 Oct 2024 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Book of Mormon",
      "Film",
      "Josh Gad",
      "Matt Stone",
      "Trey Parker"
    ]
  },
  {
    "id": "bcfb3e7f-0132-4d33-b4c5-239c12afcf6f",
    "title": "James McDougall in Brutal Wilderness Survival Film 'Whiteout' Trailer",
    "link": "https://www.firstshowing.net/2024/james-mcdougall-in-brutal-wilderness-survival-film-whiteout-trailer/",
    "description": "\"The wilderness is our prison now...\" Saban Films has revealed the official trailer for Whiteout, an intense survival thriller film from Canada. The film premiered under the original title Walking Supply instead, showing at one film festival in late 2023, now set for a November release this fall. That original title is a bit clunky and strange, though Whiteout is also too generic and doesn't tease anything about this story at all. This the thrilling survival story of three men who escape from a Russian labor camp and must overcome the treacherous wilderness \u0026 each other as their journey turns into a brutal fight for survival. Directed by Derek Barnes who states: \"As a stuntman turned filmmaker, Walking Supply is a dream come true. From dangling off cliffs to falling into frozen lakes, climbing up mountains and smashing trucks through gates – this is the type of high-octane, independent, venturous project that I’ve always wanted to tackle.\" The thriller Whiteout stars James McDougall, Douglas Nyback, \u0026 Joel Labelle as the three men chasing freedom, plus Ian Matthews as the angry ...",
    "author": "Alex Billington",
    "published": "Tue, 15 Oct 2024 21:11:49 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/WhiteoutFilmPostermainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "c69605d5-87a3-4530-8735-cec496d9d0c3",
    "title": "Florida Thriller 'The Man in the White Van' Trailer with Madison Wolfe",
    "link": "https://www.firstshowing.net/2024/terrifying-thriller-the-man-in-the-white-van-trailer-with-madison-wolfe/",
    "description": "\"Maybe somebody just went down the wrong driveway?\" Relativity Media has unveiled an official trailer for an indie thriller film called The Man in the White Van, based on a true story of a serial killer stalking people in Florida in the 1970s. Opening in theaters on Friday the 13th in December this year. The Man in the White Van (a PG-13 horror movie) delves into the eerie underbelly of a seemingly idyllic 1974 Florida town and follows the harrowing experience of young Annie Williams, a spirited girl whose carefree existence is turned upside down as she becomes stalked by an ominous man in a white van. Based on actual events of the serial killer Billy Mansfield Jr., this portrays a bone-chilling story of a young girl's unimaginable horrors and every parent’s worst nightmare. Starring Madison Wolfe as Annie, along with Brec Bassinger, Skai Jackson, Gavin Warren, Ali Larter, and Sean Astin. The whole point if this seems to be that, oh back then, they didn't know there were creepos in white vans prowling on kids. Uh huh, sure... whatever ...",
    "author": "Alex Billington",
    "published": "Tue, 15 Oct 2024 19:52:43 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/ManinWhitevanPosterbigmainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Horror",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "814bc57c-cedf-4771-9bf2-12e5f527cb11",
    "title": "Watchmen Chapter II Key Art Released; Official Trailer This Wednesday",
    "link": "https://bleedingcool.com/tv/watchmen-chapter-ii-key-art-released-official-trailer-this-wednesday/",
    "description": "The official trailer for Warner Bros. Entertainment's animated adaptation of DC Comics' Watchmen Chapter II is set to arrive on Wednesday.",
    "author": "Ray Flook",
    "published": "Tue, 15 Oct 2024 17:07:09 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "DVD/Blu-ray",
      "Movies",
      "TV",
      "Alan Moore",
      "warner bros entertainment",
      "Watchmen"
    ]
  },
  {
    "id": "53147909-603a-4450-842a-fe9d18b23bae",
    "title": "Superman: James Gunn Has Response for \"Krypto-splainers\" Out There",
    "link": "https://bleedingcool.com/tv/superman-james-gunn-has-response-for-krypto-splainers-out-there/",
    "description": "If you're thinking about coming at Superman writer/director James Gunn over how Krypto looks, he's already shut down the \"Krypto-splaining.\"",
    "author": "Ray Flook",
    "published": "Tue, 15 Oct 2024 16:38:08 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "TV",
      "dc studios",
      "krypto",
      "superman"
    ]
  },
  {
    "id": "dd7be933-46e7-4b07-8227-d796fa405e48",
    "title": "Modern Families: How 20th Television Landed No. 1 Hits Outside Of Disney With Netflix’s ‘Nobody Wants This’ \u0026 CBS’ ‘Tracker’",
    "link": "https://deadline.com/2024/10/nobody-wants-this-tracker-disney-hits-netflix-cbs-20th-television-1236115869/",
    "description": "In 2008, a comedy about the behind-the-scenes of the TV industry, Back To You, co-created/executive produced by Steve Levitan, was canceled by Fox, the broadcast network then-aligned with Levitan’s longtime studio home, 20th Television. Shortly thereafter, another comedy co-created/executive produced by Levitan, Modern Family, was sold to a rival network, ABC, where it went to […]",
    "author": "Nellie Andreeva",
    "published": "Wed, 16 Oct 2024 00:25:25 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/10/Nobody-Wants-This-Tracker.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "20th Television",
      "CBS",
      "Netflix",
      "Nobody Wants This",
      "Tracker"
    ]
  },
  {
    "id": "2d965cd2-f6fe-4701-b16e-4f9f18407b28",
    "title": "Simu Liu Asks ‘Dragons’ Den’ Fans To Stop “Death Threats \u0026 Harassment” Against Boba Company Amid Backlash",
    "link": "https://deadline.com/2024/10/simu-liu-dragons-den-fans-stop-death-threats-harassment-boba-company-backlash-1236117078/",
    "description": "Simu Liu was a guest dragon on CBC’s Dragons’ Den, the Canadian version of Shark Tank. After a clip of Liu criticizing a boba company for cultural appropriation went viral, some fans have taken it upon themselves to send death threats, something that the Shang-Chi and the Legend of the Ten Rings star is condemning. […]",
    "author": "Armando Tinoco",
    "published": "Wed, 16 Oct 2024 00:08:05 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/10/simu-liu-dragons-den-boba-tea.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "CBC",
      "Dragons Den",
      "Simu Liu"
    ]
  }
]
