[
  {
    "id": "44111023-e29c-4d54-9280-5d2eaee190be",
    "title": "Gene Roddenberry's Four Starship Design Rules For Star Trek, Explained",
    "link": "https://www.slashfilm.com/1727900/gene-roddenberry-star-trek-starship-design-rules-explained/",
    "description": "Star Trek creator Gene Roddenberry and the artists who developed the Enterprise had clear rules for how it and other starships should be designed.",
    "author": "Witney Seibold",
    "published": "Tue, 10 Dec 2024 01:00:04 +0000",
    "image": "https://www.slashfilm.com/img/gallery/gene-roddenberrys-four-starship-design-rules-for-star-trek-explained/l-intro-1733243755.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Science Fiction Shows",
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "c31236b7-e213-4d3f-9936-3ca1d5382460",
    "title": "Why Geena Davis Disappeared From Hollywood",
    "link": "https://www.slashfilm.com/1728018/why-geena-davis-disappeared-hollywood/",
    "description": "There were several factors that led to Geena Davis stepping back from Hollywood, although her offscreen life is just as interesting as her film work.",
    "author": "Danielle Ryan",
    "published": "Mon, 09 Dec 2024 23:45:49 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-geena-davis-disappeared-from-hollywood/l-intro-1733247445.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movies"
    ]
  },
  {
    "id": "216ce5b3-2102-4d25-b3ce-b60d9a239259",
    "title": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!",
    "link": "https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "Last-Modified: Fri, 06 Dec 2024 12:45:00 GMT Content-Type: application/rss+xml; charset=utf-8 Ain't It Cool News Feedhttp://www.aintitcool.com/The best in movie, TV, DVD and comic book news.en-usFri, 06 Dec 2024 12:45:00 +0000Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsLast-Modified: Fri, 06 Dec 2024 12:45:00 GMT Content-Type: application/rss+xml; charset=utf-8 Ain't It Cool News Feedhttp://www.aintitcool.com/The best in movie, TV, DVD and comic book news.en-usFri, 06 Dec 2024 12:45:00 +0000Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Dives into Conversation with FREEDIVER Director Michael John Warren!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death. \u003cbr\u003e Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both!\u003cbr\u003e Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 06 Dec 2024 12:45:00 +000083598Tim Sheridan - Creator Interviewhttps://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comics\u003cp\u003eTim Sheridan chats about Alan Scott: Green Lantern, Superman: Man of Tomorrow, Batman: The Long Halloween, and adapting legacy stories to small and large screens.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=comics\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eWhen I got into this racket over six years ago, I did so as a fan. In fact, it was a passing text exchange with a friend about the movie A QUIET PLACE that ended with “Hey, do you want to write about movies for a website?” Flash forward, here I am, having interviewed over a hundred creatives in my time with this site and others. Typically, I’ll get an email from a PR firm asking if I want to screen a film and speak with attached talent or read a book and speak with the author. I rarely say no as I firmly believe that everyone is worth talking to and every person you come in contact with can teach you something that you might not learn in your own sphere of social contacts or experiences.\u003cbr\u003e  \u003cbr\u003e This interview is different. This subject I hunted down. I saw that he was going to be at New York Comic Con this year signing books in Artist Alley, and I’d already interacted with him briefly on Twitter (back when it was Twitter) so I felt I could swing over and say hello. I did, and of course he had some fans in front of him when I arrived so I decided to hang back and let them have their moment. Watching him interact with these fans confirmed everything I believed about this writer - he couldn’t be any nicer, any more accommodating, or any more grateful for the people who celebrate his art.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=comics\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 30 Nov 2024 08:54:00 +000083597Jenni \"JWoww\" Farley on Writing/Directing DEVONhttps://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with reality star Jenni \u0026quot;JWoww\u0026quot; Farley on her feature-film debut as writer/director of the found-footage horror film DEVON.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eFound footage horror. Do you love it? Do you hate it? Do you think it is its own genre or do you lump it in with its overarching tone - slasher, supernatural, monster, etc. Love it or hate it, the convention is here to stay, as it offers a realistic, relatable approach to horror that blurs the lines between reality, film, empathy, and voyeurism.\u003cbr\u003e  \u003cbr\u003e So, when I got an email asking if I wanted to screen the feature DEVON, written and directed by Jenni “JWoww” Farley, I said “of course I do!” My wife is a fan of “Jersey Shore” and has been since day one, so I mostly did it for her, but I was also very curious what the singular star would bring to the horror pantheon. The logline read:\u003cbr\u003e  \u003cbr\u003e Devon's parents never stopped searching for answers after her disappearance from a notorious asylum. Years after the incident, a mysterious website draws five adventurers to the abandoned asylum where she was last seen. Armed with cameras, they plunge into the darkness, unaware they’re filming their own descent into horror—never meant to return.\u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e I got the chance to chat with writer/director/producer Jenni “JWoww” Farley about jumping into a feature-length film, the serendipitous location, and her crew. \u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e Eric McClanahan: Hey, Jenni! How are you?\u003cbr\u003e  \u003cbr\u003e Jenni “JWoww” Farley: Good. Nervous. \u003cbr\u003e  \u003cbr\u003e EM: Nervous? Why are you nervous?\u003cbr\u003e  \u003cbr\u003e JJF: I feel like this is [me] kind of starting my career over. It’s a different world, a different element. I am a superfan of horror films; I have been since I\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 15 Nov 2024 01:07:00 +000083596HIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmakinghttps://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eHIPPO\u0026#39;S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmaking\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here to talk about dark comedy Hippo, or more accurately to share the conversation I had with Hippo’s director and writer Mark Rapaport. Genuinely funny, this incredible film has the potential to achieve cult status, so long as people take a chance on this black-and-white gem and actually see it. I recommend that they do. Hippo stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts as the narrator. It tells the story of two exceptionally different teens being raised by their mother in a somewhat isolated existence. At times, it reminds me of Yorgos Lanthimos’ Dogtooth, in the way that the children in Hippo are sheltered, while not in the same extreme way they were in the Greek film, both films make strong points about the detriment of isolation. The two would make a great double-feature, but if you want to jump on this one first, Hippo will be in select theaters November 8. \u003cbr\u003e \u003cbr\u003e At any rate, after a night of minimal sleep due to staying out late at the Pink concert, I caught up with Mark Rapaport, and we had a fun chat about the movie. Check it out!\u003cbr\u003e Barbara: Why go black and white with this? \u003cbr\u003e Mark: I've always loved classic movies, but I never thought I would make a movie in black and white until my cinematographer started taking photos of black and white, and I was like, “These are so cool and good, why don't more people shoot in black and white? Maybe we should do something like that.” He was very into that. When\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 08 Nov 2024 15:59:00 +000083595Spooky Picks for Fright Night Flickshttps://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003e‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.\u003cbr\u003e  \u003cbr\u003e DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:\u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.\u003cbr\u003e  \u003cbr\u003e I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles.\u003cbr\u003e \u003cbr\u003e Carrie-Anne\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 01 Nov 2024 00:45:00 +000083594Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEEhttps://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eSnake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eSnake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing. \u003cbr\u003e \u003cbr\u003e If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015).\u003cbr\u003e Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e staffSat, 05 Oct 2024 14:56:00 +000083593STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eSTRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie. \u003cbr\u003e It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out!\u003cbr\u003e \u003cbr\u003e Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff.\u003cbr\u003e Peter: Bless You. \u003cbr\u003e Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that. \u003cbr\u003e Stuart: Thank you.  \u003cbr\u003e Barbara: Why do this in a true crime format? What were you going for? \u003cbr\u003e Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaSat, 05 Oct 2024 02:02:00 +000083592Kevin Smith Talks THE 4:30 MOVIEhttps://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eKevin Smith Talks to McEric about THE 4:30 MOVIE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eKevin Smith’s THE 4:30 MOVIE is coming home today, available on digital through all major retailers. The film tells the story of young Brian David, an avatar of Kevin Smith, and his adventures at the local Atlantic Cinema where he watches films with his friends Burny and Belly in 1986. It’s a departure from the View Askewniverse that Smith started thirty years ago, which admittedly stretched to its possible breaking point as the characters within encountered rebel angels, demons, Hollywood, jewel thieves, terrorists, and a monkey. THE 4:30 MOVIE offers a much more grounded story of a simpler time when the cinema and video store ruled the weekend, and the lives on the silver screen either mirrored our own or showed us worlds we could only imagine. \u003cbr\u003e \u003cbr\u003e I had the opportunity to chat with Kevin Smith yesterday in support of the film’s digital release and it went exactly as I thought it would: we were given six minutes, I asked one question, and he talked for eight. What I got in that response, though, was a good deal of wisdom about what the filmmaker attempts when he puts his memories to screen for our amusement, how he’s remained relevant, and where his ideas originate. Prior to the interview’s start, my cat Bennie decided she needed to be part of it all, as well, and leapt onto the seat behind me. \u003cbr\u003e  \u003cbr\u003e Eric McClanahan - Hi Kevin!\u003cbr\u003e  \u003cbr\u003e Kevin Smith - Hello, Eric! How are you?\u003cbr\u003e  \u003cbr\u003e EM - I’m well, thank you!\u003cbr\u003e  \u003cbr\u003e KS - Look at that cat!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 01 Oct 2024 08:37:00 +000083591Interview with the Cast of TERRIFIER 3https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with David Howard Thornton (Art the Clown) and Lauren Lavera (Sienna Shaw) ahead of Damien Leone\u0026#39;s TERRIFIER 3\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eTime to crawl out from under your bridges, ghouls, because Damien Leone’s Art the Clown is back in TERRIFIER 3, hitting theaters October 11th. This time the terror is set against the backdrop of Christmas, with Art (David Howard Thornton) returning to hunt down Sienna (Lauren Lavera) after she cut his head off in the last installment. The film picks up right at the end of Part 2 before allowing Art to take a five year siesta while Sienna spends time in facilities piecing her psyche back together. Young Jonathan Shaw (Elliott Fullam) isn’t so young anymore, attending college near his Aunt and Uncle, Jessica and Mark (Margaret Anne Florence and Alex Ross), with whom Sienna stays after being checked out of the latest facility. \u003cbr\u003e \u003cbr\u003e The film opens with Art dispatching a family while dressed in a Santa Claus suit, letting the audience know right away that no one is safe. The entire film plays out as a supercut of gory kills and dark humor, with occasional moments of genuine world-building that allows the supporting cast to really stretch their acting muscles. Plotwise, the film seems to be more focused on showcasing creative kills than telling a cohesive story, and the end seems somewhat rushed, as though the filmmakers had almost forgotten that they had to end the thing. \u003cbr\u003e  \u003cbr\u003e What a TERRIFIER fan is looking for, however, is exactly what they’ll find in 3: inventive kills, stomach-turning sound design, laughs that’ll make you question your own morality, and surprises. When I got\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 01 Oct 2024 01:03:00 +000083590Barbarella Talks AI With SUBSERVIENCE Director S.K. Dalehttps://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Talks AI With SUBSERVIENCE Director S.K. Dale\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHi friends, Barbarella here. Sci-fi film Subservience, starring Megan Fox, Michele Morrone  (his name’s Italian so the “ch” is pronounced like a “k”), Madeline Zima, and Matilda Firth, just came out on Demand and Digital, so let’s talk about AI. Do you think artificial intelligence will bring about major medical advancements, or do you envision more of a Terminator situation evolving? I tend to think it’s not the AI itself but whoever’s behind it that should be on whom we focus our concern. When it comes to cinema, filmmakers always hold technology responsible, because let’s face it, that makes for a more entertaining movie. I would argue Will Honley and April Maguire’s screenplay puts at least some of the onus on the humans. Maybe don’t say certain things to a Sim that’s constantly evolving and learning; that’s all I’m saying. If it weren’t for one comment made to Alice (Megan Fox), the attractive Sim acquired to help out around the house, perhaps a lot of mayhem could have been avoided. \u003cbr\u003e  \u003cbr\u003e I appreciate that the conflict in Subservience primarily occurs within the family unit, as this makes it more believable to me. Favoring older technologies, Nick (Michele Morrone) isn’t the biggest fan of artificial intelligence, but when he and his sick wife (Madeline Zima) can’t keep up with managing the household and children, he caves and gets Alice, the best new Sim on the market, to help out, and you know that’s not going to work out quite how everyone expects, well, at least how everyone\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaSat, 14 Sep 2024 13:57:00 +000083589THE 4:30 MOVIE's Cast Speaks About Kevin Smith's New Comedyhttps://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with the cast of Kevin Smith\u0026#39;s THE 4:30 MOVIE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eWriter/Director Kevin Smith began his View Askewniverse in 1994 with his breakout hit CLERKS. The film tells the story of a couple of slackers working dead-end jobs in New Jersey in the 1990s and the conversations and misadventures they dabble in along the way. The film paved the way for countless stories, and so far nine films by Smith have rounded out its canon, along with several animated adventures and more in the pages of comic books. Before Dante and Randall ever sat around the Quik Stop and chatted about JAWS, STAR WARS, or even NAVY SEALS, young Kevin Smith was a New Jersey native soaking up inspiration on the silver screen at his local movie theater, the Atlantic Highlands Cinema. Flash forward to today and he owns that theater, rebranded as the Smodcastle, where he showcases new releases, repertory classics, film festivals, and even special screenings of “Movies With Kev,” where he screens a classic and participates in a Q\u0026A following the screening.\u003cbr\u003e  \u003cbr\u003e Finally the formative experiences of young Kev are getting their own film treatment, with Kevin Smith’s newest release, THE 4:30 MOVIE, premiering tomorrow in cinemas around the country. The film, not set within the View Askewniverse, tells the story of a young man named Brian David, a not-even-thinly-veiled stand-in for Kevin Smith, played by Austin Zajur, who one day in the late spring of 1986 asks his crush Melody Barnegat (Siena Agudong) to meet him at the movies. This is much to the chagrin of his two\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 13 Sep 2024 00:11:00 +000083588Shiloh Fernandez Discusses Working With Nadine Crocker on CONTINUEhttps://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eShiloh Fernandez Discusses Working With Nadine Crocker on CONTINUE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here. It feels a little wrong that I have a ton of pep today while I’m covering a movie about the very serious topic of suicide, but here we are. Continue makes a personal and powerful statement from writer, director, and star Nadine Crocker, who survived her own suicide attempt in her twenties. In Theaters, On Demand and Digital September 6, 2024, Continue escorts viewers through Dean’s struggles as she experience life after a suicide attempt. Beautifully shot, the film also includes an unexpected love story, albeit, I’m not sure I believe that two people would be that flirtatious while discussing their past traumas, but just because I wouldn’t flirt while sharing horrific things from the past doesn’t mean it’s not possible that some people might. Anyway, before I veer too far off-topic, the movie stars an actor of whom I’ve been a fan since first seeing him about fifteen years ago in an independent film at Fantastic Fest called Deadgirl, and I’m grateful to have the opportunity to chat with that actor, Shiloh Fernandez, about the film. \u003cbr\u003e Right out of the gate, I share my love of Deadgirl and Shiloh’s performance in it. Check out his response and the rest of our conversation! \u003cbr\u003e Shiloh: That is so sweet. It’s still one of my favorite movies. I loved doing a small movie like that, and all these years later, to do Continue, I think it was maybe the 2nd smallest. It is really neat having these small movies make an impact. \u003cbr\u003e Barbara: I don’t know what it says about me, but Deadgirl was one\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 06 Sep 2024 11:06:00 +000083586Barbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends. Barbarella here. A new Western, Place of Bones, rides into theaters and on digital Friday, August 23, 2024. Unlike the Westerns of yesteryear, this one is female-led, with Audrey Cummings in the director’s chair and Heather Graham shining in the lead role as a mother who, along with her daughter (Brielle Robillard), must fight for survival when a gang of outlaws, led by Tom Hopper, arrives in the area.   \u003cbr\u003e I’ve been a Tom Hopper fan ever since he won me over with his enticing portrayal of Billy Bones in Black Sails. He earns additional adoration from me through the way he injects subtle humor as villain Bear John in this film. I find myself laughing at moments that I’m fairly certain weren’t intended to be funny, yet he fires wit like a true sharp-shooter with a faint exasperation about him that’s just funny. However, he’s not the only one who offers something more than just delivering what’s written on the page. Corin Nemec, Brielle Robillard, and Heather Graham also add an extra something that gives insight into their characters and adds a bit of snark to the exchanges.\u003cbr\u003e  \u003cbr\u003e I had the opportunity to speak with Audrey Cummings, and I sometimes like to break the ice with a question about Muppet-casting on remakes. While she placed Kermit, Miss Piggy and Fozzy Bear in the lead roles of Calhoun (Corin Nemec), Pandora (Heather Graham), and Hester (Brielle Robillard), I took a completely different approach, thinking it would be fun to have Statler and\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaThu, 22 Aug 2024 23:29:00 +000083585#ALL MY FRIENDS ARE DEADhttps://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003e#ALL MY FRIENDS ARE DEAD director Marcus Dunstan and star Jade Pettyjohn talk to McEric about the new slasher comedy!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eThere was every manner of film at this year’s Tribeca Festival, and I managed to take in thirteen features, four shorts, and an episodic premiere by the time the whole thing wrapped this past June. One of the highlights was the opportunity to interview two of the lead talents behind the new slasher ALL MY FRIENDS ARE DEAD: director Marcus Dunstan and star Jade Pettyjohn. We met at the Roxy Hotel bar and restaurant, a favorite meetup spot of mine, on a Saturday morning. I was, admittedly, running late, but they were so patient and gracious with me and I always appreciate that from stars and filmmakers, whose lives are probably ten times as cluttered as mine. \u003cbr\u003e Its logline says of the film: “A group of college friends rents an airbnb for the biggest music festival of the year. However, their weekend of partying soon takes a deadly turn as a masked killer murders them one by one according to their sins.”\u003cbr\u003e \u003cbr\u003e The film, though familiar in synopsis, finds a way to inject new life into a tired formula. The design of the killer is unique, the kills are creative, the victims are fighters rather than training dummies, for the most part, and the twist(s) are welcome.\u003cbr\u003e  \u003cbr\u003e Marcus Dunstan is perpetually smiling, speaking in a small voice from a large, gentle face. Jade Pettyjohn is excitable, clearly enjoying being at the festival and also talking about this joyous diversion in her filmography. We couldn’t help but jump right in. Unfortunately, I recorded this\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 17 Aug 2024 00:12:00 +000083584Check Out This Trailer for Psychological Thriller SLINGSHOT!!https://www.aintitcool.com/slingshottrailer-83583/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eCheck Out This Trailer for Psychological Thriller SLINGSHOT!!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/slingshottrailer-83583/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends, Barbarella here. It seems like ages since we’ve had a really cool psychological thriller that takes place in space, but it appears that Slingshot may fill that void. When a trio of elite astronauts set to undertake a risky slingshot maneuver, potential issues with both the ship and a crew member add to the dangers of the mission. Starring Casey Affleck, Laurence Fishburne, Emily Beecham, Tomer Capone, and David Morrissey, the film hits theaters nationwide August 30th.\u003cbr\u003e Check out the trailer!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/slingshottrailer-83583/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaTue, 30 Jul 2024 21:00:00 +000083583SDCC Robert Downey Jr returns to MCU!https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eRobert Downey Jr is back but not as we know it!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eIn perhaps the most shocking story to come out of this year's otherwise short-on news panel from Marvel Studios, Robert Downey Jr is returning to the MCU. It has just been announced that he has been cast as none other than the great green dictator Doctor Doom. Taking to the stage Downey Jr had this to say:\u003cbr\u003e \"New mask, same task...What can I tell ya, I like playing complicated characters.\"\u003cbr\u003e Whether or not he’ll be the genuine Earth 616 version or the Doom from the alternate Universe Fantastic Four: First Steps seems to be set in remains to be seen. Either way, welcome back to the fold RDJ.\u003cbr\u003e The panel revealed that Downey Jr’s Doom would make his presence known in the freshly titled Avengers: Doomsday which has a release date of May 2026 with Avengers: Secret Wars following in May 2027.\u003cbr\u003e  Let us know what you think of this curveball in the comments down below!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e HouseOfMacleodSun, 28 Jul 2024 08:58:00 +000083582SDCC Max Panel unveils new Penguin Trailer!https://www.aintitcool.com/sdcc-max-panel-unveils-new-penguin-trailer-83581/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eThe Max panel from HBO has just unveiled the second trailer for its forthcoming original limited series!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-max-panel-unveils-new-penguin-trailer-83581/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003e(Photo: Max)\u003cbr\u003e  Tear down the empire from the inside out.\u003cbr\u003e The Max panel from HBO has just unveiled the second trailer for its forthcoming original limited series The Penguin starring Academy Award Nominee Colin Farrell, Cristin Milioti, Rhenzi Feliz and Clancy Brown.\u003cbr\u003e Set directly after the events of Matt Reeves’ The Batman, the series follows crime boss Oswald Cobblepot as he makes a bid to control Gotham cities underworld after the death of Carmine Falcone.\u003cbr\u003e Created by showrunner Lauren LeFranc and Directed by Craig Zobel, The Penguin premiers on September 19 exclusively on Max.\u003cbr\u003e I personally still can't get my head around Farrell’s insane transformation for this role. When you see him introduce the trailer, it makes that stunning metamorphosis all the more unreal.\u003cbr\u003e Check out the trailer below and let us know what you think in the comments below.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-max-panel-unveils-new-penguin-trailer-83581/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e HouseOfMacleodSun, 28 Jul 2024 07:13:00 +000083581SDCC Star Trek Panel reveals first look at Strange New Worlds and More!https://www.aintitcool.com/idcc-star-trek-reveals-first-look-83580/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eAll the action from the Star Trek panel at San Diego Comic-Con!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/idcc-star-trek-reveals-first-look-83580/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eThe Star Trek panel at SDCC just hit and boy did Paramount + bring the good stuff!\u003cbr\u003e Not only did they give us our first look at Strange New Worlds Season 3 and Lower Decks Season 5 but we were also treated to our first look at section 31, a Paramount+ Original Movie, starring Academy Award® winner Michelle Yeoh as Emperor Philippa Georgiou who joins a secret division of Starfleet tasked with some of the shadier work that comes with protecting the United Federation of Planets.\u003cbr\u003e Also revealed was a little bit of casting news regarding the upcoming Star Trek: Starfleet Academy series, which is bringing back Star Trek: Discovery alum Tig Notaro, Oded Fehr and Mary Wiseman and get this, Robert Picardo of Voyager and Prodigy!\u003cbr\u003e It would seem that the next few years will be a great time to be a Star Trek fan and I can't wait for more.\u003cbr\u003e Let us know what you think of the footage in the comments section below and as always, Live Long and Prosper…\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/idcc-star-trek-reveals-first-look-83580/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e HouseOfMacleodSun, 28 Jul 2024 04:43:00 +000083580SDCC Doctor Who Christmas special clip!!https://www.aintitcool.com/sdcc-doctor-who-christmas-special-clip-83579/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eNicola Coughlan introduces the first look at the new Doctor Who Christmas Special!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-doctor-who-christmas-special-clip-83579/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHello Doctor Who fans, House of Macleod here with some very special news!\u003cbr\u003e SDCC 2024 has well and truly kicked off and this year promises to be full of all the geeky joy that keeps us going through these long summer months and Honey, are we here for fun!\u003cbr\u003e Speaking of Joy, Doctor Who’s YouTube channel just released a first look at the 2024 Christmas special, complete with an introduction from Nicola Coughlan (Bridgerton, Derry Girls, Barbie).\u003cbr\u003e This year's special is called “Joy to the World” and is written by Steven Moffat and happens to be the 50th script he’s written for the series in total.\u003cbr\u003e Doctor Who is available now to stream on BBC iPlayer in the UK and Disney+ in the rest of the world.\u003cbr\u003e Check out the clip straight from Hall H below and as usual, let us know what you think in the comments section!\u003cbr\u003e Allons-y!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-doctor-who-christmas-special-clip-83579/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e HouseOfMacleodSat, 27 Jul 2024 02:57:00 +000083579Amazon MGM Revives the Legendary Studio United Artists!https://www.aintitcool.com/amazon-mgm-revives-the-legendary-studio-united-art-83578/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eAmazon MGM Revives the Legendary Studio United Artists!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/amazon-mgm-revives-the-legendary-studio-united-art-83578/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eIn some exciting news circulating the internet, it would seem that the ex-head of film at Netflix Scott Stuber is reviving the once legendary United Artists label through new partners Amazon MGM Studios.\u003cbr\u003e Founded in 1919 by the likes of Charlie Chaplin, Mary Pickforth, D.W.Griffith and famed actor and filmmaker Douglas Fairbanks, United Artists began as a studio that would allow artists to control their own careers and artistic vision instead of being controlled by Hollywood moneymen.\u003cbr\u003e After decades of success, Metro Goldwyn Mayer bought the company over in 1981 for an unheard-of 350 million dollars and continued to release movies under the brand MGM/UA through the rest of the 80s, 90s and 2000s. United Artists are responsible for releasing some of the most classic movies of all time including The Mark of Zorro (1920), D.W.Griffith’s final film The Struggle (1931), The Great Dictator (1941), Alexander the Great (1956), Robert Mitchum’s Thunder Road (1958), The Magnificent Seven (1960), Dr. No (1963), Chitty Chitty Bang Bang (1968), Rocky (1976), Annie Hall (1977), Raging Bull (1980) and To Live and Die in L.A. (1985) to name but a few. \u003cbr\u003e Jennifer Salke (Head of Amazon MGM Studios) had this to say about the resurrection:\u003cbr\u003e  \u003cbr\u003e “With his proven track record of delivering global hits and an eye towards theatrical fare, Scott’s expertise and vision align perfectly with our film strategy. We are so proud to welcome him on the relaunch of the legendary UA brand, as we work to leverage existing and new IP into big, broad films\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/amazon-mgm-revives-the-legendary-studio-united-art-83578/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e HouseOfMacleodSat, 27 Jul 2024 01:22:00 +000083578Fanhome Launches The Legends of Batman Collectionhttps://www.aintitcool.com/fanhome-legends-of-batman-collection-83577/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comics\u003cp\u003eFanhome, a subscription-based models and collections service, launches a Batman collection for the ages.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/fanhome-legends-of-batman-collection-83577/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=comics\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHello all!\u003cbr\u003e  \u003cbr\u003e So, if you're like me, you love Batman. Who doesn't? However, when it comes down to reading his myriad adventures, where should one start? \u003cbr\u003e \u003cbr\u003e Batman has been a hero in pages and on screens for over 85 years, so it's hard to jump into his exploits without a guiding hand to navigate the most important formative stories. To this end Fanhome, a subscription-based model and collectible service, has launched a new collection called The Legends of Batman Graphic Novel Collection. From Year Zero to Year 100, this collection promises to tell the most definitive stories of the Caped Crusader in beautifully reproduced glossy hardcovers, each with bonus content such as variant covers, concept art, and creator notes.\u003cbr\u003e  \u003cbr\u003e \"From the moment Bruce Wayne becomes The Caped Crusader to his final days in the future, this collection brings together essential Batman tales in a book series that belongs on every bookshelf.\"\u003cbr\u003e  \u003cbr\u003e New volumes arrive monthly, and the series is MASSIVE. From the collected spines one can see that we'll witness the Joker's origin, the Death in the Family, the Breaking of the Bat, and the formation and expansion of the Bat Family. This looks to be an amazing collection for fans of the Bat new and established, young and old. \u003cbr\u003e  \u003cbr\u003e To find out how to order, check out https://www.fanhome.com/us/movie-series/legends-batman-graphic-novels\u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e Check it out and stay tuned for more info!\u003cbr\u003e -McEric, aka Eric McClanahan-\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/fanhome-legends-of-batman-collection-83577/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=comics\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 20 Jul 2024 18:02:00 +000083577Exclusive Clip from THE MANDELA EFFECT PHENOMENON!!https://www.aintitcool.com/mandelaeffectclip2024-83576/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eExclusive Clip from THE MANDELA EFFECT PHENOMENON!!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/mandelaeffectclip2024-83576/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends, Barbarella here. We have an exclusive clip from The Mandela Effect Phenomenon, directed by Robert Kiviat. The film explores the claims that movies, TV show titles, celebrities’ names, logos and brands are not what they once were. Conspiracy theorists may jump on the notion that a supernatural force is editing history. \u003cbr\u003e Check out this clip from The Mandela Effect Phenomenon. The documentary is available now on digital!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/mandelaeffectclip2024-83576/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 12 Jul 2024 16:09:00 +000083576Shane Dax Taylor Talks MURDER COMPANYhttps://www.aintitcool.com/shanedaxtaylorinterview2024murdercompany-83575/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eShane Dax Taylor Talks MURDER COMPANY\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/shanedaxtaylorinterview2024murdercompany-83575/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends, Barbarella here. I’ve had quite a couple months, and I wish I could say that I was gallivanting around the globe, but not this time. I’ve been sick a good chunk of it. In fact, I had quite a fever when I screened Murder Company, written by Jesse Mittelstadt and directed by Shane Dax Taylor. I don’t know that it would be fair to the filmmakers to review the film, given that I was feeling so awful while watching it that I don’t think my thoughts would necessarily be a true reflection of how the movie was. I will make a few observations, though. \u003cbr\u003e \u003cbr\u003e First of all, Kelsey Grammer was my favorite thing about Murder Company, which is currently On Digital and On Demand, and I wanted him to have far more screen time. I love a serious Kelsey Grammer, and he's incredibly serious in this. Second, while there was far less graphic violence and gore than I would have expected from a war movie made in this day and age, the filmmakers seemed to compensate for that with the amount of people flying around, proving yet again that stunt men are insane. “Yeah, you can hurl me into that tree. Sure.” Finally, could we please stop having people engage in casual conversations while walking through enemy-occupied territories? I understand that it seems a good way to develop characters, but it drives me crazy every time anyone has a conversation at a normal volume as if they’re just strolling through the\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/shanedaxtaylorinterview2024murdercompany-83575/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 12 Jul 2024 01:44:00 +000083575It May Only be July, but Here's a Trailer for THE BEST CHRISTMAS PAGEANT EVER!https://www.aintitcool.com/bestchristmaspageantevertrailer2024-83574/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eIt May Only be July, but Here\u0026#39;s a Trailer for THE BEST CHRISTMAS PAGEANT EVER!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/bestchristmaspageantevertrailer2024-83574/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends, Barbarella here. I know it’s way too early to start thinking about Christmas, but we have a trailer to share with you for a Christmas movie! Please forgive us. The Best Christmas Pageant Ever comes to theaters November 8. \u003cbr\u003e Based on Barbara Robinson’s beloved book, the story centers on the Herdmans as they take over their local church pageant. The worst kids in the community participating in a church activity; what could go wrong? It’s hard to say from the trailer if this movie, starring Judy Greer, Pete Holmes, Molly Belle Wright, and Lauren Graham, is going to be just another sappy Christmas story or something memorable to add to one's annual holiday movie rotation. I guess we’ll find out soon enough.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/bestchristmaspageantevertrailer2024-83574/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaMon, 01 Jul 2024 22:46:00 +000083574Marc Singer talks AGENT RECONhttps://www.aintitcool.com/marc-singer-interview-agent-recon-eric-mcclanahan-83573/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMarc Singer (BEASTMASTER, V) talks Derek Ting\u0026#39;s AGENT RECON, streaming now!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/marc-singer-interview-agent-recon-eric-mcclanahan-83573/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eI get a lot of emails. A lot of invites to screen films, read books, watch documentaries, talk to strangers. A lot. I can’t answer them all, sadly. But when I got an email that said there was a new film coming out with Chuck Norris and Marc Singer, and would I like to talk to Marc Singer about it, I practically broke the sound barrier with my swift response of “hell to the yes!”\u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e I’m a man of a certain age, and I grew up in the wilds of Southeast Texas. As I recall my rough and tumble childhood, I don’t say I’m from the streets - I’m from the roads. Concrete jungle films didn’t interest me quite as much as actual jungle films, so if you wanted my ticket money, throw an animal or two in your film. Want to see Clint Eastwood act with a monkey? Hell yes, take my money.\u003cbr\u003e  \u003cbr\u003e So for me there was no greater action franchise than the BEASTMASTER films starring Marc Singer. The Sword \u0026 Sorcery world of Conan distilled through the eyes and wings of beasts and marketed to a younger audience, it surprised me to learn that the films came out in the same year and were envisioned in relative ignorance of one another. While CONAN THE BARBARIAN was the box office victor, and probably stands the test of the time more defiantly, I take some pleasure in knowing that it made four times the box office draw of BEASTMASTER at the\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/marc-singer-interview-agent-recon-eric-mcclanahan-83573/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 29 Jun 2024 20:00:00 +000083573WIN an Autographed Poster of THE STRANGERS - CHAPTER 1!!https://www.aintitcool.com/node/83572?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=contests\u003cp\u003eWIN an Autographed Poster of THE STRANGERS - CHAPTER 1!!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/node/83572?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=contests\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here. Lionsgate horror film, THE STRANGERS - CHAPTER 1, will be available on PEST / PVOD on July 7, 2024. This is the first entry of a horror feature-film series that introduces a new generation of fans to the creepy masked strangers from Bryan Bertino’s cult classic.\u003cbr\u003e We have some mini-posters signed by Cast Madelaine Petsch and Froy Gutierrez, Director Renny Harlin, and Producer Courtney Solomon to give away. If you want to win one, please email me at aicn-barbarella@hotmail.com with STRANGER as the subject. In the body of the email, please include your name and mailing address, whether or not you saw the original, and what are your preliminary thoughts on this new film series. (Open to US residents only, no PO Boxes.) Entries must be received by noon CST on Sunday, June 9.   \u003cbr\u003e Check out the trailer!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/node/83572?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=contests\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaWed, 05 Jun 2024 21:25:00 +000083572Barbarella Talks With Best-Selling Author ADELE PARKS About THE IMAGE OF YOU!https://www.aintitcool.com/adeleparksinterview2024imageofyou-83571/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Talks With Best-Selling Author ADELE PARKS About THE IMAGE OF YOU!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/adeleparksinterview2024imageofyou-83571/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here. The Image of You, starring Sasha Pieterse (Pretty Little Liars), Parker Young (Imposters), Nestor Carbonell (The Dark Knight Rises), and Academy Award® winner Mira Sorvino (Mighty Aphrodite), tells the story of twins Anna and Zoe, who find their bond tested when one of them falls in love. Skeptical Zoe digs for the dirt on Anna’s love interest, leading them into a web of deceit and desire.\u003cbr\u003e   \u003cbr\u003e I had an opportunity to speak to best-selling author Adele Parks about her novel-turned-movie, and I have to tell you, I loved talking with her. She’s the kind of person I could spend days just absorbing the stories that she tells with passion, energy, and humor. I found her so engaging. I hope you will, too. Check it out. \u003cbr\u003e I want to start with a little icebreaker. What's the weirdest experience you've had while dating?\u003cbr\u003e “Oh. I don’t know if I've had that many weird things. I think I've got quite a high threshold of what weird would be. Yeah, I have. Also, I'm a serial monogamist, and I've been married twice. I was married for seven years, and the very first night I went out after the divorce – which was quite a long time after the divorce – I met my second husband, so I haven't really done much dating. I should have done a lot more. No, I honestly, I'm absolutely stumped. So unlike me. I think the only quote from that is, I have a very high threshold of weird.”\u003cbr\u003e You know, writers, you're creative,\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/adeleparksinterview2024imageofyou-83571/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 10 May 2024 22:27:00 +000083571WIN a Signed Copy of Best-Selling Novel THE IMAGE OF YOU!!https://www.aintitcool.com/imageofyoubookcontest2024-83570/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=contests\u003cp\u003eWIN a Signed Copy of Best-Selling Novel THE IMAGE OF YOU!!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/imageofyoubookcontest2024-83570/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=contests\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHi, friends! Barbarella here with a question. Who likes to read? We have two copies of the novel The Image of You, signed by both the actor Sasha Pieterse and the international best-selling author Adele Parks. Sasha plays twins Anna and Zoe in the thriller that is out in select theaters and available to buy on Digital today! \u003cbr\u003e  The story tells a twisted tale of deception, desire, and codependence and also stars Parker Young (Imposters), Nestor Carbonell (The Dark Knight Rises), and Academy Award® winner Mira Sorvino (Mighty Aphrodite).\u003cbr\u003e If you want to win the book penned by one of the best-selling authors of women’s fiction, email me at aicnbarbarella@yahoo.com with I READ THRILLERS as the subject line. In the body of the email, please provide your name, mailing address (no PO Boxes, US residents only), and the reason you should be selected as a winner. Entries must be received by noon CST on Wednesday, May 15, 2024. Good luck, and I look forward to reading the entries!\u003cbr\u003e If you don't read, the movie is available in select theaters and for purchase on Digital today! Here's the trailer.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/imageofyoubookcontest2024-83570/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=contests\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 10 May 2024 21:04:00 +000083570THE IMAGE OF YOU Director JEFF FISHER Chats with Barbarellahttps://www.aintitcool.com/interviewjefffisher2024imageofyou-83569/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eTHE IMAGE OF YOU Director JEFF FISHER Chats with Barbarella\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interviewjefffisher2024imageofyou-83569/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends. Barbarella here. The psychological thriller The Image of You examines duality in the form of twins, Zoe and Anna, who although they look identical, couldn’t be further apart. When sweet and naïve Anna meets a man and falls in love quickly, her bad-girl twin Zoe aims to test the strength of the relationship and the caliber of man who has captured her sister’s heart. The movie will be in select theaters and on Digital Friday, May 10. \u003cbr\u003e \u003cbr\u003e I had an opportunity to speak with director Jeff Fisher about directing dual roles. Check it out!  \u003cbr\u003e I want to start with kind of a crazy icebreaker question, but what is the weirdest or craziest experience you've had dating, that you're willing to share?\u003cbr\u003e “Oh, my God. The weirdest or craziest experience I've had dating. This is not going to paint me in a very good light. I will tell you, my last long-term relationship, we met at a bar. I don't know if this was dating. We made out in the back of the bar for three and a half hours, on our first meeting, so it was an egregious public display of affection, and just shameless. I guess that would be my weirdest, but it was great. It didn't show a lot of couth, but there we go. I'll go with that.”\u003cbr\u003e Couth is overrated. How did you get involved in The Image of You? \u003cbr\u003e “The production company helped with distribution on my first feature back in 2008. They had sent me the script, and I thought\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interviewjefffisher2024imageofyou-83569/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 10 May 2024 02:53:00 +000083569Check Out This Clip from PITCH PEOPLE!https://www.aintitcool.com/pitchpeopleclip2024-83568/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eCheck Out This Clip from PITCH PEOPLE!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/pitchpeopleclip2024-83568/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here. Have you ever wondered how pitches evolved into infomercials? Well, if so, Pitch People may be the movie for you. We’ve been given a clip from the restored-in-4K feature documentary to share with you.\u003cbr\u003e \u003cbr\u003e Marking the 25th anniversary of Stanley Jacob’s never-before-seen story of the pitch business, Pitch People will be available on i-Tunes, Amazon Prime Video, and Google Play May 17, 2024. \u003cbr\u003e Check it out!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/pitchpeopleclip2024-83568/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaThu, 09 May 2024 16:32:00 +000083568BarbarellaFri, 06 Dec 2024 12:45:00 +000083598Tim Sheridan - Creator Interviewhttps://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comicsBarbarella Dives into Conversation with FREEDIVER Director Michael John Warren! Read the full article on AICN Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death.  Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both! Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Finish the article on AICN McEricSat, 30 Nov 2024 08:54:00 +000083597Jenni \"JWoww\" Farley on Writing/Directing DEVONhttps://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsTim Sheridan chats about Alan Scott: Green Lantern, Superman: Man of Tomorrow, Batman: The Long Halloween, and adapting legacy stories to small and large screens. Read the full article on AICN When I got into this racket over six years ago, I did so as a fan. In fact, it was a passing text exchange with a friend about the movie A QUIET PLACE that ended with “Hey, do you want to write about movies for a website?” Flash forward, here I am, having interviewed over a hundred creatives in my time with this site and others. Typically, I’ll get an email from a PR firm asking if I want to screen a film and speak with attached talent or read a book and speak with the author. I rarely say no as I firmly believe that everyone is worth talking to and every person you come in contact with can teach you something that you might not learn in your own sphere of social contacts or experiences.   This interview is different. This subject I hunted down. I saw that he was going to be at New York Comic Con this year signing books in Artist Alley, and I’d already interacted with him briefly on Twitter (back when it was Twitter) so I felt I could swing over and say hello. I did, and of course he had some fans in front of him when I arrived so I decided to hang back and let them have their moment. Watching him interact with these fans confirmed everything I believed about this writer - he couldn’t be any nicer, any more accommodating, or any more grateful for the people who celebrate his art. Finish the article on AICN McEricFri, 15 Nov 2024 01:07:00 +000083596HIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmakinghttps://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsMcEric chats with reality star Jenni \"JWoww\" Farley on her feature-film debut as writer/director of the found-footage horror film DEVON. Read the full article on AICN Found footage horror. Do you love it? Do you hate it? Do you think it is its own genre or do you lump it in with its overarching tone - slasher, supernatural, monster, etc. Love it or hate it, the convention is here to stay, as it offers a realistic, relatable approach to horror that blurs the lines between reality, film, empathy, and voyeurism.   So, when I got an email asking if I wanted to screen the feature DEVON, written and directed by Jenni “JWoww” Farley, I said “of course I do!” My wife is a fan of “Jersey Shore” and has been since day one, so I mostly did it for her, but I was also very curious what the singular star would bring to the horror pantheon. The logline read:   Devon's parents never stopped searching for answers after her disappearance from a notorious asylum. Years after the incident, a mysterious website draws five adventurers to the abandoned asylum where she was last seen. Armed with cameras, they plunge into the darkness, unaware they’re filming their own descent into horror—never meant to return.     I got the chance to chat with writer/director/producer Jenni “JWoww” Farley about jumping into a feature-length film, the serendipitous location, and her crew.      Eric McClanahan: Hey, Jenni! How are you?   Jenni “JWoww” Farley: Good. Nervous.    EM: Nervous? Why are you nervous?   JJF: I feel like this is [me] kind of starting my career over. It’s a different world, a different element. I am a superfan of horror films; I have been since I Finish the article on AICN BarbarellaFri, 08 Nov 2024 15:59:00 +000083595Spooky Picks for Fright Night Flickshttps://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsHIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmaking Read the full article on AICN Hey, friends! Barbarella here to talk about dark comedy Hippo, or more accurately to share the conversation I had with Hippo’s director and writer Mark Rapaport. Genuinely funny, this incredible film has the potential to achieve cult status, so long as people take a chance on this black-and-white gem and actually see it. I recommend that they do. Hippo stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts as the narrator. It tells the story of two exceptionally different teens being raised by their mother in a somewhat isolated existence. At times, it reminds me of Yorgos Lanthimos’ Dogtooth, in the way that the children in Hippo are sheltered, while not in the same extreme way they were in the Greek film, both films make strong points about the detriment of isolation. The two would make a great double-feature, but if you want to jump on this one first, Hippo will be in select theaters November 8.  At any rate, after a night of minimal sleep due to staying out late at the Pink concert, I caught up with Mark Rapaport, and we had a fun chat about the movie. Check it out! Barbara: Why go black and white with this?  Mark: I've always loved classic movies, but I never thought I would make a movie in black and white until my cinematographer started taking photos of black and white, and I was like, “These are so cool and good, why don't more people shoot in black and white? Maybe we should do something like that.” He was very into that. When Finish the article on AICN McEricFri, 01 Nov 2024 00:45:00 +000083594Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEEhttps://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH. Read the full article on AICN ‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.   DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:     If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.   I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles. Carrie-Anne Finish the article on AICN staffSat, 05 Oct 2024 14:56:00 +000083593STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsSnake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE Read the full article on AICN Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing.  If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015). Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor Finish the article on AICN BarbarellaSat, 05 Oct 2024 02:02:00 +000083592Kevin Smith Talks THE 4:30 MOVIEhttps://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsSTRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024! Read the full article on AICN Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie.  It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out! Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff. Peter: Bless You.  Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that.  Stuart: Thank you.   Barbara: Why do this in a true crime format? What were you going for?  Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I Finish the article on AICN McEricTue, 01 Oct 2024 08:37:00 +000083591Interview with the Cast of TERRIFIER 3https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsKevin Smith Talks to McEric about THE 4:30 MOVIE Read the full article on AICN Kevin Smith’s THE 4:30 MOVIE is coming home today, available on digital through all major retailers. The film tells the story of young Brian David, an avatar of Kevin Smith, and his adventures at the local Atlantic Cinema where he watches films with his friends Burny and Belly in 1986. It’s a departure from the View Askewniverse that Smith started thirty years ago, which admittedly stretched to its possible breaking point as the characters within encountered rebel angels, demons, Hollywood, jewel thieves, terrorists, and a monkey. THE 4:30 MOVIE offers a much more grounded story of a simpler time when the cinema and video store ruled the weekend, and the lives on the silver screen either mirrored our own or showed us worlds we could only imagine.  I had the opportunity to chat with Kevin Smith yesterday in support of the film’s digital release and it went exactly as I thought it would: we were given six minutes, I asked one question, and he talked for eight. What I got in that response, though, was a good deal of wisdom about what the filmmaker attempts when he puts his memories to screen for our amusement, how he’s remained relevant, and where his ideas originate. Prior to the interview’s start, my cat Bennie decided she needed to be part of it all, as well, and leapt onto the seat behind me.    Eric McClanahan - Hi Kevin!   Kevin Smith - Hello, Eric! How are you?   EM - I’m well, thank you!   KS - Look at that cat! Finish the article on AICN McEricTue, 01 Oct 2024 01:03:00 +000083590Barbarella Talks AI With SUBSERVIENCE Director S.K. Dalehttps://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsMcEric chats with David Howard Thornton (Art the Clown) and Lauren Lavera (Sienna Shaw) ahead of Damien Leone's TERRIFIER 3 Read the full article on AICN Time to crawl out from under your bridges, ghouls, because Damien Leone’s Art the Clown is back in TERRIFIER 3, hitting theaters October 11th. This time the terror is set against the backdrop of Christmas, with Art (David Howard Thornton) returning to hunt down Sienna (Lauren Lavera) after she cut his head off in the last installment. The film picks up right at the end of Part 2 before allowing Art to take a five year siesta while Sienna spends time in facilities piecing her psyche back together. Young Jonathan Shaw (Elliott Fullam) isn’t so young anymore, attending college near his Aunt and Uncle, Jessica and Mark (Margaret Anne Florence and Alex Ross), with whom Sienna stays after being checked out of the latest facility.  The film opens with Art dispatching a family while dressed in a Santa Claus suit, letting the audience know right away that no one is safe. The entire film plays out as a supercut of gory kills and dark humor, with occasional moments of genuine world-building that allows the supporting cast to really stretch their acting muscles. Plotwise, the film seems to be more focused on showcasing creative kills than telling a cohesive story, and the end seems somewhat rushed, as though the filmmakers had almost forgotten that they had to end the thing.    What a TERRIFIER fan is looking for, however, is exactly what they’ll find in 3: inventive kills, stomach-turning sound design, laughs that’ll make you question your own morality, and surprises. When I got Finish the article on AICN BarbarellaSat, 14 Sep 2024 13:57:00 +000083589THE 4:30 MOVIE's Cast Speaks About Kevin Smith's New Comedyhttps://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsBarbarella Talks AI With SUBSERVIENCE Director S.K. Dale Read the full article on AICN Hi friends, Barbarella here. Sci-fi film Subservience, starring Megan Fox, Michele Morrone  (his name’s Italian so the “ch” is pronounced like a “k”), Madeline Zima, and Matilda Firth, just came out on Demand and Digital, so let’s talk about AI. Do you think artificial intelligence will bring about major medical advancements, or do you envision more of a Terminator situation evolving? I tend to think it’s not the AI itself but whoever’s behind it that should be on whom we focus our concern. When it comes to cinema, filmmakers always hold technology responsible, because let’s face it, that makes for a more entertaining movie. I would argue Will Honley and April Maguire’s screenplay puts at least some of the onus on the humans. Maybe don’t say certain things to a Sim that’s constantly evolving and learning; that’s all I’m saying. If it weren’t for one comment made to Alice (Megan Fox), the attractive Sim acquired to help out around the house, perhaps a lot of mayhem could have been avoided.    I appreciate that the conflict in Subservience primarily occurs within the family unit, as this makes it more believable to me. Favoring older technologies, Nick (Michele Morrone) isn’t the biggest fan of artificial intelligence, but when he and his sick wife (Madeline Zima) can’t keep up with managing the household and children, he caves and gets Alice, the best new Sim on the market, to help out, and you know that’s not going to work out quite how everyone expects, well, at least how everyone Finish the article on AICN McEricFri, 13 Sep 2024 00:11:00 +000083588Shiloh Fernandez Discusses Working With Nadine Crocker on CONTINUEhttps://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsMcEric chats with the cast of Kevin Smith's THE 4:30 MOVIE Read the full article on AICN Writer/Director Kevin Smith began his View Askewniverse in 1994 with his breakout hit CLERKS. The film tells the story of a couple of slackers working dead-end jobs in New Jersey in the 1990s and the conversations and misadventures they dabble in along the way. The film paved the way for countless stories, and so far nine films by Smith have rounded out its canon, along with several animated adventures and more in the pages of comic books. Before Dante and Randall ever sat around the Quik Stop and chatted about JAWS, STAR WARS, or even NAVY SEALS, young Kevin Smith was a New Jersey native soaking up inspiration on the silver screen at his local movie theater, the Atlantic Highlands Cinema. Flash forward to today and he owns that theater, rebranded as the Smodcastle, where he showcases new releases, repertory classics, film festivals, and even special screenings of “Movies With Kev,” where he screens a classic and participates in a Q\u0026A following the screening.   Finally the formative experiences of young Kev are getting their own film treatment, with Kevin Smith’s newest release, THE 4:30 MOVIE, premiering tomorrow in cinemas around the country. The film, not set within the View Askewniverse, tells the story of a young man named Brian David, a not-even-thinly-veiled stand-in for Kevin Smith, played by Austin Zajur, who one day in the late spring of 1986 asks his crush Melody Barnegat (Siena Agudong) to meet him at the movies. This is much to the chagrin of his two Finish the article on AICN BarbarellaFri, 06 Sep 2024 11:06:00 +000083586Barbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsShiloh Fernandez Discusses Working With Nadine Crocker on CONTINUE Read the full article on AICN Hey, friends! Barbarella here. It feels a little wrong that I have a ton of pep today while I’m covering a movie about the very serious topic of suicide, but here we are. Continue makes a personal and powerful statement from writer, director, and star Nadine Crocker, who survived her own suicide attempt in her twenties. In Theaters, On Demand and Digital September 6, 2024, Continue escorts viewers through Dean’s struggles as she experience life after a suicide attempt. Beautifully shot, the film also includes an unexpected love story, albeit, I’m not sure I believe that two people would be that flirtatious while discussing their past traumas, but just because I wouldn’t flirt while sharing horrific things from the past doesn’t mean it’s not possible that some people might. Anyway, before I veer too far off-topic, the movie stars an actor of whom I’ve been a fan since first seeing him about fifteen years ago in an independent film at Fantastic Fest called Deadgirl, and I’m grateful to have the opportunity to chat with that actor, Shiloh Fernandez, about the film.  Right out of the gate, I share my love of Deadgirl and Shiloh’s performance in it. Check out his response and the rest of our conversation!  Shiloh: That is so sweet. It’s still one of my favorite movies. I loved doing a small movie like that, and all these years later, to do Continue, I think it was maybe the 2nd smallest. It is really neat having these small movies make an impact.  Barbara: I don’t know what it says about me, but Deadgirl was one Finish the article on AICN BarbarellaThu, 22 Aug 2024 23:29:00 +000083585#ALL MY FRIENDS ARE DEADhttps://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsBarbarella and Director Audrey Cummings Discuss Western PLACE OF BONES! Read the full article on AICN Hey, friends. Barbarella here. A new Western, Place of Bones, rides into theaters and on digital Friday, August 23, 2024. Unlike the Westerns of yesteryear, this one is female-led, with Audrey Cummings in the director’s chair and Heather Graham shining in the lead role as a mother who, along with her daughter (Brielle Robillard), must fight for survival when a gang of outlaws, led by Tom Hopper, arrives in the area.    I’ve been a Tom Hopper fan ever since he won me over with his enticing portrayal of Billy Bones in Black Sails. He earns additional adoration from me through the way he injects subtle humor as villain Bear John in this film. I find myself laughing at moments that I’m fairly certain weren’t intended to be funny, yet he fires wit like a true sharp-shooter with a faint exasperation about him that’s just funny. However, he’s not the only one who offers something more than just delivering what’s written on the page. Corin Nemec, Brielle Robillard, and Heather Graham also add an extra something that gives insight into their characters and adds a bit of snark to the exchanges.   I had the opportunity to speak with Audrey Cummings, and I sometimes like to break the ice with a question about Muppet-casting on remakes. While she placed Kermit, Miss Piggy and Fozzy Bear in the lead roles of Calhoun (Corin Nemec), Pandora (Heather Graham), and Hester (Brielle Robillard), I took a completely different approach, thinking it would be fun to have Statler and Finish the article on AICN McEricSat, 17 Aug 2024 00:12:00 +000083584Check Out This Trailer for Psychological Thriller SLINGSHOT!!https://www.aintitcool.com/slingshottrailer-83583/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews#ALL MY FRIENDS ARE DEAD director Marcus Dunstan and star Jade Pettyjohn talk to McEric about the new slasher comedy! Read the full article on AICN There was every manner of film at this year’s Tribeca Festival, and I managed to take in thirteen features, four shorts, and an episodic premiere by the time the whole thing wrapped this past June. One of the highlights was the opportunity to interview two of the lead talents behind the new slasher ALL MY FRIENDS ARE DEAD: director Marcus Dunstan and star Jade Pettyjohn. We met at the Roxy Hotel bar and restaurant, a favorite meetup spot of mine, on a Saturday morning. I was, admittedly, running late, but they were so patient and gracious with me and I always appreciate that from stars and filmmakers, whose lives are probably ten times as cluttered as mine.  Its logline says of the film: “A group of college friends rents an airbnb for the biggest music festival of the year. However, their weekend of partying soon takes a deadly turn as a masked killer murders them one by one according to their sins.” The film, though familiar in synopsis, finds a way to inject new life into a tired formula. The design of the killer is unique, the kills are creative, the victims are fighters rather than training dummies, for the most part, and the twist(s) are welcome.   Marcus Dunstan is perpetually smiling, speaking in a small voice from a large, gentle face. Jade Pettyjohn is excitable, clearly enjoying being at the festival and also talking about this joyous diversion in her filmography. We couldn’t help but jump right in. Unfortunately, I recorded this Finish the article on AICN BarbarellaTue, 30 Jul 2024 21:00:00 +000083583SDCC Robert Downey Jr returns to MCU!https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsCheck Out This Trailer for Psychological Thriller SLINGSHOT!! Read the full article on AICN Hey friends, Barbarella here. It seems like ages since we’ve had a really cool psychological thriller that takes place in space, but it appears that Slingshot may fill that void. When a trio of elite astronauts set to undertake a risky slingshot maneuver, potential issues with both the ship and a crew member add to the dangers of the mission. Starring Casey Affleck, Laurence Fishburne, Emily Beecham, Tomer Capone, and David Morrissey, the film hits theaters nationwide August 30th. Check out the trailer! Finish the article on AICN HouseOfMacleodSun, 28 Jul 2024 08:58:00 +000083582SDCC Max Panel unveils new Penguin Trailer!https://www.aintitcool.com/sdcc-max-panel-unveils-new-penguin-trailer-83581/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsRobert Downey Jr is back but not as we know it! Read the full article on AICN In perhaps the most shocking story to come out of this year's otherwise short-on news panel from Marvel Studios, Robert Downey Jr is returning to the MCU. It has just been announced that he has been cast as none other than the great green dictator Doctor Doom. Taking to the stage Downey Jr had this to say: \"New mask, same task...What can I tell ya, I like playing complicated characters.\" Whether or not he’ll be the genuine Earth 616 version or the Doom from the alternate Universe Fantastic Four: First Steps seems to be set in remains to be seen. Either way, welcome back to the fold RDJ. The panel revealed that Downey Jr’s Doom would make his presence known in the freshly titled Avengers: Doomsday which has a release date of May 2026 with Avengers: Secret Wars following in May 2027.  Let us know what you think of this curveball in the comments down below! Finish the article on AICN HouseOfMacleodSun, 28 Jul 2024 07:13:00 +000083581SDCC Star Trek Panel reveals first look at Strange New Worlds and More!https://www.aintitcool.com/idcc-star-trek-reveals-first-look-83580/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsThe Max panel from HBO has just unveiled the second trailer for its forthcoming original limited series! Read the full article on AICN (Photo: Max)  Tear down the empire from the inside out. The Max panel from HBO has just unveiled the second trailer for its forthcoming original limited series The Penguin starring Academy Award Nominee Colin Farrell, Cristin Milioti, Rhenzi Feliz and Clancy Brown. Set directly after the events of Matt Reeves’ The Batman, the series follows crime boss Oswald Cobblepot as he makes a bid to control Gotham cities underworld after the death of Carmine Falcone. Created by showrunner Lauren LeFranc and Directed by Craig Zobel, The Penguin premiers on September 19 exclusively on Max. I personally still can't get my head around Farrell’s insane transformation for this role. When you see him introduce the trailer, it makes that stunning metamorphosis all the more unreal. Check out the trailer below and let us know what you think in the comments below. Finish the article on AICN HouseOfMacleodSun, 28 Jul 2024 04:43:00 +000083580SDCC Doctor Who Christmas special clip!!https://www.aintitcool.com/sdcc-doctor-who-christmas-special-clip-83579/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsAll the action from the Star Trek panel at San Diego Comic-Con! Read the full article on AICN The Star Trek panel at SDCC just hit and boy did Paramount + bring the good stuff! Not only did they give us our first look at Strange New Worlds Season 3 and Lower Decks Season 5 but we were also treated to our first look at section 31, a Paramount+ Original Movie, starring Academy Award® winner Michelle Yeoh as Emperor Philippa Georgiou who joins a secret division of Starfleet tasked with some of the shadier work that comes with protecting the United Federation of Planets. Also revealed was a little bit of casting news regarding the upcoming Star Trek: Starfleet Academy series, which is bringing back Star Trek: Discovery alum Tig Notaro, Oded Fehr and Mary Wiseman and get this, Robert Picardo of Voyager and Prodigy! It would seem that the next few years will be a great time to be a Star Trek fan and I can't wait for more. Let us know what you think of the footage in the comments section below and as always, Live Long and Prosper… Finish the article on AICN HouseOfMacleodSat, 27 Jul 2024 02:57:00 +000083579Amazon MGM Revives the Legendary Studio United Artists!https://www.aintitcool.com/amazon-mgm-revives-the-legendary-studio-united-art-83578/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsNicola Coughlan introduces the first look at the new Doctor Who Christmas Special! Read the full article on AICN Hello Doctor Who fans, House of Macleod here with some very special news! SDCC 2024 has well and truly kicked off and this year promises to be full of all the geeky joy that keeps us going through these long summer months and Honey, are we here for fun! Speaking of Joy, Doctor Who’s YouTube channel just released a first look at the 2024 Christmas special, complete with an introduction from Nicola Coughlan (Bridgerton, Derry Girls, Barbie). This year's special is called “Joy to the World” and is written by Steven Moffat and happens to be the 50th script he’s written for the series in total. Doctor Who is available now to stream on BBC iPlayer in the UK and Disney+ in the rest of the world. Check out the clip straight from Hall H below and as usual, let us know what you think in the comments section! Allons-y! Finish the article on AICN HouseOfMacleodSat, 27 Jul 2024 01:22:00 +000083578Fanhome Launches The Legends of Batman Collectionhttps://www.aintitcool.com/fanhome-legends-of-batman-collection-83577/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comicsAmazon MGM Revives the Legendary Studio United Artists! Read the full article on AICN In some exciting news circulating the internet, it would seem that the ex-head of film at Netflix Scott Stuber is reviving the once legendary United Artists label through new partners Amazon MGM Studios. Founded in 1919 by the likes of Charlie Chaplin, Mary Pickforth, D.W.Griffith and famed actor and filmmaker Douglas Fairbanks, United Artists began as a studio that would allow artists to control their own careers and artistic vision instead of being controlled by Hollywood moneymen. After decades of success, Metro Goldwyn Mayer bought the company over in 1981 for an unheard-of 350 million dollars and continued to release movies under the brand MGM/UA through the rest of the 80s, 90s and 2000s. United Artists are responsible for releasing some of the most classic movies of all time including The Mark of Zorro (1920), D.W.Griffith’s final film The Struggle (1931), The Great Dictator (1941), Alexander the Great (1956), Robert Mitchum’s Thunder Road (1958), The Magnificent Seven (1960), Dr. No (1963), Chitty Chitty Bang Bang (1968), Rocky (1976), Annie Hall (1977), Raging Bull (1980) and To Live and Die in L.A. (1985) to name but a few.  Jennifer Salke (Head of Amazon MGM Studios) had this to say about the resurrection:   “With his proven track record of delivering global hits and an eye towards theatrical fare, Scott’s expertise and vision align perfectly with our film strategy. We are so proud to welcome him on the relaunch of the legendary UA brand, as we work to leverage existing and new IP into big, broad films Finish the article on AICN McEricSat, 20 Jul 2024 18:02:00 +000083577Exclusive Clip from THE MANDELA EFFECT PHENOMENON!!https://www.aintitcool.com/mandelaeffectclip2024-83576/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsFanhome, a subscription-based models and collections service, launches a Batman collection for the ages. Read the full article on AICN Hello all!   So, if you're like me, you love Batman. Who doesn't? However, when it comes down to reading his myriad adventures, where should one start?  Batman has been a hero in pages and on screens for over 85 years, so it's hard to jump into his exploits without a guiding hand to navigate the most important formative stories. To this end Fanhome, a subscription-based model and collectible service, has launched a new collection called The Legends of Batman Graphic Novel Collection. From Year Zero to Year 100, this collection promises to tell the most definitive stories of the Caped Crusader in beautifully reproduced glossy hardcovers, each with bonus content such as variant covers, concept art, and creator notes.   \"From the moment Bruce Wayne becomes The Caped Crusader to his final days in the future, this collection brings together essential Batman tales in a book series that belongs on every bookshelf.\"   New volumes arrive monthly, and the series is MASSIVE. From the collected spines one can see that we'll witness the Joker's origin, the Death in the Family, the Breaking of the Bat, and the formation and expansion of the Bat Family. This looks to be an amazing collection for fans of the Bat new and established, young and old.    To find out how to order, check out https://www.fanhome.com/us/movie-series/legends-batman-graphic-novels   Check it out and stay tuned for more info! -McEric, aka Eric McClanahan- Finish the article on AICN BarbarellaFri, 12 Jul 2024 16:09:00 +000083576Shane Dax Taylor Talks MURDER COMPANYhttps://www.aintitcool.com/shanedaxtaylorinterview2024murdercompany-83575/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsExclusive Clip from THE MANDELA EFFECT PHENOMENON!! Read the full article on AICN Hey friends, Barbarella here. We have an exclusive clip from The Mandela Effect Phenomenon, directed by Robert Kiviat. The film explores the claims that movies, TV show titles, celebrities’ names, logos and brands are not what they once were. Conspiracy theorists may jump on the notion that a supernatural force is editing history.  Check out this clip from The Mandela Effect Phenomenon. The documentary is available now on digital! Finish the article on AICN BarbarellaFri, 12 Jul 2024 01:44:00 +000083575It May Only be July, but Here's a Trailer for THE BEST CHRISTMAS PAGEANT EVER!https://www.aintitcool.com/bestchristmaspageantevertrailer2024-83574/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsShane Dax Taylor Talks MURDER COMPANY Read the full article on AICN Hey friends, Barbarella here. I’ve had quite a couple months, and I wish I could say that I was gallivanting around the globe, but not this time. I’ve been sick a good chunk of it. In fact, I had quite a fever when I screened Murder Company, written by Jesse Mittelstadt and directed by Shane Dax Taylor. I don’t know that it would be fair to the filmmakers to review the film, given that I was feeling so awful while watching it that I don’t think my thoughts would necessarily be a true reflection of how the movie was. I will make a few observations, though.  First of all, Kelsey Grammer was my favorite thing about Murder Company, which is currently On Digital and On Demand, and I wanted him to have far more screen time. I love a serious Kelsey Grammer, and he's incredibly serious in this. Second, while there was far less graphic violence and gore than I would have expected from a war movie made in this day and age, the filmmakers seemed to compensate for that with the amount of people flying around, proving yet again that stunt men are insane. “Yeah, you can hurl me into that tree. Sure.” Finally, could we please stop having people engage in casual conversations while walking through enemy-occupied territories? I understand that it seems a good way to develop characters, but it drives me crazy every time anyone has a conversation at a normal volume as if they’re just strolling through the Finish the article on AICN BarbarellaMon, 01 Jul 2024 22:46:00 +000083574Marc Singer talks AGENT RECONhttps://www.aintitcool.com/marc-singer-interview-agent-recon-eric-mcclanahan-83573/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsIt May Only be July, but Here's a Trailer for THE BEST CHRISTMAS PAGEANT EVER! Read the full article on AICN Hey friends, Barbarella here. I know it’s way too early to start thinking about Christmas, but we have a trailer to share with you for a Christmas movie! Please forgive us. The Best Christmas Pageant Ever comes to theaters November 8.  Based on Barbara Robinson’s beloved book, the story centers on the Herdmans as they take over their local church pageant. The worst kids in the community participating in a church activity; what could go wrong? It’s hard to say from the trailer if this movie, starring Judy Greer, Pete Holmes, Molly Belle Wright, and Lauren Graham, is going to be just another sappy Christmas story or something memorable to add to one's annual holiday movie rotation. I guess we’ll find out soon enough. Finish the article on AICN McEricSat, 29 Jun 2024 20:00:00 +000083573WIN an Autographed Poster of THE STRANGERS - CHAPTER 1!!https://www.aintitcool.com/node/83572?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=contestsMarc Singer (BEASTMASTER, V) talks Derek Ting's AGENT RECON, streaming now! Read the full article on AICN I get a lot of emails. A lot of invites to screen films, read books, watch documentaries, talk to strangers. A lot. I can’t answer them all, sadly. But when I got an email that said there was a new film coming out with Chuck Norris and Marc Singer, and would I like to talk to Marc Singer about it, I practically broke the sound barrier with my swift response of “hell to the yes!”     I’m a man of a certain age, and I grew up in the wilds of Southeast Texas. As I recall my rough and tumble childhood, I don’t say I’m from the streets - I’m from the roads. Concrete jungle films didn’t interest me quite as much as actual jungle films, so if you wanted my ticket money, throw an animal or two in your film. Want to see Clint Eastwood act with a monkey? Hell yes, take my money.   So for me there was no greater action franchise than the BEASTMASTER films starring Marc Singer. The Sword \u0026 Sorcery world of Conan distilled through the eyes and wings of beasts and marketed to a younger audience, it surprised me to learn that the films came out in the same year and were envisioned in relative ignorance of one another. While CONAN THE BARBARIAN was the box office victor, and probably stands the test of the time more defiantly, I take some pleasure in knowing that it made four times the box office draw of BEASTMASTER at the Finish the article on AICN BarbarellaWed, 05 Jun 2024 21:25:00 +000083572Barbarella Talks With Best-Selling Author ADELE PARKS About THE IMAGE OF YOU!https://www.aintitcool.com/adeleparksinterview2024imageofyou-83571/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsWIN an Autographed Poster of THE STRANGERS - CHAPTER 1!! Read the full article on AICN Hey, friends! Barbarella here. Lionsgate horror film, THE STRANGERS - CHAPTER 1, will be available on PEST / PVOD on July 7, 2024. This is the first entry of a horror feature-film series that introduces a new generation of fans to the creepy masked strangers from Bryan Bertino’s cult classic. We have some mini-posters signed by Cast Madelaine Petsch and Froy Gutierrez, Director Renny Harlin, and Producer Courtney Solomon to give away. If you want to win one, please email me at aicn-barbarella@hotmail.com with STRANGER as the subject. In the body of the email, please include your name and mailing address, whether or not you saw the original, and what are your preliminary thoughts on this new film series. (Open to US residents only, no PO Boxes.) Entries must be received by noon CST on Sunday, June 9.    Check out the trailer! Finish the article on AICN BarbarellaFri, 10 May 2024 22:27:00 +000083571WIN a Signed Copy of Best-Selling Novel THE IMAGE OF YOU!!https://www.aintitcool.com/imageofyoubookcontest2024-83570/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=contestsBarbarella Talks With Best-Selling Author ADELE PARKS About THE IMAGE OF YOU! Read the full article on AICN Hey, friends! Barbarella here. The Image of You, starring Sasha Pieterse (Pretty Little Liars), Parker Young (Imposters), Nestor Carbonell (The Dark Knight Rises), and Academy Award® winner Mira Sorvino (Mighty Aphrodite), tells the story of twins Anna and Zoe, who find their bond tested when one of them falls in love. Skeptical Zoe digs for the dirt on Anna’s love interest, leading them into a web of deceit and desire.    I had an opportunity to speak to best-selling author Adele Parks about her novel-turned-movie, and I have to tell you, I loved talking with her. She’s the kind of person I could spend days just absorbing the stories that she tells with passion, energy, and humor. I found her so engaging. I hope you will, too. Check it out.  I want to start with a little icebreaker. What's the weirdest experience you've had while dating? “Oh. I don’t know if I've had that many weird things. I think I've got quite a high threshold of what weird would be. Yeah, I have. Also, I'm a serial monogamist, and I've been married twice. I was married for seven years, and the very first night I went out after the divorce – which was quite a long time after the divorce – I met my second husband, so I haven't really done much dating. I should have done a lot more. No, I honestly, I'm absolutely stumped. So unlike me. I think the only quote from that is, I have a very high threshold of weird.” You know, writers, you're creative, Finish the article on AICN BarbarellaFri, 10 May 2024 21:04:00 +000083570THE IMAGE OF YOU Director JEFF FISHER Chats with Barbarellahttps://www.aintitcool.com/interviewjefffisher2024imageofyou-83569/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsWIN a Signed Copy of Best-Selling Novel THE IMAGE OF YOU!! Read the full article on AICN Hi, friends! Barbarella here with a question. Who likes to read? We have two copies of the novel The Image of You, signed by both the actor Sasha Pieterse and the international best-selling author Adele Parks. Sasha plays twins Anna and Zoe in the thriller that is out in select theaters and available to buy on Digital today!   The story tells a twisted tale of deception, desire, and codependence and also stars Parker Young (Imposters), Nestor Carbonell (The Dark Knight Rises), and Academy Award® winner Mira Sorvino (Mighty Aphrodite). If you want to win the book penned by one of the best-selling authors of women’s fiction, email me at aicnbarbarella@yahoo.com with I READ THRILLERS as the subject line. In the body of the email, please provide your name, mailing address (no PO Boxes, US residents only), and the reason you should be selected as a winner. Entries must be received by noon CST on Wednesday, May 15, 2024. Good luck, and I look forward to reading the entries! If you don't read, the movie is available in select theaters and for purchase on Digital today! Here's the trailer. Finish the article on AICN BarbarellaFri, 10 May 2024 02:53:00 +000083569Check Out This Clip from PITCH PEOPLE!https://www.aintitcool.com/pitchpeopleclip2024-83568/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsTHE IMAGE OF YOU Director JEFF FISHER Chats with Barbarella Read the full article on AICN Hey, friends. Barbarella here. The psychological thriller The Image of You examines duality in the form of twins, Zoe and Anna, who although they look identical, couldn’t be further apart. When sweet and naïve Anna meets a man and falls in love quickly, her bad-girl twin Zoe aims to test the strength of the relationship and the caliber of man who has captured her sister’s heart. The movie will be in select theaters and on Digital Friday, May 10.  I had an opportunity to speak with director Jeff Fisher about directing dual roles. Check it out!   I want to start with kind of a crazy icebreaker question, but what is the weirdest or craziest experience you've had dating, that you're willing to share? “Oh, my God. The weirdest or craziest experience I've had dating. This is not going to paint me in a very good light. I will tell you, my last long-term relationship, we met at a bar. I don't know if this was dating. We made out in the back of the bar for three and a half hours, on our first meeting, so it was an egregious public display of affection, and just shameless. I guess that would be my weirdest, but it was great. It didn't show a lot of couth, but there we go. I'll go with that.” Couth is overrated. How did you get involved in The Image of You?  “The production company helped with distribution on my first feature back in 2008. They had sent me the script, and I thought Finish the article on AICN BarbarellaThu, 09 May 2024 16:32:00 +000083568",
    "author": "Barbarella",
    "published": "Fri, 06 Dec 2024 12:45:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "43ed3122-1173-4f41-85d2-40a1324506eb",
    "title": "Tim Sheridan - Creator Interview",
    "link": "https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comics",
    "description": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren! Read the full article on AICN Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death.  Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both! Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Finish the article on AICN",
    "author": "McEric",
    "published": "Sat, 30 Nov 2024 08:54:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "fdb2ef7d-b96a-49ae-9ea4-4ce882ef4205",
    "title": "James Gunn To Film “Pickup Shots” For ‘Superman’ In Order “To Enhance The Film”: “No Reshoots”",
    "link": "https://deadline.com/2024/12/james-gunn-film-pickup-shots-superman-reshoots-1236199019/",
    "description": "James Gunn is clarifying reports that suggested Superman would undergo reshoots and confirming that he will only film a few “pickup shots.” The writer, director, and DC Studios co-head took to social media to inform his fans about the additional filming for the superhero film. “Sort of. Not a few days. We’re doing a day […]",
    "author": "Armando Tinoco",
    "published": "Tue, 10 Dec 2024 00:44:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/07/james-gunn-superman-filming.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "DC Studios",
      "James Gunn",
      "Superman"
    ]
  },
  {
    "id": "4fa83b9b-c783-47c5-a3e9-2bd2ef05162a",
    "title": "Healthcare CEO Killing Suspect Ordered Held Without Bail After Court Appearance – Update",
    "link": "https://deadline.com/2024/12/ceo-killing-suspect-detained-news-coverage-arrest-1236198599/",
    "description": "UPDATED: Luigi Mangione, suspected in the killing of United Healthcare CEO Brian Thompson, was ordered held without bail at his arraignment this afternoon in a Hollidaysburg, PA court. Mangione, who did not enter a plea, faces several charges, including one felony count of forgery and one felony count of carrying a firearm without a license, according […]",
    "author": "Denise Petski",
    "published": "Tue, 10 Dec 2024 00:30:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/12/Luigi-Mangione.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Legal",
      "News",
      "Brian Thompson",
      "CEO Killing",
      "Luigi Mangione",
      "United Healthcare"
    ]
  },
  {
    "id": "80f91a9f-23c7-4ac8-b894-e86130347022",
    "title": "For the Characters of ‘Emilia Pérez’ to Evolve, So Too Did the Filmmakers",
    "link": "https://www.indiewire.com/craft-considerations/emilia-perez-making-of-netflix-musical-audiard-interview-1235069893/",
    "description": "The team behind the Netflix musical tells IndieWire about navigating the shifts and changes within Jacques Audiard's movie to tell its singular story.",
    "author": "Mark Peikert",
    "published": "Tue, 10 Dec 2024 00:16:09 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Craft | Technology, Sound and Set Design",
      "Features",
      "Craft Considerations",
      "Emilia Perez",
      "Film",
      "Netflix",
      "Top of the Line"
    ]
  },
  {
    "id": "d5a8e63f-c808-47c8-a218-9e03eb908bbd",
    "title": "Saoirse Ronan Plans on ‘Having a Whole Career Shared’ with Paul Mescal — Just Don’t Count on a ‘Gladiator III’ Cameo",
    "link": "https://www.indiewire.com/news/general-news/saoirse-ronan-gladiator-3-paul-mescal-wicked-1235074208/",
    "description": "Irish actors Ronan and Mescal have already co-starred on film together in 2023's \"Foe.\"",
    "author": "Samantha Bergeson",
    "published": "Mon, 09 Dec 2024 23:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Gladiator 3",
      "Paul Mescal",
      "Saoirse Ronan",
      "Wicked"
    ]
  },
  {
    "id": "fae21d15-4e18-4585-8e7c-7655422763c0",
    "title": "Chris Evans MCU Return Set for Avengers: Doomsday",
    "link": "https://www.comingsoon.net/movies/news/1891067-chris-evans-mcu-return-avengers-doomsday",
    "description": "Chris Evans is officially returning to the Marvel Cinematic Universe, as TheWrap is reporting that the star who played Captain America for over a decade will be in Avengers: Doomsday. Who will Chris Evans be in Avengers: Doomsday? Although Evans is reportedly returning to the world of Marvel, it’s unclear whether or not he will […] The post Chris Evans MCU Return Set for Avengers: Doomsday appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Mon, 09 Dec 2024 23:27:12 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/12/chris-evans-header.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Anthony Russo",
      "Avengers",
      "Avengers: Doomsday",
      "Chris Evans",
      "Disney",
      "Joe Russo",
      "Marvel",
      "Marvel Cinematic Universe",
      "Marvel Studios",
      "Movie News"
    ]
  },
  {
    "id": "1d73b1a7-d27f-43e9-a404-978bd8f2d2fe",
    "title": "Jeremy Allen White Joins Star Wars: The Mandalorian \u0026 Grogu Cast",
    "link": "https://www.comingsoon.net/movies/news/1891051-jeremy-allen-white-the-mandalorian-and-grogu-cast-star-wars",
    "description": "The Mandalorian \u0026 Grogu cast continues to grow, with Jeremy Allen White now reportedly having signed on to star in the highly anticipated Star Wars movie. According to a report from Jeff Sneider of The InSneider, White will star in the movie in the role of Rotta the Hutt, the son of Jabba the Hutt. […] The post Jeremy Allen White Joins Star Wars: The Mandalorian \u0026 Grogu Cast appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Anthony Nash",
    "published": "Mon, 09 Dec 2024 23:03:13 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/12/jeremy-allen-white-header.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "Disney",
      "Jeremy Allen White",
      "Movie News",
      "Star Wars",
      "The Mandalorian \u0026 Grogu"
    ]
  },
  {
    "id": "b7ec6d94-cc1a-4ad3-a693-dfb6c7bc411e",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "a7afdc45-9626-40d8-8bde-d688b66117df",
    "title": "A Dog Named ‘Fluke’ Talks His Way Into Our Pick of the Week",
    "link": "https://filmschoolrejects.com/fluke-bluray-review/",
    "description": "Plus 12 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 22 Oct 2024 05:54:02 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "ba52b7ab-584c-4065-a6da-90640c8d274c",
    "title": "Adam Woodward \u0026 Marton Csokas in 'Man with No Past' Action Trailer",
    "link": "https://www.firstshowing.net/2024/adam-woodward-marton-csokas-in-man-with-no-past-action-trailer/",
    "description": "\"With what do you bribe a man who already has everything?\" Paramount Movies has revealed an official trailer for Man with No Past, yet another new action thriller from stuntmant filmmaker James Bamford. He's churning these out by the dozen - this year alone he also has the films Hard Home, Jade, and Utopia. And this one coming next. Man with No Past is exactly as the title describes - an amnesiac man awakens in unknown city, seeking truth about past and who he is. Aided by many mysterious allies, he then infiltrates a powerful gang, engaging in a time-transcending battle while fate looms... This epic showdown will seal his fate and reveal his identity. Starring Adam Woodward as Ryder, Marton Csokas, Charlotte Weston, Philip Winchester, Jeff Alexander, and Jon Voight. Wait – in this footage, it seems this guy is some kind of time-hopping assassin who's been around hundreds of years fighting at different times? Huh, okay. Here's the official trailer (+ poster) for James Bamford's Man with No Past, direct from YouTube: Academy Award winner Jon Voight, Marton Csokas, and Adam Woodward star in this action-packed thriller. Waking in an unfamiliar city, a man with no memory of […]",
    "author": "Alex Billington",
    "published": "Mon, 09 Dec 2024 23:10:21 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/ManwithNoPastTrailerPosterTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "a66803b0-6129-4d72-963f-9fa492be9855",
    "title": "New Trailer for 'Demon Slayer: Kimetsu no Yaiba Infinity Castle' Anime",
    "link": "https://www.firstshowing.net/2024/new-trailer-for-demon-slayer-kimetsu-no-yaiba-infinity-castle-anime/",
    "description": "\"Immortality is what you dream of...\" Crunchyroll has revealed a second teaser trailer for Demon Slayer: Kimetsu no Yaiba - Infinity Castle, the first in a trilogy of anime spin-off films continuing the Demon Slayer stories. This first one is already set for a theatrical release in the US starting in 2025 - no final date has been announced. This latest teaser trailer (the second one so far) comes from the CCXP event in Brazil. The Demon Slayer Corps plunge into Infinity Castle to defeat Muzan. However, the remaining Hashiras and the Demon Slayers who survived Tanjiro's Final Selection are pitted against the remaining members of the Twelve Kizuki first. A sequel film set after the events of the first season, Demon Slayer: Kimetsu no Yaiba – The Movie: Mugen Train, was released in October 2020, while films, Demon Slayer: Kimetsu no Yaiba – To the Swordsmith Village and Demon Slayer: Kimetsu no Yaiba – To the Hashira Training, were respectively released in February 2023 \u0026 February 2024. It was such a success they'll continue with a theatrical release of this next one. Featuring the voices of Natsuki Hanae, Yoshitsugu Matsuoka, Hiro Shimono, and Akari Kitô. It'll be released in […]",
    "author": "Alex Billington",
    "published": "Mon, 09 Dec 2024 19:11:14 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/DemonSlayerSeriesmainimgbigTsr.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Animation",
      "Foreign Films",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "5b011247-db23-456f-9f57-ba4e0975818e",
    "title": "Avengers: Doomsday – Chris Evans Will Reportedly Return In Some Way",
    "link": "https://bleedingcool.com/movies/avengers-doomsday-chris-evans-will-reportedly-return-in-some-way/",
    "description": "Another familiar face is returning for Avengers: Doomsday, and it is reported that Chris Evans will have some sort of role in the film.",
    "author": "Kaitlyn Booth",
    "published": "Mon, 09 Dec 2024 18:47:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Marvel Studios",
      "Movies",
      "avengers: doomsday"
    ]
  },
  {
    "id": "443d75ff-6536-408b-a0ac-6c9933dbc49b",
    "title": "The Mandalorian \u0026 Grogu: Jeremy Allen White Voicing Rotta the Hutt?",
    "link": "https://bleedingcool.com/tv/the-mandalorian-grogu-jeremy-allen-white-voicing-rotta-the-hutt/",
    "description": "Reports are that Jeremy Allen White has joined the cast of Dave Filoni's Pedro Pascal and Sigourney Weaver-starring The Mandalorian \u0026 Grogu.",
    "author": "Ray Flook",
    "published": "Mon, 09 Dec 2024 17:10:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Disney+",
      "Movies",
      "Star Wars",
      "TV",
      "The Mandalorian",
      "the mandalorian \u0026amp; grogu"
    ]
  },
  {
    "id": "edcead2d-b29e-48f3-92cb-deb30f245fed",
    "title": "Colman Domingo Says ‘Euphoria’ Season 3 Storylines ‘Took My Breath Away’: ‘Most Gorgeous Writing Sam Levinson Has Ever Done’",
    "link": "https://variety.com/2024/tv/news/colman-domingo-euphoria-season-3-sam-levinson-1236244047/",
    "description": "Colman Domingo is gearing up for another season of “Euphoria.” Speaking to Variety hours after scoring a Golden Globe nomination for his performance in “Sing Sing,” Domingo revealed he’s spoken to creator Sam Levinson about the new season — and he’s a big fan of the direction he’s taking the series. “I have not seen […]",
    "author": "Katcy Stephan",
    "published": "Tue, 10 Dec 2024 01:05:25 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/12/colman-euphoria.png",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Colman Domingo",
      "Euphoria",
      "Sam Levinson"
    ]
  },
  {
    "id": "2e34a3c9-231d-4371-a611-de221bdea67e",
    "title": "‘Baghdad Messi’ Review: From Iraq Comes a Heartfelt Social Realist Drama Set During the Second Gulf War",
    "link": "https://variety.com/2024/film/reviews/baghdad-messi-review-1236231613/",
    "description": "The shattering of a childhood dream is symbolic of the cruelly contorted fate of a nation in “Baghdad Messi.” Kurdish-Belgian filmmaker Sahim Omar Kalifa has expanded his much-acclaimed 2012 short into an affecting social drama that unfolds amid violence and fear in Iraq, 2009, during the second Gulf War. Centered on a soccer-mad young boy […]",
    "author": "Richard Kuipers",
    "published": "Tue, 10 Dec 2024 01:00:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/12/Baghdad-Messi-FLO.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Reviews",
      "Baghdad Messi",
      "Best International Feature Film",
      "Sahim Omar Kalifa"
    ]
  }
]
