[
  {
    "id": "46d08702-e1fd-4dac-9a10-0153059849eb",
    "title": "Vikings, Hot Springs and Heavy Metal: How the Reykjavik International Film Festival Has Carved Out a Unique Identity",
    "link": "https://variety.com/2024/film/news/reykjavik-film-festival-iceland-filmmaking-bjork-hot-springs-1236171619/",
    "description": "A post-metal band plays at a screening of a vintage Viking saga. Björk shows up to check out the latest films by Pedro Almodovar and Athina Rachel Tsingari. Filmmakers relax in warm mineral-laden waters at the ocean’s edge. Industry members are invited to the President of Iceland’s house to chat about the state of the […]",
    "author": "Pat Saperstein",
    "published": "Sun, 13 Oct 2024 00:02:37 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/52437753070_9c6ec64d63_k.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Bjork",
      "Nastassja Kinski",
      "Pedro Almodovar",
      "Rekjavik International Film Festival"
    ]
  },
  {
    "id": "9dcbc797-52ef-4aa0-b325-fa1984513a51",
    "title": "Jelly Roll’s ‘Beautifully Broken’ Offers Country Music a Reset, by Aggressively Prioritizing Mental Health \u003e Partying: Album Review",
    "link": "https://variety.com/2024/music/album-reviews/jelly-roll-beautifully-broken-album-review-1236176217/",
    "description": "By now almost everybody has at least an inkling that Jelly Roll has become one of the biggest superstars of country music in the past two years. But, of course, there are parts of the show-biz world that remain stubbornly country-uncognizant … those who are still not ready for that Jelly. And so, when the […]",
    "author": "Chris Willman",
    "published": "Sat, 12 Oct 2024 23:09:30 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/jelly-Album-Cover-Treatment.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "Album Reviews",
      "News",
      "Reviews",
      "Jelly Roll",
      "Skylar Grey"
    ]
  },
  {
    "id": "b35a1cff-8eb6-439a-9869-21e515d3db57",
    "title": "School Spirits Explained: Who Killed Peyton List's Maddie Nears?",
    "link": "https://www.slashfilm.com/1687016/school-spirits-who-killed-peyton-list-maddie-nears-explained/",
    "description": "The School Spirits season 1 finale provides a surprising answer to the central mystery of who killed Peyton List's Maddie Nears.",
    "author": "Valerie Ettenhofer",
    "published": "Sun, 13 Oct 2024 00:00:32 +0000",
    "image": "https://www.slashfilm.com/img/gallery/school-spirits-explained-who-killed-peyton-lists-maddie-nears/l-intro-1728768398.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows",
      "Fantasy Shows"
    ]
  },
  {
    "id": "eac0a5fe-d70b-47c5-85a9-d763defcbc28",
    "title": "Jorge Garcia Got His Lost Role Thanks To A Very Different TV Show",
    "link": "https://www.slashfilm.com/1676486/jorge-garcia-got-lost-role-thanks-to-tv-show-curb-your-enthusiasm/",
    "description": "Jorge Garcia might've never played Hurley on Lost had co-creator J.J. Abrams not spotted him in a show that was worlds apart from the series.",
    "author": "Michael Boyle",
    "published": "Sat, 12 Oct 2024 22:45:40 +0000",
    "image": "https://www.slashfilm.com/img/gallery/jorge-garcia-got-his-lost-role-thanks-to-a-very-different-tv-show/l-intro-1727709749.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows",
      "Science Fiction Shows",
      "Action \u0026 Adventure Shows"
    ]
  },
  {
    "id": "ebf95ab4-c7e3-4fc7-8064-bada2f6aede6",
    "title": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE",
    "link": "https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE Read the full article on AICN Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing.  If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015). Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor Finish the article on AICN",
    "author": "staff",
    "published": "Sat, 05 Oct 2024 14:56:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "9375fb38-eccc-4527-9d9a-5f69c25aa5e9",
    "title": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!",
    "link": "https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024! Read the full article on AICN Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie.  It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out! Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff. Peter: Bless You.  Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that.  Stuart: Thank you.   Barbara: Why do this in a true crime format? What were you going for?  Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I Finish the article on AICN",
    "author": "Barbarella",
    "published": "Sat, 05 Oct 2024 02:02:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "2949e23f-d1e0-4270-a28d-70f489a23958",
    "title": "Richard ‘Dick’ Block Dies: Former Kaiser Broadcasting President \u0026 USC Professor Was 97",
    "link": "https://deadline.com/2024/10/richard-dick-block-dead-kaiser-broadcasting-president-usc-professor-1236114401/",
    "description": "Richard “Dick” Block, the former president of Kaiser Broadcasting and an adjunct associate professor at the University of Southern California’s School of Cinematic Arts, died Sept. 30 at the age of 97. A cause of death was not given, and the news was confirmed by friend and mentee Russell Myerson. Two months shy of his […]",
    "author": "Natalie Oganesyan",
    "published": "Sun, 13 Oct 2024 00:15:21 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/10/dick-block.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Obituaries",
      "kaiser broadcasting",
      "richard block",
      "USC"
    ]
  },
  {
    "id": "43ea5dbf-7c44-4bd4-8cb9-636da1a7e9c7",
    "title": "Sean Baker Laments “Few And Far Between” Films Not Focused On “Explosions” And “Superheroes”",
    "link": "https://deadline.com/2024/10/sean-baker-superhero-explosions-films-1236114396/",
    "description": "Indie filmmaker Sean Baker lamented the diminishing quantity of films not geared toward the superhero, action flick or horror genres. “What I miss,” Baker began in a recent interview with the Associated Press, “where are the mature film for adults that had human stories, that didn’t have to have explosions or didn’t have to have superheroes […]",
    "author": "Natalie Oganesyan",
    "published": "Sat, 12 Oct 2024 23:19:51 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/10/sean-baker.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Anora",
      "indie film",
      "Sean Baker",
      "Tangerine"
    ]
  },
  {
    "id": "424ffc77-4b59-4586-bff3-191574232fd8",
    "title": "American Movie 4K Review: Doc Is Still Funny, Sad, \u0026 Inspiring",
    "link": "https://www.comingsoon.net/movies/reviews/1862805-american-movie-4k-review",
    "description": "There have been some incredible documentaries over the years chronicling how films were made, such as Hearts of Darkness: A Filmmaker’s Apocalypse. However, the ones that stand the test of time tend to be about groundbreaking pieces of art and legendary movies. That’s why American Movie was so interesting, as it focused on an unknown, […] The post American Movie 4K Review: Doc Is Still Funny, Sad, \u0026 Inspiring appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Tyler Treese",
    "published": "Sun, 13 Oct 2024 01:05:57 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/American-Movie-4K-Review.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "American Movie",
      "Chris Smith",
      "exclude_from_yahoo",
      "Movie Reviews",
      "Sony Pictures Classics"
    ]
  },
  {
    "id": "95cbec23-9a82-4cfd-ab89-c58039fdd638",
    "title": "Disney Plus Schedule October 14-20 2024: New TV Shows \u0026 Movies Being Added",
    "link": "https://www.comingsoon.net/guides/news/1860861-disney-plus-schedule-october-14-20-2024-new-tv-shows-movies-being-added",
    "description": "Disney Plus’ schedule of new TV and movie releases for October 14-20 2024, includes a new episode of Agatha All Along and Me \u0026 Mickey Season 3, along with two episodes of Playdate with Winnie the Pooh Season 2. On October 16, Disney Plus viewers can check out the sixth episode of Agatha All Along. […] The post Disney Plus Schedule October 14-20 2024: New TV Shows \u0026 Movies Being Added appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Ritika Singh",
    "published": "Sat, 12 Oct 2024 19:05:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/Disney-Plus-Schedule-Oct-14-20.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Disney Plus",
      "Release Date Schedule",
      "TV Guides"
    ]
  },
  {
    "id": "fadb162a-b176-4b38-80b9-e27005cb457b",
    "title": "‘All We Imagine as Light’ Director Calls the Oscars ‘Archaic,’ Says Cinema Is Ready to Move Beyond ‘National Boundaries’",
    "link": "https://www.indiewire.com/news/general-news/all-we-imagine-as-light-director-oscars-archaic-1235055928/",
    "description": "Payal Kapadia is fine with her film not being chosen as India's submission for the Oscars and wants the world to embrace more of an \"open idea\" around cinematic expression.",
    "author": "Harrison Richlin",
    "published": "Sat, 12 Oct 2024 20:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "All We Imagine As Light",
      "Film",
      "Oscars",
      "Payal Kapadia"
    ]
  },
  {
    "id": "b4c4e19b-2ff5-4b40-b5e3-739a7329a73c",
    "title": "Harrison Ford Says He Plans to Keep Working, if Only for the ‘Essential Human Contact’",
    "link": "https://www.indiewire.com/news/general-news/harrison-ford-essential-human-contact-acting-1235055929/",
    "description": "Referencing his part in the Apple TV+ series \"Shrinking\" specifically, Ford expressed his appreciation for the elite ensemble cast he gets to act opposite.",
    "author": "Harrison Richlin",
    "published": "Sat, 12 Oct 2024 19:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Harrison Ford",
      "Shrinking",
      "TV"
    ]
  },
  {
    "id": "0d028974-31a8-4e26-88bb-cb9ebc806470",
    "title": "‘Caddo Lake’ Twists Mystery, Loss, and Emotion Into an Affecting Thriller",
    "link": "https://filmschoolrejects.com/caddo-lake-review/",
    "description": "Give this film your complete attention (phones off!), and you won't be disappointed.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 12:06:45 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Caddo Lake",
      "Dylan O'Brien"
    ]
  },
  {
    "id": "3368f16e-49d8-44cb-814b-d26246ad436c",
    "title": "‘Terrifier 3’ Is More of Exactly What You Think It Is, For Better and Worse",
    "link": "https://filmschoolrejects.com/terrifier-3-review/",
    "description": "And it's also the bloodiest, goriest, gnarliest entry in the Christmas horror subgenre, yet.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 00:32:04 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Christmas horror",
      "Horror",
      "terrifier"
    ]
  },
  {
    "id": "4a5ca7ea-d087-4564-8aa9-3c6d65186d39",
    "title": "Sitges 2024: Spanish Stuck-on-the-Moon Thriller 'Luna' is a Disaster",
    "link": "https://www.firstshowing.net/2024/sitges-2024-spanish-stuck-on-the-moon-thriller-luna-is-a-disaster/",
    "description": "Spain, we have a problem. I don't enjoy writing negative reviews and I don't feel good about bashing films. I try to remain positive and talk about what I love. But sometimes there's a movie that is just so terrible, so miserable, such a waste of time and talent, that it is necessary to write about just so that the film industry can learn from their mistakes. I doubt they will. They will continue making bad films like this one. But at least I expressed my frustration and dissatisfaction in hopes that maybe they would spend money on better projects next time around. Luna (which translates to simply Moon) is a Spanish science fiction thriller film directed by filmmaker Alfonso Cortés-Cavanillas. Because it's an entirely Spanish production made mainly for Spanish audiences, the film had its world premiere at the 2024 Sitges Film Festival in Spain/Catalonia. It's bad. Like, really bad. Luna is one of these awful films that makes me want to actually stop anyone about to watch it and implore they do not waste any time or money ...",
    "author": "Alex Billington",
    "published": "Sat, 12 Oct 2024 16:15:58 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/LunaFilmMainSitgesbigimgTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Review",
      "Sci-Fi",
      "Sitges"
    ]
  },
  {
    "id": "1d37eaf0-f944-42ef-90f6-eec02359a516",
    "title": "Boxing in Victorian East End London 'A Thousand Blows' Series Teaser",
    "link": "https://www.firstshowing.net/2024/boxing-in-victorian-east-end-london-a-thousand-blows-series-teaser/",
    "description": "\"I have tasted death – life is much sweeter.\" Hulu has unveiled a first look teaser trailer for a series called A Thousand Blows, made for Disney+ in the UK arriving for streaming sometime in early 2025. The first two episodes are premiering son at the 2024 London Film Festival which just kicked off this week, hence this teaser dropping now. Created by Steven Knight, A Thousand Blows is inspired by the true-life stories of a group of characters battling for survival in the violent East End of London in the 1880s. It's about the fortunes (and challenges) of Hezekiah and Alec, two best friends newly arrived from Jamaica to the dirty \u0026 brutal streets of Victorian era London. Fighting for survival in the overwhelming melting pot of Victorian London's East End, they come up against Sugar Goodson – a dangerous, veteran boxer. The cast includes Malachi Kirby and Francis Lovehall as Hezekiah and Alec, from Jamaica, along with Erin Doherty, Stephen Graham as boxer Sugar Goodson, Jason Tobin, and James Nelson-Joyce. This is an exciting first look, will definitely ...",
    "author": "Alex Billington",
    "published": "Fri, 11 Oct 2024 21:36:19 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/AthousandblowsSeriestsrTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "2f659f9c-583d-4b00-acf5-0fb001aca14c",
    "title": "Wake Up Dead Man: Josh Brolin On \"Manifesting\" His Knives Out Role",
    "link": "https://bleedingcool.com/movies/wake-up-dead-man-josh-brolin-on-manifesting-his-knives-out-role/",
    "description": "Josh Brolin has revealed that he essentially manifested his casting in the upcoming Wake Up Dead Man: A Knives Out Mystery.",
    "author": "Kaitlyn Booth",
    "published": "Sat, 12 Oct 2024 19:47:08 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Netflix",
      "josh brolin",
      "wake up dead man",
      "wake up dead man: a knives out mystery"
    ]
  },
  {
    "id": "a1332ae2-aaaf-4861-bda8-536a93d2d8d4",
    "title": "The Wild Robot Filmmaker Says There Are Plans For A Sequel",
    "link": "https://bleedingcool.com/movies/the-wild-robot-filmmaker-says-there-are-plans-for-a-sequel/",
    "description": "The Wild Robot filmmaker Chris Sanders has confirmed that \"there are plans for a second one\" because there is some justice in the world.",
    "author": "Kaitlyn Booth",
    "published": "Sat, 12 Oct 2024 12:47:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Dreamworks",
      "Movies",
      "Universal",
      "the wild robot"
    ]
  }
]
