{
  "id": "00ee7e0f-a7f8-4059-845d-fcdf2684c585",
  "title": "Amazon is reportedly working on a low-cost storefront to rival Temu",
  "link": "https://www.engadget.com/big-tech/amazon-is-reportedly-working-on-a-low-cost-storefront-to-rival-temu-225049485.html?src=rss",
  "description": "Amazon may be working on a secondary online sales platform that would compete with the absurdly low prices of Chinese retailer Temu. The Information reported that it has seen internal information sent to Amazon merchants that detail some of the price caps for this new storefront. The outlet claims the upper limit of prices are set at $8 for jewelry, $9 for bedding, $13 for guitars and $20 for sofas that are shipped from its fulfillment center in Guangdong, China under this new \"Low-Cost Store.\" According to the site's sources, orders from this storefront would have slower shipping timelines of nine to 11 days, but would also charge lower fulfillment fees to sellers. A seller would be charged between $1.77 and $2.05 to ship a 4-8 ounce item through the Low-Cost Store, compared with a $2.67 to $4.16 charge for an item of that weight shipped under Fulfillment by Amazon from a domestic warehouse, according to The Information. Amazon has not set price limits on its eponymous online storefront, so this new platform will be a markedly different strategy from its usual approach. It's more in line with the pricing policy followed by Temu, which launched in 2022. In just two years, the bargain basement ecommerce platform has garnered a reputation for selling items of dubious quality as well as questions about relying on \"forced\" labor.This article originally appeared on Engadget at https://www.engadget.com/big-tech/amazon-is-reportedly-working-on-a-low-cost-storefront-to-rival-temu-225049485.html?src=rss",
  "author": "Anna Washenko",
  "published": "Tue, 22 Oct 2024 22:50:49 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Shopping",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Anna Washenko"
  ],
  "byline": "Anna Washenko",
  "length": 1345,
  "excerpt": "Amazon may be working on a secondary online sales platform that would compete with the absurdly low prices of Chinese retailer Temu, according to a report...",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "Amazon may be working on a secondary online sales platform that would compete with the absurdly low prices of Chinese retailer Temu. The Information reported that it has seen internal information sent to Amazon merchants that detail some of the price caps for this new storefront.The outlet claims the upper limit of prices are set at $8 for jewelry, $9 for bedding, $13 for guitars and $20 for sofas that are shipped from its fulfillment center in Guangdong, China under this new \"Low-Cost Store.\" According to the site's sources, orders from this storefront would have slower shipping timelines of nine to 11 days, but would also charge lower fulfillment fees to sellers. A seller would be charged between $1.77 and $2.05 to ship a 4-8 ounce item through the Low-Cost Store, compared with a $2.67 to $4.16 charge for an item of that weight shipped under Fulfillment by Amazon from a domestic warehouse, according to The Information.Amazon has not set price limits on its eponymous online storefront, so this new platform will be a markedly different strategy from its usual approach. It's more in line with the pricing policy followed by Temu, which launched in 2022. In just two years, the bargain basement ecommerce platform has garnered a reputation for selling items of dubious quality as well as questions about relying on \"forced\" labor.",
  "image": "https://s.yimg.com/ny/api/res/1.2/EyQXp_e1qPFFTzSjWHdgqg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/96afbf10-90c2-11ef-937f-3629da9d6ae1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAmazon may be working on a secondary online sales platform that would compete with the absurdly low prices of Chinese retailer Temu. \u003cem\u003eThe Information\u003c/em\u003e \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.theinformation.com/articles/amazon-sets-rock-bottom-pricing-plans-for-new-temu-rival-store\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:reported;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003ereported\u003c/ins\u003e\u003c/a\u003e that it has seen internal information sent to Amazon merchants that detail some of the price caps for this new storefront.\u003c/p\u003e\u003cp\u003eThe outlet claims the upper limit of prices are set at $8 for jewelry, $9 for bedding, $13 for guitars and $20 for sofas that are shipped from its fulfillment center in Guangdong, China under this new \u0026#34;Low-Cost Store.\u0026#34; According to the site\u0026#39;s sources, orders from this storefront would have slower shipping timelines of nine to 11 days, but would also charge lower fulfillment fees to sellers. A seller would be charged between $1.77 and $2.05 to ship a 4-8 ounce item through the Low-Cost Store, compared with a $2.67 to $4.16 charge for an item of that weight shipped under Fulfillment by Amazon from a domestic warehouse, according to \u003cem\u003eThe Information\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eAmazon has not set price limits on its eponymous online storefront, so this new platform will be a markedly different strategy from its usual approach. It\u0026#39;s more in line with the pricing policy followed by Temu, which launched in 2022. In just two years, the bargain basement ecommerce platform has garnered a reputation for selling items of \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/big-tech/the-us-government-may-be-preparing-to-investigate-internet-retail-giants-like-shein-and-temu-193218089.html\" data-ylk=\"slk:dubious quality;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003edubious quality\u003c/ins\u003e\u003c/a\u003e as well as questions about relying on \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.nytimes.com/2023/06/22/business/economy/shein-temu-forced-labor-china.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:\u0026#34;forced\u0026#34; labor;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003e\u0026#34;forced\u0026#34; labor\u003c/ins\u003e\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-22T22:50:49Z",
  "modifiedTime": null
}
