{
  "id": "01aaa56e-3e90-4655-a50c-2ed69ab92d0a",
  "title": "Rocket Report: Japan’s workhorse booster takes a bow; you can invest in SpaceX now",
  "link": "https://arstechnica.com/space/2025/07/rocket-report-japans-workhorse-booster-takes-a-bow-you-can-invest-in-spacex-now/",
  "description": "\"We will be able to industrialize Zephyr production up to 50 units per year.\"",
  "author": "Eric Berger",
  "published": "Fri, 04 Jul 2025 11:00:22 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Space",
    "Discovery",
    "rocket report",
    "Shuttle",
    "space"
  ],
  "byline": "Eric Berger",
  "length": 13283,
  "excerpt": "“We will be able to industrialize Zephyr production up to 50 units per year.”…",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "\"We will be able to industrialize Zephyr production up to 50 units per year.\" Europe’s first reusable rocket main stage demonstrator, Themis, is being transported to its launch pad at Esrange Space Centre, Sweden. Credit: ESA/ArianeGroup Welcome to Edition 8.01 of the Rocket Report! Today's edition will be a little shorter than normal because, for one day only, we celebrate fake rockets—fireworks—rather than the real thing. For our American readers, we hope you have a splendid Fourth of July holiday weekend. For our non-American readers, you may be wondering what the heck is happening in our country right now. Alas, making sense of \u003cwaves hands\u003e all this is beyond the scope of this humble little newsletter. As always, we welcome reader submissions, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar. Will Orbex ever launch an orbital rocket? Orbex, a launch services company based in the United Kingdom, has announced the postponement of its first orbital launch to 2026 due to infrastructure limitations and other issues, Orbital Today reports. At the Paris Air Show at Le Bourget, Orbex chief executive Miguel Bello Mora announced that the company is now targeting next year for the liftoff of its Prime rocket from SaxaVord in Scotland. He said the delay is partly due to the limited launch infrastructure at SaxaVord and a \"bottleneck\" in site operations. The real issue, revealed ... Orbex is developing the Prime rocket, but progress has been very slow. The company is now a decade old and has shown off relatively little hardware. It's difficult to believe the company will launch anytime soon. Tellingly, Orbex recently told the UK government it would need to raise a further 120 million pounds ($163 million) from private investors over the next four years to realize its ambitions. That seems like a huge ask. This newsletter has been skeptical of Orbex before, and this latest update only affirms that skepticism. Themis demonstrator arrives in Sweden. Developed by ArianeGroup, a 30-meter launch vehicle intended to demonstrate reusable launch capability has arrived at the Esrange Space Center in northern Sweden, SVT reports. The initial phase of the test campaign will include wet-dress rehearsals and hot-fire tests, to be followed by a \"hop test\" that will occur no earlier than the end of this year. Hopping higher and higher ... Based on experience from these initial tests, the program aims to fly the Themis demonstrator on higher and progressively more advanced tests, not dissimilar to what SpaceX did with its Grasshopper vehicle a little more than a decade ago in Texas. Eventually, Europe aims to use lessons learned from Themis to develop a reusable rocket similar to the Falcon 9 vehicle. (submitted by bjelkeman) The easiest way to keep up with Eric Berger's and Stephen Clark's reporting on all things space is to sign up for our newsletter. We'll collect their stories and deliver them straight to your inbox. Sign Me Up! Electron launches twice in two days. Rocket Lab's \"Symphony in the Stars\" mission lifted off on Saturday, June 28, from Mahia Peninsula in New Zealand. The mission was the second of two launches from the same launch site in less than 48 hours, a new record for turnaround time, the company said. It's a sign of a maturing company that Rocket Lab can turn between launches so quickly. Reaching an impressive cadence ... \"Symphony in the Stars\" was Rocket Lab’s tenth Electron mission of 2025 and its 68th launch overall as the company continues to increase the cadence of Electron launches. \"The future of space is built on proven performance, and Electron continues to deliver against a stacked launch manifest this year,\" Rocket Lab founder Peter Beck said in a news release. It's been a good year for the firm, with 100 percent mission success. Latitude announces expansion plans. In an emailed news release, the French launch startup Latitude said this week that it has secured a strategic industrial site south of Reims on the former AstraZeneca production facility. This site offers development potential of 270,000 sq. feet. By investing over 50 million euros ($58 million) in this site, Latitude aims to deliver on its promise of developing a small rocket with a high launch cadence. Seeking to scale ... \"Thanks to this location, we will be able to industrialize Zephyr production up to 50 units per year while maintaining control over our growth pace,\" said Isabelle Valentin, chief operating officer of the company. Latitude aims to launch its Zephyr rocket in 2026 from the Guiana Space Centre, in French Guiana, for the first time. The company also said it has signed two major contracts, including a strategic mission for the European Defence Fund and a contract with the French space agency, CNES, for microgravity demonstrations. Japan's H2A rocket makes final flight. Japan’s flagship H2A rocket lifted off for the final time on Sunday from the Tanegashima Space Center in Kagoshima Prefecture, successfully concluding a 24-year run that has defined the nation’s space capabilities, The Japan Times reports. The rocket’s 50th and final mission carried the GOSAT-GW, a government-developed hybrid environmental observation satellite. Out with the old, in with the new ... Jointly developed by Mitsubishi Heavy Industries and the Japan Aerospace Exploration Agency, the 53-meter rocket debuted in 2001 and quickly became the workhorse of the country’s space program. It had an excellent record, with 49 successes out of 50 launch attempts. The decision to retire the H2A comes amid rising global competition in the space launch industry, where cost-efficiency has become a key differentiator. Japan hopes its new H3 rocket, although expendable, will be more cost competitive. SpaceX to win DOD satellite contract. The Trump administration plans to cancel a fleet of orbiting data relay satellites managed by the Space Development Agency and replace it with a secretive network that, so far, relies primarily on SpaceX's Starlink Internet constellation, Ars reports. While details of the Pentagon's plan remain secret, the White House proposal would commit $277 million in funding to kick off a new program called \"pLEO SATCOM\" or \"MILNET.\" The funding line for a proliferated low-Earth orbit satellite communications network hasn't appeared in a Pentagon budget before, but plans for MILNET already exist in a different form. X marks the spot ... Meanwhile, the budget proposal for fiscal year 2026 would eliminate funding for a new tranche of data relay satellites from the Space Development Agency. The pLEO SATCOM or MILNET program would replace them, providing crucial support for the Trump administration's proposed Golden Dome missile defense shield. While SpaceX's role isn't mentioned explicitly in the Pentagon's budget documents, the MILNET program is already on the books, and SpaceX is the lead contractor. It has been made public in recent months, after years of secrecy, although many details remain unclear. Prometheus rocket engine undergoes testing. European rocket builder ArianeGroup announced this week that it completed a series of Prometheus rocket engine test ignitions in late June, marking a key milestone in the program, European Spaceflight reports. Developed under a European Space Agency contract, Prometheus is a reusable rocket engine capable of producing around 100 metric tons of thrust. Launching soon from Sweden ... It is designed to be manufactured at a fraction of the cost of current European engines, with the use of additive manufacturing playing a key role in reducing production costs. According to ArianeGroup, the multiple ignitions over a single day represent a \"significant advancement in the engine’s development.\" Prometheus will initially power the Themis demonstrator (see item above). Its first commercial application will be the two-stage Maia rocket, developed by MaiaSpace, an ArianeGroup subsidiary. Do you want to buy SpaceX tokens? SpaceX remains a privately held company, which means that us mere mortals cannot invest in the launch firm. (To be clear, as a space reporter, I do not invest in any space companies. To do so would be unethical.) The DealBook newsletter has a report on a new trend in \"tokens\" that allows ordinary investors to invest in privately traded companies, including SpaceX. Not technically equity ... Vlad Tenev, Robinhood’s chief executive, said that the tokens are not technically \"equity,\" but that they \"effectively give retail investors exposure to these private assets.\" Robinhood isn’t alone: The startup Republic is offering tokens meant to track the equity performance of SpaceX. Those will be sold to US investors via a loophole in a 2012 securities law. However, DealBook warns, unregulated private-company tokens could lead to a fragmented and less transparent ecosystem for investments, making it harder for regulators to protect the public. Texas politicians seek to move shuttle Discovery. This week, a political effort to relocate the space shuttle Discovery from the Smithsonian to Space Center Houston has been merged with the so-called \"One Big Beautiful Bill,\" which the US Senate passed on Tuesday, Ars reports. Among the bill's many provisions is $85 million for the Bring the Space Shuttle Home Act. Sponsored by US Sen John Cornyn, R–Texas, the bill calls for Discovery to be removed from its home of the past 13 years, the National Air and Space Museum's Steven F. Udvar-Hazy Center in Chantilly, Virginia, and put it on display at Space Center Houston, the official visitor complex for NASA's Johnson Space Center in Texas. Underestimating transport costs ... The Senate version of the bill provides \"no less than $5 million\" for the \"transportation of the space vehicle'' and the remainder to go toward the construction of a facility to house it. The original text of the Bring the Space Shuttle Home Act called for the NASA administrator and the Smithsonian to jointly develop a plan for moving Discovery prior to appropriations being made by Congress. It is unclear whether the total amount allocated by the Senate would be enough; the National Air and Space Museum provided Congress with an estimate of $200 million to $300 million for the move. Speaking frankly, and as a resident of Houston, this bill is absurd, and the shuttle Discovery absolutely belongs in the Smithsonian. NASA is being told to cut science missions left and right, but funding can be found for this? Next New Glenn launch will target Mars. Blue Origin is making steady progress toward the second launch of its New Glenn rocket, which could occur sometime this fall, Ars reports. Publicly, the company has said this second launch will take place no earlier than August 15. This is now off the table. One source told Ars that a mid- to late-September launch date was \"realistic,\" but another person said late October or November was more likely. A big landing on tap ... Blue Origin has been mum about the payload that will fly on this rocket, but multiple people have told Ars that the current plan is to launch NASA's ESCAPADE mission on the second launch of New Glenn. This mission encompasses a pair of small spacecraft that will be sent to Mars to study the red planet's magnetosphere. After ESCAPADE, Blue Origin has several missions tentatively plotted out. A much-anticipated mission to land Blue Origin's Mk1 lander on the Moon could take place during the first half of next year. Next three launches July 3: Soyuz 2.1a | Progress MS-31 | Baikonur Cosmodrome, Kazakhstan | 19:32 UTC July 8: Falcon 9 | Starlink 10-28 | Cape Canaveral Space Force Station, Florida | 05:48 UTC July 15: Eris | Initial test flight | Bowen Orbital Spaceport, Australia | 21:30 UTC Eric Berger is the senior space editor at Ars Technica, covering everything from astronomy to private space to NASA policy, and author of two books: Liftoff, about the rise of SpaceX; and Reentry, on the development of the Falcon 9 rocket and Dragon. A certified meteorologist, Eric lives in Houston. 128 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/Themis_on_the_way_to_Kiruna-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2104240\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        \u0026#34;We will be able to industrialize Zephyr production up to 50 units per year.\u0026#34;\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Europe’s first reusable rocket main stage demonstrator, Themis, is being transported to its launch pad at Esrange Space Centre, Sweden.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          ESA/ArianeGroup\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eWelcome to Edition 8.01 of the Rocket Report! Today\u0026#39;s edition will be a little shorter than normal because, for one day only, we celebrate fake rockets—fireworks—rather than the real thing. For our American readers, we hope you have a splendid Fourth of July holiday weekend. For our non-American readers, you may be wondering what the heck is happening in our country right now. Alas, making sense of \u0026lt;waves hands\u0026gt; all this is beyond the scope of this humble little newsletter.\u003c/p\u003e\n\u003cp\u003eAs always, we \u003ca href=\"https://arstechnica.wufoo.com/forms/launch-stories/\"\u003ewelcome reader submissions\u003c/a\u003e, and if you don\u0026#39;t want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"560\" height=\"81\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" alt=\"\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png 560w, https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll-300x43.png 300w\" sizes=\"(max-width: 560px) 100vw, 560px\"/\u003e\n                  \u003c/p\u003e\n                \u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eWill Orbex ever launch an orbital rocket\u003c/strong\u003e? Orbex, a launch services company based in the United Kingdom, has announced the postponement of its first orbital launch to 2026 due to infrastructure limitations and other issues, \u003ca href=\"https://orbitaltoday.com/2025/06/24/uks-orbex-delays-first-launch-to-2026-cites-infrastructure-and-funding-challenges/\"\u003eOrbital Today reports\u003c/a\u003e. At the Paris Air Show at Le Bourget, Orbex chief executive Miguel Bello Mora announced that the company is now targeting next year for the liftoff of its Prime rocket from SaxaVord in Scotland. He said the delay is partly due to the limited launch infrastructure at SaxaVord and a \u0026#34;bottleneck\u0026#34; in site operations.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe real issue, revealed\u003c/em\u003e ... Orbex is developing the Prime rocket, but progress has been very slow. The company is now a decade old and has shown off relatively little hardware. It\u0026#39;s difficult to believe the company will launch anytime soon. Tellingly, Orbex recently told the UK government it would need to raise a further 120 million pounds ($163 million) from private investors over the next four years to realize its ambitions. That seems like a huge ask. This newsletter has been skeptical of Orbex before, and this latest update only affirms that skepticism.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u003cstrong\u003eThemis demonstrator arrives in Sweden\u003c/strong\u003e. Developed by ArianeGroup, a 30-meter launch vehicle intended to demonstrate reusable launch capability has arrived at the Esrange Space Center in northern Sweden, \u003ca href=\"https://www.svt.se/nyheter/lokalt/norrbotten/se-den-unika-aterbrukbara-raketen-i-kiruna\"\u003eSVT reports\u003c/a\u003e. The initial phase of the test campaign will include wet-dress rehearsals and hot-fire tests, to be followed by a \u0026#34;hop test\u0026#34; that will occur no earlier than the end of this year.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHopping higher and higher\u003c/em\u003e ... Based on experience from these initial tests, the program aims to fly the Themis demonstrator on higher and progressively more advanced tests, not dissimilar to what SpaceX did with its Grasshopper vehicle a little more than a decade ago in Texas. Eventually, Europe aims to use lessons learned from Themis to develop a reusable rocket similar to the Falcon 9 vehicle. (submitted by bjelkeman)\u003c/p\u003e\n\u003cdiv data-list-id=\"248910\"\u003e\n  \n  \u003cp\u003eThe easiest way to keep up with Eric Berger\u0026#39;s and Stephen Clark\u0026#39;s reporting on all things space is to sign up for our newsletter. We\u0026#39;ll collect their stories and deliver them straight to your inbox.\u003c/p\u003e\n  \u003cp\u003e\u003ca rel=\"nofollow\" href=\"https://arstechnica.com/newsletters/?subscribe=248910\"\u003eSign Me\n    Up!\u003c/a\u003e\n\u003c/p\u003e\u003c/div\u003e\n\n\u003cp\u003e\u003cstrong\u003eElectron launches twice in two days\u003c/strong\u003e. Rocket Lab\u0026#39;s \u0026#34;Symphony in the Stars\u0026#34; mission lifted off on Saturday, June 28, from Mahia Peninsula in New Zealand. The mission was the second of two launches from the same launch site in less than 48 hours, a new record for turnaround time, \u003ca href=\"https://secure.businesswire.com/news/home/20250628346094/en/Rocket-Lab-Completes-Record-Launch-Turnaround-From-Launch-Complex-1-Successfully-Deploys-68th-Electron-Mission\"\u003ethe company said\u003c/a\u003e. It\u0026#39;s a sign of a maturing company that Rocket Lab can turn between launches so quickly.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eReaching an impressive cadence\u003c/em\u003e ... \u0026#34;Symphony in the Stars\u0026#34; was Rocket Lab’s tenth Electron mission of 2025 and its 68th launch overall as the company continues to increase the cadence of Electron launches. \u0026#34;The future of space is built on proven performance, and Electron continues to deliver against a stacked launch manifest this year,\u0026#34; Rocket Lab founder Peter Beck said in a news release. It\u0026#39;s been a good year for the firm, with 100 percent mission success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLatitude announces expansion plans\u003c/strong\u003e. In an emailed news release, the French launch startup Latitude said this week that it has secured a strategic industrial site south of Reims on the former AstraZeneca production facility. This site offers development potential of 270,000 sq. feet. By investing over 50 million euros ($58 million) in this site, Latitude aims to deliver on its promise of developing a small rocket with a high launch cadence.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\n\u003cp\u003e\u003cem\u003eSeeking to scale\u003c/em\u003e ... \u0026#34;Thanks to this location, we will be able to industrialize Zephyr production up to 50 units per year while maintaining control over our growth pace,\u0026#34; said Isabelle Valentin, chief operating officer of the company. Latitude aims to launch its Zephyr rocket in 2026 from the Guiana Space Centre, in French Guiana, for the first time. The company also said it has signed two major contracts, including a strategic mission for the European Defence Fund and a contract with the French space agency, CNES, for microgravity demonstrations.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"560\" height=\"81\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/mediuml.png\" alt=\"\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/mediuml.png 560w, https://cdn.arstechnica.net/wp-content/uploads/2018/05/mediuml-300x43.png 300w\" sizes=\"(max-width: 560px) 100vw, 560px\"/\u003e\n                  \u003c/p\u003e\n                \u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eJapan\u0026#39;s H2A rocket makes final flight\u003c/strong\u003e. Japan’s flagship H2A rocket lifted off for the final time on Sunday from the Tanegashima Space Center in Kagoshima Prefecture, successfully concluding a 24-year run that has defined the nation’s space capabilities, \u003ca href=\"https://www.japantimes.co.jp/news/2025/06/29/japan/science-health/japan-h2a-rocket-retired/\"\u003eThe Japan Times reports\u003c/a\u003e. The rocket’s 50th and final mission carried the GOSAT-GW, a government-developed hybrid environmental observation satellite.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eOut with the old, in with the new\u003c/em\u003e ... Jointly developed by Mitsubishi Heavy Industries and the Japan Aerospace Exploration Agency, the 53-meter rocket debuted in 2001 and quickly became the workhorse of the country’s space program. It had an excellent record, with 49 successes out of 50 launch attempts. The decision to retire the H2A comes amid rising global competition in the space launch industry, where cost-efficiency has become a key differentiator. Japan hopes its new H3 rocket, although expendable, will be more cost competitive.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSpaceX to win DOD satellite contract\u003c/strong\u003e. The Trump administration plans to cancel a fleet of orbiting data relay satellites managed by the Space Development Agency and replace it with a secretive network that, so far, relies primarily on SpaceX\u0026#39;s Starlink Internet constellation, \u003ca href=\"https://arstechnica.com/space/2025/07/pentagon-may-put-spacex-at-the-center-of-a-sensor-to-shooter-targeting-network/\"\u003eArs reports\u003c/a\u003e. While details of the Pentagon\u0026#39;s plan remain secret, the White House proposal would commit $277 million in funding to kick off a new program called \u0026#34;pLEO SATCOM\u0026#34; or \u0026#34;MILNET.\u0026#34; The funding line for a proliferated low-Earth orbit satellite communications network hasn\u0026#39;t appeared in a Pentagon budget before, but plans for MILNET already exist in a different form.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eX marks the spot\u003c/em\u003e ... Meanwhile, the budget proposal for fiscal year 2026 would eliminate funding for a new tranche of data relay satellites from the Space Development Agency. The pLEO SATCOM or MILNET program would replace them, providing crucial support for the Trump administration\u0026#39;s proposed Golden Dome missile defense shield. While SpaceX\u0026#39;s role isn\u0026#39;t mentioned explicitly in the Pentagon\u0026#39;s budget documents, the MILNET program is already on the books, and SpaceX is the lead contractor. It has been made public in recent months, after years of secrecy, although many details remain unclear.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u003cstrong\u003ePrometheus rocket engine undergoes testing\u003c/strong\u003e. European rocket builder ArianeGroup announced this week that it completed a series of Prometheus rocket engine test ignitions in late June, marking a key milestone in the program, \u003ca href=\"https://europeanspaceflight.com/arianegroup-completes-key-prometheus-rocket-engine-tests/\"\u003eEuropean Spaceflight reports\u003c/a\u003e. Developed under a European Space Agency contract, Prometheus is a reusable rocket engine capable of producing around 100 metric tons of thrust.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eLaunching soon from Sweden\u003c/em\u003e ... It is designed to be manufactured at a fraction of the cost of current European engines, with the use of additive manufacturing playing a key role in reducing production costs. According to ArianeGroup, the multiple ignitions over a single day represent a \u0026#34;significant advancement in the engine’s development.\u0026#34; Prometheus will initially power the Themis demonstrator (see item above). Its first commercial application will be the two-stage Maia rocket, developed by MaiaSpace, an ArianeGroup subsidiary.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo you want to buy SpaceX tokens\u003c/strong\u003e? SpaceX remains a privately held company, which means that us mere mortals cannot invest in the launch firm. (To be clear, as a space reporter, I do not invest in any space companies. To do so would be unethical.) The \u003ca href=\"https://messaging-custom-newsletters.nytimes.com/dynamic/render?uri=nyt%3A%2F%2Fnewsletter%2F53fa1077-3d6f-54cb-a9e6-0331a3e38ee4\u0026amp;sendId=201161\u0026amp;productCode=DK\u0026amp;paid_regi=1\u0026amp;isViewInBrowser=true\"\u003eDealBook newsletter has a report\u003c/a\u003e on a new trend in \u0026#34;tokens\u0026#34; that allows ordinary investors to invest in privately traded companies, including SpaceX.\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003eNot technically equity\u003c/em\u003e ... Vlad Tenev, Robinhood’s chief executive, said that the tokens are not technically \u0026#34;equity,\u0026#34; but that they \u0026#34;effectively give retail investors exposure to these private assets.\u0026#34; Robinhood isn’t alone: The startup Republic is offering tokens meant to track the equity performance of SpaceX. Those will be sold to US investors via a loophole in a 2012 securities law. However, DealBook warns, unregulated private-company tokens could lead to a fragmented and less transparent ecosystem for investments, making it harder for regulators to protect the public.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"560\" height=\"81\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/heavyl.png\" alt=\"\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/heavyl.png 560w, https://cdn.arstechnica.net/wp-content/uploads/2018/05/heavyl-300x43.png 300w\" sizes=\"(max-width: 560px) 100vw, 560px\"/\u003e\n                  \u003c/p\u003e\n                \u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eTexas politicians seek to move shuttle \u003cem\u003eDiscovery\u003c/em\u003e\u003c/strong\u003e. This week, a political effort to relocate the space shuttle \u003cem\u003eDiscovery\u003c/em\u003e from the Smithsonian to Space Center Houston has been merged with the so-called \u0026#34;One Big Beautiful Bill,\u0026#34; which the US Senate passed on Tuesday, \u003ca href=\"https://arstechnica.com/space/2025/06/relocation-of-space-shuttle-discovery-may-hinge-on-big-beautiful-bill/\"\u003eArs reports\u003c/a\u003e. Among the bill\u0026#39;s many provisions is $85 million for the Bring the Space Shuttle Home Act. Sponsored by US Sen John Cornyn, R–Texas, the bill calls for Discovery to be removed from its home of the past 13 years, the National Air and Space Museum\u0026#39;s Steven F. Udvar-Hazy Center in Chantilly, Virginia, and put it on display at Space Center Houston, the official visitor complex for NASA\u0026#39;s Johnson Space Center in Texas.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u003cem\u003eUnderestimating transport costs\u003c/em\u003e ... The Senate version of the bill provides \u0026#34;no less than $5 million\u0026#34; for the \u0026#34;transportation of the space vehicle\u0026#39;\u0026#39; and the remainder to go toward the construction of a facility to house it. The original text of the Bring the Space Shuttle Home Act called for the NASA administrator and the Smithsonian to jointly develop a plan for moving \u003cem\u003eDiscovery\u003c/em\u003e prior to appropriations being made by Congress. It is unclear whether the total amount allocated by the Senate would be enough; the National Air and Space Museum provided Congress with an estimate of $200 million to $300 million for the move. Speaking frankly, and as a resident of Houston, this bill is absurd, and the shuttle \u003cem\u003eDiscovery\u003c/em\u003e absolutely belongs in the Smithsonian. NASA is being told to cut science missions left and right, but funding can be found for this?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNext New Glenn launch will target Mars\u003c/strong\u003e. Blue Origin is making steady progress toward the second launch of its New Glenn rocket, which could occur sometime this fall, \u003ca href=\"https://arstechnica.com/space/2025/06/the-second-launch-of-new-glenn-will-aim-for-mars/\"\u003eArs reports\u003c/a\u003e. Publicly, the company has said this second launch will take place no earlier than August 15. This is now off the table. One source told Ars that a mid- to late-September launch date was \u0026#34;realistic,\u0026#34; but another person said late October or November was more likely.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA big landing on tap\u003c/em\u003e ... Blue Origin has been mum about the payload that will fly on this rocket, but multiple people have told Ars that the current plan is to launch NASA\u0026#39;s ESCAPADE mission on the second launch of New Glenn. This mission encompasses a pair of small spacecraft that will be sent to Mars to study the red planet\u0026#39;s magnetosphere. After ESCAPADE, Blue Origin has several missions tentatively plotted out. A much-anticipated mission to land Blue Origin\u0026#39;s Mk1 lander on the Moon could take place during the first half of next year.\u003c/p\u003e\n\u003ch2\u003eNext three launches\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eJuly 3:\u003c/strong\u003e Soyuz 2.1a | Progress MS-31 | Baikonur Cosmodrome, Kazakhstan | 19:32 UTC\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJuly 8:\u003c/strong\u003e Falcon 9 | Starlink 10-28 | Cape Canaveral Space Force Station, Florida | 05:48 UTC\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJuly 15:\u003c/strong\u003e Eris | Initial test flight | Bowen Orbital Spaceport, Australia | 21:30 UTC\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"120\" height=\"120\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/rocket.png\" alt=\"\"/\u003e\n                  \u003c/p\u003e\n                \u003c/figure\u003e\n\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/ericberger/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/05/e.berger-45959.jpg\" alt=\"Photo of Eric Berger\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Eric Berger is the senior space editor at Ars Technica, covering everything from astronomy to private space to NASA policy, and author of two books: \u003ca href=\"https://www.harpercollins.com/products/liftoff-eric-berger?variant=32126620205090\"\u003e\u003ci\u003eLiftoff\u003c/i\u003e\u003c/a\u003e, about the rise of SpaceX; and \u003ca href=\"https://benbellabooks.com/shop/reentry/\"\u003e\u003ci\u003eReentry\u003c/i\u003e\u003c/a\u003e, on the development of the Falcon 9 rocket and Dragon. A certified meteorologist, Eric lives in Houston.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/space/2025/07/rocket-report-japans-workhorse-booster-takes-a-bow-you-can-invest-in-spacex-now/#comments\" title=\"128 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    128 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/health/2025/07/man-fails-to-take-his-medicine-the-flesh-starts-rotting-off-his-leg/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-1672955998-768x432.jpg\" alt=\"Listing image for first story in Most Read: Man’s ghastly festering ulcer stumps doctors—until they cut out a wedge of flesh\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-07-04T11:00:22Z",
  "modifiedTime": "2025-07-03T17:59:22Z"
}
