{
  "id": "01d354c8-41b5-42d4-9839-126a2f687d8f",
  "title": "Scammers Use Venmo To 'Deceive and Defraud Customers' On Flights",
  "link": "https://news.slashdot.org/story/25/01/23/2259248/scammers-use-venmo-to-deceive-and-defraud-customers-on-flights?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "An anonymous reader quotes a report from SFGATE: The same morning that JetBlue Airways announced that it was the first airline partnering with Venmo to begin accepting payments for booking flights, an account on the popular payment platform was already raking in money. A Venmo user named Owen Miller paid the JetBlue Checkpoint Store for a drink on Wednesday morning, which is a typical transaction between a traveler and airline, except for the fact that JetBlue doesn't operate that account. \"At this time, JetBlue does not accept Venmo payment for inflight purchases such as food and beverages,\" a representative for the airline told SFGATE in an email. \"Unfortunately, we have seen accounts falsely representing themselves as JetBlue to deceive and defraud customers.\" To stay safe from scammers when booking JetBlue flights with Venmo, the airline recommends customers only use verified JetBlue channels, such as their official website or app, and follow their secure payment process using the provided QR code. JetBlue said it plans to fold Venmo payments into its mobile app later this year. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-01-23T23:40:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "money"
  ],
  "byline": "",
  "length": 1,
  "excerpt": "×",
  "siteName": "",
  "favicon": "https://a.fsdn.com/sd/m/assets/apple-touch-icon-precomposed2X-e553cba2892b057428cabcdff1a372fc.png",
  "text": "×",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\n\n\u003cdiv id=\"ccpa-modal\"\u003e\n        \u003cp\u003e\u003cspan id=\"modal-close\"\u003e×\u003c/span\u003e\u003c/p\u003e\n    \u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
