{
  "id": "06b85a53-9050-4809-9274-b717ac521c9e",
  "title": "Q2 earnings call: CEO’s remarks",
  "link": "https://blog.google/inside-google/message-ceo/alphabet-earnings-q2-2025/",
  "description": "Read Google and Alphabet CEO Sundar Pichai's remarks from the Q2 2025 earnings call.",
  "author": "Sundar PichaiCEO of Google and Alphabet",
  "published": "Wed, 23 Jul 2025 20:43:00 +0000",
  "source": "https://www.blog.google/rss/",
  "categories": [
    "A message from our CEO",
    "Alphabet"
  ],
  "byline": "Sundar Pichai",
  "length": 10468,
  "excerpt": "Read Google and Alphabet CEO Sundar Pichai's remarks from the Q2 2025 earnings call.",
  "siteName": "Google",
  "favicon": "https://blog.google/static/blogv2/images/apple-touch-icon.png?version=pr20250710-1658",
  "text": "In this story Introduction Full stack approach to AI Search Google Cloud YouTube Waymo Q2 was a standout quarter for us, with robust growth across the company. As you saw at I/O, we are leading at the frontier of AI and shipping at an incredible pace. AI is positively impacting every part of the business, driving strong momentum.This quarter:Search delivered double-digit revenue growth. Our new Search features continue to perform well. AI Mode has launched in the U.S. and India, and is going well, while AI Overviews now has over 2 billion monthly users across more than 200 countries and territories and 40 languages. I’ll give some more details on Search in a moment.We continue to see strong performance in YouTube as well as subscriptions, reflecting great momentum across these high-growth businesses. In the U.S., Shorts now earn as much revenue per watchhour as traditional instream on YouTube. And in some countries, it now even exceeds instream's rate.Cloud had another great quarter of strong growth in revenues, backlog and profitability. Its annual revenue run-rate is now more than $50 billion. We are seeing significant demand for our comprehensive AI product portfolio. A full-stack approach to AIOf course, this is all possible because of the long-term investments we've made in our differentiated, full-stack approach to AI. This spans AI infrastructure; world-class research, models and tooling; and our products and platforms that bring AI to people all over the world.I’ll briefly touch on the AI stack, before turning to quarterly highlights.AI infrastructureFirst, AI infrastructure. We operate the leading global network of AI optimized data centers and cloud regions.We also offer the industry's widest range of TPUs and GPUs, along with storage and software built on top.That’s why nearly all gen AI unicorns use Google Cloud. And it’s why a growing number, including leading AI research labs like Safe Super Intelligence and Physical Intelligence, use TPUs specifically.Our AI infrastructure investments are crucial to meeting the growth in demand from Cloud customers.World-class AI researchNext, world-class AI research, including models and tooling.We continue to expand our Gemini 2.5 family of hybrid reasoning models, which provide industry-leading performance in nearly every major benchmark.In addition to improving our popular workhorse model, Flash, we debuted an extremely fast “Flash-Lite” version.We achieved gold-medal level performance in the International Mathematical Olympiad, using an advanced version of Gemini with Deep Think. We can't wait to bring Deep Think to users soon.We have some of the best models available today at every price point. Our 2.5 models have been a catalyst for growth, and 9 million developers have now built with Gemini.I also want to mention Veo 3, our state-of-the-art video generation model. It’s been a viral hit, with people sharing clips created in the Gemini App, and with our new AI filmmaking tool, Flow. Since May, over 70 million videos have been generated using Veo 3.And we recently introduced a feature in the Gemini App to turn photos into videos, which people absolutely love. It’s also rolling out to Google Photos users starting today.Products and platformsThird, our products and platforms. We are bringing AI to all our users and partners through surfaces like Workspace, Chrome and more. The growth in usage has been incredible.At I/O in May, we announced that we processed 480 trillion monthly tokens across our surfaces. Since then we have doubled that number, now processing over 980 trillion monthly tokens, a remarkable increase.The Gemini App now has more than 450 million monthly active users, and we continue to see strong growth and engagement, with daily requests growing over 50% from Q1.In June alone, over 50 million people used AI-powered meeting notes in Google Meet.And powered by Veo 3, our new short video product in Workspace called Google Vids reached nearly 1 million monthly active users.This month at Samsung Galaxy Unpacked we announced new Android and AI features that are available on Samsung's latest devices.And we’re really pleased with the growth in Subscriptions, which got a boost from our Google AI Pro and new Google AI Ultra plans.Now, some key highlights from Search, Cloud, YouTube and Waymo for the quarter. SearchFirst up, this is an incredibly exciting moment for Search.We see AI powering an expansion in how people are searching for and accessing information, unlocking completely new kinds of questions you can ask Google.Overall queries and commercial queries on Search continued to grow year over year. And our new AI experiences significantly contributed to this increase in usage.We are also seeing that our AI features cause users to search more as they learn that Search can meet more of their needs. That’s especially true for younger users.Let me go deeper on our new Search experiences:We know how popular AI Overviews are because they are now driving over 10% more queries globally for the types of queries that show them, and this growth continues to increase over time. AI Overviews are now powered by Gemini 2.5, delivering the fastest AI responses in the industry.We also saw strong growth in the use of multi-modal Search, particularly the combination of Lens or Circle to Search, together with AI Overviews. This growth was most pronounced among younger users.Our new end-to-end AI Search experience, AI Mode, continues to receive very positive feedback — particularly for longer and more complex questions. It’s still rolling out, but already has over 100 million monthly active users in the U.S. and India.We plan to keep enhancing the AI Mode experience for users by shipping great features, fast. That includes our advanced research tool Deep Search and more personalized responses. Google CloudNext, Google Cloud. We see strong customer demand, driven by our product differentiation and our comprehensive AI product portfolio. Four stats show this:The number of deals over $250 million, doubling year-over-year.In the first half of 2025, we signed the same number of deals over $1 billion that we did in all of 2024.The number of new GCP customers increased by nearly 28%, quarter-over-quarter.More than 85,000 enterprises, including LVMH, Salesforce and Singapore’s DBS Bank, now build with Gemini — driving a 35x growth in Gemini usage year-over-year.Our models are served on our AI infrastructure, which offers industry-leading performance and cost efficiency for both training and inference.Along with our AI accelerators, we introduced new innovations in storage, including Anywhere Cache, which improves inference latency by up to 70%, and Rapid Storage, which delivers a 5x improvement in latency compared to leading hyperscalers.In addition, we have optimized AI software packages, including PyTorch and JAX, with full open source supports for various AI training and serving demands.We have also integrated AI agents deeply into each of our Cloud products:Wayfair is leveraging our Databases integrated with AI to streamline data pipelines and deliver more personalized customer experiences.Mattel is leveraging our Gemini-powered Data Agents and Big Query to review and act on product feedback more quickly.Target is using our Gemini-powered Threat Intelligence and Security Operations Agents to improve cybersecurity.Capgemini is utilizing our AI Software Engineering Agents to deliver higher quality software faster by automating tasks, from code generation to testing.And BBVA says Gemini in Google Workspace is saving employees nearly three hours per week by automating repetitive tasks — it is now rolling it out to 100,000 employees globally.We are also focused on building a flourishing AI agent ecosystem. We introduced an open source Agent Development Kit which now has over a million downloads in less than four months. We also introduced Agentspace, an open and interoperable enterprise chat, search, and agent platform. Gordon Food Service is bringing Agentspace to its U.S. employees, which is enabling better, more efficient decision-making. And over 1 million subscriptions have been booked for Agentspace ahead of its general availability. YouTubeTurning now to YouTube. Nielsen data shows YouTube has led U.S. streaming watch time for over two years. A generation that grew up with YouTube on their devices is now increasingly watching their favorite creators and content on their televisions.That includes billions of sports fans, too. Globally they consume more than 40 billion hours of sports content on YouTube annually. And in September, we’ll stream the NFL's first Friday game of the season, live from Brazil.From sports to Shorts: We now average over 200 billion daily views on YouTube Shorts.AI is helping improve our recommendations and Auto Dubbing, which translates to better returns for creators and brands by dramatically increasing the potential audiences they can reach. And today, we began rolling out a whole raft of new AI tools for creators on YouTube Shorts.Finally, YouTube continues to diversify its subscription options, recently expanding its Premium Lite offerings to 15 new countries, with more to come. WaymoAnd lastly, Waymo continues to scale and expand to safely serve more riders in more places.Last month, Waymo launched in Atlanta, more than doubled its Austin service territory, and expanded its Los Angeles and San Francisco Bay Area territories by approximately 50%.Waymo also launched Teen Accounts, starting with riders aged 14-17 in Phoenix.Overall, great momentum here: The Waymo Driver has now autonomously driven over 100 million miles on public roads. And the team is testing across more than 10 cities this year including New York and Philadelphia. We hope to serve riders in all 10 in the future.As I said, a standout quarter. A big thank you, as always, to our employees and partners for an amazing Q2.",
  "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Earnings-Q2-Keyword_Social_Share.width-1300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\n    \n    \n\n\n\n\n\n    \n\n    \n      \n\n\n\n\n\n\n\n\n\n\n    \n\n    \n      \n\n    \n\n    \n    \u003cdiv\u003e\n        \n          \n            \u003cdiv data-component=\"uni-article-jumplinks\" data-analytics-module=\"{\n    \u0026#34;module_name\u0026#34;: \u0026#34;Article Jumplinks\u0026#34;,\n    \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n  }\"\u003e\n  \u003cnav aria-label=\"Article Jumplinks\"\u003e\n    \u003cp\u003e\u003cspan\u003eIn this story\u003c/span\u003e\n    \u003c/p\u003e\n    \n    \n    \u003cdiv\u003e\n      \u003cul id=\"article-jumplinks__list\"\u003e\n        \n        \u003cli\u003e\n          \u003ca aria-label=\"link to Introduction\" href=\"#introduction\" id=\"introduction-anchor\"\u003eIntroduction\u003c/a\u003e\n        \u003c/li\u003e\n        \n        \u003cli\u003e\n          \u003ca aria-label=\"link to Full stack approach to AI\" href=\"#ai-stack\" id=\"ai-stack-anchor\"\u003eFull stack approach to AI\u003c/a\u003e\n        \u003c/li\u003e\n        \n        \u003cli\u003e\n          \u003ca aria-label=\"link to Search\" href=\"#search\" id=\"search-anchor\"\u003eSearch\u003c/a\u003e\n        \u003c/li\u003e\n        \n        \u003cli\u003e\n          \u003ca aria-label=\"link to Google Cloud\" href=\"#google-cloud\" id=\"google-cloud-anchor\"\u003eGoogle Cloud\u003c/a\u003e\n        \u003c/li\u003e\n        \n        \u003cli\u003e\n          \u003ca aria-label=\"link to YouTube\" href=\"#youtube\" id=\"youtube-anchor\"\u003eYouTube\u003c/a\u003e\n        \u003c/li\u003e\n        \n        \u003cli\u003e\n          \u003ca aria-label=\"link to Waymo\" href=\"#waymo\" id=\"waymo-anchor\"\u003eWaymo\u003c/a\u003e\n        \u003c/li\u003e\n        \n      \u003c/ul\u003e\n    \u003c/div\u003e\n    \n  \u003c/nav\u003e\n\u003c/div\u003e\n          \n          \n          \u003cdiv data-reading-time=\"true\" data-component=\"uni-article-body\"\u003e\n\n            \n              \n\n\n\n\n\n\u003cuni-article-speakable page-title=\"Q2 earnings call: CEO’s remarks\" listen-to-article=\"Listen to article\" data-date-modified=\"2025-07-23T20:43:57.252093+00:00\" data-tracking-ids=\"G-HGNBTNCHCQ,G-6NKTLKV14N\" data-voice-list=\"en.ioh-pngnat:Cyan,en.usb-pngnat:Lime\" data-script-src=\"https://www.gstatic.com/readaloud/player/web/api/js/api.js\"\u003e\u003c/uni-article-speakable\u003e\n\n            \n\n            \n            \n\n\n  \n    \n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" role=\"presentation\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"jf8p7\"\u003eQ2 was a standout quarter for us, with robust growth across the company. As you saw at I/O, we are leading at the frontier of AI and shipping at an incredible pace. AI is positively impacting every part of the business, driving strong momentum.\u003c/p\u003e\u003cp data-block-key=\"5mbfd\"\u003eThis quarter:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"cv68q\"\u003e\u003cb\u003eSearch delivered double-digit revenue growth\u003c/b\u003e. Our new Search features continue to perform well. AI Mode has launched in the U.S. and India, and is going well, while AI Overviews now has over 2 billion monthly users across more than 200 countries and territories and 40 languages. I’ll give some more details on Search in a moment.\u003c/li\u003e\u003cli data-block-key=\"2j4l6\"\u003e\u003cb\u003eWe continue to see strong performance in YouTube as well as subscriptions\u003c/b\u003e, reflecting great momentum across these high-growth businesses. In the U.S., Shorts now earn as much revenue per watchhour as traditional instream on YouTube. And in some countries, it now even exceeds instream\u0026#39;s rate.\u003c/li\u003e\u003cli data-block-key=\"84c70\"\u003e\u003cb\u003eCloud had another great quarter of strong growth in revenues, backlog and profitability.\u003c/b\u003e Its annual revenue run-rate is now more than $50 billion. We are seeing significant demand for our comprehensive AI product portfolio.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n  \n\n  \n    \n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" role=\"presentation\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n         }\"\u003e\u003ch2 data-block-key=\"jf8p7\"\u003e\u003cb\u003eA full-stack approach to AI\u003c/b\u003e\u003c/h2\u003e\u003cp data-block-key=\"bq6ke\"\u003eOf course, this is all possible because of the long-term investments we\u0026#39;ve made in our differentiated, full-stack approach to AI. This spans AI infrastructure; world-class research, models and tooling; and our products and platforms that bring AI to people all over the world.\u003c/p\u003e\u003cp data-block-key=\"3l062\"\u003eI’ll briefly touch on the AI stack, before turning to quarterly highlights.\u003c/p\u003e\u003ch3 data-block-key=\"9bblg\"\u003e\u003cb\u003eAI infrastructure\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"5alqf\"\u003eFirst, AI infrastructure. We operate the leading global network of AI optimized data centers and cloud regions.\u003c/p\u003e\u003cp data-block-key=\"4nlud\"\u003eWe also offer the industry\u0026#39;s widest range of TPUs and GPUs, along with storage and software built on top.\u003c/p\u003e\u003cp data-block-key=\"3n330\"\u003eThat’s why nearly all gen AI unicorns use Google Cloud. And it’s why a growing number, including leading AI research labs like Safe Super Intelligence and Physical Intelligence, use TPUs specifically.\u003c/p\u003e\u003cp data-block-key=\"72g64\"\u003eOur AI infrastructure investments are crucial to meeting the growth in demand from Cloud customers.\u003c/p\u003e\u003ch3 data-block-key=\"butjj\"\u003e\u003cb\u003eWorld-class AI research\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"bundg\"\u003eNext, world-class AI research, including models and tooling.\u003c/p\u003e\u003cp data-block-key=\"4mtpk\"\u003eWe continue to expand our Gemini 2.5 family of hybrid reasoning models, which provide industry-leading performance in nearly every major benchmark.\u003c/p\u003e\u003cp data-block-key=\"7h0kj\"\u003eIn addition to improving our popular workhorse model, Flash, we debuted an extremely fast “Flash-Lite” version.\u003c/p\u003e\u003cp data-block-key=\"7d1rc\"\u003eWe achieved gold-medal level performance in the International Mathematical Olympiad, using an advanced version of Gemini with Deep Think. We can\u0026#39;t wait to bring Deep Think to users soon.\u003c/p\u003e\u003cp data-block-key=\"dgt49\"\u003eWe have some of the best models available today at every price point. Our 2.5 models have been a catalyst for growth, and 9 million developers have now built with Gemini.\u003c/p\u003e\u003cp data-block-key=\"dgikq\"\u003eI also want to mention Veo 3, our state-of-the-art video generation model. It’s been a viral hit, with people sharing clips created in the Gemini App, and with our new AI filmmaking tool, Flow. Since May, over 70 million videos have been generated using Veo 3.\u003c/p\u003e\u003cp data-block-key=\"dj1a3\"\u003eAnd we recently introduced a feature in the Gemini App to turn photos into videos, which people absolutely love. It’s also rolling out to Google Photos users starting today.\u003c/p\u003e\u003ch3 data-block-key=\"27dna\"\u003e\u003cb\u003eProducts and platforms\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"7a7sj\"\u003eThird, our products and platforms. We are bringing AI to all our users and partners through surfaces like Workspace, Chrome and more. The growth in usage has been incredible.\u003c/p\u003e\u003cp data-block-key=\"1vfgg\"\u003eAt I/O in May, we announced that we processed 480 trillion monthly tokens across our surfaces. Since then we have doubled that number, now processing over 980 trillion monthly tokens, a remarkable increase.\u003c/p\u003e\u003cp data-block-key=\"dl9m7\"\u003eThe Gemini App now has more than 450 million monthly active users, and we continue to see strong growth and engagement, with daily requests growing over 50% from Q1.\u003c/p\u003e\u003cp data-block-key=\"9036c\"\u003eIn June alone, over 50 million people used AI-powered meeting notes in Google Meet.\u003c/p\u003e\u003cp data-block-key=\"9e1ch\"\u003eAnd powered by Veo 3, our new short video product in Workspace called Google Vids reached nearly 1 million monthly active users.\u003c/p\u003e\u003cp data-block-key=\"3dj86\"\u003eThis month at Samsung Galaxy Unpacked we announced new Android and AI features that are available on Samsung\u0026#39;s latest devices.\u003c/p\u003e\u003cp data-block-key=\"9croc\"\u003eAnd we’re really pleased with the growth in Subscriptions, which got a boost from our Google AI Pro and new Google AI Ultra plans.\u003c/p\u003e\u003cp data-block-key=\"95edm\"\u003eNow, some key highlights from Search, Cloud, YouTube and Waymo for the quarter.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" role=\"presentation\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n         }\"\u003e\u003ch2 data-block-key=\"ixhic\"\u003e\u003cb\u003eSearch\u003c/b\u003e\u003c/h2\u003e\u003cp data-block-key=\"aigpu\"\u003eFirst up, this is an incredibly exciting moment for Search.\u003c/p\u003e\u003cp data-block-key=\"6qak9\"\u003eWe see AI powering an expansion in how people are searching for and accessing information, unlocking completely new kinds of questions you can ask Google.\u003c/p\u003e\u003cp data-block-key=\"f5cd8\"\u003eOverall queries and commercial queries on Search continued to grow year over year. And our new AI experiences significantly contributed to this increase in usage.\u003c/p\u003e\u003cp data-block-key=\"ffv1\"\u003eWe are also seeing that our AI features cause users to search more as they learn that Search can meet more of their needs. That’s especially true for younger users.\u003c/p\u003e\u003cp data-block-key=\"2772b\"\u003eLet me go deeper on our new Search experiences:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"dr6l7\"\u003eWe know how popular AI Overviews are because they are now driving over 10% more queries globally for the types of queries that show them, and this growth continues to increase over time. AI Overviews are now powered by Gemini 2.5, delivering the fastest AI responses in the industry.\u003c/li\u003e\u003cli data-block-key=\"fnc7q\"\u003eWe also saw strong growth in the use of multi-modal Search, particularly the combination of Lens or Circle to Search, together with AI Overviews. This growth was most pronounced among younger users.\u003c/li\u003e\u003cli data-block-key=\"9tmej\"\u003eOur new end-to-end AI Search experience, AI Mode, continues to receive very positive feedback — particularly for longer and more complex questions. It’s still rolling out, but already has over 100 million monthly active users in the U.S. and India.\u003c/li\u003e\u003cli data-block-key=\"f2cdf\"\u003eWe plan to keep enhancing the AI Mode experience for users by shipping great features, fast. That includes our advanced research tool Deep Search and more personalized responses.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n  \n\n  \n    \n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" role=\"presentation\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n         }\"\u003e\u003ch2 data-block-key=\"ixhic\"\u003e\u003cb\u003eGoogle Cloud\u003c/b\u003e\u003c/h2\u003e\u003cp data-block-key=\"bfjr0\"\u003eNext, Google Cloud. We see strong customer demand, driven by our product differentiation and our comprehensive AI product portfolio. Four stats show this:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"6649v\"\u003eThe number of deals over $250 million, doubling year-over-year.\u003c/li\u003e\u003cli data-block-key=\"b0r06\"\u003eIn the first half of 2025, we signed the same number of deals over $1 billion that we did in all of 2024.\u003c/li\u003e\u003cli data-block-key=\"c12os\"\u003eThe number of new GCP customers increased by nearly 28%, quarter-over-quarter.\u003c/li\u003e\u003cli data-block-key=\"d2rel\"\u003eMore than 85,000 enterprises, including LVMH, Salesforce and Singapore’s DBS Bank, now build with Gemini — driving a 35x growth in Gemini usage year-over-year.\u003c/li\u003e\u003c/ul\u003e\u003cp data-block-key=\"7q1l8\"\u003eOur models are served on our AI infrastructure, which offers industry-leading performance and cost efficiency for both training and inference.\u003c/p\u003e\u003cp data-block-key=\"b7i0c\"\u003eAlong with our AI accelerators, we introduced new innovations in storage, including Anywhere Cache, which improves inference latency by up to 70%, and Rapid Storage, which delivers a 5x improvement in latency compared to leading hyperscalers.\u003c/p\u003e\u003cp data-block-key=\"7et7\"\u003eIn addition, we have optimized AI software packages, including PyTorch and JAX, with full open source supports for various AI training and serving demands.\u003c/p\u003e\u003cp data-block-key=\"4pa73\"\u003eWe have also integrated AI agents deeply into each of our Cloud products:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"9rtpl\"\u003eWayfair is leveraging our Databases integrated with AI to streamline data pipelines and deliver more personalized customer experiences.\u003c/li\u003e\u003cli data-block-key=\"6cqbb\"\u003eMattel is leveraging our Gemini-powered Data Agents and Big Query to review and act on product feedback more quickly.\u003c/li\u003e\u003cli data-block-key=\"9aqma\"\u003eTarget is using our Gemini-powered Threat Intelligence and Security Operations Agents to improve cybersecurity.\u003c/li\u003e\u003cli data-block-key=\"8s9ro\"\u003eCapgemini is utilizing our AI Software Engineering Agents to deliver higher quality software faster by automating tasks, from code generation to testing.\u003c/li\u003e\u003cli data-block-key=\"8r7th\"\u003eAnd BBVA says Gemini in Google Workspace is saving employees nearly three hours per week by automating repetitive tasks — it is now rolling it out to 100,000 employees globally.\u003c/li\u003e\u003c/ul\u003e\u003cp data-block-key=\"2jleq\"\u003eWe are also focused on building a flourishing AI agent ecosystem. We introduced an open source Agent Development Kit which now has over a million downloads in less than four months. We also introduced Agentspace, an open and interoperable enterprise chat, search, and agent platform. Gordon Food Service is bringing Agentspace to its U.S. employees, which is enabling better, more efficient decision-making. And over 1 million subscriptions have been booked for Agentspace ahead of its general availability.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" role=\"presentation\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n         }\"\u003e\u003ch2 data-block-key=\"ixhic\"\u003e\u003cb\u003eYouTube\u003c/b\u003e\u003c/h2\u003e\u003cp data-block-key=\"12kpl\"\u003eTurning now to YouTube. Nielsen data shows YouTube has led U.S. streaming watch time for over two years. A generation that grew up with YouTube on their devices is now increasingly watching their favorite creators and content on their televisions.\u003c/p\u003e\u003cp data-block-key=\"8ekbi\"\u003eThat includes billions of sports fans, too. Globally they consume more than 40 billion hours of sports content on YouTube annually. And in September, we’ll stream the NFL\u0026#39;s first Friday game of the season, live from Brazil.\u003c/p\u003e\u003cp data-block-key=\"4pgvl\"\u003eFrom sports to Shorts: We now average over 200 billion daily views on YouTube Shorts.\u003c/p\u003e\u003cp data-block-key=\"ajg9u\"\u003eAI is helping improve our recommendations and Auto Dubbing, which translates to better returns for creators and brands by dramatically increasing the potential audiences they can reach. And today, we began rolling out a whole raft of new AI tools for creators on YouTube Shorts.\u003c/p\u003e\u003cp data-block-key=\"1vsed\"\u003eFinally, YouTube continues to diversify its subscription options, recently expanding its Premium Lite offerings to 15 new countries, with more to come.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" role=\"presentation\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Q2 earnings call: CEO’s remarks\u0026#34;\n         }\"\u003e\u003ch2 data-block-key=\"ixhic\"\u003e\u003cb\u003eWaymo\u003c/b\u003e\u003c/h2\u003e\u003cp data-block-key=\"1l19u\"\u003eAnd lastly, Waymo continues to scale and expand to safely serve more riders in more places.\u003c/p\u003e\u003cp data-block-key=\"m3q2\"\u003eLast month, Waymo launched in Atlanta, more than doubled its Austin service territory, and expanded its Los Angeles and San Francisco Bay Area territories by approximately 50%.\u003c/p\u003e\u003cp data-block-key=\"6t57m\"\u003eWaymo also launched Teen Accounts, starting with riders aged 14-17 in Phoenix.\u003c/p\u003e\u003cp data-block-key=\"8chen\"\u003eOverall, great momentum here: The Waymo Driver has now autonomously driven over 100 million miles on public roads. And the team is testing across more than 10 cities this year including New York and Philadelphia. We hope to serve riders in all 10 in the future.\u003c/p\u003e\u003chr/\u003e\u003cp data-block-key=\"arj7r\"\u003eAs I said, a standout quarter. A big thank you, as always, to our employees and partners for an amazing Q2.\u003c/p\u003e\u003c/div\u003e\n  \n\n\n            \n            \n\n            \n              \n\n\n\n\n            \n          \u003c/div\u003e\n        \n      \u003c/div\u003e\n  \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-07-23T20:43:00Z",
  "modifiedTime": null
}
