{
  "id": "08f598de-52a8-4b9a-9eb4-849b6be935ec",
  "title": "Stratechery Plus + Asianometry",
  "link": "https://stratechery.com/2025/stratechery-plus-asianometry/",
  "description": "Stratechery Plus adds Asianometry",
  "author": "Ben Thompson",
  "published": "Mon, 20 Jan 2025 16:16:26 +0000",
  "source": "http://stratechery.com/feed/",
  "categories": [
    "Announcements"
  ],
  "byline": "",
  "length": 2202,
  "excerpt": "Stratechery Plus adds Asianometry",
  "siteName": "Stratechery by Ben Thompson",
  "favicon": "https://i0.wp.com/stratechery.com/wp-content/uploads/2018/03/cropped-android-chrome-512x512-1.png?fit=180%2C180\u0026ssl=1",
  "text": "Back in 2022, I rebranded a Stratechery subscription as Stratechery Plus, a bundle of content that would enhance the value of your subscription; today the bundle includes: The Stratechery Update The Stratechery Interview series The Sharp Tech with Ben Thompson podcast, hosted by Andrew Sharp The Sharp China with Bill Bishop podcast, hosted by Andrew Sharp The Dithering podcast, with John Gruber and myself The Greatest of All Talk podcast, with Ben Golliver and Andrew Sharp Today I am excited to announce a new addition: the Asianometry newsletter and podcast, by Jon Yu. Asianometry is one of the best tech YouTube channels in existence, with over 768,000 subscribers. Jon produces in-depth videos explaining every aspect of technology, with a particular expertise in semiconductors. To give you an idea of Jon’s depth, he has made 31 videos about TSMC alone. His semiconductor course includes 30 videos covering everything from designing chips to how ASML builds EUV machines to Moore’s Law. His video on the end of Dennard’s Law is a particular standout: Jon is about more than semiconductors though: he’s made videos about other tech topics like The Tragedy of Compaq, and non-tech topics like Japanese Whisky and Taiwan convenience stores. In short, Jon is an intensely curious person who does his research, and we are blessed that he puts in the work to share what he learns. I am blessed most of all, however. Over the last year Jon has been making Stratechery Articles into video essays and cutting clips for Sharp Tech; he did a great job with one of my favorite articles of 2024: And now, starting today, Stratechery Plus subscribers can get exclusive access to Asianometry’s content in newsletter and podcast form. The Asianometry YouTube Channel will remain free and Jon’s primary focus, but from now on all of his content will be simultaneously released as a transcript and podcast. Stratechery Plus subscribers can head over to the new Asianometry Passport site to subscribe to his emails, or to add the podcast feed to your favorite podcast player. And, of course, subscribe to Jon’s YouTube channel, along with Stratechery Plus.",
  "image": "https://149384716.v2.pressablecdn.com/wp-content/uploads/2025/01/asianometry-1-1024x1024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003ca href=\"https://stratechery.com/2022/sharp-tech-and-stratechery-plus/\"\u003eBack in 2022\u003c/a\u003e, I rebranded a Stratechery subscription as Stratechery Plus, a bundle of content that would enhance the value of your subscription; today the bundle includes:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe \u003ca href=\"https://stratechery.com/category/daily-email/\"\u003eStratechery Update\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003ca href=\"https://stratechery.com/topic/events/interview/\"\u003eStratechery Interview\u003c/a\u003e series\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003ca href=\"https://sharptech.fm/member\"\u003eSharp Tech with Ben Thompson\u003c/a\u003e podcast, hosted by Andrew Sharp\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003ca href=\"https://sharpchina.fm/member\"\u003eSharp China with Bill Bishop\u003c/a\u003e podcast, hosted by Andrew Sharp\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003ca href=\"https://dithering.fm/\"\u003eDithering\u003c/a\u003e podcast, with \u003ca href=\"https://daringfireball.net/\"\u003eJohn Gruber\u003c/a\u003e and myself\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003ca href=\"https://goat.passport.online/member\"\u003eGreatest of All Talk\u003c/a\u003e podcast, with Ben Golliver and Andrew Sharp\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eToday I am excited to announce a new addition: the \u003ca href=\"https://asianometry.passport.online/member/\"\u003eAsianometry\u003c/a\u003e newsletter and podcast, by Jon Yu.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" height=\"1024\" width=\"1024\" decoding=\"async\" src=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/01/asianometry-1.png?resize=1024%2C1024\u0026amp;ssl=1\" alt=\"\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAsianometry is \u003ca href=\"https://www.youtube.com/@Asianometry\"\u003eone of the best tech YouTube channels in existence\u003c/a\u003e, with over 768,000 subscribers. Jon produces in-depth videos explaining every aspect of technology, with a particular expertise in semiconductors. To give you an idea of Jon’s depth, he has made \u003ca href=\"https://www.youtube.com/playlist?list=PLKtxx9TnH76SRC7ZbOu2Nsg5mC72fy-GZ\"\u003e31 videos about TSMC alone\u003c/a\u003e. His \u003ca href=\"https://www.youtube.com/playlist?list=PLKtxx9TnH76QY5FjmO3NaUkVJvTPN9Vmg\"\u003esemiconductor course\u003c/a\u003e includes 30 videos covering everything from \u003ca href=\"https://www.youtube.com/watch?v=ihz2WY-E2C8\u0026amp;list=PLKtxx9TnH76QY5FjmO3NaUkVJvTPN9Vmg\u0026amp;index=2\u0026amp;pp=iAQB\"\u003edesigning chips\u003c/a\u003e to \u003ca href=\"https://www.youtube.com/watch?v=jJIO7aRXUCg\u0026amp;list=PLKtxx9TnH76QY5FjmO3NaUkVJvTPN9Vmg\u0026amp;index=4\u0026amp;pp=iAQB\"\u003ehow ASML builds EUV machines\u003c/a\u003e to \u003ca href=\"https://www.youtube.com/watch?v=nRJgvX6P8dI\u0026amp;list=PLKtxx9TnH76QY5FjmO3NaUkVJvTPN9Vmg\u0026amp;index=20\u0026amp;pp=iAQB\"\u003eMoore’s Law\u003c/a\u003e. His video on the end of Dennard’s Law is a particular standout:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"The End of Dennard Scaling\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/7p8ZeSbblec?list=PLKtxx9TnH76RKmJlFIfs7NumNp1RPNIQv\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eJon is about more than semiconductors though: he’s made videos about other tech topics like \u003ca href=\"https://www.youtube.com/watch?v=47ovT_hYlt8\u0026amp;list=PLKtxx9TnH76RKmJlFIfs7NumNp1RPNIQv\u0026amp;index=4\u0026amp;pp=iAQB\"\u003eThe Tragedy of Compaq\u003c/a\u003e, and non-tech topics like \u003ca href=\"https://www.youtube.com/watch?v=19l7WkkwYi8\u0026amp;list=PLKtxx9TnH76RKmJlFIfs7NumNp1RPNIQv\u0026amp;index=5\u0026amp;pp=iAQB\"\u003eJapanese Whisky\u003c/a\u003e and \u003ca href=\"https://www.youtube.com/watch?v=vKBY-MJFJ4A\u0026amp;list=PLKtxx9TnH76RKmJlFIfs7NumNp1RPNIQv\u0026amp;index=6\u0026amp;pp=iAQB\"\u003eTaiwan convenience stores\u003c/a\u003e. In short, Jon is an intensely curious person who does his research, and we are blessed that he puts in the work to share what he learns.\u003c/p\u003e\n\n\n\n\u003cp\u003eI am blessed most of all, however. Over the last year Jon has been making \u003ca href=\"https://www.youtube.com/@Stratechery\"\u003eStratechery Articles into video essays\u003c/a\u003e and \u003ca href=\"https://www.youtube.com/@SharpTechPodcast\"\u003ecutting clips for Sharp Tech\u003c/a\u003e; he did a great job with one of my favorite articles of 2024:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Enterprise Philosophy and The First Wave of AI\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/3cgjWHzFdj4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAnd now, starting today, Stratechery Plus subscribers can get exclusive access to Asianometry’s content in newsletter and podcast form. The \u003ca href=\"https://www.youtube.com/@Asianometry\"\u003eAsianometry YouTube Channel\u003c/a\u003e will remain free and Jon’s primary focus, but from now on all of his content will be simultaneously released as a transcript and podcast. Stratechery Plus subscribers can \u003ca href=\"https://asianometry.passport.online/member/\"\u003ehead over to the new Asianometry Passport site\u003c/a\u003e to subscribe to his emails, or to add the podcast feed to your favorite podcast player.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd, of course, subscribe to \u003ca href=\"https://www.youtube.com/@Asianometry/\"\u003eJon’s YouTube channel\u003c/a\u003e, along with \u003ca href=\"https://stratechery.passport.online/member/plan/4ycW4SE71Cy6ryrijywbTG\"\u003eStratechery Plus\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-20T16:16:26Z",
  "modifiedTime": "2025-01-20T16:25:48Z"
}
