{
  "id": "0bc9340a-4a80-47fb-b2f1-f1068900dc3c",
  "title": "Wealthy Americans have death rates on par with poor Europeans",
  "link": "https://arstechnica.com/health/2025/04/wealthy-americans-have-death-rates-on-par-with-poor-europeans/",
  "description": "Some wealthy Europeans have death rates 35 percent lower than the richest Americans.",
  "author": "Beth Mole",
  "published": "Thu, 03 Apr 2025 22:18:20 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "America",
    "europe",
    "health disparity",
    "life expectancy",
    "lifespan",
    "New England Journal of Medicine",
    "wealth",
    "wealth inequality"
  ],
  "byline": "Beth Mole",
  "length": 1791,
  "excerpt": "Some wealthy Europeans have death rates 35 percent lower than the richest Americans.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "\"The findings are a stark reminder that even the wealthiest Americans are not shielded from the systemic issues in the US contributing to lower life expectancy, such as economic inequality or risk factors like stress, diet or environmental hazards,\" lead study author Irene Papanicolas, a professor of health services, policy and practice at Brown, said in a news release. The study looked at health and wealth data of more than 73,000 adults across the US and Europe who were 50 to 85 years old in 2010. There were more than 19,000 from the US, nearly 27,000 from Northern and Western Europe, nearly 19,000 from Eastern Europe, and nearly 9,000 from Southern Europe. For each region, participants were divided into wealth quartiles, with the first being the poorest and the fourth being the richest. The researchers then followed participants until 2022, tracking deaths. The US had the largest gap in survival between the poorest and wealthiest quartiles compared to European countries. America's poorest quartile also had the lowest survival rate of all groups, including the poorest quartiles in all three European regions. While less access to health care and weaker social structures can explain the gap between the wealthy and poor in the US, it doesn't explain the differences between the wealthy in the US and the wealthy in Europe, the researchers note. There may be other systemic factors at play that make Americans uniquely short-lived, such as diet, environment, behaviors, and cultural and social differences. \"If we want to improve health in the US, we need to better understand the underlying factors that contribute to these differences—particularly amongst similar socioeconomic groups—and why they translate to different health outcomes across nations,\" Papanicolas said.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-2166998513-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003e\u0026#34;The findings are a stark reminder that even the wealthiest Americans are not shielded from the systemic issues in the US contributing to lower life expectancy, such as economic inequality or risk factors like stress, diet or environmental hazards,\u0026#34; lead study author Irene Papanicolas, a professor of health services, policy and practice at Brown, said in a news release.\u003c/p\u003e\n\u003cp\u003eThe study looked at health and wealth data of more than 73,000 adults across the US and Europe who were 50 to 85 years old in 2010. There were more than 19,000 from the US, nearly 27,000 from Northern and Western Europe, nearly 19,000 from Eastern Europe, and nearly 9,000 from Southern Europe. For each region, participants were divided into wealth quartiles, with the first being the poorest and the fourth being the richest. The researchers then followed participants until 2022, tracking deaths.\u003c/p\u003e\n\u003cp\u003eThe US had the largest gap in survival between the poorest and wealthiest quartiles compared to European countries. America\u0026#39;s poorest quartile also had the lowest survival rate of all groups, including the poorest quartiles in all three European regions.\u003c/p\u003e\n\u003cp\u003eWhile less access to health care and weaker social structures can explain the gap between the wealthy and poor in the US, it doesn\u0026#39;t explain the differences between the wealthy in the US and the wealthy in Europe, the researchers note. There may be other systemic factors at play that make Americans uniquely short-lived, such as diet, environment, behaviors, and cultural and social differences.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If we want to improve health in the US, we need to better understand the underlying factors that contribute to these differences—particularly amongst similar socioeconomic groups—and why they translate to different health outcomes across nations,\u0026#34; Papanicolas said.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-03T22:18:20Z",
  "modifiedTime": "2025-04-03T22:18:20Z"
}
