{
  "id": "0dc31bac-7ddf-4c16-a122-117d04651811",
  "title": "Is The Velvet Sundown an AI-generated band?",
  "link": "https://mashable.com/article/the-velvet-sundown-ai-generated-band",
  "description": "The Velvet Sundown is raising suspicions of being an AI-generated band, with no online presence, bad lyrics, and odd promo images.",
  "author": "",
  "published": "Sat, 28 Jun 2025 16:04:47 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Christianna Silva",
  "length": 4777,
  "excerpt": "AI is tricking us on Spotify now, too.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "AI is tricking us on Spotify now, too. Is this band real? Am I alive? Credit: Spotify screenshot / The Velvet Sundown Have you heard of The Velvet Sundown? It's kind of like The Velvet Underground, except The Velvet Underground is definitely real, and the jury is still out for The Velvet Sundown.The band's photos look remarkably AI-generated — too clean, not quite textured enough, oddly inhuman, yet it has racked up more than 372,000 monthly listeners on Spotify. Their bio reads that they are \"quietly spellbinding\" and uses those odd, unspecific metaphors so common in AI-generated text, like comparing the band's music to \"a scent that suddenly takes you back somewhere you didn't expect.\"Their bio purports that it was formed by singer and mellotron player Gabe Farrow, guitarist Lennie West, synth player Milo Raines, and percussionist Orion \"Rio\" Del Mar. None of them has ever been interviewed. And, not that a social media account is necessarily proof of life, but none of them have an Instagram, TikTok, or Facebook account — and neither does the band itself. In fact, none of the band members seems to have a single shred of an internet presence. The song credits on Spotify are also a bit suspicious. Most artists will have multiple people in the credits, but the credits on Spotify for every single one of their songs are \"Performed by,\" \"Written by,\" and \"Source\" by The Velvet Sundown. There is no producer listed.\"The Velvet Sundown aren't trying to revive the past,\" their Spotify bio reads. \"They're rewriting it. They sound like the memory of a time that never actually happened... but somehow they make it feel real.\" Mashable Trend Report Are they playing with us? Listening to the band myself, it does sound AI-generated — the lyrics lack specificity, and the music itself lacks depth. But it's also kind of... fine music? Suno and Udio, two of the most-used AI-powered music generators, have been \"churning out soulless slop\" for about two years, as Music Radar reported, and if The Velvet Sundown is using those tools to create music, it might be one of the first more successful uses of the platforms' ability to \"capture the public's imagination in the way that many of the technology's critics had feared.\"On YouTube, there’s an entire ecosystem of AI-generated music. One standout is AI For The Culture, a channel that reimagines rap and R\u0026B tracks as vintage Motown or blues cuts — complete with fictional artists and AI-generated bios to match. One particularly notable example: an AI-rendered cover of Future’s \"Turn On the Lights,\" which was later sampled by rapper JPEGMAFIA on his latest album.While the band hasn't confirmed that it's AI-generated, it has also done little to prove people wrong. Music Radar says it \"bears the unmistakably lo-fi veneer of a Suno creation.\" One Reddit post says there isn't a \"shred of evidence on the internet that this band has ever existed.\" But, in the end, there's no actual proof that the band is generated by AI, and therein lies the struggle. When AI music becomes this difficult to catch, whose job is it to catch it? The trouble has led some users to post their disappointment in Spotify for not informing listeners that the band is or is not AI-generated. \"We should be boycotting Spotify by now,\" one person said on Reddit, and another person responded by pointing out that the band is also on Apple Music and Amazon Music. Spotify did not immediately respond to a request for comment from Mashable. Christianna Silva is a senior culture reporter covering social platforms and the creator economy, with a focus on the intersection of social media, politics, and the economic systems that govern us. Since joining Mashable in 2021, they have reported extensively on meme creators, content moderation, and the nature of online creation under capitalism. Before joining Mashable, they worked as an editor at NPR and MTV News, a reporter at Teen Vogue and VICE News, and as a stablehand at a mini-horse farm. You can follow her on Bluesky @christiannaj.bsky.social and Instagram @christianna_j. These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy.",
  "image": "https://helios-i.mashable.com/imagery/articles/02tcxYrrdSKrTjWEGzIpCwF/hero-image.fill.size_1200x675.v1751121940.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                \n    \n    \n        \n    \u003cp\u003eAI is tricking us on Spotify now, too.\u003c/p\u003e\n    \n\n    \n\u003c/div\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \n    \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/02tcxYrrdSKrTjWEGzIpCwF/hero-image.fill.size_1248x702.v1751121940.png\" alt=\"The Velvet Sundown is an AI-generated band on Spotify. Maybe.\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/02tcxYrrdSKrTjWEGzIpCwF/hero-image.fill.size_400x225.v1751121940.png 400w, https://helios-i.mashable.com/imagery/articles/02tcxYrrdSKrTjWEGzIpCwF/hero-image.fill.size_800x450.v1751121940.png 800w, https://helios-i.mashable.com/imagery/articles/02tcxYrrdSKrTjWEGzIpCwF/hero-image.fill.size_1248x702.v1751121940.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIs this band real? Am I alive?\u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: Spotify screenshot / The Velvet Sundown\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eHave you heard of The Velvet Sundown? It\u0026#39;s kind of like The Velvet Underground, except The Velvet Underground is definitely real, and the jury is still out for The Velvet Sundown.\u003c/p\u003e\u003cp\u003eThe band\u0026#39;s photos look remarkably AI-generated — too clean, not quite textured enough, oddly inhuman, yet it has racked up more than 372,000 monthly listeners on Spotify. Their bio reads that they are \u0026#34;quietly spellbinding\u0026#34; and uses those odd, unspecific metaphors so common in AI-generated text, like comparing the band\u0026#39;s music to \u0026#34;a scent that suddenly takes you back somewhere you didn\u0026#39;t expect.\u0026#34;\u003c/p\u003e\u003cp\u003eTheir bio purports that it was formed by singer and mellotron player Gabe Farrow, guitarist Lennie West, synth player Milo Raines, and percussionist Orion \u0026#34;Rio\u0026#34; Del Mar. None of them has ever been interviewed. And, not that a social media account is necessarily proof of life, but none of them have an Instagram, TikTok, or Facebook account — and neither does the band itself. In fact, none of the band members seems to have a single shred of an internet presence. \u003c/p\u003e\n\n\u003cp\u003eThe song credits on Spotify are also a bit suspicious. Most artists will have multiple people in the credits, but the credits on Spotify for every single one of their songs are \u0026#34;Performed by,\u0026#34; \u0026#34;Written by,\u0026#34; and \u0026#34;Source\u0026#34; by The Velvet Sundown. There is no producer listed.\u003c/p\u003e\u003cp\u003e\u0026#34;The Velvet Sundown aren\u0026#39;t trying to revive the past,\u0026#34; their Spotify bio reads. \u0026#34;They\u0026#39;re rewriting it. They sound like the memory of a time that never actually happened... but somehow they make it feel real.\u0026#34;\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"trend-report\"\u003e\n        \u003cp\u003e\n            Mashable Trend Report\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eAre they playing with us? Listening to the band myself, it does sound AI-generated  — the lyrics lack specificity, and the music itself lacks depth. But it\u0026#39;s also kind of... fine music? \u003ca href=\"https://mashable.com/article/ai-music-startup-suno-admits-using-copyrighted-music-says-its-fair-use\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eSuno\u003c/a\u003e and Udio, two of the most-used AI-powered music generators, have been \u0026#34;churning out soulless slop\u0026#34; for about two years, \u003ca href=\"https://www.musicradar.com/music-tech/theres-not-a-shred-of-evidence-on-the-internet-that-this-band-has-ever-existed-this-apparently-ai-generated-artist-is-racking-up-hundreds-of-thousands-of-spotify-streams\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eas Music Radar reported\u003c/a\u003e, and if The Velvet Sundown is using those tools to create music, it might be one of the first more successful uses of the platforms\u0026#39; ability to \u0026#34;capture the public\u0026#39;s imagination in the way that many of the technology\u0026#39;s critics had feared.\u0026#34;\u003c/p\u003e\u003cp\u003eOn YouTube, there’s an entire ecosystem of AI-generated music. One standout is \u003ca href=\"https://www.youtube.com/@AIForTheCulture\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eAI For The Culture\u003c/a\u003e, a channel that reimagines rap and R\u0026amp;B tracks as vintage Motown or blues cuts — complete with fictional artists and AI-generated bios to match. One particularly notable example: an AI-rendered cover of Future’s \u0026#34;Turn On the Lights,\u0026#34; which was later \u003ca href=\"https://www.whosampled.com/sample/1203502/JPEGMAFIA-Either-on-or-Off-the-Drugs-AI-for-the-Culture-Turn-on-the-Lights/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003esampled by rapper JPEGMAFIA\u003c/a\u003e on his latest album.\u003c/p\u003e\u003cp\u003eWhile the band hasn\u0026#39;t confirmed that it\u0026#39;s AI-generated, it has also done little to prove people wrong. Music Radar says it \u0026#34;bears the unmistakably lo-fi veneer of a Suno creation.\u0026#34; \u003ca href=\"https://www.reddit.com/r/antiai/comments/1ljqpiq/this_band_is_100_ai/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eOne Reddit post says\u003c/a\u003e there isn\u0026#39;t a \u0026#34;shred of evidence on the internet that this band has ever existed.\u0026#34; \u003c/p\u003e\u003cp\u003eBut, in the end, there\u0026#39;s no actual proof that the band is generated by AI, and therein lies the struggle. When AI music becomes this difficult to catch, whose job is it to catch it? The trouble has led some users to post their disappointment in Spotify for not informing listeners that the band is or is not AI-generated. \u0026#34;We should be boycotting Spotify by now,\u0026#34; \u003ca href=\"https://www.reddit.com/r/truespotify/comments/1lk9ag2/ai_band_in_recommended_with_300k_monthly_with/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eone person said on Reddit\u003c/a\u003e, and another person responded by pointing out that the band is also on Apple Music and Amazon Music. \u003c/p\u003e\u003cp\u003eSpotify did not immediately respond to a request for comment from Mashable.\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/defaults/fallback-thumbnail.fill.size_100x100.1.png\" alt=\"Mashable Image\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eChristianna Silva is a senior culture reporter covering social platforms and the creator economy, with a focus on the intersection of social media, politics, and the economic systems that govern us. Since joining Mashable in 2021, they have reported extensively on \u003ca href=\"https://mashable.com/article/trauma-memes-are-the-therapy-we-can-afford\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003ememe creators\u003c/a\u003e, \u003ca href=\"https://mashable.com/article/content-moderation-changing-language-fast\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003econtent moderation\u003c/a\u003e, and \u003ca href=\"https://mashable.com/article/strava-anxiety-joy-self-surveillance\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003ethe nature of\u003c/a\u003e \u003ca href=\"https://mashable.com/article/why-social-media-sucks-instagram-meta-backlash\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eonline creation\u003c/a\u003e \u003ca href=\"https://mashable.com/article/productivity-aesthetics-scams\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eunder capitalism\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eBefore joining Mashable, they worked as an editor at NPR and MTV News, a reporter at Teen Vogue and VICE News, and as a stablehand at a mini-horse farm. You can follow her on Bluesky @\u003ca href=\"http://christiannaj.bsky.social\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003echristiannaj.bsky.social\u003c/a\u003e and Instagram @\u003ca href=\"https://www.instagram.com/christianna_j/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003echristianna_j\u003c/a\u003e.\u003c/p\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-28T16:04:47Z",
  "modifiedTime": null
}
