{
  "id": "1079d53c-2be5-424d-920e-15ce25792c38",
  "title": "Napster was just acquired for $207 million by a 3D tech company",
  "link": "https://mashable.com/article/napster-acquired-207-million-infinite-reality",
  "description": "Music streaming service Napster was just acquired for $207 million by a virtual reality company.",
  "author": "",
  "published": "Tue, 25 Mar 2025 21:42:19 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Matt Binder",
  "length": 2782,
  "excerpt": "Infinite Reality appears to have big plans for the streaming music service that revolutionized the industry in the early 2000s.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Napster was only around for roughly three years before it shut down in 2002. The company faced multiple lawsuits from major record labels and bands like Metallica, as Napster's users freely shared music and other files online. Yet, despite its short life, the peer-to-peer file-sharing platform changed the music industry forever, altering how consumers acquired music and ushering in what eventually would become modern-day music streaming.Now, 25 years after its launch, Napster was just acquired for a whopping $207 million by a 3D tech company called Infinite Reality. And the company says it has big plans for the Napster brand.\"With this acquisition, we're expanding and reimagining Napster, empowering artists with new audience monetization and engagement capabilities, underpinned by iR’s immersive technology, AI-powered tools, and audience network,\" Infinite Reality said in a statement. In a press release, Infinite Reality laid out some of its plans for Napster, including 3D virtual spaces where \"fans can enjoy virtual concerts, social listening parties, and other immersive and community-based experiences.\" Infinite Reality also plans to let artists sell physical and virtual merchandise and event tickets through the platform. Additionally, the company wants to provide brand sponsorship opportunities for artists. Mashable Light Speed While most internet users know the infamous peer-to-peer version of Napster, the brand has been chugging along for the past decade as a legal, paid music streaming service. Ironically enough, of all the music streaming services, Napster reportedly pays artists the most per play. According to Infinite Reality, current Napster CEO Jon Vlassopulos will continue with his role as CEO of the company.“By acquiring Napster, we’re paving a path to a brighter future for artists, fans, and the music industry at large,” said Infinite Reality cofounder and CEO John Acunto. \"I firmly believe that the artist-fan relationship is evolving, with fans craving hyper-personalized, intimate access to their favorite artists, while artists are searching for innovative ways to deepen connections with fans and access new streams of revenue. We’re creating the ultimate music platform where artists can thrive in the next wave of digital disruption.”Major video game franchises like Fortnite have held virtual in-game concerts with great success over the past few years. Other platforms like Turntable.fm, which went viral in 2011 before shuttering in 2013, failed in their attempts to create communities out of digital music streaming. It'll be interesting to see how Infinite Reality approaches the concept, especially as Mark Zuckerberg's Meta backtracks on their own \"metaverse\" concept.",
  "image": "https://helios-i.mashable.com/imagery/articles/06MWMUjnEdsVTVvcvwvFjbQ/hero-image.fill.size_1200x675.v1742933445.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eNapster was only around for roughly three years before it shut down in 2002. The company faced multiple lawsuits from major record labels and bands like Metallica, as Napster\u0026#39;s users freely shared music and other files online. Yet, despite its short life, the peer-to-peer file-sharing platform \u003ca href=\"https://mashable.com/article/early-internet-amazon-netflix-napster\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003echanged the music industry forever\u003c/a\u003e, altering how consumers acquired music and ushering in what eventually would become modern-day music streaming.\u003c/p\u003e\u003cp\u003eNow, 25 years after its launch, Napster was just \u003ca href=\"https://www.theinfinitereality.com/news/infinite-reality-acquires-iconic-music-service-napster\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eacquired\u003c/u\u003e\u003c/a\u003e for a whopping $207 million by a 3D tech company called Infinite Reality. And the company says it has big plans for the Napster brand.\u003c/p\u003e\u003cp\u003e\u0026#34;With this acquisition, we\u0026#39;re expanding and reimagining Napster, empowering artists with new audience monetization and engagement capabilities, underpinned by iR’s immersive technology, AI-powered tools, and audience network,\u0026#34; Infinite Reality said in a statement.\u003c/p\u003e\n\u003cp\u003eIn a press release, Infinite Reality laid out some of its plans for Napster, including 3D virtual spaces where \u0026#34;fans can enjoy virtual concerts, social listening parties, and other immersive and community-based experiences.\u0026#34; Infinite Reality also plans to let artists sell physical and virtual merchandise and event tickets through the platform. Additionally, the company wants to provide brand sponsorship opportunities for artists.\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eWhile most internet users know the infamous peer-to-peer version of Napster, the brand has been chugging along for the past decade as a legal, paid music streaming service. Ironically enough, of all the music streaming services, Napster reportedly pays artists \u003ca href=\"https://lifehacker.com/which-music-streaming-service-is-the-most-ethical-1848508243\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003ethe most per play\u003c/u\u003e\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eAccording to Infinite Reality, current Napster CEO Jon Vlassopulos will continue with his role as CEO of the company.\u003c/p\u003e\u003cp\u003e“By acquiring Napster, we’re paving a path to a brighter future for artists, fans, and the music industry at large,” said Infinite Reality cofounder and CEO John Acunto. \u0026#34;I firmly believe that the artist-fan relationship is evolving, with fans craving hyper-personalized, intimate access to their favorite artists, while artists are searching for innovative ways to deepen connections with fans and access new streams of revenue. We’re creating the ultimate music platform where artists can thrive in the next wave of digital disruption.”\u003c/p\u003e\u003cp\u003eMajor video game franchises like \u003ca href=\"https://mashable.com/article/fortnite-marshmello-concert\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003e\u003cu\u003eFortnite\u003c/u\u003e\u003c/em\u003e\u003c/a\u003e have held \u003ca href=\"https://mashable.com/article/ariana-grande-fortnite-rift-tour\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003evirtual in-game concerts\u003c/u\u003e\u003c/a\u003e with great success over the past few years. Other platforms like \u003ca href=\"http://Turntable.fm\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eTurntable.fm\u003c/u\u003e\u003c/a\u003e, which went viral in 2011 before shuttering in 2013, failed in their attempts to create communities out of digital music streaming. It\u0026#39;ll be interesting to see how Infinite Reality approaches the concept, especially as Mark Zuckerberg\u0026#39;s Meta backtracks on their own \u0026#34;metaverse\u0026#34; concept. \u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-25T21:42:19Z",
  "modifiedTime": "2025-03-25T21:42:24Z"
}
